{"user_rating": 4.5, "review_count": 1455, "name": "Sheraton on the Park, Sydney", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We stayed 3 nights in the Sheraton on the park, our room was spacious and nice, probably a bit old and not as modern as other refurnished sheraton but it was ok, nothing to complain. The location is very good, 10 minutes walking from the Opera House, 10 minutes from Darling Harbour...you don't need to take any public transport if you want and you are just in front of the Hyde Park, so it's nice going there for a stroll.", "title": "Well located Hotel", "user": "Lorelaina", "date": "May 30, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 31149646}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Breakfast is quite good although a bit the same every day.", "title": "Nice Hotel, just something missing", "user": "Willjd", "date": "May 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 30674839}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "Our stay was our honeymoon and we expected a kind os upgrade of present at the check in, probably they are more into business travellers.", "title": "Perfect location, great for lone travellers", "helpfulness": 2, "user": "S_G.UK", "date": "May 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 30600440}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "There are some PC with free internet at the business center, so you don't need to pay.", "title": "Get Breakfast in Your Rate", "user": "zoshi", "date": "May 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30409843}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "Very nice hotel opposite Hyde Park and a 10 minute walk away from Circular quay through the shopping streets.", "title": "A happy weekend", "user": "Bruceoz", "date": "May 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 30128638}, {"rating": 5.0, "title": "Great stay", "text": "I stayed here last month for a conference for four nights. I'm a SPG member so I had a great room on the 17th floor, which was very spacious and facing the park. My sister and I LOVED the comfortable beds, and they helped us get over jetlag. The room and bathroom were clean. The digital safe in the closet didn't work when we got there, but the hotel replaced it immediately when it couldn't be fixed, and we used it throughout our stay. There's high speed internet for a fee, but bring your own wire. My one gripe about the room was the bathroom doors. They slide together to shut, but they don't close completely--leaving a half inch open gap. There's a business center (a few computers with a b/w printer), but I needed some presentations printed in color ASAP. I talked to Cameron (manager on duty) and he printed them for me for a fee. Staffs were nice to us and answered all my questions. The hotel is in a great location and most attractions are walking distance. We walked to Darling Harbour in 10-15 minutes, and the Sydney Opera House wasn't too far either.", "user": "bookworm720", "date": "May 15, 2009", "id": 30013539}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "It was my first time to Sydney, and this hotel was great. It was an easy walk to some of the tourist sites, and I really enjoyed jogging in the park in the morning. I'd stay here again next time I'm in Sydney.", "title": "Great location, nice hotel", "user": "born4hotels", "date": "May 1, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 29128315}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Stayed at the Sheraton on the Park for a long weekend away without the kids. This was the perfect hotel for us with beautiful, spacious, quiet and luxurious rooms in a superb location in the heart of Sydney. Walk to Darling Harbour or Circular Quay, beautiful Hyde Park across the road and shopping just around the corner. We got a deal off their own website ( stay 3/ pay 2 ) so all up this hotel was hard to fault. Would definitely use again!", "title": "Stunning hotel - Great location", "user": "Fourkiwis", "date": "April 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 28818586}, {"rating": 3.0, "stay_parameters": "Stayed February 2009, traveled solo", "text": "Terrific location and room and would stay here again when I go to Sydney, but they need to work on the service a bit, it wasn't what I would have expected from a Sheraton. The hotel is opposite Hyde Park and I walked all over the place, it is wonderfully central. My room was lovely and the bathroom was huge. I initially scoffed at the Sheraton blurb about their special 'sweetsleeper bed' but then was smitten with the most comfortable bed I've ever slept in. The electric blinds were also great. On the downside the service was not great. I got sent away by a surly reception staffer when I arrived as the room wasn't ready . After a couple of hours I got into my room but then my bags had vanished and there was no-one answering the reception or service desk phones for a considerable time. After I had got through I had to ring back again as my bags still didn't arrive. It wasn't really anything major but there is just a lack of attention to service. That being said, I loved the room and location and the price was really reasonable so would defintely go back. Avoid room service too - they put a delivery charge on top of the already high prices - $15 all up for a $1 yoghurt is a bit ridiculous", "title": "Great place but need to work on service", "helpfulness": 1, "user": "HerMadjesty", "date": "April 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 5.0}, "id": 28472493}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "This 4 day break was a surprise for my husband's 50th birthday and couldn't have been better. We were treated very well from the moment we set foot on the pavement outside. We had booked 2 rooms with city views as these are the only interconnecting rooms and we were not disappointed. Only 1 was ready when we arrived but the other was ready within 30 minutes. The rooms were very spacious, well appointed and clean - this was maintained throughout the stay. The location is difficult to beat - close to the park, the shops and good eating options. I booked direct with the hotel and the process was efficient and friendly providing various options and suggesting the best value for money - better than could be obtained on other sites including dicsount hotel room sites. The breakfast which was included [$42 per person] was fresh and expansive regardless of the time we arrived, including one morning close to closing time. We were never hurried or given the impression that it was too late or time to go. The free wireless internet in the business centre and lobby was useful for our 18 year old who had university work to complete. The proximity to the shops was excellent for our 15 year daughter. As we have been to Sydney many times before we were not looking to do tourist sites but it is within walking distance to circular quay and the rocks where we had dinner one evening . Our son left the cover for his 10\" laptop in the business center and it was promptly returned.", "title": "a wonderful 4 day break for all", "helpfulness": 3, "user": "tfamilytravellers", "date": "April 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28295886}, {"rating": 5.0, "title": "truly.. a home away from home", "text": "Sheraton on the Park is truly a home away from home.the decor were good and the room have a home atmosphere. their \"sweet sleeper bed\" is so soft and comfortable and they have pillows to die for. Check-in was quick and easy, my room is immaculate and the staff were very friendly. i was particularly impressed with cecille from housekeeping. she was such a lovely lady and really does her job properly. she makes sure that my room is really clean and is up to a 5 star hotel standard. i've never encountered such professionalism from the hotel's staff. the hotel's staff are so warm and helpful. i was looked after when i was in that hotel. i would definitely recommend this hotel. and i'll be back there next year.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "December 5, 2005", "id": 4162585}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "My company booked me here for an eleven-day business stay. It's quite the schmancy hotel - well-appointed, lots of amenities, and the high prices to match. The in-room internet fee is astronomical, so I brought my laptop to the lobby for free access. (They have computers in the lobby for those without their own, which is nice.) The laundry fee is high too, so I brought my one load to a laundromat down Elizabeth Street for a third of the cost. (I know, it's a business trip and my company was paying, still, the frugal traveler in me wouldn't justify the cost.) And they charge you for use of the fitness center!!! At these prices, you should have unlimited access.", "title": "Very Comfortable for Business Trip, Wouldn't Book for Personal", "helpfulness": 5, "user": "Martrese", "date": "August 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 18505737, "likes": {"liked": "— Nicely designed, comfortable rooms", "disliked": "— High cost"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "I experienced a few technical difficulties. . .my room safe failed to work twice and it was annoying to have to keep calling for assistance. And my room key stopped working half-way through my stay - ugh. Again, for these prices, this shouldn't happen.", "title": "Really liked this hotel", "helpfulness": 5, "user": "WhiteChinaCat", "date": "July 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 18084457, "likes": {"liked": "— There were just no problems.", "disliked": "— Stripey head boards on beds (if that's the worst thing I can say, things are pretty good)"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008", "text": "The location is ok - it's a 15 minute walk to the harbor and there aren't a lot of restaurants in the immediate vicinity. I walked to Darlinghurst a few nights for a MUCH better food selection - I had some great meals there. (Try Fish Face - divine.) I'm a runner, so I mapped out a few really nice runs from the hotel - through the Botanic Garden (which is very close), along the harbor, over the bridge & back. In that respect, the location was great.", "title": "Friendly staff, great room", "helpfulness": 4, "user": "amaunette", "date": "July 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 17928583, "likes": {"liked": "— Comfortable bed", "disliked": "— Quite pricey"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2006, traveled on business", "text": "If you have the funds or if someone else is footing the bill, go for it. But the next time I'm vacationing in Sydney, I'd rather stay in a less expensive hotel in Darlinghurst, which is much more alive with activity & dining choices.", "title": "Really good hotel in great location", "helpfulness": 2, "user": "Yibbert", "date": "July 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 17905907, "likes": {"liked": "— The Bed", "disliked": "— Air conditioning was not very strong"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "I stayed in this hotel 10 years ago, and hated it. However, this time I was at a conference in the hotel. I found the hotel remarkably improved. Location is excellent (clearly that hasn't changed), views from Park Rooms were charming (looking over the newly cleaned cathedral spires through large trees). Staff could not have been more helpful. Food in restaurants was delicious. Nice bars to meet friends. And finally - no \"stuff-ups\". If you stay in hotels all the time, you'll know what I mean. There were no problems with room key cards, reservation was correct, correct room provided, room service excellent and fast, no unauthorised charges on account, no problems with air-conditioning etc.", "title": "OK - but you could get better value elsewhere", "helpfulness": 1, "user": "dancemonkey", "date": "July 13, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 17830917, "likes": {"liked": "— Friendly staff", "disliked": "— Additional charges"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2005", "text": "There are a lot of reviews you can read here, so I'm not going to waste a lot of your time mixing words. All I would do is expand on the other negative reviews about this one star motel. I still can't believe I allowed them to take my money for what they delivered. They lived up to the Sheraton reputation. I guess only have myself to blame, as I was warned. Do yourself a favour, stay at the Four Seasons.", "title": "Terrible", "helpfulness": 5, "user": "Hellooooooo", "date": "February 17, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 4467922}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "I stayed one night in this hotel with a group of us spread across 3 rooms. I was a little wary after reading many negative reviews here, but can happily report that the service I received was at the very least, acceptable for a 5 star hotel (I should know, I work in a good one). The only service I received which anyone could possibly gripe about was the slightly slow bar service, and this was acceptable as we had just ordered a large and tricky round of cocktails (around a 25 minute wait as the bar was certainly not quiet).", "title": "One of the Better Ones...", "helpfulness": 6, "user": "panjack", "date": "January 29, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4394473}, {"rating": 2.0, "title": "A sad farewell to the Sheraton on the Park", "text": "The City View (who needs a view?)(fairly recently refurbished) rooms were great, large, spacious, beds fantastic! The bathrooms here are like Hyatt bathrooms with nice fittings and black marble throughout!", "helpfulness": 8, "user": "A TripAdvisor user", "date": "January 18, 2006", "id": 4360467}, {"rating": 5.0, "stay_parameters": "Stayed November 2005, traveled on business", "text": "During my stay, we encountered no problems at all, and all of the staff were friendly and efficient. This is one of the better 5 star Sydney hotels I have stayed in, and will return....", "title": "First-class hotel", "helpfulness": 8, "user": "JCW", "date": "December 19, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4251882}, {"rating": 2.0, "stay_parameters": "Stayed March 2005, traveled on business", "text": "I found it rather entertaining to read all the reviews on the Sheraton on the Park at tripadvisor.com, simply because of their disparity! I stayed in the hotel every year since 2001 for at least one week and I finally tend to agree with those, who were disappointed. I once rated this hotel as one of the best five star hotels, but year by year the dissatisfaction was growing. Rates were going up and became totally unacceptable. Don't get me wrong: It's still a good hotel with nice, spacious rooms, an elegant lobby and a proper health club. But the staff is absolutely clueless, not very well trained and simply not on the level that you would expect from a five star hotel. Service in this hotel deteriorated incredibly over the years. For example they now charge you for using the gym!?!? You wouldn't expect that in a hotel, where you're paying 400 AUD per night, wouldn't you? When you're checking in, nobody asks you, if you prefer a smoking or a non-smoking room. These are basics, well known by every front desk manager or receptionist in every Holiday Inn all over the world... When I stayed there for the last time in November 2005, I really felt cheated. I will definitely come back to Sydney, one of the most vibrant cities in the world I know. But I surely will not spend a penny at the Sheraton on the Park.", "title": "I didn't realise this was a training hotel", "helpfulness": 10, "user": "Amazingplanet", "date": "December 15, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "service": 1.0}, "id": 4245062}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "I stayed with my wife & 17 month old son for 8 days at the hotel. We arrived early at 10AM and didn't expect any room to be ready. They had one ready in 30 min and held our bags while we tool a stroll in the beautiful Hyde park across the street.", "title": "5-star hotel in a great location", "helpfulness": 1, "user": "bertman815", "date": "April 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28121492}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "The room was huge, with a flat screen TV, DVD player, separate bath and shower, big bathroom, walk-in closet, refrigerator (no microwave), and safe. They even delivered a complimentary crib for our baby and power transformer to convert to US voltage for our use throughout our stay. Bed was one of the most comfortable ever. Free newspaper every morning. We had a city view with a view of the Sydney Tower. We used the rooftop indoor swimming pool and spa, which has awesome views of the city. Free internet PCs and wireless in the lobby area.", "title": "EXCELLENT HOTEL, SOME SMALL IMPROVEMENT NEEDED", "helpfulness": 1, "user": "Kramax", "date": "April 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27891350}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The hotel is in a central location, walking distance to Chinatown, shopping areas, Circular Quay for the ferries, the Rocks, Opera House, and Botanical gardens. The concierge was extremely helpful in giving us directions to many places and best way to get there on foot or by bus or trolley. Woolworth is only 2 blocks away, where you can buy cheap water and groceries.", "title": "A four day visit to Sydney", "helpfulness": 1, "user": "jambomccotter", "date": "April 7, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 5.0}, "id": 27546895}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "The only thing that went wrong was that our room key card was demagnetized multiple times and I had to go to front desk to get a replacement.", "title": "Quality Hotel", "helpfulness": 1, "user": "Jimbo1000001", "date": "April 2, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 27265758}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "Overall, we had a great stay and couldn't be more satisfied. It is great for young children. The entire staff was very nice and helpful. It is truly 5-star.", "title": "Fantastic Location!!", "helpfulness": 1, "user": "DunedinKailey", "date": "March 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 27198597}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We chose a great value package with bed, breakfast and parking for the time we stayed (1 night) and our parking was validated for a bit longer to give us extra shopping time in Pitt street.", "title": "Great value package - room, b/fast and parking.", "helpfulness": 2, "user": "ChrisandDave0", "date": "March 31, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 27147066}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "Late checkout (midday) was also extremely handy. Breakfast buffet was of decent quality with lots of fresh fruit and a wide selection of hot/cold food. The location of the Sheraton is also fantastic, a two minute walk from the main city shopping area and the park opposite provides a great view.", "title": "Sheraton on the Park - Impressed", "helpfulness": 1, "user": "BarryEmm", "date": "March 27, 2009", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 26906630}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "We didn't choose room service for dinner - although it was very tempting. Instead, a 10 minute walk to Darling Harbour was perfect.", "title": "Definitely deserves good reviews", "helpfulness": 1, "user": "Seven_Continents", "date": "March 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 26009773}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "All up - a top stay. WIll definately stay again when next in Sydney.", "title": "Mmmm.....", "helpfulness": 1, "user": "annieNgeorge", "date": "March 10, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 25973845}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "I stayed at Sheraton on the Park for 2 nights for a conference/business trip. Room was excellent - large and clean with superb fittings etc. I suspect it may have been recently renovated. Room was fitted out with Large Flat Screen LCD TV, corner couch and large desk which was great for doing work in the room. The bathroom was sensational. Large again and fitted out with dark marble. Huge shower and bath and everyone was spotlessly clean.", "title": "Lovely Hotel - Perfect Location", "user": "BevHowarth", "date": "March 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25964700}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled on business", "text": "Fantastic hotel, in a very good place in downtown Sydney facing Hyde Park and close to the main commercial streets and shopping center, as well as the main atraction as the Opera House, Habour, etc.", "title": "Great Hotel", "user": "RobertoChile", "date": "December 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22777860, "likes": {"liked": "— Warm ambience and great location", "disliked": "— expensive restaurants"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The rooms are wide with modern and warm furnitures. The bathroom is very wide for the normal bathroom at the hotels, ahving shower and tub.", "title": "Great value weekend stay at the Sheraton", "helpfulness": 1, "user": "sandluc", "date": "December 9, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 22568460, "likes": {"liked": "— Great value and big comfy rooms", "disliked": "— Sometimes the valet and lobby are exceptionally busy"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled solo", "text": "The hotel has a nice swimming pool at the highest floor with a wonderful view of the city and the harbour.", "title": "Great Service", "helpfulness": 1, "user": "TravellingThoughts", "date": "November 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 22275718, "likes": {"liked": "— service", "disliked": "— no free internet in the room"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Recommended for business or tourism.", "title": "Abova beyond", "helpfulness": 1, "user": "P-Fogg-1873", "date": "November 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22155776, "likes": {"liked": "— high quality of the hotel, location", "disliked": "— nothing! loved everything!"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2008, traveled with friends", "text": "I spent 3 nights at the Sheraton on the Park over a weekend and got their fantastic \"'3 nights for the price of 2'' deal. Having stayed here 5 years ago it was great to see they haven't let their rooms slip - infact it was great to see they have added the \"must have'' big LCD tv.", "title": "It was OK - nothing special", "helpfulness": 1, "user": "btna", "date": "November 24, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 22133083, "likes": {"liked": "— Fantastic shower and comfortable beds.", "disliked": "— Lack of attention to detail which I would expect from a 5 star hotel."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008", "text": "The Sheraton is very nice and plush, and brilliantly located. Check-in was swift but there was fairly long queue at check out with a few extra staff just standing around - not too helpful when you lingered too long at the fantastic breakfast buffet.", "title": "Lovely Hotel!", "user": "sydney_beach_gal", "date": "November 20, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 3.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 22015812}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Room was gorgeous and spacious, and the bathroom was lovely. I like it when 5 star hotels give you high-end brand name toiletries (l'occotaine etc) but the sheraton brand is fine. Had a lovely night and the bed was divine.", "title": "Sheraton in the City...", "helpfulness": 2, "user": "Bren07", "date": "October 20, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 21026073, "likes": {"liked": "— Great location, friendly staff", "disliked": "— No complimentary water and fee to enter leisure club"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "The breakfast buffet was impressive - sets the standards for all other hotel breakfasts in sydney! Except for plunger rather than expresso coffee :( But the omelette chef is fantastic!", "title": "Good Hotel", "helpfulness": 1, "user": "tania m", "date": "October 11, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 4.0}, "id": 20797411, "likes": {"liked": "— Everything -just great value for the centre of Sydney", "disliked": "— I couldn't stay longer"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "Reasonable value. Probably not quite five stars but pretty close!", "title": "Great hotel with a great location", "helpfulness": 3, "user": "hulahunny", "date": "October 9, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 20741972, "likes": {"liked": "— Large rooms and location", "disliked": "— Service was a little spotty but nothing major"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Booked Sheraton on the Park in Sydney for 5 nights. Firstly the location is great, right across from the park, around the corner from the main shopping street (Pitt Street). and about 15 minutes walk to Circular Quay / Harbour Bridge/ Opera House / Rocks. This was not my first time to Sydney so I had an idea of where I wanted to stay location wise and this hotel certainly did not disappoint.", "title": "Great hotel", "user": "Andy123Northampton", "date": "October 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 20591063, "likes": {"liked": "— Location, quality of hotel", "disliked": "— Building work opposite, quiet though"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "I stay here for work on occassions. The rooms are lovely and the service is always friendly. The beds are extremely comfy and the bathrooms are 100 times larger than the wentworth. The only negative would have to be the prices in the bars and for room service. If you order room service you will pay an $8 delivery fee on top of the already very expensive prices. A coffee in the tea gallery will set you back around 7bucks and a beer is around $8.", "title": "Very Nice Hotel", "user": "countryNSWBam", "date": "September 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 20080536}, {"rating": 1.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "Apart from the prices its a lovely hotel!", "title": "very disappointed with service", "helpfulness": 4, "user": "dubaikate", "date": "September 14, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 5.0, "rooms": 3.0}, "id": 20050592, "likes": {"liked": "— leaving it", "disliked": "— gettign my room bill"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008", "text": "Location for this hotel is great but the service and attention was not Shereton. I travelled woth my 4 year old son off a long haul flight from UAE. On arrival room not ready and proceeded to hit me up for another night accomodation. Room service, telephone calls cost were over the top and inacceptable.", "title": "Good for business travellers, if they have their act together..!!", "user": "melbournelass", "date": "September 4, 2008", "detail_rating": {"front_desk": 1.0, "service": 3.0, "business": 4.0, "cleanliness": 4.0, "rooms": 3.0, "location": 4.0}, "id": 19777662, "likes": {"liked": "— location to cbd", "disliked": "— officous little man at reception"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Asked for my breakfast be be delivered to my room as my son was ill from the flight..wouldnt do that so it took my son to vomit on their restaurant floor to get some attention. This hotel is a business Hotel mon-fri deal not for international travellors or anyone that expects some service and attention (yes most of us). I am very disappointed as I am originally from Sydney.", "title": "Excellent choice", "user": "HappyTravellers25", "date": "August 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19363742, "likes": {"liked": "— Excellent location and brilliant service", "disliked": "— Nothing"}}, {"rating": 4.0, "title": "Very nice hotel", "text": "Did I complain well yes but it fell on typical Australian deaf ears. Suggestion..try Hilton !", "user": "DevMarc", "date": "August 22, 2008", "id": 19254036}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 5, "variance": {"poor": 57, "average": 114, "very good": 459, "terrible": 36, "excellent": 789}, "aka": "Sheraton On The Park, Sydney Hotel Sydney", "slim_ranking": 0.0972972972973, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Enjoy a warm Australian welcome at the five-star Sheraton on the Park. Located directly opposite Hyde Park, the tree-lined oasis in the heart of Sydney, our hotel is a great destination to connect with friends, family, and colleagues. From the moment you walk through our grand entrance, you will enjoy all that our Sydney hotel has to offer."}