{"user_rating": 3.5, "review_count": 1986, "name": "Sheraton Princess Kaiulani", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "This property is great! We stayed in Oahu from 12/22-12/24 and 12/28-12/30. The first part we stayed at another hotel, and the second half we stayed at the Sheraton. I would recommend it to ANYONE! We had a reservation at another hotel but called a few days before to see if they had a cancellation. They did, so we booked and cancelled our other reservation. Just a tip: If you are going to stay, join the Starwood Preferred Guest program. The rate was originally $330 and with AAA it was a bit cheaper (I forget the rate exactly) but with SPG it was $215. *This was around the holidays when the prices are rasied*", "title": "You MUST stay here!!", "helpfulness": 2, "user": "nycchick81", "date": "January 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12234777}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The front desk agent who checked us in, Chie, was very friendly and also gave us recommendations on places to go nearby.", "title": "Overall, a very good vallue", "helpfulness": 4, "user": "tlynch19", "date": "December 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 11654477, "likes": {"liked": "— The location"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Our room was spacious, clean and attractively decorated. There are also nice balconies. Our room overlooked the pool and there as nightly entertainment that we could watch from our room (or downstairs by the pool if you choose!).", "title": "Stay At Your Own Risk", "helpfulness": 7, "user": "HighlyDisappointed", "date": "December 13, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 11526781, "likes": {"liked": "— Check-out and going home.", "disliked": "— The theft of my personal property with no concern or compensation by the Sheraton Princess Kaiulani Management."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The hotel is located right in the center of things and there are many restaurants nearby.", "title": "don't believe the naysayers!", "helpfulness": 1, "user": "sexyman1234", "date": "December 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11525331, "likes": {"liked": "— the location", "disliked": "— nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "The ONE thing I didn't like about the hotel was that the pool closed so early (at 6pm!) It would have been nice to be able to have a night swim.", "title": "Do NOT stay at this hotel..Its a disappointment", "helpfulness": 3, "user": "HolidayWatchdog", "date": "December 8, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 11324746}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We recently stayed 4 nights here and were pleased. Our room faced west with mountain view and were pretty outdated. Did not feel like a Sheraton quality, but we did get a good rate. They also were nice at check-in and found us a room right away. The parking was easy and convenient and included in the $13/day resort fee. This also included 2 water bottles, which was convenient. There was a small fridge in room where we kept other juices, beers, etc. Free wi-fi in room also included in resort fee. The Kaiulani's location is fantastic -- right in the heart of Waikiki and a close walk to everything. The pool area was nice and seemed to get quite a bit of sun, unlike some properties, where the pools end up in the shade half the time. Pleasantly surprised with this stay, but don't get too excited about the tired rooms, though the hotel maids are thorough and good about replacing towels. We had an issue with water leaking out of the shower onto the bathroom floor, so just used towels to clean up. Not a huge deal.", "title": "Great location, nice staff", "helpfulness": 2, "user": "steptravel", "date": "May 31, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 110828510}, {"rating": 4.0, "stay_parameters": "Stayed May 2011", "text": "My daughter and I arrived around 1:30pm and they had a room available for us, but it only had one king size bed, which we had asked for two double beds. The front desk check and found that they could move us the next day, and not to unpack, and in the morning let them know when they could move us. We let them know we were going to adventure out for the day and when we came back our new keys were waiting at the front desk and the room had our luggage waiting for us. The room was always clean, the view was amazing, the employees were always friendly, and I highly recommend the Splash Bar, the food and drinks were great and one of the employees named Angie was the best server we ever had.", "title": "One of the best hotels", "helpfulness": 1, "user": "DROSE61", "date": "May 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 110130707}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "My husband and I travelled with another family couple to Oahu for a couples getaway. We all stayed at the Sheraton Princess Kaiulani hotel. This hotel has a great location on Waikiki, across from the Ala Moana Surfrider and 1 block from Waikiki beach. The location is great as the International Marketplace is a few stores down the street and the hotel itself is surrounded by stores. We had a partial ocean view balcony room that oversaw the pool below. At night you can hear tropical music playing below from the hotel's restaurant by the pool and the entertainment from the busy Waikiki strip and International Marketplace. It was really breezy during our stay so there was no need for A/C. The room was very compact and not the most comfortable beds I've ever slept in. I felt they were a little outdated and should be replaced although they didnt disturb our sleep that much. The room decors along with the beddings and furniture are also outdated. They really need a new modern makeover or even fresh paint cuz the room felt as if you were more so in Motel 6 than a Sheraton hotel? The tv was ok, kinda blurry on some channels at times but we barely used it only to check the weather/news. Bathroom is very compact and no counter space at all, but room and bathroom was always clean thanks to housekeeping.", "title": "Conveniently located in the heart of Waikiki Beach", "helpfulness": 2, "user": "thaijasmine", "date": "May 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 110066263}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Staff was always friendly upon check in and check out, had no problems. We all checked in early, our room wasnt ready and they even offered to have the Bellhop hold our luggages so we can have some lunch and come back. That was nice. The lobby was always very clean and beautiful. It really represented Princess Kaiulani well as her pretty paintings were displayed everywhere and I enjoyed looking/reading all the history the hotel had to offer. There's even a activities desk downstairs if anyone was interested in booking Luaus, Parasailing, jet ski, etc. Daily there would be local vendors in the lobby that sold unique gifts and crafts for purchase so that was interesting to me. We never went to the pool as we were on the beach everyday but the pool was pretty small. And the restaurant downstairs had a nice breakfast buffet although its a little overpriced so note: get the breakfast buffet to go its cheaper $10! haha", "title": "You get what you pay for....", "helpfulness": 2, "user": "jemailak", "date": "May 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 1.0, "value": 3.0, "sleep": 2.0, "rooms": 1.0, "location": 5.0}, "id": 109669920}, {"rating": 1.0, "stay_parameters": "Stayed June 2010", "text": "Best things I liked about the hotel was they gave you beach towels and beach chairs to take with you to the beach so that was a big plus for us! Also i forget, but at certain times of the day the hotel had waiters that came to the beach at a certain location, and you can place drink orders with them. (although we never made it) And it was extremely helpful that we got two free Hawaiian water bottles to take with us to the beach everyday, so we hardly bought water bottles. Thanks (note:These perks are what you get for paying a daily $14 resort charge) The only thing I disliked about the hotel was using the hotel's Internet and printer in the lobby, although its was free to use for 15-20 mins? a day, you must pay attention that its only within a 24hrs period eventhough you did not use all the minutes they give you. Since I didnt know that I was charged and extra $5. And the only reason we ever used their computers was cuz our free wi-fi in our room was always way too slow.", "title": "Go somewhere else.", "helpfulness": 2, "user": "I3putt2", "date": "May 22, 2011", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 109267965}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Stayed for three nights and loved every minute.", "title": "Great location and great for the price (comparitively)", "helpfulness": 5, "user": "AussieBecs", "date": "November 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21489219, "likes": {"liked": "— Location", "disliked": "— Safe being charged at $3.25 a day!"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We actually booked a standard room with 2 double beds and was not expecting much at all. When checking in we were advised that we'd been upgraded to a pool view room with king bed.", "title": "Great Location, Great Staff, Everything Else Just So-So", "helpfulness": 4, "user": "GiaMia", "date": "October 14, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 20886032, "likes": {"liked": "— Location", "disliked": "— Noise"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled solo", "text": "We had room 712 and it was fabulous - great view of the pool, the Moana Surfrider across the street and also some ocean view.", "title": "Unremarkable", "helpfulness": 3, "user": "KK06", "date": "October 4, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 20607666}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The room was tastefully decorated and updated - had the most comfortable (king) bed I've ever slept in. Was like sleeping on a cloud. The room also had a small 2 seater couch, desk, wardrobe with iron and safe (at a charge!), TV and large mini fridge.", "title": "loved the sheraton", "helpfulness": 5, "user": "kingyEngland", "date": "October 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20568259, "likes": {"liked": "— everything", "disliked": "— nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The bathroom was smallish but lots of towels and shower over bath. The shower had good pressure but when filling the bath the water didn't seem to get hot enough.", "title": "good value, excellent location", "helpfulness": 3, "user": "checkm", "date": "September 27, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 20421426}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Used points to get this hotel so couldn't complain about the price. Good location for a place that is not on the beach. Open lobby around the pool with very friendly staff. But overall, this place is a little old. Elevators are musty. Bed was good. We were placed in the main building without a view. There was a taller building that may have been better. Overall, I would recommend this to people looking to save some money who don't want a newer facility. Services were very good however so and it's Waikiki, so don't stay too much in your hotel room anyway...", "title": "Older hotel", "user": "xpok", "date": "October 10, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 10062953}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Booked this hotel through the SPG site. We got a \"high ocean view room with a king bed\" in the Ainahua tower. We were on the 25th floor with what' I'd call a partial ocean view, since the hotel is a block from the beach and you can see the ocean only between two beachfront hotels. On the other hand, you can also see the hills and have a nice city view. The room and bathroom was clean and comfortable. Central location with stores and restaurants steps away. Concierge was knowledgeable and helpful. Yes, there was 'noise' but it was hawaiian music from street performers not horns or sirens or drunken screaming. It quieted down around 11pm, and was completely acceptable to us.", "title": "Good mid-budget hotel", "helpfulness": 4, "user": "avina", "date": "September 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10003400, "likes": {"liked": "— location, value", "disliked": "— no refrigerator or free internet"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "I was recently on business in Hawaii and stayed at the Sheraton Princess Kaiulani. I was extremely disappointed with the hotel. The room was small, overlooking the International Market on the 19th floor. The noise from the street level kept me up all night, and to my suprise prostitutes gathered outside the hotel enterance each evening. The hotel staff was unwilling to relocate me to a room with less noise, and when I addressed to prostitute issue, I was told \"we are a full service hotel\". Boy, what a image of the Sheraton hotel chain. I'm just glad I didn't have my children with me for this trip.", "title": "It Sure Isn't the Marriott!!!", "helpfulness": 4, "user": "Tanner95", "date": "September 10, 2007", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 8689389, "likes": {"liked": "— Breakfast", "disliked": "— Staff, Accomodations, Prostitutes at enterance of hotel"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "My husband and I travelled to Hawaii to celebrate our first wedding anniversary. We travelled from the U.K. and stayed in Vegas for 3 nights before going to Oahu. We were worried after making the booking and reading the reviews. So many people made negative comments. My husband even tried to change the hotel. We had been spoilt by the gllitz and glamour of the hotels Vegas had to offer. I thought our hotel in Hawaii was going to ruin our vacation. However, when we arrived at the Princess we were pleasantly surprised. The front desk were helpful. The rooms were cleaned well. Our room had a pool view. Every evening we would listen to the live Hawaiian music playing downstairs as we got ready to go out. Beautiful !. My husband loved the pineapples that were served to eat or as a juice. This took place daily at 2pm in the lobby. I loved chatting to the local Hawaiian people who came to sell souveniors. The Princess Kaiulani is in a fantastic location. Close to the shops, beach, restuarants. I see what people mean when they compare it to other Sheratons. However, it's good value for money and would suit those who would rather spend their money exploring the island that on a glitzy hotel. Hire a car, go on a submarine trip, climb diamond head. It's a paradise island, and for us was a trip of a lifetime.", "title": "Location, Location, Location", "helpfulness": 6, "user": "MrsC77", "date": "August 30, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 8580104, "likes": {"liked": "— Location", "disliked": "— Noise sometimes"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "My husband and I stayed at this Sheraton in the beginning of August. We did stay in the oldest wing. It was in need of updating.", "title": "Good for the money", "helpfulness": 3, "user": "miapia", "date": "August 27, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 8518092, "likes": {"liked": "— cleanliness, affordability", "disliked": "— has not been updated since early seventies"}}, {"rating": 4.0, "title": "Good value - efficient - good location", "text": "Surprised about some of the negative reviews. The room #2956 could do with some updating, but its decent enough - I've definitely had better 3* rooms in new hotels, but the Kaiulani easily possesses a 3-4* feel in the lobby.", "user": "LondonDEJ", "date": "December 2, 2007", "id": 11206660}, {"rating": 1.0, "stay_parameters": "Stayed November 2007", "text": "Great view from the room (top floor, facing Diamond Head).", "title": "Disgusting, horrible experience, filthy", "helpfulness": 2, "user": "mitchmu", "date": "November 28, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 11126588}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We've just booked our third stay at the Princess Kaiulani for the end of December 08.", "title": "Love staying here", "helpfulness": 2, "user": "MalibooNewYork", "date": "November 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22270917, "likes": {"liked": "— Everything", "disliked": "— The pool could be warmer."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "In 2002 for our 40th anniversary we stayed at the Hilton hawaiin village. It was nice but not very special. The staff in the restaurants and at the hotel were not friendly nor particularly helpful.", "title": "Absolutely fabulous!!", "helpfulness": 3, "user": "bubblejenuk", "date": "November 25, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 22161852, "likes": {"liked": "— Location & friendliness", "disliked": "— A small humming noise from the air con unit"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "When we booked our next trip, we stayed at the PK and were very pleased with everything. On our second visit, our room was upgraded and we were treated to a surprise bottle of sparkling wine.", "title": "Good average hotel in waikiki", "helpfulness": 2, "user": "altsavy", "date": "November 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "business": 1.0, "cleanliness": 5.0, "rooms": 4.0, "location": 5.0}, "id": 22115088, "likes": {"liked": "— Good location, low price", "disliked": "— no wireless, no hotel beach"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The entire staff is helpful and friendly. They go out of their way to make you feel welcome.", "title": "Book the cheapest room and get a 12\" tv", "helpfulness": 11, "user": "akworldtraveler", "date": "November 13, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 21809993, "likes": {"liked": "— location location location", "disliked": "— read the review"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "This hotel was fab! My husband and I are just back from Waikiki after staying for 5 nights here at the Princess Kaiulani. It is centrally located opp Waikiki beach and the staff were very helpul. The hotel was quiet, clean and spacious. We didn't eat in the hotel as it was rather expensive but the food looked gorgeous - we had to pass through the buffet area to get to the lift and the food was diff each night! The hotel had its own travel agent and tours for example to Pearl Harbour could be booked just the day before. The hotel's famous Polynesian Show was brill too. I just can't wait to go back.....", "title": "Great Place", "helpfulness": 2, "user": "WegaGal", "date": "November 7, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21637671, "likes": {"liked": "— Location, location, location, beds were very comfy", "disliked": "— Parking structure didn't have elevators"}}, {"rating": 1.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "In 2003, 2004 and 2006 we stayed at the ohana waikiki west and in 2007 across the street at the miramar, so we have seen different hotels. This yr was our 40th anniversary so thought we would stay in a little swankier place. What a disappointment. Like all the bad things the other reviewers wrote Id have to double it. First we are smokers, ya I know, and had requested a smoking room, which we got if we would have arrived on Sunday as planned but due to flooding on the big island we went to waikiki on Friday and conviently they had no smoking rooms but we sure could upgrade and get one. ( other hotel reviews on here people write all the time about a free upgrade) for a price. Thought maybe since it was our 40th they would give us one HUH they sure did for $25 a night (5 nights) so we took it. Got to the room and as one reviewer on here said what a disappointment that isnt the word. For what you are paying the room wasnt as nice as the ohana west and for twice the price. The wallpaper was coming loose from the wall in many places, if you looked where the floor met the walls, there was dirt and waste and the bathroom tile floor was a mess, grout was all dirty and corners dirty, the toliet was sitting on the floor at a angle and when you sat on it you thought that you had to hold on so you didnt fall off, There are no dressers just a small set of drawers not enough for one person in the closet, also in the closet was 2 bottles of water with the ice bucket the bottles had a sign on them only $4.25 each comeon high priced room and you have to pay $4.25 for a dollar bottle of water?? Your morning coffee isnt free either in the room, our coffee maker was screwed up open the lid to pour the water in and the hinges were broke so you had the lid in your hand, after the coffee was made there was no way you could remove the pot without opening the filter basket and the same trying to put the pot away. The mattresses have seen there better day and thought that I was going to fall out of bed several times the center is higher then the sides,. Unfriendly very unfriendly staff EXCEPT for the maids and bells very nice people, we went back to the room one day to put some purchases away and the maid was in the room. We told her what we wanted to do and she stopped her work moved the vacuum out in the hallway asked for our room key and shut the door and then used our key to open it, you dont find that at many hotels!!!!! Maid was very security minded. Now the good parts Location Location Location and when we upgraded it was called a ocean view room which it kind of was, you could see the ocean if you stood at the lanai railing but not if you sat in the chairs and the sun set between two hotels and it was very nice. Every day between 2 and 3 they give away free slices of pineapple in the lobby and they have 5 computers with internet that you can use for free. Have to wait your turn and sometimes that was 30 or 40 minutes. So for our 6th trip you can bet we wont be staying at the SPK I could write more but dont want to take up your time as I think you get the point, IT'S NOT WORTH THE MONEY!!!!!!!!", "title": "Save your money", "helpfulness": 4, "user": "cousin310", "date": "February 15, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 5.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 13579156, "likes": {"liked": "— LOCATION", "disliked": "— THE WHOLE PLACE DIRTY AND UNFRIENDLY"}}, {"rating": 2.0, "title": "Not what we were expecting:)So", "text": "We just returned home from staying 10 nights at the Sheraton Princess and have to admit, although it was an amazing location, we would never stay there again!!!!!!!! After our early morning flight there coming from the winter cold, we were expecting warm greetings when we arrived........ I mean, you would think the guest services could at least have a smile on their face when they say \"Aloha\"!? Instead, it almost seemed like we were just a complete hassle when we asked any form of question at all, nice, really nice:) So, we went about checking in and went up to our rooms to see how they were, and quite honestly it was a disappointment when we opened the door and realized we were paying a ridiculous amount for a VERY AVERAGE room:) Now, one thing I do have to admit, besides the awesome location, we did have an amazing view:) The next morning we thought it would be nice to attend the breakfast buffet in the Pikake Lounge, considering we had a bunch of family fly in to meet for a special occasion. After finding out it was $21.95 EACH, we decided to sit down anyways and enjoy the beautiful atmospshere (so we thought!) Not only were the servers painfully slow, they were among the RUDEST, CONDESCENDING INDIVIDUALS I have come across!!!!!!!!!!! After this experience left a bad taste in our mouth we almost didn 't want to return:) However, we thought we would give it another chance, once again, disappointment!!!!!!!! The only employees we want to give thanks to are the Bell Boys and the Housekeepers for actually smiling and acknowledging us on a daily basis:) We will return to Waikiki, just not to the Sheraton Princess:)", "helpfulness": 6, "user": "tink23Vancouver_BC", "date": "February 7, 2008", "id": 13369914}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "My husband and I and 2 kids 6 and 8 stayed here Jan. 2008. We were scared considering some of the reviews, but we really enjoyed our stay. The rooms were dated, and a little rough around the edges, but overall our room was very pleasent and clean. The room had a late 1980s feel. The staff was genuinely friendly and helpful. I can see how where you are located can affect your stay. We were in the Princess tower and our room overlooked the pool and the Westin Moana across the street. It was nice. There is pool entertainment noise at night, but we were so exhausted at night, it didn't bother us. Try to avoid street rooms at the lower levels due to bus noise.", "title": "We enjoyed our stay", "helpfulness": 11, "user": "rachellemb", "date": "January 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 13150116, "likes": {"liked": "— location, value", "disliked": "— dated, bus traffic"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "This is not a hotel for you if you if you are finicky about your room, or you like to spend a lot of time at your hotel, lounging at the pool, lingering over room service meals, and relaxing. This is not the place for honeymooners. The hotel has a small pool and a busy atmosphere and the rooms are for showering and sleeping. I personally found the atmosphere festive with a \"I'm on vacation!\" feel. We are active travelers, who are gone all day, and the room was perfect for us. The beds are comfortable.", "title": "First trip to Hawaii", "helpfulness": 6, "user": "meribor2", "date": "January 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 13145771, "likes": {"liked": "— Convenient location, griendly staff, fresh pineapple daily, complimentary beach towel use", "disliked": "— Noisy, lots of nickel-and-dime type additional charges, $15/day parking"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "I like the small Hawaiian touches the hotel provides. Flowers for you hair at the desk, which my daughter loved, pineapple slices and juice in the afternoon, lei making and hula lessons and craft sellers in the lobby and Hawaiian entertainment at night. Though sometimes the night entertainment was very lounge lizardy.", "title": "Great price for a Sheraton hotel close to the beach", "helpfulness": 3, "user": "AshVee", "date": "January 31, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 13136960, "likes": {"liked": "— The Chi Chi cocktails by the pool, the Sheraton bed", "disliked": "— the mould in the bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Overall, for the price, this was a good place to stay. The central location was great with the beach just across the street. Lots of restaurants and shops were adjacent and the short blocks made walking around town quite easy. The public bus and paid trolley stops were nearby. Bus/organized tours picked up right outside the hotel.", "title": "Good location, not for resort seekers", "helpfulness": 4, "user": "Drdonuttail", "date": "November 5, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 2.0, "location": 5.0}, "id": 10616541, "likes": {"liked": "— Location and price", "disliked": "— My room was located at the section with the noisiest roadside early morning traffic"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The pool was only open from 9am-6pm and there was no hot tub to warm up in after swimming at the beach. The hotel itself didn't have a gym, though the sister Sheraton hotel had facilities where you could pay to get in, if you wished. There were some restaurants at the hotel which we did not visit (there are so many around that were less expensive). At 2pm, the hotel offered \"pineapple carving\" where you could help yourself to fresh pineapple juice and pineapple slices (delicious) <even if you're not a guest, you could stroll in and induldge!>. During the day, there were a few vendors selling crafts by the pool.", "title": "Not Sure I can Add Much to what has been already said.", "helpfulness": 2, "user": "tpleck", "date": "October 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 10459337, "likes": {"liked": "— Location", "disliked": "— Room Size"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "The rooms were small, but very clean. I loved the pillows though I found the mattress a little firm. Our view towards the west wasn't much. Unfortunately, we were located on the 3rd floor which TOTALLY SUCKED BECAUSE IT WAS REALLY NOISY FROM 4AM unti 11PM. The people traffic wasn't bad - the problem was that shuttle buses and tour buses would idle outside on the street picking up passengers. Very annoying. We did ask for a room overlooking the poolside when we checked in, but apparently, they didn't have anything available. Because we wanted two adjacent rooms, we elected to stay where we were. Although some rooms had connecting doors, ours didn't so I guess that we should have requested new rooms on the second day. Oh bother!", "title": "So-so accommodations", "helpfulness": 2, "user": "freebyrd97", "date": "October 22, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 10225255, "likes": {"liked": "— Good location", "disliked": "— everything inside is old and grubby"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Hotel summary: good location, clean rooms, nice staff, and good price BUT request rooms towards the poolside and remember that this is not a resort hotel - there's so much to see in Oahu - don't plan to spend much time at the hotel. Go experience Hawaii!", "title": "loved it", "helpfulness": 6, "user": "clojoireland", "date": "October 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 10143332, "likes": {"liked": "— friendly staff,clean,pool and entertainment", "disliked": "— the food a little pricey"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We were very pleased with our hotel stay here. The location can't be beat. Waikiki is the best place within Oahu to stay in. Everything is so close and convenient. Buses run everywhere.", "title": "Excellent Location, Great Value!!", "helpfulness": 5, "user": "mxtang", "date": "April 11, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 7331829, "likes": {"liked": "— Free Internet Access And Newspapers", "disliked": "— small room"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "First off the location of this hotel was great because: we were among the first people to get off the shuttle from the airport and last people to be picked up. Nothing worst than taking a shuttle and be last to be dropped off or first to be picked up. If you have a car rental or can take a taxi then great for you but I'm sure most people would like to save where they can. Bad thing about car rental is that you have to pay for parking which can be expensive!", "title": "dissapointed", "helpfulness": 2, "user": "sunloverYorkshire", "date": "April 9, 2007", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 2.0, "service": 2.0, "rooms": 2.0}, "id": 7300805, "likes": {"liked": "— the weather wish i was there", "disliked": "— the bathroom"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Check in and out was quick. Wasn't a long line at all. People weren't bubbly but friendly. They had free internet access downstairs and 3 different FREE newspapers! SWEET!!", "title": "Great price for the location", "helpfulness": 4, "user": "Canadiantravels", "date": "March 30, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 7254508, "likes": {"liked": "— Location", "disliked": "— Older hotel"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "Our room was on the eighth floor. Room was fairly small, not that much longer than the bed but they did have a full size mirror which made it longer and a nice balcony. AC was a bit noisy, not horrible but definitely not one of your quiet newer models. We didn't lose any sleep due to that though.", "title": "WONDERFUL!! Don't let other reviews scare you away!!", "helpfulness": 5, "user": "lindaf1967", "date": "March 29, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7245227, "likes": {"liked": "— Location", "disliked": "— vanity size"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Room was clean and fairly well kept. Our tub's drainage was a bit slow though. I find that's an issue in quite a few hotels.", "title": "No Complaints Here", "helpfulness": 4, "user": "cookmonger", "date": "March 24, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 7216572, "likes": {"liked": "— Location", "disliked": "— Age of the Hotel"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "Well the final leg of the trip and in Honolulu for 6 nights. Mid morning flight from Maui to Oahu & wow shock horror - allowed to check in at 12.20 p.m. - top marks Sheraton !!! - It is a big hotel so I guess there is always rooms available.", "title": "Average hotel but good value for money !!", "helpfulness": 2, "user": "UncleDom", "date": "May 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 107829496}, {"rating": 3.0, "stay_parameters": "Stayed April 2011", "text": "Allocated room on the 7th floor in the main building, (not the newer tower) with pool view & partial ocean view, not bad really for $125 a night in Waikiki beach. Okay sized room, a tad dated & worm but well looked after & very clean. Bed was very comfortable as Sheraton beds normally are. Blackout blinds so no light at 6 a.m. - good marks", "title": "Must try harder!", "helpfulness": 1, "user": "Gabs_Monkey", "date": "May 10, 2011", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 107726108}, {"rating": 1.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "Bathroom was a bit old but very clean & useable. Plenty of towels & soaps. Fridge in room & coffee makers with 2 lots of coffee which was replaced every day. Resort fee was a steal at $12, which included free parking for the duration in the multistorey car park next to the hotel ( a relief really not to be driving around hunting for a space) 2 x 500 ml bottles of water, replaced every day without fail & 20 minutes of internet time on the computers in the lobby. Overall very good value. There was also a fitness room if you wanted to use it, it seemed ok. Maid service in the morning tended to start at 9 so Do not disturb Sign night before if you are a slow riser.", "title": "Horrible place", "helpfulness": 1, "user": "trishthedish100", "date": "May 7, 2011", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 107219337}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Did not have breakfast at the hotel as it was not included in rate but there are lots of ABC stores & coffee shops nearby. The location of the hotel is fab, opposite The White Lady Sheraton & very near to all the shops & restaurants. Ideal. Pool area was fine, a little busy sometimes & it is very near the street but acceptable. Pool towels were large & great for the beach.", "title": "Let me down but it's cheap, so I'd probably stay again", "helpfulness": 2, "user": "jlo939", "date": "May 6, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 107177122}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Would recommend to stay again. Beware at night of the parallel street - Kuhio Avenue, it is a bit colorful, lots of ladies of the night wandering around, a bit imitidiating.", "title": "OK, but don't go if you don't like pigeons sharing your breakfast", "helpfulness": 2, "user": "jomcduff", "date": "May 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 107044233}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Just for the location, the Sheraton Princess should be highly considered as a hotel for Waikiki. The Sheraton is in an L configuration with the patio, pool and performance area in the open space to form a rectangle on Kalakaua Avenue, the main street of Waikiki. The best part of Waikiki Beach is just across the street and east or directly through the Moana Surfrider, about 25 yards. The International Marketplace is just west of the hotel and other major shopping centers are within a few blocks.", "title": "Excellent Value and Locationl in Heart of Waikiki", "helpfulness": 3, "user": "jfoote", "date": "January 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 12868146, "likes": {"liked": "— Quality of Hotel and Location", "disliked": "— Parking Fee"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "While advertised as a three-star property, this hotel should definitely should be rated higher. The lobby is open-aired, well-staffed and the room was in excellent condition. We were upgraded from the lowest priced room to a front location overlooking the pool, Kalakaua Avenue and over the palm trees, the ocean. The room contained a king bed, sofa and dresser/desk. The balcony was small but both sliding doors could be opened to make it part of the room.", "title": "Good Hotel, Great Locaton", "helpfulness": 3, "user": "Clover1998", "date": "January 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 12794825, "likes": {"liked": "— Location to the beach.", "disliked": "— Nothing."}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "The evening buffet was expensive but we ordered ala carte at the bar at a more reasonable price. Entertainment is provided each night from 6:30-9:30 in the form of a trio with dancers. As a promo for a Legends show, performers like Elvis, Chuck Berry and Whitney Houston also drop in to sing.", "title": "Terrific location...", "user": "janechejj", "date": "January 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 12566471, "likes": {"liked": "— Very comfortable beds and pillows! Free internet access.", "disliked": "— No complaints"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "My just husband stayed at the PK for a business trip for 2 weeks. I came out to join him for the last week of his trip. I had 3 days to explore by myself because he was at work. I loved the hotel, we were on the 26th floor facing Diamond Head. Our view was spectacular. I had plenty to do and to go see. There a tons of places to eat all around the hotel. I usually got coffee in the morning and walked along the beach and came back to the hotel to hang out by the pool. The staff by the pool were so nice, especially Angie. You can just lay by the pool and have lunch and cocktails brought right to your lounge chair. The hotel and grounds were immaculate. Our room was so clean, the maids really took care of cleaning every corner of the room and balcony. They have fresh plumeria flowers for your hair at the hotel desk every morning. A chef cut fresh pineapple each afternoon for the guests in the lobby. You can get anything your heart desires within walking distance to the hotel. I walked to the Honolulu Zoo and the Aquarium, which isn't to far down the beach. You can rent surf boards across the road at the beach or an go on an outrigger ride. The pool has chairs you can borrow to take to the beach too, that was great! I just loved it there and recommend this hotel to anyone who is out to have a great vacation.", "title": "Best time ever", "helpfulness": 1, "user": "Roxyforme", "date": "July 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17421626, "likes": {"liked": "— I loved the pool scene", "disliked": "— Price of parking was high"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We didn't want to spend too much on a hotel room because we were only there for 1.5 days (2 nights). The hotel \"upgraded\" us to a partial ocean view room. The Westin across the street completely blocked any chance of our view of the ocean. There was a lot of outside noise (band playing in the courtyard of the hotel) that was directly outside our room.", "title": "You get what you pay for", "user": "l0vet0travel6", "date": "July 1, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 4.0, "location": 5.0, "value": 3.0, "rooms": 3.0}, "id": 17397626, "likes": {"liked": "— location", "disliked": "— noise outside room balcony"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Great location...very close to the beach, shopping/dining is walking distance.", "title": "Great hotel", "helpfulness": 1, "user": "MakeYouHumble!", "date": "June 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16970168, "likes": {"liked": "— location", "disliked": "— nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "The little contact we had with the hotel staff was average.", "title": "Keep looking", "helpfulness": 1, "user": "saints-girl", "date": "June 10, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 16819565, "likes": {"liked": "— The nightly entertainment by the pool", "disliked": "— the room had no sound insulation what so ever."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2005, traveled with family", "text": "We stayed here for our first 2 nights in Hawaii after a long flight from New York. The tower is a great location - not on the beach, but if you're only here for a short stay, you probably won't spend too much time on crowded Waikiki Beach anyway. And if the beach is your thing, it's only a block away. We stayed on the 27th floor - get a high floor if you can. The views are spectacular from the balcony. The staff is friendly - easy check in and check out, and the concierge was very helpful in getting dinner reservations at local restaurants for us. This hotel met all expectations, and even exceeded others with how good the breakfest buffet was. I don't think I'd ever spend a significant amount of time in Honolulu - the north side of Oahu and the other islands are really what Hawaii is all about. But for a short stay after a long flight, this hotel is awesome.", "title": "Nice Hotel", "user": "Renegade08", "date": "June 5, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 16708076, "likes": {"liked": "— Location", "disliked": "— n/a"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "My boyfriend had never been to Hawaii and I have. I wanted to be right in the center of Waikiki so that we had a plenty of entertainment and didn't have to travel far. i thought it would be a good introduction for him. The hotel is SO CLOSE to the beach. Only a block away. The mall was a short walk and the Intl Market is right next to the hotel. Here was what was disappointing: the hotel and rooms are terribly outdated. There were stains in our carpet, the lights in the bathroom were florescent as well as outdated and small. I felt that it was was very cheap, if not cheap looking. Our room faced the garage but if we wanted a view, we'd have to pay an extra $50.00 per night. We were there for 7 nights. Not interested in that. We were hearing a swoosh sound at night and morning and would wake us up at night and finally concluded it was the elevators. This surprised us as we didn't feel like we were THAT close to them. The pool closed at 7:00pm which was a downer and there is no hot tub. The \"nightlife entertainment\" was silly at best. The hotel hired ukelele players singing Niel Diamond and John Denver songs in the lobby at night. The crowd was over 60 or full of families. What interest is this for young couples? The hotel had closed the pool at 5:00pm one evening, much to our disappointment, and hired elderly ladies dressed in neon colored bodysuits to do a small performance in the pool. It was very silly as it seems they were imitating dying swans dancing to instrumental music!!!! We'd rather have the pool to ourselves. The good things: they provide a service that allows you to take towels from the pool area to the beach and they come twice in the day to find you on the beach and give you fresh fruit and water. The buffet breakfast was fresh and plentiful. You can get a box and pay only $10.00 for takeaway. There were daily activities in the lobby like pineapple carving, making your own lais, jewelry and photography sellers and so on. This would be a great hotel for families and older folks who are interested in a place to sleep with attractions nearby not for a one of a kind experience, and definitely not for couples looking for a romantic getaway.", "title": "Very average, cheesy with great location", "helpfulness": 2, "user": "seekerofnewplaces", "date": "May 20, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 109111664}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Me and my Husband stayed at Sheraton Princess Kaiulani for 6 days. We were here celebrating our 5 yr anniversary and his birthday. Had a wonderful experience at this hotel! It was in a perfect location right next to the international market and right in the heart of waikiki. We were on the 9th floor in the main wing. Our room was a little small and the bathroom was a little out dated. Our room view was out looking the parking lot. Wasnt a very pleasant view. We called down to the front desk to see if we could have a room with a balcony. When we book our flight and hotel through expedia it showed that the standard room came with a balcony. Since it was both our first time in hawaii we didnt know what to expect. Having a balcony would have been nice but it wasnt that big of a deal. Kim at the front desk said it would cost us $40 a night just to upgrade so we didnt bother. We came to hawaii to go out and not stay in our hotel room. My husband and I would go down to the splash bar to get a few drinks during happy hour. It was really nice and relaxing. All the staff were friendly! We are already planning another trip to hawaii in dec for my birthday and will def consider staying at this hotel again.!", "title": "Couldnt have ask for a better Anniversary!!!!", "helpfulness": 2, "user": "jordynn0115", "date": "May 16, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 108535548}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "I recently stayed at this hotel and really enjoyed it. It is such good value for money, its in an excellent location and the staff were very friendly and willing to help with anything. I had a pool view room which was great, I loved sitting on the lanai at night listening to the music and I also had a pretty good view of the ocean which I didn't expect! I would definitely stay here again and would highly recommend to others!", "title": "Excellent experience", "user": "jennie_2", "date": "May 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108364549}, {"rating": 4.0, "title": "Great place to stay", "text": "I stayed at the Sheraton Princess Kaiulani for seven nights. After reading all the reviews of this hotel I wasn't expecting much. I couldn't of been happier with hotel and their staff. Everyone was very nice and helpful with anything I asked. The room was nice and clean, it had a refrigerator, iron, balcony and the maid came everyday. The location can't be beat, you are right in the middle of everything, the beach, restaurants, shopping and nightlife. I went on several excursions and they picked me up at the hotel or across the street. The shuttle to the airport was only $9.00 and left every half hour. Parking was included in the resort fee as was Internet access in my room. I never ate at the hotel because it is way to expensive, but Dukes is practically right across the street. I plan to go back with my wife and another couple, I am going to stay at this hotel again without a doubt..", "helpfulness": 1, "user": "Waldo406", "date": "May 13, 2011", "id": 108096627}, {"rating": 1.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "I will never stay at this hotel again. I've been staying here since I was a little kid, but haven't been for the past 4 years. Wow, how it has changed in 4 years. Besides the 144 sq ft of a box they put us in, the service is horrible. The people at this hotel treated us like [...] the whole time we stayed here. We had a waitress who was extremely rude who told us they have a 1 drink minimum to sit in the bar area. 1 drink minimum?!?! Maybe it was the way we looked? This is a 2 star hotel at best, who charges a minimum drink order just to sit in the bar/lounge area. Ridiculous! Then, on our last night here, we woke up several times to the drunk guy in the next room pounding and kicking the walls and door. Security was called a couple times and they did come up, but it didn't really help. Then when we tried to get a late checkout because drunko next door kept us up all night, they have no record of it and are only willing to extend it 1 hour. I am very upset with the service we've received here and how this place has gone downhill. It needs a major upgrade and renovation, which probably hasn't been done since the Reagan administration. The only thing it really has going is the central location. Overall? If you like second class treatment, the late 80's non intentional nostalgic look of a hotel, a cheap hotel with a good location across from the beach then this is it. Just don't eat at the restaurant or get anything but a beer from the bar. Of the over 20 restaurants we ate at in Waikiki on our trip, this was the only one that had bland food and watered down drinks. Take my advice, check out the other hotels in the area with similar pricing.", "title": "Old hotel with second class service", "helpfulness": 3, "user": "EastBayBallaz", "date": "May 12, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 107982046}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "We had a corporate rate which was $109/night for a double-occupancy non-smoking room facing the pool (room 710). This building is the shorter tower which runs parallel to the ocean.", "title": "Quite Basic", "helpfulness": 4, "user": "Kmalia", "date": "May 29, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 16478797, "likes": {"liked": "— Beds", "disliked": "— Lack of valet, walking up 5 flights of stairs to get to my car"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We stayed there for six nights and found the room to be clean and comfortable, but, as many mentioned, there are some issues which may make me decide to stay somewhere else in the future.", "title": "Had a great time!", "helpfulness": 1, "user": "cmock", "date": "May 28, 2008", "detail_rating": {"front_desk": 2.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 16466005, "likes": {"liked": "— view and location", "disliked": "— needs to be updated"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "PROS", "title": "Good Value", "user": "Kaimanas_Mom", "date": "May 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 16184226}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "- Beds very comfortable", "title": "Princess Kaiulani", "user": "Flipflopqueen12", "date": "May 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 16075222, "likes": {"liked": "— The view of Waikiki Beach", "disliked": "— Dinner"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "- Rooms kept very clean", "title": "great location, nickel and dimed for amenities, room decent but unexceptional", "helpfulness": 1, "user": "krdkrd", "date": "May 11, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 15936673, "likes": {"liked": "— convenience to Waikiki beach", "disliked": "— nickel and dimed for amenities, nothing stands out other than good location"}}, {"rating": 4.0, "title": "Location is great", "text": "When I saw the AC unit I was a little afraid of leaving it on all night. It was that old. But, I must say, the room was large and imaculate. Maybe we just got lucky with housekeeping for the time we were there. I am very particular with cleanliness of rooms! I usually always call the front desk on my first entering a room. The room was very reasonable compared to other hotels in the area. We just came off a 7 day cruise, and wanted to see Oahu because the ship really did not stay any amount of", "helpfulness": 3, "user": "Gamblergirl", "date": "July 30, 2007", "id": 8255679}, {"rating": 3.0, "stay_parameters": "Stayed January 2007, traveled with friends", "text": "time there. I could not afford to spend a great deal. The location is great . The beach is a block away, and all the good restaraunts are in the area. We went to the Luau at The Royal Hotel. Not to be missed. The staff was great at this hotel. We did not have to leave for the airport until 6:00., 7 hours after check out. We stayed at the hotel, used the pool, had a light supper and then was given the key to the \"Hospitality Suite\" where we were able to shower and change. . My experience there was very favorable.", "title": "good location, okay rooms", "helpfulness": 3, "user": "elchang", "date": "July 27, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 8245270}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Just returned from our vacation in Paradise...!!! After reading the reviews, I was afraid that we had booked the wrong hotel. I am very picky but for the price you cannot go wrong. We were on the 10th floor in the Ainahua tower. Room overlooked the pool and ocean. Beautiful view morning and night, I never heard the street noise or music and I am a very light sleeper. Besides, the music is beautiful and you are in Hawaii!!! The room was clean but small but that was okay. The bathroom was small as well and could have been a little cleaner. The bathtub took a little while to drain. Beds/pillows were very comfortable and usually I cannot sleep except in my own bed with my own pillows. There is a refrigerator and a safe. (they did not charge $3.25 a day for safe) No it is not a 5 star but for the price, it is a steal!!!! Everything you needed!!!", "title": "Much Better than Expected", "helpfulness": 3, "user": "Puchalski", "date": "July 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8232386, "likes": {"liked": "— Location and Price", "disliked": "— Onsite restaurants were unappealing"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Hotel staff was helpful and courteous...except for the parking garage staff, they got a little irritated with us,,,we lost our parking pass once and forgot it once,,,not happy with us at all. Oh, well!!", "title": "Decent hotel, great location", "helpfulness": 3, "user": "smlworldtraveler", "date": "July 24, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 8229515, "likes": {"liked": "— The view from our balcony on the 11th floor", "disliked": "— You have to pay to use the wi-fi internet connection for your own computer"}}, {"rating": 4.0, "title": "Nice view perfect location", "text": "We have stayed 5 nights in middle of May. Hotel was nicer than my expectation. We got high ocean view 20 some floor and we could see diamond head, and ocean.", "helpfulness": 6, "user": "FL87", "date": "June 9, 2007", "id": 7817714}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Hotel room looked new and bathroom was good size. ( not like other people were saying )", "title": "Not a bad hotel", "helpfulness": 7, "user": "Toadman", "date": "June 5, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 7779407, "likes": {"liked": "— Location", "disliked": "— Noise from the streets, other rooms"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Location was perfect. We paid $127/night through expedia, and for the money could not do any better.", "title": "Awesome location!", "helpfulness": 15, "user": "sk84fungirl", "date": "May 26, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 7700931, "likes": {"liked": "— location", "disliked": "— prefer separate shower and bathtub"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "I will stay here again, and recommend to others.", "title": "Would stay here again", "helpfulness": 4, "user": "melmarWisconsin", "date": "May 21, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7666007, "likes": {"liked": "— Convenient to everything.", "disliked": "— Rooms are showing use."}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Just returned from a memorial weekend trip to Ohau. We had a five night stay and overall had no major complaints. The lower floors can get street noise if you are facing the street, which we were. We were on the fourth floor Kaiulani Wing. This faces the King Shops. The pool as are all the pools that we saw along the hotels in Waikiki is rather small for the size of this hotel but when you have such a great beach right across the street who wants a pool?", "title": "Okay Hotel Can Not Guarentee Room Type", "helpfulness": 3, "user": "Expectations2007", "date": "May 2, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 7540063}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "I stayed with my family over July 4th. We needed 3 rooms all with double beds. Our reservations were accurate. Check in was fast, friendly, and efficient. The rooms were clean and well maintained. They were not fancy. The furniture showed some signs of wear. The TV s were small but worked and had many channels to chose from. We were in the tower with an ocean view.", "title": "Great Stay With My Family.", "helpfulness": 4, "user": "petest50", "date": "July 6, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 8068459, "likes": {"liked": "— Price and location", "disliked": "— Worn Furniture. A minor concern."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The location is great, right across the street from the beach. Guests are allowed to use all the facilities at the Sheraton Waikiki, the Westin Moana Surfrider, and the Royal Hawaiian including the pools.", "title": "Great hotel!", "helpfulness": 8, "user": "sebanelli", "date": "June 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8025700}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The best part. The price is usually less than half the price of the other 3 hotels. There are many off property reasonably priced restaurants within a block or two. There are many shopping opportunities ranging from designer to market stalls.", "title": "Lovely Hotel", "helpfulness": 4, "user": "mesker", "date": "June 24, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 7976297, "likes": {"liked": "— Location, staff, room"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "When traveling with a group or family, we would stay here again. If we wanted to splurge, we would stay across the street at one of the other properties.", "title": "Great Location in need of updates", "helpfulness": 3, "user": "hibiscus41", "date": "June 11, 2007", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 5.0}, "id": 7836042, "likes": {"liked": "— Location", "disliked": "— Cleanliness"}}, {"rating": 5.0, "title": "Totally Recommended!!!!!!!!", "text": "My Family and I stayed here for 15 nights without any problem what so ever and 15 nights is quite a long time!!... I chose the cheapest website with the cheapest rate, upon arrival we were upgraded several times to a room with a pool view (nice in the evening with every night a hula band by the pool) The hotel is a little tired looking in parts but not the communal areas...i get the feeling if your not happy about something, they will attempt to do something about it like moving you're room. The pool area is immaculate and will give you towels to take to the beach... Which is just a 2/3 minute walk away, Its also close to bus stops, shops, car rentals in fact anything you could really need... I had one lunch time snack around the pool which was ok, didn't eat much there though.The room was cleaned very well every day and all the staff seemed fine... I dont know how anyone can hate this place, for the money some places charge in waikiki, this is a bargain... In simple terms, this is a better hotel than the price suggests... I would stay here again no problem... In fact i probably will...", "helpfulness": 1, "user": "purpleturtleuk", "date": "May 8, 2008", "id": 15823225}, {"rating": 2.0, "title": "Beware staff gives wrong information", "text": "The hotel offers very basic rooms but quite comfortable. It is located quite central. You can easily reach the beach and shopping area. The staff in the hotel polite but give wrong information. You have to pay 20$ per night for car park. The staff suggested us free parking area, which later on cost us 180$ because of the tow-away area. He didn't informed us about that and the singes are quite small. Beware!", "user": "FashionPrima", "date": "May 1, 2008", "id": 15554023}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "I found a great rate for this hotel ($129/night) and decided to take a chance. I was considering this or the Ohana and ended up choosing this one because of the pool area and the fact that I could tell that it was directly across the street from the Moana Surfrider. Although the hotel is not one of the new luxury hotels it ended up being a great choice. The location is excellent. We were given room 718 which overlooks the pool and even offers a small view of the ocean. (nonsmoking and king bed as requested) While the room decor itself was fairly old fashioned and basic, it did have a small balcony overlooking the pool and the nightly entertainment. There is a small stage and local bands provide music nightly until 9:30. The weather was perfect for sitting on our balcony and listening to the music. Very pleasant. The room comes with a small tv but we never even turned it on. There is a small fridge, a inroom coffee maker, an iron and ironing board, and a hair dryer. The bed was comfortable and when we called and asked for a lighter blanket and foam pillows they arrived in less than 30 minutes. If you like granite countertops and brand new furniture you might not be happy with the room but we were fine it. We brought our own laptop and verizon internet connections but did think it odd that the hotel doesn't offer free wi-fi. They also charge for the inroom safe which we didn't use. One of the best things about the place is the location. It is right in the middle of the best part of Waikiki (IMHO) Plus we were extremely happy with our view of the pool. The hotel was reasonably quiet and everyone was very friendly and helpful. We would stay here again if we could get the same room and the same price.", "title": "Happy with our stay and would do it again!", "helpfulness": 1, "user": "kg92253", "date": "May 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 15521437, "likes": {"liked": "— The location and the room overlooking the pool and entertainment", "disliked": "— no free wifi, charged for inroom safe, and the location of the room near the elevators was noisy with the elevator dinging"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "I love this place. This is my third stay. Room 918 in the main tower is my favorite!! While compared to other hotels, some will say it is 'older' in appearance, but it includes all the amenities I needed. Only complaint is no wireless in the main tower. Although I was able to get it from the Hyatt T-mobile signal though while sitting on my lanai.", "title": "Third time, great as usual!", "helpfulness": 1, "user": "aj1a", "date": "April 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 15390311, "likes": {"liked": "— Location", "disliked": "— No wireless"}}, {"rating": 1.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Location, location. Awesome pool. Fresh pineapple in the afternoons, chair rentals, towels. Great sister properties. I used the gym down at the Sheraton Waikiki and also the beach chairs/area over at the Moana Surfrider. It is a short walk to EVERYTHING!", "title": "What a dump!", "helpfulness": 4, "user": "sdtraveler417", "date": "April 21, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 5.0, "rooms": 1.0}, "id": 15198669, "likes": {"liked": "— Location", "disliked": "— The hotel itself can only be described as a dump."}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Ended up in Oahu at the last minute due to a tropical storm in Cabo. We booked the Sheraton Princess because the location is good and it was a cheap last minute option and we had some starwoods points to go towards the cost of our stay. Let me assure you there is nothing princess about this place. I noticed a lot of older people at the property (60's and 70's) and lots of flight crew. The hotel gave me what they call an upgraded ocean view room in the nicer tower which starts with an A. I would hate to see what the other regular rooms looked like, because the room I was in on the 23rd floor was pretty bad. I will attach some photos. The balcony was good and the bed was decent. There was lots of mold on the bathroom floor under the sink area. I rate the room a 2 and the lobby a 3. They charge $10 per hour for every hour one stays after the check out time.", "title": "Bad rooms, good location", "helpfulness": 1, "user": "DocJewels", "date": "September 17, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "rooms": 1.0, "location": 4.0}, "id": 20156252, "likes": {"liked": "— location", "disliked": "— rooms"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Do not pay more than $129 per night for this hotel. Do not get suckered into the $36.50 breakfast buffet or the $39.50 dinner buffet. You can eat for a third of the price right across the street on the ocean at Dukes. Hamburgers at the pool were $18 each. I don’t mind paying $18 for a good hamburger at the Ritz or a JW Marriott, but at the ghetto Sheraton Princess, give me a break. I think the hotel capitalizes on the older folks who don’t have the ability to leave the property.", "title": "a touch of Vegas on Waikiki", "helpfulness": 4, "user": "MichaelInSF", "date": "September 8, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 2.0}, "id": 19869970, "likes": {"liked": "— very central to Waikiki", "disliked": "— I didn't come to Honolulu to feel like I was in Vegas"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled solo", "text": "We did have a pretty good time. The staff was nice. The weather was great. You must get a rental car to do your travels around the island - if not you will start to feel claustrophobic in the city after awhile. 3 nights in Waikki is enough. Stay a few nights in the city and a few nights on north shore. This hotel is fine for college kids or families trying to save money, but don't go to the Sheraton Princess for a romantic trip away.", "title": "Old Building/Great Location", "helpfulness": 1, "user": "Schwack", "date": "September 7, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 2.0}, "id": 19866436, "likes": {"liked": "— Location", "disliked": "— rooms"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "My heart sank when I stepped into my room at the Princess Kaiulani hotel. My first impression was that I had stepped into one of the deeply discounted hotels I sometimes stay at when backpacking in Asia. The room was small, the furniture somewhat beat up, the cheapo chair under the desk would be perfectly at home in a typical massive conference hall.", "title": "average rooms but some redeeming qualities", "helpfulness": 1, "user": "Whitegirl1966", "date": "September 2, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 19627526, "likes": {"liked": "— location", "disliked": "— rooms"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "But after the first negative impression, I found the positives: there was the Sweet Sleeper bed and nice comforter & linens. And the air conditioning unit was nice and loud, which drowned out the music from the bar only a few floors below.", "title": "Good location but dated", "user": "kittenmitten", "date": "September 1, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 19621195, "likes": {"liked": "— Location", "disliked": "— Cleanliness / decor"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "Now before choosing this hotel I started looking into its review here on TA.", "title": "Better than Expected", "helpfulness": 9, "user": "AMuller396", "date": "April 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7472205, "likes": {"liked": "— Cleanlines of the room, and the Free Upgrade.", "disliked": "— Lack of recommendation by the concierge with regards to other restaurants in the vicinity"}}, {"rating": 1.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "To be honest Ive read a lot of complaints regarding the noise, dirt, condition of the room etc etc.", "title": "Location, Location,and, well, not much else.", "helpfulness": 4, "user": "SDSteve", "date": "April 23, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 7420581}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "I didn't really want to stay at this hotel, but for the price of $99 a night for a standard room, to me it was a no brainer since the location of the hotel is a big deciding factor.", "title": "Good location and smooth service", "helpfulness": 1, "user": "FrequentFrier", "date": "April 20, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 7402344, "likes": {"liked": "— Central but quiet (at the back)", "disliked": "— Street scene at night"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled solo", "text": "When we arrived on April 19 for our 4 night stay, they immediately upgraded us to a partial ocean view room (See attached Pictures). We where definitely happy about that. We where given a room on the 7th floor.", "title": "Mixed review - the good the bad the ugly", "helpfulness": 3, "user": "cicitrvlr", "date": "April 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 2.0}, "id": 7380732, "likes": {"liked": "— Location, value", "disliked": "— older rooms, bed"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The room was clean, and the furniture and the carpets didn't seem worn out. The bathroom was clean too, and not worn out. The air conditioning worked perfectly and was very quiet. The room had a nice partial view indeed and the noise from the street and the nightly show was not a factor at all. The only complaint I have was that the hall way smelled like smoke.", "title": "Disappointed. Hotel in need of renovations.", "helpfulness": 5, "user": "Danni_LM_55", "date": "April 13, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 7348321, "likes": {"liked": "— Location", "disliked": "— The Rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "I stayed at the Sheraton Princess Kaiulani with a friend who booked the room using SPG points, so I don't know how much it would have cost, but it seemed to me like a Sheraton would have larger and/or nicer rooms. The bathroom was pretty cramped and I think the beds were doubles rather than queens. The balcony was nice but overlooked the pool so we heard a lot of music which could be good or bad. We didn't mind too much. The location was convenient to Waikiki Beach and to the shopping on Kalakaua Avenue.", "title": "Best Service by the staff (Dennis) he was most helpful", "helpfulness": 3, "user": "AmerTurk", "date": "July 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8225864, "likes": {"liked": "— location,service", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "I spent 10 days at this hotel. I found my High Oceanview room excellent. The view was wonderful (facing Diamond Head and the ocean). The room was spotless with the standard furnishings, wonderful quiet A.C. and a lovely welcoming fruit basket delivered by a nice staff member. The concierge and front desk staff were very helpful. Every other day I'd planned a tour and the front entry man made sure he watched for my tour group / pick-up shuttle. He was awesome. When you arrive, they tag your bags with your room number and they deliver them so you don't have to juggle them during your check-in which was fast and easy. The hotel is a 2 minute walk to the main street and beach. There is an abundance of cafe's, snack bars, fast food places and a ABC variety store right across the street. The only negative's I experienced was the traffic flow inside the hotel and the very pricy buffet meals. They have a main aisle to the elevators (4) but you are \"herded\" into a narrow walk-through due to some of the buffet food tables being on both sides and local artisians with display tables in the same area. Makes it very crowded and frustrating to get through. The buffet meals are costly ($65+ per person for dinner) but the foods offered are really top-notch. It was way out of my price range so I ate out. A really neat thing they offer is an option to not have housekeeping for up to 2 days in a row. On the days I was out on tours, I had housekeeping but not on the days I was in the hotel. Each time I declined, I received a $5 certificate you can use in any place in the hotel. I saved mine and splurged on a room service breakfast on my last day. I understand the hotel was to be closed for reno's shortly after my stay. I hope it has re-opened as it's truly a good value.", "title": "Wonderful place, excellent staff, very good location", "user": "sok30_11", "date": "May 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 107022471}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "this hotel is directly across the street from the beach. It is in the center of the strip. Skip the buffet restaurant to expensive. However for breakfast you can take a styrofoam to go container for $10.00 and fill it up. My family and I chose Denny's around the corner. Don't worry if you forgot anything an ABC store (similair to a Walgreens) is next door. the rooms are fine beds comfy not to big all rooms I beleive have a terrace. Non-smoking hotel. Clean hotel and my children got to feed and pet the fish. The had pinapple cutting demos in which they hand out slices. However the bartender and waitreses will always give you some with your order. My only problem was the pool started at 3 feet but more like four feet, most kids were stuck on the steps. Happy hour by the pool is from 3:30-5:30 1/2 priced drinks and $5.00 yummy appetizers. Staff was very nice rooms were comfy. But the location is the best either way you walk there is a lot to do. A few doors down is the international market. None of the Hotels in Wiakiki are that nice, none of them have pools that are really spectacluar.(except the Sheraton on the beach) which you are not allowed to use. This sheraton hotel is nice, clean and in one of the best locations.", "title": "Location-Location-Location", "helpfulness": 3, "user": "terriLongIslandNY", "date": "May 2, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 106518255}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Meanwhile in Hawaii do the side trips they do take most of the day. Pearl Harbor was great they have built it up they now have an airplane museum and a submarine and battleship. Polynesian Culture center long day but very good and the submarine ride. We had a lot of fun in Hawaii", "title": "Locaion is perfect, hotel is OK", "user": "ariverasb", "date": "May 2, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 106439445}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "The hotel met our expectations. We knew it was in a fantastic location however it is not one of the nicest rooms we've stayed in. It is OK and had a lot to offer for the price. We would stay here again! The kids loved it. The resort fee includes good values such as free parking, daily use of beach chairs, free internet etc . . .", "title": "Outstanding", "user": "Serendipitea06", "date": "April 30, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 106291331}, {"rating": 5.0, "stay_parameters": "Stayed April 2011", "text": "We were on the 14th floor overlooking the pool..wonderful wonderful view of the ocean..", "title": "So WORTH IT", "user": "jo808", "date": "April 24, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 105306220}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We just returned from staying at this wonderful hotel. We were there for 4 nights. The Hotel was very clean, the staff very friendly and helpful. I liked that you could do your laundry on site. We sat on the balcony every night and listened to the nightly show that was put on at poolside. By11:30 every night the music stopped. The international market place next door to this Hotel was great. You could get all your gifts bought at this place and you can haggle a bit on the prices.The 15 min. free internet service was nice as well. You can also print your airport boarding passes out at the hotel to make airport check in easier. Everything was in walking distance and loved the hotel pick up to all the tours we took. Airport shuttle was very useful too. You just don't need a car they do it all for you. So this hotel was a good fit for all our needs. And the beach was just across the street. Couldn't ask for more. Very pleased with out stay.", "title": "Loved the Hotel", "helpfulness": 1, "user": "dragon410", "date": "July 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 18005318, "likes": {"liked": "— location", "disliked": "— could hear some noise from other room"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "This hotel is in a great location and is a very good value! Great service, friendly staff, nice rooms, nice pool, and very comfortable. This hotel is 2 blocks from the beach and is on the main strip where there is a lot of restaurants and shopping. The only down side is that the hotel restaurant was very expensive. There are plenty of other options nearby (e.g. The Cheesecake Factory, California Pizza Kitchen, etc.).", "title": "Excellent Hotel", "helpfulness": 1, "user": "FrequentTraveler079", "date": "July 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 17991891, "likes": {"liked": "— location", "disliked": "— Price of restaurant"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "My wife an I spent a 6 nights at this lovely hotel. After reading some of the prior reviews we were not expecting to be awed by the hotel. We were pleasantly surprised!! The hotel itself was pleasant and well maintained. The hotel room was exactly what we expected too, nothing too fancy but a very reasonably priced place to rest( and a very pretty view from the balcony).", "title": "We would recommend this hotel!!", "helpfulness": 1, "user": "shivos", "date": "July 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 17921687}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The hotel staff was very insightful and helpful. We took advantage of the on site travel/activity coordinator. We obtained wonderful info from this person regarding rental car, luau's, snorkeling.", "title": "Great location for the money", "helpfulness": 2, "user": "Alan_Joanna", "date": "July 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 17858101, "likes": {"liked": "— Close to beach without having to pay a fortune", "disliked": "— Noisy high school students who were on a trip"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Having gone to this hotel during prime time summer vacation, we were expecting to not find any lounge chairs at the pool. We were again pleasantly surprised, not once did we have any problems finding two seats next to each other. Although it was extremely busy/crowded in town, we did not feel the hotel was overbooked or crowded.", "title": "Good Experience at PK", "helpfulness": 1, "user": "Flyerman", "date": "July 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 17505355, "likes": {"liked": "— Value for money when compared to surrounding hotels", "disliked": "— Swimming pool closed too early, and no fitness room"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "This hotel has a great location in Waikiki right on Kalakua Ave. It has a normal pool in a setting right there off the street which added a little excitement to sitting by the poolside. The beach is across the street as well. The hotel is older but I found it to be charming. The staff is very friendly and seems to enjoy working there. The rooms are a little worn but are still in good condition. There are some great ocean view rooms on the higher floors of the original tower. The newer tower doesnt face the ocean so the rooms have a views of Diamond Head or Downtown. Overall it is a nice hotel but dont expect a resort.", "title": "Great Location, Charming Atmosphere", "helpfulness": 5, "user": "onejoehill", "date": "January 14, 2009", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 23558130, "likes": {"liked": "— Location", "disliked": "— Expensive Breakfast Buffet"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "The dinner show in the hotel is excellent. The dinner is has some Luau type food, which was good. The show however was fantastic, the performers were very professional and were a sheer delight. I have seen other types of these performances and this is by far the best that I've seen. Every seat is a good seat, we sat near the back and were fine with that.", "title": "Location is the best for the price", "helpfulness": 1, "user": "Camelduece", "date": "January 7, 2009", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 23348289, "likes": {"liked": "— Location", "disliked": "— Odd smell in lobby!"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Just got back from a wonderful two week 3 Island Hawaiian Honeymoon. We flew into Honolulu because it was cheaper.", "title": "Hotel did not honor the reservation I had made through hotels.com.", "helpfulness": 1, "user": "kallyn1", "date": "December 29, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 2.0}, "id": 23085703, "likes": {"liked": "— The location.", "disliked": "— The room we had been given when we had purchased a room with a great view."}}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "We booked the High Ocean View-Ocean Promotion for $149 a night during our Honeymoon around Christmas. Best value around for the price and location is great. Stayed for 3 nights, and would not suggest any longer.", "title": "Would not recommend", "helpfulness": 4, "user": "abbey_315", "date": "December 17, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "location": 5.0, "rooms": 1.0}, "id": 22808503}, {"rating": 4.0, "stay_parameters": "Stayed December 2008", "text": "We were in the tower on floor 20 on diamond head side which is better. If you book it, just call ahead and request it.", "title": "Excellent Value very near the beach", "helpfulness": 4, "user": "oldhousegirl", "date": "December 16, 2008", "detail_rating": {"value": 5.0}, "id": 22791743}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 216, "average": 514, "very good": 830, "terrible": 103, "excellent": 322}, "aka": "Sheraton Princess Kaiulani Hotel Honolulu", "slim_ranking": 0.722891566265, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.0, "location": 4.5}, "description": "Luxurious Sheraton Princess Kaiulani is near Waikiki Beach and downtown Honolulu. Our hotel has Creation, a dinner show; cultural activities; and 11,500 sq ft of event space for weddings or meetings."}