{"user_rating": 4.0, "review_count": 2538, "name": "Sheraton Maui Resort & Spa", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "My husband and I stayed at the Maui Sheraton for our 10th anniversary in December. Maui had just had a huge storm the day before and so we moved rooms at 2 times until we got one that did not smell like mildew. A lot of the rooms facing the ocean direcly had been flooded. Our friends had a nice room too. The beds were comfortable. The staff were friendly and helpful. The pools were beautiful but way too cold to swim in. We rented snorkel equipment at a hut down the boardwalk (the hotel's were more expensive) and used it every day at Black Rock (fair snorkeling). I would definitely stay at the Sheraton again if I ever went back to Maui in the future.", "title": "Great Hotel", "helpfulness": 1, "user": "Lele4", "date": "May 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 15807728, "likes": {"liked": "— location", "disliked": "— The pool was way too cold. You'd think for the prices, they would be able to afford to heat it."}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "My wife and I stayed at the Sheraton for a week and enjoyed every minute of it. The grounds, room, service and staff were first-class. We opted for a package that included breakfast which was fit for everyone's appetite. Our deluxe room (about $600 per night) had a direct view of Lanai; we had never seen so many whales - it seemed as though you could reach out and touch them. Since we checked late in the evening a king bed room (that we thought we booked) was not available but the hotel did move us to one the next day. In addition to excellent hotel dining, there are plenty of great restaurants in Lahaina; Longhi's, Kobi's and Kimo's to mention a few. If you like fresh seafood Maui is the place for you. We found that the helicopter ride up to the volcano was exhilarating. You've got to try it. We had rented a convertible car but rarely used it with the top down. Pretty much all attractions can be viewed within a 60 minute drive except for the infamous Road to Hana. We passed on it but did view the remote area on our helicopter excursion. Note that most helicopter operators heavily discount their fares if you call in and make your reservation after 5:00 pm. You may have to get up a little early but it may be worth the savings.", "title": "Great Stay in Maui", "helpfulness": 1, "user": "pismore", "date": "May 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 15739401, "likes": {"liked": "— location", "disliked": "— Not having our king bed room the first night"}}, {"rating": 5.0, "title": "It's the whole package", "text": "My husband and I have stayed at 3 other hotels on Maui. We really love Maui and never really paid the Sheraton much attention. I didn't really like the reviews because most of them were about the beach. My husband can't swim and when we went to Maui nobody could swim because the beaches were closed. Our thought was if we can't go to the beach the Sheraton doesn't have much else to offer. We wer wrong. None of the previous reviews gave details to help us understand what the Sheraton has to offer.", "helpfulness": 2, "user": "NewYorkfoodee", "date": "May 6, 2008", "id": 15735156}, {"rating": 4.0, "title": "Lovely Time at the Sheraton Maui", "text": "I don't want to cover all of the things everyone else has covered. But I want to just cover a few things that I dont see on many of the reviews.", "helpfulness": 1, "user": "DoubleD1969", "date": "May 6, 2008", "id": 15717032}, {"rating": 5.0, "title": "Perfect Aloha Spirit at the Maui Sheraton", "text": "First of all the Sheraton Maui has hypo allergenic sheets and pillows which is a big plus for us. Plus after flying so far we are concerned about our backs being tight from the flight and need a comfy bed. The Sheraton beds were super comfy and big. The rooms were big and super clean.", "helpfulness": 5, "user": "mccmrs", "date": "May 5, 2008", "id": 15678583}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "My wife and I spent 4 nights of our honeymoon at the Sheraton and to say the least, we were pretty disappointed. Given the high prices (although fairly reasonable compared to Westin Maui, Grand Wailea, Fairmont and Four Seasons), location in Kaanapali (near the BlackRock), simply the fact that it was a Starwood property, and strong reviews on Tripadvisor (4 to 5 stars) we came into the stay with rather high expectations.", "title": "Fairly disappointed on our honeymoon", "helpfulness": 6, "user": "harley75", "date": "November 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 10828832, "likes": {"liked": "— Proximity to other hotels, restaurants and Whaler's Village", "disliked": "— Layout was terrible"}}, {"rating": 5.0, "title": "Loved the Sheraton Maui", "text": "Positives:", "helpfulness": 2, "user": "sunbeachsnorkel", "date": "November 14, 2007", "id": 10825694}, {"rating": 3.0, "title": "Beautiful, but.....", "text": "1) Gym - not crowded, new machines, several TVs, clean", "user": "cats12", "date": "November 13, 2007", "id": 10796253}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "2) Breakfast buffet - fairly priced, wide variety, great service", "title": "Seaturtle heaven", "helpfulness": 4, "user": "shrinkwrap", "date": "November 13, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 10786009, "likes": {"liked": "— snorkeling"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "3) Location and beach - Hotel is nestled up against BlackRock and is the last hotel on Kaanapali Pkwy, so there is a feel of privacy. Walking distance to and proximity to other hotels, several restaurants near the wate, and semi-upscale mall (e.g. Westin and Whaler's Village)", "title": "Loved the Sheraton!!!!", "helpfulness": 5, "user": "BabsSC", "date": "November 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10716196, "likes": {"liked": "— Location and room view!", "disliked": "— Nothing, except having to leave."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "My wife and I spent 7 nights (checked out May 2nd) at the Sheraton Maui and this resort was great. This resort seems like it truly belongs in Maui and was not one of the high-raise hotels so it fit perfectly on the beach.", "title": "Great Resort in Paradise", "helpfulness": 1, "user": "Cheddywig", "date": "May 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15624472, "likes": {"liked": "— The pools", "disliked": "— Food Prices"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "The pools were great with lagoons connecting the two pools. The beach was great as was the fire cliff diving which occurred nightly.", "title": "Best Place in Maui to Stay !!", "helpfulness": 2, "user": "Suzy5", "date": "May 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15524600, "likes": {"liked": "— EVERYTHING !!!!!!!!!!", "disliked": "— NOTHING !!!!!!!!!!!!!"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The breakfast menu was fantastic, although a little pricey. Fresh pineapple and other fruits daily.", "title": "Maui, Wowi", "helpfulness": 1, "user": "H0lidayBlues", "date": "April 30, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 15513450, "likes": {"liked": "— Service"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Truly a great resort in paradise.", "title": "Pretty Good Location for a Resort", "helpfulness": 2, "user": "talkinmonkey", "date": "April 30, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 15509174, "likes": {"liked": "— the price of the room, the room, the location", "disliked": "— the prices for everything else, the weather (wasn't great), the amount of concrete"}}, {"rating": 5.0, "title": "Loved it, loved it", "text": "For a day trip consider flying to Oahu (only an short 45 min plane ride) and take a drive up to the North Shore.", "helpfulness": 1, "user": "Canuck123", "date": "April 27, 2008", "id": 15416280}, {"rating": 5.0, "stay_parameters": "Stayed September 2008", "text": "Sheraton Maui is fantastic beyond words. We had an Ocean View Room on the Black Rock where the sun set just in front of us. The room was spotless and really big with a large balcony, and the kingsize bed was very comfortable. The staff were so friendly and very obliging. The breakfast is class and the food in the evenings is delicious. The amenities are brilliant and it is so tranquil and relaxing. A brilliant honeymoon destination and cannot recomend it highly enough. Photos do not do it justice.", "title": "Words and photos will not do it justice!", "helpfulness": 2, "user": "Gugeen", "date": "September 26, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20391752, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Johnny and Lisa", "title": "Loved Living in Paradise", "helpfulness": 1, "user": "2ferfun", "date": "September 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 20379873, "likes": {"liked": "— free breakfast buffet, awesome vallets & bellmen, the best snorkeling in all of Maui", "disliked": "— the price"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "We Loved our first stay in Maui aka Paradise. We loved our 8 day stay at the Sheraton and would go back in a heart beat. Even with the few \"notsoperfect\" things. We had originally booked a King size bed and rcvd 2 queens (but after seein the amazing view we had didnt want to risk a worse view) and we were charged vallet for 2 days we actually didnt use it, but after such great service specially by the vallets we didnt even bring it up. We took the Teralani snorkel cruise and LOVED it, but were a bit spoiled with the amazing snorkeling right at black rock. We saw several turtles and sting rays and it made all the money we spent well worth it. We didnt eat at the Sheraton other than breakfast and a few drinks. Loved Leilanis just down the beach at Whalers village. We cant wait to go back and hopefully this time during whale season, tho we are a bit leary of having to deal with crowds of people which we heard about from other travelers that had been there during that time. But we loved the Sheraton and would definately recommend it to a friend!!", "title": "Not sure why this place gets all the negative reviews", "helpfulness": 2, "user": "bkp21", "date": "September 22, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 20290640}, {"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "As a Starwood Gold member, maybe I got a little more attention than the average tourist may have gotten, but overall, this property does not deserve all the negative press it has received on this website.", "title": "Never Never Never again will we stay at a Sheraton Hotel.", "helpfulness": 3, "user": "charlihot2", "date": "September 15, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 20079559, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008", "text": "Overall, the staff was courteous, friendly and helpful. I can honestly say that we didn't have a single negative experience with the staff during our stay.", "title": "Offhand staff cause a downgrade", "helpfulness": 2, "user": "winnoSydneyAustralia", "date": "September 12, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 1.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 20013625}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The Sheraton Maui located at Black Rock is a large property that has been updated and remodeled. Finding your room can be a challenge if youy do not learn the the layout of the hotel. It is well worth it. We had a beautiful oceanfront room. We could see whales from our terrace. The room has coffee, refridge, and microwave. We mentioned it was a special anniversary and were given a beautiful basket filled with champagne and Maui treats. Our room was upgraded also. Sunsets are spectular. The hotel does a great torch lighting ceremony, hula dancing, and a diver off Black Rock at sunset. The gym is great and the hotel offers yoga, pilates, and other fitness classes for free. The instructors are professional. The beach is beautiful., better than most other hotels in the area.The pool is a problem as there is a webcam that others can view you on the computer. Invasive of privacy, but we did enjoy talking & waving to our daughter in New York. I would stay here again.", "title": "Enjoyed the Sheraton in Maui", "helpfulness": 6, "user": "sunsurfandsand", "date": "January 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12635802, "likes": {"liked": "— Beach & Fitness Classes", "disliked": "— Very large property"}}, {"rating": 5.0, "title": "Excellent stay", "text": "My wife and I have just returned from our honeymoon. We spent 4 days in NYC and then 7 days in Maoi, where we stayed at the Sheraton.", "helpfulness": 5, "user": "gahearne", "date": "January 12, 2008", "id": 12556243}, {"rating": 5.0, "title": "Wonderful", "text": "We had no drivers license with us so arranged a shuttle from the airport, they have a stand beside the taxi rank and cost about half as much (think it was $45 ish for 2 of us to Sheraton). Journey took about 1 hour but we hit rush hour traffic, normally the journey is more like half an hour.", "helpfulness": 3, "user": "funfamily5", "date": "January 7, 2008", "id": 12405264}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The sherton has an excellent location (right on nice beach with snorkelling possibilities), friendly staff, great breakfast (which we had included in cost) and decent restaurant.", "title": "Beautiful Location, Great Service in Paradise", "helpfulness": 5, "user": "lovin-2-travel", "date": "January 4, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 12329379, "likes": {"liked": "— The location", "disliked": "— The price!"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We had an ocean front room in building 4, 5th floor, the balcony gave us a great view over the Sherton grounds/gardens/pool, and beach/sea. Room wasn't the largest considering the cost but was clean, comfortable and did the job nicely.", "title": "Great Winter Getaway", "helpfulness": 4, "user": "Ca_natives", "date": "December 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 12020250, "likes": {"liked": "— It was much quieter & less hectic than the Westin"}}, {"rating": 5.0, "title": "Fabulous Stay at the Sheraton for Maui Invitational", "text": "My husband and I stayed at the Sheraton for 7 nights in November for the Maui Invitational Basketball Tournament. We booked through a travel agent (Aloha Travel--very positive experience) for a package which included transfers and tourney tickets. Granted we paid more this way, but we needed tickets for the tournament and transportation to the games. After MUCH research, we selected the Sheraton, primarily due to its separation from the other busy resorts and the prime beach. We considered the deluxe ocean front (buidling 6) but booked ocean view instead, going for the view of the beach and Black Rock as we thought it would be more fun to see a variety of views rather than just ocean. We asked for Building 4, and we were upgraded to an ocean front room. We were on the 5th floor with 2 lanais, which was fabulous. The rooms are small but clean and the bed and pillows very comfortable. The bathrooms and closet are small. The fridge was large enough for drinks and a few food items. Housekeeping service was good. The snorkeling at Black Rock is fabulous and we took advantage of it daily. The beach is so clean and spacious, especially compared to the beach in front of the other major hotels. We ate one lunch at the hotel with a buy one, get one free coupon, and two buffet breakfasts as we had vouchers included in our package. Otherwise, we ate off property. Our favorite restaurant was Kimo's. We did not rent a car but took the hotel's free shuttle into Lahaina and walked the boardwalk to restaurants and for exercise. The pool water was colder than the ocean, but hey, you're in Hawaii, and it's not that hot this time of year just sitting at the pool!! Plenty of chairs available too. After all the research I did, I concluded that the negative posters forget EVERYTHING is higher in Hawaii--that's just reality. We would definitely stay at the Sheraton again.", "helpfulness": 6, "user": "ostatedeb", "date": "December 1, 2007", "id": 11185592}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "My boyfriend and I just got back from a 4night/5 day stay at the Sheraton and we loved it. The grounds and pool area were beautiful. They have the best spot right on Kaanapali beach. The snorkeling right outside the hotel at black rock was amazing. The last day were there, the water was extremely clear and it felt like you were in an Aquarium. We swam right next to 3 sea turtles. The pool area was really nice and the pool was shaped sort of like a lazy river with small waterfalls, a small slide and lave rock everywhere. We were upgraded to a deluxe ocean view and stayed in building 6. It was a bit of a ways to walk to get to the pool/restaurants but we didn’t mind. The staff was very friendly and helped us out when the airline lost one of our bags. The rooms were a little old and a bit outdated but we spent so little time in them that it really didn’t matter. We did the breakfast buffet once and there was a good selection of breakfast items. The lunch served by the pool was fairly good but nothing spectacular. I would definitely stay in the Sheraton again if I get a chance to make it back to Maui.", "title": "Loved the Sheraton!", "helpfulness": 2, "user": "manda33", "date": "November 28, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 11125338}, {"rating": 4.0, "stay_parameters": "Stayed November 2007", "text": "My fiance and I stayed at the Sheraton Maui Resort using Starwood points over Thanksgiving. While the location is nice and the beachfront property is excellent, the rooms are starting to get a bit run down. Also, there happened to be a lot of areas out of service during our stay (e.g., parking garage elevator, shower by pool); it would have been more bothersome had we paid full fare for the room. Overall, nice experience and friendly staff.", "title": "Nice stay but not a luxurious experience", "helpfulness": 1, "user": "the_princey", "date": "November 26, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 11082661}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We stayed at the Sheraton Maui Resort from Nov 10-16. This was our 5th trip to Hawaii in the last 7 years. We have stayed at many hotels in Hawaii, including the Ritz Carlton in Maui, and this was one of our favorites. This hotel is fabulous! The grounds are immaculate, the pool is beautiful and the beach is probably the best we've seen. I only have one complaint that I'll get to at the end.", "title": "Highly Recommend the Sheraton Maui!", "helpfulness": 8, "user": "HawaiiGirl01", "date": "November 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 11061045, "likes": {"liked": "— Beach, pool, location.", "disliked": "— Food prices and quality."}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "First of all, we had a deluxe oceanfront room in Building 6. Anyone who complains about the walk is just a complainer. The walk is not that bad and the views on your way to the beach/pool are beautiful. You do have to take 2 elevators, but they are very fast and it's not that hard to figure out. We had it figured out after the first time. It's absolutely worth the walk to get to Building 6. All the rooms are literally oceanfront with nothing to get in the way of your view. There is the island of Lanai to one side and the island of Molokai to the other side and you can see the lights of Oahu in the far distance. The waves are crashing on the rocks right outside your window. The rooms were pretty good, could definitely be upgraded a little. For the price you pay you expect a walk-in shower, not a shower curtain. It needed a little paint and carpet refresher, but nothing you couldn't live with. We had trouble logging into the high-speed internet in our room, so we called someone to come fix it. We never once complained about it and still we got two food vouchers for $15 a piece for our \"trouble\" to be used at any restaurant on the grounds.", "title": "On a Budget at the Sheraton", "helpfulness": 5, "user": "IndianaTraveler25", "date": "November 21, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 10968014}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The pool was beautiful, very clean and refreshing. Lots of chairs and plenty of room. The resort was pretty dead this time of year, as was the entire island. This is definitely a \"down\" time for them. It was a prefect time of year to go. The beach is amazing. It is all sand bottom with great snorkeling by Black Rock. No big waves this time of year. The beach infront of the Sheraton is the best on Kaanapali. We spent a day exploring the beaches over in Kihei and Wailea (Four Seasons Resort) and the beach at the Sheraton is so much better. We loved that it was a short walk to Whaler's Village area - we ate at Hula Grill twice. We would walk down on the beach and then walk back on the path that is right at the top of the beach. You can walk on the path all the way from the Sheraton to the restaurants in about 5 to 10 minutes.", "title": "Great for Honeymoons! Great for anything really", "helpfulness": 2, "user": "yo-eleven-yo", "date": "November 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10940895, "likes": {"liked": "— The Room (building 6)", "disliked": "— Nothing, really"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The entire staff was very friendly. The grounds, pool and beach are some of the best we've ever seen. The one BIG complaint I would have is the price of the food at the resort restaurants. We ate dinner our first night at the Lagoon Bar - my husband had an Ahi Sandwich, I had a burger and we each had a Lava Flow drink ($10 each) for a total bill of over $60. We just couldn't believe it. The drinks were not that great and were in small plastic cups. You get twice the amount and better quality at any other restaurant in town for about $7.50. A small plastic cup of soda is $3.75 (no refills). The quality of the food we had was mediocre at best. We only ate at the pool bar once to use our free meal vouchers, otherwise we wouldn't have bothered. Whoever is in charge of running the restaurant portion of this resort doesn't have very good business sense. They would get so much more business if they would lower their prices even a little bit. We're all about relaxing and enjoying drinks, but even we couldn't pay $10 for a small plastic cup of a watered-down drink. We went to Safeway right down the road and stocked up on soda, water, wine, beer and snacks. We would take a small collapsable cooler with water and soda down to the beach every day and fill it with ice and it stayed cold all day.", "title": "Great Honeymoon Location", "helpfulness": 2, "user": "RUFUSTFIREFLY26", "date": "November 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10901183}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The location of this hotel is perfect. It is a short 5 minute drive to Lahina where there are a ton of amazing restaurants on Front Street.", "title": "good location", "helpfulness": 5, "user": "LobsterBrew", "date": "November 15, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 10836040, "likes": {"liked": "— Location.", "disliked": "— The hotel itself."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Overall a good hotel. I am a starwoods Gold member so this is why I choice the Sheraton. Great location and beach access. The staff was friendly and helpful. The rooms were OK but the overall property was very nice. A little pricey, you can probably find a nice condo for cheaper", "title": "Good Hotel and Location", "user": "Daniel S", "date": "September 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 178021994}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "A fabulous hotel in a great location at Black Rock. Stayed here for 5 nights in July 2013. Got upgraded to a deluxe ocean front room in Building 6 for a reasonable fee. A spacious room with the most beautiful ocean view, especially of an evening sitting on the balcony with a glass of wine watching the beautiful sunset. Only downside of this was the fairly long walk to the main area of the resort. Must also mention the super comfy bed.", "title": "GREAT STAY", "helpfulness": 1, "user": "taskatarina", "date": "September 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177747011}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "A beautiful pool area, most loungers were taken early in the day, half the time no one was on them, only a towel. Something should be done about this, I know it happens at all resorts though.", "title": "BEAUTIFUL view of the ocean!", "helpfulness": 3, "user": "supersmartwoman", "date": "September 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 177607939}, {"rating": 5.0, "title": "Great Trip to Maui", "text": "Drank at poolside bar most nights whilst watching fabulous cliff diving ceremony.", "helpfulness": 1, "user": "Kurtis H", "date": "September 17, 2013", "id": 177592706}, {"rating": 2.0, "title": "Honeymooning at Sheraton Maui now", "text": "Only 5 min walk along beachfront to Whalers Village, a lovely little shopping centre with lots of nice bars and restaurants. Also found the free shuttle to downtown Lahaina very handy.", "helpfulness": 3, "user": "David G", "date": "September 17, 2013", "id": 177479290}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We stayed at the Sheraton Maui for 7 days in early September. The hotel is great and the location is even better. The grounds were very nicely kept as were the rooms. The staff seemed to really care that you were having a good time. The beach is amazing for snorkeling. We saw a sea turtle every day we were in the water. Like everything in Maui, the Sheraton is very expensive for food and drinks so consider walking down to Whaler's Village for great restaurants/happy hours. Overall, this is a great hotel and I'd stay here again.", "title": "Great Honeymoon", "helpfulness": 5, "user": "Jed1087", "date": "September 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 177028392}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "This hotel has an amazing location, helpful staff, all the right parts that make up a great hotel. So, why the average rating? First of all, it is on Maui and hard to call it average, we have thoroughly enjoyed so many aspects of this resort. However, the food and beverage department and marketing department are on a different planet. We bought a package that includes daily breakfast for 2, but when we got here, we found out it was buy one get one free. What? The old bait and switch tactic! We ended up trying the breakfast the first day and it was lovely. The price for one person with tax and service charge (yes a service charge of $9.36!) and tip came to $40!! We chose to never eat anything else at the Sheraton and while talking with other couples during our stay, we heard the same thing consistently. We found a couple great spots nearby that were extremely reasonable and we were prepared to pay much more. Sheraton screwed themselves, but I am sure they don't care, since so many others pay the prices. The hotel is also desperately in need of updating. The carpet in the hallways is tattered and bubbling (a tripping hazard), the bathroom vanity is extremely low (and this is not a handicapped room) and the mattresses are well worn (comfortable linens, but extremely soft beds that slope to one side from use). The pool and hotel location is amazing and for this, we would come back. We now know where to go to avoid being suckered by Sheraton. FYI, our stay at the Hyatt was much better, but we opted for this location near Black Rock for snorkeling.", "title": "They can do better", "helpfulness": 7, "user": "LovinSanDiego", "date": "September 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 176910233}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We had a family wedding in Maui and stayed at the Sheraton Maui with our family of 4. We had booked three rooms and on our arrival the Sheraton after 12 hours of travel with 2 young children had decided to cancel 1 room which belonged to my family. They advised that they had not received payment for the room therefore cancelled it back in June. They moved us to a lower room and advised that we needed to sort out the details with our travel supplier before they could do anything else. Well, after several times of trying to contact FlightCentre Afterhours contact to find out what had happened, we find out that our rooms was paid for and that the Sheraton had misplaced the details and cancelled our room. Finally we were moved to the Suite that we had rightfully booked and paid for without so much of a sorry from the Sheraton. Secondly, on check out they charged us the $100 USD it cost in phone calls to call FlightCentre in Australia to sort a an error they had made. Unbelievably bad service. Room was nice and spacious, in a lovely location near Black Rock but the service at check in tainted our entire experience.", "title": "BAD SERVICE", "helpfulness": 12, "user": "Francine W", "date": "September 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 176822977}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Our family (2 adults, 2 children ages 11 & 15) had the great privilege of staying at the Sheraton Maui August 17 - 26 2013. We are SPG platinum members and have traveled extensively throughout Canada, the US and Europe. This was our first trip to Maui.", "title": "Lovely family holiday - staff were exceptional!", "helpfulness": 6, "user": "Sandra R", "date": "September 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 176788585}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "From the moment we arrived to the moment of our departure the service at the hotel was fantastic! From our initial encounter with Tony at the valet (in fact ALL the valet staff), Gabe at check-in, all housekeeping staff, Erin at the pool, Mac at breakfast, room service staff, baristas, gift shop staff to the day of departure not once did we encounter the poor service that has been expressed on this forum.", "title": "A lot of room for improvement", "helpfulness": 7, "user": "CBHoosierAbroad", "date": "September 9, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 176538253}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We stayed at the Sheraton Maui last week for 5 nights as part of our honeymoon. We had only booked a garden view room due to cost and after reading the many reviews on here from people who were upgraded for free, we thought we'd try our luck too. After all we were on honeymoon and it doesn't get more special than that! We arrived around 11:30pm and when my husband asked about the possibility of us being upgraded as we had just got married we were told flatly NO, that there wasn't anything available. We went to our garden room which was pleasant enough but it had 2 small double beds in, not exaclty what you want on honeymoon!", "title": "Honeymoon dissapointment at the Sheraton", "helpfulness": 1, "user": "Lazarazu", "date": "September 11, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 19981554}, {"rating": 5.0, "title": "Pure Paradise, Tick on the \"before you die list\"", "text": "The next day my husband went to reception to say he wasn't happy with the room and wanted one with 1 larger bed. He was told he could upgrade to a oceanview room with a kingsize bed but it would cost him $50 per day. We decided to upgrade and whilst I know that we only booked a garden view room and we shouldn't have expected anything different without paying, I feel very dissapointed that so many other people seem to have received special treatment. It's not even like the hotel was busy and they didn't have room to upgrade us for free. I heard many people say how quiet the place was.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "September 10, 2008", "id": 19971315}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We found the breakfast buffet expensive compared to other places and didn't really like the fact that the bar's closed at 9pm.", "title": "Great Place for Vacation", "helpfulness": 3, "user": "pnaj", "date": "September 9, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 19944551, "likes": {"liked": "— Beach", "disliked": "— No internet access without laptop (went to Westin to use theirs.)"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Overall the hotel wasn't bad at all. We had a lovely relaxing time there. The upgrade business just put a bit of a downer on it for me though. I would love to return to Maui one day although sadly I don't think I'll be staying at the Sheraton!", "title": "Great Honeymoon Destination", "helpfulness": 7, "user": "Hawaiianluau", "date": "September 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 19900198, "likes": {"liked": "— View, close proximity to shopping and reasonably priced food", "disliked": "— average sized room for the price"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "This resort is an unbelivable place. Clean, Fresh and very well maintained gardens, rooms and buildings in general.", "title": "Beautiful resort, expect a lot of walking.", "helpfulness": 1, "user": "jh1223", "date": "September 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 19809719, "likes": {"liked": "— Resort setting", "disliked": "— Distance from some building to the beach and the parking lot."}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Stayed for 5 nights in early May in a deluxe ocean front room. The room was huge. We saw a turtle from the balcony almost every day. We requested building 6 and as other reviewers mention, this is set a ways off from the main hotel. Beautiful view of beach and other islands. Very easy walk to Whalers Village where the restaurants had more reasonable prices than the hotel restaurants. Staff was very nice.", "title": "Secluded yet near everything", "helpfulness": 2, "user": "Westshore", "date": "May 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 16147632, "likes": {"liked": "— Beautiful setting", "disliked": "— Daily $20"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We stayed at the Sheraton for a week for our honeymoon and just returned. We loved it! Upon check-in we were offered complimentary valet parking our first night. Check-in was fast but we got to our room and noticed we were given a handicap room. It wasn't a huge problem but the shower chair was kind of odd. We originally booked a garden view king. We went to to the front desk and asked if we could possibly transfer to another room and they kindly upgraded us to a top floor partial ocean view, no charge. They also found out it was our honeymoon, and when we returned from dinner champagne and glasses were waiting on us.", "title": "Loved it!", "helpfulness": 8, "user": "Anne_and_Scott", "date": "May 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 16076460, "likes": {"liked": "— location"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "Anita and Monica were excellent at the concierge desk. Sam at the Starwood desk also helped us because we assumed she was concierge and didn't figure it out until we had everything we needed. They were all great and so nice!", "title": "Absolutely wonderful!", "helpfulness": 5, "user": "Vixielove25", "date": "May 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15938872, "likes": {"liked": "— Quiet, Friendly Staff, Great Location", "disliked": "— Daily fee"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We ate at the Lagoon Bar (multiple times) and at Black Rock Steak and Seafood. Everything was excellent! We both highly recommend the Lava Flow beverage!", "title": "Wonderful Experience", "helpfulness": 2, "user": "GOPHERATRIP", "date": "May 10, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 15873958, "likes": {"liked": "— The super comfy bed.", "disliked": "— Nothing, really!"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The one problem we did have was that we never figured out the shuttle service to Lahaina and the Whaler's Village. We only tried it once though. Westin shuttles kept arriving to pick up and one driver told us he couldn't take us and finally another Westin guy told us to hop on after we waited 45 mins. We found the 5 min back walk to the Whaler's Village better anyway. It is paved the whole way. Lahaina you cannot walk to. At the Whaler's Village, we recommend Hula Grill and Leilani's (sister properties). The same owner also has Kimo's in Lahaina which was great too.", "title": "Great Hotel, Great Location", "helpfulness": 2, "user": "GMullins", "date": "May 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 15816616, "likes": {"liked": "— Location, Great rooms", "disliked": "— price"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The Sheraton has a lot of things going for it. Its in a great, great location right on the widest part of Kaanapali Beach and right next to (and on top of) the \"Black Rock\" lava formation that juts out into the sea from here. The beach here is gorgeous, the lava rocks are gorgeous, the views of the island of Lanai are gorgeous, and the hotel grounds are gorgeous. Right from the moment you walk into the hotel's open-air lobby, which views down onto the sand and to the ocean, you'll know you've arrived in paradise.", "title": "You won't go wrong here...", "helpfulness": 1, "user": "MachThree", "date": "September 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 178622784}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The hotel's pool is great - parts of it are just feet from the sand. Its coral colored, and its really more like 5 pools that are interconnected by swim-able channels with bridges passing over them. You can literally walk out of the pool, take a few steps and sit down in one of the bars. The hot tub is nestled into the rocks around the pool and its equally great. The only downside of the pool is that it closes at 8PM (hot tub closes at 10PM) - sucks if you want to use the pool, but you'll appreciate the quiet if you're staying in any nearby room.", "title": "Excellence in Service, Location and Experience", "helpfulness": 2, "user": "Jon F", "date": "September 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 178503440}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We stayed for 7 nights in an ocean room view in building 4 - room 4403. The view from the balcony was gorgeous, and the balcony was very large for a hotel balcony. When we went, the weather was perfect and we could leave the window open all night with no temperature issues, just the sound of the wind and the waves hitting the shore - perfect. The room itself was an ever-so-slight let down compared to the rest of the hotel - its an older hotel which you'd not know from any of the exterior areas, but the rooms show their age just a little - furnishings slightly less modern style than you might like, and the rooms are also not very large but in the end the size was fine. Our bed was excellent - very comfortable with great, fluffy pillows. A nice touch is a mini-fridge in each room which is completely free for guest use - not filled up with snacks on sensor pads that cause you to get charged every time you touch one of them.", "title": "Great stay in Maui - central to Kaanapali and Lahaina", "user": "578ciarag", "date": "September 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 178500608}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "In any case, I found myself taking pictures from our balcony pretty much every morning and evening - even though I kept shooting the same basic picture or two every day, I just had to - it was that pretty. The same can be said for the hotel grounds - on our way to and from the fitness center, for instance, we kept stopping every day to take pictures.", "title": "Relaxing and comfortable stay", "user": "tnrll", "date": "September 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 178381444}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The fitness center, by the way, is pretty well equipped - 5 ellipticals, 5 treadmills, 3 reclining bikes, and numerous weight machines and free weights. All modern, all in good working order with ipod connections etc.", "title": "Great hotel and location", "helpfulness": 4, "user": "steph4stars", "date": "September 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178135248}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "My wife and I with our 3-year old daughter stayed at Sheraton Maui for 9 nights in December 2007. We were in building 3 ground level with ocean view lanai.", "title": "Very satisfactory stay at Sheraton Maui", "helpfulness": 12, "user": "jffyaroundworld", "date": "December 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 12018531}, {"rating": 4.0, "stay_parameters": "Stayed December 2007", "text": "The room is clean and the beds are comfortable with white linens. Other than the new flat panel TV, furnitures and facilities in the room show some aging, for example, shower head is usable but the spray pattern ring is broken, the toilet got clogged once (they fixed within 10-minute of call and gave $50 dinning credit to the account, nice).", "title": "Storms and Waves", "helpfulness": 8, "user": "AndrewCA", "date": "December 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 11996734}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "Sheraton's grounds are the best in my opinion among all Ka'anapali resorts, very open, large and well maintained lawns, great beach right by the Black Rock, no artificial gardens or fancy water falls, or imported animals in pseudo-zoo like settings to crowd the ground like Westin and Hyatt, creating an airy and laid back atmosphere best suited to the beauty of natural surroundings of West Maui. My daughter happily ran around the huge lawn chasing the real birds rather than the \"artificial\" flamingos (which she can get at any mainland zoo). We feel more like in Maui at Sheraton's setting than in other resorts. My daughter also loves the Keiki Pool.", "title": "A Nice Retreat", "helpfulness": 4, "user": "Oakparkmom", "date": "December 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 11989001}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled solo", "text": "Sheraton has some OK restaurants, but the room services suck - tasteless and expensive even at Maui standard. However, the convenient location (5-10 minutes walk along the beautiful beach path leads to Whalers Village and adjacent resorts including Westin of the same chain) offers abundant dining choices (plus shopping/grocery). An easy stroll along the beach or the path at dawn or dust also set the perfect mood for breakfast or dinner. I can't stress enough that Sheraton has the best (most convenient ) location in West Maui.", "title": "Outstanding Property - Highly Recommended", "helpfulness": 7, "user": "Jeff2086", "date": "December 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11915984}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Sheraton's services are great - quick and attentive. Once my daughter in her new Croc slipped in the lobby, after we picked her up and before her crying stops, out of nowhere came a manager offering tissues and a stuffed whale (the resort souvenir easily sold for at least $20 at the gift shop), which not only calms her down but also cheers her up for the whole day. To this day that stuffed whale with Sheraton's logo on it is still her favorite for some reason.", "title": "Great vacation at the Sheraton", "helpfulness": 7, "user": "carolinagirl221", "date": "December 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 11710334, "likes": {"liked": "— Friendly staff, beautiful grounds, nice room", "disliked": "— cold pool"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The room was great, the view was great, and the service was great – all good here and you will not go wrong.", "title": "Wonderful Time", "helpfulness": 7, "user": "slctravelers", "date": "December 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 11580838}, {"rating": 4.0, "title": "Loved the Sheraton - comfortable, laid back, quiet", "text": "The hotel is located on a street where there is great golf and just a couple of miles away from the downtown area with great shopping and many restaurant choices.", "helpfulness": 15, "user": "TheRealMC", "date": "December 11, 2007", "id": 11485329}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The hotel concierge was particularly outstanding with her help and advice. I wish I could remember her name to compliment her service to hotel management. She assured me it was ok to eat at the nearby Ruth’s Chris Steakhouse in shorts and a golf shirt.", "title": "Amazing stay at the Sheraton Maui", "helpfulness": 7, "user": "cr8withme", "date": "December 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 11288410}, {"rating": 4.0, "stay_parameters": "Stayed October 2004", "text": "I'm really not sure how you can have a bad time in Maui but I guess that you can always have a better one. The hotel lobby, bar, pool was gorgeous! Beautiful views of the ocean from most of the rooms. The carpet could have been replaced. It had lost all of its cushy-ness and had some stains. I found a great deal on priceline but it took weeks of trying to find one. The location cannot be beat. I was snorkeling in the area by the hotel and saw a baby turtle up close and personal. Lahaina and Ka'anapali are where the action is! So stay here for the great location. Yes, you should rent a car to drive to Hanaa and get up at an insane hour to go to Haleakala for the most beautiful (and coldest) sunrise ever.", "title": "Old hotel, great location", "helpfulness": 1, "user": "Chitownee", "date": "April 27, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 15412489}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "We recently stayed at the Sheraton in the deluxe Ocean Front rooms. Beautifully comfortable, lanai that faces the ocean with cliffs directly below. Saw several Sea Turtles from our room. We booked through our travel agent, and our stay included the breakfast buffet that otherwise would have cost $30 each. An excellent buffet. The hotel restaurants were very good also, and we recommend all of them.", "title": "The best loacation on Ka'anapali Beach", "helpfulness": 1, "user": "readytogogram", "date": "April 26, 2008", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 15385490, "likes": {"liked": "— location, location, location", "disliked": "— the building is located a long distance from everything, you'll need to used a couple of elevators and travel down hallways to get access to the pool or lobby areas. Takes a bit to get the hang of it."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Especially enjoyed the beach access, sunset views, cliff diver, tiki bar at the beach for light meals and drinks, pool and garden areas. The walkway down to the other hotels, and Whalers Cove shopping and restaurants was very convenient. The surf can be rough, so be experienced or cautious. The staff was very Aloha friendly, and corrected an big error when upon arrival we ended up with the wrong bedding. One night was sacraficed.", "title": "Wonderful stay at the Sheraton", "helpfulness": 1, "user": "cookers", "date": "April 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15372859, "likes": {"liked": "— View, beach, pool not overrun with kids", "disliked": "— Expense, especially for extras like beach chairs"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Overall an excellent stay, and would definitely return.", "title": "Paradise Found", "helpfulness": 1, "user": "ChristyLS", "date": "April 24, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 15322217, "likes": {"liked": "— pool complex", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We had an amazing time at the Sheraton! We had booked two garden view rooms but on arrival were upgraded to deluxe oceanfront rooms. We were in building 6, ground floor. We were on top of the cliff and had marvelous views of Molokai and Lanai beyond our patio. While the view may have been less obstructed (by some shrubbery on the fence) on higher floors, we enjoyed walking out on the grass every morning to greet the day.", "title": "Liked the Sheraton - great value but not the best", "helpfulness": 1, "user": "rlsnyc04", "date": "April 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 15150707, "likes": {"liked": "— Location, beach, resort-like feel", "disliked": "— Small rooms, average restaurants"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "My husband and I stayed at the Sheraton Maui at the end of November for 5 nights. We let them know in advance that it was our anniversary, and upon arrival, they informed us that we had been upgraded to an ocean view room (from a garden room). We were able to get the keys for our room at the greeting desk next to valet/bell service, which was nice as we didn't have to wait to check in. We just went from the greeting desk straight to our room.", "title": "total disappointment- really poor experience and never, ever again", "helpfulness": 24, "user": "marbellasanfrancisco", "date": "December 2, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 2.0, "location": 3.0}, "id": 11205845}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We were in building 4 on the 3rd floor, and our king room had a wonderful lanai and view of the ocean and down the beach. The room was a good size and in good shape - nothing was stained or torn. We appreciated having the small fridge, as we went to the grocery store to buy snacks and drinks. The bed was very comfortable. The bathroom was fine - the only complaint I have there is that the drains in both the sink and tub were slow and when we finished showering, there was typically enough water left in the tub to cover our feet. Maybe that's from the years of sand building up, but it should have been better. The room, bathroom, and lanai were all very clean.", "title": "Expensive & a disappointment!", "helpfulness": 7, "user": "PinkSurvivor", "date": "December 1, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 4.0}, "id": 11195679}, {"rating": 4.0, "stay_parameters": "Stayed March 2005, traveled on business", "text": "I stayed at the Sheraton Maui resort with a group of about 75 people as part of a recognition program through work. The hotel was beautiful but everything there is very expensive. $10.00 for a beer, $15.00 for a burger (and you pay extra if you want fries). I stayed in building 6 which has its pros and cons. The ocean view cannot be bat. I saw the \"ocean view\" from buildings 2 and 3 and it was good but you had to look over the grass, trees, and pool to see the ocean. Building 6 is a true ocean view, looking over 10 feet of grass and then ocean. The big con to building 6 is that it is a long walk to get to the beach or lobby or anywhere else. From the lobby you need to take 3 elevators and walk quite a bit, I would still say the view is worth it. We were there in MArch which is mating season for the humpback whales and we would sit on our lanai drinking coffee in the morning and watching the whales play, amazing experience. The short walk to whalers village is well worth it a neat little place with some great shopping! The snorkelling at black rock is terrific and there are several sea turtles that hang around so you are sure to see them! Just be careful when you get to the tip of the rock as the rocks look far away when you are looking under the water but when you pop your head up they are right there and the waves will push you into them...ouch! My only complaint is that they do not allow you to smoke anywhere other than the beach which causes lots of cigarette butts on the beach and is also a pain. Smoking on the lanais should be aloud but a small price to pay for the beautiful resort!", "title": "Beautiful but expensive", "user": "defiant_angel", "date": "October 23, 2008", "detail_rating": {"business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 3.0}, "id": 21137138}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "We spent 3 night in mid-October and had the best time. They were kind enough to upgrade up to an Ocean Front suite from an Ocean View standard. It was our 20 year anniversary. They gave us a bottle of champagne and a corner room with a view of Black Rock, the Luau and the Ocean.", "title": "Best hotel experience", "helpfulness": 2, "user": "Sammk", "date": "October 22, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 21115911, "likes": {"liked": "— Friendly staff, Beach", "disliked": "— Elevators inconveniently located."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Whaler's village is wonderful. Cheaper foods (i.e. McDonalds, Pizza, Taco's etc), plus Hula Grill and Leilani's.", "title": "Ideal for first time in Maui", "helpfulness": 3, "user": "Applejax", "date": "October 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 20942852, "likes": {"liked": "— Location and room view and amenities", "disliked": "— Food quality (except for breakfast buffet)"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We did the UFO Parasail and those guys (and girl) were terrific. I would recommend that to anyone in the Kaanapali area. Wyatt and crew were great to work with on the boat.", "title": "Better After 1st Night", "helpfulness": 4, "user": "TxMbr", "date": "October 16, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 20931751, "likes": {"liked": "— Location, non-smoking, location", "disliked": "— Paying extra for beach chairs"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Snorkelling in the breaking waves at Black Rock was great. Adults and kids were having a blast. Turtles and fish were easily noticed by all.", "title": "Loved the Sheraton", "helpfulness": 3, "user": "collins26050", "date": "October 12, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 20812179, "likes": {"liked": "— Location", "disliked": "— Expensive meals"}}, {"rating": 5.0, "title": "Wonderful!", "text": "Stayed five nights. The continental breakfast - Fresh, plentiful selection of fruit and pastries. A really nice way to start each day and the staff at the restaurant (Jessica and the others whose names I forgot to get) was terrific! Building 6 - as others have noted, it is somewhat of a walk from the main building. However, given the ocean view from our room, it was worth the extra steps (with some really nice views in the walk between). The beach - great place to relax, snorkel (turtle sightings) and people watch. The cliff diving ceremony at night was a nice way to connect with the history of the island. On-site activities: 1. Cocktails and show package - we wanted to eat dinner off-site so this was a good way to just see the show. The desserts did look good though! 2. Thanks to Miley (sp?) for a great time with the lei-making and bracelets arts and crafts. 3. Beginner Snorkel class - so nice that the hotel offers this. Very helpful instructor (I think his name starts with J). Thanks also to concierge, Lori (sp?) for her help with island activities and tips.", "user": "DC4NJ", "date": "September 9, 2013", "id": 176476236}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Would definitely stay at again/recommend!", "title": "Excellent...", "user": "Karen M", "date": "September 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 176392191}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We had a family suite at that went out onto the grass and close to the pool and beach.", "title": "Pleasantly surprised - excellent experience", "helpfulness": 1, "user": "LAEWorldTraveler", "date": "September 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176352638}, {"rating": 1.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Perfect location. Easy walking distance to Whalers village, which has a really neat small set of shops and eateries. They also have a small food hall there, which is great for quick meals when you have kids.", "title": "the worst hotel experience in this century!", "helpfulness": 5, "user": "TravelLikeaStar", "date": "September 8, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 176325187}, {"rating": 5.0, "title": "First time to Maui - great time", "text": "We will definitely be back there.", "helpfulness": 2, "user": "David R", "date": "September 7, 2013", "id": 176227955}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We booked our room and flight using Expedia and encountered many problems with them, including the airline loosing our luggage because of the flight we were given (they booked us an illegal transfer to our connecting flight, so our luggage didn't have enough time to get on the other plane). It was bit of a bummer when we checked into our hotel room to find out that the bed we requested for was not available. They said nothing is guaranteed through Expedia. Again, Expedia's fault! I would have rated excellent for this hotel, but we didn't have a King size bed right away. We requested a King size bed, but they only had a room with 2 double size beds available for us. It was either we take that and get upgraded to the Mountain view from the the Garden view, or we pay an additional $300 plus a night for a room with a King size bed. What was even more frustrating, we were on our honeymoon, and they weren't the least concerned with our situation. So, we had to stick it out with the double beds for two nights. It was nice, but too small for us to sleep comfortably. Finally, we were put in a king size bedroom but downgraded back to the Garden view room. Sooooo much better! Not only was it bigger, it was closer to the beach (we were on the bottom floor), and closer to the parking garage (we rented a car so we were constantly in and out). After that, our stay in the hotel was much much better =)", "title": "Beautiful hotel!", "helpfulness": 3, "user": "CCA083108", "date": "October 7, 2008", "detail_rating": {"front_desk": 1.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 20699218}, {"rating": 5.0, "stay_parameters": "Stayed September 2008", "text": "We went to the Kaanapali beach everyday (so convenient) and snorkling right next to Black Rock. We even saw very huge and friendly turtles! They just practically swim right next to you. We went to Lahaina to eat. Cute town. It's about a 10 minute drive or less away. Try Aloha Mixed Plate (great local food and reasonably priced) and Cheeseburgers in Paradise (sooo good). Also, if you love sushi, you definitely have to go to Sansei Seafood Restaurant in Kihei (make a reservation first because it gets really packed in there during their 25% sushi, appetizers, and entrees hour). We also went to the Old Lahaina Luau (worth the money...great show and great food).", "title": "The best Anniversary & Vacation ever.. Will be back soon!!", "helpfulness": 4, "user": "vacatyme", "date": "October 4, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "business": 4.0, "cleanliness": 4.0, "rooms": 4.0, "location": 5.0}, "id": 20626503, "likes": {"liked": "— most all of it", "disliked": "— PRICEY,PRICEY"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Just please don't use Expedia! Too many problems with them and pointless. No guarantees and poor customer service! I called the night that we encountered or problems, and they blamed us instead for not checking with the hotel to make sure we have the room requested as well as not making sure we have our flights confirmed. How are we supposed to know that it's an illegal transfer...", "title": "Escape from Ike", "helpfulness": 7, "user": "blyle", "date": "September 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20514688, "likes": {"liked": "— Location", "disliked": "— Food Prices"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "Overall, had a great Honeymoon and loved Maui! I used TripAdvisor to book this hotel, and all the reviews I read were true and very helpful.", "title": "A week of relxation and snorkeling at Sheraton Maui", "helpfulness": 4, "user": "lakegirlCA", "date": "September 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 20435460, "likes": {"liked": "— Location", "disliked": "— Pricing (food, daily resort fee), mattress"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Just returned from a 2 1/2 week stay here & was ABSOLUTLEY AMAZING & WONDERFUL..arrival was great, check-in was great. Everyone at the resort that we dealt with were kind & helpful with any need. We had gone here for a vacation & since it was around our anniversary, we made the best of it. My husband planned 3 days of anniversary dinner celebrations for us, one was a \"Romantic\" dinner for 2 under the stars outside. It will be one dinner nite I'll never forget. Our server was on top of everything that he had to do to make the nite special. this resort offers these type of dinners for that special day, if you think thIs will be good for you, i recommend you do it, you wont be disappointed. A lil pricey though.. As for our room, we had the best view of the sun rise & sunset. Looked right out at Black Rock and the beach. Could see the pool and down the beach from room too. Please give this place a try if you really want a do-nothing vacation. THIS IS PARADISE. We are planning to return very soon cause we didnt want to leave.", "title": "Love Sheraton Maui", "helpfulness": 7, "user": "bri11164", "date": "September 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 20417224, "likes": {"liked": "— beautiful beach, location", "disliked": "— cost of services(beach chair rentals)"}}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 124, "average": 326, "very good": 852, "terrible": 78, "excellent": 1158}, "aka": "Sheraton Maui Hotel Lahaina", "slim_ranking": 0.75, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Sheraton Maui Resort & Spa, Ka'anapali Beach's Black Rock, is near Whalers Village and Kapalua-West Maui Airport. Our Hawaii hotel has a lagoon, a ballroom, and an Ocean Lawn for weddings and meetings"}