{"user_rating": 3.5, "review_count": 1074, "name": "Sheraton Rio Hotel & Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Staff - very friendly and patient. All of the staff speaks english", "title": "A little far, but enjoyable nonetheless", "user": "razersharp", "date": "January 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 2.0}, "id": 12418173, "likes": {"liked": "— Pool area", "disliked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "Room - average room, although the balcony view was very nice", "title": "Loved the Sheraton", "user": "liburdke", "date": "January 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12295623, "likes": {"liked": "— The private beach", "disliked": "— Distance from downtown Rio"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "Location - the biggest problem with this hotel, it's a long walk to the Leblon and the other main beaches. It's not far via the hotel shuttle or taxi, but it's a little inconvenient to get back especially late at night", "title": "Pure Oasis! Loved it!", "user": "BlueWhirl", "date": "December 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 11916645, "likes": {"liked": "— The beach", "disliked": "— The door staff pushing us to ride their expensive limo."}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "Amenities - the outdoor pool and beach are pleasant. The pool area is spacious and you can lounge outside anytime of day/night with a nice bottle of wine. The beach is not huge and not entirely private, but is still nice (beach access closes at 6PM everyday).", "title": "Not a good example of the brand", "user": "Ptibbs", "date": "December 9, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 1.0, "rooms": 2.0}, "id": 11416608, "likes": {"liked": "— Check-in was peformed competently", "disliked": "— The rooms"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We used starwood points to reserve this room, so can't speak to value. I think next time we may look at staying closer to the main beaches, but we enjoyed our stay at the Sheraton.", "title": "Very disappointing", "user": "Ireland75", "date": "November 27, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 5.0, "value": 2.0, "location": 2.0, "rooms": 4.0}, "id": 11091057, "likes": {"liked": "— It was clean", "disliked": "— It was impersonal and in a bad location"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "This was our second visit to Rio so we had a pretty good idea where we wanted to stay. We chose the Sheraton Hotel & Towers because of its location. It's the only Hotel in Rio that is right on the beach. The others may have ocean frontage but a dual carriageway seperates you and your balcony from the beach itself! Also it's away from the tackiness of Copa and Ipanema.", "title": "Great location shame about the food", "helpfulness": 2, "user": "Couple_W6", "date": "February 8, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "business": 2.0, "cleanliness": 3.0, "rooms": 3.0, "location": 5.0}, "id": 13383786, "likes": {"liked": "— The stunning views from our room and being right on the beach.", "disliked": "— The mediocre and over priced food!"}}, {"rating": 3.0, "title": "OK, bland corporate hotel, but ok", "text": "So what were the upsides of the Sheraton (best i start with that!)", "helpfulness": 1, "user": "DDDublin", "date": "February 8, 2008", "id": 13374001}, {"rating": 3.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "The location is absolutely fantastic if you want to get away from the crowds but still close enough to what's happening. The beach is a public beach (some guests we spoke to were led to believe it was a private beach) however the Sheraton does have it's own area with helpful attendants, recliners and umbrellas. We stayed in an Executive suite on the 10th floor that had stunning views of the ocean, Rio and the local Favela - one of the few times i did have to pinch myself when we got to the room because the view was so amazing. The best moments were watching the fire works on New Year's eve and then watching the sun rise the next morning when we got back from a new year's party. Leblon is a 10-15 minute walk down the hill (or a $R8 taxi ride back up) where some of Rio's best restaurants are located. Its very safe to walk into Leblon. Pick up a copy of the Wallpaper City Guide for Rio for tips - our favouriet was Quadrucci on Rua Dias Ferreira 233. Be sure to arrive by 8:30pm to claim a table before the locals arrive!", "title": "mixed reviews", "helpfulness": 1, "user": "rc51", "date": "January 24, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 2.0, "rooms": 3.0}, "id": 12957785, "likes": {"liked": "— view from room - attractive landscaping around hotel.", "disliked": "— rip off food and drink prices."}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled solo", "text": "So now the downsides. The hotel is very very tired and well overdue for a face lift. The Sheraton's website has obviously used photoshop on this hotel as the exterior of the building is crumbling. The rooms are adequate but nothing special. The gym equipment is old but functional. There are two pools but the temperature in one is like having a bath...not what you really want when its 33 degrees outside. The sea water is not the cleanest. On our first trip to Rio i got an ear infection - would seriously advise not to put your head under the water. Also there were days when rubbish and other crap would wash in. The most annoying thing however was the food quality and cost. It was incredibly expensive (now that's saying something given i live in london and eat out alot!) and very very average. I'm very happy to pay top pound (or even dollar) when the food is exceptional but i object to paying overly inflated prices for mediocre dishes, especially those that are not even executed correctly (i'm sure a Ceasar salad comes with a Ceasar dressing - not at the Sheraton!) The best i can suggest is clear out the mini bar and stock up at the local supermarket (Zona Sul, Rua Dias Ferreira) or head to one of the many local cafes in Leblon for Brunch, lunch or dinner!", "title": "It's Not Bad", "helpfulness": 3, "user": "Guyanaman", "date": "January 13, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 3.0}, "id": 12570221, "likes": {"liked": "— The view from the room", "disliked": "— The isolation"}}, {"rating": 1.0, "title": "Rip off!!! Stay away!!!", "text": "Would i go back? well yes and in fact we are going back again this Christmas. Rio is a fantastic holiday destination to escape the british winter - 11.5 hours from London, 2 hours time difference and a reasonable exchange rate. And yes we intend to stay at the Sheraton as the upsides outway the downsides now that we know what to expect. I just think they have missed a huge opportunity to make it a fantastic hotel.", "helpfulness": 3, "user": "braziliangipsy", "date": "January 12, 2008", "id": 12555648}, {"rating": 3.0, "title": "loved my room and view! Solo traveler", "text": "this was a beautiful hotel and compared to the other hotels in the area it was the right price for the money you spent. the veiws that my balcony overlooked was gorgeaus. It had a shuttle bus and a nice walk to the beaches even thought it has its own beach and pool. I went here by myself and felt safe and no I spent not over amount of money for a wonderful treat and escape.", "user": "traveler#4343", "date": "November 17, 2007", "id": 10869232}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "Basically this is a well run and comfortable hotel and myself and our family enjoyed our four night stay. The position is a bit isolated but the pool is great and it is very safe and secure.", "title": "Beware I paid over US$10 per min to use the bedroom phone", "user": "RichardBahia", "date": "November 13, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 10800610, "likes": {"liked": "— Location close to the sea and enough space to use for leisure in a buisy city", "disliked": "— The exhorbatant exploitative and unethical phone charges"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2005, traveled as a couple", "text": "Do not use the phone in the room unless you are prepared to pay a very high price. My 15 min call to the uk cost me US$162 and that took the pleasure of the stay away somewhat. The management were not helpfull about reducing the call rate so i am warning other travellers.", "title": "Hit and miss", "helpfulness": 3, "user": "Scarletti", "date": "November 4, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 5.0, "value": 3.0, "location": 1.0, "rooms": 4.0}, "id": 10582118, "likes": {"liked": "— The view", "disliked": "— The architecture and the location"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "First of all, don´t be fooled by the Leblon address. The locals will tell you this hotel is in Sao Conrado but in reality it´s in neither place. Standing on its own on a high piece of coast road beyond Leblon, the Sheraton is an ugly Stalinist building with a beautiful view and access to a small sandy beach. It is clean and shiny - a typical international business hotel, (although the business centre was shut on the day of a Brazilian public holiday when the rest of the business world was working.) On first impression, it is well staffed and welcoming but scratch the surface and you´ll find that while they´re efficient at opening doors and hailing cabs, the service is extremely hit and miss. One of the delightful pool attendants launched a massive search when we lost our sun lotion yet the front-desk staff had zero information about the Fifa World Beach Soccer Championships which were kicking off in Rio the following day. Being a 30-minute drive from Centro, we asked if the concierge could help us book tickets for the Teatro Municipal. He just gave us a phone number. We had to deliver our own laundry to the generally grumpy front desk because no one came to collect it, then they charged 50% extra because of the public holiday. Two shirts and a pair of trousers cost $60 to wash and press. The food was average but, like the laundry, highly priced.", "title": "beautiful hotel", "user": "pod5a", "date": "October 31, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 10478858, "likes": {"liked": "— beautiful grounds", "disliked": "— expensive to eat and drink"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "If you want a choice of pools, tennis, a well-equipped gym, anonymity and just to look at the city from a distance, or if you´re aircrew, then this hotel does the job. But if you want to step out of the door and embrace Rio, wander to the neighbourhood deli, watch the Cariocas and not to plan your excursions around the five-times-daily shuttle bus, then choose Ipanema.", "title": "Very disappointed", "helpfulness": 1, "user": "Spineynorman", "date": "October 30, 2007", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 10442025, "likes": {"liked": "— Good pool area", "disliked": "— Not delivering what we had paid for"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "I staid 2 times in last 4 months and in each occasion we had problems with rooms cleanless, service, etc.", "title": "Disappointing...just a 3 star hotel", "user": "RobertoChile", "date": "May 7, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 15754518, "likes": {"liked": "— swimming pool area", "disliked": "— all the rest"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "It is an old hotel with a nice swimming pool and lobby area, but tha´s all. It is not at all a 5 star hotel", "title": "would not recommend this place", "helpfulness": 2, "user": "s786rizzo", "date": "April 27, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 1.0, "rooms": 2.0}, "id": 15398025, "likes": {"liked": "— nothing", "disliked": "— the poor service not representative of a afive star hotel"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "It remained in his 70´s and 80´s glory but need urgently and update in rooms.", "title": "Quite Good", "helpfulness": 1, "user": "Sara37pink", "date": "March 18, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 5.0}, "id": 14360738, "likes": {"liked": "— Location", "disliked": "— expensive"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "In each occasion we complained because the rooms was not really cleaned, or the service personnel left the room door open. They offered us points in starwood frequent client, and second time a better room.", "title": "Good hotel", "helpfulness": 1, "user": "huntzilla", "date": "March 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 14070419}, {"rating": 3.0, "title": "Enjoy you time in the sun, not in the room.", "text": "The big problem is the personnel for rooms is not qualified, and rooms are really like an old 3 star hotel (superior, deluxe and suite).", "user": "piggipiggy", "date": "February 29, 2008", "id": 13947635}], "location": {"country": "Brazil", "continent": "South America", "city": "Rio de Janeiro"}, "stars": 4.5, "variance": {"poor": 92, "average": 220, "very good": 421, "terrible": 66, "excellent": 275}, "aka": "Sheraton Rio Hotel And Resort", "slim_ranking": 0.191176470588, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 3.5}}