{"user_rating": 4.0, "review_count": 185, "name": "Sheraton San Jose Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2012", "text": "It's your canned clean and white tiled hotel with very basic outlook . Nothing against it but it could do with some jazzing up. Menu options are very limited and after the second day there's not much left to explore. However I would stay here again for the location alone.", "title": "Average for a Sheraton", "user": "ab_bangalore", "date": "January 1, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 148507260}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "Have stayed here in the past, as it close to our corporate headquarters, was a tired kind of property, kind of sleepy and generally not the greatest experience.", "title": "Really improved - vibe very good", "user": "roxygirl100", "date": "December 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147734681}, {"rating": 4.0, "stay_parameters": "Stayed December 2012", "text": "Not sure what happened - but place is still the same - vibe is different. Gym has been moved - larger, sunnier, more equipment - its good. Club Lounge - good stuff served; staff are humming - like everyone is very friendly and welcoming which kinds of makes you feel better when travelling far from home; and the bar was rather hopping last night - we had a business meeting and decided to stay there an nosh on the appetizers rather than going anywhere else. Wine sampling event was great - apps are good - although some healthier options would be a good idea.", "title": "The reason I rate the hotel poor in service because wifi is not FREE", "user": "Jaunesk", "date": "December 16, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 2.0, "rooms": 4.0}, "id": 147523894}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Big room, very comfortable double beds. Big flat screen tv with heater. Bathroom is spacious and very clean indeed. I am very grateful of the hot shower after returning from the chilly weather near to 17 mile pebble beach. Only disappointed at the availability of wifi is on paid basis. Also location is less favorable and out from basic amenities.", "title": "Comfortable, even if for only 12 hours", "user": "stevejnb", "date": "November 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 145558857}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "I was here for a mere 12 hours. A quick overnight stay for clients within the vicinity. It's a Sheraton, which means your largely guaranteed a great night's sleep. This night was no exception. The location is actually very convenient for the San Jose, Santa Clara area.", "title": "Nice Stay for 13 nights", "user": "ken_compassvale", "date": "October 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 143689710}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "The hotel is a standard Sheraton located in the heart of the Silicon Valley. Rooms are large and hall ways are spacious. Plenty of parking space. A shuttle bus takes you to the surrounding major companies and the SJC airport. Not many restaurants or shops within walking distances, but if you drive for 2 min there is a bunch of choices. The Great Mall is close by and it is full of outlets. I did not use the facilities here (gym, restaurant, pool etc) but the internet in the lobby is free and works fine. I checked in early in the morning and there was no problem (as long as they had rooms). The wireless internet in the room worked only intermittently during my stay and that is the only complaint I have.", "title": "Large room, convenient location", "user": "lizzylizzy", "date": "January 23, 2013", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "location": 4.0, "value": 4.0, "rooms": 5.0}, "id": 150450359}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled solo", "text": "I stayed here this past weekend for two, non-consecutive nights and stayed in two different rooms.", "title": "Average stay, some rooms significantly better than others", "user": "Jamesnyc87", "date": "January 15, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 149704905}, {"rating": 2.0, "stay_parameters": "Stayed January 2013", "text": "The first night I was put into room 612 which was a courtyard facing room on an SPG preferred floor (floors 6-8 are SPG preferred, floor 9 is club) with a view of the valley. The hallway and room itself were bright, impeccably clean, and looked like they had undergone a recent renovation. The room was also definitely on the larger side of hotel rooms that I had stayed in before. The only thing that made my stay less than enjoyable that night was a connecting door to the room next to me which didn't lock properly. Noise pollution is always a pet peeve of mine when staying at any hotel and although the walls of the room felt solid, the fact that there was a connecting door meant I could hear every cough from the neighboring room and their early morning activities. There are also no door sweeps on the front doors which means that you can hear doors slamming as people leave their rooms in the morning and housekeeping moving from room to room.", "title": "An unpleasant stay", "user": "stardream", "date": "January 14, 2013", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 149650997}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "The second night I checked in the desk agent informed me that I had been blocked into a 4th floor room (non-spg floor), despite my gold SPG membership and the fact that I had requested in advance to be put into a higher floor room. I politely asked her if there was anything available on one of the SPG floors and after confirming that I would be checking out at the normal time the next day she was able to put me into room 824. This room was definitely much better than the last as it had no connecting door and came with a balcony and awesome views of the valley. The room was again, large, clean, and looked like it had recently been renovated. The only negative was that the heater in this room didn't seem to work properly as I set the thermostat to 75 at night and woke up with the room being 63. I felt the heater periodically before going to bed as well and it was only blowing slightly warmer than room temperature air.", "title": "No Frills hotel.", "user": "Jan V", "date": "January 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 149593930}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Overall the facilities and rooms were nice and the hotel provides decent value for the price point, however it does seem like a shot in the dark as to what your experience will be depending on where you are put in the hotel. I can't comment on the restaurant, gym, or other facilities as I really only used the hotel to sleep. Location was good with easy access to the freeway and a large shopping complex about a mile down the road.", "title": "Good experience for Starwood members.", "user": "WTravelerSeattle", "date": "January 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 149224355}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Okay but not great. The room is spacious. The TV is small, perhaps 32\" flat panel with a bunch of standard def channels and no HBO. The bathroom is spacious, but only one tiny difficult to open soap is provided, no shampoo. The internet is slow and flakey--after agreeing to the $9.95/day charge on my cell phone it reprompts me to login again every time I move around in my hotel room. Dropped facetime calls regularly even staying in one spot. Beds are okay, not sure why people think they're \"great\". The front lobby is very nice, and I was served quickly. The desk area is spacious, with wired Ethernet connection. But no desktop power plugs, so you have to dig around behind old-school to find a place to plug in. The pool, which I won't be using, appears to be very nice.", "title": "Decent cheap hotel", "user": "Fanfoot", "date": "August 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 137128230}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "My family of four stayed four nights in a two room suite at this wonderfully appointed hotel. It was very spacious and quite comfortable. We were located in the tower. It overlooked the pool and had a nice balcony. The beds were quite comfy and the 2 TVs were great for watching the olympics. The hotel seemed busy yet the room was very quiet. The grounds were lovely with ample lounges and tables by the pool. My kids loved the pool but I wasn't crazy about the hot tub as it was very cloudy. The last day of my stay the spa was drained and refilled. It appeared much nicer. We would definitely return to this property. No real complaints. Enjoy!", "title": "Truly enjoyed our stay!", "user": "Christina C", "date": "August 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 136074851}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "My daughter & I stayed here for a night on our way to San Francisco to visit friends in the Silicon Valley, we only wished we had more time to spend because the hotel was everything we were looking for. The location was perfect for us since it was a short drive to the Great Mall Outlet with lots of shopping, as well as, a good selection of food court & chain restaurants. If you prefer Asian, I highly recommend Vung Tau II on Milpitas Blvd that serves one of the best & most authentic Vietnamese restaurant in the area. The hotel itself offers spacious rooms, comfortable beds, work-out/gym, free parking, & vending machines on the floors. The rooms all face the inside courtyard garden area which is wonderfully landscaped with waterfalls, a heated jacuzzi, and a lap pool. Also available is room service from the hotel's restaurant, Bistro. For guest's convenience, the lobby offers a 24 hour convenience store for snacks & sundries. The front desk staff were ever-friendly when we checked into our room, the check-out was even faster when we were in a rush to leave. I was pleasantly surprised to discover they offer free WIFI throughout the hotel though when I booked through Orbitz it stated there would be an extra charge unless you use the computers in their business lounge. Furthermore, they offered a later check-out time at 1 pm so we were able to take another dip in the pool before our departure. With free shuttle to the San Jose airport, this would be an ideal stay for anyone visiting the area and we would definitely choose to return again soon. The ONLY drawback is that the rooms are NOT equipped with personal safe (though you can check-in valuables at the front desk to be stored in the hotel's safe) NOR are the rooms equipped with mini fridges.", "title": "What you expect from a Sheraton! 5*", "user": "Patriciaychou", "date": "July 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135898386}, {"rating": 4.0, "title": "Great place, comfy beds.", "text": "Would definitely stay here again. Great location/pool/rooms/workout room w/ free parking and great shopping nearby. Pool area and hot tub is very nice. Peaceful waterfall nearby.", "user": "gobige", "date": "July 29, 2012", "id": 135696043}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Only drawback is charging for internet - a bit cheesy when it's free in the lobby. Nice computers in the lobby though.", "title": "Ok but nothing special", "user": "srk3465", "date": "July 21, 2012", "detail_rating": {"cleanliness": 3.0, "sleep": 2.0, "location": 1.0, "service": 3.0, "rooms": 4.0}, "id": 134957457}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "If you have a business meeting nearby in San Jose or the Silicon Valley, or are going to a late concert at HP Pavilion in San Jose, this is a good spot to rest overnight. The hotel is about an 8 minute drive to downtown San Jose. The hotel rooms are very clean, and the Suites have an additional living area with wet bar, sofa, big TV and side table. The beds are super comfortable, which you anticipate if you've stayed at the Sheraton brand before.", "title": "Nice, Clean Hotel in Milpitas", "helpfulness": 1, "user": "RobSwims", "date": "October 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 142488195}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Tips:", "title": "Very welcoming", "user": "Keith7285", "date": "September 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 140247118}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "1. The breakfast buffet is a great value. There are the typical hot dishes like eggs, bacon, sausage links, pancakes, french toast, along with fresh fruit, steel-cut oatmeal, cold cereal, bagels and pastries. The breakfast buffet will fortify you for the day head.", "title": "Decent rooms, mediocre service", "user": "Michael P", "date": "September 5, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 139447512}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "2. The hotel itself is located in a fairly nondescript area. Most likely you will have a car if you are staying here (and parking is free). There aren't many places walking distance from the hotel - the surrounding area is composed of various business parks and freeways. Be sure to map our your day in order to emerge from the hotel with a plan for business or leisure.", "title": "Nice hotel for short stay", "user": "Debbie R", "date": "August 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 138724970}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "A good place to stay for business during the week, or with families on the weekend (there's a fun pool area.)", "title": "Hidden gem...", "helpfulness": 1, "user": "Dennis W", "date": "August 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 138253800}], "location": {"country": "United States", "city": "Milpitas"}, "stars": 3.5, "variance": {"poor": 6, "average": 42, "very good": 72, "terrible": 8, "excellent": 57}, "aka": "Sheraton Milpitas", "slim_ranking": 0.315789473684, "description": "Enjoy a warm welcome at the Sheraton San Jose Hotel. Close to Silicon Valley, The Great Mall, and Paramount's Great America Theme Park. Offers 14 different meeting spaces."}