{"user_rating": 4.0, "review_count": 510, "name": "Sheraton Tel Aviv Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The hotel is in a good location about half way between the new and trendy port area and Jaffa with a long promenade along the seafront which is ideal for walking and people watching. However the Hotel itself is beginning to show its age with tiny bathrooms and basic facilities even in the expensive Tower rooms which we occupied. The beds are comfortable but quite small as they don't offer 'king size' ones. The Towers club floor is staffed by friendly and helpful concierges but is relatively uninviting and the food which is put out throughout the day of mediocre quality. In particular the choice at breakfast is considerably less than a typical israeli breakfast although the choice and quantity is considerably better in the main dining room. However this suffers from over crowding and the most appalling hotel carpet I have ever seen! Having said that the restaurant staff were better than average and the Friday night dinner excellent as was the New Years party we attended. As it was winter the pool area was deserted although the Beach opposite the hotel was more inviting especially when the sun shone. For a small charge sun beds and umbrellas were available and even in December the sea was warm.I think the hotel is more suited to businessmen than tourists but overall it was quite good but let down by the bathrooms and a somehat tired and shabby restaurant.", "title": "Could do better", "helpfulness": 1, "user": "Masterspy", "date": "February 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 56358526}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "Just spend 2 nights there and overall a very nice stay. Clean and good service. Towers lounge was always open with something to eat and drink. Friendly service too.", "title": "A nice stay", "user": "HK8188", "date": "February 14, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 55950182}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled solo", "text": "Modern American style chain hotel located in the center of Tel Aviv right on the Mediterranean. About 20 minutes from the airport ($40 taxi ride.)", "title": "Good location, nice modern hotel", "helpfulness": 1, "user": "CMMNYC", "date": "February 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 55396072}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "Average sized room with good amenities -- coffee maker, hair dryer, Bliss products in the bathroom, flat screen TV with a variety of cable stations, standing balcony (amazing view!), work desk and an area for sitting also an ironing board and iron. Complementary bottle of water each day and turn down service which was nice. Bathroom a bit on the small side but nice fixtures, plenty of towels, nice products, etc. Room had plenty of storage space (large closet, shelves, large drawers and in room safe.)", "title": "Good Business Hotel", "user": "KenNewYork", "date": "February 4, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 55207720}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "Extensive breakfast served in beautiful room overlooking the sea.", "title": "Decent hotel, good location", "user": "Loves_good_things", "date": "January 26, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 54429994}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled solo", "text": "It is like my home now. Twice I was staying with them already and would come there again!", "title": "Very nice people working there", "user": "sunrisenyc", "date": "May 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 65493421}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "Only one thing is stopping me to visit Israel, it is their STUPID security system at airport.These people (security) have to take more language classes and get more professionalism. They do not understand we pay them and we are expecting to have fun. And NOONE can go trough our pictures in our cameras! .....", "title": "Fabulous Experience", "user": "pammy79", "date": "May 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64776542}, {"rating": 1.0, "stay_parameters": "Stayed May 2010", "text": "All my good impressions about people and country are down!", "title": "Is it really Sheraton?", "user": "Serbese", "date": "May 19, 2010", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 64689917}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "I would never recommend anyone to go there!", "title": "beautiful hotel, home away from home", "user": "DrMoo", "date": "May 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 64176873}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "We were so pleased with our surprise trip and stay at the Sheraton Tel Aviv. The hotel staff were incredibly accomodating to us and our young son. We loved the pool, breakfast buffet, lobby bar and staff. We came during a very busy time (the Tel Aviv Maraton) and the hotel staff was very well organized and hospitable. Several nights, we took cabs or needed guidance from the concierge as to which market - cafe- travel spot might be best. They were very helpful. Our room was clean and they always provided extra treats for us! Thank you for a great experience. We would definitely recommend the hotel and hope to return for a visit one day.", "title": "Great location but dissapointing", "user": "mdditt2000", "date": "May 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 64099544}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "The hotel rooms are okay - nothing special. the location is difficult for the beach as you need to cross a busy street. the fitness center is satisfactory. the business lounge lacked a variation of food. we were offered the same food daily- hard boiled eggs, raw vegetables, salad, fruit and breads coffee, teas, cake soda, cakes and alcohol.computer for use was available outside of lounge and in the business center; the hotel services and staff was abrupt and difficult to deal with. They were not help[ful with driving directions and sightseeing instructions. We would have benefited greatly if we had a gps. With their detailed instructions we go lost drive around Tel Aviv. Went to the beauty salon. The manicurist and hair stylist did a nice job. We stayed here on points, otherwise I would have left early.", "title": "The first and last time", "user": "sunsurfandsand", "date": "June 21, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 68146909}, {"rating": 1.0, "title": "fee change while on the phone...terrible", "text": "I was on the phone to book this hotel for sept for 230.00 US dollars", "user": "leslieellen", "date": "June 20, 2010", "id": 68108685}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "while we were making the reversation, the employee changed the rate to 270.00..", "title": "Nice rooms but a bit noisy; Service could be better", "user": "ontheotherside", "date": "June 15, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 67544510}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "how could this be such bad public relations??????", "title": "Nice hotel with some improvements to consider", "helpfulness": 1, "user": "dremotion", "date": "May 31, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 65867955}, {"rating": 1.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "i would never stay in any starwood hotel again or make plans to if it was the last hotel around", "title": "a black spot in paradise..", "helpfulness": 1, "user": "sjshoot", "date": "May 30, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 65834881}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Good hotel across from the beach with a pool and fitness center. Prices are reasonable for Tel Aviv for what you get.", "title": "Very Nice In Nice Location", "user": "sailingdays", "date": "April 12, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 61056404}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "This is a very nice large hotel in a great part of town,across from the beach and close to a lot of restaurants. Staff was good, like most major hotel the food was very expensive, you can cross the street and eat well for a lot less. My only disappointment was we requested connecting room they did not meet the request the best that could do was 3 doors down, disappointing for such a large hotel", "title": "Nice Hotel No issues", "user": "dvcguy", "date": "April 10, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 60944648}, {"rating": 2.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "room was not ready (after a 20 hour flight). waited in lobby overlooking the see (water damage visible on ceiling above window. Positive: good location (but you have to cross a busy road to the beach), nice coffee machine in room. Negative: very uncomfortable bed - very old mattrass (sinks in the middle). worst one we eer experiences in a 5 star hotel. had to ask for coffee creamer and other supplies like tea bags to be replenished in our room a couple of times, to which there was an arrogant response. pool area closed at 5 pm sharp even though it was a lovely sunny day. we were told o leave the sun lounges near the pool in a very firm tone (why not make this sun area available on a nice day?). room's balcony is useless because too small. hotel security seems invisible. room had an extremely worn out/aged look. would not rate this to be 5 stars. breakfast was good, although of course very disappointing on Sabbath (little freshly prepared food, old eggs boiled the day before etc) even though they charge big bucks. there are special elevators dedicated to (slower) sabbath use. Overall: very disappointing. Stay somewhere else. There is a nice hotel nearby (100 metres away) and it is right on the beach (not separated by the very busy road). Access to the beach from the Sheraton is past some rubbish dumpsters and then involve crossing a busy road. Town centre is walking distance from the hotel. just go up Allenby Road and you get the Tel Aviv market.", "title": "very disappointing", "helpfulness": 1, "user": "Rumplstiltz", "date": "April 6, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 60602215}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "As a Platinum SPG member, I stay at lots of Sheraton hotels. The Sheraton Tel Aviv was a very good choice. Right on the wide, beautiful beach with view of the old port of Jafffa. Lots of restarants around. Taxis plentiful and specially selected by Sheraton. Charged taxis to the room. Upgraded to modern room in the Towers section so checked in on 18th Floor. Very polite Manager named Mazal and employee Keren were exceptional in assisting me with some information. Felt welcomed the whole time by Sheraton staff. Club Lounge on 18 floor was excellent with English language newspapers and food and drink, including wine and vodka, plus cofffee machine, throughout the day. 2 free computers with printer available. Business Office downstairs with 8 computers. Very large lobby with lots of couches to relax, order from the bar, or just look at the beach. Concierge was helpful as was the Front Desk. Very clean, modern, organized hotel compared to outside. Had nice swimming pool with many lounge chairs and a small fitness center. All staff spoke English fluently.", "title": "Hotel Was Fully Occupied for Good Reasons", "helpfulness": 3, "user": "PAQ", "date": "April 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 60381125}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Hotel was full all 4 nights I stayed there. Elevators came quickly nevertheless. Breakfast in main room was plentiful and varied. Definitely staying here again when in Tel Aviv.", "title": "Must do better", "helpfulness": 3, "user": "starflyergold", "date": "March 5, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 57776396}], "location": {"country": "Israel", "continent": "Middle East", "city": "Tel Aviv"}, "stars": 5, "variance": {"poor": 30, "average": 98, "very good": 193, "terrible": 16, "excellent": 173}, "aka": "Sheraton Tel Aviv", "slim_ranking": 0.524390243902, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}