{"user_rating": 3.5, "review_count": 605, "name": "Sheraton Buenos Aires Hotel & Convention Center", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "This is a fairly nice Sheraton. Lobby is very attractive and club lounge is good. Rooms are standard. Carpets dirty and walls a little banged up but overall acceptably clean and comfortable. If you're a Starwood member, it's fine but not special. If you can afford to pay a little more, stay at the adjacent Starwood Park Tower Hotel. It's fabulous!", "title": "Nice business hotel", "user": "traveler222Irvine", "date": "April 14, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 103977899}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "While the location is good (not as great as everyone writes, but it is very good), this was a disappointing stay. The hallway carpets are dirty – not just in spots, the carpets are filthy. The carpets in my room were filthy. I’m not the pickiest of travelers, but this was unacceptable. If I thought that other rooms were cleaner, I would have asked to change, but given the condition of the hallways, I didn’t even bother asking. The room was basic Sheraton, nothing special, and the bed was comfortable and clean.", "title": "Convenient but not of the highest quality", "user": "aikoaikoallday", "date": "March 26, 2011", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 101599397}, {"rating": 1.0, "stay_parameters": "Stayed March 2011", "text": "The lobby seemed crowded at all times – I never saw a floor manager coordinating the crowds. There is no concierge!! If you want a restaurant recommendation, you’ll need to ask the bell captain, who is quite busy helping the multitudes of travelers with their checked bags.", "title": "Poor Service, no value for money", "user": "WombatWanderer", "date": "March 11, 2011", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 99813222}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Bottom line: This is a very basic convention hotel", "title": "The better Sheraton choice in Buenos Aires", "helpfulness": 1, "user": "TravelandLearn_11", "date": "March 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 99712732}, {"rating": 3.0, "stay_parameters": "Stayed March 2011", "text": "Very disappointed in Sheraton. For the daily rates we are paying you would think they could afford to squeeze in free WiFi (and I don't mean the 30 mins per day you get restricted to their Business Ctr in the lobby). Perhaps it's a BA thing (but I don't think so) that people wouldn't mind taking yr money but couldn't be bothered cracking a smile to earn it. It's like Customer Service is beneath them. The concierge makes it plain that our requests are more an imposition than an obligation on the part of the hotel for the money we have parted with. I think it goes without saying that what customers are paying extra for is a higher level of service. At this Sheraton, all we are paying for is the expectation of that service.", "title": "Bad experince with the hotel", "user": "cicu087", "date": "March 3, 2011", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 98793585}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "We where in a very big group and they made very good service for us with breakfast in our own big room. Very good food (breakfast and dinner). Nice pool area (inside and outside pool) with lounges where you can have some sun or a bath or just have some food and drink.", "title": "Great businesshotel in a beautiful city", "user": "kmfalch", "date": "February 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 96453016}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Nice rooms. Clean and comfortable.", "title": "We both loved the hotel", "user": "2valentine", "date": "February 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 95231879}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "We had a lot of busses picking us up from the backside of the hotel everyday and there where enough space for all of us to wait for the busses outside. And also enough space for all the buses.", "title": "ba stay", "user": "brookdj1", "date": "January 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 92145466}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled solo", "text": "I am not shure about the location (if it's good or bad) because we where driving in touristbusses everyday). But we had a 10 minutes taxitrip to Palermo (a nice part of town with a lot of nice shops and cafés).", "title": "nothing thrilling, just big rooms and good location", "user": "gvdima", "date": "January 3, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 91635306}, {"rating": 3.0, "title": "3 star property...needs an overhaul.", "text": "We stayed 9 nights. We were on the Club Level which is truly special. The Breakfest Buffet is fantastic. Great variety and beatiful presentation. They even give you Caviar. The Fitness Center is very well equipped. The pool has plenty of Chaise Lounges and the snack bar is very good. We had terrific Martinis for 75 pesos in the lobby bar that come with nice snacks. They serve Cheese, Fruits and great deserts free between 2-9 in the afternoon. The location of the hotel can not be beat. We usually stay at Westins or Luxury Collection hotels and this place was as good as any. We highly recommend this hotel!", "helpfulness": 1, "user": "Cosmonator", "date": "December 30, 2010", "id": 91159886}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "The hotel in central Buenos Aires is well-appointed and consistent with Sheraton quality. The room was an adequate size and the king-sized bed was quite comfortable. The main advantage of the Sheraton Convention Center is its location and proximity to the city center. We received reliable restaurant recommendations from the concierge and other staff members were also accessible to answer questions.", "title": "Slow Internet Makes it Tough for Business", "helpfulness": 1, "user": "joeb1249", "date": "May 21, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 109196159}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "There are only two restaurants in the hotel and quality varied widely from one meal to the next. The breakfast buffet, included in the room price, was quite good and offered a wide variety of choices. For the sake of convenience, we ate dinner in the hotel one night and it was quite disappointing. In an area of fine and plentiful beef, the Sheraton restaurant served one of the worst steaks imaginable. It was tough as shoe leather and just as flavorless. This opinion was borne out by a colleague who suffered the same fate. Fortunately, there are much better restaurant choices within walking distance of the Sheraton.", "title": "Sheraton could do better than this", "helpfulness": 6, "user": "rafkam", "date": "May 15, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 108349533}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "Internet service, which usually costs around $20 US, was included in our negotiated rate, but it was excrutiatingly slow, to the point of being unusable. Even the simplest task took an excessively long time, which was frustrating for a business person trying to work. If they resolve their Internet issues, it would be a much better hotel to use for a business trip.", "title": "best in argentina", "user": "vivekkmehta", "date": "May 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 108156592}, {"rating": 2.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "I have stayed here about 3 times in the last year, for business. I used to stay in the boutique hotels in Palermo, but that meant a 45 minute commute, and the \"boutique\" hotels are becoming mre and more expensive and increasingly poor value. As an SPG Platinum member, I decided to give this hotel a try, and have repeated my stay, so here are my findings:", "title": "Passable is the best I can say", "helpfulness": 2, "user": "opivp", "date": "May 7, 2011", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 107258206}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "With an SPG Platinum status, I got \"upgraded\" to a club level room. A club level room is nothing more than a regular room, with access to a very basic club lounge. You need to order drinks (even soft drinks) from the staff, which takes ages, and the snacks are subpar. Breakfast is better, but again, subpar. I ordered a beer at the club lounge one day and found it charged to my bill. So basically the \"upgrade\" is meaningless.", "title": "Buenos Aires", "helpfulness": 1, "user": "proibita21", "date": "May 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 107037527}, {"rating": 2.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "Before I get to anything else, I believe that the first and most important job of any place of lodging is to provide an atmosphere for a comfortable night's sleep. The Sheraton utterly fails in this regard. When we checked in, we asked for a quiet room, away from the street. Instead we were given a room on the third floor, directly overlooking an extremely noisy street, and right next to the elevator. We asked for a new room. We were moved to precisely the same location, this time on the 17th floor. Even at that height, the room at night was like trying to sleep in the middle of a traffic jam. Plus, people getting off the elevators woke us up all night. We had two small kids with us, and can't understand why our request for at least a relatively quite room couldn't be accommodated. I believe it's because we had a special room rate, and we were given the worst rooms. While I understand that hotels do this to, e.g., Priceline customers (1) I've never been refused a quiet room when asking the 2nd time; (2) we were not Priceline customers, but had a special rate because my company does hundreds of thousands of dollars of business with the hotel each year'; and (3) no modern hotel, much less a Sheraton, should have such poorly insulated windows that a 17th floor room is so noisy!", "title": "MUCH too Noisy", "helpfulness": 2, "user": "danielbeez", "date": "December 27, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 4.0, "location": 2.0}, "id": 90847363}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Finally, the next day we moved to the 22nd floor, to a club room overlooking the river instead of the street. This room was much quieter, but would you believe that even on the 22nd floor, not right over the street, you could still hear car horns honking very clearly at all hours?", "title": "Good hotel but...", "helpfulness": 1, "user": "junglyhh", "date": "December 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 5.0, "location": 4.0}, "id": 90844255}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "What I described above is enough to make me give this hotel a negative review. Here are some other points:", "title": "Average hotel", "helpfulness": 1, "user": "rc33", "date": "December 13, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 89722053}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "(1) The club floor was well worth an extra $35 a night plus tax. We had an excellent free breakfast, and access to snacks all day, very helpful with little kids. The service there was also excellent.", "title": "Average", "user": "MagicFabio", "date": "December 4, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 89029491}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled solo", "text": "(2) Just to reiterate, there is no excuse to ask for a quiet room, twice, and twice be given noisy rooms overlooking a very busy street right next to the elevators.", "title": "Delightful resort hotel in the middle of Buenos Aires", "user": "TamiSmith", "date": "December 3, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88920925}], "location": {"country": "Argentina", "continent": "South America", "city": "Buenos Aires"}, "stars": 4.5, "variance": {"poor": 43, "average": 157, "very good": 240, "terrible": 19, "excellent": 146}, "aka": "Sheraton Buenos Aires Hotel Buenos Aires", "slim_ranking": 0.377272727273}