{"user_rating": 4.0, "review_count": 634, "name": "Sheraton Dubai Creek Hotel and Towers", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "By Dubai standards this is an old hotel. Public areas are great - modern and stylish. Great Pub and a very good Indian Restaurant . Rooms are dated and somewhat tired. Corridors outside rooms give a distinctly dated feel.", "title": "Its OK", "user": "GastroNinja", "date": "February 27, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 153306259}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Would i stay again? Probably yes - good location and better value for money than most in Dubai. Management does need to update the rooms however", "title": "Five stars elegance", "user": "33tu", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153111812}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We stayed 9 nights in a club room facing the creek. The hotel is a stylish business hotel with elegant public areas and quest rooms. The pool area is comfotable and large enough for holiday-makers, too.", "title": "First Class hotel", "helpfulness": 1, "user": "nigeltaylor11", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 153034904}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The creek view is great, expecially at night time. We paid for a club room and got free airport tranfers by a Lexus, free wifi, and access to the club lounge. There were coctails and deliciious hors d'oeuvres served between 6 pm and 8:30 pm.", "title": "A nice comfortable stay", "helpfulness": 1, "user": "Giboos", "date": "February 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 152862949}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "The room was quite large and very quiet, although the bathroom was a little in the small side. Everthing was clean and tidy. Nowadays separate shampoo and conditioner is seldom available, a small thing thing that we appreciated.", "title": "Amazing hotel, achieving full marks as a result of a stunning view, wonderful food and exceptional service", "user": "JimmyDCarter", "date": "February 23, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 152844171}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "We conducted a Plenary session at Conference Hall (Hata Room) of Sheraton Dubai Creek for our Up coming international School in India.The facilities here were awesome and we had a wonderful eve.The staffs were too supporting.Most of our Guests at Plenary session applauded our decision to conduct the session at this wonderful hotel.The Hotel is suited for every business meets.The only negative part is Heavy Traffic in the Baniyas road may block you some time to get in to tyhe Hotel.", "title": "Great Experience at Sheraton,Dubai", "user": "Shihabmecheri", "date": "February 22, 2013", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 152758375}, {"rating": 4.0, "title": "Recommended", "text": "Recently spent 4 nights, it is well situated, ferry is 2 mins walk, 15 mins walk to shopping area leading to spice & gold markets. We used the big bus tour (2days) 10 mins walk to stop or short taxi ride the mall. The staff were excellent, I secreted a few £100s in our room(not sure about hotel safes) and left without it, I rang the hotel it has been returned. We had a club room, recommended good views of the creek and don't miss happy hour(2hrs)free drinks and canapés (could be a meal).There are 3 styles of restaurant and a bar The Chelsea, drinks are a little dear but no dearer than most of Australia. The hotel is very clean, the only negative was the bathroom was a little tired but fully functional and clean", "helpfulness": 1, "user": "Geoff H", "date": "February 19, 2013", "id": 152523772}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The hotel is located on the Deira side of the Creek - midway between Deira Center (with shopping mall) and the Deira Souqs (gold and spices). Taxi is advisable to reach said venues unless you hav REALLY good time and want to stroll along the riverside and harbour.", "title": "Sheraton quality at its best", "user": "fengzeli", "date": "February 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 152152447}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "There are good restaurants a plenty in the hotel - our favourite was the Japanese resturant with terrace overlooking the river. They have a \"Japanese buffet\" which is really impressive.", "title": "Average for Dubai standards", "user": "MCEAAthens", "date": "February 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 152055131}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Good view of Burj Khalifa (828 meters!) on the far side of the river.", "title": "Great hotel", "user": "Ginnie W", "date": "February 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151945733}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "I arrived without expecting much. I have walked past the hotel several times and it always looked dated, but with an excellent location - right on the Creek, without a road separating it. It was an excellent place to stay. Service was excellent throughout and facilities were superb. Whilst a bit of an eyesore from the outside, it is great within. This is my favourite area of town and I have now found a hotel I enjoy staying in. It is closing in July for a year for refurbishment, although I can't see what really needs to be done. Pool small but does the job and never had a problem finding a bed. Gym excellent and quiet. Club Lounge too popular, perhaps. One day, I couldn't find a table so paid for drinks at the pub instead - hardly a working atmosphere, sadly! One but if advice - please make sure keys are extended to allow for late check out when offered and agreed. It is not fun having to go down from the 7th floor, and to reception to ask for a new key whilst wearing a sweaty gym kit in front of business people and a wedding party! A minor pet hate of mine. If you reward someone with late check out, make sure the key allows it! A great stay and highly recommended.", "title": "Creek side comfort", "user": "AlexFulham_London", "date": "February 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 151746919}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We arrived at the Sheraton Creek in the early hours of the 31st Jan and stayed for 5 nights and have to say was a very pleasurable experience and could not fault the hotel at all. My husband and I were picked up by our complimentary car from the airport and driven the short distance to the hotel and despite it being way after midnight the staff were all very pleasant and helpful. We had booked a club room with creek view and were given a very nice japanese themed junior suite with a beautiful view.", "title": "Average price for more than average service", "user": "GlendaJOD", "date": "February 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 151600981}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "As previous reviews state this hotel is older than many of the other 5 star hotels in Dubai but I feel this is reflected in the tariff so something you cannot compain about. The other hotels do not have the fabulous atmosphere and character of being right on the creek. This feature is priceless! The hotel is still very nice, spotlessly clean and the pool area is very comfortable.", "title": "Sheraton Dubai Creek", "user": "DrVik", "date": "February 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 151516405}, {"rating": 1.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The club lounge is an added bonus with the staff (especially Joclyn) being very attentive at all times, even when faced with ridiculous requests like an ice cream cones or other guest being very rude, I felt very sorry for them on some occasions. My husband was ecstatic at the fact they played all the premier league football matches in the Chelsea Arms Pub which is next door to the Club lounge. The pub had a good atmoshphere and the food and drink both great. (A special thank you to Mansoor for being so friendly and keeping our drinks flowing!)", "title": "Worst service ever", "user": "Rozanna W W", "date": "February 5, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 151453201}, {"rating": 4.0, "title": "Can't complain", "text": "The hotel is very close to the metro system which is an experience to travel on (go Gold class) and the taxis are very reasonable. Reviewers have previously stated the hotel taxis are more expensive but not too much more and the cars are prestige and very clean so nice to travel in style.", "user": "TTTGoldCoast", "date": "February 3, 2013", "id": 151300901}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Stayed mid February, and thoroughly enjoyed. Location good for Creek, close to metro so that you can easily get around Dubai. We used taxis to go to Festival City at night which is worth doing as lots of shops and restaurants. Hotel facilities excellent, we ate at Vivaldi (Italian) and the food was superb along with a view of downtown Dubai and the Burj Khalifa. Staff very helpful and nothing a bother. Room overlooked the pool and at night, downtown Dubai could be seen in the distance and all the dhows on the river were lit up. Would definitely stay again and recommend for a great stay in Dubai.", "title": "Lovely hotel", "user": "Kerzy", "date": "March 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153577441}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled solo", "text": "I stayed for a brief overnighter on my way home from Afghanistan. The room was very comfortable even though the bathroom was a bit small. The hotel provides a shuttle to DXB by appointment and the Dubai \"Creek\" has an awesome view if you get a creek side room. All 11 floors on the creek have a great view so expect to see something outlandish in accordance with Dubai style! I am thinking of a huge all wood yacht that was right outside my window on the pier. You'll know it when you see it.", "title": "Nice Place to stay even when the Tennis Tourney is in Full swing", "user": "SilentService613", "date": "March 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153500469}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "The room was pricey but then again... it's Dubai. Enjoy and let others know what you think.", "title": "A very nice business hotel", "user": "brutravel", "date": "March 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 153497783}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Very conveniently located at the creek , near the Dubai Chamber of commerce and the old city, this hotel is well designed and the rooms , especially at the club floor , have spectacular views on the creek and the skyline . Rooms are large and well appointed. The hotel has three restaurants ( and a pub ) : italian , indian and japonese. Good service . Nice little outside swimming pool and spa.", "title": "Wonderful Hotel", "user": "cjkasm", "date": "March 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153461899}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "As one travels around Dubai one is quick to realize that The Sheraton Dubai Creek is understated. However , we had a wonderful stay at this hotel. We are SPG members so we stayed on the SPG floor. We had great views of the creek and all its activity especially the dinner boats which were are lit up at night much the same as one finds in Shanghai. The hotel had a lovely pool and restaurant overlooking the Creek where one could sit in or outside. It is the perfect location to tour Dubai. The Creek taxi's and Abras are nearby as is the very clean and modern metro line to take you anywhere else in Dubai, and yes, you can easily and quickly walk to all of them. We arrived very early (around 6:00am) and at first we were told that we had to pay approx. one hundred dollars extra to check in before 9:00 or 10:00am even though our room was ready, however that was quickly reversed and we were shown to our very lovely room, which was clean, inviting with great views. Bottled water is complimentary and one has coffee and tea service facilitates in the room. The Bathroom area was marble and wonderful with a bidet and a not often found amenity at even the best hotels, great make-up lights and mirror. The staff was terrific and aim to please. Being our first visit to Dubai, we debated long and hard as to staying on the beach or the creek area. If you are going to Dubai for a relaxing beach vacation you may want to make another choice but if you are going to tour Dubai we can't think of a better location. It is a plus that the hotel itself was great. We would look forward to staying there again and highly recommend it.", "title": "Great hotel, beware of upgrades on check-in", "user": "Kevin R", "date": "February 28, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153385589}], "location": {"country": "United Arab Emirates", "continent": "Middle East", "city": "Dubai"}, "stars": 5, "variance": {"poor": 39, "average": 79, "very good": 241, "terrible": 23, "excellent": 252}, "aka": "Sheraton Dubai", "slim_ranking": 0.240938166311, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.0}, "description": "With magnificent views overlooking the Dubai Creek the hotel is superbly located near the main commercial and shopping districts, the Gold Souk and Spice Souks. Next to water taxis which allows for a short taxi ride to Dubai Museum, Heritage, Village and Old Dubai Souk. Close to Dubai International Airport. 262 spacious city & creek view rooms and suites. Five International restaurants, café and bars."}