{"user_rating": 4.0, "review_count": 98, "name": "Sheraton Ontario Airport Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "It was disappointing to get there and find out that there was no free internet, or refrigerators in the room, (but for a price there was). The continental breakfast was nothing to be desired...This hotel is a little dated, but overall its maintained well. The room was clean and the bedding was new. The spring-loaded bathroom doors were very annoying, but make sense being it's adjacent to the main door. If you stay here you'd be better off requesting a room on the North side, to avoid the jet noise from the nearby Airport. This is one of those older, concrete construction type of Hotels, (unlike most \"stick-built Hotels\" built these days), so you never need to worry about noisy people above you.", "title": "Not the Worst in Area, but I've Stayed at Better", "user": "Favre440", "date": "June 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 132658336}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "Based on the reviews below I was expecting a little more then this one delivered. It's OK, but not outstanding. Good location, comfortable beds. Only problem with room is that the bathroom door will not stay open. So if you, like me, like to listen to the news while you get ready find something to prop it open with!", "title": "Nice Hotel, but Skip the Club Level", "user": "CarolLeeAtlanta", "date": "June 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 132466157}, {"rating": 3.0, "stay_parameters": "Stayed June 2012", "text": "I paid for \"Club Level\" only to be told \"sorry that's under remodel so we don't have a Club Level\" I did get access to the Club Lounge, but... IMHO if you have to \"call for drink service\" you are just not really providing a quality Club Lounge. Plus the other features you expect when you pay for the Club Level (like bathrobes a little nicer room ) weren't delivered. Personally if you have CLOSED the Club Level I think that should have been disclosed on the booking engine.", "title": "Older hotel, overall Good Stay", "user": "dano9258", "date": "June 21, 2012", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 132414763}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Internet appears problematic Actually it isn't working at all right now and the front desk's FIRST response was \"no one has called us about this\" (Apparently my call didn't count?) then they called back to say \"well you don't have access\" Gee.. I had it this morning!", "title": "A Very Hospitable Staff", "user": "David B", "date": "June 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 131798821}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "You could tell immediately that this is a older hotel. Our room was on the 3rd floor and there was a weird musty smell in the hallway. The room itself was alright but there was a long hair on the pillows which was sort of disgusting. Very basic room but service was great. I'd say there are probably better rooms for the price in the area. We got the room for $79/nt through Priceline...", "title": "friendly staff never fails!!!!!!", "user": "veronica v", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130897186}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "After reading through many of the reviews I find it hard to see how anyone can rate this hotel above average. I have spent a lot of nights at this hotel. The staff is nice and the maids do a great job cleaning the rooms but the breakfast is horrible and the pool area is very run down. Last week when I was there they moved the breakfast to a meeting room with signs that said China travel group. Why would I want to eat with a group that I was not part of? Last month when I there they changed the breakfast around to cater to a large youth group convention again ignoring the needs of the business traveler. Also as a gold member there was no upgrade offered or even acknowledgement of the reward status. Cant wait to see how I will be treated after my next stay puts me at platinum. A couple of nice things I can say is that it is close to the airport and in and out burger is across the street.", "title": "All I can say is Average", "user": "Swimmy128", "date": "September 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 139209247}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "We've stayed at this Sheraton for 3 nights (an entire group) and it was great!", "title": "Good value, location and food!", "user": "Travel2andFr0m", "date": "September 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 139098551}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "The location is good (shopping and restaurants around), the food at the dinning room was pleasantly better than most hotels I've dined in and the service was great!", "title": "Air-conditioned", "user": "leilagorbman", "date": "August 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 138592493}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "The gym could be slightly improved (I'm picky...:))", "title": "Ordinary", "user": "familykretsch", "date": "August 26, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 138401916}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "I cannot stand the absurdly hot weather in this part of the country. Feels like I'm in a microwave.", "title": "What all business hotels should be", "user": "M2hra", "date": "August 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 137384213}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "I wasn't relishing the thought of staying in Ontario during an August heat wave, but this hotel made it a more pleasant experience. I was struck by the friendliness of all the staff including Frankie at the front desk, who recognized my SPG status by assigning me a room on the Club floor and giving me amenity points as well as lounge vouchers for evening hors d'oeuvres and breakfast. The room was compact, but had a comfy arm chair and an ultra-comfy bed. There was a flat-screen TV and speedy, complimentary WiFi. I used the gym, which had a good array of equipment, but didn't see the pool. Breakfast included scrambled eggs, potatoes, bacon, along with fruit (including fresh berries), yogurt, cereal etc. All in all, a great stay.", "title": "Pleasantly Surprised", "user": "Musqat", "date": "August 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "service": 5.0}, "id": 136851906}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Marcel is a great bartender. I spend much of my life on the road and it's the people that serve us everyday that can make it comfortable or miserable, Marcel is definately one who makes it comfortable. Thank you Marcel. I will see you next time. ohnyabthe rest ofvthevplace was good as well.", "title": "Greatest hotel bartender ever!...ever!", "user": "Sal G", "date": "July 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 134868544}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Friendly staff. All that I meet. (check in, maids, bar, etc.)", "title": "Good place to stay", "user": "CBtraveler88", "date": "July 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 134222773}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "Good value. Had no problems at all.", "title": "Delicious food!", "user": "Robert G", "date": "July 11, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 134082368}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Will stay here again when in the area.", "title": "Love the Sheraton!", "user": "JAVIER A", "date": "July 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134024885}, {"rating": 5.0, "title": "Always great!", "text": "I stay at this hotel several times a year when business takes me to the Ontario – Pomona area. Great location and I’m never disappointed with the friendly staff and comfortable rooms. The newly renovated lobby and exercise room look fantastic and the food quality in the restaurant was good as usual. Hopefully, business will take me back here soon.", "user": "John V", "date": "May 16, 2012", "id": 130040368}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "We stayed here in May 2012 after a trip to Death Valley, as a stopping point before going home to west LA. It was a great stop in - after getting lost, we finally made it to the hotel at 2 am, and the staff was friendly, quick, and accommodating, even getting extra towels ready for us at check in! All we wanted were hot showers and comfy beds, and we were pleasantly surprised to find that there were 2 king beds in the room which were clean and comfortable.", "title": "Double king beds!", "user": "LL137", "date": "May 13, 2012", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 129886857}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "One star off because the shower drain was clogged (took about 10 min to go down after each shower), and the air conditioning was a wall unit that blew strong cold air onto one bed only, but those things were manageable, and the comfy beds and late check out made it worth it.", "title": "Nice stay, Acess to club level worth it!", "user": "Scott H", "date": "April 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 128621520}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "The pool area was also gorgeous and seemed like a little oasis in the middle of Ontario.", "title": "Nice and comfortable...", "user": "JAM1018", "date": "April 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128531236}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "My wife and I received a one nights stay here as a wedding present, and we couldnt have had a more enjoyable time. Check in was quick, and we had a room on the club floor, with access to the club lounge. Free wine, and cheese and crackers!! Everything was clean, and well maintained in the room. Pool was a bit cold, but it was warm out so it was ok. Plenty of restaurants, and shops at the nearby outside mall. Would stay here again!", "title": "Been staying here for years and I'll keep coming back!", "user": "Trysta B", "date": "April 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127566272}], "location": {"country": "United States", "city": "Ontario"}, "stars": 3.5, "variance": {"poor": 5, "average": 22, "very good": 40, "terrible": 4, "excellent": 27}, "aka": "Sheraton Ontario", "slim_ranking": 0.47619047619, "description": "Located in the heart of the Inland Empire, we are within walking distance of popular shopping and tourist attractions and just minutes away from the Ontario International Airport."}