{"user_rating": 3.5, "review_count": 1087, "name": "Sheraton Fort Lauderdale Beach Hotel", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "We stayed here for two nights after a cruise. My friends were given room 391 in the Marina Tower. You have to take the elevator and then walk along the skywalk across the highway. Quite a long trip with luggage and a 10 month old baby. There was no hot water from the shower and no safe in the room. I was given room 109 in the south tower. There was substantial mold on the drapes, no safe and absolutely no view of anything.", "title": "very disappointing", "helpfulness": 2, "user": "tocanada2", "date": "December 12, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 121684581}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We complained and were given rooms 153 and 151 in the Beachside building. This is a separate building right on the beach. These rooms were substantially better maintained and had safes in them.", "title": "Pre-Cruise Stopover", "helpfulness": 2, "user": "roslyn105", "date": "December 12, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121667502}, {"rating": 1.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "My friends requested a crib for the baby and a fridge to store baby food. They had to call a second time to get these delivered. They were finally brought to the room while they were out. It would have been nice if the employee had actually plugged in the fridge to ensure that it worked rather than just leaving it in the room.", "title": "Stay Away!", "helpfulness": 2, "user": "RogernVA", "date": "December 10, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 4.0, "rooms": 1.0, "location": 5.0}, "id": 121609666}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "The lock on my door did not lock when I left the room. This was not readily apparent and I am glad that I double checked the door when leaving. The door lock was repaired but later in my stay, the pass card would not open the door and I had to ask for assistance again.", "title": "Change is not always good", "user": "Mary Lou Z", "date": "December 10, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 121603128}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "In the Sheraton's favour - the pool on the beach is very nice and we had an excellent lunch there. The female employees at the desk were very helpful. The hotel is right on the beach but there are no shops nearby so it was hard to get baby food and other supplies.", "title": "Average", "user": "LuigiRichmondHill", "date": "December 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 121393535}, {"rating": 2.0, "stay_parameters": "Stayed December 2011", "text": "I dont have any idea why this motel-like old building obselete furnitured hotel has 4 stars. Dont think of going there if you have other options available.", "title": "Better hotels around", "user": "Butterflyhb", "date": "December 2, 2011", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 121308278}, {"rating": 2.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "I was ready to give this hotel 5 stars but am only giving it 2 because of some serious shenanigans the hotel played. We are Starwood Gold and got a nice room overlooking the ocean. It was updated and comfortable, though the air conditioning system was too loud. All was fine until we looked at our bill on the final morning and found that we had been charged twice for the Internet each day we stayed there because we had used 2 devices to log in. I have never encountered this anywhere I've stayed and nowhere were we informed that we would be charged for each device. While I think charging Gold members is an insult, charging us twice is an even bigger insult. The front desk manager took off one charge for one day but refused to remove the extra charge for the second day. We are Hilton diamond and get free internet and breakfast with out status, I guess we'll stick to Hilton in the future. It's little things like this that ruin a nice stay. We certainly won't be coming back to this hotel.", "title": "They ruined a great stay", "helpfulness": 2, "user": "gogogo2", "date": "November 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 121196256}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Stayed for 2 nights doing a Florida tour. The hotel backs onto the beach so appart from that not a place to spend your family holiday. We had a sea view from a nice room on one of the upper floors. Seems the type of hotel that people only use for a short stay the lobby is always busy and reminded us of an airport/railway terminal when we sat at one of the tables with our Starbucks coffee. Did not use the Starbucks counter for anything at breakfast always seemed a long queue when we passed fortunately there is other places close by. We would probably stay here again if we return to this area but only for 1 or 2 nights.", "title": "Good Hotel for a couple of nights", "helpfulness": 1, "user": "bradshawbolton", "date": "November 29, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121192340}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We stayed at the beach building in a room overlooking the pool and beach.", "title": "1 night before cruise", "user": "JaniceBoston", "date": "November 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121128366}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Was awesome for us to spend the day at the beach before our cruise the next morning.", "title": "If looking for a nice beach hotel, this is pretty good.", "user": "rellyrooly", "date": "November 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 121127941}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Stayed here for 2 nights before our cruise, and it was booked through the cruise company as part of the package. We were given a room in the Marina Tower across the walkway. It was on the 10th floor and was a corner room with windows on 2 sides, so we had views of the beach on one side and the inland waterways and port area on the other - excellent.", "title": "Great Views", "user": "lovetoholiday2007", "date": "May 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 129372921}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The room was big enough, clean and modern, and everything we needed. A nice walk along the sea front to the busy area, and just a block from the water taxi stop.", "title": "Nice", "user": "Chrisman7", "date": "May 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 129358299}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The pool area was nice, and a choice of bar/eating areas.", "title": "Good location", "helpfulness": 5, "user": "patricio40", "date": "April 30, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 129106199}, {"rating": 4.0, "stay_parameters": "Stayed April 2012", "text": "No complaints, would stay here again, and recommend.", "title": "On the beach and a little away from the noise.", "user": "Swisswifey", "date": "April 29, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 129062610}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "I stayed here for a weekend during spring break ( i am not a spring breaker) and it was nice. Great location, nice beach, nice pool.I do have to complain about the check0n process the lines were ridiculous and it wasn't like the rooms were cheap for there to be that many people there at one time. I also was under the impression i was getting an ocean view room and i ended up in the tower behind the ocean view towers. All in all the hotel is nice, pool area, bar and food , and service is very good. A little pricey, one thing is you can't smoke hardly anywhere , as a smoker, that's really annoying, so you have to keep getting up and go to a \"smoking area,\"Overall it was nice no real complaints but it just didn't have that real beach appeal it was more like a business trip hotel, located on the beach. Would highly recommend if found for $200 a night but i paid $300, wouldn't go back for $300.", "title": "Great location and an enjoyable place to stay", "helpfulness": 1, "user": "barnesi", "date": "April 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 128979838}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Pricelined this hotel for a 1 night before a cruise and it was close to the airport. Showed up as a 4 star which I have trouble understanding why how unless it is for the beach location and the good beds.", "title": "Can't recommend because of room smell.", "helpfulness": 3, "user": "iMagellan", "date": "December 25, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 122085905}, {"rating": 1.0, "stay_parameters": "Stayed December 2011", "text": "Stayed in the newer \"tower\".", "title": "Worst hotel ever stayed at", "user": "Mhdz1806", "date": "December 24, 2011", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 4.0, "service": 2.0, "rooms": 1.0}, "id": 122073267}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Side view of the ocean/beach was nice however there was a very strong mold smell in the room which was a deal breaker. The windows did not open so we were trapped all night (the AC helped but then the room gets super cold). The toilet bowl had a yellow tint to it. Also did not feel very safe in the tower because there is no guard for that building so anyone could slip in behind a guest (but they did have cameras). Beds were good. The safe was big enough for a large laptop.", "title": "Awesome Stay at the Sheraton Fort Lauderdale Beach Hotel!", "helpfulness": 1, "user": "justbeachy2", "date": "December 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 122044320}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "Our family stayed in the main building. That room did not smell but seemed older in decor.", "title": "Over due remodel", "helpfulness": 2, "user": "Nova22", "date": "December 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 122008079}, {"rating": 4.0, "stay_parameters": "Stayed December 2011", "text": "Being a Starwood member, I thought that would be simple thing to get a 1 hour 1.00PM checkout extension but it was denied over the phone. I had to go down to the front desk and insist to get a simple 1 hour extension. They guy was clearly annoyed to grant it (maybe because it was a Priceline deal?).", "title": "Nice location, bit noisy during the night", "user": "mafootje", "date": "December 22, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 121979537}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We stayed here for 2 nights in April before a cruise. Everything we needed was on site. The front desk employee, Fitzroy Dias, was an exceptional addition to our stay. I don't think we had an expectation of the hotel because it was going to be a layover before the cruise but because of Fitzroy and all the employees at this hotel made it special. Thanks to everyone at the hotel!", "title": "Great service. Great location. Great hotel.", "helpfulness": 1, "user": "kemcgraw", "date": "May 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129955669}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Stayed for business but felt like I was on vacation. Rooms need to be updated but there is enough to do within walking distance that I spent very little time actually in the room.", "title": "Great Location and Staff", "user": "Mark S", "date": "May 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 129774645}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "In my opinion nobody could be disappointed with this hotel. From the minute my son and I arrived", "title": "Dream Hotel", "helpfulness": 1, "user": "enid2814", "date": "May 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129773085}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "from England we were thrilled with it. The decor was clean bright and welcoming. The staff were friendly and helpful. The bar and restaurant excellent. We were lucky enough to stay in the Beach Tower (try to get a room here - worth the extra cost) the views were magnificent. We would love to re visit again one day as we both loved Fort Lauderdale and the Beach Hotel. Thank you everyone for fantastic holiday.", "title": "Very nice hotel w/beach access & views", "helpfulness": 1, "user": "capitollover", "date": "May 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 129593649}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "The hotel was clean, w/comfortable rooms, 2 infinity pools, several bars, a restaurant, and on-site Starbucks coffee. It has a nice workout room & spa services. We stayed during a tropical depression, and there were people constantly mopping up the water that guests brought in, amazingly keeping the floors clean. It is just steps to the beach, and about a 2 block walk to the restaurant and shopping district. Very nice.", "title": "Amazing staff", "helpfulness": 2, "user": "geoFortLee_Nj", "date": "May 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 129419938}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "Nicely renovated lobby. Clean room and very comfortable bed. We had a wonderful oceanfront room with balcony. Great price for hotel right on the beach and close enough to walk to many area restaurants and shops. An extra thank you to Chris Castillero, concierge who was just wonderful..... extremely helpful, very friendly, and patient with all of our many questions!", "title": "Nice place, good location", "helpfulness": 2, "user": "casino21-0719", "date": "December 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121828753}, {"rating": 4.0, "stay_parameters": "Stayed August 2011", "text": "We stayed at this hotel in August 2011 for a total of 7 days and 6 nights. We were in the Beach Building room 150. Excellent location. I had read Trip Advisor before I left and found out ahead of time to request the Beach Building because it was right on the beach. I'm glad I did. I would have beers disappointed if I had to stay in one of the other buildings. I would have been a long walk to the beach. I walked out of my room and walked down the hall and went out the door to the pool and then onto the sand to the beach. Awesome!!! Check in was a breeze. We got there very early in the AM and our room was ready. The entire staff was very polite and helpful. We had a rental car so we had to pay $25.00 a day for valet parking. Each room gets two beach chairs and towels. We really didn't eat in the hotel because we had the rental car and drove to different restaurants around to try stuff out. We loved the beach. It was beautiful and the water was turquoise colored looking. The waves are not high and you can walk in the water for a ways out. My family and I definitely will be going back to this hotel if and when we return to Ft Lauderdale.", "title": "Great location - Right on the beach !!!", "helpfulness": 1, "user": "caribbeanpalm", "date": "December 14, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 121747894}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We were looking for a relaxing vacation and that is what We got. After reading the reviews I was a little worried. We got a great room in the beach building and we got it at a fair price. The beach building is right on the beach and has a view of the ocean (some partial some whole-we had partial which was fine with me). The place is a little confusing at first like others have said. There is the main building which is where the one pool is and the gym and the food places, then there is the building across the street near the parking lot which is connected by a walkway over the A1A roadway. The other building is called the south tower and is sort of between the main building and the beach building and it has no views of the ocean (at least this is what I was told). We liked exploring the hotel. Our room had quiet air conditioning. The first few days I was there the hallway had no noise, then on the third day a large group must have checked in that left early because in the morning I heard doors slamming and then they were gone(along with my do not disturb sign). It was quiet again and fortunately no one came to clean early (which we do not want-we like later cleaning and to sleep in) and housekeeping got me a new sign right away. So it is a matter of luck if your halls are quiet or not. You can hear everything in the hallway. I bring earplugs with me because a lot of hotels are like this. At night the hotel hall way was quiet for my whole stay. I loved the hotel pool and it was right on the beach (one pool in main building in courtyard very pretty and other pool on beach (infinity pool also very nice). The pools are not super large like some hotels but they were fine for us. I enjoyed the beach view from the pool. We picked a quiet week and the pool was rarely crowded. On the night we were checking out which was a Friday a large group came in and the pool was more crowded and noisy. It was a football crowd down to see the Eagles game and they were fine except that no one stopped people from smoking while they ate around the pool. A wind blew the smoke in the other direction but it made me wonder if it was a non-smoking hotel except for poolside. We had no problem with any one smoking on the other days. People did smoke by the door going into the main building from the beach building and the south tower and this was a bit annoying but I let it pass and walked quickly and never sat out there. The food in the hotel was good. We ate a couple of days by the pool and service was good, we ate at the Linc when we arrived and service was also good and the food was fine. We tried Los Caminos for breakfast one day and I was happy to find breakfast food that was not spicy like some reviews said. It was very good- could get an omelet or bagel lox and cream cheese or whatever. Prices were high but they allowed refills of the orange juice which I liked. Our room had a safe and the bed was comfortable. Not all rooms have safes yet but they are working on it. The first night they put a sheet that was too small on the bed and it kept coming off. Others had said this in the reviews and it is true, however in the morning housekeeping was outside in the hall and I asked them about this and they apologized and immediately replaced the sheet with the proper size. They said I should have called right away and it would have been taken care of. So I guess you just have to speak up and it will be taken care of. I do not know why they have this problem in the first place but I was happy the rest of the trip and the sheet was fine. I know it sounds like I am complaining about things but I just want to express that we enjoyed our trip but things were not perfect. The place turned out to be a lot better then the reviews said. It was clean, I got beach chairs free, the weather was good (we are beach and pool people), The pool was clean and warm with the saline cleaning instead of chlorine which I now like,we had a view of the beach from our room. Housekeeping was wonderful, everything we requested they remembered to get and they cleaned the room well and always left us soap and lotions. I liked the shower gel and nylon scrubber they gave with it. Housekeeping was very nice and made us feel welcome. It was one of our better trips. We are glad we picked this hotel. One day we ate breakfast at the Marriott next door (expensive but great view on the beach and great service) and a few days we ate breakfast at the Best Western for 10 dollars each. It is a very good breakfast and Frank and Rose are very nice. Frank always gave us tips on things to do in the area. For dinner and lunch you can walk to Coconuts (prices are higher then three years ago), but food is still good and service excellent, Bahia grill is across the street from the Sheraton and All About Food is down the street or you can just eat in the hotel. Prices for food are high all over so we just got used to it. CVS is about a mile down the beach or A1A and we were told Walgreens is nearby too but we never got there. We also enjoyed the lemonade and iced tea in the lobby which is given out on weekends only or if it is very hot outside. (that is what I was told). When we arrived it was quite a treat while checking in. We did not have a long check in line but I can see how maybe there could be one at times. They usually have a few people on the front desk but if a big group comes in I guess there might be a wait because the front desk is very helpful and people have a lot of questions(like me). Cab fare ran 20-22 from the airport plus tip. Hope this helps everyone and enjoy your vacation! We would definitely go back to the Sheraton Beach!", "title": "We had a wonderful time", "helpfulness": 4, "user": "CherryHill_NJLes", "date": "December 14, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121743980}, {"rating": 2.0, "stay_parameters": "Stayed December 2011", "text": "If you don't believe my ratings are fair, just go on the Starwood page for the hotel and read the reviews.", "title": "Do not expect much if you stay here. Would recommend staying elsewhere...", "user": "gordongekko83", "date": "December 14, 2011", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 121736467}, {"rating": 4.0, "stay_parameters": "Stayed December 2011", "text": "The housekeeping service is below average, service is atrocious with the exception of the front desk and valet staff who were always top notch. Reataurant service is terrible. They seems to act like they are doing you a favor by servicing the table and don't even take care of the basics like bringing flatware and refilling drinks.", "title": "Nice hotel, delicious room service", "user": "april22reeses", "date": "December 13, 2011", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 121717955}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "While I wish we didn't stay in the Main building, it was still a pleasant trip. The reviews and photos that I've seen from the travelers that stayed in the beach tower made me jealous, but honestly, who wants to spent much time in the room on vacation anyhow! This hotel is fantastic because of it's location. It's basically the ONLY hotel right on the beach. While everyone else on the strip has to walk across the road to go to the beach, we only had to take a short sidewalk there! Not to mention that we could sit at the infinity pool deck and enjoy the beach as well! We had a small meal at the bar/restaurant at the pool too and found it on par with all the other meals we had during our stay in Fort Lauderdale. While the hotel was a short walk from the bars, restaurants and shops it was fine due to the beachfront! If we return I'm sure we'll shoot for this hotel again. We used priceline name your own price on this one and paid less than half what is asked for on the property website! We did pay a bit for parking, but splurged on the Valet option (we were on VACATION) and found it well worth it!", "title": "I wouldn't call the rooms four star, but the location and amenities make up for it!", "user": "Christine K", "date": "May 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 130237049}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Room is musty and dirty. Sneezed every time I enetered my room. Pillows are awfully soft with no support and bed left my back hurting every morning. I put on new white socks and walked from the bed to the bathroom and the bottom of my socks were black. Called front desk to report that shower drain was backing up. Of course there was never a response or fix. The restaurant leaves a lot to be desired. Exceptionally slow service and I never received a refill on my drink during my entire meal. Their chicken tacos were supposed to have a citrus and lime flavor according to their menu but were over cooked dices of drano marinated mystery food. Complained to staff but they never showed up again until time to pay the bill. No manager ever showed up to apologize. My change for the meal was $1.34 and she brought me back a dime and 24 pennies which I let her keep the pennies as a tip. Everyting at this hotel is expensive including drinks, snacks and especially parking. The bar is called the Wreck Bar. That would be a better name for the entire hotel", "title": "The Wreck Hotel", "helpfulness": 2, "user": "5PCTravelers", "date": "May 17, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 130088489}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "This is a great location with a wonderful beach. We stayed in the beach towers and had a corner room with floor to ceiling windows. We laid in bed and had breakfast and watched the waves roll in. Incredible ocean and beach view. While this is an older resort it has been updated. Our room was large and the beds were the incredible comfortable beds that Sheraton promises. Comfort! The staff was wonderful and very accomodating. There were lots of families with younger children that were having a great time at the beach and in the pool. You do have to pay for parking at most of the resorts so expect to pay at least $25.00 to park for one night. Remember that this is an older resort that has been updated but it is very clean and comfortable. I can't wait to return but next time I will stay for at least two nights.", "title": "Great location", "user": "Arline H", "date": "May 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130065884}, {"rating": 2.0, "stay_parameters": "Stayed May 2012", "text": "Paid for room through a package deal with Southwest Airlines. Upon check in front desk agent held $50 on my debit card for incidentals & stated \"as long as I didnt go over that $50 no more holds would be placed\". Didn't go over the $50 but still put an additional hold for $126 on my debit card. Inquired why at the front desk and agent says \"well you got close to $50\" and had little interest in being any further help.", "title": "Average hotel, average room, & below average service", "helpfulness": 1, "user": "Dcap780", "date": "May 16, 2012", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 3.0}, "id": 130059945}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The Wreck bar is cool but horrible service. Bartender is slow and easily confused. Only managed to have 2 drinks in one hour.", "title": "good location, nice bar, average room", "helpfulness": 1, "user": "Suko99", "date": "May 15, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 130017928}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Stayed for one night on route to Miami. The hotel is fresh and modern and i think its recently been refurbed. Our room was large with a massive super king bed which was very comfy, the only drawbacks were the view (there wasn't one, just trees!) and the bugs. went to make a coffee after checking in after a long drive from Orlando, opened the coffee machine and a load of bugs fly out and were crawling around inside. Called guest service who did send out a cleaner to clean out the pot. Also had several bugs crawling around our bedside tables, not great! Didn't kick up too much fuss as only there for one night. Also remember that everything is much more spreadout in USA. Dont expect to walk out of this hotel and find shops/bars and restaurants as there aren't any! Its about a $10 cab ride to Las Orlas boulevard where there are lots of places to eat drink and shop", "title": "Nice hotel let down by bugs in the room", "helpfulness": 2, "user": "Norwich_Tractor_Boy", "date": "May 30, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 130922828}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "I was totally in love with the the space of the rooms, the smell of the hallways, and the service. They take your car over to their personal parking garage and you follow the service up to your room while they carry your lugage. The walls and floors are thick so no creaking of sound. And their are aquariums are everywere inside the hotel.", "title": "Perfect", "helpfulness": 1, "user": "rue p", "date": "May 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 130863006}, {"rating": 1.0, "stay_parameters": "Stayed May 2012", "text": "I have had a great run with bidding on hotels through Priceline, so I guess I was due a disaster. I checked in this afternoon and was absolutely shocked that this hotel falls into the four star or better category. The room smelled of smoke, part of the bathroom door frame is busted, there are scratches and dents in the walls. People at the pool blast their own music over the hotel speakers. There are a lot of band aids on the ground around the pool and on the beach (which I actually find kind of amusing...I mean, what is up with that?). So I called Priceline and was put in touch with someone here at the hotel and since I already prepaid with Priceline they are not about to refund me for early checkout. Worst part is that their solution to the smell issue was to send two people up with this spray that made the room smell even worse than the smoke smell. My eyes are watering and my lungs are burning right now as I write this. I was also offered a voucher for a free continental breakfast for my trouble. Whoopie. We will see if that actually happens, but I am not too concerned with it as I plan to spend absolutely no time in my room here other than when I must sleep. If you can get a deal (I'd say no more than $60 or $70 a night or so) and have no problem with a motel type environment I don't think you'd have a problem here, but I'd you pay over $100 and/or expect the hotel to be as pictured/described, you will be disappointed. If your room smells stale/smoky - live with it - do NOT let them spray!", "title": "Not 4 Star, Stuck Here for 2 Nights", "helpfulness": 1, "user": "vitisvinifera", "date": "May 25, 2012", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 130608653}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "As I was going on a cruise the next day I flew in a day early. Because of the group that I was traveling with we had a discount on the room rates - the hotel was nice but the location was not that great or perhaps if we had rented a car or had time to explore the surroundings I am sure it would have made a different. As I did speak to someone and they were going on a dinner cruise, however, they did come in the day before. There was several places to purchase food in the hotel which was good. The beach is nearby also. Overall, it was good & the service was good. Our view from the room was terrible - overlooking what appeard to be motels & trucks coming & going -", "title": "Nice hotel if catching a ship the next day", "helpfulness": 2, "user": "bluelady_11", "date": "May 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 2.0}, "id": 130408638}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "I don’t have enough wonderful things to say about my recent stay at the Sheraton Fort Lauderdale Beach. First of all, I received an excellent deal on the room because it is the off season. When I checked in the lady at the front desk saw that I was 9 months pregnant so she upgraded us to an ocean view room that was conveniently located so that I would not have to walk too far. I appreciate her thoughtfulness so much.", "title": "Fantastic stay!", "helpfulness": 1, "user": "Sarah B", "date": "May 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 130374204}], "location": {"country": "United States", "city": "Fort Lauderdale"}, "stars": 4, "variance": {"poor": 103, "average": 243, "very good": 389, "terrible": 66, "excellent": 286}, "aka": "Sheraton Yankee Clipper", "slim_ranking": 0.406015037594, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Welcome to the Sheraton Fort Lauderdale Beach Hotel, a landmark destination. This stylish Fort Lauderdale resort is a haven of hospitality and is located directly on the shores of the Atlantic Ocean."}