{"user_rating": 4.0, "review_count": 993, "name": "Sheraton Grande Tokyo Bay Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "We travelled from Tokyo by train(15 mins) & all the hotels have a check in area at the station where they recieve the baggage , sell you disney tickets & you can go straight into the park. Very efficient very Japanese-great. To be honest most people I assume will be spending long days in the park returning just to sleep & bathe. All the hotels looked of a similar standard although this one had 2 great pools (indoor & outdoors) & a great kids play area with family amusements(shove a penny etc) for some strange reason pools & kids play area are an additional charge for hotel guests in Japan although in our case it was inc. in a special room rate package.Downside was an old bathroom & eating in the hotel was not good quality or value. The shuttle train to Disney is not free although the bus to the train station is .For some reason Disney was full but Disney sea empty(very nice) I would stay in the park Disney Sea is the rate is similar but we were quoted triple the Sheraton.", "title": "worth a stay", "helpfulness": 1, "user": "familymanHongKong", "date": "October 24, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 10277216, "likes": {"liked": "— pool", "disliked": "— bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "Fantastic hotel - very accommodating & helpful. Hotel has 2 kinds of themed rooms called the OCEAN DREAM rooms. Choice of 2 Dbl beds, 2 Dbl & 2 Sgl beds & 5 bedded rooms. Hotel rates are according to high/low seasons. We had the opportunity to visit during these 2 seasons. Rates were more than double during the peak period Nov/Dec. Location is just minutes away by walking to the Disney monorail station. We loved the convenience of returning to the hotel mid-way for a shower & a short rest before heading out to the parks.", "title": "Conveniently located close to Disneyland & DisneySea", "helpfulness": 1, "user": "thefongs", "date": "September 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8698920, "likes": {"liked": "— conveniently located next to theme parks", "disliked": "— expensive rate during high season"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "I was not in charge of this trip to Tokyo, or I would have tried to book something less expensive! Yes, the hotel was gorgeous, the view from my huge room was magnificent. But, after going to Tokyo Disney and Disney Sea, all I cared about was a nice hot shower, and a comfortable place to sleep.", "title": "Kinda Pricey, but the hotel was extremely nice", "helpfulness": 1, "user": "koneko", "date": "April 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 7293057, "likes": {"liked": "— nice room, proximity to Disney", "disliked": "— The price!"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "It was very convenient, as we could buy our themepark tickets while in the hotel, and there was the cutest Mickey Mouse bus shuttle to Disney. The room was nice, but overall it was kind of a bland place. I think we tried to find a drink at the hotel bar but they seemed to close early.", "title": "Slick, Comfy, and Close to Disney -- Almost Everything We Had Hoped For", "helpfulness": 13, "user": "Marywhotravels", "date": "August 22, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 3796846}, {"rating": 3.0, "stay_parameters": "Stayed July 2005", "text": "If you can find a good deal on this hotel, or if you are the type of person who really wants to make sure you have a spacious, fancy room to retire to at the end of the day, this could be for you.", "title": "Convenient but bland", "helpfulness": 10, "user": "familytravelz", "date": "August 2, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 5.0}, "id": 3730502}], "location": {"country": "Japan", "region": "Kanto", "continent": "Asia"}, "stars": 4, "variance": {"poor": 31, "average": 114, "very good": 495, "terrible": 17, "excellent": 336}, "aka": "Sheraton Urayasu", "slim_ranking": 0.380952380952, "description": "Welcome to the Sheraton Grande Tokyo Bay Hotel, a Western-style hotel with traditional Japanese charm. The hotel's views of Tokyo Bay are a constant pleasure and the sense of spacious garden surroundings a delight. The Sheraton Grande's accommodations are world-class - all of our 802 luxurious guest rooms feature a private balcony. After a day of business or entertainment in captivating Tokyo, enjoy fine dining at one of the Sheraton Grande's gourmet restaurants."}