{"user_rating": 3.5, "review_count": 537, "name": "Sheraton Oceanfront Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "I absoluetely loved my stay at sheraton viginia beach. When we arrived, the front desk allowed us to check in early and we were assigned a room on the 10th floor. Magnificent view of the ocean (we booked an oceanfront room). Beds slept very well. I have to say that this was my first time ever staying at a hotel with 3 pools! Although the outdoor pools were always filled with swimmers, especially little children, the indoor pool was always open with a great view of atlantic ave.", "title": "Amazing Experience at Sheraton", "helpfulness": 1, "user": "DjMillion", "date": "April 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 14964681, "likes": {"liked": "— Convenient location, steps from the boardwalk and beach, amazing hospitality", "disliked": "— The Elevators"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "After the 3rd night, we decided to stay one more night, and despite a lot of tourists checking-in, the friendly staff members managed to relocate us to a room on the main floor, which was steps to the swimming pool.", "title": "Right on the beach but damp", "helpfulness": 2, "user": "WesK", "date": "November 25, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 11054231, "likes": {"liked": "— Location on the beach", "disliked": "— Dampness"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "Business center was phenominal, with 3 computers, and the restaurant had breathtaking views of the ocean.", "title": "Pleased with accomodations", "helpfulness": 4, "user": "Countryblonde", "date": "October 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 10452789, "likes": {"liked": "— hotel clean"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "One downside is that there are only 2 elevators and a lot of guests staying at this hotel. This means that you might have to wait longer than expected when going up or down the hotel as it always full.", "title": "Nice hotel, but don't stay in Cabana room", "helpfulness": 4, "user": "Love2TravelVA", "date": "October 15, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "location": 1.0, "value": 3.0, "rooms": 3.0}, "id": 10082817, "likes": {"liked": "— Oceanfront location", "disliked": "— Cabana Rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Other than that, Sheraton Virginia Beach was awesome! And I would most definately stay here again when visiting Virginia Beach!!", "title": "Better than Expected", "helpfulness": 1, "user": "zapman46", "date": "October 9, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 10059902, "likes": {"liked": "— Location", "disliked": "— All the pets"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Booked this room for $69 a night through Hotwire. We couldn't believe how nice it was for the price. Front desk so friendly, we asked to not be put on a pet floor, and were given a partial ocean view without an upgrade charge. Rented a boardwalk bike which we could pick up and drop off right at hotel. There was a wedding on the beach on one of our nights, and it was fun to watch it from the balcony. Walked to boardwalk fair every night, and it was fun to watch the bands at Neptune Park. We parked our car for free across the street, and never once needed it in three days. Room was very large, and also were given a complimentary roll away bed because the sofa bed pull out had seen better days. We had a king with a pull out sofa on the 6th floor. Great vacation, loved the Sheraton, and Virginia Beach. Pocahontas Pancakes were excellent, as was PI zzeria, a few blocks down. Not sure why some are giving this hotel a bad review - we found it to be excellent service, and an excellent value for the Hotwire price.", "title": "Loved Loved Loved It!", "user": "gobux", "date": "June 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17341284, "likes": {"liked": "— walked to everything, price, nice beach", "disliked": "— Nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "This is a little long and probably scattered, but wanted to cover as much as I could.", "title": "Great hotel. Great location. A little overpriced, however.", "helpfulness": 4, "user": "TravelTimeGuy", "date": "June 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 17008951, "likes": {"liked": "— Location, beach, great staff, boardwalk, free valet/parking", "disliked": "— Misleading bike rental and beach equipment workers, no free wireless internet"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "My wife and I stayed for four days/three nights at the Sheraton because we wanted to stay on the water. I would have rated it excellent, but I feel the price is a little high. It's a nice hotel and it is right on the water and the boardwalk, but I feel $229-$250 or more a night for a weekend is too high. Maybe for a four-star, but not sure about a three-star Sheraton. Weekday rates are less than weekends, so maybe that's the best route to go. We were also staying during the \"peak\" summer season, so I understand a hotel has to make the money while they can. We were able to get a discount, but I want to give a fair evaluation for people paying a full weekend rate.", "title": "One of the nicer hotels in Virginia Beach", "helpfulness": 1, "user": "laragrey", "date": "June 17, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16992154, "likes": {"liked": "— the view from our room was spectacular", "disliked": "— the room was not cleaned by 6pm one day of our stay but they fixed it quickly"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008", "text": "The good: Great location, right on the ocean. The water was beautiful and surprisingly not too cold. I think around 75 degree water temp, but only an estimate. It was sunny and mid-upper 80's throughout our stay. The water was interesting and a little caution shoud be exercised here. Where we were on the beach, the water drops off pretty close to the shore. Only 30 feet or so from the shore it drops to around 6 or 7 feet. The waves were pretty active and a bit of a riptide. As adults and pretty strong swimmers, it was fun playing and swimming in the waves. There were some boogie boarding, but wouldn't say it was ideal--the waves broke a litle too fast.", "title": "Liked the Sheraton", "helpfulness": 2, "user": "Deb-NY-FL", "date": "May 28, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 16470649, "likes": {"liked": "— location", "disliked": "— food"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "I do have to say the entire staff at the Sheraton was EXCELLENT. From the front desk staff, the bellmen, housekeepers, restaurant staff to the front desk manager--everyone went above and beyond. We ate dinner once at the hotel's restaurant, Acqua Vi I think is the name. The food, wine and waiter were all good and reasonable priced, considering it's a pretty nice restaurant. Not stuffy or anything, as I wore dress shorts and a polo shirt and felt comfortable. They had a oysters rockefeller special for $2 each and the oysters were HUGE and tasty. Being on the boardwalk was also great! The Sheraton is located around 35th and Atlantic Avenue. There was an Arts and Crafts festival on the boardwalk during the day and early evening every day we were there. It was fun to check out the art booths, food booths, etc. This was a short walk from the hotel. There is also a fairly new Amphitheatre (King Neptune?) within a short walk of the hotel, right off the boardwalk, also. They had live music every night we were there, also. This was right next to the Hilton (31 and Atlantic), where we had a very good dinner. There are two restaurants inside the Hilton. One is more of a casual seafood bar and the other is more of an upscale steakhouse/seafood, called Salacia. The more casual restaurant (forgot name) also has a patio and outside bar, which was very popular every night . Salacia claims to have the best steak on the East Coast and I'd be hard-pressed to find one any better. It's a little high-priced--my NY strip steak was around $35 and that didn't include any sides (they were extra). It was delicious and the service was outstanding. The hotel has two outdoor pools and one indoor pool. We only swam in the indoor one one night for a quick dip in the indoor hot tub. During the day, we went to the ocean, instead.", "title": "nice pet friendly beachfront hotel", "helpfulness": 1, "user": "rfbCville", "date": "May 19, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 16205532, "likes": {"liked": "— pet friendly, comfortable bed, frig, located on the beach", "disliked": "— small bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "I called up the day before July 4th and booked a deluxe King Oceanfront room. The room was clean and the hotel was welcoming even for a holiday weekend. The resturant, however, needs a good shot of southern hospitality. The bartender was dreary and the manager was slow to acknowledge our presence in the waiting area. There was no hostess and we opted to eat at the bar because there werent enough waiters to service the resturant for a July 4th crowd.", "title": "Good Hotel, Great View, Ok Resturant", "helpfulness": 3, "user": "NYNJCPA", "date": "July 11, 2007", "detail_rating": {"front_desk": 5.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 8103680, "likes": {"liked": "— Right on the beach", "disliked": "— Room service and resturant staff"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "My family stayed here the 1st week of July. We have a family of 4, with two girls aged 15 and 10. We had a room overlooking the ocean on one of the upper floor. This is an old hotel with smallish rooms, and horribly slow elevators. The staff was polite and helpful. Also, it is located on the north end of the strip, and is a bit quieter than the hotels further south. The reataurant was decent, and the decor was quite nice.", "title": "OK overall - older tired hotes with good services", "helpfulness": 4, "user": "johnnyninetynine", "date": "July 8, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 8078630, "likes": {"liked": "— Great view, nice staff", "disliked": "— Horrible elevators, smallish rooms"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "If you can get a really good deal on a room here then I would recommend it. In contrast, the Marriott properties all seem to be really new and modern. The Courtyard, the Springfield Suites are pretty new and look great. The Hilton is the star on the beach though. It is a modern hotel with great nightlife (for adults) in the restaurants below.", "title": "Would not go back", "helpfulness": 1, "user": "BelmoTerr", "date": "July 7, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 8074069, "likes": {"liked": "— The beds", "disliked": "— The ceilings!"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The good:", "title": "Never again", "user": "treborr23236", "date": "June 24, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 1.0}, "id": 7977047, "likes": {"liked": "— Checking out and driving away", "disliked": "— Indifferent to horrible conditions"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "1) Location - definitely a good spot", "title": "Not great but not bad", "helpfulness": 3, "user": "TravelingManSpokane", "date": "June 21, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 7955775, "likes": {"liked": "— Quiter beach location", "disliked": "— Noisy pool gate underneath room"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "I booked this hotel even after reading some of the reviews here. BIG Mistake. We had a oceanview room on the 4th floor. The view was the best thing this hotel had to offer. Paying $279 a night for three nights, I was very disapointed with the hotel. The room was small, the bathroom very, very small. The bathroom had a leaky faucet, the sheet rock on the ceiling was peeling off - it looked like it was about to fall on whomever sat on the toilet. Staff did not care, we could not get another room because the hotel was sold out (at least that's the story we got). Even though the website says free valet parking, we were told before we even asked that valet parking is not free, it was based on gratuities and/or tips ... instead of explaining to them what the word gratuities means, we just parked it ourselves (the parking lot is only across the street). Staff was not friendly, did not offer any suggestions about local attractions and/or restaurants and when we asked them where we could find a Walmart or Target they said they did not know. The pools were very small, dirty. The bar by the pool served nasty, limp, overpriced drinks. The elevators were extremley slow and smelly. We had to compete with the staff to use the elevators and usually they cut right in front of guests - apparently we have all the time in the world since we are on vacation. We had the breakfast buffet in the restaurant, Aqua Vi, and it was just OK, expensive for what you got and the coffe was awful. Service was very slow.", "title": "Terrible for the money", "helpfulness": 1, "user": "DisneyTrip4Us", "date": "August 28, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 5.0, "rooms": 4.0}, "id": 8524571, "likes": {"liked": "— Views/Location", "disliked": "— Staff and cleanliness"}}, {"rating": 1.0, "title": "Horrible!", "text": "I am a pretty reasonable person and do not complain at the drop of a hat, but this was like no other Sheraton I have stayed at. This was more of a Motel 6 experience at a Sheraton price - very disapointed. Because of this experience I would hesitate to book another Sheraton.", "helpfulness": 3, "user": "swimbeach", "date": "August 16, 2007", "id": 8438711}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "When I booked I asked and was promised a rollaway bed, I", "title": "Horrible!!!!!!!!!!!!!!!!", "helpfulness": 4, "user": "LelaNorwalk_CT", "date": "August 16, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 8434895, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "got a deflated air mattress which was too big for the room.", "title": "Excellent Vacation", "helpfulness": 1, "user": "kim1886", "date": "August 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8378189, "likes": {"liked": "— The staff!"}}, {"rating": 3.0, "title": "Good Hotel, small room", "text": "Got in the room and my 4 year old informed me as she", "helpfulness": 1, "user": "capriski", "date": "July 20, 2007", "id": 8204391}], "location": {"country": "United States", "city": "Virginia Beach"}, "stars": 3.5, "variance": {"poor": 52, "average": 96, "very good": 168, "terrible": 42, "excellent": 179}, "aka": "Sheraton Virginia Beach", "slim_ranking": 0.254385964912, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Warm welcomes and great ocean views greet you at the Sheraton Oceanfront Hotel. Situated on the exclusive northern end of the Virginia Beach Boardwalk with direct beach access."}