{"user_rating": 3.5, "review_count": 282, "name": "Sheraton Baltimore North Hotel", "reviews": [{"rating": 5.0, "title": "Great Property, Location And Outstanding Service.", "text": "Good Day,", "helpfulness": 1, "user": "Jeff2086", "date": "February 15, 2009", "id": 24603423}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "This is the second time that \"Very Demanding\" has stayed at this property. The property meets and exceeds standards of what you would expect at a Sheraton hotel. The hotel is conveniently located next to the Towson Town Center Maryland business area, nearby restaurants are the Cheesecake Factor and P.F. Changs. Recommended that you check out Strappaza Italian Restaurants near the Towson Town Center, nothing fancy but very tasty Italian food and affordable, enjoyed it.", "title": "Exceptional Quality", "helpfulness": 1, "user": "ProfessorCool", "date": "January 26, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23925231, "likes": {"liked": "— The exceptional service, the great rooms, the location", "disliked": "— No continental breakfast; skywalk to mall wasn't enclosed"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008", "text": "The Sheraton Baltimore north had superior service from start to finish. Upon checking in the front desk agent offered to upgrade me to the club floor (free happy hour and breakfast), in addition invited me to the manager's reception and provided a ticket for a free drink. All of this was offered, I didn't have to ask for a thing, what a breath of fresh air. The hotel staff was friendly, helpful and just downright kind from start to finish. The room was above average in size and the room service was superior. Excellent experience from start to finish! Oh by the way, the nightly rate was under a $150, very good deal given the location and property.", "title": "Great Wedding", "helpfulness": 1, "user": "cmaxell", "date": "December 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 23030230, "likes": {"liked": "— Staff Friendliness", "disliked": "— Parking Garage"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008", "text": "- Very Demanding", "title": "Roadtrip respite at the Sheraton North!", "user": "Zinnia3", "date": "December 26, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 23018186, "likes": {"liked": "— Cleanliness, well-maintained condition, and pet-friendly", "disliked": "— No complaints"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "What a great hotel! Easy to find and plenty of parking. They have a garage and spaces for oversized vehicles as well. The rooms are beautifully appointed and wireless internet was superfast! The front desk was very helpful and professional. And best, it's attached to Towson Center Mall across the street. They deliver your receipt to your door the day you checkout, so you have the option of express video checkout or regular checkout at the desk.", "title": "Very good hotel overall", "helpfulness": 1, "user": "Richmondtravlers", "date": "December 24, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 22974182, "likes": {"liked": "— Convenient, safe, comfortable, reliable", "disliked": "— It is a standard, business-class hotel"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "What a great hotel and great staff .... will stay in this hotel again and will recommend it to all friends.", "title": "Great", "user": "xalsaleh", "date": "August 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19205152, "likes": {"liked": "— no fridge or microwave"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008", "text": "Being a HIlton Diamond member, I don't frequent Sheraton's too often, but since my client was in an adjoining office building, I figured I would stay here since it was convenient. I arrived very early, around 1pm, but the front desk clerk was very helpful and found me a room which was ready. When I got to the room it was your standard hotel room, but was very nice and clean. One of the great things about this hotel is the free internet. You can tell the hotel is a tad dated, but is kept up very well. Another great thing is the mall which is next door and has a TGIFridays and Rainforest Cafe inside the mall. On the opposite end of the mall is a Bahama Breeze which is one of my favorites. You have to walk through the mall and through the parking garage to get there, but it is an easy walk. The bed was very comfortable and I had absolutely no problems at all during my stay. I would definitely recommend this hotel to anyone staying in the Towson area.", "title": "Pretty darn good!", "user": "TXBusinessTraveler", "date": "July 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 18289546}, {"rating": 5.0, "title": "Best Hotel in the area", "text": "We just returned from a trip to Baltimore, during which we stayed at the Sheraton in Towson. We loved the area, and the fact that the hotel was so close to the mall, restaurants, and bars. We also appreciated the complimentary shuttle that transported guests to any location within 5 miles of the hotel.", "user": "hotelcritic79", "date": "June 30, 2008", "id": 17381570}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "But the best part of our stay was the hotel itself. We hadnt been down to the Baltimore area in several years, and so we were pleasantly surprised by the hotel renovations. The hotel is completely updated and gorgeous. Talk about bold and beautiful decorating decisions. Forget the \"hotel carpet\" and hotel \"art\". This hotel has a new, modern look to it that would please even the strongest critics. Our room was clean and comfortable, as was the hotel restaurant and bar. We never expect great food at a hotel restaurant, but we were proven wrong by this hotel. We ate dinner in the restaurant, and were surprised by the exceptional quality and presentation of the food. The service in the hotel was great throughout our stay, from the front desk representative to the restaurant servers, and the housekeepers. Everyone was extremely friendly and helpful. We really felt that the entire staff cared about us and wanted to make sure that we enjoyed our stay. Well, we definitely did. We will be recommending this hotel to everyone and anyone who is traveling to or through the Baltimore area. And we will definitely be staying here any time we are close to the area as well.", "title": "Great View!", "user": "islandhoney", "date": "June 24, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 17192692, "likes": {"liked": "— Cleanliness", "disliked": "— There was nothing I didn't like."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "I just can't wait to go back. This was the best hotel experience that we have ever had!", "title": "Away from the city", "user": "HockeyFan6", "date": "June 22, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17125718, "likes": {"liked": "— Great bed, near lots of bars and restaurants", "disliked": "— No flat panel TV yet, and did not have Versus network for Stanley Cup playoffs (many hotels don't, though)"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008", "text": "We traveled to Baltimore (along with the rest of the city of Boston) to see a Red Sox game at Camden Yards. The hotel was close enough that getting into Baltimore was very easy and we saved money on parking. The room was spacious with a huge bed and plenty of room to spread out and relax.Free wireless throughout was easy to connect to and fast enough to boot. Very clean, with plenty of towels and toiletries. Had one meal in the restaurant, (breakfast) that was fine, if unspectacular and reasonably priced. Despite the hotel being full for a conference and graduation party, it never felt crowded and/or particularly loud. Close to the Towson Center Mall and other necessities (Starbucks etc) Would definitely stay again.", "title": "Just the Ticket!", "user": "travselector", "date": "June 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 16649329}, {"rating": 1.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "Have you ever been descriminated against? Yeh, me neither. That is of course, with the exception of my recent stay at the Sheraton Baltimore North. So where do I start, how about where most people do, at the BAR.", "title": "So I did not realize that treament is dependent upon age?!?!?!?!??!?!?", "helpfulness": 1, "user": "cmarti15", "date": "May 20, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "rooms": 4.0, "location": 4.0}, "id": 16238529, "likes": {"liked": "— The location, down the stree from the bars", "disliked": "— The employees"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Coming from the service industry, I was once a waiter, I can understand and appreciate the need for service with a smile, something I did not receive at the Sheraton Bar. A bartender, who was probably 2 yrs my senior, a whopping 26, decided to base his client relations upon the age of the attending patrons. Upon my arival at the bar I was forced to request menus, a circumstance that was due to the tender's inability to pay attention to myself and the rest of my party. After tossing the menus at us, an action which is unacceptable under any circumstance, we proceeded to order; now I must say, the food was wonderful, it was a highlight of the weekend. When it came time to pay the tender told us that \"oh by the way, there is a special on Killian's Red today, $2 bottles.\" Well, thanks for the update!! So I did what any sensible person would have done, asked if he could charge us for Killian's rather than the beers we drank? You would have thought that I asked this guy to part the Red Sea: \"Sir we are limited in the number of Killian's we have available for the special, and these are counted by my Manager.\" Dude, its beer, it grows on trees. Ok fine, I will accept his response, but does that mean that your manager would approve of you telling us about a special after we have paid? Is it that hard to use your noggin?? So that was that, and nothing came of it, but that was just the beginning.", "title": "nice room, poor service", "user": "daydrmr", "date": "April 22, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 2.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 15247807, "likes": {"liked": "— the rooms were clean", "disliked": "— the customer service"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "Let me just preface the next part of this rant by asking a simple question, does anyone know what \"best and final\" means, or for that matter what \"guarenteed best rates\" means, cause if so then you can run this Hotel. When I made my reservation I was told that my room rate was $170 a night, a rate which is indicitive of my AAA discount. Ok, so not to bad considering that it is a Sheraton, right? Thats what I thought, until I received my bill. Picture this, your sleeping soundly on a Sunday, the day of rest, knowing that your guarenteed something in this life, the rate of your room, only to find that your bill for the two days is, ready...$695. Woha!! Ok lets take it back in the day here, 2+2=4, 3+3=6, 170+170= 340...hmmmm? Well I took it to the manager, and let me tell you that up to that point I did not think I was dumb, but when she was done with me I was second guessing my Ivy League diploma (I am kidding about the Ivy League, I went to Towson). She more or less told me that I was wrong, and my story was inconsitent with her own, well no [--] there are inconsistencies, there are about 355 inconsistencies. So I took it on the chin and went back to the room, where the girlfriend was waiting. Let me just say that she gave a wonderful pep-talk....needless to say, I went back down. Finally after about an hr and a 1/2 of pleasent conversation, we found my mistake.....Im kidding, imagine reading this whole thing only to find that I was wrong, haha. For real, though, she found her mistake and proceeded to pull her foot out of her mouth and her jaw off of the ground, all at the same time mind you. By the way, she never said sorry. Wow!!", "title": "Just average-thin walls", "helpfulness": 1, "user": "hammockdoll", "date": "February 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 13629734, "likes": {"liked": "— free parking, beds, location", "disliked": "— thin walls, noise, no bathrrom fan"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "Let me just add a few things: we had to take the elevator up 2 floors in order to go down 1, there was human waste in a plant by the elevator (kinda funny), we were woken up three times, once by room service who was at the wrong room (did they change a 2 to a 4 recently, could someone let me know next time, I think a memo is in order?) and then two more times by housekeeping who was asking us to checkout (checkout is at 12, this was at 9 and 10), and finally the pool and hottub was down, dagger!", "title": "Sheraton Baltimore North Hotel Towson - is fine by me", "user": "Beachgirl007", "date": "January 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 13056537, "likes": {"liked": "— the bed", "disliked": "— the location"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "It's a nice surprise for me because I got a very special rate for this hotel from Travelocity..The room is very comfy and clean. Staffs are friendly. Free parking and wireless internet. Also it's right across the Towson Shopping center that just opened up and very fancy. So I stayed extra night with that very special rate.", "title": "Enjoy the stay", "user": "Emmy814", "date": "November 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22107405, "likes": {"liked": "— Great Value", "disliked": "— could use more guest information"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2008", "text": "I booked this Hotel 10 months before my wedding. When I booked, the wedding coordinator had just left so I met with the Banquet Manager. The Banquet manager was very helpful and had us all very excited about having the reception at this venue. We were concerned about the construction going on at the hotel, but we were assured that it would be done well before our wedding. The prices were right and we booked. A few months passed and a wedding coordinator was hired, she was wonderful. She took the time to explain and LISTEN to everything that we wanted. She took detailed notes and assured us that everything would run smoothly. She was professional and followed up with us the same day with everything we asked her that she had to get back us on.", "title": "Awful Wedding Provider", "helpfulness": 3, "user": "notarange", "date": "November 6, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 21590196}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled solo", "text": "Then it all went down hill... The wedding coordinator had to leave for personal reasons, even though we were told she quit, the new wedding coordinators were the snobbiest, fakest, most un-respectful people that I had met in the wedding business. We met with them and explained everything again, they rushed us through the meeting and left me with a horrible feeling. I had to reach back out to them to get the information in writing. They constantly forgot to update the payments that we made. With only two months to go, it was too late to book another reception site. We had put a hold on 25 rooms for the night of our wedding, and then come to find out they only booked us for 10 rooms since there was a golf tournament that same weekend. I had to call to get that answer, as no one called me to let me know.", "title": "Not what I'm accustomed to from Sheraton", "helpfulness": 1, "user": "MarylandNurseExec", "date": "October 22, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "cleanliness": 1.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 21117962, "likes": {"liked": "— Location to Towson Town Center", "disliked": "— Dirty stained carpeting"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "The good thing, no one new about all the things that were messed up with the reception... There was still construction going on, the buffet tables were supposed to be outside of the room in a hallway but they were in the room ( I was told during the reception that it was my fault for not specifying-- even though I told EVERYONE I met with), our reception went until 12:30 yet the linens were all taken off the tables by 11:45, the staff yelled at my DJ for not being on schedule ( I specifically asked the DJ to be in charge of getting everything done, not the hotel--which I specified to them), we had additional desserts for $8.00/ per person and they were a joke, we were supposed to have additional bartenders at the hotel bar afterwards (only 1 was there), and my lovely wedding coordinators were no where to be found at 12:31.", "title": "Nice place", "user": "MakeYouHumble!", "date": "October 15, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 20915993, "likes": {"liked": "— location, convenience, professionalism", "disliked": "— key cards don't work, business center tiny"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "I recently stayed overnight at the Sheraton Baltimore North Hotel while participating in Baltimore's Susan Komen Race for the Cure. Check in went smoothly, I was directed to the elevators where I immediately noticed a large stain in the floor of the elevator. The elevator ride was somewhat shakey taking me to the Club Floor. Upon arrival in my room another Huge stain on the carpet in the room. The hotel is in dire need of renovation. Old television, outdated furnishings etc. I would not have stayed more than one night in this hotel. The hotel touts the walkway directly to Towson Town Center, which is a plus, however once you take the walkway instead of coming out into Towson Town Center, you end up in a garage, and it is up to you to figure out where to go from there. On a more positive note the bed was comfortable!", "title": "Kid Friendly", "user": "hmlax", "date": "September 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20123283}], "location": {"country": "United States", "city": "Towson"}, "stars": 3.5, "variance": {"poor": 28, "average": 60, "very good": 106, "terrible": 13, "excellent": 75}, "aka": "Sheraton Towson", "slim_ranking": 0.428571428571, "description": "Sheraton Baltimore North Hotel is connected by skywalk to the Towson Town Center. We are 15 minutes from Baltimore's Inner Harbor, Oriole Park/Camden Yards, Ravens Stadium, and Timonium Fairgrounds."}