{"user_rating": 4.5, "review_count": 1562, "name": "Sheraton Krabi Beach Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "Just returned from 5 days at Sheraton Krabi with two teenagers. At first I thought perhaps I had made a mistake in booking this hotel (it was raining and low tide), but the next morning changed my mind. Very comfy beds and bedding. It is a beautiful lush property with a nice quiet beach, beautiful pools. Teenagers liked it as they could disappear most of the day and hang out at the beach or pool, play volleyball, Thai kickboxing lessons, etc. The staff is extremely welcoming and efficient. After visiting Ao Nang one evening, I definitely made the right choice by choosing Sheraton Krabi. Also there are great restaurants nearby- one on the beach with cheap good food, and a Nepalese one right across the street with nice food and friendly owners.", "title": "Great place!", "user": "RubyMonsoon", "date": "March 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102168293}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "My wife and I have just had two beautiful weeks in the Sheraton at Krabi, we had a premium ocean facing room. From our arrival to the day we left we found the staff to be extremely pleasant and very helpful at all times, even stopping to give you a lift in their golf buggies if they were passing. The breakfast was first class with a wide variety of hot and cold food. The hotel grounds, which have 20 full time staff to look after them are immaculate. Both pools are excellent with plenty of sunbeds and even hammocks in the grounds. The beach is very safe for children. There are a number of very good, cheap restaurants in the area which serve local food. The only negative during our stay was the dive centre, not run by the hotel. We found the staff there to be very unhelpful and we had the distinct impression they did not want our business, this was confirmed by other guests we spoke to. We did however find Manta Diving in Ao nang to be very good.", "title": "Wonderful hotel in a lovely setting", "user": "DAPC13", "date": "March 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 101740637}, {"rating": 5.0, "title": "excellent place to chill!", "text": "Spent 10 great days here. Two big beautiful pools with a nice beach and lovely grounds. Masses of lounges and plenty of places to lounge in. The staff were all very nice. Breakfast were great with plenty of variety and we both liked getting our own pots of coffee and tea at the start of breakfast. The restaurants were all fine but of course more expensive than if you go outside the resort into the little village. Wine is just prohibitively expensive, being Aussie I couldn't bring myself to spend 40 odd bucks for a $10 bottle of wine so just stuck to beer! The rooms were very nice although I don't particularly like having a shower in a bath tub and the telly was a bit of a relic but other than that it was fabulous place to stay and I would certainly recommend it.", "helpfulness": 2, "user": "Scozz", "date": "March 27, 2011", "id": 101690995}, {"rating": 5.0, "stay_parameters": "Stayed January 2011", "text": "Beautiful resort with rich tropical vegetation, very intimate atmosphere. Friendly staff, good food (especially breakfast buffet). White sandy beach. Would definitely recommend it and wish to return.", "title": "Magnificent!", "user": "irinux", "date": "March 26, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 101616531}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "My husband and I stayed at the Sheraton Krabi Beach resort for 9 nights in March 2011. Upon arrival we were greeted promptly, served cooling drinks/towels and checked in all within 20 minutes. This was a excellent start after a very long flight from London. We arrived in the evening and shown to out room which was very clean but I did notice the bathroom was \"tired\" and needed some renovation. In the clear light of day and a night's sleep I did realise this superior room was quite basic and there were no modern touches. For example the TV size was hugh and quite domineering and the bed was a old style divan. After the second night we asked for the mattress to be changed as it was like sleeping on concrete and we both had sore backs/heads and legs- the staff were ever so helping and did so promptly. In all my years travelling in 5* hotels this was the first time I had a really bad bed!!", "title": "Good location", "helpfulness": 1, "user": "UKM", "date": "March 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 101076743}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "Lovely hotel and location (great clean beach with very clean water), nice rooms (we took connecting rooms), always clean, average food (which was a shame because potential totally there) BUT what was lacking to this hotel was SOUL, AMBIANCE and MANAGEMENT.", "title": "VERY NICE RELAXING HOLIDAY, BUT.....", "user": "nixi66", "date": "March 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 99951016}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We had a great relaxing holiday at the hotel, but I would just like to point out a couple of issues, which were annoying but could be so easily resolved:", "title": "Definitely will be back!!", "user": "explorerKl", "date": "March 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 99898471}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "First couple of days we were there, the breakfast buffet was a total fiasco and staff could not cope with the demand (hotel fully booked - one poor guy making the waffles, french toast, scrambled eggs etc-on two occasions the food such as baked beans etc was totally cold) and we were always wondering \"where is the manager\" to get this into shape? Never saw anyone managing it, which is a shame as breakfast is supposed to be a relaxing and enjoyable start to the day!", "title": "Ideal Beach", "user": "DalianEx-pat", "date": "March 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 99878350}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Both pools are very nice and very clean but again no staff to order drinks and food. No one ever came to ask us if we wanted to have a refreshing drink or any food. We were a couple of times at the pool but mainly at the edge of the beach and there YOU have to chase after the few staff to order drinks. Again, NO management around to direct staff!", "title": "Great Htel in a Great location", "user": "JohnboyOxon", "date": "March 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99872378}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Room service was very good and efficient. Had pizzas delivered and they were amazing.", "title": "Luxury, service and fabulous grounds on Krabi's exotic coastline", "user": "tfkh80", "date": "March 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 99634450}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Sheraton is a Sheraton wherever you go. It has very international feeling, when compared to many of the smaller resorts that are more \"thai\". The staff is wonderful (though I got a little tired of the \"good morning sir, hello sir, evening sir, ...sir, ...sir\"), breakfast is good though very pricey, beach is ok, pools are cool. The garden seemed to be a little bit work in progress still.", "title": "International Chain Resort with Thai Twist", "helpfulness": 1, "user": "FinnInTheWorld", "date": "March 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 100726532}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "The rooms are fairly modern and light in color and decorated in very international style. They're quite good sized and the bathrooms are squeaky clean. The balconies face the sea though seaview is so-so from the lower floors.", "title": "Paradise", "user": "NathalieGarino", "date": "March 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100579068}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "The hotel is located on a quieter beach called Klong Muang beach. There are not a lot of things around the hotel. However, when you get out of the hotel and turn right you will find a small mall called Klong Muang Plaza. There are a couple of restaurants worth trying and a really nice thai massage place run by a heartful lady. Highly recommended! The price is also peanuts when compared to the massage prices in the hotel... No nightlife around here. There are also a couple of places to rent a scooter, if you want to drive to the nice Tub Kaek beach (further away from Ao Nang) or to Ao Nang, though I don't recommend that in the night time.", "title": "Value for money", "user": "F-Nielsen", "date": "March 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 100383196}, {"rating": 3.0, "title": "A nice resort for relaxation but without the Krabi \"wow\" factor", "text": "Overall, I had a little bit of mixed feelings regarding the place. It's so much a Sheraton, that it really reminded me of all the Sheratons I've stayed for business, but on the other hand it's quite nice hotel. For the price I'd still recommend you to look for other options.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "March 13, 2011", "id": 100007139}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "From the moment we arrived at the Sheraton Krabi throughout our stay and upon leaving, we have received top service treatment.", "title": "Great place to stay", "user": "Mercedesman3", "date": "March 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 99961296}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Just returned after a very realxed 7 nights with our baby daughter. The hotel grounds are beautiful, wonderful gardens to walk through. Lovely pools at a nice temprature.", "title": "Beautiful Hotel", "helpfulness": 1, "user": "annomonus", "date": "April 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 103694287}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Stunning views from the pools directly to the beach.", "title": "Enjoyed our stay", "user": "Carol59California", "date": "April 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 103634098}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Breakfast was perfect and never busy. The Malati resturant was our favourit and the sunset from the resturant/bar is not to be missed.", "title": "Relaxing break in tranquil surroundings", "user": "MrsN77", "date": "March 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 102351769}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "Outside the hotel there a various local resturants, massage and a 7/11 for any things you may need. We are at the resturant 'Le Cafe' a few times which was very good local thai food at a cheap price.", "title": "Amazing experience!", "user": "Schattenjagen", "date": "March 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 102263329}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Thank You Sheraton Krabi for a fantastic first holiday with our baby daughter.", "title": "A relaxing stay in a beautiful resort", "user": "SJIJ", "date": "March 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102262137}], "location": {"country": "Thailand", "continent": "Asia"}, "stars": 4.5, "variance": {"poor": 61, "average": 138, "very good": 463, "terrible": 25, "excellent": 875}, "aka": "Sheraton Krabi Beach Hotel Nong Thale", "slim_ranking": 0.461538461538, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.0}, "description": "Enviably located on a peaceful, white sandy beach, our rooms feature every comfort to ensure a blissful stay. With a full range of activities and excursions we are the ideal choice for families and couples alike. Be as active or as relaxed as you like - try kayaking, climbing, diving, snorkeling, the heavenly Mandara Spa or lazing in a hammock by the sea. Fabulous dining, live entertainment and warm hospitality await."}