{"user_rating": 3.5, "review_count": 754, "name": "Sheraton Atlantic City Convention Center", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "This was a very nice hotel. Rooms were large, as was the bathroom. Beds were pretty comfortable. And most of the furniture appeared to be new. Check-in was very easy. The staff, to the limited extent I dealt with them, was very polite. Though I did not use the indoor pool or fitness center, both looked new and well maintained. The fitness center had several cardio machines and a decent number of free weights as well.", "title": "Very Nice Hotel", "helpfulness": 1, "user": "Monroe86", "date": "September 21, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 20262251, "likes": {"liked": "— Hotel quality", "disliked": "— Elevators were slow."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "Location is very good. Caesar's and a number of the other boardwalk hotels are less than a ten-minute walk. Also, the hotel is surrounded by restaurants and an upscale, outdoor shopping mall. There's plenty to do around there, but the hotel is self is very quiet.", "title": "Another Great Stay", "user": "HappyTraveler081", "date": "September 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19934364, "likes": {"liked": "— Everything", "disliked": "— Nothing to complain about...it was all good!"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "My complaints about the hotel are mostly external. Self-parking was a slight pain as you have to park across the street under the convention center. I probably could have remedied this by simply forking out another $5 for a valet, though. Also, beware as you're pulling in. The hotel is surrounded by an outdoor mall, and if you turn down the first street, which has a J Crew on the corner (for point of reference), you end up being forced onto the expressway and will be looking at a ten-minute detour.", "title": "Totally fine stay.", "user": "Greg187", "date": "September 4, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 19750422}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Overall: a very good stay.", "title": "Loved The Sheraton - Great Vacation", "user": "Mbenriv", "date": "September 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19674031, "likes": {"liked": "— The location, the room and that it was pet friendly.", "disliked": "— People who came with pets that didn't like being left alone"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled solo", "text": "We stayed at the Atlantic City Sheraton Sept 1-6 and loved it. It was our second stay there this year, and I am happy to report that it was even better than the first time around. I am a very picky traveller and I have to say, this was one of the best hotels I have stayed in.", "title": "3 great days, 1 sleepless night", "user": "vista4u", "date": "August 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 2.0, "rooms": 2.0}, "id": 19486999, "likes": {"liked": "— spg rate online", "disliked": "— water systems make noise"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "It was our first trip to South Jersey and we are happy with our stay at this Sheraton, it made our first stay in the region a good one. It should be noted that our trip was nice because of the property, not because of the staff. In other words, staff is a hit or a miss here, (read below). So we went ahead and enjoyed our trip and avoided the staff altogether.", "title": "Happy with our stay!", "user": "Bose2", "date": "August 25, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 19343951, "likes": {"liked": "— Staff, room, location", "disliked": "— Staff, parking"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "SERVICE: One valet attendant was downright rude when we arrived in the \"circle\" in front of the hotel. We just wanted to park 5 minutes to check-in, but we were given an attitude by this arrogant attendant. The girl at checkin was giving us the \"just doing a job\" attitude (AKA, just move the line please, attitude). Our parking pass did not work half of our stay ( we were there 5 days) and many guests seem to have the same problem. Attendants inside the parkade said it was the machine and were trying to fix the gate. The front desk told us to keep our pass away from our cell phone, etc... The attendant at the club lounge was a zombie and looked like one too. Our housekeeper was super nice though and one night the concierge called a restaurant for us. I must also say thank you to the manager Danny who got us the exact room that we wanted when we emailed him. Thank you again. You see, they just need to remove the bad apples...", "title": "Awesome!", "user": "brandonaidanmommy", "date": "August 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 19320663, "likes": {"liked": "— The friendly service!"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "LOCATION: Good, it is near shopping, restaurants, casinos, the boardwalk & the beach... 15 minutes to the boardwalk at the most. Borgata is 5 minutes away by car. This hotel is also a good base to explore other South Jersey areas; Wildwoods, Cape May, Ocean City, etc...", "title": "Nice clean hotel, not great service", "user": "4girls2boys", "date": "August 23, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 5.0, "value": 2.0, "location": 2.0, "rooms": 5.0}, "id": 19284077, "likes": {"liked": "— clean rooms", "disliked": "— valet parking"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "ROOM: Our club level room was large, had a nice view, was comfy and had a large flat panel tv. Overall it was clean, but a really good scrubbing especially in the bathroom would be nice. The thermostat was not working properly in the guestroom, it was not cool enough, only mild air was blowing.", "title": "Sheraton -Nice Hotel b ok but some customer service issues", "user": "TPowell", "date": "August 5, 2008", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 1.0, "cleanliness": 5.0, "value": 2.0, "location": 4.0, "rooms": 5.0}, "id": 18643219, "likes": {"liked": "— I would be much more apt to recommned this hotel to anyone with the assurance that they could treat their guests properly.", "disliked": "— Customer Service"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "PARKING: Very long walk to the hotel and expensive ($12), strange because parking is usually ($5) in Atlantic City...", "title": "Returning someday soon!", "user": "TimeforfunVirginia", "date": "July 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18444289, "likes": {"liked": "— The comfortable bed, and clean pool.", "disliked": "— Paying for parking."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "I originally booked a room online through the hotel website for 1 king bed, thinking that only my husband and I would be going. Two weeks before the trip, I found out my mom and sister would be joining us. I called the hotel directly and was informed that all double bed rooms were booked and we would have to stick with our king bed unless something opened up. In a panic, I emailed Danny Williams of the hotel as his information was found on some prior TA reviews. He quickly responded that he would try to make the change and got back to me within 24 hours that he had found a room for us. Needless to say, we were all thrilled!", "title": "Great experience!", "user": "NicoleandKyle", "date": "October 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 21307526}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "When we arrived at the hotel at around 10AM, we were able to check in right away with no line. I was also handed a fully-packed gift bag and announced that I was the guest of the day. The gift bag contained treats (chips, granola bars, trail mix) and maps of the area, including an outlet directory. This was a fantastic add-on to our stay. As a gold star reward member, I also requested late checkout of 4PM and was guaranteed this even though it was a busy weekend.", "title": "Nice Clean Hotel", "helpfulness": 1, "user": "QQKris", "date": "October 14, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 20886247, "likes": {"liked": "— Clean room and beddings", "disliked": "— Bathtub"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "The room was clean and comfortable. Some of the carpets in the hallways seemed a bit worn, but in general everything looked good. Clean bathrooms and a nice lobby area. The best thing about this hotel is its location. It is directly across the street from the AC Convention Center and as we were going to a conference there, it could not have been more convenient. In addition, you are surrounded by all of the outlets. It's about a 10 min walk to Caesars and about 15 min to the Pier. If you want to take a quick cab ride, it's around $8-10.", "title": "Pretty good overall....", "user": "crazywudsl", "date": "October 13, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 20854731, "likes": {"liked": "— location", "disliked": "— check-in personnel"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The service was fantastic from pre-check-in to check-out and I would return anywhere that the management & staff are willing to work with the guests and be flexible. Nice hotel, great rates if you can get them discounted as part of a conference. Stay here!", "title": "Superb Value and Great Views of Atlantic City", "user": "ticex", "date": "October 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20817697, "likes": {"liked": "— Superb Views", "disliked": "— Overpriced WiFi Internet"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008", "text": "My boyfriend and I just came back from a last-minute getaway from Atlantic City. We stayed at this Sheraton for one night. We paid about $40 more for a club level room, which included continental breakfast, evening Hors D'oeuvres (cheese, crackers, grilled vegetables, quiche, beef steaks, soda, etc.) and bottled water & snacks throughout the day at the club lounge. It was definitely worth the price even though the breakfast was a little disappointing. However, for what I don't understand was why they charged room with king size bed more than one with two doubles.", "title": "Nice", "user": "lycheemojito", "date": "October 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 20602649}, {"rating": 4.0, "title": "great option", "text": "this hotel is a great option. it is not on the beach and not on the boardwalk (15 minute walk to both)", "user": "morgel", "date": "July 28, 2008", "id": 18352159}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "the rooms are updated (I stayed on the club level, a great room and well worth the extra 1,000 points)", "title": "Fantastic", "user": "bob2002Virginia", "date": "July 18, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 4.0}, "id": 17997752, "likes": {"liked": "— everything", "disliked": "— I had to leave"}}, {"rating": 4.0, "title": "Very nice stay at the Sheraton", "text": "only cost me 11,000 points for a friday", "helpfulness": 2, "user": "amirgold", "date": "July 14, 2008", "id": 17876913}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "the people at the hotel are fine(tony at the front desk could not have been better)", "title": "Close to the convention center, not close to the beach!", "helpfulness": 1, "user": "SeattleCrazyhair", "date": "July 8, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 2.0, "rooms": 4.0}, "id": 17666520, "likes": {"liked": "— The computers & internet access next to the bar.", "disliked": "— The location."}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "if you want the boardwalk, try the tropicana (rooms not as nice)", "title": "Unfortunate Stay in AC", "helpfulness": 1, "user": "hotelsRfun", "date": "June 25, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 17222448, "likes": {"liked": "— The Inconveniences"}}, {"rating": 3.0, "title": "A bit far from boardwalk but less crowded", "text": "I was expecting more from a Sheraton hotel. It was just average! Nothing stood out. I would only recommend to someone who wants a quiet non-casino hotel.", "user": "caramela", "date": "July 10, 2010", "id": 70437440}, {"rating": 4.0, "title": "Great Hotel", "text": "The Sheraton Atlantic City Convention City Hotel, is very convenient for those who don't wish to stay right in the middle of the action. The hotel is next to the convention center and train/rail station. The hotel is across the street from \"The Walk\" Outlet Mall, and is within walking distance to shopping, restaurants and casinos.", "user": "sjcruiser36", "date": "July 8, 2010", "id": 70198060}, {"rating": 5.0, "title": "Avoid the crowds in style", "text": "The hotel is what can be expected of a business hotel. Check-in is seamless, the rooms are spacious, clean and comfortable. The pool and fitness room are small, but will work. We did not eat on site, as there were too many options close by. The boardwalk is a leisurely 10-15 minute walk from the hotel, taxis and Jitney's (shuttle buses) our outside the door at the convention center.", "user": "mishpat", "date": "July 7, 2010", "id": 70063450}, {"rating": 4.0, "title": "Great large Rooms", "text": "The hotel lobby has memorabilia from several Miss America Pageants that's worth seeing!!!", "user": "terriblespellher", "date": "July 6, 2010", "id": 69954981}, {"rating": 5.0, "title": "Great Location", "text": "The hotel has wifi in the lobby and conference rooms ($9.99), but no where else. Rooms have ethernet connections ($9.99).", "user": "WhoDat36", "date": "July 6, 2010", "id": 69954500}, {"rating": 5.0, "title": "Excellent Stay", "text": "We stayed here for a weekend getaway. I chose the hotel since we are SPG members and we were using points for our stay. The rooms are what you would expect from a Sheraton - clean and comfortable with flat screen TVs. Beyond the picture of a typical Sheraton lies a staff that it extremely accommodating and go above and beyond for the guests. The front desk manager Cassandra was extremely accommodating and went above and beyond for us to make our sty very enjoyable. The concierge Bonnie was so great and recommended fabulous places to eat. Everyone we encountered during our stay was extremely friendly. We ended up getting upgraded to a VIP suite for one night and the room was amazing. The hotel is very close to the outlet stores and not far from the amazing sub shop White House. It's also walking distance to the boardwalk. I highly recommend this hotel if you are looking for a comfortable alternative to casino hotels.", "user": "LALANYC30", "date": "April 26, 2010", "id": 62538282}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "My wife and I were treated as if we were related to the owner. Everyone on the staff we came in contact with was amazing and went out of their way to make our stay as comfortable as possible. Easily the best place to stay in the city.", "title": "Like staying with your family...only better", "user": "denyob", "date": "April 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62088243}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "We went their with my infant son. There are no fridge or microwave in the standard rooms, so we had to upgrade to a deluxe class. They do not have any shuttle services. The location of this hotel is perfect, with the Atlantic city Factory outlets \"THE WALK\" round the corner and the board walk in 5 blocks away. Perfectly walkable.", "title": "Great Location and Hotel Interior, But need to improve amenities", "user": "Sujit-Mahapatra", "date": "April 18, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 61822648}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The miss america theme was excellent with real gowns of many former miss america on display in the lobby. The rooms had one picture of former miss america. The room was clean and looked excellent. The bed quality was superb. Don't drink the bottled water provided in the hotel room or else you will be charged 3.50 dollars each bottle. If you press the \"Room Service\" button on the hotel's phone, the call goes to the restaurant in the hotel. If have to dial \"Guest Service\" to connect to hotel's services. Internet is not free.", "title": "A little shabby, but great location", "user": "storm78900", "date": "April 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 61311988}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Overall the stay way very comfortable for me and my family.", "title": "Very nice non-casino hotel", "user": "alexischristine", "date": "April 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 61191501}, {"rating": 5.0, "title": "Superb!", "text": "This is by far the best hotel in atlantic city me and my fiance stay here every time we come to atlantic city first thing first the location couldn't be in a better place you have the ac outlet around the corner you have an applebee's a mcdonald and aunt annie also around the corner as for the hotel itself beautiful you a exercise room a indoor pool and a outside hottub the hall before you get to the elevator is sorrounded by miss america pagent gowns you have free computer and internet use on the second floor which is right across from the resturant the rooms are comfortable cozy soft bed and a view to die for I have no complaints ever when I stay at the sheraton infact we will be back this month can't wait so excited", "helpfulness": 1, "user": "215liberty", "date": "June 2, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 66125404}, {"rating": 2.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "I'll break the review into categories. . . .or complaints.", "title": "With a little more effort this hotel could be a really nice place to stay.", "helpfulness": 2, "user": "fadingflesh", "date": "May 24, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 65196653}, {"rating": 2.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Cleanliness and upkeep: To start, there was a large piece of wallpaper missing from the wall across from our room. Which appeared to be being worked on but no one on staff was seen the 3 days we were there. There was a long, curly black hair stuck to the handle of the ice bucket. The bathtub was very slow to drain after showers. The windows were coated in dirt, to the point that it made it difficult to see out of them. Friday morning there was a room service tray full of garbage outside of a room in our hall. When we returned to the room 6 hours later, it was still there in the hall. The walls are extremely thin, you can hear pretty much every sound from your neighbors next door, as well as above and below you, not to mention every single door in the hallway opening and slamming closed at all hours. In the lobby, there were all kinds of different displays of miss america memorabilia. Problem was that about 50% of the lights in the cases were burned out. I feel like I'm being petty and if it was just one of these things I would have already forgotten about it. It just seemed to me that there were enough little things to feel like a big problem.", "title": "Noisy and Loud", "helpfulness": 1, "user": "TravelCuties", "date": "May 16, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 1.0}, "id": 64339115}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "\"Hidden\" charges: This hotel's motto should be \"Free? We don't need no stinkin free!\" Most places I've stayed in my travels have certain amenities included. Like Wi-Fi, parking, and some sort of continental breakfast. Well we got the room at a pretty good rate and now I know why. It's like an airline charging you 50 dollars less than other airlines, but then charging you 80 dollars to check your bags. In an age where people can get free Wi-Fi access at their local McDonald's while eating a 99cent cheeseburger, I feel it is unacceptable to charge 10 dollars a day for Wi-Fi access in a 3+ star hotel. Also with parking lots in the surrounding area of the hotel charging between 5 dollars and free for all day parking it seems unfair for them to charge 15 dollars per vehicle per day in their self park lot. To be fair they do give you a discount on the rate of that particular parking garage which is normally 33 dollars a day. There was no sort of free breakfast of any kind, and the pricing at the restaurant was out of control. No lie, a regular sized ceramic mug of coffee was $4.50. There wasn't even a discount for hotel guests. We got the $20 breakfast buffet, and even at 9AM the food wasn't fresh. The \"hot\" food and the \"cold\" food were all at room temperature. The flavor of the food was decent, but I really couldn't justify the $20 price tag when the casinos offer $8 breakfast buffets with twice the selection.", "title": "They do a nice job for the Governor's Conference", "user": "dalm0m", "date": "May 7, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 63519989}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Location: The hotel is directly across the street from the convention center and the bus terminal. Which could be very convenient for some people depending on the nature of your stay. The hotel is only about 3 blocks away from the strip, plus one block to the boardwalk. It's really not far of a walk except at night when those 3 blocks turn into what seems to be a 5 mile scurry to safety and civilization. It felt more like \"Escape from New York\" than a 3 block stroll across town.", "title": "Great alternative to Casino Hotels!", "user": "goingfor50", "date": "May 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 63350656}, {"rating": 4.0, "title": "A very good place to stay for the non gambler.", "text": "If you do not gamble and have access to room comps at one of the casinos, you may want to give this hotel a try. It is located next to the Walk, which is an outlet shopping center with some restaurants. The hotel itself is very clean, has a small but well appointed fitness facility with pool, has a very nice lobby were you can wait for your clients. My room was a double, which was plenty adequate for my needs. The room was also clean and the water pressure in the bathroom was good. My one day buisness trip got extended by another day and the staff went above and beyond my expectations to accommodate me. The only thing you may have a problem with is parking. The hotel has a limited number of spaces next door at the convention center. Other than that I once agian would recommend this hotel.", "user": "Ticer", "date": "June 24, 2010", "id": 68559221}, {"rating": 5.0, "title": "great location!", "text": "excellent rates and location, nice view from my room and could walk to most attractions nearby.", "user": "inklily", "date": "June 19, 2010", "id": 67983261}, {"rating": 4.0, "title": "Sheraton, A Great Stay!!!!!!!!!!", "text": "I decided to book a weekend trip to AC with my boyfriend to get out of the hustle of living in NYC. Upon researching my hotels I wanted to find one that was convenient, great in location and for a good value. It was only a weekend trip so didn't want to spend mucho amount of money, besides were going away on a real vacation in October. Sheraton did it all, we decided not to drive and the Amtrak train called Aces that we took was right across the street, perfect!", "user": "liteskin80", "date": "June 14, 2010", "id": 67478436}, {"rating": 4.0, "title": "Convienient and Away from the Crush", "text": "The hotels tells you its 5 blocks to the boardwalk and casinos, which it is but very short blocks compared to the ones in Manhattan, well lit and safe to walk trust me.", "user": "skipmays", "date": "June 11, 2010", "id": 67187577}, {"rating": 4.0, "title": "Oasis in a scary city", "text": "The shopping outlets are great right across the street. The rooms were great, good space and I'm telling you this cause I'm 5\"10 and my boyfriend id 6\"2 so we require a lot of room. lol Great view of the other AC hotels, quiet, clean, and friendly staff.", "user": "Nicolejamay", "date": "June 9, 2010", "id": 66991854}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 76, "average": 155, "very good": 288, "terrible": 49, "excellent": 186}, "aka": "Sheraton Atlantic City Hotel Atlantic City", "slim_ranking": 0.133333333333, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.0}, "description": "Sheraton Atlantic City Hotel is near celebrated shopping, lively casinos, and the world-famous boardwalk. Adjacent to the Atlantic City Convention Center, our accommodation has 20 meeting/event spaces"}