{"user_rating": 4.0, "review_count": 2915, "name": "Sheraton Vistana Resort - Lake Buena Vista", "reviews": [{"rating": 3.0, "title": "Okay but won't stay there again", "text": "We stayed at the resort the last week of June. First of all, we arrived in the late morning and check-in is not until 4:00. That was a problem since my son's multiple food allergies prompted us to reserve a place with a kitchen so I can cook. Two hungry kids and the front desk insisted that we cannot enter until 4:00. Then we were placed in one of the older units. The small stream of water in the back smelled terrible and upon entering, we examined everything and discovered that some of the silverware in the drawers were not even washed! The unit looked very old and outdated. I called the front desk and insisted on getting a newer unit. At first they told us none were available and when I insisted further, voila, a unit suddenly materialized in the Lakes Section. That unit was decent, with a view of the pool. For the most part the place was somewhat clean except the track of the shower door which held a hefty supply of soap scum and hair which was never cleaned, cleverly hidden by the floor mat placed right on top of it. Yuck! Every day, the housekeeper would make it a point to make fancy folded designs out of the last paper towel hanging. I would have appreciated a little more attention in the bathroom instead. The same placemats were placed on the table every day, stains and all. Other things that bothered me was that the pool never had a lifeguard on duty and my \"personal concierge\" never ever called other than to leave messages about the timeshare presentations. For what we needed the unit for; a place to eat and sleep, it was okay, but I would definitely consider other places in the future.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "September 1, 2004", "id": 2507139}, {"rating": 5.0, "title": "WE DIDN'T GET OUR UNIT CHOICE . . . AND STILL HAD AN OUTSTANDING TIME . . .", "text": "It's important to keep an open mind. I read all the Trip Advisor reviews, and after we made our six-months-in-advance reservations, I sent an email requesting Cascades. I even reminded them again just before we left. At first, we were disappointed when we were assigned to Fountains, but as it turned out, we couldn't have been happier. We had a 2-bedroom villa. The two kids had their own bedroom and TV, so they were relatively independent. The kitchen had everything we needed to create a good breakfast at a reasonable cost to begin each day. The unit was about 1000 square feet and included two bathrooms and a washer/dryer. It was a short walk to a very enjoyable pool at Cascades. But after we explored a little, our favorite was the SuperPool at Spas. And they also had a huge and relaxing hot tub. We went after supper every evening. We accepted the offer to attend the time-share presentation, as they gave us a great deal on Universal tickets. The discussion was professional, personable, and without pressure. It had some very strong upsides, and we almost took it, but decided, cerebrally, that it just was too limiting for our vacation inclinations. We were there for nine days, and had plenty of time to look at the different sections. They were all very similar, and all had the potential for a great vacation. We took close looks at Cascades, Fountains, Lakes, Spas, and Falls, and we would have been happy in any of them. If you want Four Seasons luxury, this won't make you happy. But if you've got a family and you're looking for large accomodations that are clean, in a good location, within a well-maintained environment, and with family-friendly activities, this is an excellent choice. Here are a few tips: we reserved through Expedia and got a great price. We rented a car through E-Z Car Rental. Shuttle at airport and good prices, although the sign-in line was long and slow. We did non-Disney trips to Kennedy, Seaworld, Universal, and Silver Springs, and Orlando attractions like Titanic and Ripley's, so having control of our transportation made life less stressful. There are plenty of grocery stores within easy driving distance, so buying food is no problem. If we go back to Orlando, we'd stay at Vistana again in a heartbeat.", "helpfulness": 75, "user": "A TripAdvisor user", "date": "August 24, 2004", "id": 2491939}, {"rating": 5.0, "stay_parameters": "Stayed August 2004", "text": "The title says it all. We own a 2 bedroom lock-off through a competator in Orlando. We had an efficiency to trade and needed at least a 1 bedroom. Using our Interval International membership, we found this two bedroom at Vistana. Trading an efficiency for a 2 bedroom was a \"no brainer.\" That is, until I stumbled across the Trpadvisor web site and started reading the reviews. I tried to prepare my wife and two boys, ages 12 and 14, that you have to remember, we traded an efficiency for a 2 bedroom. They were not worried but they did not read what I read here.", "title": "Lakes Unit 1931 - outstanding!!!", "helpfulness": 30, "user": "DriveOrFly", "date": "August 20, 2004", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 2478645}, {"rating": 5.0, "title": "Had a great time at Visana Resort in Orlando", "text": "As we drove in (drove from Maryland to St. Augustine for a night then here) we arrived at 2:00 p.m. and it was a mad house. I felt confident because I used the Diamond Lane (see Sheraton's web site) prior to leaving to preregister. The Diamond lane had 3 people in it, the regular check-in lanes had over 100! We got our keys and went over to pick up our \"Welcome Package.\" It was there they asked us to set up the resort tour and sales presentation. We said no thank you. They asked why not, I said we already own and are not interested. They said OK and we never heard from them the rest of out stay.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "August 16, 2004", "id": 2453496}, {"rating": 5.0, "title": "Absolutly Excellent!!", "text": "As we drove to our unit, we did pass some older units. I do not know how they looked inside, but they looked older on the outside. I was nervous.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "August 14, 2004", "id": 2448472}, {"rating": 4.0, "title": "A fair value in Orlando", "text": "I stayed with 3 others at a Cascade 2-bedroom. These are the older units but it was recently refurbished. The room was adequate in size and comfort. Outside noise was properly muffled. A plumbing problem was fixed within four hours of our call. The public area includes several outdoor pools, jacuzzis and a general store. All areas appeared quite clean and maintained. If you have a kitchen unit, I suggest you stock up elsewhere, as prices on the property are not favorable. Otherwise, I see this as good value for your money.", "helpfulness": 1, "user": "volvo99", "date": "September 19, 2004", "id": 2584557}, {"rating": 4.0, "title": "EXTREMELY IMPRESSED WITH SHERATON VISTANA", "text": "We took our 5 children to Orlando to visit Disney. I found the Vistana Resort online and immediately wanted to stay there. It was extremely affordable for a family of 7. I was a little nervous after I booked and found this website with some negative reviews. I was pleasantly surprised when we arrived there.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "September 14, 2004", "id": 2571124}, {"rating": 5.0, "title": "We love it more each year!", "text": "There were a couple of minor glitches at check in. they did allow us to check in early and come back for the key later. That saved us time because there were not alot of people there early.. The problem was when we went back to pick up the key in the afternoon, we got it fine but when we got to our room, there was another family already moved in that exact room. We went back to the customer reception area, and my husband waited for about 40 minutes for them to straighten out the situation. They did comp him $40.00 in gift certificates for the inconvience. That was very nice.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "September 13, 2004", "id": 2569816}, {"rating": 5.0, "stay_parameters": "Stayed August 2004", "text": "We were thrilled when we got to our unit. It was in the Fountains section I believe. The unit was so clean and very spacious. I loved the enclosed screen porch. I was also thrilled with our master bedroom with Jacuzzi tub and all. The pool was right outside our unit, and it was open until 1:00 am. That was great, the kids got to go swimming every night we got back from a park.", "title": "Very Good Accomodations in Beautiful Resort", "helpfulness": 17, "user": "MauiLea", "date": "September 9, 2004", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 2519890}, {"rating": 5.0, "title": "Thank you!!", "text": "I was extremely happy with the whole stay. I was there the week Charlie was supposed to hit. We actually left the day it did strike. The Resort was very committed to keeping us all posted with weather reports etc. via the voicemail system on the phone. That allowed us to change our flight and get out before the hurricane hit.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "September 4, 2004", "id": 2512670}, {"rating": 4.0, "title": "Skeptical by the reviews.......... after our visit, Iwould stay again", "text": "This was a great place. We reserved a two bedroo condo. When we checked in (which was very quick), they were going to put us in the Falls area. I asked if it would be possible to go to the cascades section. They had no problem at all. The unit was clean and offferd enough room for 4 adults and 3 kids. A great place which had a great location in Orlando.", "helpfulness": 1, "user": "koosh0122", "date": "October 19, 2007", "id": 10130070}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "We booked this resort through RCI Extra Vacations and got a great", "title": "Great Resort - Would recommend", "helpfulness": 3, "user": "mominwato2", "date": "October 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10090772, "likes": {"liked": "— Cascades Pool", "disliked": "— Dated decor"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "deal of $249 for the week for a one bedroom condo. We went with friends who booked the same unit type. Several weeks earlier I requested rooms near each other. On day of check-in we got there about 12:30, knowing we may not be able to get into our rooms, which was OK. There was no line at checkin and we were very pleased with the front desk staff. Both of our units were in CASCADES - same floor, 3 rooms down from each other. The pool was great - Pizza Hut was an added bonus - very close (about 15 min) to Disney World.", "title": "Very Relaxing.....no surprises!", "helpfulness": 4, "user": "Prunelly", "date": "October 16, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 10088453, "likes": {"liked": "— safe area, convenient to shopping, good restaurants in the area, LOTS to do in Orlando BESIDES the theme parks!", "disliked": "— constant invitations from timeshare folks.....EVERYwhere you looked, there they are!!!!! ENOUGH!!!!"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Loved having the w/d in the room, so that I could get a little laundry done while the family was at the pool.", "title": "Be warned!", "helpfulness": 3, "user": "crystalclearsussex", "date": "October 16, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 10087985, "likes": {"liked": "— Spacious accommodation with good sized and comfortble beds.", "disliked": "— Site very large with car needed to reeach facilities, restaurnats etc."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We shopped at Wal-Mart down the street on day of arrival and stocked up for breakfast and snack items.", "title": "Pefect in every way", "helpfulness": 4, "user": "Paula590802", "date": "October 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10081690, "likes": {"liked": "— Amenities", "disliked": "— Nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "I can't speak to the resort amenities and scheduled events, but the two rooms we stayed in were not impressive. Our first room (which we could only stomach for one night) had a foul odor on account of cigarette smoke and mold growing in the bathroom. The timeshare-side of the business had real chutzpah when one of their representatives invited us to attend a \"free\" breakfast timeshare pitch even after we told him of our horrible first night experience! And then tried to persuade us three more time via the room phone early in the morning. To their credit, the resort did move us to another room, which was better odor-wise. Unfortunately, it had a washing machine full of food-encrusted dishes! Disgusting. We will never stay here again; and we'll certainly never consider a Sheraton timeshare.", "title": "Rooms Poor. Salespitch on Vacation Bad.", "helpfulness": 3, "user": "BraveNewWorld", "date": "September 23, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 8863613, "likes": {"liked": "— Location", "disliked": "— Rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "I just returned home from my trip to Orlando and my stay at this resort was simply wonderful. I read review some not so good but I took my chance and it was well worth it. I stayed at the palms which my villa was very spacious for four people and every day it was immaculate. If I hadnt taken my grandson I would have stayed on the resort every day. Each day they had a diffferent activity planned. From the time I checked in which was 11:30 am WE immediately checked in until the time I checked out everyone was so pleasant and helpful.I am so looking forward to my trip to Orlando Because I will staying there again next year.", "title": "If I could give it six stars I would", "helpfulness": 3, "user": "clamcn45", "date": "September 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8852778, "likes": {"liked": "— the beautiful spacious rooms with washer and dryer and jacuzzi tub", "disliked": "— the lizards on the sidewalks"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "My 24 year old son and I stayed at the Sheraton Vistana Resort in Lake Buena Vista Florida for four days in September. After reading the reviews on Trip Advisor.com, we requested a unit in the Cascades section, which is the newest completed section in the complex. When we checked into our 1 bedroom villa, we found there was only a king-size bed, while we thought we were getting two queens. We were told we had a sleeper sofa, but of course, neither my son or I wanted to spend our brief vacation on a sofa bed! Therefore, the management upgraded our reservation to a two bedroom villa in the Cascades section for only $30 extra per night. It was BEAUTIFUL! We had a full kitchen/dining room/living room combination, three t.v.'s two full baths with dressing rooms, two bedrooms, one with two double beds, and one with a huge king-size bed, a jacuzzi, washer/dryer and a lovely screened in porch. It was extremely clean, tastefully decorated and joy to stay in. There are many pools on the complex, but ours was only steps away in the Cascades area, and it came complete with a hot-tub, restaurant, and general store. There were also things we didn't take advantage of since we were only there for a short time, such as a great game room, tennis, bicycles, etc.", "title": "Would Definitely Come Back!!!", "helpfulness": 4, "user": "Geography Teacher", "date": "September 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8753578, "likes": {"liked": "— Beautiful, clean, tastefully decorated 2 BR villa", "disliked": "— Checkout was normally 10:00 a.m., unless you can get an extension"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The property was convenient to everything in the area. Disney was just around the corner, and Universal was a 15 minute ride away by hopping on I-4 right down the street. There was every restaurant you could imagine within a 2-mile radius, and Pleasure Island and Downtown Disney were a few minutes away.", "title": "Liked the spacious villa, but the Fountains II were dated", "helpfulness": 3, "user": "JamaicanExpatriate", "date": "September 14, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 8716762, "likes": {"liked": "— the bedrails and highchair they provided, and the spacious rooms int he Fountains II villas", "disliked": "— wireless service nonexistent, the carpeted patio"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We had such a great time in the four days we were there. We can't wait to return! The staff is extremely friendly and helpful and couldn't do enough to make our stay enjoyable. Since we had a late flight, they also extended our check-out until 12:00 p .m., and then offered to let us use the resort for the rest of the day, would provide us with showers, changing rooms etc, and a place to store our luggage if needed.", "title": "Go elsewhere if you are through RCI", "user": "GRDiva", "date": "September 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "location": 5.0, "rooms": 1.0}, "id": 8681163, "likes": {"liked": "— location to Disney", "disliked": "— Outdated rooms and attitude to RCI owners"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We were given an opportunity to visit the Vistana for 4 nights for $189 because we are SPG members. We often stay in Starwood properties because they are convenient and we have had a good experience. We were not required to do the 'vacation ownership' thing to get this. We had originally scheduled it in July, but our son and his fiancee' decided to get married that weekend in Vegas. When we called to change our reservations, there was a $50 change fee, but we we're still coming out ahead, so who cares?", "title": "Great resort!", "helpfulness": 6, "user": "Jerri S", "date": "October 8, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 10056662, "likes": {"liked": "— convenience"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We were given a large one bedroom in the Cascades section. Check in was no problem. We were given discount coupons for area restaurants and asked if we wanted coupons to the parks.", "title": "Great time at Vistana Resort", "helpfulness": 7, "user": "RockinRobin56", "date": "October 1, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10026054, "likes": {"liked": "— condo not just a hotel room"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "My husband and I (28 years married) were traveling alone. It was just for relaxation after a summer of wedding activities. The first night, we headed for Emeril's restaurant Tchoup Chop at Universal. What an awesome place to eat. It's expensive, but the service and the food are worth it!", "title": "Exceed every expectation", "helpfulness": 6, "user": "KeithConnolly", "date": "October 1, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10025808, "likes": {"liked": "— Room size, facilites offered, location"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2005, traveled with family", "text": "The next day, we scheduled massages. The therapist came to the Lakes activity center. She said she would come to the room for an extra fee, but it was nice to walk around the resort. I waited by the pool at the Fountains while my husband had his 1 hour therapeutic massage ($95). The pina coladas were great! My 1 hour swedish massage with aromatherapy ($85) was excellent.", "title": "Our stay was awesome!", "helpfulness": 1, "user": "corvette4432", "date": "September 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10013148, "likes": {"liked": "— Grounds and rooms were the best", "disliked": "— can't think of anything"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "My husband went back to the room and fell asleep in front of the big screen football game. I went for a walk in the rain (with an umbrella) to check out some of the 7 pools and hot-tubs and activity centers. Along with the general store, everything you could want was pretty much there.", "title": "Pleasantly Surprised!", "helpfulness": 2, "user": "stay-home-mom-pa", "date": "September 26, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 10005160, "likes": {"liked": "— Numerous pools to swim in", "disliked": "— Slow elevator and below average housekeeping"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "Accommodation", "title": "Loved the Sheraton Vistana", "helpfulness": 1, "user": "nordmia", "date": "November 2, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 10544510, "likes": {"liked": "— The rooms which were expectionally clean and tidy. Decor was good", "disliked": "— Food"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "After a few misconceptions my stay at this hotel was great!", "title": "Sheraton Vistana Oct, 21, 2007", "helpfulness": 1, "user": "jewelly", "date": "October 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 10433341, "likes": {"liked": "— Apperance of grounds", "disliked": "— size was a little large for me"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "We stayed for 10 days at the Sheraton everything was above my expectations.", "title": "I'm here right now!", "helpfulness": 9, "user": "Wojo88", "date": "October 24, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10282581, "likes": {"liked": "— roominess and comfort", "disliked": "— going back home to work"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "We were given the Cascades section (one of the hotel areas requested prior to visit) and the rooms were exceptionally clean and well kept. The villas were very large - even larger than my one bedroom flat in London.", "title": "Just, OK or maybe Not", "helpfulness": 3, "user": "okufanatic", "date": "October 23, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 1.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 10271625, "likes": {"liked": "— spacious", "disliked": "— Dirty master bath and rock hard bed!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "The master bedroom had as stated a whirlpool bath and a separate dress area including a large walk in shower. We were very pleased with the accommodation.", "title": "Quite impressed", "helpfulness": 3, "user": "TLWhite", "date": "October 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10231629, "likes": {"liked": "— Room layout and swimming pools.", "disliked": "— Outdated and worn decor and bedding."}}, {"rating": 5.0, "title": "Exceeded our expectations", "text": "We booked our trip through Travelocity and received an outstanding rate. We had checked out the resort on-line and were skeptical that what we would receive was what we were looking at. The 2 bedroom villa we reserved was in the \"Palms\" which we were told was one of the oldest in the resort. But we had no complaints - NONE! The resort was the best part about our entire vacation. We have already made arrangements to return. We highly recommend the Sheraton Vistana Resort.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "August 14, 2004", "id": 2448389}, {"rating": 5.0, "title": "The \"BEST\" place to stay when you want to be comfortable", "text": "I stayed at the Cascades sections two bedroom villa for 2 weeks me, my husband , my daughter 6, and my infant baby boy 11 months. I absolutely loved the neatness of the rooms, how clean the pools where, the cleaning service was great, they came when they knew we where gone; the washer and dryer was a plus, can't forget to mention that all the parks and attractions where minutes away which was great. I'll definetly go and stay at this resort again with my family it was sooo beautiful and I'll definetly recomend it to friends and family.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "August 12, 2004", "id": 2444949}, {"rating": 5.0, "title": "Awesome experience!", "text": "Just returned from our FIRST EVER Family vacation and were so pleased! We went to the Resort on a Time-Share Presentation offer. The 90 minute presentation and $100 cash was worth going through for this resort. We paid a small amount to stay there and were in a fabulous 2 bed/2 bath villa. We were treated very kindly. The only complaint was some of the guest service people did not know their directions for the surrounding area of the resort. Kinda had to figure it all out on our own. Took advantage of the free photo session with the resort. Would not do that again. Fine photos but we paid over $50 for color printer pictures, not \"real\" photos. I do this all the time at home and hate how they stick on the glass when put in frames. But, I pay pennies for the copies, not $50.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "August 11, 2004", "id": 2442199}, {"rating": 4.0, "title": "Nice, \"homie\" feel.", "text": "Still would highly recommend the resort and hope to go back some day!", "helpfulness": 5, "user": "A TripAdvisor user", "date": "August 7, 2004", "id": 2428103}, {"rating": 5.0, "title": "Returned yesterday from a 7 day trip. Loved it!", "text": "I just returned from a two week vacation at the Vistana Resort, and overall i would say i enjoyed it very much. My party stayed in FALLS and though it is one of the older sections, it is still a quite nice place to stay. Our villa had a big kitchen and living room/dining room, a nice sized master bedroom, and another bedroom with two twin sized beds. It was nothing really fancy, but it felt like a nice \"homie\" place. We were very close to all the pools, which are very nice places to go in the evenings. The best pool to go if you are looking for peace and quiet is the Courts pool. At night time, the pool by Zimmie's (an on site restaurant and bar) is always fun, as they have entertainment and karaoke. The Vistana resort was a lot of fun, but next time i would like to stay in one of the newer portions, as they seem very beautiful.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "August 4, 2004", "id": 2381615}, {"rating": 2.0, "stay_parameters": "Stayed July 2004", "text": "Stay 1 week, July 17-24. Requested either Cascade or The Lakes. Was told by the resort, to arrive on a Sat. to be assured a Cascade Unit. So, we arranged our trip accordingly, even, staying one night, so that we would arrive on Sat. Well!!, when we checked in, I was told that all the units had been reserved on FRIDAY. I was assinged a bottom unit in the Fountains. After looking at the unit, I was dissapointed and went back to see how they could accomodate me. After endless conversation, I took a unit on the third floor of the Fountains. Yes, you have to climb the stairs, but the skylight gives the unit a much more open feel. The unit was clean, and very accessible to the entrance. The Fountains Pool, was frequented by drunk locals almost every night. Security did nothing about it, when it was clearly posted no alcohol allowed. They said they come in every night. I called the front desk, and was assured I must be mistaken. Whatever, I will stay on Disney Property the next time I visit.", "title": "Overall Ok, But Probably Would Not Stay Here Again", "helpfulness": 7, "user": "Nancy D", "date": "August 1, 2004", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 2.0}, "id": 2350374}, {"rating": 2.0, "title": "Excited at first, but we went thru it..", "text": "At first, reading all the reviews from this site, I called the resort 2 times requesting for a CASCADE villa for my stay from 7/16 to 7/23. When we got the villa, I was a little shock, but not satisfy. On the first night, just when I wanted to get into bed, we've realized theres a blood stained on the bed sheet, and afterwards, we spotted some blood stains on the floor. It was really disgusting. I think it was quite dirty, and then, the cover for the bed had holes. It was DISGUSTING. Overall, the ROOM was dirty, even though the room was \"new\". When they came to our room on the 3rd day to clean our room, they didn't even change the sheets!! The villa only had 2 remote controls for 3 TVs. The set up for the smaller room was bad, I didn't like it, at all.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "July 29, 2004", "id": 2329903}, {"rating": 4.0, "title": "Very pleasantly surprised", "text": "HOWEVER, the resort itself, wasn't too bad. They had everything that we wanted, (swimming pool, sauana, and steam room). The kitchen was very convenient. There's a supermarket (Winn Dixie), if you travel on the 535W for about 5 minutes. Don't go to the supermarkets around the resort, because they charge MORE. Same with the gas stations as well. You guys should definately try out Bahamas Breeze, because it's a great restaurant. Great service + Great food + Great price! The location of the resort isn't too bad. However, it does seem very crowded. The resort only allows dial up services.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "July 27, 2004", "id": 2325262}, {"rating": 5.0, "title": "Family Loved Every Day !!!", "text": "I almost cancelled this resort after reading some of the reports on this site! However our travel agent assured me they'd never had a problem and they'd request the \"new\" Cascades section for me. I also sent 2 e-mails direct to the hotel requesting this.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 26, 2004", "id": 2322366}, {"rating": 5.0, "title": "Very Satisfied", "text": "On arrival we were allocated the “PALMS” section way off in a corner which the receptionist admitted was an older section. Eventually she called someone and requested we be moved and they called back to say there was nothing in Cascades but they could move us to Fountains.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 25, 2004", "id": 2321153}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 164, "average": 275, "very good": 943, "terrible": 102, "excellent": 1431}, "aka": "Sheraton Vistana Resort", "slim_ranking": 0.118541033435, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Each villa features Sheraton amenities and special touches, like bathrooms with whirlpool tubs and screened-in patios or balconies. Close to theme parks, exceptional golf and world-famous beaches"}