{"user_rating": 4.0, "review_count": 571, "name": "Sheraton Brooklyn New York Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I travel to Brooklyn a lot, and I keep coming back to the Sheraton because (1) the rooms are extraordinarily clean and comfortable with undoubtedly the best bed in the industry; (2) the hotel is so conveniently located with incredible ease to get to anywhere in Manhattan or Brooklyn; (3) the entire staff is remarkably friendly and accommodating; and (4) the hotel amenities -- most notably the bar and restaurant -- are outstanding.", "title": "A Gem Grows in Brooklyn", "helpfulness": 1, "user": "wingding718", "date": "October 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 142947856}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Whether you're a business traveler, family touring NYC, or young college kid hanging around in this really bustling and fun part of Brooklyn, this hotel will be a perfect and affordable choice. It's not perfect by any means, but I have never ever had any issue whatsoever the very attentive staff didn't try to rectify. You might read some reviews about a 12-hour hot water outage, but hotel management placed memos in each room updating us on the situation, and was more than accommodating in terms of making alternative arrangements available (next door at their sister property). While it was a minor inconvenience, things like this will happen from time to time, but I'm going to keep returning to this hotel regardless. Sure, the elevators can be a bit slow during high peak hours (maybe once per week on a Monday night or Friday morning when people with lots of bags are coming/going), but I've yet to stay in a cleaner, friendlier, and more hospitable hotel. As for other nuisances like magnetic card keys being unpredictable or some construction noise around the block, I've come to expect that downtown Brooklyn isn't going to be crickets-chirping-at-night type of quiet, and truly appreciate this hotel for what it is -- a downright nice and clean place with an extraordinary staff. Don't miss the bar/restaurant on the lobby level (called Grubstake), because it's one of the best hotel bars I've ever been to, with a great menu, amazing and friendly staff, and pleasant vibe and atmosphere.", "title": "Check-in and service issues, plus no hot water", "user": "000mc000", "date": "October 14, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 142789159}, {"rating": 1.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "One last thing -- the people and service in this hotel are what make it memorable and pleasant, and they're the reason I think this hotel is a place worth recommending to everyone. There are so many people in this hotel who are truly there to make your stay more comfortable, and would do whatever they can to keep you happy. Marie runs an outstanding team, and I'd give a special shout-out to Damien and Stephanie at the front desk (with lots of help from Chris, Fred, and Nigel); Dinah and Charlotte at the bar; and Wanda in the Club Room. There are loads of other people behind the scenes who are true professionals at what they do (like Amando, Sergio, Rasheeda) and whenever my travels take me to NYC, I wouldn't even consider staying elsewhere.", "title": "Shameless and Dishonest Sheraton Brooklyn Hotel", "helpfulness": 4, "user": "TripDocror", "date": "October 12, 2012", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 142641350}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "I had booked this hotel 5 months ago as part of a special weekend break in Brooklyn with my partner. Given some previous posts about problems of rooms being overbooked / not available, my partner made special efforts to contact the hotel to advise them of late check-in to ensure we would have no problem. We even had an email from the hotel manager to reassure us that our king double room would be available for us. When we arrived at around 12 midnight tired from JFK, we were told that there were no king doubles for us. They did not offer a convincing explanation of why this was. When we mentioned the lengths we had gone to ensure smooth check-in the receptionist eventually offered us what she appeared to suggest was an upgrade to a king double with terrace. We viewed the room and found that the one bed was in fact a small double (or a single as they described it at the hotel) and given the cold weather, a terrace was no benefit. Only when we complained further did the duty manager offer us an upgrade to a suite with 2 \"singles\", with free access to club lounge and breakfasts. We found this to be good compensation but we felt that they should have offered this to us first without trying persuading us, we felt misleadingly, to take an inferior room instead.", "title": "Great Bed", "user": "Katharine H", "date": "October 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 142508880}, {"rating": 2.0, "stay_parameters": "Stayed October 2012", "text": "The hotel also had no hot water for over 24 hours due, apparently, to damage caused through routine maintenance. Although management put a letter under our door notifying us of the problem, there was no attempt to offer an alternative solution or some sort of discount. We managed to negotiate a free late checkout and again we were satisfied with this.", "title": "No hot water or elevator!", "user": "Nicole1025", "date": "October 7, 2012", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 142209883}, {"rating": 3.0, "stay_parameters": "Stayed September 2012", "text": "We have stayed 6 nights in this hotel. I am a SPG Gold member and really disappointed with the experience in this hotel.", "title": "First time and never", "user": "TVBA", "date": "October 6, 2012", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 142108134}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "No basic stuffs doe the over$300 per night hotel : There is no fridge in the room.", "title": "Lovely service", "helpfulness": 1, "user": "morgan32707", "date": "October 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 141929225}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Most incompetent house keeping standard: the blanket remains unfolded on the chair. I took the picture and showed to the duty manager - Stephanie who said will talk to the house keeping. However the next day same thing happened. Can't be bother to talk to the front desk again since they were too busy to handle other complaints almost everyday. The dirty cups and plates were not removed from the room. This makes me wonder i have to leave tips in order to have the basic house keeping services from this hotel.", "title": "Location OK", "user": "Vaca2", "date": "October 2, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 141864800}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Front desk staff:", "title": "Are You Serious Sheraton?", "user": "BabyButta", "date": "October 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 141855934}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "They are nice but they need more training for the local knowledge. We asked a few transportation questions they don't seem to know much and not bother to have further check.", "title": "A pleasant surprise!", "user": "Linda S", "date": "September 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 141362717}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Stayed two nights with my wife and kids and it was an excellent hotel. A little hard to find if driving by car but it is close to subway lines and you can be in midtown pretty quickly. Staff was amazing from start to finish. While the rooms are a little small I chalked this up to being in the city. I would definitely return!", "title": "Great Hotel!", "user": "SuprDadOf4", "date": "October 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143572702}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "I have stayed here many of times and needless to say, I never experienced such nonsense. Upon check in my bestfriend and I were told that we would be charged for incidental fees (held until departure) which was no problem however, they never had a room available for us. We waited for about 45 minutes for one to be avilable and the current time was 4pm...Moving forward, EVERYDAY were were charged 150.00 for incidental fees which was only supposed to be held once and released during departure. So every morning I was looking into my account and surly enouch I was charged. The 5 days we were there was like dejavu. Wake up, look at account that's been charged, talk to manager. We were told that it would stop daily. IT DIDNT! they said it was a glich was in the system. I cancled my card, thats the only way it stopped.", "title": "Kept Charging Credit Card", "helpfulness": 1, "user": "MissFrequentFlyer", "date": "October 23, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 143551778}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "This is one of the cleanest, most comfortable and friendly hotels I have ever stayed in Although it is not in central New York, it takes no longer than 10 minutes on the Subway to reach downtown Manhatten. The bes was amazing, HUGE and so comfortable. The shower was also a generous size. Room very well equipped. The staff were very friendly and knowledgeable. I asked for travel information on a number of occasions and they were more than happy to find details for me.", "title": "Fab Hotel", "helpfulness": 1, "user": "Rainy130", "date": "October 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 143469012}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "The restaurant is a bit on the pricey side, but most hotels are. There are many places nearby offering good quality food, and after all this is New York, so eating out should be part of the experience.", "title": "Get what you pay for!", "helpfulness": 1, "user": "ajlcdl", "date": "October 22, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 143453703}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "I would use this hotel again without hesitation.", "title": "Problem night, not the norm.", "user": "IrvineTraveler71", "date": "October 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 143452275}, {"rating": 4.0, "title": "Good location for visiting Brooklyn", "text": "Stayed here just after Hurricane Sandy, and the hotel was dealing with lots of people looking for last minute rooms and a very hectic atmosphere. The front desk staff was just great in handling everything. I needed to extend my stay by one day, which I did through the Sheraton 800 number, who provided excellent service, and the change of plans (I ended up with two separate reservations - my original and a second for one extra day) was handled extremely well by the front desk as well. The hotel is in \"downtown\" Brooklyn, close to several subway lines, and an easy walk of a mile or so to many Brooklyn neighborhoods. The rooms are very nice and large for New York hotels. I had a couple of small service glitches, just minor things that didn't mar the visit but if done better would make the hotel great. Here's the list:", "user": "dkmr", "date": "November 5, 2012", "id": 144542960}, {"rating": 2.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "1. The in room safe in my room didn't work;", "title": "It's definitely NOT four stars!", "helpfulness": 1, "user": "3606", "date": "October 30, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 144113783}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "2. I \"ordered\" a continental breakfast by phone using the menu on the door card -- about 10 minutes later I got a call from room service that the continental breakfast was only available if ordered overnight with the door card, so I had to switch my order to 3 a la care items (coffee, juice and bakery basket) from the \"regular\" room service menu. Not only did this cost more, but it wasted some of my time. Two comments on this -- if that's really the system, the person taking my order should have known this and not accepted my order in the first place. Second, I have NEVER encountered a hotel where the items listed on the overnight door card were not also available by phone through room service. This is just weird.", "title": "NYC best and finest", "user": "opinion_teller", "date": "October 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144041841}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "3. I had a very early wake up call scheduled, but I actually woke up earlier than the call, so I called the desk and asked them to cancel my wake up call. They said they would, but 15 minutes later I got the wake up call anyway, while I was in the shower. I couldn't make it to the phone in time to answer, so I got a second call five minutes later while I was still in the bathroom. Both times, I rushed to get to the phone for a wake up call that should have already been cancelled.", "title": "Overall good but beware of slow elevators", "user": "Vacationbound22", "date": "October 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 143944747}, {"rating": 1.0, "title": "Doesn't quite understand what the word \"guarantee\" means", "text": "All three of the above were minor glitches, but they should not have happened.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "October 24, 2012", "id": 143629071}], "location": {"country": "United States", "city": "Brooklyn"}, "stars": 4, "variance": {"poor": 25, "average": 120, "very good": 255, "terrible": 31, "excellent": 140}, "slim_ranking": 0.36170212766, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 3.5}, "description": "Sheraton Brooklyn New York Hotel, the area's newest full-service hotel, is 1 MTA stop from Manhattan near MetroTech Ctr, Bklyn Heights, and BAM. We have 4,300sq ft of meeting space and a rooftop deck."}