{"user_rating": 4.5, "review_count": 537, "name": "Sheraton Salzburg", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed September 2005", "text": "We stayed at the Sheraton in September 200, just after the summer rush was over. Perfect time to visit Austria by the way, half the crowds...which makes for better for sightseeing, eating out and overall a more pleasant enjoyment. Too many people = too much stress in crowds. Anyway back on the hotel. Very clean, pleasant front desk, helpful with directions. Didn't really eat there much, as we wanted to sample the local cuisine.", "title": "It was ok....Clean, Roomy, good location not moldy or musty smelling", "user": "liselo", "date": "January 20, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 4365572}, {"rating": 4.0, "stay_parameters": "Stayed January 2006, traveled on business", "text": "Our room....very outdated in colors, but nice and clean. The bed was a King, which I mean American King, not an English King size which is equivalent to an American queen sized bed. Pillows were nice, only one per person.....didn't bother asking for more. The bed was not too soft nor hard. The bathroom served it's purpose, water from the shower leaked all over the floor, but we just left our used towels everyday in the flooded corner of the bath. Not a problem really, as we were only there to shower in the morning.", "title": "Near to excellence", "user": "JanBerlin", "date": "January 16, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4356634}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "Would I recommend this hotel? Yes, if you were smart and got a good deal on expedia with air tickets included. We couldn't pass up the offer. I would recommend asking for a room overlooking the park if room view matters to you. The front of the building is overlooking more buildings, but this wasn't an issue for us because we were out all day, every day!", "title": "Excellent Business Style Hotel", "user": "Offseason", "date": "December 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4301608}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "Great location - very comfortable facilities - excellent food - nice bar - friendly staff - this hotel is one of the best Sheratons I have stayed at. Has all the comforts with a European flair. We rented two rooms for two nights - and it was the best hotel of our two week trip through Austria and Bavaria. No hesitation to recommend it - and wil stay there again next time in Salzburg.", "title": "A delight", "user": "TheCats", "date": "June 30, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3622503}, {"rating": 5.0, "stay_parameters": "Stayed December 2004", "text": "We have stayed at the Sheraton Salzburg twice now and really enjoy the hotel and staff! As Americans, we do not have to worry about the language barrier while staying there. The hotel is beautifully decorated and the rooms are quite nice with even terry cloth robes! I found that the walk from Olde Town Salzburg to be about 10-15 min but we are always visiting with the antique shops and retail stores along the way! I highly recommend this hotel to all and I am looking forward to our next visit!", "title": "Great Hotel for visiting Salzburg", "user": "wc1208", "date": "June 22, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3604076}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "Lovely rooms with everything you'd need, except in -house movies at the time I was there, because of new tax rules. Very good service/staff. Well located. Good breakfast. Recommended.", "title": "Recommended", "user": "blimyslimy", "date": "December 15, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4244187}, {"rating": 4.0, "title": "Good experience, but some refinements to customer satisfaction needed", "text": "A lovely hotel, with excellent staff and amenities. Be aware that any and all extras are charged for - parking in the hotel car-park for guests, at E15 per night; fresh milk in the room for the hospitality tray coffee machine - E5.20 including room service charge. Room service breakfast was charged at the full rate of E22, plus room service charge, although I had actually ordered from the a la carte menu. I had obviously not made it clear that I was ordering a la carte, however it wasn't picked up on and the benefit of the lower amalgamated price offered. It would have been nice to have been made aware of the car parking charge, or the fact that it wasn't either free or discounted, before we had driven in. Likewise, in a hotel of this quality, I would expect, and am used to, fresh milk in the room fridge.", "user": "aurora1962", "date": "December 12, 2005", "id": 4232805}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "This hotel is located in the newer part of the city next to the gardens. To get into the hart of the action you will have to walk across the river to the old town. Weather permitting; this is a pleasant 15 minutes walk. Take it in account while sampling local beer. There are no restraints or breweries close to the hotel. Hotel breakfast is very nice and very expensive, 22 euros. Parking is 17 euros. The hotel rooms are very large by European standards and are very well decorated. The bathroom is large and has a separate shower. The staff is very attentive. Most of the guest in the hotel were locals and business travelers; very few American tourists. Wireless Internet is available for a fee. Two free computers are in the lobby", "title": "Expensive extras", "user": "Gene_Augusta", "date": "November 3, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 4084666}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "I stayed at the Sheraton for 2 nights through the Starwood Cash & Points promotion at $60 USD/night. The taxi fare from the airport was about 15 EUR with tips.", "title": "Excellent hotel", "user": "Braindrain", "date": "July 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3674514}, {"rating": 4.0, "title": "Internet Use Policy Needs Review", "text": "The Sheraton is right beside the Salzburg convention centre and is in quiet part of town. Not a lot of restaurants or shopping around there, but it is right beside Schloss Mirabell. One recommendation of a great cafe nearby is Fingerlos.", "user": "Grampa2191", "date": "July 13, 2005", "id": 3663795}], "location": {"country": "Austria", "region": "Austrian Alps", "continent": "Europe", "city": "Salzburg"}, "stars": 5, "variance": {"poor": 12, "average": 31, "very good": 158, "terrible": 3, "excellent": 333}, "aka": "Sheraton Salzburg Hotel Salzburg", "slim_ranking": 0.0507246376812, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}