{"user_rating": 4.0, "review_count": 1007, "name": "Sheraton Park Hotel at the Anaheim Resort", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Just stayed at Sheraton Park in the middle of January for a week. Took the advice of others on here and asked for a room facing Disneyland so they kids could watch the fireworks from the hotel room instead of staying out so late (my kids are little). They charge $30 extra per night for a room facing Disney, which I thought was a bit excessive.", "title": "Just Ok", "helpfulness": 2, "user": "grantdude", "date": "January 22, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 150292163}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "The lady at the front desk when I checked in had a bit of an attitude, but that was the only person I ran into with an attitude. Everyone else, the maid, the guest service desk folks, the bellman, were all very nice.", "title": "Outstanding staff made our stay", "helpfulness": 3, "user": "No_Fixed_Address", "date": "January 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 150218503}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The hotel itself could use a reno. It looks like they haven't done any renos for 20 years. Nothing is dirty per se, but everything looked old.", "title": "Good location, great restaurants", "helpfulness": 3, "user": "CR54_12", "date": "January 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 149772933}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Molly's serves a pretty decent breakfast and the BBQ place (can't remember the name now) has a pretty good dinner menu. We got there during some sort of promotion and we got a $200 gift card to spend at restaurants, which was nice. It pretty much offset the extra I paid for a Disneyland facing room.", "title": "Good hotel with some snags", "helpfulness": 1, "user": "Regina D", "date": "January 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149737359}, {"rating": 3.0, "stay_parameters": "Stayed January 2013", "text": "The location of the hotel is just terrific. Yes, there are other hotels closer to Disneyland, but they're either icky looking inns across the street or very expensive Disneyland hotels. This is a pretty good compromise I think, considering the distance to Disneyland, the star level, and the price.", "title": "The quality of the staff is awsome.", "user": "sjcannon63", "date": "January 15, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 149735390}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "All rooms with king beds have connecting doors that are very thin/let the noise through so unless your kids are in the adjoining room, don't get a king. We had to move after the first night because of the noise. Staff very accommodating. Breakfast restaurant on site is very good. Extra for Internet but they have some terminal in the lobby.", "title": "Solid accommodation 7-10 minute walk to Disneyland", "helpfulness": 1, "user": "kristine61", "date": "February 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 152668213}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "The hotel is very nice & rooms are comfortable. The bathroom is fine & the beds are very comfortable. My three pet peeves about the hotel however were the small sink & counter area, the fact that they have not yet joined the real world and started offering free wifi at their hotel and the fitness center. The wifi is $10/day for one connection. Jump on board with most other hotels and offer wifi. The fitness center was very nice & the equipment was new but there was a long wait for any cardio equipment in the morning. 3 treadmills are not enough when it's a hotel frequented by business travelers.", "title": "Good Stay, what I would expect from Sheraton", "helpfulness": 1, "user": "Milwgirl24", "date": "February 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 152631326}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Stayed at the Sheraton at the end of January for a few nights. The staff was helpful and friendly, they gave us a room upgrade to a room overlooking the pool. Easy walk to Disney and the many restaurants in the neighborhood. Excellent stay.", "title": "Fantastic place to stay", "helpfulness": 1, "user": "scottbot", "date": "February 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152453420}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "beautiful site. complimentary water, fridge and safe. comfortable bedding. We stayed there because it was the host of a conference. beautiful grounds. Unfortunately, I got ill and the hotel management was terrific. Offered to get a doctor to which I declined, but the housekeeping came and cleaned my room while I slept. I can't say enough. good food within walking distance although I did not partake because of illness. Quiet, quiet, quiet.", "title": "nice touches", "helpfulness": 3, "user": "Seggie1958", "date": "February 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151739518}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "I flew in from Texas for a conference at this hotel and while travel was quite complicated because of delays and other issues I was thoroughly pleased with the service I received here. Every member of the staff I came into contact with was amazing! My breakfast room service server was the same every day and was quite nice and helpful, even giving me detailed directions on my last morning there to avoid an accident I'd seen on the news.", "title": "Conference Location", "user": "Kari P", "date": "February 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 151486511}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "We were staying in Anaheim for the Craft and Hobby Tradefair (CHA). We needed to be close to the convention center. I had lots of friends staying at The Marriott right next to the Center, but it was a little more expensive, so we decided to stay at The Sheraton.", "title": "Great Stay", "helpfulness": 1, "user": "Funkyfairies", "date": "February 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 151441100}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "We loved our room when we arrived. It was on the 8th floor and over looked the pool. The room was so big (We had a king room). We did have a problem though in that the room was very hot. It was 76F and we couldn't reduce the temp.", "title": "Great place to stay", "helpfulness": 1, "user": "alegriafury", "date": "February 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151356776}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "We called someone as we thought there was a fault. As it turns out the hotel either has the air con or he heating on. You can't have the choice and as the temp had dipped outside there was no air con available. (we were told it was due to the age on the hotel)", "title": "Large, comfortable room", "helpfulness": 2, "user": "aimbame79", "date": "February 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 151176719}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We were really unhappy with this as the room was baking. The solution we were given was to leave the balcony door open. Fine during the day if we were in but we weren't happy about this at night.", "title": "Convenient location & good night view of Disneyland", "helpfulness": 1, "user": "yvrmimi", "date": "January 27, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 150792432}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "The manage on duty was pleasant and offered us free parking whilst we were there. Saving $16 a day. We did think about staying somewhere else though for the other 4 nights.", "title": "Near Disney & Right Next to Convention", "helpfulness": 1, "user": "wow445", "date": "January 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 150370967}, {"rating": 2.0, "title": "A REAL Dissapointment", "text": "**Giving this hotel is 2* rating is being very generous.**", "user": "PatrickErvin", "date": "July 17, 2007", "id": 8139205}, {"rating": 3.0, "title": "Nice Stay", "text": "My wife and I booked our room a few days in advance, and being a Starwoods member, I though I got a good rate and was lucky to book without much lead time.", "user": "missdanib", "date": "July 2, 2007", "id": 8041418}, {"rating": 4.0, "title": "Top-Notch Service, but...", "text": "Unfortunately, the hotel's website states that check-in is 3:00pm. This seems to not be the case since we tried to check in, and rooms were not ready. So, we waited until 4pm, then 4:30, and finally were given room # 1113, which apparently is a Starwoods Preferred Floor. JOKE #1. The room is really the smallest I've ever stayed in, and having stayed in 13 Starwoods hotels in the last 12 months, this says alot.", "user": "Gomershad", "date": "June 30, 2007", "id": 8029373}, {"rating": 5.0, "title": "Good experience", "text": "The bathroom is seriously the smallest bathroom with the smallest tub I've ever seen.", "user": "bobnu75", "date": "June 25, 2007", "id": 7988055}, {"rating": 5.0, "title": "Loved our stay at the Sheraton Park", "text": "The beds (yes, 2 doubles instead of the king I requested)...were in good condition, but not like Westin Heavenly beds...just Sheraton look-a-likes.", "user": "spreadsheetqueen", "date": "June 18, 2007", "id": 7926942}, {"rating": 4.0, "title": "Recently renovated Sheraton-Nice", "text": "Very very very very comfortable beds! I got a room with a balcony where I could watch the Disneyland fireworks at night, other than that, there was no view to speak of (from the 2nd floor). The pool looked nice and had a tasty frozen adult beverage menu. If your not a kid or with kids, Downtown Disney is still fun and exiciting, restaurants and shops.", "user": "pamela c", "date": "June 12, 2007", "id": 7841710}, {"rating": 5.0, "title": "Loved this hotel!", "text": "The hotel was full of kids and most were well behaved. Get's kind of noisy in the morning when all the kiddies are running down the hall draggin mom and dad to breakfast before trying to be first into Disneyland. (can you believe people are waiting 4, fOUR, hours to ride the Nemo Adventure!!!!!!)", "user": "RJPerrelli", "date": "June 9, 2007", "id": 7808760}, {"rating": 3.0, "title": "Your average Sheraton", "text": "Housekeeping Kind of stingy with towels. Room was very clean.", "user": "jamwilson", "date": "May 28, 2007", "id": 7709342}, {"rating": 2.0, "title": "Amazingly small rooms!", "text": "Vanity has Pantene and Vaseline ameneties.", "user": "Lisa_J0nes", "date": "May 27, 2007", "id": 7702515}, {"rating": 5.0, "title": "Great Hotel!", "text": "Very limited room service menu. There's a cafe (AM to 3pm)and a BBQ restaurant (5pm to ?PM) on site. Walking distance to several nearby restaurants.", "user": "sferg67", "date": "May 14, 2007", "id": 7614948}, {"rating": 5.0, "title": "We loved the Sheraton Park", "text": "We were very pleased with the Sheraton Park. The check-in clerk was great and recommended a room which gave us a view of the Disneyland fireworks. She recommended that we avoid the shuttle and just walk, which we should have done. Don't drive from there - it took us forever to get in the parking lot and get parked, then we still had to take a shuttle.", "user": "GinOaklandCA", "date": "September 16, 2007", "id": 8725956}, {"rating": 3.0, "title": "Clean, Convenient, and Dog Friendly", "text": "The room was very nice and comfortable. The grounds are lovely and we really enjoyed the heated pool both nights.", "user": "LA_Neener", "date": "September 7, 2007", "id": 8671802}, {"rating": 3.0, "title": "Good for Disneyland", "text": "I would definitely stay there again.", "user": "Carolind", "date": "September 3, 2007", "id": 8610352}, {"rating": 5.0, "title": "comfortable and clean, great location", "text": "We stayed at Sheraton Park for the Walt Disneyland Half Marathon over Labor Day Weekend. The rooms are clean, the beds and bedding are comfortable, and the staff was incredibly friendly and helpful. If you are going to Anaheim for the convention center, this location is perfect! If you are going to be walking to the parks or Downtown Disney it is about 10 minutes at a comfortable pace. The elevators were slow, but the hotel was busy and I wasn't in a rush to get anywhere. The pool area is very nice. If you are traveling with your dog, they will provide you with a special dog bed and food dish - make sure you request it with your reservation. There is no initial charge - but they do a room inspection after you leave and will charge you for any damage. The $14/day for parking seems a bit steep, but it is a resort area and parking is at a premium. Remember where you are and just be prepared. One great aspect - request a room facing the parks - free fireworks show at night and it is fun to sit on the patio and watch! Also, the club lounge service was great. The lounge was nice to hang out in during the evening happy hour. I would recommend this hotel. . .if I was coming in for a convention, I would most likely stay here again.", "user": "vlammetje", "date": "August 30, 2007", "id": 8579875}, {"rating": 5.0, "title": "Really pleasant Hotel-Great Rates", "text": "We stayed at this hotel for three nights purely to visit Disneyland. The one thing that bothered me is that this hotel advertises that it is across the road from Disneyland when in fact it is at least a 15 minute walk down the road with plenty of other hotels in between. The do offer a shuttle (i thought was free) but was something like $6 for a return ticket.", "user": "SouthDakotaDR", "date": "August 23, 2007", "id": 8490192}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "I stayed with my boyfriend over the weekend of 2/22-24. We asked for a room facing Disneyland and we got what we requested plus more. They had placed us up on a very high floor with a huge balcony. The room was huge- we had a king sized bed and 3 roll-away’s could have easily fit into the room. The toilet and shower area were separate from the sink area- which I always like. Everything was just clean and beautiful. The only concern was that the room connected 2 ways. The rooms were locked off from each other by no more than a little latch. It was kind of concerning at first but not enough to ruin the trip. Check in was quick. The service at Molly’s Diner was sub-par. We were semi-dehydrated and didn’t want any sugary drinks before our day at the park so we asked for just 2 ice waters and the waiter snatched our juice and coffee cups away and then took forever to bring the water, take our order, and give the bill. Other than that, everything was great. Would love to stay there again.", "title": "Couldn't have been better!!", "helpfulness": 3, "user": "shellysan82", "date": "February 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13942863, "likes": {"liked": "— the beds!", "disliked": "— doors to the connecting rooms and the locks on those doors"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "PS- If you get a room with a balcony facing the park, the view of the fireworks is fantastic!", "title": "Disapointing whatt????", "helpfulness": 3, "user": "mex25", "date": "February 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 13923369, "likes": {"liked": "— The room ,the location and above all the awsome Sheridian staff", "disliked": "— Cant think of anything -no fiascos or hassles"}}, {"rating": 1.0, "title": "Disappointing", "text": "From check in at 11:00 pm to check out on Sunday morning at 11:00am this property didnt let me down.The staff from front desk to all the bell hops did their utmost in exceeding my expectations of just how a Sheridian property treats their guests.", "helpfulness": 1, "user": "mtnpastor", "date": "February 20, 2008", "id": 13720494}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Our room was ready upon check in and housekeeping never dropped the ball -never ever had to ask for extra towels or anything else for that matter.The room had a great view of Cal-adventure as well as it being quiet along with the sweet sleeper bed delivered a great night's sleep.", "title": "Pretty Good", "helpfulness": 6, "user": "AZEgan", "date": "February 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 13318173}, {"rating": 4.0, "title": "Comfortable and Convenient", "text": "The ART shuttle was really convient as your the first stop back from Disneyland when returning to the hotel.", "helpfulness": 8, "user": "AmberBock", "date": "January 31, 2008", "id": 13151585}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "This hotel is a great place to stay while visiting Disneyland. The room was spacious, nicely decorated with a comfortable king size bed. The balcony overlooked the pool but I would suggest a Disneyland Park view so you can see the fireworks at night. I only stayed the one night and didn't use any of the hotel facilities but it was a perfectly fine place to stay. The self-park fee was $14 a night. The only problem I had was the thin walls in the room - I could hear a tv on one side and a conversation almost perfectly on the other side. The issue was solved by putting on a pair of Bose sound reduction headphones.", "title": "Great stay while visiting Disneyland", "helpfulness": 6, "user": "Maureen_Vancouver", "date": "December 23, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 11918745, "likes": {"liked": "— Extremely comfortable bed, clean and spacious room, close proximity to Disneyland", "disliked": "— The walls were thin and I could hear the neighbors' noise on both sides late at night."}}, {"rating": 4.0, "stay_parameters": "Stayed January 2006, traveled with friends", "text": "Disneyland is a quick 10-15 minute walk. There is a Dennys, IHOP, steakhouse and other family restaurants all in walking distance of the hotel. Checking in and out were a breeze. The invoice was at the door in the morning and all I had to do was hand in the room key. I would recommend this hotel to couples, singles and families who are visiting Disney.", "title": "Sheraton is Great!", "helpfulness": 4, "user": "princesscel", "date": "December 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 11911796, "likes": {"liked": "— The beds"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We stayed at the Sheraton hotel because it was directly across the parking structure at the Disneyland Resort. You literally drive out and you are in the entrance to the parking lot to Disneyland. The service is amazing, we have usually been upgraded rooms several times. The beds are the most comfortable beds you will ever sleep on. The only thing we didn't enjoy was how big the property is, if you get a room towards the back you will be walking a long ways. All in all we love this hotel and we enjoy staying there.", "title": "A very pleasant stay", "helpfulness": 4, "user": "ZonaTraveler", "date": "December 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 11569884, "likes": {"liked": "— Friendly service", "disliked": "— Parking fee"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We thought our room was beautiful, plenty big for 4, Service was great! Desk clerk very friendly and helpful. Pool side beverage and food service was excellent. We never heard noises. Everything was clean. Beds were comfortable. Decor was also nice.", "title": "Fantastic Hotel, Fantastic Service", "helpfulness": 5, "user": "OZZYJT", "date": "December 1, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11176966, "likes": {"liked": "— The beds", "disliked": "— nothing"}}, {"rating": 5.0, "title": "Amazing Hotel", "text": "We went to Anaheim for a dance competition. I had been two previous years with just my daughter, but this time my son and husband joined us. My husband wanted a full service hotel rather than a motel. We choose this one because we could get a discount rate with our Starwood preferred points.", "helpfulness": 5, "user": "Disneylandenthusiast", "date": "November 25, 2007", "id": 11061383}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We stayed on the club level, which has a nice evening cocktail hour and continental breakfast in the mornings. The rooms and public areas have recently been redone and look great. AT&T wifi in room was crap. I called the tech desk once and the hotel operator twice. They said they were having high usage issues. Ridiculous excuse for AT&T to make when the hotel was in off season and fairly low occupancy. The front desk told me to use the Link computer area and that worked fine. Here's my pet peeve. No complimentary shuttle like many of the local motels and hotels offer, including the Sheraton Anaheim or the Candy Cane Inn a block closer to Disneyland. Yes it may only be a 15 minute walk to Disney, but if its late and cold, then a shuttle would be great and paying $5/person for the pay shuttle is a rip off. So we walked each day and night. Parking charge was $16. For the shuttle alone I would stay elsewhere next time I was in Anaheim. Yes it's a Sheraton and for those who want their hotel points it works. It's also cheaper than Disney Hotels which are completely overpriced. BUT, there is plenty of surrounding competition, even closer to the parks, so anyone who does a little research should be able to find a good fit for their needs.", "title": "Offer complimentary shuttle service.", "helpfulness": 4, "user": "PDXStocks", "date": "January 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 149691129}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "First, the hotel staff was irritated with us that we had booked through another website; thought these guys worked together. Then there's the high cost of $13.99 per person for the breakfast buffet; $9.95 per day for internet and $14.00 per day per car for parking. Even though the hotel did agree to waive our parking, they charged my son $54.00 the day we left; they won't refund it because he had to put cash into the machine for the arm to lift, and even though we have the receipt, to them, he can't \"PROVE\" he paid it. Gimme a break. The rooms were clean, comfy and nice.. The best part, as it turned out, was the free shuttle back and forth to Disneyland because our grandkids started getting sick the first night we were there, and wiped out my poor daughter in law as it spread from one child to the next, and their parents had to take turns going back and forth with kids who were up to going to D'land, and those that needed to be in the room.We had to extend our stay an additional night to give all of us a chance to regroup with the coughing, fevers, runny noses, etc. As this was our kids and grandies first trip to D'land, we did get to catch some magical moments with them, and that was the most important, special part of the whole trip. It was a Christmas surprise, and D'land lived up to it!", "title": "Pricey, some hidden costs", "helpfulness": 1, "user": "pansypoo", "date": "January 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 149602251}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "Stayed here over new year with our large family of 7. Had interconnecting rooms. Rooms were lovely. Service was great. Disneyland desk was very helpful. Enjoyed the early morning walk each day to Disney. Only 10 -15 mins. Subway open 24/7 and on the way . Also a 7/11 and other convenience store. Ate in the overland restaurant using our voucher. Food was very good. Was a little quiet but we make our own noise. Great place.", "title": "Fabulous. Would definitely re- visit.", "helpfulness": 1, "user": "Hockrow", "date": "January 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 149514125}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Lovely decorated hotel had room available w/out reservation. Reservation desk personnel accommodated us with a handicap room & we were able to walk across street to convention center. Many walking-distance food establishments outside hotel & hotel does offers shuttle services. Employees were quick to respond to request for xtra toiletry items. Rooms have coffeemaker/refrigerator & room service menu. Hotel validates parking. Disneyland is walking distance; nice pool/fitness room w/beautiful tropical plants/palm trees surrounding the hotel grounds. Bedding: Great-quality linens (duvet cover), fresh/clean with more than one bed pillow! Avoid room near elevator/ice machine. You can hear people in hallway when in your room. I did not eat breakfast here although I was able to grab something to-go from a food/soda shop inside hotel.", "title": "Anaheim Convention Center Accessible for Handicap Individuals", "user": "SC6333_1055", "date": "January 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 149045094}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "I stayed here one quick night. The common spaces were nice and clean. Check-in was very quick and uneventful. The amenities of the hotel were not explained - I assume because I checked in late and was staying for a single night. The person working the front desk was efficient but it was obvious he didn't want to be there.", "title": "Fine hotel for a quick stay", "helpfulness": 1, "user": "TXN60613", "date": "January 6, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 149019125}, {"rating": 5.0, "title": "great pool area!", "text": "Me and my family dont live too far away from disneyland so we decided we wanted a hotel with a nice pool to relax in, not having one at home. This hotel's pool area was EXCELLENT!!! Not only was the pool 10 feet deep at the deepest( which was great for my 6 foot hubby!) but it also had a pool bar with servers coming around very often to meet your food and beverage needs and relaxing music to relax you as much as their jacuzzi does. The cleanliness of the pool area was also great. The rooms were also clean and excellent. The beds, like most have said, are very comfortable and we ordered room service and were pleasantly surprised with the quality AND quantity of the food. We slept perfectly at night with no outside noise and the staff was great. Basically, I recommend this hotel to anyone. If you're staying to visit disneyland, it's close enough to walk to or they have a transit system stop right outside the hotel. If you're just in town for whatever, the hotel is also great for sleeping and relaxing by the pool.", "user": "csandoval", "date": "August 14, 2007", "id": 8421133}, {"rating": 4.0, "title": "Nice Family Place", "text": "We just returned from a 5 day stay in Anaheim. We booked our travel through Alaska Airlines and chose the Sheraton because it was the only \"close to Disney\" hotel available at the time. It turned out to be a fabulous stay!", "user": "bballmom_7", "date": "August 9, 2007", "id": 8381047}, {"rating": 4.0, "title": "Perfect For Us", "text": "We arrived at 12:30pm and were able to check in immediately. Jeff at the front desk was very friendly.", "user": "meeg", "date": "July 31, 2007", "id": 8267578}, {"rating": 4.0, "title": "Great stay at the Sheraton Park", "text": "We had an 11th floor room with a balcony that overlooked the parks (CA Adventure and Disneyland). The view of the nightly fireworks was amazing. We actually thought it was better than at the park! The only downside was that you couldn't hear the music.", "user": "mrsdisney", "date": "July 31, 2007", "id": 8265494}, {"rating": 4.0, "title": "Clean, small rooms.", "text": "The beds were nice and the complimentary bottles of water were a nice touch. Toiletries included Pantene shampoo/conditioner, Vaseline Intensive Care lotion, Scope mouthwash, and Dove soap. All were replenished daily.", "user": "jreuscher", "date": "July 20, 2007", "id": 8208009}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "My boyfriend and I stayed at the Sheraton Park for a week over the holidays. I spent a lot of time narrowing down which hotel to stay at, and I am glad I chose the Sheraton Park.", "title": "Loved the Sheraton!", "helpfulness": 6, "user": "TorontoTravelgirl77", "date": "January 22, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 12882507, "likes": {"liked": "— The Disney view & comfy bed!!!", "disliked": "— The parking rate & slow elevators."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The hotel is just a 10/15 min. walk from Disneyland/California Adventure. We had a 3 day hopper pass, so we walked over all three days - (sure at the end of the day you're feet are tired but what's another 10 minutes when you save $$$ on parking?).", "title": "Loved this place!", "helpfulness": 7, "user": "Pippy437", "date": "January 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 12826579, "likes": {"liked": "— Everything!", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We had a room facing Disney, and loved the view!!!", "title": "Great hotel with views of Disney fireworks!", "helpfulness": 7, "user": "slippahs", "date": "January 8, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12450117}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "The room also had a small fridge.", "title": "Enjoyed our stay", "helpfulness": 9, "user": "Potari", "date": "December 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 12161329, "likes": {"liked": "— Rooms & distance to Disneyland", "disliked": "— elevators"}}, {"rating": 4.0, "title": "Quiet, close and relaxing", "text": "The bed was AMAZING!!! Soooo comfortable.", "helpfulness": 10, "user": "Victoriagurl", "date": "December 30, 2007", "id": 12108991}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "I stayed at this hotel last week for my son’s first trip to Disneyland. The hotel appears older however it was clean and the service was good. I have 2 main issues with this hotel of which only 1 would keep me from coming back. It allows smoking and you have to walk past the smokers to get to the room towers. There are ashtrays everywhere at the pool and the smokers that go with them! We had to move several times to get away from the constant smoke! The other issues and this is just an FYI – there is a small store/coffee shop and a gift shop at the hotel and they do not accept room charges so I had to trek back to my room past the smokers to get some money so make sure you bring your CC or cash. There is also a café that serves breakfast and lunch and it was very good. I had oatmeal with fresh berries for breakfast and it was delicious and for lunch I had the clubhouse and it was excellent with fresh avocado and was so large I could only eat half. Our room was on the 11th floor with 2 queens and a Juliet style “balcony” that overlooked the pool. The rooms on either side of us had full balconies. This was not an issue for us but it might be for others. The room was compact and the bathroom was small. The vanity was outside the bathroom and in the bathroom were the toilet and a shallow tub/shower combination with a shower curtain. The room had a complimentary safe and small refrigerator which we used. They charge $9.95 per 24 hours for WiFi internet which is annoying however you can print up your boarding passes for free in the small business office near the lobby. My sister had a king room overlooking Disneyland and her room was very large although the bathroom set up was the same however her closet was nearly twice the size of mine. We watched the fireworks from her full balcony and it was great. We took cabs to and from the park which was much easier than dealing with the shuttle. My son loved Disneyland and I loved watching him love it however for me this place is over priced and over commercialized and I hope I never have to go back. With the exception of California Adventure, Disneyland hasn’t change much (inside the park) from my last visit nearly 20 years ago and having to exit through gift shops at the end of popular rides is criminal! For the money it cost I could have had a nice trip to Hawaii and my feet would be blister free!", "title": "Sheraton Park - Too many smokers!", "helpfulness": 1, "user": "bellabell", "date": "April 7, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 14864354, "likes": {"liked": "— Full service hotel close to Disneyland", "disliked": "— That smoking is allowed on property"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "This hotel was very nice, clean and always all the staff we dealt with were very friendly and proffesional. The Hotel was a little farther from Disneyland than I thought but with the buses running regulaily and as early as needed if you did not have time to walk it was no problem. Restaurant was a bit spendy but really excellent food- same with room service. I would definitely reccomend this hotel!", "title": "Very nice Hotel", "helpfulness": 2, "user": "Hortex", "date": "April 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 14857560, "likes": {"liked": "— Friendly staff", "disliked": "— a bit spendy"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "Stayed here in September 2006 for the inaugural Disney Half Marathon. Great staff, wonderful new renovations (spring 2006), clean room, easy walk to the Disney Parks. Nice pool, a little chilly at the time, but after a nice 13 mile run, felt really good.", "title": "Good Stay", "helpfulness": 1, "user": "tcordero", "date": "April 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 14817086}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "We stayed here as a break from looking at colleges and to have a fun day at Disneyland.", "title": "Great hotel - delivered as promised", "helpfulness": 2, "user": "happytrailsagain", "date": "March 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14271681, "likes": {"liked": "— Location, nice rooms, easy to stay there.", "disliked": "— Nothing comes to mind"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008", "text": "The hotel was clean and well-kept for such a large property. I believe lots of conventioneers stay here as well as Disney goers so there was a mix of business and young children.", "title": "Great Place to Stay", "helpfulness": 2, "user": "SoCalAnnie", "date": "March 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14246088, "likes": {"liked": "— Accomadations and Staff", "disliked": "— Nothing"}}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 47, "average": 127, "very good": 460, "terrible": 28, "excellent": 345}, "aka": "Sheraton Park Hotel At The Anaheim Anaheim", "slim_ranking": 0.171171171171, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "The Sheraton Park Hotel at the Anaheim Resort is ideally located within walking distance to the Disneyland Resort, the new Anaheim GardenWalk and the Anaheim Convention Center."}