{"user_rating": 3.5, "review_count": 206, "name": "Sheraton Iowa City Hotel", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "Beyond my room window was the indoor pool atrium. It was extremely loud for the better part of the day. Somehow, people accessed this at night as well, when it was suppose to be quiet time. So while the bed was comfy, the noise was unacceptable.", "title": "loud pool", "user": "holly018", "date": "February 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 96526250}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "Then to top things off, just as I was finally losing myself in sleep, the ceiling sprinkler started spewing water.", "title": "Impressive hotel", "user": "Andyg24", "date": "February 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 96371509}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "I wouldn't recommend this hotel for fear of someone getting one of the interior rooms. Just awful.", "title": "Recently remodeled- clean and new", "user": "khoheisel", "date": "January 17, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 93357818}, {"rating": 1.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "I recently traveled to the Iowa city area for business and my company suggested the Sheraton. I was very impressed with the staff and overall hotel. Definitely the best Sheraton I've stayed in and I travel quite a bit. I tried their restaurant the first night and thought it was awesome. Cool place to meet clients. I believe it was called Share.", "title": "Needs service upgrades for the price.", "helpfulness": 2, "user": "alexanderanderson", "date": "January 14, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 5.0, "rooms": 2.0, "location": 5.0}, "id": 92881712}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Recently remodeled - rooms all new top to bottom- carpet, beds, furniture, TVs, bathroom fixtures, etc. Pool area nice and large, and biggest workout area I've seen in any hotel.", "title": "Great choice in Iowa City", "user": "Gronstal", "date": "January 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 92830027}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "Excellent location with boutiques, restaurants and even a drugstore in close walking distance. The beds are superb. The restaurant adequate. The staff is friendly, competent and accommodating. I forgot a package (in a plain white plastic bag) and though it was never retrieved(probably considered trash) the staff was prompt and courteous in getting back to me. The conference had adequate space, the temperature was ok with a jacket and the meals served were delicious.", "title": "Perfect Stay", "user": "whalegirl69", "date": "October 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85281933}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "This hotel has been totally redone - chic, comfortable and with every ammenity possible. The Iowa hospitality shines thru from the front desk to the maid service and everything in between. Situated right in the heart of Iowa City - easy walk to all the great restaurants and nightlife! We travel worldwide, and find few places that meet every expectation, and this is one of them.", "title": "Captures the spirit of the town", "user": "imavich", "date": "October 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83309853}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We rented a room here for our wedding night. The location was great becuase it's right downtown but the problem was that our room overlooked the beer garden of the next door bar. We had to listen to the whoops and hollars of the college kids until 2 am. The rest of the hotel was nice though and the bed was very big and comfy. I'd recommend the hotel, just make sure to ask for a different room if the noise gets too much.", "title": "Great Hotel but....", "user": "Annamh", "date": "October 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 2.0}, "id": 83167006}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We got this hotel through hotwire. We stayed at the hotel during a home football game. I can say the security at the hotel has improved since the remodel. I expected lots of loud people and parties at the hote, and was pleasantly surprised when I got a good night's sleep. The beds are comfortable. The towels are soft. They have flat screen TVs in the rooms. The front desk staff was courteous. The hotel is close to many places to eat.", "title": "nice location, comfortable bed", "user": "travelersfromIndy", "date": "September 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78847369}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "This hotel has been renovated and it is really nice. The rooms are lovely, especially the beds. The service at the desk is very good, very freindly, and the location is fantastic. You can wak anywhere. The only bad thing was that the Housekeeping staff lacked a lot of attention to detail, they did not refresh coffee, shampoo, and did not do a very good job clearning the room the second day, it felt like they just made the beds and changed the towels. But overall a really nice stay.", "title": "Great hotel, great beds", "user": "lorraine6225", "date": "August 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75935029}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "I stayed at this hotel for many weeks in 2010 starting in Feb. The rooms are wonderful with great bedding and nice quiet atmosphere. The lounge for elite members serves excellent breakfast and great appetizers---not just the \"regular\" foods, but always something extra special. You can't beat the great location either---steps away from so many great restaurants. This makes it so nice for business folks who don't want to get in the car again to drive somewhere for dinner after a long day with the client. The best part about staying at the Sheraton in Iowa City (as if all these things weren't enough!!) is the outstanding service in every part of this hotel, from the excellent front desk staff, to the service in the lounge, to the great room service provided. The manager of the hotel has clearly made serving the guests his number one priority. Each staff member goes way above and beyond to accommodate special needs/request as well. Highly recommend this hotel--for business or pleasure.", "title": "Outstanding service, great location and great rooms", "user": "FrequentTravelerJZ", "date": "January 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92319914}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled solo", "text": "We stayed at the Sheraton for our 20 year high school reunion. The location was great, right downtown. There were plenty of shops and restaurants to keep us busy while we weren't at the reunion functions. Very quite rooms and the beds were very comfortable.", "title": "Awesome Location", "user": "BengalsGirl22", "date": "December 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 90493595}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Had a great stay Saturday night. When we arrived they said they upgraded us to the top floor/concierge level. That was great as the view was better and they lounge area was great place to hangout. Free snacks and water plus a great free b-fast the next day.", "title": "Upgraded to Concierge level", "helpfulness": 1, "user": "QCbulldog", "date": "December 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 89999942}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled solo", "text": "Pool decent and not crowded. Hot tub small but nice and warm.", "title": "Great location for the football crowd", "user": "Worldly Woman", "date": "November 6, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 86213490}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "Beds were extremely comfortable, maybe the best I've ever had at a hotel. Paid for the parking in the rate so that is kind of a bummer. Also think the hotel should have free wifi in the rooms. Plenty of desktops but still a high end hotel should be able to give you wifi. Obviously a great location for bars and restaurants right out your door. Highly recommended.", "title": "Great Location for a University of Iowa visit", "helpfulness": 1, "user": "EdenPraireMom", "date": "October 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85386621}, {"rating": 4.0, "title": "Better than I expected", "text": "We were desperate for a hotel room due to last minute trip changes...thanks, United! The Sheraton had a room available at short notice even though it was a busy weekend. They even upgraded us to club floor. The room was nice and the bedding was much better than I expect in this type of hotel. Sheets felt like cotton and bed was plush. Bathroom was very new and clean, although shower was very difficult to operate. We had a hard time getting enough cool water to make temperature comfortable. Also, room carpet looked dirty to me.", "user": "kingsroadgal", "date": "June 29, 2011", "id": 114853567}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Negative points about the hotel are the very noisy bar situation in Iowa City. Back of the hotel faces over a large boisterous bar. You won't sleep unless you keep the AC cranked up....which is really your only option, as the room windows do not open. That is one of my pet peeves, and is enough to keep me from wanting to stay in this hotel again. Club floor lounge was pleasant although food didn't appeal to me. They do have a serviceable cappuccino machine, however.", "title": "Weekend get away", "user": "sirk14", "date": "June 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 4.0, "service": 5.0}, "id": 114586540}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "I wouldn't stay here again unless I had no choice, as the Hotel Vetro is more my taste, but this wasn't as bad as I was expecting. Service was acceptable.", "title": "Reasonable business hotel in a great location", "helpfulness": 1, "user": "ronneedham", "date": "March 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 101553486}, {"rating": 4.0, "title": "Always a pleasure", "text": "Spent two nights at the Sheraton hotel in Iowa city. I bid $85 a night on priceline,com and won this hotel. First the bad. $11 a day for parking. The A/C in our room was very noisy although they did try to fix it. The bathroom is a joke, No counter space to put your things and the shower has low pressure although it did have hot water, The good things. The staff was very friendly and the location is perfect. You can walk out the back door of the hotel and there are ton's of bars and restaurants, There was a band playing when we were there and a lot of people around. The hotel is very clean and well taken care of. If you want to stay in the heart of the city, than this would be a great location. Over all we had a very pleasant experience.", "user": "fancode", "date": "February 20, 2011", "id": 97368092}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Had business in Cedar Rapids but the decent hotels were sold out. Decided to truck the 30 minutes to Iowa City and back and it was a good decision. If you are at the point in your business travel where you need to have a decent place to stay, get a work out in, and get out of the hotel for a meal then this fits the bill well. Location is right among at least a dozen hotels in walking distance - everything from a good steak at Josephs to a beer and burger at any number of pubs/bars. This is primarily due to the college in town. I was there during spring break so all the college kids were gone and that worked just fine for me. Quiet and easy to grab a bite or a drink. Hotel itself has clearly done a remodel recently as the rooms and all common areas were in great shape. Bathrooms good sized and modern. TV, Bed, etc perfectly decent. Work out facility was average, at best. Indoor pool nice but the weights, etc, very limited. Fortunately no other biz travelers around so I could access everything as needed. But throw in 4-6 other people and it's going to get cozy quick so bear that in mind. People very pleasant and helpful but, hey, it's the midwest...of course they are! One hint, don't ask a bartender and a college girl at the bar where to get some great food, irrespective of the town you are in....they sent us to another bar (of course they did!) . My bad. Not that the food was bad...it was another burger at another bar. But, hey, I likely would have said the same thing when I was in college....", "title": "Very nice rooms and great service", "user": "SCauwels", "date": "February 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 97352318}], "location": {"country": "United States", "city": "Iowa City"}, "stars": 3.5, "variance": {"poor": 18, "average": 37, "very good": 73, "terrible": 16, "excellent": 62}, "aka": "Sheraton Iowa City", "slim_ranking": 0.5, "description": "Sheraton Iowa City Hotel is located on the campus of the University of Iowa, and close to Carver Hawkeye Arena, the legendary Kinnick Stadium, Hancher Performing Arts Center and the Museum of Art."}