{"user_rating": 3.5, "review_count": 1014, "name": "Sheraton Old San Juan Hotel & Casino", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "We have been to old San Juan several times on cruise ships. But this was our first stopover prior to a two week cruise around the Carribean. We stay here two nights before our cruise departed from across the road. That's right, a quick walk across the road and you are inboard. Location is perfect. Rooms have all been renovated and are very comfortable. Starbucks coffee in your room is complimentary. The casino is a nice size and there is a great burger bar downstairs, where the staff are friendly and service is good. Overall, I don't have a negative thing to say, so check in, you won't go far wrong.", "title": "Brilliant Stay", "helpfulness": 1, "user": "MariaSteve S", "date": "November 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 184851176}, {"rating": 2.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "the desk staff was very friendly and helpful. the rooms were nice and big, but it stops there. the floors could have been cleaner. the maids were in considerate of people sleeping later than 7am. horrible acoustics with a lot of banging of doors and maids talking right outside our door sounding like they were on the inside. plastic instead of glass for drinking. for it being a Sheraton and for the price we paid, we deserved better. never had I paid $50.00 before for a breakfast buffet.", "title": "post cruise", "user": "Stephen M", "date": "November 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 184717934}, {"rating": 3.0, "title": "Wish i could have avoided it", "text": "The setting is pretty nice but the room was pretty damp and they were also decorating rooms on the same floor which left a really strong smell. The front desk should have let me know about this and shame on me as I should have complained but didn't. Spacious rooms though with nice view. Same set up as other San Juan hotels but slot machines have taken over most of what really should be a reception area.", "user": "Bill C", "date": "November 13, 2013", "id": 184638875}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "We spent two day after our cruise as we thought it was within walking distance of our cruise dock. Beware there are two cruise docks in San Juan one by the hotel and another about five miles away. Royal Caribbean uses the further dock. The room had a wonderful view of the city. We found the room to be updated and very clean. The rooftop pool and hot tub offers a spectacular view of the city. The mattress was more plush then the usual and we had a great nights sleep. When arriving at 10AM they held our luggage until a room was available. The casino was very small actually smaller then on our cruise.", "title": "Pleasant stay", "user": "lar3313", "date": "November 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 184509909}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled solo", "text": "I was a first time visitor to Puerto Rico so I decided to stay at this property based on location. I didn't have to drive for two days and got to see some neat attractions. First, it sits in Old San Juan in a perfect location so for two days I was able to walk all around Old San Juan and see the forts and walk the infamous old style roads. And second, the hotel sits only about 200 yards from where a ferry takes you to where you can catch the Bacardi Rum Tour. Going about 100 yards towards town is where you find several different restaurants to choose from.", "title": "Super Location if you have no car", "user": "paul i", "date": "November 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 184249591}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "another trip to San Juan and another excellent stay at the Sheraton. Front desk was friendly and accommodating at check-in. Even had a kit for my dog! We had dinner at Palio the first night. The food was delicious and Alex was a fantastic help with descriptions and explaining different items. The fitness center is small but has everything we needed and the pool was refreshing. After hiking around the city all day we had burgers on the patio downstairs. It was fun to be able to sit outside, have a wonderful burger (try the jibarito burger) and soak in the laid back atmosphere. Highly recommend for couples, friends or business travel", "title": "perfect location, great experience", "user": "tsfl61", "date": "October 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181471583}, {"rating": 2.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "Hi everyone, we reserved two rooms at this Hotel the night before our cruises because the terminal was near the hotel . What a disapoint, first in my room , we where unable to get our deluxe room that we had reserved, they give us a standard room with a view on a garage. After one hour of complaint at the front desk, they never want to give us the room we paid , they told us no deluxe room was left and if I want to paid for the governor room I had to paid an extra 200$.", "title": "Don't trush the front desk and watch your room 'cockroach", "helpfulness": 3, "user": "GigiMar", "date": "October 16, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 181246652}, {"rating": 1.0, "stay_parameters": "Stayed October 2013", "text": "My sister in law got their room after me and they got a deluxe room. They had a large balcony with 2 wide Windows. In the morning, they had to kill two cockroach in the room.", "title": "Not a good place for families", "helpfulness": 4, "user": "SWFLGuest", "date": "October 14, 2013", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 3.0}, "id": 181030353}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "IN the morning, I complain to the front desk manager (Nilsa andLyann Proenza) they told us that we didn't get the go room and they will send us a compensation by Onhotel.com.", "title": "Great place to stay!", "helpfulness": 1, "user": "5201122", "date": "October 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181014138}, {"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "After 2 weeks, we contact Onhotel.com, and they were nice with me and they contacted the hotel with no result , the front desk told them that I never complained at the hotel and no credit will be send to me.", "title": "Mild dissappointment", "helpfulness": 5, "user": "tansandy", "date": "October 11, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 180557069}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "We were booked at the Sheraton for one night prior to a cruise and loved it! It is in an excellent location for anyone desiring to see the historic areas of San Juan. The only drawback was that there was no beach. They had a very nice pool, though.", "title": "Loved It!!", "helpfulness": 11, "user": "Pati B", "date": "January 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 3.0}, "id": 4325730}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "I love the Sheraton beds! Very comfortable after a day of walking. We had a wonderful time in San Juan.", "title": "Perfect spot for pre-cruisers", "helpfulness": 11, "user": "Michris17", "date": "January 2, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4318751}, {"rating": 3.0, "title": "No Problems - Nice Hotel", "text": "We stayed at the Sheraton Old San Juan for 2 nights prior to leaving for our Carnival Cruise. The location was perfect. Right in the middle of Old San Juan it was great for taking the walking tour and seeing El Morro. The hotel was also within 3 minutes to the pier to catch the ferry to The Barcardi Rum Distillery not to mention across the street from the pier for our cruise. The concierge was great giving us perfect driving directions to El Yunque and for an electronic store for items we forgot to bring. There is a little store across the street for souvenirs and toiletries. Only word of caution while the breakfast buffet is filling and the food is wonderful it is quite pricey...", "helpfulness": 5, "user": "Phoenix", "date": "December 31, 2005", "id": 4314188}, {"rating": 5.0, "title": "Great way to begin our Cruise Vacation.", "text": "We stayed in OSJ after our cruise and for Christmas. We had room 807 which overlooked the harbor and the busy street below. The location was fine. Not far to walk to most places in OSJ. The room was what you would expect at a Sheraton. They have a gym with everything you need. Small pool on the roof. The restaurant was a little pricey so we ate elsewhere. Hertz located in the lobby. No complaints", "helpfulness": 19, "user": "A TripAdvisor user", "date": "December 12, 2005", "id": 4233536}, {"rating": 4.0, "title": "Good value for the money", "text": "I had to write a short review about this hotel after reading some negitive comments. This hotel was the best way to start our cruise vacation. From the time we stepped in the lobby until we left it was a great experience. At check-in we were greeted by a very friendly receptionist. Before we had a chance to ask if any upgrades were available, she asked us if we would like to be in a suite. We acceped without hesitation. The room was wonderful. Two large rooms were very well decorated and spotless. The bedroom area had a king bed with feather bed and comforter. Along with two TV's and a large living room with sofa bed, desk area with internet available there was also a magnificent view of the bay and cruise ship area. We were lucky to have been there the weekend of their annual culinary festival. We got to try alot of their speciality foods and wines in a really festive atmosphere. The hotel is with-in walking distance to area attractions and several cruise ship docks. The hotel also has a casino on the same property with a great restaurant and bar area. We would definitely stay there again on our next visit to Puerto Rico. Give the hotel a try you will not be disappointed.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "November 22, 2005", "id": 4138422}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We stayed three nights beginning on a Saturday. Reception was slow and service indifferent, but this was the only real negative of the stay. The pool has a great view, but is tiny; there may have been 6 people there and it seemed crowded. The fitness center is similarly small, but very nice. Rooms are normal hotel rooms; we had a view of the parking garage and did not mind (hotwire reservation, so it was expected).", "title": "Great location", "user": "Saroybal", "date": "November 9, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 184198064}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "We stayed here while visiting Old San Juan. The hotel is located across from the cruise ship dock so the road is pretty packed with taxis when a ship comes in. The hotel has valet parking for $20 for 24 hours. This is nice if you want to spend several days seeing Old San Juan since parking in the area is a nightmare. Every staff member we dealt with was very friendly and helpful. There is a very nice workout facility on-site with good equipment. The pool, which is located on the 9th floor, is a little small, but seemed nice. There were signs posted saying the hotel was undergoing renovation. The areas we saw all seemed to be updated and nice. The room was a little small, but very clean and well furnished. I'd definitely stay here again.", "title": "Good place to stay while visiting Old San Juan", "user": "Brad X", "date": "November 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 184170561}, {"rating": 2.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The front dest person was so cold, maybe cause i'm local. Next day i ask for a table for breakfast, there was tables with a view but they gave me the wall, maybe they need to care about the locals like a tourist. When you speak spanish they treat you so so, but when you speaks english they treat u different...i better try next time another hotel chain, and practice my english for a nice stay.", "title": "Non pleasant", "helpfulness": 1, "user": "Chicas16", "date": "November 7, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 184003306}, {"rating": 4.0, "title": "Good stay", "text": "I stay at this hotel 2-3 times a year and it is always a pleasant stay. The location is great and roof top pool is beautiful. Some of the rooms are in need of refurbishing, but overall things are very nice.", "helpfulness": 4, "user": "Kevin C", "date": "October 29, 2013", "id": 182873150}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "We booked this hotel for a one night pre-cruise stay.", "title": "Excellent stay. Don't listen to the bad reviews.", "helpfulness": 6, "user": "axg1040", "date": "October 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 182717508}, {"rating": 3.0, "title": "Nice Hotel, Subpar Experience.", "text": "We got off the Golden Princess cruise ship and walked right across the street to check in at the Sheraton. If you're staying a night here before or after a cruise, it's an excellent location. There are two cruise ships docks directly across the street, but some of the docks are on the other side of the harbor, so you might want to check on that. This hotel is also in an excellent location for touring Old San Juan, with it's brick streets, brightly painted buildings, churches, and forts.", "helpfulness": 17, "user": "nlamb", "date": "March 25, 2006", "id": 4732708}, {"rating": 5.0, "title": "great!", "text": "We tried to check in around noon and the lobby was a zoo. There was luggage piled all around and people everywhere, coming off the ships and checking out to get on the ships. We were told to come back around 3 and they took our luggage for us. We felt a little uneasy because we had to leave our luggage piled up in the lobby until they put it away. Spent the afternoon walking around Old San Juan and were able to check in when we came back.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "March 16, 2006", "id": 4626595}, {"rating": 4.0, "stay_parameters": "Stayed February 2006, traveled on business", "text": "The elevators are a little scary, they're old and look like they need replaced. The hallways are somewhat dark but our room was beautiful. However, we had a partial harbor view reserved and got a view of the parking garage.", "title": "Best for the area", "helpfulness": 23, "user": "TravlingTS", "date": "March 3, 2006", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "rooms": 3.0, "service": 5.0}, "id": 4579617}, {"rating": 4.0, "title": "Basic no frills, good area for a pre cruise stay", "text": "There is a pool on the ninth floor with a great view of the harbor and the cruise ships. However, the pool is VERY small and has little seating area. The restaurant downstairs serves Puerto Rican food, however it is quite expensive. It also serves a breakfast buffet (decent) and lunch.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "February 25, 2006", "id": 4518881}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "I would definitely recommend this hotel for cruise ship passengers and anyone wanting to be in the heart of Old San Juan. However, don't try to check in until later afternoon.", "title": "comfortable stay", "helpfulness": 17, "user": "ltowngirl", "date": "February 24, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 4500305}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "I was a little hesitant about staying here after reading some of the reviews. We made reservations using priceline for 4 nights. We were on the 6th floor and had a view of the waterfront. The room was pretty decent; spacious,comfy bed, nice bathroom. There were pool towels in our room; which came in handy. The TV remote was a pain, it didn't work if you lied far away on the bed. You had to be close to the TV to change channels. Also, the shower made awful noise, I turned the knob a little and then it stopped. Left both complaints, hope they do something about it.", "title": "Great location in old San Juan", "helpfulness": 3, "user": "Sheba-k", "date": "May 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129657218}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The staff was great; we had no trouble checking in at 3 pm, our room was ready when we arrived. We asked the receptionist where we could buy some umbrellas and she gave us one for use during our stay. The concierge wasn't very friendly though, we asked him if he had any suggestions on activities/restaurants and he just handed us brochures. We checked out early on our final day; stored our luggage at the hotel and roamed in Old San Juan.", "title": "Great Location, Great Staff, Tired Property", "helpfulness": 1, "user": "Julie K", "date": "May 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 129603019}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The hotel is located in a great location in old San Juan. All of the tourist attractions are nearby within walking distance except for maybe El Morro fort; which is maybe a 30 min walk away. But there is a free trolley/bus service right in front of the hotel. There are a lot of good restaurants within walking distance. We took the ferry right in front of our hotel to get to Catano and visited the Bacardi rum factory.", "title": "Better than expected", "user": "trianem", "date": "May 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 129522092}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "There's no good beach nearby, you can probably take the cab to Condado beach which is the closest. But it's not that great. We ended up renting a car because of some excursions we were doing in Fajardo/Culebra which worked out great. Ended up going to Luquillo beach.", "title": "Enjoyed our stay!", "helpfulness": 1, "user": "Bfwiles", "date": "May 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 129520573}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The Palio restaurant at the Sheraton had a good breakfast spread, we ate a huge breakfast everyday. We ended up having dinner here one night when it was raining. We ordered soup of the day (cream of plaintain) and Garden pizza. Both were delicious!", "title": "Great Location, Great Staff", "helpfulness": 3, "user": "wahoo7", "date": "May 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129452519}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "My husband and I stayed at the Sheraton Old San Juan the night before a cruise departure. The room was booked by our travel agent, through Royal Caribbean. The room was very clean and quiet. The bed was very comfortable. No refrigerator. No complaints. There was a very small casino in the hotel and a small, expensive restaurant. Just behind the hotel, there are less expensive places to eat. I would definitely recommend this hotel and I would stay there again.", "title": "comfortable, clean, and quiet", "helpfulness": 6, "user": "DeborahVJ", "date": "February 21, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4477488}, {"rating": 1.0, "title": "Stay away. In fact, skip San Juan & go to Vieques instead!", "text": "My wife & I, along with my sister & brother in law, stayed the nights of 1/18 and 1/19. We were supposed to stay 1 night longer, spend 2 days on Vieques, then come back for one more night to the Sheraton. In lieu of a voluminous diatribe, I'll hit the high points...", "helpfulness": 8, "user": "SMUJD07", "date": "January 26, 2006", "id": 4389855}, {"rating": 1.0, "title": "The Management Stinks... and so does the pool!", "text": "1. We are Starwood Preferred members - they screwed up our reservation and we were forced to leave a night early on 1/20 and go to Vieques a day early. Thank God we did - and no, we did not return for the last night!", "helpfulness": 11, "user": "A TripAdvisor user", "date": "January 19, 2006", "id": 4364666}, {"rating": 1.0, "title": "Terrible Place to Stay!", "text": "2. An unknown hotel employee got ahold of the guest register, ate at their ridiculous restaurant \"Fogata\", and charged it to our room. The indiviual actually signed MY name - legibly - when the check came, so the person would have to have known the name AND room number.", "helpfulness": 12, "user": "sbcactus", "date": "January 19, 2006", "id": 4364536}, {"rating": 2.0, "title": "Watch out for Sheraton Old San Juan", "text": "3. My siser in law had her credit card number stolen in San Juan & is now dealing with that. We don't know if that occurred at the Sheraton, but it's the same thing all over town.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "January 9, 2006", "id": 4333407}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "Warning! some rooms even in the 7th floor have view to the multistory car parking not to the sea !", "title": "Excellent location good rooms", "helpfulness": 1, "user": "BIZAS", "date": "October 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 182643829}, {"rating": 3.0, "title": "Reservation not Honored", "text": "Nevertheless this property is in very strategic location in the old city and if you are here for sightseeing is the best option. The rooms are quite good and the breakfast (not included) very good. The hamburgers in the corner restaurant in the ground floor next to the casino are excellent!", "helpfulness": 3, "user": "2disland", "date": "October 27, 2013", "id": 182549071}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "I booked a stay at this Sheraton directly through their booking agent at the Sheraton's 1-800 number. I wanted to stay due to the convenient location to the cruise terminal. Upon arrival, I was told the room I booked was not available and was put in a lower grade room. I have read reviews from others stating this is somewhat of a common occurrence. I complained enough at the front desk that I finally got us moved to a different room. However, I shouldn't have had to spend my vacation time complaining to have my reservation met. This was a very average facility. Nothing special at all. We did enjoy the second floor balcony lounge. It was a good place to just sit and watch all that was happening on the street below. Watch out for the breakfast buffet. VERY overpriced for what you get. I would stay here again if we cruise out of San Juan because it is right across the street, but I wouldn't look forward to it.", "title": "Great location", "user": "Oko341", "date": "October 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 182509878}, {"rating": 3.0, "title": "Fun trip", "text": "Looking out over the bay made it more enjoyable to work. The internet connection was via cable versus wifi but not a real inconvenience. The staff are helpful and friendly - as were other guests. The central staircase is beautiful and the hotel has a solid, older feel to it - both features that I participate. Our room was closer to the elevator than I usually like but there were no noise issues during our 1-week stay. The food at the Palio restaurant was excellent. The hotel is convenient to all of Old San Juan, restaurants, as well as the ferry.", "user": "SHVohio", "date": "October 22, 2013", "id": 181996766}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Going by the Sheraton brand would'nt rate it high. Best location in old San Juan. Excellent if your room is facing the pier. However, would not be that exciting if other than that as you would end up keeping your windows closed all the time.The power outage during our stay (not sure whose fault) was not managed properly.", "title": "Great Location for Cruisers", "helpfulness": 4, "user": "AggieDiver86", "date": "October 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 181539077}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "This hotel is located right in old San Juan. The location is the hotel's best feature. The lobby and casino are attractive. The gym is small but clean and had a great view. The interior rooms facing walls are drab. There is little natural light, and the Windows are very small. The room smelled a bit musty and did not seem very well maintained. The furniture was entirely too large for the room and made it feel cramped. The bathroom was large, but did not have any particular features that stood out with an average shower and vanity. I did not care for the bath products. Valet parking was convenient and reasonable.", "title": "average hotel in ideal location", "helpfulness": 1, "user": "dnpinva", "date": "May 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 129426912}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "As the title says, I think it's a great location for touring Old San Juan (not for beach goers). It has a trolley stop right across the street.....just make sure you're aware that one trolley goes through the middle of the old city and the other one goes around the perimeter (forts, etc.).", "title": "Location, location, location...", "helpfulness": 3, "user": "Michelle5250", "date": "May 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129386401}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We had two rooms...as other reviewers have mentioned I did notice an odor in one of the rooms but not the other. The rooms were clean however and were more than acceptable.", "title": "Great location to see Old San Juan", "user": "scubagurls", "date": "May 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129360400}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "The bellman were very nice and accommodating. The casino was small, but a fun place w/complimentary drinks and even complimentary sandwiches.", "title": "Cruiser Convenience", "helpfulness": 1, "user": "kinabina", "date": "May 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 129309266}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We ate a couple times at the Chicago Burger restaurant on site. Both times the food was good, but getting any service took way too long even when they weren't busy.", "title": "Great location in the city. Pretty good room!", "helpfulness": 1, "user": "intheair2010", "date": "May 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 129268732}, {"rating": 1.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "I booked through Hotwire three months in advance specifically for the location. When we arrived, the desk clerk announced that they were overbooked, too bad, this is how we do it, no apology. We were hustled into a cab and sent to the Sheraton Puerto Rico, a much nicer hotel in a terrible location. While the Sheraton PR was a wonderful hotel, we had to figure out buses to the Old City, which curtailed the time we were able to spend there. Because we hadn't budgeted for cabs, we couldn't go back to the Old city for dinner, but had to eat bar food in the hotel. VERY disappointing.", "title": "No room at the inn", "helpfulness": 4, "user": "CarolineArizona_11", "date": "May 15, 2012", "detail_rating": {"value": 1.0, "location": 5.0, "service": 1.0}, "id": 130011989}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "It's not a Westin, but if you want the best location for Old San Juan and other things like cold a/c, comfortable bed, decent workout facility and pool/hot tub, this place is great. I'm so glad we stayed here and not a resort away from all the restaurants and historic sites.", "title": "Best Location and all the Basics done right", "helpfulness": 2, "user": "MadeInFlorida", "date": "May 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129855076}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Upon our arrival we were graciously met by the front desk staff and although were nearly four hours early, they gladly pre-registered our group of six. The staff was curtious, kind,and willing to check our luggage for us. The consieirge was very helpful in assisting to help us plan a day trip while the hotel housekeeping staff prepared our rooms for us. Old San Juan is a charming, rustic, and can transport you back to the early fourteenth century, with it's narrow blue cobble stone streets. We enjoyed an authentic Puerto Rican meal at La Puenta Vista, and enjoyed the old fort Morro. All and all, it was pleasent stay. The hotel is dated, but clean, the beds are comfortable, rooms are spacious, and the staff was freindly. If in Old San Juan,Puerto Rico, the Sheraton old San Juan is deffinetly the place to stay. If cruising with Carnival Cruise lines you are walking distance to your boarding station.", "title": "Nice hotel to stay at in old San Juan", "helpfulness": 1, "user": "SudburyHappytraveler", "date": "May 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129723457}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "After spending four spectacular nights at El San Juan in La Isla Verde we wanted to make a change of scenery and head to Old San Juan for the last two days of our trip. From the outside we were pleasantly surprised by the ideal waterfront location and great proximity to all of the shops and restaurants of Old San Juan. Upon entry I was immediately regretting my decision to leave old San Juan and when we finally got into our room (3 hours later), I was devastated we ever left El San Juan. The room was dark with barely any sunlit. The windows looked into a parking garage that covered what remaining sunlight would have entered our room. The walls were an ugly yellow color with no artwork and I seriously felt like I was in a dorm room or even worse a jail. The rooftop pool did only a little more to make our stay better. There a decent sized pool, with some chairs and a hot tub (that could have been a little warmer). Unless you can guarantee a waterfront view, I would not recommend staying here. There are no \"real\" bars and no real entertainment besides the casino which is filled with old people (no offense to those of you that are of that age). If you're heading to San Juan your options should be El San Juan, La Concha, The Ritz Carlton or St. Regis Bahia Beach (the two at the end on the pricier side).", "title": "Felt like I was staying in a dungeon", "user": "bella160", "date": "May 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 3.0, "sleep": 2.0, "rooms": 1.0, "location": 5.0}, "id": 129717434}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We checked in about 2:30. There had been some mix up because they were showing that we were to be in a room with a king bed, which wouldn't work as we had our 5 year old son with us. The young lady at the front desk quickly adjusted to have us in a room with 2 double beds. She was professional and pleasant. Upon hearing that we were taking a cruise the next day she offerred us a slightly later check out which was VERY MUCH appreciated. We had time to linger a bit after breakfast and then head over to the pier.", "title": "Great 1 night stay before our cruise", "user": "ASHMD", "date": "May 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 129690710}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled solo", "text": "After reading the reviews here, I was a bit hesitant in booking my stay here. However, I have only one day to explore and Old San Juan and this hotel seems to be the best place to stay for one night.", "title": "Great location in historic site", "helpfulness": 7, "user": "terravisum", "date": "November 18, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10899519, "likes": {"liked": "— close to historic sites", "disliked": "— traffic jam"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled solo", "text": "After a $20 cab drive from the airport to the hotel, seeing the long cab line to get into the hotel front entrance, I decided to get off and take the 10 meters walk to premises entrance instead. I was offered to take my suitcase which I declined. As reported, the lobby entrance was not large and was being occupied by flowing baggages on one side of the door. Thankfully, there was not a line at the check-in desk. My SPG status was quickly recognized and I was given an upgrade to one of the suites on the 6th floor, a voucher for breakfast at the restaurant as there was no executive lounge and two other vouchers for drinks and chips at the casinos.", "title": "Relaxing, but overpriced", "helpfulness": 5, "user": "xdeleon", "date": "November 1, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 10511522, "likes": {"liked": "— The suite, the convenient locations", "disliked": "— Having to pay for internet access, poor service at the hotel restaurant"}}, {"rating": 5.0, "title": "Very Nice!", "text": "As reported one of the elevator seems to have a mind of its own and quite slow. My ride to the 6th floor seems to be an exercise of leisurely watching the numbers increasing and everyone who got off seems to sigh in relief.", "helpfulness": 4, "user": "Monster-Dawg", "date": "October 8, 2007", "id": 10056629}, {"rating": 4.0, "stay_parameters": "Stayed January 2007", "text": "Suite 604 living room has no windows except for the lone double door that opens up to the tiny balcony facing the cruise ships docks. The lack of windows means that there are not enough daylight and the living room is a bit darker than I would have liked. Still the room is nicely furnished with a business desk a nice sofa and twins ottoman. There are two small bottle of Spanish red and white wine for sale on the lamp desk.", "title": "Picturesque view", "helpfulness": 4, "user": "adatrip", "date": "October 3, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 10034786}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "The bedroom is a large room with a king bed, the Sheraton Sweet Sleeper which is one of my favorite bed. A drawer-desk with a 32\" TV on top and an arm chair with ottoman wrapped up the furniture in the room. A closet with the usual ironing board and mini-safe are provided. A lone window looked out into the concrete lobby roof is better left shut and provides minimal daylight. The two bed lamps provided more than enough lights to compensate for daylights. This room has adequate noise isolation for me but maybe because it is away from the streets and my neighbor is the quiet type.", "title": "Fantastic Location", "helpfulness": 4, "user": "grand dutchess", "date": "August 31, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8592530, "likes": {"liked": "— Location"}}, {"rating": 5.0, "title": "An excellent stay", "text": "Having read a lot of bad reviews I was some what concerned about staying at the Sheraton Old San Juan. However this turned out to be a great hotel, the staff could not have been more kind and helpful and the room I had was very clean and in good repair. The facilities in the hotel are of a high standard except the pool which was a bit small and crowded at times. I would certainly recommend the location as well with the old town all within walking distance and the cruise ships right outside. I spoke to the manager by e-mail about the bad reviews before staying and they did admit there had been problems, and they ensured me they had worked hard to resolve the problems and that certainly was the case.", "helpfulness": 9, "user": "jb812", "date": "May 22, 2006", "id": 5189131}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "I felt I had to post this review of the Sheraton OSJ after reading some of the negative ones; were we staying in the same hotel? We were very pleased with the place and would definitely stay there again. It was spotless, the staff is very friendly and the location is great.", "title": "Great Stay - enjoyed Sheraton OSJ", "helpfulness": 15, "user": "Cajuche", "date": "May 22, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5188999}, {"rating": 1.0, "stay_parameters": "Stayed April 2006", "text": "The one thing that I would warn folks about is the fact that not all cruise ships dock across the street (which is partly why we chose this hotel in the first place). Some Royal Caribbean cruises dock at the Pan America pier, which is a $15 taxi ride away. So check your cruise documents.", "title": "Not even worth for free", "helpfulness": 6, "user": "Bandar", "date": "April 15, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 4975190}, {"rating": 1.0, "title": "Nightmare", "text": "All in all, don't let the other reviews scare you (we almost did); try it you'll like it!!", "helpfulness": 10, "user": "A TripAdvisor user", "date": "April 4, 2006", "id": 4932331}, {"rating": 4.0, "title": "Good Location for Day Trips", "text": "Just returned after 2 days stay using starpoints. I just wasted 14,000 starpoints. Definitely the worse Sheraton I have stayed in. Staff unfriendly, didn't see a smile at all. Furniture, carpet etc.. extremely worn out. The room I got had a very small window like a cubby hole. The room faced a parking lot. All night long, honking from the car alarms from the parking lot. Extremely crowded with cruise ship passengers. Avoid it at all cost. It used to be a Wyndham hotel.", "helpfulness": 12, "user": "pixiez", "date": "March 28, 2006", "id": 4742361}, {"rating": 4.0, "title": "Great location, but pricey!", "text": "We stayed here the night before our cruise departed.", "helpfulness": 2, "user": "Loves_Snorkeling", "date": "March 3, 2008", "id": 14025273}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "We arrived in San Juan around noon but could not get our room key until 3pm. This was a little inconvenient but we lived with it.", "title": "Excellent Location", "helpfulness": 2, "user": "clubmeister", "date": "March 3, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 14024247}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The room met my expectations. It was clean, comforable with a nice view of the harbour.", "title": "Your basic Sheraton, but good location", "helpfulness": 2, "user": "Chicago_Eric", "date": "February 26, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 13874076, "likes": {"liked": "— Location", "disliked": "— Lack of character"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "As other people mentioned, it was nice seeing the other cruise ships at the pier across the street.", "title": "Meh (ok for cuising)", "helpfulness": 6, "user": "bekahblue22", "date": "January 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 12768755, "likes": {"liked": "— location to pier", "disliked": "— the casino, the door stops in the room (designed to trip you up), and the blandness of it"}}, {"rating": 1.0, "title": "The worst hotel ever", "text": "Ours was located at the Pan American Pier across the harbour.", "helpfulness": 3, "user": "jimplacable", "date": "January 14, 2008", "id": 12609448}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "This hotel is in the perfect spot for people arriving a day or two early for a cruise. The port is directly across the street! Getting there from the airport on a Friday evening took 2 hours though, when in all actuality it is only about 10 min. away.", "title": "Perfect for cruise departure", "helpfulness": 6, "user": "TXWV", "date": "January 8, 2008", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12440592, "likes": {"liked": "— The view of the fort from our room.", "disliked": "— Noisey casino"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Our room was on a lower floor (4) and we had to ask the front desk to move us due to noise from the Casino. They promptly moved us to a suite on the top floor-very nice!", "title": "place to stay if you want to experience old san juan", "helpfulness": 3, "user": "kimspokane", "date": "January 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 12289608, "likes": {"liked": "— location location location", "disliked": "— called for bedding for pull out couch and it never came. found a kid in the hall who gladly ran to get our extra bedding."}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Everyone there was very nice and the food in the hotel was below average but the service was outstanding.", "title": "Perfect Location for Pre- or Post-Cruise stay", "helpfulness": 7, "user": "mizlori", "date": "December 8, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 11341984}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Old San Juan is such a cool town to explore (by foot if you want) and this hotel is at a great location to do so.", "title": "Good location, Decent Hotel", "helpfulness": 3, "user": "audaciousred", "date": "December 4, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 11235296, "likes": {"liked": "— location"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We stayed one night post christmas cruise in order to see old san juan. While this hotel is not the Ritz, stayed there a week prior to our cruise and loved it, it has charm and location can't be beat.", "title": "Unfriendly Hotel", "helpfulness": 4, "user": "gatorsf", "date": "November 26, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 11072898, "likes": {"liked": "— Location", "disliked": "— Unfriendly staff"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We stayed two nights here as part of a five day visit to Puerto Rico. This hotel is right in the center of Old San Juan, at the ferry port. It is a great, lively, location and if you love to walk around and explore, as I do, it will suit you. The hotel itself has some shortcomings though. I liked the entrance foyer/casino area, but the room are a let down. We settled on the second room they gave us, but really just because we didn't want to keep whining! The halls and rooms feel old, cramped and dark, first room had a tiny balcony, which opened on to a parking garage!! Second room was even smaller, but did not have a balcony, just a tiny window that didn't open, very claustrophobic. Pool area is really small, nice, but maybe ten sun beds? That always seemed to have towels left on them, and no one using them? One day I just couldn't get a bed at all because of this, they need a staff member to be constantly removing towels if they are left behind. Very nice gym area next to the pool. I loved the area around this hotel, such a great, vibrant atmosphere. Would I stay here at this hotel again? only for a better room, or a really short while. But I can't wait to come back to PR, hopefully next month!", "title": "Great Location, Okay Hotel", "helpfulness": 2, "user": "TraceyJ1453", "date": "May 26, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 130654636}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "After a long day of exploring Old San Juan, we happened into the Sheraton across from the cruise piers. We went to the second floor. We just wanted to have a drink and a few appetizers so they sat us outside on the terrace. What a perfect place to be in the evening looking out to the water with the lights. It was so pretty. Our server was Gabriel. He was very informative and gave us great service. The food was outstanding! We ordered Pork Pinchos and Empanadas (sauces on the side). It was so good we decided to go back our last night in Puerto Rico. We asked to be sat with Gabriel and were happy to find that he was working again. He seemed happy to see us too. We very much enjoyed this place! We were told they have a new chef and he is making this an awesome place to eat. If you go…ask for Gabriel.", "title": "Palio restaurant was fantastic!!", "helpfulness": 1, "user": "E F", "date": "May 26, 2012", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0}, "id": 130645236}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Good location in Old San Juan but other than that just a plain old hotel. Our room felt/smelled damp and musty; the staff was ok, not overwhelmingly friendly, and room service was slow.", "title": "A nice place in a good location but nothing special", "helpfulness": 1, "user": "rubyred81", "date": "May 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 130521216}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "My girlfriends and I stayed here for our spring break. We were able to get a great deal getting an advance purchase rate on the Starwood hotels website.", "title": "Great location!", "helpfulness": 3, "user": "Monamacduff", "date": "May 24, 2012", "detail_rating": {"service": 3.0}, "id": 130515297}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The hotel is right across from the cruise port of San Juan but our room was still quiet. There is a casino in the hotel though we did not frequent it. It is a 2 minute walk to the heart of Old Town San Juan (simply walk up the hill). Our room was spacious and comfortable though we did experience issues with our shower (it took a long time to find the right temperature and it was quite noisy).", "title": "Best Location in Old San Juan", "helpfulness": 3, "user": "JHalberg", "date": "May 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 130328723}, {"rating": 1.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "The staff at the front desk are horrible! don't expect a friendly greeting when you check in and don't ask any questions since they seem to think that you are bothering them when you do. The middle manager at the front desk seems to think that she's doing you a favour by checking you in.", "title": "$10 a day for internet horrible staff!", "helpfulness": 2, "user": "louueve", "date": "April 3, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 14763826, "likes": {"liked": "— a picture on the wall in the bedroom"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "There is a $10 charge per DAY for internet, it's really backward. The comforters on the beds smell! and the rooms are run down. The lobby is ok and so is the casino.", "title": "Good Location Not Much of a Hotel", "helpfulness": 2, "user": "peregrino", "date": "March 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 14632456, "likes": {"liked": "— Location.", "disliked": "— See review."}}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "I get the impression that the people who run this hotel do not care about real vacationers, they only see the hotel as a place that people on cruises overnight will stay.", "title": "Frequent Business Traveler thinks it was just OK", "helpfulness": 1, "user": "dsmulligan", "date": "March 12, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 2.0}, "id": 14245247}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Oh and by the way NEVER book anything on EXPEDIA. They messed up the reservation and did not want to correct it for us, and the lovely staff at the hotel did not care.", "title": "Post-cruise stay", "helpfulness": 2, "user": "garciafa", "date": "March 12, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14229714, "likes": {"liked": "— location in san juan"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "This hotel's location is the best thing about it. The carpets (both in the room and in the common areas) were stained and worn. There is a charge for internet access. We booked one night through Priceline and one through Hotwire. On one night we were charged an additional $9.96 for an amenities fee and the other an additional $15 for room tax. Not that it's a big deal, but the fees were unexpected and something that anyone planning to book through either Hotwire or Priceline should be aware of. Check with the extremely helpful staff about places to eat. We found good restaurants from both the bellhops and the desk staff. There are a lot of not so good and overpriced restaurants nearby, so it's really important to ask around rather than to just read the posted menus, which we did on our first night, to our regret. Not particular to this review--if you want a rental car, Charlie Car Rental had the best rates we found and, again, a really friendly and helpful staff. They will pick you up at the airport or your hotel and return you to either. The airport location is open 24 hours a day but the downtown location is just open during the day. Nice new cars at reasonable rates. You will need a car to visit the rain forest. If you do go there, be sure to take a tour with the park ranger. It's free and informative.", "title": "Great location to tour Old San Juan", "helpfulness": 1, "user": "BethanyBeach", "date": "March 10, 2008", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 14194931, "likes": {"liked": "— location- right at the waterfront - easy access to Old San Juan", "disliked": "— noise from hall and elevator right outside room"}}], "location": {"country": "Caribbean", "city": "San Juan"}, "stars": 3.5, "variance": {"poor": 78, "average": 262, "very good": 399, "terrible": 58, "excellent": 217}, "aka": "Sheraton Old San Juan Hotel San Juan", "slim_ranking": 0.340425531915, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Sheraton Old San Juan Hotel is situated in the heart of historic and romantic old San Juan. We are ideally located on the waterfront, just a few moments from the docking point of grand cruise ships."}