{"user_rating": 4.0, "review_count": 291, "name": "Sheraton Mendoza Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Beautiful modern hotel. Highlight being the outdoor decking area beside the indoor pool. Lovely to be able to catch some rays in the city. A short walk to the main street bars and restaurants. In house tour companies sell tours of the surrounding area's. Wonderful breakfast buffet. We took tours of the winerys nearest mendoza, didn't want to drive longer than 1 hour and the 3 we saw were very impressive. Also recommend the tour to the Andes, to the border of Argentina and Chile. There are nicer restaurants on the far side of the park from the main street and v. safe to walk there. Very posh restaurant on top floor of hotel with amazing views.", "title": "Fabulous hotel in great location", "user": "snowy19", "date": "February 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 55807994}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "Timing is everything. I booked 4 nights at hotel in mid October and unknowly there was a Ford Motor Company conference. When I checked in I asked not to be moved during my stay. As a Platinum member to were able to accomodate me with the Presidental Suite. The staff was great and they offer a good car service to and from the hotel. The gym and swimming pool are excellent. The location was wonderful and there is a good adventure tour company across the street. I would have given the hotel a good rating even without being in the Presidential Suite.", "title": "The hotel staff was great and had the best room on the property", "user": "LuckyTiger", "date": "January 18, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53813607}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The Sheraton in Mendoza was a beautiful hotel with All the amenities one would want. We were greeted by a helpful and efficient front desk that took time to make suggestions and provide answers to many of our questions. The spacious rooms offered outstanding views of the Andes Mountains. The hotel offered a large pool and cabana for relaxation after a day filled with touring. The breakfast was outstanding and provided a variety of delighfully presented choices. It was the perfect place to enjoy Mendoza due to its central location. Again, We really appreciated the helpfulness of the staff and front desk who even printed our boarding passes for our return flights. The hotel lives up to its reputation for excellence.", "title": "The Sheraton is a wonderful hotel with great views of the Andes.", "user": "burrdjd", "date": "January 5, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52701554}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "This is a beautiful new hotel (opened in Fall of '08, we were told). We felt the room and the hotel's pool area were great, as was the restaurant on the 17th floor with panaramic views of the city. The room is pretty large and the bathroom is spacious compared to most. The service at the front desk was great and we were treated well by a professional food & wine manager, Warren. However, most staff seemed somewhat inexperienced. I chose the hotel based on it's newness and my unfamiliarity with the area. After having spent 4 days there and having walked all over the central areas of town, I felt it was safe and the people very friendly. Unless money is no object, I would recommend a less expensive option (I paid $189 + tax = $239!/nt). Save your money for more wine trips and touring!", "title": "Great hotel, but pricier than necessary.", "user": "06Mexico_Lover", "date": "January 2, 2010", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 52408978}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "I left on Dec. 22nd and was in the middle of finalizing the details of purchasing my first home. We arrived in Buenas Aires and then off to Mendoza on the 26th to the 30th. Needless to say I was a bit stressed and it was the first business day to finalize more paperwork. The internet was great and free in the lobby and very reasonable rates in the room. The front desk staff was great and when one of the computers had issues with printing offered me an email address and they scanned and sent everything to my Realtor and also faxed later after they printed it out on their front desk computers. The best part no charge for any of it. Not sure if that was a mistake or just part of the service. The cleaning crew was great and better than my housekeeper at my own apt. Staff was all so very nice it was amazing. The breakfast buffet was delicious and they were fast to fill up the coffee. Much better than the normal continental breakfast. Great location and I felt extremely safe. The managers of the hotel should be very proud of their staff. Thank you!!!", "title": "Great place to stay....can't go wrong", "user": "GoodTimesHolllywood", "date": "January 2, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 52341153}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The Sheraton Hotel in downtown Mendoza is well-situated and exeptionally beautiful. The hotel is tastefully designed with a large foyer graced by stunning modern artwork.", "title": "Beautiful Hotel", "helpfulness": 1, "user": "michylob", "date": "April 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 61020173}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "Our room had a view across the city and was well-appointed and elegantly decorated.", "title": "Perfect place from which to explore the wine region and city", "helpfulness": 2, "user": "GlobalVenturer", "date": "April 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 60834781}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The concierge service was excellent. The concierge dropped us off and picked us up from restaurants for a nominal fee. The restaurant was very nice and a nice buffet breakfast was served every day. We spent three nights in Mendoza wine-tasting and at the end of each day looked forward to returning to the sanctuary of this lovely hotel..", "title": "Pefect", "user": "SolarVoyager", "date": "April 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60182889}, {"rating": 5.0, "stay_parameters": "Stayed March 2010", "text": "Don't let the fact that the hotel has a casino within the complex put you off. You won't notice it as the casino entrance is situated to one side, off the main lobby. Anyone who has stayed at a Starwood or Sheraton hotel anywhere in the world will know what to expect here. The rooms are standard, reasonably-sized, comfortable rooms, with good air-conditioning and nice bathrooms with good water pressure and amenities. Apart from a lack of English TV channels (as in most parts of Argentina) there were no nasty surprises. SPG Gold status members get a free upgrade to higher floor rooms with views towards the Andes. There are several free computers/wi fi situated near the main bar on the reception/main lobby level. There is a nice pool with sundecks, and the gym is surprisingly well equipped and large. The advantage of this hotel over its main competitor, the Park Hyatt, is that this is a high rise building with great views from rooms on the upper levels. Our room was on the west side of the building (i.e. the same side as the front entrance) and you get a nice view towards the Andes mountains and over the city. Like the Hyatt, this hotel is very close to the town centre where the shops are. The centre is marked by a pedestrian promenade with many stores, including tourists stores selling local handicrafts and leather goods. The pedestrian mall is a 5 minute walk from the hotel. There is a small store right across the road where you can buy bottled water and snacks and avoid the higher priced mini-bar. Unfortunately, all the good restaurants are closer to the Hyatt, which is a 15 minute walk away. Still, it is a pleasant walk and a great opportunity to people watch. Mendoza is a small, pretty, safe, leafy and walkable town with great weather in March. The hotel staff are friendly and efficient, and the breakfast buffet is more than adequate. It is a great place to base yourself for touring the wine area (and I highly recommend Ampora Wine Tours in this regard) and I enjoyed coming back here after a long day out. No complaints at all about this hotel. In comparison to the hotel prices at the Park Hyatt, the Sheraton is much, much better value and offers the same 5-star service and quality. If I ever return, this is where I will stay and I recommend it to you.", "title": "Really enjoy our stay during the Wine...", "user": "ycheng8", "date": "March 8, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 58068394}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "Outstanding service. Spacious modern room (our room was on the SPG floor) which was beautifully clean.", "title": "1st Class Service", "user": "texacaliwines", "date": "March 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 57909876}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We stayed 3 nights in the Sheraton as a base for our wine touring in Mendoza. The hotels location is perfect; approx 3 streets away from the centre of the town and close to all shops and restaurants. The hotel itself is ok only. We found check in to be quite slow but the staff are very friendly and helpful, in particular Gabrielle & Bruno were wonderful to deal with.", "title": "A Comfortable Stay in a Good Location", "helpfulness": 3, "user": "mgirishrover", "date": "July 13, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 70739057}, {"rating": 4.0, "stay_parameters": "Stayed February 2010", "text": "We upgraded on our arrival to an executive room. The room was very comfortable, blissfully quiet with incredible views of the Andes. Our only issue with our room was that the toilet seat in our bathroom was soiled. I went down to the reception and asked the gentleman if he could send a member of their cleaning staff to sanitise the seat as this had not been done before we checked into this room. We went out and came back a number of hours later and the toilet seat had not been cleaned. It was disgusting. The cleaning staff seemed impatient; on the morning of check out, they knocked on our door at 8 a.m. to clean our room!!! Needless to say we were not going to leave at that hour of the morning!", "title": "Great Room and Lounge", "helpfulness": 2, "user": "TravelCuties", "date": "June 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 66480300}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "There was little atmosphere in the hotel, perhaps because we went to Mendoza off-season but in saying that it is a massive hotel to fill. The breakfast was fine, a selection of cold cuts, cheese, cereal and muffins. We didn’t eat in the hotel apart from breakfast as on the first night of our stay we discovered the amazing Q Grill Bar in the Park Hyatt, it was delicious and very reasonable for the quality of food served. On the second night of our stay we ventured away from the Q Grill unfortunately and ate at Francesco Ristorante Barbera. I would not recommend this restaurant, its incredibly rushed, expensive with very dour waiting staff and worst of all, the food isn't great.", "title": "Amazing Staff", "helpfulness": 5, "user": "Jemimagold", "date": "June 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 66432982}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "In general the hotel is fine, nothing amazing but certainly not a bad hotel either. Between the Sheraton and the Park Hyatt these are probably the better hotels to stay if travelling to Mendoza. The Park Hyatt is beautiful but it is a bit more expensive, the Sheraton is a good alternative for those on a tighter budget.", "title": "NIce modern hotel (with strange room design), pleasant staff", "helpfulness": 2, "user": "rogo57nyc", "date": "May 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 63260389}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "From DH: stayed on and off for 10 days around Aconcagua climb. Nice new hotel with cool casino, good gym facilities, nice indoor pool. Good breakfast buffet selection, but nothing delicious. Normal, nice Sheraton bedding. Flat screen television, walk-in shower. Be careful if sharing - semitransparent view into the bathroom can be a little awkward :) Lounge was pretty good, but not very generous - cheese plate with one free drink. No city noise issues. Close to the bus station and airport - both about 5 minutes by taxi. Located in the southeast corner of town so we had about 15 minute walk to the tourist area.", "title": "Excellent hotel choice", "helpfulness": 3, "user": "jimkellster", "date": "April 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61855187}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Great service Deborah at front desk really nice and helpfull .", "title": "Almost perfect", "helpfulness": 1, "user": "fred_de_paris1", "date": "December 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51154443}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Actually all staff are nice and give you excellent service.", "title": "Good choice", "user": "detraveler_7", "date": "December 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 50889449}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "This hotel is completly NEW !", "title": "Nice hotel, great service", "user": "Val M", "date": "December 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 50450883}, {"rating": 5.0, "title": "Elegance in Mendoza", "text": "Suite are very nice i got the 1114 with nice mountain view ...", "user": "747/400", "date": "November 4, 2009", "id": 48493129}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The Mirador restaurant on the top floor (17 floor amazing city view) great food .", "title": "Excellent Hotel", "user": "dafink", "date": "November 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 48371094}], "location": {"country": "Argentina", "region": "Cuyo", "continent": "South America"}, "stars": 4.5, "variance": {"poor": 18, "average": 39, "very good": 125, "terrible": 10, "excellent": 99}, "slim_ranking": 0.274725274725, "description": "Located in the heart of Mendoza City in the foothills of the Andes, the brand new 5-star Sheraton Mendoza Hotel is ideally located for exploring one of Argentina's most popular tourist destinations. Whether you're interested in quiet pursuits-like sampling the region's famous wines-or more adrenaline-fueled adventures such as skiing, hiking, and mountain climbing, you'll feel at home at the end of each day in our 180 comfortable and classic guest rooms. Each features a beautiful view of either the city or the mountains, plus all the comforts of home-including our Sweet Sleeper (SM) Bed."}