{"user_rating": 4.0, "review_count": 273, "name": "Sheraton Bellevue", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Great location, friendly staff, the hotel has updated rooms and free internet in the lobby. The rooms have nice LCD TVs, however, the TV channels are not digital, so the quality is not HD. The club level lounge is nice but a little small. I would definitely stay again.", "title": "Nice clean updated hotel", "user": "businessTraveller301", "date": "July 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135251270}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "this is a great hotel with super friendly staff. rooms not your biggest, but its clean and comfortable. this is a hotel you can count on. happy to recommend this to anyone looking for a cozy stay on business.", "title": "preferred hotel when im in seattle", "user": "wenTaipei_Taiwan", "date": "July 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 135036583}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Overall it was a good stay - good location within 10mis walking distance of most corporate offices in Bellevue. The Beds are great - very comfortable.", "title": "2 night Business stay - Club floor product", "user": "Stephen M", "date": "July 13, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 134314699}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "The only negative to the stay was the experience of the Club Floor product. I upgraded to the Club level to get a) internet included and b) breakfast included - as there are no cafes nearby to get something.", "title": "Some good things but mostly just okay", "helpfulness": 1, "user": "randomj", "date": "June 27, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 132917820}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "I would not upgrade next time based on the poor quality of the experience in the Club Lounge. What disappointed me the most was that only plastic cutlery and plastic cups were available. Definately not what I was expecting and felt very 'school lunch hall'. The selection of breakfast food was very minimal as well. The proper breakfast (full cooked option) is served in the main hotel restaurant and this is what I would go for next time.", "title": "Good clean hotel in an expensive town", "helpfulness": 1, "user": "Samuel H", "date": "June 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 131644373}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We found a great deal on the Starwood website for one night during the Labor Day weekend using the AAA rate. Staff were friendly and helpful at the front desk. We checked in at 3:20pm and sadly our room wasn't ready (and the couple beside me didn't have their room ready either). I had requested an earlier check in at 1:30pm and thank goodness we didn't arrive then! As check in is at 3pm this was disappointing. When asked what could be done the front desk person was quick to accommodate with a very small corner room (very small!) which was ready and she offered me extra Starwood points which I graciously accepted along with an improved breakfast over the one that came with the room. For my husband and I this was fine but the room was very tight and I was thankful it was only for one night. The outside of the property is quite tired but once inside you are greeted with Starwood hospitality. For the value I would stay here again but the Westin Bellevue (up the street) is definitely a big step above if you are looking for a more upscale property.", "title": "Good value and met my expectations", "user": "momofthecs", "date": "September 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 139376502}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "The Sheraton is an OK property. The staff was very polite and helpful. Free parking outside was nice. I stayed on the club level on a holiday weekend. The price ($162+tax/night) was a little high for rooms that did not have either a safe or a mini-refrigerator, especially since there isn't anyplace within a couple of blocks to pick up food to snack on in the room. There are two restaurants next to the hotel; I did not try either one. The club level saved money by having the Wi-fi free, but the lounge snacks were all gone every time I went by to try to get a snack.", "title": "Missing some pieces for the price", "helpfulness": 1, "user": "DrDavidC", "date": "September 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 139213305}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "To be honest, if you have a few more dollars, i would stay at the Hyatt in Bellevue. Much nicer.", "title": "Clean, Comfortable and Great Value", "helpfulness": 1, "user": "Dhoom13", "date": "August 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 137844185}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "The building looks fine like the reviews say but the inside is well decorated and planned out. Free parking, good efficient front desk, clean well appointed rooms. The elevator and hallways seem smaller than normal so I assume its an old building but you wouldn't know it from the looks and upkeep.", "title": "Quite nice on the inside", "user": "bimarian", "date": "August 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136897365}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We had a special rate that gave us a $100 gift card for Macy's. That made the room amazing value. I forgot about the card but the desk staff drew my attention and went to get it. I thought that was very nice.", "title": "Another Great Stay", "user": "BCtraveler44", "date": "August 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136761188}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "From outside it just looks like worn out hotel but property has good interiors.", "title": "Excellent Option in Bellevue", "user": "SachinA", "date": "August 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136522718}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Rooms are clean and bed is very comfortable. Free parking is of course a bonus.", "title": "Loud air conditioning kept me up all night", "user": "sfrunner", "date": "August 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 4.0, "location": 2.0}, "id": 135990884}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "I like my stay and wont mind staying again.", "title": "Perfect location to catch a Mariners baseball game", "user": "TravelRichard", "date": "July 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 135741859}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "I almost always stay at Starwoods when I travel. When I'm in Bellevue I usually stay at the Westin but thought I'd give the Sheraton a try because my usual hotel in the area is closed due to fire damage, I have been trying new hotels for the last several months. The Sheraton Bellevue looks run down from the outside but is nicely remodeled inside. It is a little bit further from the downtown area so you are better off with a car. The staff was very friendly and my bed was very comfortable.", "title": "Bargain in Bellevue", "user": "flygirl926", "date": "July 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 135639659}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "The biggest problem was the air conditioning. It would buzz really loudly every 10 minutes and wake me up. Yes, I know air conditioning makes noise, but this wasn't your usual noise. It was a low rumbling buzz which meant I got no sleep. I even got up to inspect whether my phone was buzzing, whether something was loose in the air con unit, or if something was sitting on top.", "title": "Old hotel.. great location but OLD hotel", "user": "Alex V", "date": "July 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 135555989}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "If first impressions were all we had to go on, I'd say this old girl is 2 and location (by the freeway) is a 1 but when you enter the lobby and receive fabulous service from the staff (including complimentary chocolates) your second impression quickly turns into something special. We were using our free night and points and were automatically upgraded (didn't have to ask!) to the Club floor. The room was lovely, completely renovated and very comfortable king size bed. The Club Lounge was getting new carpet installed so we were provided coupons to have appetizers in the restaurant. Good selection and value - the sliders on the appy menu were my dinner! The next day we went shopping and were caught in a downpour. A quick call to the hotel and the concierge rescued us in five minutes! Club lounge breakfasts both morning were more than adequate. Overall a very good stay. Only caveat is that our room backed on to the lounge and therefore, we could here the morning prep starting at 6:30. We are early risers so it wasn't terrible but I advise the hotel to book room 720 last and let guests know they will be woken up early!", "title": "Don't judge a book by its cover", "user": "mmccormi", "date": "October 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 143465882}, {"rating": 3.0, "title": "Decent, Nothing Special", "text": "I typically stay at another property when business brings me to Bellevue, but a major convention had that property (and several others booked), making me thankful I found a room at the Sheraton!", "user": "brmusicman", "date": "October 18, 2012", "id": 143165845}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Overall, it was fine, although not a particularly a good value given the room rate paid (which was, I think, partially a function of the convention being in-town and creating high demand for rooms). My room was clean, the desk was large with good lighting, and the bed was fantastically comfortable.", "title": "Fantastic Staff, Amazing Service, Excellent value", "user": "Sitaraman M", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141193809}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "I was placed in a pretty small room (a function, I think, of booking late), but the front desk staff was upfront about this and check-in and kindly offered a few bonus SPG points and complimentary breakfast to apologize for the less-than-stellar room location. I thought that was a thoughtful gesture, and pretty proactive. Kudos to the staff member who checked me in; he was friendly, efficient, and helpful.", "title": "Although it carries the Sheraton name...it's really barely a Sheraton", "user": "TheWinFin", "date": "September 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 140818393}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The hotel isn't the fanciest; it's an older property and, although it appears to have been renovated a few times, it's hard to overcome some of the limitations of the older design (i.e., very small elevator lobbies). A few of the hallway surfaces were beaten-up; the room was in better condition. Hard to say if it was my small-ish room or would be true in all rooms, but I found much of the furniture oversize for the space, meaning the room felt more cramped than it needed to.", "title": "Hotel was fine for the $$, but customer service stellar.", "helpfulness": 1, "user": "DrewM", "date": "September 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 140112936}], "location": {"country": "United States", "city": "Bellevue"}, "stars": 3.5, "variance": {"poor": 15, "average": 50, "very good": 104, "terrible": 8, "excellent": 96}, "aka": "Sheraton Bellevue Hotel Bellevue", "slim_ranking": 0.36, "description": "Sheraton Bellevue Hotel offers free shuttle service to Microsoft Campus and area corporate offices. Our accommodation has 8,000sq ft of meeting space and is near Meydenbauer Convention Center."}