{"user_rating": 3.5, "review_count": 2050, "name": "Sheraton Fisherman's Wharf Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "I stayed at the Sheraton Wharf in November with my wife, mum, dad, brother and his partner. To sum the hotel up in one word I'd use................BRILLIANT!!!!!!!", "title": "Excellent Hotel and excellent location!!!", "helpfulness": 2, "user": "mdowner", "date": "December 16, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22785485, "likes": {"liked": "— The quality of the bedroom", "disliked": "— Check in staff"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The location of the hotel was great. It was very close to Pier 69 and also the beginning of the Tram line. Getting about was so easy.", "title": "We loved the hotel! fabulous", "helpfulness": 1, "user": "duchesspink", "date": "December 13, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 22708275, "likes": {"liked": "— The comfortable massive bed!", "disliked": "— The deposit held on credit card was too much, especially when room was prepaid"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "The hotel has a nice bar with a great outside seating area with open fire tables.", "title": "Great location, ok hotel", "helpfulness": 1, "user": "Sweetflowers", "date": "December 12, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 22679072, "likes": {"liked": "— Location", "disliked": "— Expensive parking, lame breakfast buffet"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008", "text": "Now on to the most important part, the rooms. The rooms were absolutley brilliant. They were very clean and very modern. We had 2 double beds and and a nice TFT TV. The decor was very bright and fresh and the bathroom had everything you need and again was of a high standard.", "title": "Cool funky hotel in great location", "helpfulness": 1, "user": "Graftarian", "date": "November 29, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 22289571, "likes": {"liked": "— Funky rooms", "disliked": "— Small bathrooms"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "It looked like the hotel had not long since been updated and the rooms were perfect.", "title": "Good locatio", "helpfulness": 1, "user": "pec50", "date": "November 23, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 22110051, "likes": {"liked": "— Comfortable room", "disliked": "— Very expensive car parking"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "This is a busy hotel as it is in a great location but we found it rather tired. The rooms are functional but not what you would expect for the price. The bathroom is tiny. We were given 2nd floor pool view rooms - great we thought. But there are no net curtains and we were on view to everyone lying by the pool. Had the blinds down whenever we were in the room. The kids adjoining room overlooked the street and anyone walking along the pavement could see straight into the room. We also spent forever waiting for the lifts. No usable stairs but we were only one floor up. Did not think this was good value for money but all hotels in San Fran are expensive. On the positive side the staff were all friendly, great concierge and good overall service. My suggestion - keep the staff but build a new hotel.", "title": "Good location but rather tired. You spend your holiday waiting for an elevator.", "helpfulness": 1, "user": "paulc004", "date": "July 13, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 2.0, "service": 4.0}, "id": 115324024}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "We booked this hotel as our first stop in a 4 city tour.", "title": "Wonderful overall.", "user": "PolarYorkshire", "date": "July 11, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 115249878}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The location is central but quiet, the check in was easy and the room was roomy & light.", "title": "Situated in a fantastic position at Fishermans Wharf", "user": "julieandpaul2009", "date": "July 11, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 115236199}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "No complaints except the lack of free Wi-Fi in the room although the free service in the lobby was really efficient.", "title": "Loved it.", "helpfulness": 1, "user": "MandyH37", "date": "July 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115220860}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We spent 5 nights at this hotel and it proved a brilliant start to our USA holiday! The hotel is situated in a fantastic position at Fishermans Wharf and was both convenient and a good base for exploring San Francisco! The decor and cleanliness of the rooms were of a very good standard and the fire pits were a real welcoming touch! The only down side was the room we were given was a little noisy, however as you are in the heart of San Francisco it can be expected.", "title": "Beautifully refurbed and great facilities, pity about the wifi", "helpfulness": 1, "user": "mateybubbles1605", "date": "July 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115201879}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "Really like this hotel. First time I've been with my family and we had a great stay. The decor is a bit touristy with the nautical theme but fine and bright.", "title": "Christmas", "helpfulness": 2, "user": "SL.123", "date": "January 10, 2009", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 23431216, "likes": {"liked": "— Location", "disliked": "— Only having an outdoor pool"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008", "text": "The location is great for Fishermans Wharf and the boat trips. Cycle the Golden Gate is a fun half day for all ages. Its not too far a walk to Lombard Street and you can catch a trolley from here to Union Square. The trams are a cheap and easy way to get around with a station on the corner of the hotel.", "title": "good stay at the Sheraton", "helpfulness": 1, "user": "CRSurfer", "date": "January 4, 2009", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 4.0, "value": 4.0, "rooms": 4.0}, "id": 23239444}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The staff hare always friendly and helpful as you'd expect. Didn't eat in the hotel so can't comment.", "title": "Great location!!", "helpfulness": 1, "user": "sanrou", "date": "December 30, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 23106895, "likes": {"liked": "— The location", "disliked": "— parking"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled on business", "text": "When I return we might try further down the Embarcadero just for a change, it seemed quite lively with the market.", "title": "Business at the Beach", "helpfulness": 2, "user": "Craxiter", "date": "December 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 3.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 23024322, "likes": {"liked": "— Tazo tea and the attention of the staff in giving me extra tea bags!", "disliked": "— no free wireless throughout"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "For a first time visit I don't think you could get much better.", "title": "A lovely hotel in an ideal location!", "helpfulness": 2, "user": "Gayle32", "date": "December 19, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 22846413, "likes": {"liked": "— Gorgeous rooms & ideal location", "disliked": "— Charges for the car park & the telephone in the room"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "This hotel is in a great location. Two blocks from Fisherman's Wharf. We were able to walk everywhere from this location. The bathroom is like everybody says - you have the tub and toilet in a little room with the vanity outside - but we didn't care. The bed was great - slept pretty good. One problem we had is the people in the room next to us were smoking as we were in a non-smoking area. It was actually making me ill - we told the front desk and they sent up security. They must have taken care of it because I never smelled it again. We really enjoyed ourselves.", "title": "Enjoyed our stay", "helpfulness": 3, "user": "stubbytoes", "date": "March 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 7007825, "likes": {"liked": "— Within blocks of Fisherman's Wharf", "disliked": "— Bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "Stayed over New Year's Eve with other friends. VERY convenient location. Just blocks from the water. Would be a great spot for tourists to stay. Clean rooms, but a little on the small size. Bathrooms are bit small as well. It's one of those where the vanity is in the little closet sized space between the entry door and the shower/toilet bathroom. It's a little on the tight side. I would've expected a little more for a Sheraton - but they can be hit-or-miss sometimes.", "title": "Great Location", "helpfulness": 1, "user": "Wuah", "date": "March 2, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6900868, "likes": {"liked": "— Location", "disliked": "— Room Size (small)"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Lobby is nice. Staff is friendly. Convenient to not only all the SF tourist areas in the Wharf, but there is also a Safeway conveniently located across the street, which is always nice for extended stays.", "title": "Pass on this place. You'll be glad you did.", "helpfulness": 1, "user": "Lacey_U", "date": "February 22, 2007", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 1.0, "location": 3.0}, "id": 6830817, "likes": {"liked": "— The location close the tourist areas, walking distance to a lot", "disliked": "— EVERYTHING ELSE"}}, {"rating": 3.0, "title": "Too much money for too little", "text": "Not a big fan of Valet only parking, and the parking prices are pretty steep, even as a guest - but I guess it's like that everywhere in San Francsico anyway.", "helpfulness": 1, "user": "Twisterman", "date": "February 3, 2007", "id": 6738896}, {"rating": 3.0, "title": "Great location, good price", "text": "I’ve never written a review before, but this hotel is bad enough that I’ll take the time. $279/night for the room + $38/night for parking? I don't think so. Fortunately, we got it for MUCH cheaper off Hotwire, but even then it was almost on par with a Super8 I've stayed at. Problem #1. The Room. I am a non-smoker, but will take a smoking room if that's all that's available because I've NEVER had the smell in the curtains/carpet/furniture bother me in the slightest - this place was ridiculous. The hallway smelled like the morning after a frat-party; stale beer and cigarette smoke. The room itself wasn't quite as bad (no beer smell), but the cigarette smell was cloying. It even was enough that my ex-smoker boyfriend mentioned it a few times. This was the worst I'd ever smelled. I have to wonder if they've EVER opened a window. Also, the bathroom candid photos you see on THIS site are dead on. TINY, dark little closets of bathrooms. Problem #2: The Concierge. They tried to get us to go to a timeshare sales pitch!!! Unreal! I just told you I'm in town for only two days, and you want me to go spend my afternoon getting the hard sell for a time share? Also, the restaurant recommendations were totally sub par - don't take their word for anything. Problem #3. I asked the reservations desk if they knew what the parking restrictions were for the metered parking on the street (we read the meters and walked up and down both sides and didn't see a single sign that explained when it was enforced). He responded very clearly that it was monitored 7AM to 7PM Monday through Friday. Since it was already after midnight on Saturday, we left the car at the meter and went on our merry way. Sunday afternoon we came back to a $40 parking ticket. The sad part is that it ended up being cheaper to get the parking ticket than to pay what the Sheraton wanted to charge me. I will NEVER stay there again, you shouldn't either.", "helpfulness": 4, "user": "AdvisorKing", "date": "January 21, 2007", "id": 6636562}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Tried the Marriott, Holiday Inn and the Best Western but only the Sheraton San Francisco Fisherman's Wharf could do it right!", "title": "Great for the Family", "helpfulness": 1, "user": "Traveurcpl", "date": "November 11, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 21732815, "likes": {"liked": "— It was Clean and Friendly", "disliked": "— The noise outside, closing the windows in July was not a great option (yes they had A/C but that gets old after awhile)"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The receptionist (Andy?) was wonderful and got us a great price and an even better room. It is in the middle of the action on the Wharf. Great for a family, safe and convienant. Parking was extra. We decided not to do the Breakfast so we went to star-bucks instead. The remodeled rooms and exterior is very nice. The area is loud, but hey its S.F.", "title": "Very disappointed in \"upgrade\"", "user": "Travellers007", "date": "November 10, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 21720337, "likes": {"liked": "— Comfortable bed and close to attractions", "disliked": "— Hotel's upgrade was a downgrade"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled solo", "text": "The staff was very nice and helpful.", "title": "Close to Fisherman's Wharf", "user": "hydepark", "date": "October 28, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 21352550, "likes": {"liked": "— Room service breakfast", "disliked": "— Can hear guest above me"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We would stay there again", "title": "Stay well away from this one...", "helpfulness": 1, "user": "TS330", "date": "October 28, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 2.0}, "id": 21338849, "likes": {"liked": "— Didn't catch anything and beds were comfortable", "disliked": "— Location, value for money, service"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "My husband and I spent one night at the Sheraton Fisherman's Wharf in October 2008. We had also stayed at the property 6 years ago. Apparently the hotel was \"upgraded\" since we last visited, but in our opinion the upgrade was a drastic \"downgrade.\" The hotel has lost its classy feel of a Starwood property. I think the look they were going for was somewhat of a modern \"beach\" feel, but it ended up seeming cheap and poorly done. The room was comfortable and the bed was excellent but all in all it definitely was not worth the price. The brunch was terrible-poor selection and the quality of food was worse. The coffee was bitter-I like a strong coffee, but this was beyond strong! The hotel does have a great location-1 block off of Fisherman's Wharf piers, and it's great to leave your car there while you walk around the area. I guess I just expected the excellence that Starwood properties are known for....and its gone!", "title": "new and improved", "helpfulness": 1, "user": "explorerUSA", "date": "October 24, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 21182855, "likes": {"liked": "— theme and location", "disliked": "— parking fee"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "This is an outstanding hotel with a great location one block from the Wharf. The rooms are large and well appointed with a plasma TV. The staff was extreme;y friendly and very helpful. The concierge was outstanding and set up a very nice Napa Valley wine tour. Also, her recommendations for local seafood restaurants were right on. Located within one block is a Safeway and Trader Joe's for snacks and beverages. Appetizers and drinks here are very expensive. We bought our own and enjoyed them by the fire pits out side by the lobby doors. The fire pits are really fun for cocktails and snacks-like an outdoor room:) No one hassled us about bringing our own food and beverages,but the opposite and seemed glad we were having a good time. The breakfast buffet was $21/person and the breakfast deli ran $10/person. Across the street is an IHOP-better deal.I would have given this 5 for excellent except for the parking fees. We did not have a rental car except for one night and found out that parking here will cost $45/night. My son found a place for half that across the street, but come on $45-for guests/night--DO NOT BRING A CAR HERE UNLESS MONEY IS NOT A CONCERN.", "title": "Very Nice with Great Location and Staff!!! $45/night Parking-Ouch!!", "user": "guffin", "date": "November 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22104540, "likes": {"liked": "— location", "disliked": "— parking costs"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "Stayed here recently with my other half. Found alot of the hotels in San Fran to be pricey. The hotel and room is very modern. It was comfortable, but there is a dodgy green/blue colour in the room which makes it feel cold. Parking is not complimentary, and is approx $50 a day in hotel car park. I would recommend to go accross the street to a public park, which is about $25 for 24 hours parking. Wifi was not free either in the rooms. The staff were not particularly over friendly either. They just did their job, and really didn't put anything extra into their work.", "title": "Ok hotel in pricey San Francisco", "user": "sean_e78", "date": "November 22, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 22083921, "likes": {"liked": "— Comfortable rooms", "disliked": "— Charges for everything, staff's lack of enthusiasm"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "I am a frequent hotel guest for Sheraton/Westin/W and this by far was the worst stay in my life. The location was not bad, really accessible to Pier 39, The Embarcadero and North Beach. The HDTV was nice and the room was nice. But that wasn't enough to make our stay any pleasant at all. The minute we got there and was informed that the daily parking was $43 plus tax. Turned out to be $49 a night just for parking. That was pathetic. I've never parked anywhere in san francisco where parking was over $30. This ruined everything. I don't know, it didn't seem like the parking fee caused any complaints. I just wanted word out to whoever is going to make a future booking here, to be aware of the close to $50 daily parking fee. This was BS.", "title": "Ridiculous Hotel", "helpfulness": 2, "user": "alervin81", "date": "November 16, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 2.0, "location": 5.0, "value": 1.0, "rooms": 4.0}, "id": 21913363, "likes": {"liked": "— Location", "disliked": "— Ridiculous $49 daily parking fee."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The room was very modern and colourful. The bed was huge and very comfy. There was Starbucks coffee in the room for you to brew yourself. The bathroom was a little small but very clean, nice towels and the free shampoo's etc were very good quality.", "title": "3rd leg of my Honeymoon - Hotel Review", "helpfulness": 1, "user": "AMP111008", "date": "November 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 21908088}, {"rating": 1.0, "stay_parameters": "Stayed November 2008", "text": "The staff were very friendly and helpful. The bar was a little pricey but once we had our drinks there were lovely firepits outside to sit round.", "title": "Very disappointed", "helpfulness": 1, "user": "yole", "date": "November 15, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 21868860}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "Room service breakfast was great. I ordered it the night before and it arrived on time. Everything was delicious.", "title": "Good hotel. Great Location!", "helpfulness": 1, "user": "ashtilman", "date": "October 21, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 21077881}, {"rating": 2.0, "title": "Wouldn't really recommend unless you get a GREAT deal", "text": "We arrived to find that our room was on the street level and EXTREMELY loud with tour busses right outside our window. In addition the room was quite small. Went back to the front desk and inquired about a quieter room and was told nothing was available since the hotel was under construction. Ultimately we were offered an upgrade to a quiet, larger room for $50 plus tax. He could tell we were unsure so he offered to throw in breakfast. The new room was quiet although hardly larger. Breakfast the following morning consisted of coffee, some pieces of fruit, a few croissants and some cold cereal in the concierge lounge. The gentleman in charge there was extremely rude. At exactly 10:00 he proceeded to kick everybody out, even those who were still eating their breakfast. We ended up grabbing a banana and a cup of coffee on our way out. Overall it was ok, but hardly worth the $200/night we ended up paying.", "helpfulness": 4, "user": "tropicaldreams", "date": "January 26, 2005", "id": 3088876}, {"rating": 5.0, "stay_parameters": "Stayed January 2005", "text": "Firstly, I would like to say to all you people who have moaned endlessly about The Sheraton Hotel - GET A LIFE!", "title": "Brilliant Holiday at the Sheraton!", "helpfulness": 6, "user": "Monkey54", "date": "January 10, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 2992966}, {"rating": 3.0, "title": "Sheraton Fisherman's Wharf OK", "text": "My family and I stayed at The Sheraton in Fisherman's Wharf from 27 Dec 2004 to 3 Jan 2005 and were initially very worried due to all the negative reviews which had been posted on the TripAdvisor website. At the end of the day, we came to the conclusion that there are obviously people out there who just like to simply moan about anything and everything. Well, our advice to you guys is to JUST IGNORE THE NEGATIVE REVIEWS!!", "user": "A TripAdvisor user", "date": "January 4, 2005", "id": 2974461}, {"rating": 4.0, "title": "Good location", "text": "We were called in the UK prior to our flight to warn us that renovations were currently being done at the hotel and that there would be some scaffolding up and around the outside of the hotel. Virgin advised us that the hotel staff were trying to move people around so they didn't have a scaffolding view.", "helpfulness": 2, "user": "edcoulter", "date": "January 2, 2005", "id": 2971256}, {"rating": 4.0, "title": "Most Comfortable Beds Ever", "text": "We arrrived after a 10 hour flight at 15.00hrs (which was 11pm UK time) and were feeling pretty tired. I asked Edita on Reception if there was any chance of an upgrade. She obliged straight away! She was very helpful and we were checked in within 10 minutes!", "helpfulness": 2, "user": "Sdevisse", "date": "January 1, 2005", "id": 2968702}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Rooms are great - clean, funky and fun. Easy check-in and out. Outside they have gas fireplaces with sitting areas. This is a terrific place to hang out BUT FOR THE SMOKING. The hotel staff looks the other way even though smoking is against CA law 20 feet from the building. This ruined an otherwise great experience.", "title": "It would be excellent if they enforced no-smoking", "user": "skipper0857", "date": "October 9, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 20751374, "likes": {"liked": "— location, cleanliness, smart looking lobby and rooms", "disliked": "— staff permits smoking outside in nonsmoking areas"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Great location. Nice modern & spacious rooms.", "title": "Great Location", "user": "rubadubs", "date": "October 2, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 20556234, "likes": {"liked": "— Its Location", "disliked": "— Drinks cost in bar"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "close to Tram terminal & Pier 33.", "title": "Great as a base.", "user": "speciallady", "date": "September 30, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 20501469, "likes": {"liked": "— Location", "disliked": "— Bar prices!"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "We stayed here for 3 nights on our way to Hawaii from the UK. It was an excellent base for the Bay Area and within walking distance to most of the sights and Pier 39 ofcourse. We ate at the IHOP across the street which served a good breakfast at reasonable prices, the hotel its self was clean and modern, the staff were helpful and friendly even the ones we didnt tip! We would recommend it as a base to stay in the bay area. Cant comment on the food as we didnt eat there,much more choice and cheaper out in the town.", "title": "very convenient location", "user": "buddahOregon", "date": "September 25, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 20358608, "likes": {"liked": "— concierge", "disliked": "— lack of regrigerator in the room"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "$200 per night including service charge is moderate.", "title": "Great management staff, but the night wine bar staff has an attitude", "user": "Cruiser63", "date": "September 22, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 20286089, "likes": {"liked": "— The management staff", "disliked": "— the service at 'Espressi'"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "We stayed for 5 nights and were very happy with it. Our room was on the ground floor, which is excellent for older people. The location suited us very well as it was near great seafood restaurants and public transport was plentiful. The buffet breakfast was great, plenty of fruit and a large selection of cooked dishes. The coffee machine in the bedroom was a godsend, as it was simple to use and produced good coffee.", "title": "Excellent Location", "helpfulness": 2, "user": "Sean18", "date": "March 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 13994371, "likes": {"liked": "— Great beds", "disliked": "— Draughty in public areas"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "Altogether a good visit.", "title": "Perfect place to stay", "helpfulness": 1, "user": "grrbrrbaby", "date": "March 1, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 13970398, "likes": {"liked": "— The quality of the room and the convenient location of the hotel", "disliked": "— The view, although it really was not a problem."}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "We just returned from a stay at the Sheraton from 2/26/08 - 2/29/08 and were very pleased. Our room was small but extremely comfortable. It had obviously been recently updated as the decor was quite modern -- very bright colors and eclectic. The bathroom was small as some reviewers have said, but it was fine for our needs. The room was very quiet. The view was awful (the rooftop below) but we didn't care since we were not in the room much during the day. There was a huge digital TV in the room too. The only noise we heard was footsteps overhead. One night at about 4 AM the fire alarm went off (false alarm) which rattled us a bit, but the hotel staff was very apologetic about the disturbance. The hotel was extremely conveniently located to Fisherman's Wharf and was within walking distance of many attractions (Pier 39, Alcatraz, Ghirardelli's Square, The Cannery, the cable car turn-around) and many restaurants. There is a Walgreens, an IHOP and a grocery store within a block. The hotel had a great seating area out front with gas fireplaces where we were able to relax and have a glass of wine after a long day of touring. I would definitely book at the Sheraton again. We got a great deal through Funjet and were thrilled with the trip. If you want a clean, comfortable, convenient, reasonably priced hotel, this one is it.", "title": "Fantastic", "helpfulness": 2, "user": "SydneyFamilyMum", "date": "March 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13968242, "likes": {"liked": "— Fantastic rooms and staff", "disliked": "— N/a"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "I would like to say that this hotel knows how to provide outstanding and professional service to families. The hotel staff went above and beyond to meet all our child's needs. The management also brought a microwave to the room to assist with heating babies bottles.", "title": "Great location, average hotel", "helpfulness": 2, "user": "pengwinn", "date": "March 1, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 13960094, "likes": {"liked": "— Location", "disliked": "— Kinda old, pricey for the quality"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The room was modern, clean, spacious and comfortable. Staff were always polite, professional and willing to go the 'extra mile'. The concierge prints requests within minutes and is fluent in many languages.", "title": "Don't judge a book by it's cover!", "helpfulness": 3, "user": "melTravel04", "date": "February 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13935949, "likes": {"liked": "— Great interior, great loaction. Concierge staff was phenomenal and would take care of everything!", "disliked": "— Parking costs."}}, {"rating": 4.0, "title": "Sheraton Okay", "text": "Just got back from a wonderful time in San Francisco. The hotel was okay-a little run down as stated in the other reviews but overall it was fine. The location was excellent and everyone was helpful. Other hotels that looked very nice and close were the Best Western Tuscan Inn (I don't know the price, but it look wonderful for a Best Western), Radisson and Holiday Inn. These surrounding hotels looked newer from the outside. If the price is the same, I'd say go to a nicer hotel. The hotel is simply okay. I have a 5-yr-old son and the location is excellent for the little ones. San Francisco was just as great as everyone said it would be.", "user": "A TripAdvisor user", "date": "November 22, 2004", "id": 2839417}, {"rating": 1.0, "title": "Save your money", "text": "On our way home from Disneyland, we decided to splurge a little, and stay at a 4 star hotel in San Francisco over the Halloween weekend. This was a mistake. If only we had researched the San Fran hotels as much as we did for Disneyland.", "user": "tl", "date": "November 9, 2004", "id": 2813985}, {"rating": 1.0, "stay_parameters": "Stayed July 2004", "text": "The only thing this place has going for it is it's location, and rather comfortable beds.", "title": "Should be Motel 6", "helpfulness": 1, "user": "JohnLIrvine", "date": "November 4, 2004", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 2806031}, {"rating": 3.0, "title": "Could have been better", "text": "The $200/night room gave us a somber view of a bus terminal, complete with garage that had those deisel engines firing all night. My inquiries into another room were met with little or no concern, with the clerk advising me that there were no view rooms available due to the height and location of the hotel. But surely there must be something away from the bus terminal...but no. The room itself was small, and lacked a fridge and microwave ( a necessity when traveling with kids). The toilet didn't work properly, the halls smelled of smoke, there were cigarette butts on the ice/vending room floor. The restaurant food was a joke for the cost, even the bartender had trouble mixing a simple cocktail (2 tries, gave up and got help).", "user": "gflohlm", "date": "October 31, 2004", "id": 2798540}, {"rating": 5.0, "title": "Best Place to Stay", "text": "The concierge was kind enough to give us directions to a dim-sum restaurant that had been closed for a week due to renovations.", "user": "A TripAdvisor user", "date": "October 20, 2004", "id": 2764437}, {"rating": 5.0, "title": "Fantastic hotel!", "text": "We stayed for two nights in February and had an absolutely wonderful time.", "user": "NicoleandKyle", "date": "April 2, 2008", "id": 14753612}, {"rating": 5.0, "title": "Great Hotel", "text": "The pros: Lovely and bright room, hotel was just renovated so everything is brand new. Was upgraded due to points and had a club room. Big, beautiful bathroom and very comfortable bed and sofa. LOVED the outdoor fire pits - very cozy to have a glass of wine at and still be outside. Fantastic location - you are within a five or ten minute walk of everything at the wharf. Brand new flat screen TV's in the room.", "user": "maxandmazy", "date": "March 28, 2008", "id": 14616805}, {"rating": 4.0, "title": "I recommend it", "text": "The cons: When we were there, still redoing the exercise room, but they gave us free passes to a nearby sports club that was VERY nice, the pool was outdoors and not very heated so we couldn't use that when we were there, not a great selection of food, but there are tons of restaurants once you set foot outdoors", "user": "TravelWarrior", "date": "March 28, 2008", "id": 14597216}, {"rating": 4.0, "title": "Fantastic Location", "text": "We stayed for free this time, but would come back and stay again on our own dollar", "user": "jry-i", "date": "March 13, 2008", "id": 14256991}, {"rating": 5.0, "title": "Great location! Great staff, very helpful. Close to lots of attractions.", "text": "What a great hotel! 2 mins walk to the wharf. Its clean & tidy. The rooms are big and spacious with very comfy beds!! The only down side is the noise - but I do think that happens in every hotel in the wharf area - you just get used to it. The staff are helpful but the concierge is always busy so it maybe best to make your own trip arrangements - we did this and it worked out cheaper. I would definetly recommend this hotel to anyone.", "user": "Boston1471", "date": "March 2, 2008", "id": 14001839}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "Clean and well located hotel only a block from the wharf where all the action is. We did not need to rent a car but were able to walk to everything and the city has excellent transportation. The Grayline tours leave from wharf area just a short walk from the Sheraton. The staff at the hotel were friendly and helpful. Would definitely stay here again.", "title": "Great Location", "user": "alsa412", "date": "September 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 20218869, "likes": {"liked": "— Location and comfortable beds", "disliked": "— Totally satisfied"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Stayed for four nights 5th - 8th sept 08 at the Sheraton, fishermans wharf, a nice stay, nice room, second floor overlooking the pool, comfy bed, bathroom little small but ok, a little noise from the floor above once during stay but no major problem.", "title": "NICE STAY IN SAN FRAN", "user": "TinArma", "date": "September 17, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 20155850}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Desk staff helpful regarding local places to eat in the evening that were not tourist traps, was attending 49ers game on sunday of stay and desk staff were of excellent assistance in directing me to where and which bus I needed to take.", "title": "Peace on the 4th floor", "helpfulness": 1, "user": "SamManchester", "date": "September 15, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20098684, "likes": {"liked": "— Location"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Didnt eat at the hotel, I-Hop across street for a good breakfast, few Italians near hotel and North Beach not a long walk for evening meal and ice-cream after.", "title": "Its great position overcomes a few problems", "user": "BazzaPerth8", "date": "August 27, 2008", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 19407205, "likes": {"liked": "— Its position", "disliked": "— Small batroom"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Evening time tour of Alcatraz a must, smaller numbers and tours from rangers that dont happen during day time.", "title": "Loved the Location and the room!", "user": "holidaysholidays", "date": "August 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 19363474, "likes": {"liked": "— Location", "disliked": "— You have to pay for wireless internet in your room"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Stayed in the hotel on our honeymoon. This is very well located for access to most of the city. Only a couple of blocks away from pier 39, where all the restaurants are. The hotel was very clean and well presented. We were placed in a hotel room on the top floor of the hotel it was very big but had an odd shaped ceiling in the room. This hotel has a business centre to print of those all important boarding passes for free if there is less than 10 of you in your party but not really much good for anything else unless you want to pay the huge price for the code to use the Internet.", "title": "Ideally placed for access to most of the city", "helpfulness": 1, "user": "Mr_and_Mrs_Flowers", "date": "July 19, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 2.0, "value": 3.0, "service": 3.0}, "id": 115544609}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Met up with my sisters and mom, after a short trip to Napa with my daughters. We booked on priceline and got a great price. We had a car for our trip to Napa, and booked with Dollar, as the return place was this hotel. Saved us time and hassle.", "title": "Great place for a 60th", "user": "nanarn", "date": "July 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115542654}, {"rating": 4.0, "stay_parameters": "Stayed July 2011", "text": "We had a king and pullout and my mom and sisters had 2 queens. Our room was on the 4th floor, with an odd slanty window, that overlooked the roof. But it was quiet. My sisters had one on the 3rd floor with the same view. Close to the stair wells, and found a back elevator, near to both rooms that never had any wait time.", "title": "Great location, nice rooms, mediocre service", "user": "scasagra", "date": "July 16, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 115424532}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Had stayed here 10yrs ago, and the place has been updated and given a fresh and modern look. I liked the firepits out front but miss the bar that was in the lobby. Rooms were clean, beds comfy, and housekeeping was outstanding. I also applaud the concierge. It was very busy with lots of international travelers, but they were very accommodating and helpful with directions and tips.", "title": "Great hotel", "user": "WallyWilsonTexas", "date": "July 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115406887}, {"rating": 4.0, "stay_parameters": "Stayed July 2011", "text": "Location is everything with this hotel, Close to the Wharf, across the street from a Safeway, and down the block from Trader Joes. and the Cable Car turnaround", "title": "Excellent location", "user": "Chelso83", "date": "July 14, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 115373623}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "This has to be the worst hotel that I have ever stayed in. On entering the lifts to go to the third floor there was a horrible smell in them. On entering our room there was also a damp smell which you couldn't get rid of. The room was decorated in 1970's style and although clean was very dated and very smelly. The hotel is currently getting refurbished and therefore many of the facilites are unavailable, such as bar, restaurant and swimming pool. Whilst we were there you could use the swimming pool but there was debris floating in it which made it less than appealing. There is a small eating area set up but we didn't use it as there was a large screen TV playing and did not want this whilst eating a meal. The two ladies I encountered on reception were extremely unfriendly, verging on being rude. The was a very helpful gentleman on reception. Guests are charged $41 plus tax which totals $46 to park your car in the car park which I think is very expensive for hotel guests bearing in mind that the hotel is certainly not superior. The only positive thing about this hotel is its location as it's only 2 blocks away from Pier 39 but don't feel this makes up for this very tired, dated and overall unfriendly hotel.", "title": "The worst hotel ever", "helpfulness": 1, "user": "scottieUk", "date": "July 22, 2007", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 8217335, "likes": {"liked": "— location", "disliked": "— hotel"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "My wife and I recently stayed at the Sheraton Fisherman’s Wharf for four nights. It was a last minute trip and so we did not do much shopping around for hotels. The rate that we received at [--] was good for San Francisco. However, the rate of $156 per night should have raised some red flags. The Sheraton Fisherman’s Wharf is a category 4 hotel and so I wrongly assumed that it was along the lines of similar category 4 hotels that I have stayed at in San Francisco, such as the Palace Hotel.", "title": "Not the Nicest Sheraton", "helpfulness": 2, "user": "J_Points", "date": "July 5, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 3.0, "rooms": 1.0, "location": 4.0}, "id": 8064137}, {"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The hotel quality did not live up to the Sheraton name. The service was good as one would expect from a Sheraton and the location was excellent. The hotel is only two blocks from Pier 39, five blocks from Columbus Avenue in North Beach, and within walking distance to the Embarcadero.", "title": "terrible public relations", "user": "green/gold", "date": "May 30, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 7721957, "likes": {"liked": "— location", "disliked": "— dirty looking, no communication on problems"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "If you need to rent a car in San Francisco, it would be my suggestion to rent the car from Dollar, which is located in the hotel, by the day. Parking at the hotel is extremely expensive. My wife and I rented a car twice from the location at about $35 per day and we did not have to pay the overnight parking fee at the hotel.", "title": "Good for Starwood Points people, otherwise...", "helpfulness": 6, "user": "raphael528", "date": "May 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 7715080, "likes": {"liked": "— Location to main tourist attactions, good value if you care about Starwood Points", "disliked": "— Ongoing construction work, ridiculously high parking prices"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "The downside to the hotel is that it is in need of significant renovations. I am a Starwood Gold Member and so we stayed on the Club Level. Assuming that these are the nicest rooms, I can only imagine the work that needs to be done in the other rooms. The room was \"clean\", but there was a mildew odor that could not be removed regardless how much spraying they did. The wallpaper was discolored and pealing in some areas. The closet and dresser were falling apart and the furniture was stained and dated. The blinds were stained a gold and brown color that comes with age and were also falling apart. It was obvious from the outside that our room was not the only room with this problem.", "title": "Avoid.", "helpfulness": 2, "user": "Yorkshirebloke", "date": "May 19, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 2.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 7645861, "likes": {"liked": "— Close to most attractions.", "disliked": "— Basic looking rooms."}}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "We stayed at this hotel on the first part of your US trip for our first year anniversary.", "title": "standard, smelly hotel", "helpfulness": 1, "user": "aubhi", "date": "February 5, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 13295409, "likes": {"liked": "— location", "disliked": "— smelly and dated hotel and rooms, dirty carpet in the room"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "The location is great with the piers, restaurants and main sites close by.", "title": "Close to Fishermans wharf", "helpfulness": 1, "user": "macytrinh", "date": "January 25, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 12990172, "likes": {"liked": "— location", "disliked": "— cleanliness"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "The hotel itself was ok. staff were friendly but the rooms were sub-standard. They were big but very dated. The carpets and curtains had stains and everything in the room smelt funny including the bed sheets. I assume the smell is from the local piers as its so close. The hotel itself has a very fishy and stale smell.", "title": "Not impressed", "helpfulness": 2, "user": "Greeboss", "date": "January 21, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 12862750}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "Room was cleaned daily, but carpet was disgustingly dirty. Curtains and bedskirts had numerous stains. Rooms closest to the streets could hear the street noise and people talking outside. The new part of the hotel was probably nicer and better, but when we arrived it was opening day and the rooms smelled like carpet or wallpaper glue. We couldnt stay in those new rooms so opted for the older ones, but if we'd known it was so drab and stained we would not have picked this hotel. The only plus was that is was walking distance to many buses and street cars, and of course fishermans wharff. and only 6 blocks or so to chinatown.", "title": "Funky Decor @ Fishermans Wharf!", "helpfulness": 2, "user": "FrankDrebin", "date": "January 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12862426, "likes": {"liked": "— location", "disliked": "— No restaurant"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "We stayed here for three nights. We booked this hotel because of its location, which is great with walking distance to all the restaurants including Pier 39. I am a gold preferred guest at Starwood and by check-in we were told our room would be upgraded. However the room felt like a standard room besides a gold sign on the desk saying \"Preferred guest room\". The upgrade was probably this golden sign! According to their website they just spent 33 million dollars on renovation. The hotel still feels old and run down. They have for example done nothing the bathrooms. They are by the way small and extremely cold. The TV was great but the system was quite often \"unavailable\" on the screen. There was no mini bar and the soda machine on the floor was out of order. The staff was very friendly. Extra plus for the bell man.", "title": "Great but hated the decor!!!", "helpfulness": 3, "user": "JoanneLeicester", "date": "January 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12771372, "likes": {"liked": "— Location", "disliked": "— Decor, very odd."}}, {"rating": 4.0, "stay_parameters": "Stayed December 2004", "text": "The hotel was ideally placed for seeing all the tourist sights. We were one block from Pier 39, and one block from the cable car into the city centre. The hotel was spotlessly clean and the staff could not have been more helpful. The rooms were very nice and the beds were possibly better than my own bed at home. We only had breakfast in the hotel once as it was fairly pricey for what it was, but we were recommended the IHOP restaraunt which is just round the corner and is a great way to start the day. If you want a hotel that will act as a base for a few days in SFO, then the Sheraton is a good choice.", "title": "Ideal Base", "helpfulness": 3, "user": "Superhoop", "date": "December 16, 2004", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 2885896}, {"rating": 4.0, "stay_parameters": "Stayed October 2004", "text": "1 - Hotel rooms, while not huge, are a good size with lovely furnishings. Bathroom split between vanity and toilet/bath - very convenient. Beds are so so comfortable.", "title": "Above and Beyond", "user": "Calnev", "date": "December 5, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 2863728}, {"rating": 3.0, "title": "Acceptable but not 4*", "text": "2- Nice outdoor heated pool.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "December 2, 2004", "id": 2860558}, {"rating": 4.0, "title": "GREAT LOCATION IN SF", "text": "3 - Nice restaurant, as well as bar. Monday nights they have bud-spud-steak for $12.95 - beer-potato-steak. Good deal.", "user": "Kierkegaard", "date": "November 23, 2004", "id": 2844021}, {"rating": 2.0, "stay_parameters": "Stayed November 2004", "text": "4 - Location is the best. Close to all Wharf activity. Five minute walk to Trolley.", "title": "Really disappointing", "helpfulness": 1, "user": "SWelch2004", "date": "November 22, 2004", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 2840652}, {"rating": 4.0, "stay_parameters": "Stayed July 2011", "text": "This is what we would describe as a good tourist hotel. We could not fault the rooms, cleanliness or service at all.", "title": "If you want to stay in fisherman wharf this is ideal!", "user": "orchid028", "date": "July 9, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 115196339}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Fushermans wharf was just not for us.", "title": "great location", "user": "meadowlands1508", "date": "July 8, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 115170212}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We decided to arrive in SF two days early and stay 4 days instead of 2, I have to say this was not an issue for the staff and we stayed in the same room - it took 2 minutes foe them to sort out, and no trouble for them to arrange.", "title": "you get what you pay for", "user": "PAB3", "date": "July 7, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 115140531}, {"rating": 2.0, "stay_parameters": "Stayed June 2011", "text": "I would like to thank the staff for not making a \"big deal\" of this.", "title": "Good location but nothing else good about it", "helpfulness": 2, "user": "kayacatz", "date": "July 7, 2011", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 115133897}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "4 of us stayed here for 4 nights. rooms modern and clean, a little on the cramped side but we weren't spending much time in the room. Great location only 2 blocks from sea front, 3 blocks from cable car. Pool was nice and heated. the fire pits are great but were very busy and we only managed to get a seat once. extra blankets and pillows arrived quickly when we requested them. didn't eat in the hotel as it seemed very expensive especially for breakfast when there is an Ihop across the street but we went to the hollywood cafe after a trip advisor recommend and it was the best breakfast i have had in the USA. Would recommend this hotel to families. No fridge in the room but we had a cooler we filled with ice. There was a fire alarm one night but it was resolved quickly before we had even left the room", "title": "Super Service", "user": "sallyb10Nashville", "date": "July 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115061856}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "We were on a family road trip in the SF area and had just left a terrible Motel 6 in Fairfield. We didn't pre-plan or reserve anything in SF so we were actually just looking for a reasonably priced, comfortable hotel with a good location and found the Sheraton.", "title": "Good Choice, Nice Place...", "helpfulness": 2, "user": "kiminsocal", "date": "April 17, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 7380013, "likes": {"liked": "— Location", "disliked": "— Parking Cost"}}, {"rating": 2.0, "title": "go somewhere else", "text": "We were happy with the rate ($150 plus $40 parking) and the room was much nicer that what we had just stayed in so we were thrilled.", "helpfulness": 2, "user": "sunloverYorkshire", "date": "April 9, 2007", "id": 7301205}, {"rating": 1.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "The hotel itself was very nice and we had great service but I think its biggest asset is the location.", "title": "Dated, Dirty and Terrible Service", "helpfulness": 5, "user": "sugar18", "date": "March 22, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 7203196}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "Very close to the wharf and walking distance to the pier, restaurants, trolley, etc....", "title": "Good value but fairly basic for Sheraton", "helpfulness": 2, "user": "Lambert B", "date": "March 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 7190360, "likes": {"liked": "— Location", "disliked": "— Older and a bit dingy feeling"}}, {"rating": 1.0, "title": "BEWARE of San Francisco and hotels like the Sheraton", "text": "Had a very nice stay and would recommend it.", "helpfulness": 4, "user": "Bille54", "date": "March 9, 2007", "id": 7008078}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Second visit to Fisherman's Warf and this is now the ONLY hotel we will stay at.", "title": "The Only Choice For Pier 39 Or Fisherman's Warf", "helpfulness": 8, "user": "B.C.CanadaKarn", "date": "January 17, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6612452, "likes": {"liked": "— CLose to EVERYTHING, Friendly staff, Great value.", "disliked": "— Prices in Restaurant too high."}}, {"rating": 3.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "PROS:", "title": "Great Location but accomodation could be better", "helpfulness": 3, "user": "MULLAGHMORE", "date": "January 9, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 6568181, "likes": {"liked": "— Compass Bar and Grill", "disliked": "— Lack of customer service"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Easy access to spacious 3rd floor room. Situated CLOSE to EVERYTHING. Great value for price. VERY SECURE environment. Friendly and informed staff. DO NOT take a TAXI from or to SFO Airport. Instead book a Town Car & Driver for $50, save $10 after tip and ride in comfort. Available through Bellman.", "title": "$39.00 plus tax for parking is outrageous", "helpfulness": 2, "user": "Linda129", "date": "January 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 6561460, "likes": {"liked": "— Upscale hotel", "disliked": "— The cost of parking"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled solo", "text": "CONS:", "title": "Good Tourist Hotel - Not a Luxury Hotel", "helpfulness": 9, "user": "ams54", "date": "December 14, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 6440424}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Restaurant like every other hotel eating establishment is WAY over priced. No need to eat in Hotel - we didn't -everything from the best seafood within a five minute walk to having an iHop across the street. There were NO OTHER cons.", "title": "Mediocrity at its finest", "helpfulness": 8, "user": "JuliaUstinov", "date": "December 12, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 6365967}, {"rating": 5.0, "stay_parameters": "Stayed October 2004", "text": "We have read many varied reviews of this hotel. We have to say that we were very impressed with the hotel, the service, the location and the overall experience. We took advice from trip advisor users and asked for a room away from the bus terminal which was granted and as we were on the second stage of our honeymoon , as we arrived at the hotel a bottle of champagne was awaiting in our hotel room which was a nice touch. To explore Fishermans Wharf , there can be no better location than the Sheraton and it was not even affected by the local strikes that hit surrounding hotels. We can only speak highly of this hotel , the staff and the management.", "title": "Lovely Hotel and Excellent Location", "helpfulness": 2, "user": "maralyn and dav... a", "date": "October 12, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 2699107}, {"rating": 5.0, "title": "LOVELY HOTEL AND GREAT LOCATION!", "text": "This hotel is perfect for the tourist who wants to see all of San Fran.Fab location literally a 3-4 minute walk to fisherman wharf but in a nice quiet well lit safe area. I don't know why everyone has given this hotel really bad reviews beacause i found the staff to be great (even got a room upgrade on arrival) and the beds were the most comfy hotel beds i have ever slept in(new sheraton sweet sleepers). overall i found this hotel to be fantastic, ok the resturant and bar is a little pricey but your not made to eat/drink in them. i would most definatley stay here again.", "user": "NEMMIE", "date": "October 8, 2004", "id": 2649082}, {"rating": 2.0, "stay_parameters": "Stayed January 2003", "text": "I expected more from the Sheraton. Their staff was rude, the beds were hard, and if they didn't forget to leave tea bags, they forgot stirring sticks, sugar, or cups. One day we returned to our room and there were ants all over the coffee counter because the maids did not clean up.", "title": "Not much better than a Motel 6", "user": "Esther D", "date": "September 20, 2004", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 2588238}, {"rating": 3.0, "title": "Adequate, but no more", "text": "Parking was extremely expensive at $30 something a day. We could have stayed at a less expensive place for the same exact quality or even better.", "user": "fatboyofyork", "date": "September 13, 2004", "id": 2526450}, {"rating": 2.0, "title": "Great Location - That's it", "text": "For a better stay I recommend the Nob Hill Hotel. The rooms are tiny, but very clean and comfortable. It feels very San Francisco.", "user": "A TripAdvisor user", "date": "September 3, 2004", "id": 2511450}, {"rating": 4.0, "title": "Clean & Nice", "text": "I stayed here for two nights. My room was clean, spacious up-to-date. I would have to agree with someone else the place needs new heaters & mini bars.The bathrooms are small, but the shower head was good quality.", "helpfulness": 1, "user": "siteseer21", "date": "February 13, 2008", "id": 13538099}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The staff was frindly and helpful.", "title": "Nice renovation", "user": "samandjet", "date": "February 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 3.0, "business": 4.0, "cleanliness": 4.0, "rooms": 3.0, "location": 4.0}, "id": 13537586}, {"rating": 5.0, "title": "Loved this Hotel", "text": "Parking is very expensive, but this is SF expect to pay at least 50 a night any where. I saw someones car was broken into on the street, I parked in the garage. This is a good location for walking the wharf and catching the trolley. It is all very close, there is a safeway across the steet.", "helpfulness": 2, "user": "Holicrazy2", "date": "February 13, 2008", "id": 13532826}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "I'd stay here again.", "title": "Hated to leave! :<( Felt like I was leaving FAMILY! :>)", "helpfulness": 2, "user": "woodiega", "date": "February 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13526615, "likes": {"liked": "— The staff, service, fresh tasteful decor, amenities, and location. Oh, and the STAFF again.", "disliked": "— One full service, mod price restaurant open for all 3 meals would be a nice addition; HVAC a little quirky, low rise building allows for some (tolerable) street noise."}}, {"rating": 1.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "We stayed at the hotel for 6 nights. The location is a bit touristy. The hotel is nicely renovated. Room is big and bright. But the bathroom is still tight. Only thing is the heater is a bit noisy. and they should place a minibar in the room. Hotel offers valet parking but it's very expensive. You can park your car in the garage accross from the hotel or search for a street parking maybe one or two blocks away from the hotel. I love the new Sheraton bed, they are really comfortable.", "title": "Looked Good, but Looks are Deceiving!", "user": "Love2Travel1424", "date": "February 11, 2008", "detail_rating": {"front_desk": 4.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "location": 5.0}, "id": 13468338, "likes": {"liked": "— The location", "disliked": "— That they made an unauthorized transaction and stole our money!"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "I booked this hotel based on the reviews it has received and was very pleased. We took the Amtrak train up the west coast and arrived in San Francisco by the associated Amtrak bus. We told the driver we were staying at the Sheraton and he dropped us right at it, just beyond the official bus stop.", "title": "Lovely hotel in fantastic location", "user": "Caro", "date": "October 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 20999330, "likes": {"liked": "— Clean, modern, location", "disliked": "— nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "Due to a slight change of plan we had to add an extra night to the start of our stay. I called a couple of days before to arrange this and it took an eternity for someone to answer the phone. When they finally picked up the staff member was very helpful. We had to check out then back in again after our first night as this was paid for separately however this was a quick and painless exercise at reception which just involved swiping the room key cards.", "title": "It looks better online", "user": "jyount", "date": "October 18, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 2.0}, "id": 20988795, "likes": {"liked": "— Location to attractions", "disliked": "— The whole place - the room, the service, it wasn't something I would pay to experience again"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The hotel itself was finished to a very high standard and the rooms were beautifully decorated.", "title": "very nice but expensive", "user": "JEMCambridgeshire", "date": "October 18, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 20974342}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The location is excellent only a few minutes walk in one direction from the main tourist areas at the Piers - Boudin bakery, Pier 39, Sightseeing bus stops, shops, restaurants etc. Alternatively you can walk towards more central downtown areas in the opposite direction for restaurants and bars in the evening - Little Italy has some great restaurants only 10mins walk away.", "title": "Top Notch Accomodations", "user": "Cre8Love", "date": "October 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20765898, "likes": {"liked": "— Location and Frienly Staff", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "The hotel itself is quite expensive for food and drinks however it's central location offers no end of choices and it is even opposite a Safeway supermarket where you can pick up any essentials.", "title": "Would not have found this if not for Trip Advisor.", "user": "Skinklecat", "date": "October 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 20763545, "likes": {"liked": "— Those funky firepits.", "disliked": "— You could hear people in the hallways."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2011", "text": "The Shearaton is a really nice hotel. Check in was quick and easy. The rooms are clean modern and bright. All the beds have lovely warm duvets and were very comfortable.", "title": "Lovely Stay", "helpfulness": 1, "user": "Diwinny", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 115991101}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "There were cofffee facilities in the room as well as the usual ironing board hair dryer. There was an in room safe as well. Wi fi was available only in the lobby and cafe area", "title": "I expected more.......", "helpfulness": 3, "user": "luv2travelmuch", "date": "July 28, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 1.0, "service": 1.0}, "id": 115936521}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The swimming pool was small but clean and plenty of pool towels.", "title": "Great location great staff", "helpfulness": 1, "user": "Landtravellers", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115919019}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "There is a cafe which was nice a bit pricey but nice to sit outside next to the fire pits.", "title": "Generous sized room", "user": "TheTravelBug6753", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 2.0, "service": 5.0}, "id": 115879672}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "The hotels location is brilliant walking distance to Fishermans Wharf and Ghiardelli Square.", "title": "Great location", "user": "Jaycurl", "date": "July 26, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 3.0, "service": 4.0}, "id": 115783568}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 4, "variance": {"poor": 186, "average": 536, "very good": 862, "terrible": 98, "excellent": 368}, "aka": "Sheraton San Francisco", "slim_ranking": 0.463829787234, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Sheraton Fisherman's Wharf Hotel is steps form Pier 39, Ghirardelli Square, Alcatraz Island, and the Cable Car lines. We have 9,000 sq ft of indoor/outdoor function space and 531 luxurious guest rooms"}