{"user_rating": 4.0, "review_count": 172, "name": "Sheraton Hartford Hotel at Bradley Airport", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "This hotel is a bit dated but very clean. Can NOT beat the location for an early morning flight. Don't expect anything free, bottled water, breakfast, no perks if you are not a gold member. Last time there was not even reg coffee in the room, only decaf. When I called the front desk for some they said they \"Always run out\". They could have offed me a free cup!", "title": "Super location", "user": "daisy20071960", "date": "November 1, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 120017261}, {"rating": 1.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Due to the storm of 10/29/11 this hotel has no power, no hot water and no heat. This might continue to be the case for another week. We were travelling from out of town, and so we phoned the Sheraton Hartford in advance to confirm our reservation and that they did indeed have power. They claimed that they did have power. So, after traveling all day, imagine our horror when we arrived at a hotel with no power, hot water, or heat. The staff on site claimed the the Sheraton phone calls are routed away and the off-site people did not know about the situation.", "title": "No power, no hot water, no heat--Don't be misled.", "helpfulness": 1, "user": "S T", "date": "October 30, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 4.0, "location": 4.0}, "id": 119916648}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Right there at the airport. Great location good dining and bar area. Rooms are excellent but don't try to refold the ironing board, it's a cheapy and tough to maneuver. The one major problem with the room is the airconditioning, it has a sensor that requires you to move occasionally to get it to work. Of course if you don't move much you wake up like I did throughout the night sweating up a storm even in the winter nights!", "title": "Location, Location, Location", "user": "BaronFoer", "date": "October 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 119875107}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "Lobby of hotel leads directly to terminal. Stay night before flight and you will save on parking, and sleeping! Very comfortable bed. Rooms clean but quite standard, decor-wise. Best thing is to get a room that looks directly out on to runway. Especially if traveling with children, they can watch planes come and go. (Not just from a distance....these rooms overlook some gates.)", "title": "CONVENIENT!", "user": "Roofbeam", "date": "October 10, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 119160513}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "The rooms are not very soundproof; we could hear the people next door talking. Did not hear any plane noise though.", "title": "Very good except the Breakfast Buffet wait Service", "user": "TheCmdr", "date": "September 19, 2011", "detail_rating": {"value": 2.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 118322633}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The hotel is currently under renovations - which we were not told in advance. Your window is covered with plastic. There is a sign on the window requesting that you keep your curtains closed to avoid any awkward situations with the workers outside. (It really does say that!). We stayed here because we had a 6am international fight. Otherwise it really is not worth the money. Many other area hotels offer much more reasonable parking packages that also include breakfast. The hotel is definitely showing its age, and having only double beds when traveling with a family is never the first choice. The front desk staff (1 person) was very friendly but definitely busy - they need more staff at the front desk.", "title": "If your flight is very early stay here -otherwise it isn't worth it!", "helpfulness": 2, "user": "Nancy1092", "date": "July 13, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 2.0, "value": 1.0, "service": 4.0}, "id": 115320716}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I stayed at this hotel for the second time and enjoyed it even more the second time. There is nothing like waking up for an early flight and instantly being at the gate for your plane. No more waking up hours early for me!! This hotel is clean and the rooms are comfortable. I highly recommend this hotel.", "title": "Can't beat this hotel, especially when flying in and out of Bradley", "user": "jheffernpt", "date": "July 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0}, "id": 115266831}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "The Springfield Ma location was sold out so I called Starwood and asked them for the closest \"high quality\" property they had. I was willing to drive an extra 30 minutes so that I could get a good night sleep on a long business trip. I was sent to the Hartford Hotel at Bradley Airport. While the club lounge was excellent that was where the good ended. The bed and pillows were not have the high beauty rest sleep quality that all the other properties that I have stayed at is. Worse was while I went to bed fine I woke in the middle of the night with bites all over my body. I immediately called the front desk and was told they would let housekeeping know. Hmmm... I was not able to go back to sleep. I called again for the general manager as morning arrived only to be told that he was unavailable. When I went to check out, I again asked for the general manager so that I could show him the bites that I received in his hotel only to be told that he was not available. I filed a complaint with Sheraton headquarters immediately-they are suppose to have a 100% customer satisfaction gurantee. Apparently this is not the case with this hotel. Last night I was told by their 800 # when I called to follow up on my c omplaint and why my credit card had not been credited. I was told that housekeeping did not find any bed bugs. Soo..... the explaination for the bites all over my body? Guess they were pesty ghosts. I would not recommend this hotel not only for the poor beds/pillows and pests but also for the lack of responsible and dependable management.", "title": "Horrible Stay... bites galore!", "helpfulness": 3, "user": "cbonnette", "date": "July 8, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 115154903}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Rooms were clean and comfortable. Hotel is connected to terminal - couldn't have been more convenient to make our early flight. They have a stay and park package that's just a great deal (free parking while you're away). Plus, the Sheraton has its own parking lot which seems more convenient t to the terminal than the airport lot.", "title": "Clean and convenient", "user": "Edgingin", "date": "May 18, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 108811412}, {"rating": 4.0, "stay_parameters": "Stayed May 2011", "text": "Nice hotel. Right next to airport, clean rooms. Relatively modern.", "title": "Convenient to airport", "helpfulness": 1, "user": "Apex1k", "date": "May 8, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 107305861}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Lets start by saying that this is the 3rd time i have stayed here. I booked this hotel through Delta after i did my ticket. I was put on the 8th floor which is the exective floor. It didn't cost me much more than a reg room. Bonus is, between 6 and 10, you get all you can eat snacks, pop, water fruit ect at no extra charge. Booze will cost you, but everything else is included. In the morning there is breakfast included too. If i were to pay for my dinner and breakfast at this hotel, it would've cost me more than the upgrade to the 8th floor.", "title": "very nice stay", "helpfulness": 2, "user": "Heather M", "date": "September 15, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 118152316}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The room was clean, and you get a house robe to wear.", "title": "Great Stay, Park & Fly Hotel", "helpfulness": 2, "user": "stonecroft", "date": "September 12, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 117986850}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "I will be returning again when i do business out east.", "title": "Nicest Airport Hotel I have ever stayed at", "user": "sharkagirl77", "date": "September 12, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "service": 5.0}, "id": 117985620}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "Had to take early flight out of Bradley with Family. Used the Sheraton's Stay, Park and Fly offer. Excellent value when you consider the cost of parking alone. The Hotel is connected directly to the Terminal with parking below the Hotel. You just dropp off your bags at the front entrance, drive into the parking garage and take elevator up to lobby and get parking ticket validated. When you return from flight, pick up bags, go to hotel entrance directly from terminal and on to parking garage and you are on your way home. All in all a good value and very convenient.", "title": "One minute walk to terminal", "helpfulness": 1, "user": "pattayainsider", "date": "August 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 117026516}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "Ok - so the title is lame but here's the scoop. They rate superior on accommodating our needs. Envision two disaster medical teams arriving with all their gear on short notice on the eve of a hurricane. The staff was not only courteous, they went out of their way to provide us additional space at a moments notice. The rooms were clean and nicely decorated. The bonus - you didn't hear the aircraft noise! The only down side is that we overwhelmed the restaurant wait staff, yet they were warm and friendly.", "title": "Hard to believe but fantastic!", "user": "sunnytraveler2", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115926639}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "Stayed just one night before taking a 6:30am flight. Parking deal fantastic. For $29.00 dollars more and we were able to leave the car for 7 nights in the hotel garage. The cheap long term parking is $6/day which would have cost us over $40. The rooms were very clean for an airport hotel. The decor was fresh and modern. Hotel bar had a very friendly bartender and the food was quite good.", "title": "Convinient, clean and great servive", "helpfulness": 2, "user": "Ruby0625", "date": "April 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106026476}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Perfectly adequate with great access to airport for early flight. Good hotel rate that included seven nights free parking. Air conditioning didn't work which was frustrating. Service was perfectly fine and would stay again if had early flight as hotel is part of airport.", "title": "OK for early flight", "user": "tlf1006", "date": "April 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 105151401}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "I'm a younger pilot and fly for an airline, and I seem to wind up at Bradley more than any other airport. Not the worst place in the world to have to spend a night, and the Sheraton is very convenient. You don't even have to leave the airport; many of the rooms even overlook the airport itself.", "title": "I'm a regular, no complaints", "helpfulness": 1, "user": "ESVASpiderTerp", "date": "March 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 101071384}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "My last trip here was mid-February, and I was treated well, the room was comfortable as always, very clean, and they get you ready to crash after a long duty day, which is what I need. I suppose this isn't any couple's romantic getaway choice, but if you need a hotel convenient to the airport, you'll find everything you need here. Whenever my schedule takes me overnight to BDL, I can breathe easy knowing I have a second home at the Sheraton.", "title": "Very clean", "user": "stephie1012", "date": "February 3, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 95408752}, {"rating": 1.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "Hotel is very convenient to airport. Very clean with large rooms. My daughter thought the bed was very comfortable. Only down side was arriving at night there is nothing available for food. we had to walk back to the airport to eat something.", "title": "Find another hotel!", "helpfulness": 1, "user": "Geekontherun", "date": "November 30, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 88695139}], "location": {"country": "United States", "city": "Windsor Locks"}, "stars": 3.5, "variance": {"poor": 8, "average": 19, "very good": 62, "terrible": 8, "excellent": 75}, "aka": "Hotel At Bradley Airport", "slim_ranking": 0.0714285714286, "description": "The Sheraton Hartford Hotel is inside the Bradley International Airport, between terminals A and B. Also close to attractions including the Basketball Hall of Fame, Six Flags New England, and more."}