{"user_rating": 4.0, "review_count": 259, "name": "Sheraton Muenchen Airport Hotel", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "I contacted the hotel prior to our our arrival in order to request two single beds. I received confirmation by email that this would be fine. On arrival we were told that they had received no request. They then told me to print out the email confirmation. The computer in the lobby would not print, and when it finally did, it didn't seem to make any difference to the receptionist anyway, as he was still unable to offer an explanation or an apology. We used the sofa as a bed instead.", "title": "Poor Customer Service", "helpfulness": 1, "user": "Ashley321", "date": "November 9, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 21669180, "likes": {"liked": "— location/proximity to public transport", "disliked": "— customer service"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "We were told that breakfast finished at 11am, when in fact it finished at 10am, so arrived at breakfast when the restaurant had closed.", "title": "Draconian cancellation rules, beware!", "helpfulness": 2, "user": "aerosoldier", "date": "September 26, 2008", "detail_rating": {"front_desk": 1.0, "value": 1.0, "service": 1.0}, "id": 20402053}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "We did not receive our 0430 wake up call in the room, and this was put down to 'technical problems'.", "title": "Great for one night", "helpfulness": 2, "user": "Steph2727", "date": "June 24, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 17189901, "likes": {"liked": "— Easy access by train to Munich", "disliked": "— Shuttle payment process should be improved"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "No apology was offered with regards to any of these problems, and even though we requested a room with two single beds for our second night's stay, nobody contacted us about this, so we simply used the sofa for two nights.", "title": "Too pricey!", "helpfulness": 1, "user": "mariATL", "date": "May 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 2.0, "rooms": 5.0}, "id": 16436069, "likes": {"liked": "— The room and pool were wonderful", "disliked": "— The price of the amenities and food!"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "The hotel as an incredibly inflexible cancellation policy: all cancellations within 2 weeks of the check-in date are subject to a 100% cancellation charge. That means no refund of your money whatsoever, regardless of the reason why you're trying to cancel! I was forced to cancel 11 days in advance, for a documented reason (I emailed the hotel with a copy of the paperwork attached to show that I wasn't doing it on a whim), spent at least 6 hours on the phone with them and with hotels.com (which has a very helpful customer service dept) and... nothing. No cooperation, \"Sorry, Sir, this is hotel policy.\" Thankfully, one particularly resourceful person at hotels.com customer service was able to talk Sheraton Munich Airport down to a 50% charge. Still, I paid $300 dollars for absolutely nothing. Just be careful and read the fine print!", "title": "A comfortable stay.", "helpfulness": 2, "user": "Ellemay", "date": "May 8, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 2.0, "rooms": 3.0}, "id": 15788957, "likes": {"liked": "— Spacious comfortable rooms.", "disliked": "— too far from the airport."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "We stayed here before catching an early morning flight to the US and had a nice stay. The room was big and clean although the comforter smelled a little stinky of someone's sweat and BO. We make the reservation through the points program and were treated to a complimentary fruit tray which was a really nice surprise. The package we had included breakfast which was big and really nice. The airport shuttle was a reasonable price. The pool was being used by locals for an infant swim class, so we couldn't check it out. The little town nearby was cute with a Maypole in the center. It was a great value for the rate we had. Would stay again.", "title": "Nice Airport Hotel", "helpfulness": 2, "user": "lynne73", "date": "April 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15151178, "likes": {"liked": "— Location near airport", "disliked": "— Comforter on bed."}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "We stayed here on Points so I cant really comment on the price, but the breakfast seemed rather expensive at 20 Euros. The staff was exceptionally friendly, but no one had name tags on so I cant provide accolades specifically. The room was exceptionally clean, but it did lack an Iron and tea/coffee maker.", "title": "Almost Perfect", "helpfulness": 1, "user": "stocklipro", "date": "February 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 13707995, "likes": {"liked": "— Staff", "disliked": "— Long way from downtown Munich"}}, {"rating": 5.0, "title": "Very Good for an Airport Hotel", "text": "This a very pleasant hotel with a courteous staff and large modern rooms (especially by European standards). Sure there are not a ton of ammenities right outside the door, but this should not be expected from an airport hotel.", "helpfulness": 1, "user": "stumpak", "date": "January 30, 2008", "id": 13125692}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "The hotel restaurant is so-so but there is a very solid tradiitonal bavarian restaurant 150m down the road, which is a much better option.", "title": "Not a real Sheraton but an OK airport hotel", "helpfulness": 1, "user": "Gelada", "date": "December 28, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 4.0, "value": 4.0, "rooms": 3.0}, "id": 12017139}, {"rating": 3.0, "title": "A fair enough airport hotel", "text": "We stayed for one night in the Sheraton on our way back home. The hotel is located 5 minutes away from airport - you need a car or a shuttle service. It is in the country side on a very quiet location. We arrived very late and the receptionist upgraded us to a junior suite which we liked. The room was big as well as the bath. Staff is very competent and friendly. The hotel has rather old furniture and not the usual luxury of Sheraton. Price was good.", "helpfulness": 1, "user": "marshalex", "date": "December 15, 2007", "id": 11562901}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "In average is a nice Hotel. Convenient and close to airport. Only one bad episode: they assigned us a room wich was occupied by other person. We entered in the room and saw some personal belongings, a used water bottle,etc. We called the receptionist, who quickly change our assigned room, but without any apologyse. The recepctionist was rude with the situation.", "title": "Nice and convenient hotel, but...", "helpfulness": 2, "user": "Geadas", "date": "December 2, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 11206577}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "I spent one night in this hotel because I had an early flight in the morning to the US. I was disappointed by their shuttle service from the airport: on their web site they don't give clear instructions. When I arrived at Munich, I couldn find either their shuttle or a sign saying where to wait for it and the schedule. I tried to call them from the airport, but they put me on hold, and after ~ 30 seconds I gave up and picked a taxi. It was a good idea: the taxi was 11 euros, compared to the 8 euros of the shuttle, because the hotel is really very close to the airport. I used the shuttle in the morning though, to leave the hotel. Make sure you reserve the shuttle the night beafore, because it fills quickly.", "title": "Convenient for early flights", "helpfulness": 2, "user": "Sandra64", "date": "November 14, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10811274, "likes": {"liked": "— Very conveniently located for the Munich Airport, still has some charm.", "disliked": "— Some of the staff were not very nice"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The hotel is ok, the room was large, the bed comfortable. Breakfast was fine, unless you have to pay for it (in my case it was included in the room rate, but franckly the standard prize they charge, 19 euros, is too much). I had breakfast very early (they start serving breakfast at 6am) and I found an unpleasant lady in the breakfast area: there was some miscommunication, so she thought I was part of a Lufthansa crew (a woman traveling 'solo' presumably is not very common) so she wanted me to seat in a different corner of the same area, which, ( I later realized , when all the crews started arriving) was reserved for crews. Of course after clarifying the equivocal, I could stay in my preferred table, but I found this episode quite annoying. For this reason I rate 4 instead of 5 this hotel.", "title": "Lovely Hotel", "helpfulness": 1, "user": "Ceiler", "date": "September 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8711192, "likes": {"liked": "— Close to the airport, friendly staff, large and clean rooms", "disliked": "— Smoking in the Lobby"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "I will definitely stay again at this hotel, in case I'll have to pick an early flight in Munich.", "title": "Great deal for points", "helpfulness": 2, "user": "YoyoMar", "date": "August 29, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 8526111, "likes": {"liked": "— Air Conditioning!", "disliked": "— Cost associated between to/from airport"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Our stay at the Arabella Sheraton was such a pleasant surprise. The staff were excellent and the rooms were large and clean. The hotel offered everything a traveler could ask for. We liked the hotel so much that we extended our stay. I would definitely stay there again and highly recommend this hotel to anyone.", "title": "Helpful and friendly", "helpfulness": 1, "user": "UKFoz", "date": "August 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 8351773, "likes": {"liked": "— quiet", "disliked": "— no kettle"}}, {"rating": 4.0, "title": "Good deal-expensive food", "text": "Nice place. Very convenient to the airport but not loud and impersonal. They will charge you for parking, shuttle service, and just about everything else so be careful. They were very accommodating putting our 2 rooms right next to each other. There were 5 of us together. Small cute pool. Couldn't hold many people, but we were lucky no one was around. We opted to go down the road for dinner and breakfast and found some great food and prices at local restaurants. Breakfast at the hotel would have been 19 euros. We paid 7 euros at the Schwaiger Hof down the road. It was an all you can eat deluxe German breakfast served by a friendly staff who spoke English. We drove, but it was easily walking distance. Very convenient hotel for those flying out of Munich.", "helpfulness": 2, "user": "hofe", "date": "August 1, 2007", "id": 8272789}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "I was on the tail end of a long business trip and wanted to stay overnight near the Munich airport for an early flight the next day. At first, I was put off by the shuttle bus service from the airport to the hotel, which runs only every 30 min and fills up quickly. I hated the wait but I could have taken a cab if I wanted to get to the hotel faster. The hotel itself is more Bavarian lodge than Kempinski or Hilton or other corporate hotel. The room I had (#333) was very quiet and had a nice view of the garden. The restaurant had closed by the time I arrived at the hotel but the bar was open, serving basic German dishes but nothing wonderful or terrible, just ok. The hotel is located in a grassy area away from the hotel and almost felt like I was out in the country. I had breakfast out on the terrace the next morning in the bright morning sunshine which was just excellent. Food quality was good. Front desk staff helped me with a problem where my room key wouldn't work. They were professional and helpful. In summary, this hotel is still a Sheraton property but it had a lot more charm than I expected during my short stay.", "title": "Different, relaxing hotel for a quick overnight near MUC", "helpfulness": 1, "user": "pauloregon", "date": "July 26, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 8238298, "likes": {"liked": "— Lodge feeling, location away from the city", "disliked": "— Slow shuttle bus from MUC"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "We spent 10 days in Germany for the World Cup. The hotel was about 5 miles from the airport in a village type setting. The rooms and hotel were clean and comfortable. The staff was very attentive and courteous. The restaurants food was excellent, we ate breakfast and dinner several times, and the surrounding area was very pleasent. Parking in the lot was a rip off when you could park on the street for free, but that's typical with most hotels. Overall very nice and cozy for an airport hotel. We used our Starwood points for the stay and it was very reasonable. We would stay there again", "title": "World Cup 06", "helpfulness": 1, "user": "bam10", "date": "July 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 8230976}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "I returned a few weeks ago from a 9 day trip through Germany and Austria. I stayed in faboulous 4 and 5 star hotels. The Arabella Sheraton Airport Hotel Munchen was the last hotel and the most disappointing. While the accomadtions were nice, the service was terrible. The few times I was downstairs (waiting for a taxi, having a drink at the bar) numerous people were complaining to the front desk. Most of the complaints came from people who did not realize it cost $5.00 to make a phone call (regardless whether you had a calling card or not). Apparently the front desk worker admitted that he gets many people every day making the same complaint, but the hotel will not change its policy or make it more clear.", "title": "Very disappointed with service", "helpfulness": 3, "user": "ctravelsalot", "date": "April 14, 2007", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 1.0, "cleanliness": 5.0, "value": 2.0, "location": 2.0, "rooms": 5.0}, "id": 7350771, "likes": {"liked": "— room was nice- extra touches like chocolate on the pillow", "disliked": "— service- terrible--felt like the hotel was trying to scam people with telephone policy"}}, {"rating": 1.0, "title": "Terrible s", "text": "If the service would have been better, I definitely would have returned to the hotel.", "helpfulness": 5, "user": "chlopaigeHouston", "date": "March 24, 2007", "id": 7214538}], "location": {"country": "Germany", "continent": "Europe"}, "stars": 4, "variance": {"poor": 17, "average": 55, "very good": 107, "terrible": 11, "excellent": 69}, "aka": "Sheraton Schwaig", "slim_ranking": 0.5}