{"user_rating": 4.0, "review_count": 819, "name": "Sheraton Hacienda del Mar Golf & Spa Resort Los Cabos", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The location and the hotel room were absolutely gorgeous. The gym was very nice as well. However, there were a few set backs that really bugged me quite a bit. 1. you cannot swim at the beach if you are anything below an advanced swimmer. I am an avid ocean swimmer and the staff would not allow me to enter the water because of the large waves. This to me is a HUGE problem considering people go to cabo san lucas for the beaches and weather. Yes, the hotel is close to other beaches however, there is nothing like swimming at your own hotel. 2. the food at the restaurant was absolutely terrible and overpriced! I would not eat anything at the hotel! Go into town and save yourself hundreds of dollars. 3. the room service managed to screw something up every single day we ordered something 4. The hotel gives you 30 minutes of free wi fi before they start charging you. If you pay a few hundred dollars for a room, this is kind of ridiculous in my opinion. Everything was great during our stay but I will definitely not stay at this hotel next time because of the beach/swimming issue!", "title": "Beautiful Location, poor food", "helpfulness": 1, "user": "ljbeachboy", "date": "April 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158681764}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "I really can't say enough good things about our stay here. We just got home today from a 4 night stay and I couldn't wait to rave about it. The grounds are beautiful the rooms are comfortable and well taken care of, the staff is UNBELIEVABLY courteous and helpful. The only area that would not get glowing remarks from me would be the food. It was hit or miss. Girasoles was good, Tomatoes was so, so. The best food we had there was honestly from the poolside bars. We loved the food from Delfines and Sirenas. I should say that I am not exactly a foodie so maybe I did not taste some of their better food options. My husband and I traveled with our 4 and 6 year old children, my parents, and my brother, sister-in-law and 2 year nephew and a good time was had by all. There was something for everyone. I feel as though I have to reiterate that the property itself is stunning. It has a Mediterranean charm and the views are stunning every which way you turn. A special thanks to Josephina (concierge) who hooked us up with a Cabo Adventures zip lining adventure. It was hands down one of the coolest things my husband and I have ever done! I highly recommend Cabo Adventures. So professional and fun. We booked our trip through Costco Travel and felt like we got an unbelievable deal given how wonderful our trip was. Loved it!!", "title": "Great family vacation!!", "helpfulness": 1, "user": "Bruinett", "date": "April 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158428547}, {"rating": 2.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "I vacationed at the Hacienda del Mar to celebrate a birthday with a friend. My review of the hotel itself is very positive - beautiful and well maintained property, clean rooms, friendly housekeeping staff and very nice pool and beach areas.", "title": "Terrible front desk and mgmt experiences", "helpfulness": 1, "user": "Cleo435", "date": "April 17, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 157984991}, {"rating": 2.0, "title": "Rude Reception Staff", "text": "Unfortunately, my experiences with the Front Desk staff and the hotel management were so painful that it's overshadowing the rest of the stay. When we checked in, the staff was rude, curt, and unconcerned with the note I had included when making the reservation that we were celebrating a birthday. There was more emphasis on the time share sales pitch than any other aspect of our stay - they even called our room two days into our trip to ask again if we were interested.", "helpfulness": 4, "user": "dave_929", "date": "April 12, 2013", "id": 157561881}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Even now, a month after my stay, I'm still trying to resolve charges to my credit card that don't match statements and the management is clearly more concerned with the bottom line than providing clear answers to questions or good customer service.", "title": "Cabo spring break family vacation 2013", "helpfulness": 2, "user": "67corvette", "date": "April 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 157532585}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "Enjoyed my stay at the Sheraton Hacienda del Mar in late July 2012.", "title": "Great Resort Property on The Cabos Corridor", "helpfulness": 1, "user": "anlof9", "date": "April 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 157233077}, {"rating": 4.0, "stay_parameters": "Stayed March 2013", "text": "Rooms were very spacious and the bathrooms were great, had a nice open layout concept and a great big tub with separate shower. Our room was a garden type on the first floor and opened up to the Adult's Pool.", "title": "Great Place to stay", "user": "ez_m0eb", "date": "April 8, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 157057857}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Pool's were nice although would seem small at times, even though when we stayed there it was low season it seemed crowded at times and pool service really slowed down to a halt at the Main Pool.", "title": "Whales!", "user": "cadreamin3", "date": "April 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 157017637}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "The beach is great minus the super strong currents (all over most of Cabo) which make it not a wise choice to swim. The golf courses at the Resort are awesome and a round of golf is a must here.", "title": "a lot of good in nothing to do", "helpfulness": 2, "user": "Randy G", "date": "April 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 157004689}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Did not use the restaurants other than the pool service one, food was nice and fresh and tasty. Would go out to dinner or lunch to Downtown Cabo.", "title": "Average", "user": "FD09", "date": "April 7, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 2.0}, "id": 156919646}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We have been coming here for years and it is always a great visit. Property still looks fresh and new. We think the rooms may have also been recently updated with furnishings. Do not miss getting up for the sunrise. I know, you are on vacation, but you will thank me for it. Staff service is hit or miss sometimes. The pool areas can be crowded depending on time of year..spring break, etc.Sometimes messy as well. Kid friendly. Short drive from the airport and to Cabo San Lucas. I wish there were more activities on the hotel side for visitors. I would recommend this over the Westin as it has more of that Mexican feel than the Westin which has a very garish and modern decor.", "title": "Relaxing vacation in Cabo", "helpfulness": 1, "user": "heysteph", "date": "April 6, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 156826705}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We have stayed at the Westin in Cabo, but this is much better for families. Huge property, just a few mins ride to town, awesome pools and huge beach. Yes the food is overpriced...it's a resort. I love that they put out free coffee first thing every morning as there are lots of people up & about to watch the sunrise. The views of the whales right from the pool & beach are fantastic, very clean, beautiful cozy safe authentic Mexican vibe. I have stayed at many Starwood resorts worldwide...this one is a gem.", "title": "Perfect for family vacation", "user": "ttimeatharrods", "date": "April 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 156716526}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The property is Huge. It's lots of small villa style builings with many pools and places to eat. The food was good, great at some places. Other reviews knock the hotel for a few things: 1. expensive food. Duh- this is a resort. It's not anything that you shouldn't expect. 2. Unfriendly staff- Most of the staff were very friendly. A few that weren't, but this is really the norm in Mexico. The staff were fine. 3. You can't swim in the ocean. That's sort of true. At certain times it looked pretty dangerous, but at other times there were kids in the water, no problem. It's all about your comfort level. We did not do the all-inclusive rate, because we wanted to go eat in town and that worked out for us. I'd reccommend this hotel for most travelers.", "title": "Solid Hotel", "user": "mruby75", "date": "April 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 156604539}, {"rating": 4.0, "title": "Nice Hotel", "text": "Good hotel. Go all inclusive or it is VERY expensive and not close to Cabo San Lucas. Definitely a very family friendly resort. We were a couple looking to relax with a \"little\" fun. It's a little overcrowded and there really isn't any adult fun. Like I said, nice spot, but we'll stay somewhere else next time.", "user": "Saskguy155040", "date": "April 3, 2013", "id": 156509480}, {"rating": 3.0, "stay_parameters": "Stayed March 2013", "text": "Stayed first night at playa grande - then moved to Sheraton. Room was clean, grounds were nice but that is where it ends. Deluxe ocean view??? More like deluxe palm tree views and if you squint way out in the distance you can see the ocean. Please beware the hotels.com 200 food/beverage voucher- if you book one night, great deal, book a week, you still only get the one voucher.....so......you end up spending 120usd more per night but only get 1 200usd voucher. If you want to use, book each night seperately. Playa Grande would get my vote hands down- no comparison. The whole situation stunk. Maybe on another experience or better view, would be better rating but I am trying to be fair. If it was just my emotional response, i would have given 1 star, but then again, isn't that why you spend your hard earned money, for an emotionally relaxing holiday - We did not experience that!", "title": "I wish I had known ahead of time", "user": "BClan007", "date": "March 30, 2013", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 156095319}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "My wife and I travelled to San Jose Del Cabo to stay with some relatives, and broke up our trip by staying at this resort for three days and three nights in Mid-April, 2013. I was somewhat leery of the expenses we might incur, given some of the reviews I had read prior to the trip. If you are reasonably informed leading up to your stay, you will have a very pleasant experience, as my wife and I did.", "title": "Immaculate Resort", "helpfulness": 1, "user": "nelboski", "date": "May 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 159935149}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Upon check-in I was informed that the resort was placing a hold on my credit card of roughly $600 USD (approximately $200 USD per night). The process went fairly quickly and we were directed to the concierge desk. As you likely know, the concierge desk informs you of all the resort has to offer, but will also pitch the timeshare breakfast/tour to you, as the timeshare is actually co-located on the resort. The gentlemen was nice enough about it - we only had to tell him politely twice that we weren't interested in it. After that, we were shown to our room and did not have any other hassles in terms of a sales pitch for the duration of our stay on the property.", "title": "Amazing place for leisure", "user": "cmxc5", "date": "May 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 159652416}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Pools: The property is well-planned and in immaculate condition. There are three pools that overlook the ocean, with another two pools located further back in the property (one is in the timeshare area). There was ample seating at the pools for the time we were there. The resort makes a conscious effort to limit the holding of prime chairs with towels with their signage...but let's face it - you can't effectively enforce courtesy.", "title": "Beautiful hotel, overpriced dining options", "helpfulness": 2, "user": "SunLovingMom77", "date": "April 30, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 159261634}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Beach: While many highlight the beach as a weakness of the resort, I found it to be quite the opposite. The beach has a sharp incline towards the water which causes some pretty unpredictable and dangerous wave action. For the most part, the beach was off-limits for swimming. However, as a result, there was nearly nobody hanging out under the palapas down there, which meant a semi-private beach area for my wife and I. The wave action was nice to watch and really relaxing - at least for me. Further, the beach property is quite lengthy, due to the size of the resort property. You can spend a lot of time walking out there.", "title": "beautiful resort, things to look out for", "helpfulness": 2, "user": "Cinnard", "date": "April 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 159261492}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Restaurants: We went to Girasoles each day. For $16.50 USD per person, we were able to order as many dishes off the breakfast menu as we wanted, with included coffee and mimosas. There is a beautiful view of the Sea of Cortez and we were usually set until dinner time. We only went out for one dinner when we were there, and it was the fancier one (can't recall the name). They had a special on Saturday evenings for an assortment of Asian Tapas - well prepared and delicious for about $40 USD each. The prices were equivalent to an above-average steakhouse back home. Other times we had nachos and tacos either by the pool, on the beach or via room service. They were all slightly expensive, but not prohibitively so.", "title": "Best Resort yet", "user": "Kathy S", "date": "April 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158869898}], "location": {"country": "Mexico", "region": "Baja California"}, "stars": 4, "variance": {"poor": 52, "average": 71, "very good": 231, "terrible": 28, "excellent": 437}, "aka": "Sheraton Hacienda Del Mar Hotel Cabo San Lucas", "slim_ranking": 0.253731343284, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "With its cobblestone lanes, winding paths, quaint Placitas, fountains, restaurants, and shops, the Sheraton Hacienda del Mar Resort & Spa, Los Cabos captures the feel of Old Mexico. A full complement of guest services is offered on premises to satisfy the refined needs of both the meeting and leisure travelers."}