{"user_rating": 3.5, "review_count": 211, "name": "Sheraton JFK Airport Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Stayed one night as part of a family event. Hotel room was spacious and very comfortable BUT be aware the hotel is not close to the subway but is off of the Belt Parkway so commuting is fairly easy. Parking appears limited but we were lucky to get a spot in the main lot. Staff was very accommodating. While there is a bar on site it is definitely pricey (two very small rum and cokes were $20). The bathroom is spacious but the doors are odd in that they are \"French\" style doors and do not lock. I would recommend this hotel and would go back if I am in the area.", "title": "Very nice hotel!", "user": "SuprDadOf4", "date": "October 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 143572981}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We were stayed at the hotel twice, once before our trip to Europe and once after our trip to Europe. Both times we stayed on the club level. The rooms were larger and appeared clean. However, the lounge was filthy. The coffee machine had not been cleaned in a while the frig had dirty finger prints and so did the tray that held the donuts and bagels. Dishes, etc appeared to be rinsed not cleaned. They were out of water and juice and did not replace it.", "title": "Dirty", "user": "mom1279", "date": "October 20, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 143274059}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "When we arrived the manager and assistant manager were yelling at a quest. It was just awful.", "title": "Expensive for what it is", "user": "Gman558", "date": "October 13, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 142688431}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "I am also writing to Starwood to voice my concerns. They do not live up to the Starwood name.", "title": "Just like home!", "user": "SaraSGS", "date": "October 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 142320510}, {"rating": 3.0, "stay_parameters": "Stayed October 2012", "text": "To be balanced this is hotel is not as bad as some of the reviews and rooms are OK, but this is hotel is certainly not worth the money.", "title": "Typical airport hotel", "user": "Charlotte616", "date": "October 8, 2012", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 2.0}, "id": 142267102}, {"rating": 1.0, "title": "Stay here if you like to wait in cold for shuttle!", "text": "We stayed here on Dec 31 for our overnight layover to Johannesburg. It was NY's Eve and the lobby was festive. The front desk staff were warm and friendly, and check in was fast and efficient (we had already had a series of delays and missed connection from Toronto). We took the train into Times Sq for dinner and the celebrations, and had to used the hotel's shuttle from Federal Circle/JFK airtrain station after midnight to get back to the hotel. You had to call the hotel when you arrive at the station, and we we always told the shuttle will be there in 10 minutes. We waited and waited for the shuttle, called back every 5-10 minutes, and was always told the shuttle was on its way, and the front desk invented all types of excuses - dropping off airline crew to airport - we we at the single airport drop off point/Federal Circle, but no sight of shuttle; traffic (traffic?? - this is way past midnight, no traffic on the road!). The shuttle finally arrived 40 minutes later, and we clocked the time it took to drive from Federal Circle to the Sheraton - 4 minutes! That would be 5 return trips between the hotel and Federal Station. Meanwhile, Days Inn/Holiday Inn had 3 shuttles go back and forth. I wont comment about the driver, but management had no idea whe their busses are, dont check on their drivers. If you are just sleeping for a night, save your money or points and sleep elsewhere. I am still waiting for the promised checkout e-statement. No email yet, today is already Jan 2nd (1 minute task). p.s. Room 626 is febreezed to death to mask cigarette odor, ask for the room if you don't believe me.", "user": "Edster1971", "date": "January 2, 2013", "id": 148654478}, {"rating": 2.0, "stay_parameters": "Stayed December 2012", "text": "I stayed one night and felt like one of those roadside motels, nothing like what I expected for what they charged ,breakfast was not included and they put me on a floor under renovation, i was alone and did not enjoy at all", "title": "Worst value for money, overpriced", "user": "FamiliaMattos", "date": "December 29, 2012", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 3.0, "service": 2.0, "rooms": 3.0}, "id": 148292616}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "I had to write this review after seeing other reviews that really confused me. I'm a neat freak and extremely fussy when it comes to hotel rooms. The room was spotless and the bathroom was spacious and decorated in an old fashioned, yet modern style. The room was extremely quiet despite being near a highway and airport. The customer service was a bit uneven, but every problem I encountered was handled in a timely and professional manner. The food met or exceeded my expectations. If you are looking for a five star hotel room with a view, you will not get it here. The area is pretty awful but if you need a clean, comfortable room,then stay here.", "title": "Great hotel", "user": "Diggerdog63", "date": "November 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 145933645}, {"rating": 1.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "Okay. So we arrived at JFK from Rome without a reservation and needed a one night's lodging. I thought a Sheraton would be a safe bet. Called reservations and confirmed a double bedded room for my daughter and myself. We arrived and reception told us we would have to share a bed, then seemingly bragged about making other guests do the same, but thanked us for being more agreeable about it. (The other guests were a mother and her older teenage son!) the lobby was from a scene out of a horror film with dark hallways and dangerous characters lurking around every corner. We couldn't get behind our locked door quick enough. The one robe in the room was without belt and covered in stains. One pillow case had red stains on it and the cleanliness of everything in the room was questionable. There was no tv remote. The place was freaky! The AC did work and we managed to get cable. We were only awakened once in the night by what we thought was thunder, but realized had to be something else still unknown. You would not take a walk in the neighborhood. There were security gates on the parking and entrance lots. The \"club lounge\" was a lost cause with a coffee machine without cups and more buttons than a Las Vegas slot machine. We called the front desk to inform them the hot breakfast was in need of refurbishment and they failed to appear over the next 30 minutes. The front desk did manage to summon a taxi for our departure to Manhattan; we couldn't leave soon enough. Frankly, the worst overnight stay of a lifetime!", "title": "Enter at your own risk", "helpfulness": 1, "user": "revsec", "date": "November 20, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 145847530}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "We just traveled to South Africa on a Safari. We decided to drive up to NYC the day before our flight to Johannesburg. But where to park? The Sheraton has a great package that allows you to stay and leave the car. I didn't expect much from a hotel that gave us 7 days of parking and a room in NYC but boy was I surprised. Down pillows, pillow top mattress, free WiFi etc, etc. Oh, and when we returned, just catch the free shuttle back to get our ride. But, hey this is only the hotel!", "title": "Stay, Park & Fly", "user": "Eagles2009", "date": "November 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145847090}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The hotel is clean and fairly close to the JFK airport. I wouldn't stay here on vacation as there's nothing to do in the area, but if you need a place to sleep between flights, this was just fine. The restaurant has a bit to be desired, but the hotel was just as expected: no frills but clean and a nice staff. We would stay again if we needed a hotel during a layover.", "title": "Decent for a night between flights", "user": "TravelForLife84", "date": "November 18, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 145679188}, {"rating": 1.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Being so close to JFK airport, the hotel is literally within a busy and noisy freeway and next to sort of like a rehab center. There's nowhere to go or walk around the area at all. The room is small and dark shouting for renovation. There was no minibar, only a coffee brewer. The elevator of the hotel is soo slow, it takes more than 5 mins from the 7th floor to the ground level. The pool was closed filled with junk chairs. They only have one food outlet that looks very busy everyday. Housekeeping were inconsistent in cleaning coming in different times of the day. When you leave a do not disturb sign, you need to call them and inform that you have removed it already otherwise they will never return. The receptionist were not friendly nor helpful. They have a frowning security guard standing in the lobby who gives everyone a strange stare... Stayed for a month but we had no choice as it was the hotel that the company had an agreement with. Worst hotel in any shape or form!", "title": "Horrible", "user": "Renjie", "date": "November 13, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 1.0}, "id": 145326826}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "For just a night before catching a flight, it was adequate. Since our stay was right after Hurricane Sandy, perhaps they were understaffed--many plates of food sitting in the hallway outside the rooms at 2 pm. The bed was very comfortable and the doorman went out of his way to get us a USA Today paper. The spinach artichoke appetizer and Shiraz wine served in their restaurant were excellent. We were not aware that the shuttle would first stop at Federal Circle and that we would need to get off and onto another shuttle to the airport, but in our case only took a few minutes more. Would be good for staff to mention this.", "title": "Fine for a short stay", "user": "hongkongsue_10", "date": "November 8, 2012", "detail_rating": {"value": 4.0, "sleep": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 144957961}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Hotel is minutes from JFK and offers free shuttle service every half hour. Our room was quickly and effortlessly changed (to a better one) since it reeked of cigarette smoke and dirty sock smell. The beds and pillows where very comfortable, clean bathroom and great water pressure. I must add that the chicken wings offered at the restaurant where amazing!! We appreciate the staff for taking the time to call us to see if the new room met our expectations.", "title": "Perfect for a stop over.", "user": "Pepecrusader70", "date": "November 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 144802344}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "I decided to pay a bit extra to treat my family to comfortable stopovers before and after flights to Europe, and regret it. Surly staff, sewer smells throughout the area, booked room type not available without an argument (they wanted me to accept a single room for two adults and two kids), room key-cards not working even after replacement, need to run the tap for 5 minutes before getting hot water, filthy hallway carpets..... To top it all off they double charged me on a pre-paid reservation, and ignored my emails and phone messages for months before finally giving me a refund. I won't be staying there again.", "title": "Sheraton in name only", "user": "maccaspooksralu", "date": "October 26, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 143750634}, {"rating": 4.0, "stay_parameters": "Stayed October 2012", "text": "Great hotel. The rooms are big and comfortable. The staff are friendly and helpful. I would def recommend this to others.", "title": "Very home like feeling", "user": "Leacp26", "date": "October 7, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 1.0, "service": 5.0, "rooms": 5.0}, "id": 142227422}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Only downside is location. Not a great area and very far from everything.", "title": "A pleasant experience", "user": "Wanyi T", "date": "October 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 142030228}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "If you are on a business trip, then this is for you!!", "title": "Quiet and clean", "user": "ReneeD700", "date": "October 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 141992998}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "There were mixed reviews about this hotel and I chose to stay there because I secured a special deal. I called from Federal Circle and the shuttle arrived within 5 minutes. It was a spacious mini bus as opposed to a little van and it was shared with the Hilton Garden Hotel next door.", "title": "Newly renovated and comfortable", "user": "Robb T", "date": "September 29, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 1.0, "service": 5.0, "rooms": 5.0}, "id": 141610937}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Check in took close to half an hour because there were two families ahead of me with many questions. The young man at Reception was cool and professional throughout - he had to answer phone calls every other minute at the same time.", "title": "Great staff saves this hotel, but barely", "user": "jbromfield787", "date": "September 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 1.0}, "id": 141270712}], "location": {"country": "United States", "city": "Jamaica"}, "stars": 3.5, "variance": {"poor": 29, "average": 54, "very good": 58, "terrible": 27, "excellent": 43}, "aka": "Jamaica Sheraton", "slim_ranking": 0.538461538462, "description": "The Sheraton JFK Airport Hotel is a new, full service hotel featuring a sleek design, and everything you need to be comfortable and productive. Located just 0.5 miles from John F. Kennedy Airport"}