{"user_rating": 2.0, "review_count": 33, "name": "Shores Inn & Suites", "reviews": [{"rating": 3.0, "title": "Good Value in Ventura", "text": "I booked online at an affordable price and stayed 2 nights at the Shores Inn. I didn't spend much time in my room but my room was clean and comfortable. I did have a problem with a running toilet but the girl at the front desk sent someone to fix it while I was out so my problem was resolved. The inn was ok for the money I spent and was located walking distance to the beach.", "helpfulness": 5, "user": "DallasDev", "date": "August 11, 2005", "id": 3754954}, {"rating": 1.0, "title": "What a DUMP!!", "text": "My sister and I just got back from our \"weekend getaway\" together one week prior to my wedding. It was the most horrible vacation that we ever experienced in our lives. After driving for a little over an hour, we found the place and pulled into the tiny parking lot that only offered enough spaces for just a few vehicles. We checked in and got our keys praying that the inside of our room would make up for the old and shabby outside appearance. WRONG... we opened the door and walked in and about cried as we looked around. Unfortunately, the website that we booked the room through forced us to pay online IN FULL with a credit card before confirming our reservations and the cacellation policy that this place had would not allow us our money back if we chose to leave, so we were stuck and just tried to make the best of it. The 32\" T.V. setting on the beat up old cradenza didn't work, so on our way out to eat dinner we found the desk clerk and complained. He walked to our room as we followed behind him, opened the door and stood in front of the T.V., then he pulled out his keys and stuck one into the hole where the power button used to be. The set turned on but the only thing we could see was snow. He played around with it for about 15 minutes and then stood up and said that he would take care of it while we were out. The rest of the place was disgusting, the bathtub had a thick layer of mold that went from one end all the way around to the other. The toilet seat was chipped and cracked in half on one side which made it difficult to set on without getting pinched. The refridgerator (so they call it) had to of been at least 20 years old and the size of a small Igloo ice chest. Every time we put something in it, it slide right out onto the floor. We lost a full bottle of SOBE which shattered all over, and then a can of Diet Pepsi fell out and started sprayed everywhere. As careful as we tried to be, we ended up cleaning up messes every time we went for a cold drink. They claim to offer a continental breakfast which turned out to be a little table set up in the office that held a nasty old pot of coffee, a few cups, condiments, and a tupperware full on corn flakes. The website claimed that there was a coffe/tea maker in our room which was never to be found. We had to take cups from the continental breakfast table in order to heat up water for our own coffee. On the ceiling and wall in our room, you can see where the smoke detectors used to be - which goes against all fire prevention laws. The first morning that we were there, the maid knocked on our door. When I opened it, she walked right in and started making our beds. She asked me to go get our used towels so I did and when I came back with them she told me to throw them on the ground outside in front of our door, then she handed me some new unfolded ones. Then I had to pull the trash bags out of all the trash cans and hand them to her. The room was so depressing, we just couldn't wait to get out of there and go home.", "helpfulness": 24, "user": "A TripAdvisor user", "date": "August 1, 2005", "id": 3728373}, {"rating": 1.0, "stay_parameters": "Stayed May 2007", "text": "Do not stay here! We were in Ventura for a wedding and decided to stay at a \"nice\" place by the beach. I should have talked to a friend, who is a local cop, before booking it. The place is a mess and a haven for the local \"riff raff.\" A number of the guests appeared to be on parole and the rooms were disgusting. Apparently the hotel has a reputation with local law enforcement. Next time we'll pay the extra $ and stay at one of the more upscale places. Hope this saves some people the disappointment we experienced.", "title": "Dirtbag Inn", "user": "CalTraveler45", "date": "May 19, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 7646647}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We were hoping for charm, but found holes in the wall, knobs missing, etc. perfect for drunk surfers,,,", "title": "Slumming At Its Finest", "helpfulness": 2, "user": "grathy", "date": "September 24, 2006", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 5831465, "likes": {"liked": "— location", "disliked": "— hygene"}}, {"rating": 1.0, "title": "Had to by Lysol", "text": "We booked two roms at this motel, as it is in a great location.", "helpfulness": 1, "user": "Floorseller", "date": "July 31, 2006", "id": 5534139}, {"rating": 3.0, "title": "Comfy and Cozy...You only sleep there.", "text": "That is the best thing I can say. Old motel, desperate need of updating. Unclean carpet. Ragged window coverings. Noisey.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "May 14, 2006", "id": 5068601}, {"rating": 3.0, "title": "Okay for a quick cheap getaway", "text": "I went to the closet drug store and bought Lysol and mold an mildew remover for bathroom.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "November 26, 2005", "id": 4145037}], "location": {"country": "United States", "city": "Ventura"}, "variance": {"poor": 0, "average": 4, "very good": 4, "terrible": 22, "excellent": 3}, "aka": "Shores Hotel", "slim_ranking": 0.95}