{"user_rating": 4.0, "review_count": 1337, "name": "Shore Club South Beach Hotel", "reviews": [{"rating": 1.0, "title": "the suite felt like a dorm/jail/dungeon/cave", "text": "Don't stay at this hotel! It's not worth the price AT ALL! The floors are concrete and when you get into your very uncomfortable firm spring mattress at night you will have debris from the floor all over your feet! Also, the floor had stains all over it. Everytime I took a shower it flooded into the hallway and I would have to end up wasting a bunch of towels trying to clean it up. The hallways are very dark and I felt like I was going to a cave/dungeon everytime I entered my suite. It's very very loud at night! I heard the elevator ALL NIGHT making it's DING noise! People party until at least 3-5 a.m. every night.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 15, 2006", "id": 5350169}, {"rating": 4.0, "title": "Very chic, very Miami", "text": "If you want to make a local call they charge 15 cents a minute and they even charge for $1.00 for toll free calls! We requested a rollaway bed the first night and never got it and one person had to sleep on a loveseat! The second night we requested a rollaway again and three hours later we still had not received it so I called for the third time and they said they were all out! They did finally bring us one AFTER I told them that we had reserved one the first night and never received it...so basically I felt like they were not being honest when they said they were \"out\" of rollaways. The rollaway had stains all over it also! They charged us $800/night for our suite, then $20 for a chair at the beach and a$30 per umbrella! The breakfast buffet is $70 for two people. Unless you are willing to spend $800/night for a dormlike hotel I wouldn't recommend it to anyone! :(", "user": "A TripAdvisor user", "date": "June 9, 2006", "id": 5327058}, {"rating": 4.0, "title": "Superb for parties, not so unique accommodation", "text": "We stayed just one night at the Shore Club on the first night of a three week trip round the States and we were suitably impressed with the hotel. The foyer was swathed in white floaty fabric and the rooms were minimalistic and modern. The bed was incredibly comfortable and the outside areas were very comfortable. It was exactly what I would expect from Miami so was thrilled to stay there. The room we stayed in was a small suite and had a separate living room. The bathroom was fab with a great shower. Even the freebie shampoos were lovely (although if you wanted to buy them, they were v expensive). All in all we liked the hotel and the location right on Miami Beach but wish we had longer there to look around.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "June 6, 2006", "id": 5314495}, {"rating": 3.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "Took inspiration from our international jet-set friends, and decided to reserve the Shore Club main pool area for the Bharell Jackson US brand marketing campaign this March, just before the Miami International Sound Conference. Having read some of the reviews on this site, it is with great surprise I shifted through the comments. Ian Schrager is known for designing minimalist, highly spectacular hotel and bar venues for a progressive, young-minded clientele - NOT for old-money, top-to-bottom refinement a la Four Seasons.", "title": "not worth the price", "helpfulness": 2, "user": "RunnerGirlNY", "date": "May 31, 2006", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "rooms": 4.0, "service": 4.0}, "id": 5288202}, {"rating": 1.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "Take it for what it is, an experience that definitely should be enjoyed when in South Beach. Room prices are slightly over the top, and as such I would recommend The Setai for an exceptional oceanfront condo hotel experience. But for the late-to-forget party/drinks soiree, this is hand down the place to embrace.", "title": "Disturbingly Awful", "helpfulness": 8, "user": "RobertaAnthony", "date": "May 16, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 2.0}, "id": 5079126}, {"rating": 1.0, "title": "Very Poor Service, Decrepid Hotel", "text": "The week long stay at the shoreclub was about 7 days too long. The staff is incredibly rude, the rooms incredibly small, and with the exception of one bell boy we never saw good service. Though we expected small rooms, the bathroom was in poor condition with the tub leaking every time someone showered. This mean huge puddles throughout the bathroom into the hallway, and the beginning of mold and rot on the bathroom door. The walls are also paper thin and at one point I could hear someone pull a chair out in the next room. A hotel is supposed to get you access to the SkyBar, but my friends who came to meet me never had a problem getting in. And there are far better pools in other Miami hotels, where the pool staff is much friendlier and service-oriented as well. All in all an extremely disappointing experience I would never stay there again, not even for free.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "May 14, 2006", "id": 5067115}, {"rating": 5.0, "title": "So cool, So chic, great vibe", "text": "I recently stayed at the Shore Club with my husband for a weekend of relax. I was surprised by the front office, bell & concierge staff. Everybody smilled, offered assistnace, opened doors. So refreshing to see in South Beach. Every day I was greeted by what I assume is one of the managers (a tall blond guy). This was my second time in the hotel, the last stay in June of 05 was a dissaster. Whatever they are doing now is working so hopefully they will keep it up. Nobu was amazing and the pool staff was great.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "May 3, 2006", "id": 5030689}, {"rating": 1.0, "title": "Never Again!!", "text": "I will be staying at the SC next year for sure!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "May 1, 2006", "id": 5025162}, {"rating": 1.0, "title": "Terrible Terrible TERRIBLE!!!!!!!!!!", "text": "The Shore Club was definitely not worth the money. The hotel was average and the service was terrible. We had to catch our own taxis, housekeeping took forever to bring fresh towels and the staff couldn't even recommend a place to eat breakfast (one staff member said that they didn't know the area and the other one told us that there was a bodega across the street). We ordered food on the beach and after an hour of waiting for it to come, they forgot one of the $18 hot dogs. When we told the waitress, she didn't even care and never even brought it. Poor Pamela never got her hot dog!!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "April 27, 2006", "id": 5013739}, {"rating": 1.0, "title": "40 minute stay . . . done", "text": "The pool area is nice but it's really hard to get a chair. You need to get down there by 8 am. If you sit on the beach, they only provide 2 free chairs. We had 3 people in our room (which we were charged extra money for) and still had to pay $20 a day for a lounge chair.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "April 12, 2006", "id": 4967108}, {"rating": 2.0, "title": "Nice place to party at night but I wouldn't stay here again!", "text": "Stayed at the shore club from July 19 -24 2006. I wanted to stay there after my night time / clubbing experience from a previous south beach visit. The minimalist concept was not appealing to me. Especially for the price that was paid for the room. Over $450 a night for an ocean view. All white rooms with concrete floors makes anyone feel like they are in an insane asylum. I did not feel like my room was priced accordingly to my accomodations. I would have much rathered stayed at the Loews South Beach. Would not do it again. However, if you get a chance to check out a party there....do it. But if you think your lodging experience will be the same as the night life there...don't hold your breath. To top it all off, the housekeeping staff sucked! PS --> I agree with the previous reviewer who stated that this hotel is on the wrong side of the beach.", "helpfulness": 2, "user": "Welltraveledone", "date": "August 5, 2006", "id": 5560841}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "I was concerned about the negative reviews but decided to take a chance with the Shore Club as the pool looked brilliant. Arrived at 7.30am after an overnight flight and was lucky enough to be able to check in straight away. Hotel has two blocks and we were in the smaller 8 floor block which I suspect is quieter than the main one. Initial reaction of room was that it smelled damp, however we must have got used to this over our 4 day stay as it wasn't a problem. We did not have a view - looked directly into hotel next door.", "title": "phew...turned out ok", "helpfulness": 2, "user": "annekr", "date": "July 21, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 5494232}, {"rating": 2.0, "title": "Way too expensive", "text": "The concrete floor mentioned by others isn't at all nice and the room would improve immensely with a carpet. The military style beds were surprisingly comfortable. Hotel is obviously geared to short stays as storage consists of a small wardrobe and two drawers - we chose to live out of our suitcases! There were a lot of 'things to purchase' in the room including t shirts, toiletries etc which is a bit off. Free toiletries were provided but not replenished during our 4 day stay.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "July 13, 2006", "id": 5463965}, {"rating": 4.0, "title": "Beautiful place", "text": "To get in to the pool area you had to show your guest card - there was security at both entrances which felt over the top as other hotels don't need it. Pool area was lovely but we didn't order too many of the extortionately priced drinks. In fact we breakfasted by the pool on food from the lovely french bakery close by and no-one said a thing!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "July 11, 2006", "id": 5449565}, {"rating": 2.0, "stay_parameters": "Stayed July 2006", "text": "Hotel is a bit further away from Ocean Drive than other hotels we have stayed at but it was walkable. My daughter is under 21 so we didn't go to Sky Bar other than early on our last night when I ordered two gin martinis at the bar ($28) - we couldn't drink them and when I asked what was in them it was pure gin - no vermouth or anything. He said that was how they served them there! We got some juice to make them palatable.", "title": "A hotel for wanna be's", "helpfulness": 3, "user": "Jhc42678", "date": "July 5, 2006", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 5427660}, {"rating": 1.0, "stay_parameters": "Stayed February 2006, traveled on business", "text": "The lobby might look cool at first glance with the long, flowing white fabric, but do not be fooled- underneath all the trendy decor is really just a bad hotel with even worse staff. Do not stay here! The rooms are anything but comfortable and welcoming. The floors are cold, damp, grey, grey cement. The rooms smell like mold. My shower had a TREMENDOUS leak and no one ever came to fix it (and I was there for 7 nights!). The water trailed out from the bathroom, into the closets and out the front door. It was ridiculous. The hallway floors from the elevators to the rooms are also the same grey cement, so when trendy girls in their high heels tromp back to their rooms after a night of drinking, it echos throughout the entire floor. To make everything even worse, the staff was rude. Not even indifferent, but just plain rude. For example, I called the front desk and asked them to please connect me to another guest. I gave him the name of the guest and he acted like I was totally putting him out. He said in a very exasperated tone, \"Do you know the room number?\" I did not (or I would have just dialed it myself) so I said, \"No, I'm sorry I don't, but I know he's on the third floor.\" And in one of the most sarcastic, snotty voices I have ever heard, he replied, \"Oh, that really helps- NOT!\" Ok, so I just ignored this guy and figured I got a bad seed. Not the case. I had bad experiences with about 5 other staff members. And the valet parking guys sometimes just, \"Forgot to get the car,\" and they'll even tell you that in a very unapologetic way after you inquire because you've been waiting for 20 minutes. I could go on and on, but I will just say that this is one of the WORST hotel experiences I have had. Nobu, the restaurant, is great, and the nightlife in the hotel is very cool, espcially by the pool area, but this is somewhere you want to go out, not stay. And, just so you know, 5 of my co-workers also stayed here, and we all had the exact same thoughts and complaints about this place. I assure you I am not being high-maintanence or picky. Thankfully, I was on a business trip when I stayed here, so my company payed for the hotel, but I would have been so upset to have spent my own money on it. For that reason, I am writing this review because I would hate anyone to waste their money on it- as it is not cheap and TOTALLY NOT WORTH IT!!!! Please do not stay here.", "title": "Rude staff. Smelly rooms. $18 hotdogs. Need I say more?", "helpfulness": 5, "user": "Jessicasallyo", "date": "April 6, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 4942243}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "We stayed here for 4 days in March with another couple that we always come to Miami with. It was our first time staying at the Shore Club despite other years that we had spent eating at Nobu and having drinks at Skybar.", "title": "Enjoyable stay at the Shore Club, but...", "helpfulness": 9, "user": "gandrtm", "date": "April 4, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "service": 3.0}, "id": 4895248}, {"rating": 2.0, "stay_parameters": "Stayed February 2006", "text": "First off, let me say that we did not pay full-price or \"rack\" rate to stay here and we never would pay that!! Most hotels in South Beach are not worth the price you pay for the room/amenities you receive, and the same holds true for this property. That being said, everything does seem a bit nicer when you are paying a fantastic rate. Would not stay at SC for full-price.", "title": "Failing even at style over substance", "helpfulness": 2, "user": "funkdom", "date": "March 10, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 2.0}, "id": 4597583}, {"rating": 3.0, "title": "Ultra cool, poor rooms", "text": "If you are looking to be pampered, catered to every second, looking for honeymoon hotel, this is not it! It is a very scene-y hotel with great common space/restaurants. The rooms are minimal and not bad but not fabulous either. Our favorite part of the room was the enormous shower we had. If you want a great pool scene, nice beach, and gorgeous chill/lounge/restaurant areas, this may be the place for you.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "March 2, 2006", "id": 4569029}, {"rating": 1.0, "title": "Go for a drink. Stay somewhere else", "text": "There is a 24-hr workout facility (don't know how it is bc we didn't go), a few high-end retail shops, and two restaurants- Nobu and Ago. Nobu has amazing sushi and a busy bar scene. Highly recommended. There are two bars, including Skybar which is great. When you are a guest, you have a guest privilege card that the hotel security checks for pool area entrance and beach chair service. They also check this card when they are closing Skybar at night and you get to stay longer if you are a guest.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "February 26, 2006", "id": 4522723}], "location": {"country": "United States", "city": "Miami Beach"}, "stars": 4, "variance": {"poor": 113, "average": 162, "very good": 377, "terrible": 120, "excellent": 565}, "aka": "Shore Club Hotel Miami Beach", "slim_ranking": 0.173469387755, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Designed by famed British architect David Chipperfield, with landscaping inspired by the rich Matisse-like palette of the Jardin Majorelle in Marrakech, Shore Club shimmers with intrigue and sensuality. Anchored by the original polished terrazzo floor, the elegant furnishings are an eclectic mix evocative of global marketplaces—including relaxed sofas, hand-woven tribal rugs and large patterned throw pillows from Kenya that invite mixing and mingling. The vibe is lively, the atmosphere intimate, the feeling electric."}