{"user_rating": 4.0, "review_count": 645, "name": "Shutters on the Beach", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed August 2005", "text": "I had made a reservation for a \"deluxe ocean front\" room and I honestly expected to have a full unobstructed ocean view considering I was paying $695/night. Imagine my disappointment when, after waiting until 6PM for this room (check-in time is supposedly at 4PM, but our room was not ready), we were placed in a room that had a view of the alleyway, the roof top of the building in front of us. We have a very nice view of the pipes and air-conditioning units on top of the roof, as well as the smoke coming out from the restaurant, and if you stood on your tippy-toes, you could see the ocean... and of course, when we complained about the room, we were told that no other rooms were available, and if we wanted to go to a different hotel, we would still have to pay for the night.", "title": "Beware of the so-called ocean front rooms", "helpfulness": 9, "user": "PeckCheck", "date": "September 13, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "service": 1.0}, "id": 3898149}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "After much discussion with the general manager, we eventually got a room the next night right on the beach which was wonderful, and definitely what I expected the first time around.", "title": "Wonderful experience!", "helpfulness": 1, "user": "VejerLinda", "date": "August 1, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 3727348}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "On the plus side, the rooms are quite nice and all newly renovated. The restaurant One Pico is also quite good.", "title": "Shut me in at Shutter at the Beach", "helpfulness": 4, "user": "onlyfirstclass", "date": "July 23, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3695603}, {"rating": 1.0, "title": "Billing Nightmare still not resolved", "text": "I do believe that this hotel just relies too much on the beach as its major selling point, which then translates into indifferent service. When I check into an upscale hotel, I expect an upscale service (think four seasons), and this was sorely lacking here.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "June 27, 2005", "id": 3614404}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "So just be careful when you make a reservation for an \"ocean view\". Not all the rooms are equal.", "title": "Casual elegance", "helpfulness": 8, "user": "Equity", "date": "March 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3305034}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "Stayed from 23-29 Dec 2005. Had a non-ocean view room (as OV was sold out), but still had a private terrace with seating and a flowerbox. No direct view, as room was slightly below the pool's ground level. This was as expected though, so not a problem. Room was very comfortable - fabulous bed, whirlpool tub, flat LCD TV, books/DVDs available in room. Staff were universally polite and cheerful. Hotel lobby is a nice place for having winter drinks by one of the fireplaces. The One Spa is small, but treatment areas are well equipped. (Facial from Dijana was great - no lingering red marks on my very sensitive skin!) Food is expensive (but good) here and also at the Casa Del Mar next door, where Shutters guests also have signing privileges. Even though I spend my work life in hotels, this had a wonderful \"private cottage\" feel. (Shutters is more cottage-like in style, where Casa Del Mar is more formal Villa-style.) I will return as soon as scheduling allows! NOTE: It may be possible to find more reasonable room rates on Expedia...worth a look. But check out the hotel's own web site for pictures.", "title": "Wonderful Christmas stay", "helpfulness": 4, "user": "SW10UK", "date": "January 16, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "service": 5.0}, "id": 4356137}, {"rating": 5.0, "title": "Highly Recommend Shutters On The Beach", "text": "My husband and I recently stayed at Shutters On The Beach and would highly recommend it. The standard and comfort of the room, service not to mention the fabulous ocean views of Santa Monica beach at our doorstep were not to be under rated.", "helpfulness": 2, "user": "aquadoll", "date": "January 5, 2006", "id": 4327371}, {"rating": 5.0, "title": "Perfect getaway", "text": "Although we visited at a cold time of year, the ambience of the fireplaces offered cosy moments to unwind and relax.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "December 16, 2005", "id": 4245779}, {"rating": 2.0, "title": "Disappointing", "text": "Well located to shops, restaurants, gyms and just about anything else you may desire - this place will be on our list for a summer time vacation!", "helpfulness": 7, "user": "A TripAdvisor user", "date": "December 2, 2005", "id": 4159208}, {"rating": 5.0, "title": "Most improved hotel bar none!", "text": "Spent last weekend (December 9-11) with my other half at Shutters as a mni-break, just to get away from house construction. Room was extremely comfortable, every need thought out. Bath outstanding. Bed large and cozy. View across the rooftops to the beach (even December in LA is a little chilly, so pool and beach somewhat deserted) is lovely. Great dinner at One Pico. Perfect antidote to the hustle and bustle of LA--and more serene than other area hotels. The service, from the valets to the front desk to room service was always prompt and very friendly, but not obsequious. Friends in NY and London regularly and steadfastedly swear by Shutters, now I know why.", "helpfulness": 3, "user": "NYCBeachBoy", "date": "December 2, 2005", "id": 4158846}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We stumbled across Shutters by chance on Stayz and wow werent we lucky", "title": "Weekend Getaway", "helpfulness": 1, "user": "Susanna61", "date": "February 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151279998}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "On arrival Ange gave us a guided tour of the house, 3 story's of an amazing architecual beauty.", "title": "Fantastic Place to relax & enjoy the sunshine.", "helpfulness": 1, "user": "Peter F", "date": "January 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 150719840}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We have travelled all over the world and have to say this would be up there with the best we have stayed at..", "title": "What a place!", "user": "katel", "date": "November 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145987703}, {"rating": 5.0, "stay_parameters": "Stayed November 2012", "text": "I normally would like to eat out but found it hard to leave this place and sorry to leave but will defenatlly be back one day with family and firends to share this find....", "title": "It felt like we were so far away, yet so close to everything!", "user": "Lopati", "date": "November 22, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 145949039}, {"rating": 4.0, "stay_parameters": "Stayed November 2012", "text": "The Kitchen is fully equipped with more actually Ive never seen a kitchen that was so decked out.", "title": "Amazing house in secluded location away from the rest of the world!!", "helpfulness": 1, "user": "Holyday79", "date": "November 20, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 145799028}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "I will say that any review like this is a snapshot in time. Maybe I caught them when they had their best crew or was able to secure a great room with a great view out of sheer luck. However, I will say that my entire experience was pleasurable. Although our room was not huge, it was elegant, clean, tastefully decorated and quiet. My view was superb. I found the service to be first class from the valets, to the front desk, to the maid service. I felt that I paid a fair price for the value I received.", "title": "Wonderful", "helpfulness": 1, "user": "STL2Maine", "date": "November 13, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4109202}, {"rating": 1.0, "title": "Definately Over-rated!", "text": "The expectation did not live up to the reality. The rooms themselves are quite cozy...however, upon opening our 'shutters' and the tiny balcony window, we were treated to a deluxe view of a public parking lot, complete with noisy SUVs circling endlessly for a spot,and a scary arguement between what appeared to be illegal immigrants. We were even lucky enough to be reminded of the occasional homeless prescence.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "October 25, 2005", "id": 4052565}, {"rating": 4.0, "title": "Fantastic (if your willing to pay)", "text": "The restaurant(One Pico) was excellent however. Nice, but not worth the money.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "October 17, 2005", "id": 4027689}, {"rating": 1.0, "title": "Shutters on the beach after the fire", "text": "Checked in for 3 days (2 nights) just in the last week. At this time of year and staying thursday-sat, the place seemed relatively empty.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "September 25, 2005", "id": 3938515}, {"rating": 3.0, "stay_parameters": "Stayed March 2005", "text": "No problems finding ample space on the pool deck for some relaxing, often alone in fact. Great service by every member of staff we came across. Rooms were fantastic. We walked in and got a \"non ocean view king\" for $325 a night + tax - even though the room had a relatively unobstructed ocean view anyway!", "title": "Nice hotel, but....", "helpfulness": 6, "user": "shelgreb", "date": "September 21, 2005", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "rooms": 4.0, "service": 2.0}, "id": 3927206}], "location": {"country": "United States", "city": "Santa Monica"}, "stars": 4.5, "variance": {"poor": 45, "average": 69, "very good": 175, "terrible": 33, "excellent": 323}, "aka": "Shutters On The Beach Hotel Santa Monica", "slim_ranking": 0.294117647059, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Shutters on the Beach is more than just a spectacular place to stay, it’s the epitome of Southern California’s breezy lifestyle. This captivating hotel is located directly on the sand and within walking distance of the area’s biggest attractions including the Santa Monica Pier and hundreds of shops and restaurants. For business or pleasure, this quintessential beachfront hideaway is known as the place the high-profile go to be low-profile."}