{"user_rating": 5.0, "review_count": 9, "name": "Siarava", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "This is a small (6 rooms) family-run guesthouse just across the street from the lake and a five minute walk to bars, restaurants, and the fortress.The owners are super-nice and helpful. The room (1st floor front) was lovely, immaculate, and comfortable with a lot of character. That particular room has a balcony and is a bit larger than the other rooms on the floor. Nice, modern bathroom. The building is a recent renovation, so there are plenty of electric outlets in the room. There is wired internet in the room and wifi in the reception. As good as the front room was, it did get some street noise at night. There is a bar/restaurant next door and Greeks do love to stay out all night on weekends. Rooms on the backside overlook a quiet courtyard.", "title": "Great choice - unbelievably inexpensive for the level of quality.", "user": "Massimo1", "date": "November 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144862422}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "This hotel is in every detail excellent! The owners are very friendly and nothing is too much trouble for them in assisting you. It shows that they love their hotel and that they put very hard work in making this hotel so perfect. The rooms are very nicely decorated and the modern touch is flowing perfectly with the traditional style. We selected their suite for our stay even though it was more expensive it was worth it in every way. We didn't have time to eat breakfast in the morning but I am sure we would enjoy that too. The hotel has a playroom in the bottom floor where you can spend time with your company without worrying over disturbing the guests. Building this hotel was as the owners explained their dream hobby and it is a very interresting story to hear about how they managed after all the difficulties they met. I would love to visit this hotel again and this time enjoy the breakfast in their private backyard. We stayed there in August 2011 but the great impression it left us will stay in our minds very long!", "title": "Excellent Hotel!", "user": "Ioannis P", "date": "September 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141211696}], "location": {"country": "Greece", "region": "Epirus", "continent": "Europe"}, "variance": {"poor": 0, "average": 0, "very good": 1, "terrible": 0, "excellent": 8}, "slim_ranking": 0.148936170213}