{"user_rating": 4.5, "review_count": 487, "name": "Siddharta Boutique Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We stayed here as a base for our cycling trip around Siem Reap. Check in was no problem.", "title": "Quiet Location, nice pool and rooms", "user": "JARMelbourne", "date": "December 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 121796669}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "Good sized room, we had the honeymoon suite. The room had a tiled floor, which is not uncommon in Asia. The shower was great after a long day's cycling.", "title": "Fantastic home base for discovering Angkor.", "user": "mmrbluewater", "date": "December 14, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 121734705}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Breakfast was solid, we had eggs made to order each morning. There was a small buffet selection, which also included a flourless chocolate cake.", "title": "Fantastic.", "helpfulness": 2, "user": "Laonie", "date": "November 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121270238}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "After cycling we sat out on the verandah and had a beer. This was a great way to chill out.", "title": "Great rooms, great pool area", "user": "Sabine H", "date": "November 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 121183522}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "We ate out each night using our Tuk Tuk to take us there.", "title": "Great value for money", "user": "sangeeta84", "date": "November 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 120989280}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "We just finished our stay in this lovely hotel. The staff were so nice and really friendly. The rooms are lovely and the hotel is in a good location, nice and quiet area. The breakfast is very good and once again served by staff always with a lovely smile on their faces. We ate in the restaurant one night of our stay as well and it was also good food, reasonably priced to the restaurants in town. Would recommend using the tuk tuk drivers the hotel can organise to use for the day, they are available from sunrise to sunset and are lovely people and at $15 for the day this is a excellent price. It was nice to come back to a friendly face awaiting us after visiting the temples, with a nice cold bottle of water. Ask for Phan You, he was a lovely driver. Overall this is one of the nicest hotels I have stayed in travelling around the world, they even had a surprise birthday cake in our room for my partner on his birthday! It makes such a difference staying in a hotel where all the staff are so friendly and genuinely appreciate your stay. I would also recommend a day trip to Beng Malea, this temple is amazing.", "title": "Excellent hotel, lovely friendly staff", "helpfulness": 1, "user": "tazzagazza", "date": "August 23, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 117110342}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We had a great time, the hotel is new, super clean, spacious rooms, very good complimentary breakfast in the terrace. The complimentary tuck-tuck is just fantastic to get from the hotel to the temples to restaurants, downtown, etc.", "title": "Great hotel!!!!!", "helpfulness": 1, "user": "LAURAELENA", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116261088}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "The hotel is in a very quiet neighborhood.", "title": "The staff made our stay unforgettable!", "helpfulness": 1, "user": "VeeTee_11", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115946051}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "My friend and I stayed here for 3 nights and we felt like VIP’s from the moment we checked in. The reception staff are so lovely, especially Mr Doh So and Painba – who always greeted us with a smile and were always there to help us. The rooms are really spacious and nice, the beds are comfortable and it was always clean. We had an initial problem with the hot water in our shower but as soon as we informed reception, they sent someone immediately to fix the problem.", "title": "Great find - good value and very hospitable staff!", "helpfulness": 3, "user": "Jghargho", "date": "July 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115276958}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "The breakfast is also really great. Sophea was always there to brighten up our mornings with her pleasant and cheerful nature. There are three main options for breakfast (bacon & eggs, fried rice and noodles) plus a fruit platter, breads, croissants and orange or mango juice. We also had dinner here one night and it was delicious and the prices were on par with the prices at other restaurants on Pub Street. There is also a computer available to use with internet access.", "title": "Lovely Little Hotel", "user": "islandfern", "date": "June 3, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 111263224}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We stayed four nights at the Siddharta Boutique Hotel. Large, clean rooms and beautifully landscaped gardens and outdoor areas. Ample breakfast with an array of fruits, breads, with a choice of eggs or omelet, rice and noodles and homemade yoghurt, which I think helps your digestive system. Extremely attentive and friendly staff. They arranged a tour of Kompong Phluk Village, a fishing village and a tour of the Floating Forest. Not to be missed and a highlight of our stay in Siem Reap. In addition, the Siddharta allowed us to shower and freshen up after returning from the fishing village tour. It was the last day of our stay in Siem Reap and we had already checked out and were headed to the airport.", "title": "Wonderful Experience", "user": "lei21", "date": "November 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120789549}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We highly recommend their massages; great value. A tuk tuk driver is included with your room rate. He was available during the day for our temple visits, lunch and shopping and later in the evenings when we headed out to dinner. Reliable and always on time! We didn't have to worry about transportation in Siem Reap. Overall, a memorable stay and a great compliment to the temples of Angkor!", "title": "You are like in your family", "user": "bruno m", "date": "November 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 120653079}, {"rating": 4.0, "stay_parameters": "Stayed November 2011", "text": "We stayed 5 days in the Siddharta Hotel in November 2011.", "title": "Great service (love the tuk tuk)", "helpfulness": 1, "user": "CatMcHard", "date": "November 12, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 120496423}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "It has been a great pleasure to stay at the siddharta. All of the staff is very friendly and really wonderfull. They always to do their best to satisfy you. The pool, the spa , the breakfust are very good. Room are very cleaned and well equipped.", "title": "excellent vacation hotel", "user": "5CM7", "date": "November 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120102331}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Staying at this hotel is like staying in the familly.", "title": "Four relaxing days", "helpfulness": 3, "user": "valschmitt", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119934465}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "I stayed three nights here while visiting Angkor Wat and Siem Reap. I originally tried to get a room at the Pavillon d’Orient, but they were fully booked. They referred me to the Siddharta Boutique Hotel, and I am very glad they did. The hotel is very nice, clean, quiet, and relaxing. The staff is extremely nice, helpful, and speaks good English. The front desk greets you upon check-in with cool towels and tea, and provides maps, local info, and sightseeing/tour guide options. The entire property seems fairly new, well maintained, and well appointed.", "title": "A great place to stay when visitng Angkor Wat!", "helpfulness": 2, "user": "flightlevel270", "date": "October 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119079348}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "Since I was traveling with a group of three, they had the room set up perfectly with one regular bed and one king-sized bed. The room was spacious, the mattresses were comfortable, and the A/C worked well. They have a good selection of cable channels in English and other languages, and the room has a nice flat-screen TV. There was construction going on next door that was audible during the day, but it wasn't too bad (it was quiet at all times while we were sleeping) and certainly isn't the fault of the hotel .", "title": "Very nice, clean, quiet and friendly", "user": "Orlyna", "date": "October 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118965727}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "Outside each room is nice sitting area that overlooks the pool area, which is is nicely landscaped. The pool is salt-water and was the perfect temperature. There are plenty of chairs and towels, and the staff is happy to bring drinks out to you. The upstairs restaurant is nice and the food is good. Daily breakfast was included, offering cooked-to-order omelets or fried rice (plus other standard continental breakfast items). The spa services were adequate for my needs and seem reasonably priced.", "title": "A nice hotel a mixture of the good and bad", "helpfulness": 3, "user": "j_f_remedialmassage", "date": "October 1, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 118802231}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "The hotel is located on a side-street off the main road between Siem Reap and Angkor Wat. I thought the location was ideal, being central to both places but far enough off the main street to be quiet. Having our driver made getting to Pub Street or other locations in town a quick and easy process.", "title": "Clean and very friendly staff", "helpfulness": 1, "user": "LuneMUC", "date": "September 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117802035}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "Our rate included pick-up and drop-off service, plus a daily tuk tuk driver. Our tuk tuk driver was Mr. Sothea Yan, and I highly recommend him. He is very nice, polite, speaks good English (he is self-taught), was always ready to pick us up, and was quick to offer bottles of water and cool towels. He was extremely flexible with our needs, and was always where he should be, when should be. I don't know if the hotel directly employs any drivers, but Sothea represents the hotel very well and they should use him frequently for their guests.", "title": "Amazing place - the perfect place to start my holiday", "helpfulness": 4, "user": "KarinEriksen", "date": "August 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117336761}], "location": {"country": "Cambodia", "continent": "Asia", "city": "Siem Reap"}, "stars": 3.5, "variance": {"poor": 1, "average": 6, "very good": 109, "terrible": 0, "excellent": 371}, "slim_ranking": 0.0817307692308, "detail_rating": {"service": 5.0, "cleanliness": 4.5, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Located in the midway between the center of Siem Reap and the Angkor temples, in a quiet and green area, the Siddhartha hotel is warmly welcoming you in an intimate and refined setting. This brand new charming structure, twenty-eight rooms only, while simplicity and elegance meet the colonial and secular Cambodian style."}