{"user_rating": 5.0, "review_count": 168, "name": "Siena House", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We have just returned from our Tuscan holiday and cannot agree more with the glowing reviews below. Siena House is a real gem of a find and it is with great reluctance that we are sharing it! Amanda and Malvin have found the perfect balance between being able to feel part of the house and be sociable with them and the other guests and being able to do your own thing and treat the house as your own – anything goes… The stunning house coupled with Amanda and Melvin's warm hospitality meant we have never felt so sad to move on as we did when we left. They are situated perfectly in the Tuscan countryside and there are day trips a plenty in all directions and whether you choose to dine in and sample their amazing cooking or venture out to one of the many excellent recommendations, you will be sure to have a great time - Malvin was armed with suggestions of places to see and things to do each morning as he served the delicious breakfasts. The décor is stylish and fun and so refreshingly ‘un-chintzy’ which is a rare find for Tuscany and the walls are decorated with many of Amanda’s great paintings – all of which are for sale and we happily snapped up an original Amanda Helen Atkins to remind us of our lovely trip and that fabulous room….nothing better than sitting in the bath, glass of wine in hand looking out of the window at rolling Tuscan countryside.", "title": "Just Perfect", "helpfulness": 1, "user": "continenthopperUk", "date": "August 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75406980}, {"rating": 5.0, "stay_parameters": "Stayed August 2010", "text": "We will most definitely be back and by the looks of things will have to book up way in advance, but rest assured that Siena House is an absolute delight and you get a lot more than you are expecting once you are there as some things you just can’t put into words on a website.", "title": "Fantastic hosts and absolutely lovely place - highly recommended", "helpfulness": 1, "user": "Snoop21", "date": "August 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 75383575}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Malvin, Amanda, Scarlett and Dino were such gracious and generous hosts. Both Chris and I were very lucky to have found Siena House and honoured to be their 15th guests. The moment we confirmed our rooms, we received a really nice welcome note with clear how to get there driving directions.", "title": "Thanks Amanda & Malvin !", "helpfulness": 2, "user": "MorningFog", "date": "August 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74802909}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We received a very warm welcome to the family and to the other guests who were staying there. Throughout our stay there, we were made so welcome and part of the family. Malvin and Amanda were both extremely helpful to recommend places to go, places to eat -- all of which were great recommendations as well.", "title": "Fantasic modern conversion in ideal location and welcoming family", "helpfulness": 2, "user": "ali902", "date": "August 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74342779}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Breakfast was such a treat with fresh Tuscan bread, ricotta cheese and fruit and of course happy hour too.", "title": "Fantastic Modernized Tuscan Villa", "helpfulness": 1, "user": "Anders_Normann1978", "date": "August 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73771935}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Where do I start? How do you rate a place with hotels ratings when you have experienced something completely different (and better)?", "title": "Excellent is not a rate enough for this place", "helpfulness": 1, "user": "ARUANO", "date": "September 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80052722}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Don`t get confused by the critics: This is not like staying with a family in an agriturismo where you are treated as one of them. The hosts, Malvin and Amanda, must have travelled a lot and know how to make an hotel stay perfect. Your sensation, unusual at it is, is that your staying in some friends house, for the quality and kindness of treatment, but, at the same time in the perfect hotel in terms of comfort and amenities. They are there and offer you their great company (always in a relaxed way) but only if you want it.", "title": "A perfect Tuscan retreat...", "helpfulness": 1, "user": "LaughterB", "date": "September 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79509361}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Let`s start with the location: Perfect for Montepulciano, Pienza, Cortona and Siena (in the middle of all them). Two hours from Rome. Isolated in a small hill with a breathtaking view.", "title": "Magical stay in the heart of Tuscany", "helpfulness": 1, "user": "Avgous", "date": "September 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79228845}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "This is not the case where the place photos are much better than reality. Amanda is a great photographer (and painter: enjoy her works in the house walls and stay tune for her sure success) but the photos does not make justice, perhaps because is hard to express in two dimensions the combination of good taste, design, comfort and beauty that Siena House has. Their has been a lot of attention to detail when restoring this old Italian farm, both for the use in the summer and in winter, and Malvin's crazy ideas (leds in the living room floor?) end up working great. You can feel it inside and outside.", "title": "How to Have an Exquisite Tuscany Vacation -- Stay in Siena House", "helpfulness": 1, "user": "aftnyc", "date": "August 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76371732}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "The rooms are, again, great. The idea of a Tuscany hotel room means usually sleeping in your grandmother's bedroom. Not here. The beds, with Frette linens, are great to sleep in. The mosquito nets (surprisingly uncommon in Italy) permit you, if you wish, to . leave the windows open for the night (what we did) and sleep with the noise of the crickets and the breeze. The bathroom is well appointed and full of design again. Expect to find excellent toiletries, Frette towels and Philip Starck sinks. What else?", "title": "By far the best lodging of our 10 day trip!", "helpfulness": 1, "user": "sdo47802", "date": "August 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76362349}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "I'm one of those people who always reads reviews on Trip Advisor but never writes any. It's testament to Malvin and Amanda, the lovely and welcoming proprietors, that I enjoyed my stay here so much I felt compelled to change that habit.", "title": "Delightful and unique Tuscan hideaway", "helpfulness": 2, "user": "dfisher74", "date": "July 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71506603}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Everything about the place is wonderful. The location, in the middle of the rolling Tuscan countryside, allows for some stunning views, whilst the house itself has been decorated in an extremely tasteful, contemporary style that somehow works perfectly with the surroundings. The air conditioned rooms are big, light and airy, with large windows that you never need to shut thanks to mosquito blinds that keep the bugs out but let the fresh country air and the oil painting vistas in. Couple that with Malvin and Amanda's skills as hosts (think delightful breakfasts and, should you want them, dinners, mostly using ingredients grown in their own gardens, as well as a knowledge of the area that no guide book could impart) and you have a perfect base from which to enjoy Tuscany. My only regret is that when we stayed there they had only been open for a few days so we had no trouble getting a room. Next time we might not be so lucky.", "title": "Einigartiges Haus", "helpfulness": 1, "user": "svetiundadi", "date": "July 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70867795}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Wir haben hier 4 wunderbare Tage verbracht. Das Haus ist ein einziges Kunstwerk, top gepflegt, sehr exklusiv und komfortabel eingerichtet. Die Gastgeber haben es geschafft klassisches toskanisches Flair mit moderner Kunst und Luxus zu vermischen. Die Zimmer sind sher komfortabel eingerichtet und überzeugen durch viele Details. Das Service war traumhaft, gleich bei der Ankunft haben wir eine Begrüßungsplatte mit toskanischen Spezialitäten und Wein erhalten. Das Frühstück war traumhaft, alles frisch zubereitet und regional. Wir können das Sienahaus wirklich vom Herzen weiterempfehlen!", "title": "Luxurious and unique get-away: Don't miss this gorgeous house.", "helpfulness": 1, "user": "nicollestec", "date": "July 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70815614}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "variance": {"poor": 0, "average": 0, "very good": 2, "terrible": 0, "excellent": 166}, "aka": "Siena House Hotel Torrita Di Siena", "slim_ranking": 0.1, "description": "Lovely old Tuscany on the outside, easy modern living within. Playful, functional and comfortable. Imagine the dream home that Holly Golightly and Peter Rabbit might share... and you've got the feel of the place ;)"}