{"user_rating": 5.0, "review_count": 712, "name": "Signature Living", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "I stayed in these apartments with my henparty! The apartments were outstanding very plush and stylish. They were very central and in walking distance to pubs and clubs! The apartments had security on the door at night which made us all feel very safe! The staff were amazing very helpful & friendly all credit to katie the manager she sorted out guestlists and vip. I had the best weekend of my life and thank all my girlies for that as they arranged the whole weekend for m right down to the last wee detail. I would totaly recommend this apartment to anyone and hope to go back soon.", "title": "Wicked apartments!!!", "user": "GlasgowWoowoo", "date": "May 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65515517}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "These apartments were really central. We had 2 of the apartments as there was 16 of us. Apt 12 had a fantastic living area and roof terrace. The management were fantastic and really made us feel welcome, organising restaurant reservations and nightclubs for us.", "title": "Beautiful apartments and will stay again.", "user": "emmski26", "date": "May 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 65212711}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "I will definately be booking these apartments if I return to Liverpool and would happily recommend them to family and friends.", "title": "Stunning Apartments in the heart of Liverpool", "user": "carols_corner", "date": "May 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64212695}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "Stayed at these apartments for a hen weekend. Would defo recommend for special events or romantic breaks away", "title": "absolutely fantastic", "user": "shazzamckerr", "date": "May 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63390526}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "stayed at these apartments with another 7 girls, we had apartment 1 and 11. you couldnt ask for anything more, absolutely brilliant, the interior design was gorgeous. the host Kate was lovely and very friendly. very close to the nightlife, am definitely going back some time, wouldnt stay anywhere else now that ive stayed here. 1st class all round. thank you for a fantastic time.", "title": "The best serviced apartments in Liverpool", "user": "GoldbugLeeds", "date": "May 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63291417}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We have just spent three days in Liverpool staying at the Signature Living Apartments - number 5. It was, without doubt, one of the best short breaks we have been on. We travelled by train and found the apartments without any difficulty - about 5-10 mins away from Liverpool Lime Street Station. The apartment was immaculately clean and spacious, very central for all things whether it be shopping, eating, drinking or sight seeing. Mary of Signature Living was very informative and even booked us a reservation at a restaurant, which saved us 20% - thank you. The weather was quite warm while we were there and the bedroom in particular was quite hot but Signature Living even had that under control - a fan was already in the room for guests use - a great touch as was the basic provisions provided. We were very impressed by Liverpool and its people. We were always greeted by a friendly smile or hello no matter whether it was in a shop, visitor attraction or restaurant. Nightlife was available but there were few people out as we did visit at the beginning of the week - by the weekend, the nightlife would, I bet be buzzing - there was definitely something for every age group. We are already planning a second visit for later in the year and have recommended Signature Living to my family and friends.", "title": "Short break made even better with fantastic accommodation", "user": "birdsbird", "date": "July 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 70129796}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Thank you for an excellent stay in your apartment. It was great to be able to come out of Mosquito straight into the luxury of an apartment that was lFabike a home. Would recommend a visit to anyone that wants to complete a good night out with a hassle free stay in a fabulous surrounding.", "title": "Fabulous Apartments", "user": "Bos2010", "date": "July 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69709879}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "Had great couple of days in Liverpool and our stay at Signature Living made it even better.", "title": "Stop reading! Just book it!!", "user": "BrettSterling", "date": "June 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68354567}, {"rating": 5.0, "title": "Fantastic Apartment and top quality service", "text": "Katie and Mary were sooo helpful and knowledgeable. The apartment was spotless and spacious and well equipped.", "user": "katie2952", "date": "June 10, 2010", "id": 67086392}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Will definitely return.", "title": "Absolutely fabulous", "user": "Jezebel777", "date": "June 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66511521}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "Fantasic apartments, great service and great location. Best place to stay in Liverpool.", "title": "Absolutely brilliant", "user": "vjf1999", "date": "May 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63187623}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "I had booked my sisters Hens a year ago, and was told about these apartments from a friend, so i booked the apartmentd for 16 girls for Antriee weekend were we were heading to laides day. We were staying in signture apartments were it accomdated all of us togather......It was by far the beat weekend i have had, the accomdation alone was outstanding, it was so mordern, classey and truely a luxary, we loved it and will definintly be back, i would defintly recommend this for a break-away staff lovely and so willing to do anything to meet any needs we were centre of everything the only disappointed was we should have book another day longer for more shopping :)!!!", "title": "Pure Luxary, fabulous accomadation!!!", "user": "emurtagh04", "date": "April 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62687678}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "What a fantastic place to stay whether your with friends or family, fully recommended!! great location and an amazing apartment we could fault anything we stayed in apartment 5 . I am returning in August and there are 15 of us and since reporting back to all the girls what it is like we are all so excited!!! go on get yaself there believe me ya wont be disappointed.", "title": "Loved IT!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "user": "zobo27", "date": "April 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62575241}, {"rating": 5.0, "stay_parameters": "Stayed April 2010", "text": "I booked my Hen Do with Signature Living for the Grand National and it was an absolutely perfect day. We stayed in apartment 12 which sleeps 15 people. On the day of the national we arrived quite early so we were unable to check in to our room straight away, however the owners, Mark and Katie were really helpful and allowed us to use other facilities to get ready before we set off to the races.", "title": "Perfect Place for a Hen Weekend", "user": "pmatthe2", "date": "April 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62089937}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "When we arrived back we were greeted by Mark who showed us around the 2 storey apartment and also showed us how to use the appliances. The apartment had been decorated by them with hen banners and balloons which was a nice surprise plus they also supplied 3 bottles of champagne to celebrate.", "title": "Like your home away from home", "user": "GABY065", "date": "April 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 60546804}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We were in appartment 1, 1 bedroom. It was easy to find, no problems getting in using instructions given. Appartment was very clean, spacious and modern with good quality appliances, furniture and fittings. We were provided with some basic provisions bread, butter, milk etc and pretty much everything else that was needed (washing tabs, cleaning materials etc.) It really was home from home. 4 of us shared the place which meant we needed to use the pull out sofa beds - took a little while to get comfortable on them but not a big problem. The appartments are right in the city centre, 5 minutes walk from the station, yards from the main bus and taxi ranks. Brilliant for shopping and nightlife. The downside is that some people may find it a little noisy in Summer if the windows are open - but what do you expect?", "title": "Highly recomended", "user": "gabsterUK", "date": "August 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 74388719}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Anyway - can't recommend this place enough!. We had a tour of the premises, the larger appartments are awesome! Great value for money.", "title": "Fantastic stay", "user": "jennylhardwick", "date": "August 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74147069}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "When we arrived the service was brilliant and the duplex apartment were fantastic with all the home from home things you need. All the rooms are high tech but yet still feels homely. The staff here are extremely attentive and when we mentioned it was our anniversay a bottle of wine, sweets for the kids and an anniversary card was left for us whilst we were out. The location is ideal with all shops and bars just around the corner. There is a car park the end of the road which is secure and only £12.00 for 24 hours. Looking to book the show apartment in December which is out of this world. Thank you to all the staff for making our very short stay a pleasureable one.", "title": "Amazing apartments", "user": "Neezy86", "date": "July 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72167581}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Great location and gorgeous apartments. Also good value for money. Been to Liverpool many times and this is definately the best place to stay. Will tell friends.", "title": "Totally Fab Living!!", "user": "trolljan", "date": "July 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71693203}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "What a find!!! We had a brilliant time - all of us (2 grandparents, 2 fussy teenagers, 1 tweenie & 2 40ish frazrzled kids) Mary & Mark very friendly and everything was perfect. The apartment was everything the description promised. The location is perfect for sightseeing around Liverpool ( & the great shopping!)", "title": "Unreal", "user": "Roryosull", "date": "July 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70378511}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 6, "average": 6, "very good": 35, "terrible": 3, "excellent": 662}, "aka": "Signature Living Hotel Liverpool", "slim_ranking": 0.0266666666667, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 5.0, "location": 5.0}, "description": "We are a serviced apartment provider, based in the very centre of Liverpool. Our apartments offer so much more space, flexibility and functionality than any hotel. Our concierge service has been adapted to ensure that you make the most of what our amazing city has to offer."}