{"user_rating": 4.0, "review_count": 497, "name": "Silver Cloud Hotel Stadium", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We often stay at Silver Clouds when visiting Seattle/Tacoma, but this was our first time at the Silver Cloud Stadium. We requested and received an upgrade to a suite with 1 King and a sofa sleeper. The rooms were very spacious and comfortable with terrific views. We were able to see the Jumbotron screen at Safeco from our living room window and we could see the Sounders/Seahawks stadium from the bathroom window. The shower was fabulous and the beds were comfortable. We had a terrific breakfast at Jimmie's on 1st (located in the hotel). The shuttle was convenient and the location is good for walking; so we didn't use our car throughout our stay. We choose this location, as we were going to the Sounders game, but we would definietly stay here again..regardless of what we were doing in Seattle.", "title": "Great location for a Sounders game", "helpfulness": 2, "user": "spokanemom2", "date": "April 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156829299}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Silver Cloud Hotel conveniently located next to CenturyLink and Safeco Fields is a nice, clean, friendly hotel. The pool is on the roof, with views looking over to the stadiums. The restaurant in the hotel, Jimmy's on First, was a great place for a late night dessert and then breakfast the next morning. We would stay here again.", "title": "Awesome hotel near the stadiums", "helpfulness": 2, "user": "Rylie G", "date": "March 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 156003121}, {"rating": 2.0, "stay_parameters": "Stayed March 2013", "text": "While possibly conducive to those seeing a ball game or working on the Alaska Way viaduct project, the hotel is NOT in downtown Seattle. It is rather in an area called \"SODO\" or south of downtown. The free shuttle bus to downtown was late. The smell of mildew permeated my room. In the middle of the night I discovered a plumbing problem And suspect that it had been there before. I suppose this hotel has a purpose, but I travel 200 nights per year and this is no four-star", "title": "Not downtown, late free shuttle, mildew, broken plumbing.", "helpfulness": 2, "user": "sunriverjohn", "date": "March 28, 2013", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 1.0, "service": 3.0, "rooms": 2.0}, "id": 155932707}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "This place is the BEST if coming for a baseball or football game. We have done both, and loved the convenience of being right across the street. Luis was really helpful in getting us a cab, and arranging a pickup for us at the float plane terminal. And we LOVE the roof top pool! So fun, you can even see inside the basebal stadium, see the vendors setting up etc.", "title": "LOVE THIS PLACE", "helpfulness": 3, "user": "JMS75", "date": "March 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155423949}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Nice Hotel if you are attending the Sea Hawks or Mariners game. Should not have this hotel listed as a Pike Place Hotel. Hotel is clean and new but it is in the middle of an industrial area so you overlook cranes and industrial buildings on one side and on the other you look right into the stadiums.", "title": "Not a Pike Place Hotel", "helpfulness": 1, "user": "Swimapp", "date": "March 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 2.0}, "id": 155423041}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We stayed here last week on our way home to Australia. This is the third or fourth time we have stayed here so know all about the location of the hotel. In fact that's one of the reasons we stay here-it is across the road from Safeco Field and walking distance to King Street Station. As we always go to a game when in Seattle it is the perfect place to stay and now with the light rail to the airport very easy to get to as well.", "title": "Another Wonderful Stay Here!", "helpfulness": 1, "user": "Aussie8", "date": "May 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 159477292}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "We arrived early as our Amtrak train was early. We would have been happy to leave our bags and wander downtown, but Kera at reception was able to check us in. We were also upgraded to a corner suite! Thanks Kera! It was wonderful to be able to stretch out over 2 rooms, although we have never found the rooms here to be small, in fact they are quite large. The suite was on the 7th floor and was noisy from the traffic until quite late but we still slept well. Everyone at the hotel was fantastic from reception to the shuttle driver to room service. They welcomed us back each time we came back to the hotel with a great smile!", "title": "Good place if you like sports, don't mind noise, and just like average.", "user": "Mistyisaqt", "date": "April 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 159094999}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Our room was very clean, crisp sheets and plenty of fluffy towels. Plenty of soap and products for the bathroom. We ate at Jimmys restaurant one night and found the service was quick, efficient and friendly. The food was good-we were there for Happy Hour so a lot of things were half price.", "title": "Disappointed in location turned quickly to happiness", "helpfulness": 1, "user": "Christina G", "date": "April 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 159088820}, {"rating": 4.0, "stay_parameters": "Stayed April 2013", "text": "We used the shuttle service to go to the Space Needle which is way too far to walk to. We could have called for them to pick us up again but we preferred to get the monorail and walk back down. They also took us to the light rail to get to the airport. We were disappointed that the pool and spa were closed but that's just bad luck and something you can't predict.", "title": "Free Shuttles and Clean Rooms", "user": "sillyrabbit12", "date": "April 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 158333637}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "We love this hotel and will stay here again!", "title": "Nice Hotel", "helpfulness": 1, "user": "CORedTraveler", "date": "April 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 158240597}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "According to Priceline this is a 4 star hotel in the downtown pike place area. It is not a bad hotel but is not a 4 star, although the staff are very friendly and the facility is above three star. It most definitely is not in the downtown/pike place area. It is a good mile to pike place and there are no restaurants/coffee shops other than the Pyramid Alehouse across from Safeco within comfortable walking distance. The hotel does have a free shuttle to town but it runs on a schedule and there is still the problem of waiting for it after phoning for a return. I do not fault the hotel for this. Again my complaint is with the misrepresentation by Priceline.", "title": "priceline misrepresentation", "helpfulness": 2, "user": "8086", "date": "September 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 176879004}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "I stayed for two nights surrounding a business trip. The second night included a Mariners game. Returning from the game there was an incredibly long line for the elevator. I asked the front desk for directions to the stairs and was told the stairs only go down. Thought that was a pretty amusing statement to make in reference to a stationary staircase.", "title": "Stairs only go down...", "helpfulness": 1, "user": "HR-Dana", "date": "September 10, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 176641679}, {"rating": 4.0, "stay_parameters": "Stayed September 2013", "text": "There was no option to go up even one or two floors other than the elevators. Turns out the stair case empties directly onto the sidewalk and can't be accessed from the outside without a maintenance key.", "title": "Great hotel. All you need", "helpfulness": 2, "user": "Sazzledazzle80", "date": "September 5, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 175917679}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Very conveniently located. Breakfast in the hotel restaurant was very good with large portions (which was appreciated since it came with a hotel-restaurant price).", "title": "VERY POSITIVE STAY", "helpfulness": 2, "user": "cougguy", "date": "September 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 175822322}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Stayed here for one night. Beds were comfy, room was clean and well laid out. Staff were friendly and efficient. It is not in the centre of town but the shuttle service is very convenient and simple. Would stay here again.", "title": "Nice Enough But in a Bad Location.", "helpfulness": 1, "user": "WAtravelgrl", "date": "September 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 1.0}, "id": 175811914}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "This property has to be the best Seattle has to offer if you are coming for a Mariner's game or a football game at CenturyLink Field. Our room, 442, looked directly out at the stadium entrance, in fact you could see the pitcher's mound and some of the field from our window. We enjoyed watching and listening from our open window to the pre-game excitement building. However, when the window was closed it did a good job of abating most of the street noise.", "title": "Great for Safeco and CenturyLink events", "helpfulness": 3, "user": "CouleeCat", "date": "October 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179364405}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "It scored well in my top 4 requirements of a good place to stay: Clean, check; Quiet, check; Quality bed and linens, check; Good, consistent shower pressure and temperature, check. The rooftop pool was still open on a cool, rainy late September weekend and was heated enough to still be comfortable for a swim. The spa was nice but could have used either hooks or cubby-holes for our towels, etc. to keep them dry from the rain while in use. The views are great from the rooftop, looking out over the sound and up to the waterfront with the Seattle Wheel.", "title": "Nice clean hotel close to the stadiums", "helpfulness": 1, "user": "beccag21", "date": "September 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 179123180}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "We just had one little incident that was handled promptly. We had left our room shortly after 1 PM and returned at 4 PM to find housekeeping had come and replaced our towels and coffee cups but did not make our bed or provide clean glasses. I called the front desk and they immediately sent up an afternoon housekeeper to finish the room. Within a few minutes, I received a call from the department head wanting the specific details in order to address the issue with the negligent employee. Yes, I shouldn't have had to call to have my bed made, but they handled the incident quickly and professionally, so no points off for that.", "title": "Returned my wife's wedding rings", "helpfulness": 8, "user": "bradfomj", "date": "September 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177841973}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We visit Seattle often and will return to this hotel when our main focus is attending sporting events. The $26.84 valet parking is very reasonable, since most lots near the arenas start at $20, and it's so nice to just walk across the street without hasseling with driving and parking. However, if we are looking for a \"Seattle Experience\", we would probably chose a location closer to downtown. Although the Silver Cloud offers free shuttle service to Pioneer Square and Pike's Place Market, it's pretty far away from the waterfront activities.", "title": "Fun in Seattle", "helpfulness": 1, "user": "Bill E", "date": "September 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 177466241}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The outside of the hotel is not terribly impressive but it is sandwiched between the sports stadiums in Seattle so for a game goer it is perfect. It is very close walking distance to Pioneer Square or the CG Base downtown. They offer valet parking with safe basement parking of your car but it is still pretty expensive for being a hotel guest. The room was clean and comfortable. There is a nice hot tub and pool on the roof of the hotel which overlooks the side of Safeco Field. They have a restaurant in house called Jimmy's On First but they don't offer happy hour on game days and my bowl of oatmeal was $8 for breakfast so I would recommend going to Henry's or Pyramid Alehouse only a block away.", "title": "Some problems now", "user": "Vancouver_WA", "date": "September 16, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 4.0, "location": 2.0}, "id": 177450265}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "Between Safeco Field and CenturyLink stadium, you couldn't ask for a better location. Even if not in Seattle for a game, their free shuttle tales you to Pike's Market or Seattle Center. And my favorite feature is the rooftop pool and spa with city view.", "title": "Rooftop pool view of city, near Amtrak, free city shuttle and great restaurant make game days a breeze.", "user": "JLHumcke", "date": "September 4, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 175721951}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled solo", "text": "Fantastic!", "title": "Convenient location great amentities", "user": "kristyart", "date": "September 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 175632368}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "-Clean well designed rooms with granite wet bar, matching fridge and microwave.(bring your own snacks and booze to save money). It was real classy, useful and convenient and my favorite part of the room.", "title": "First Class all the way!", "user": "MJ M", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 175616959}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "-Quality natural Aveda Mint Shampoo conditioner, and soap provided and hairdryer.", "title": "Location, location, location!", "helpfulness": 2, "user": "Elizabeth M", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 175557566}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "-Thick sparkling white towels, and hi quality linens, plus 4 spunky pillows per bed.", "title": "Nice stay", "helpfulness": 1, "user": "l k", "date": "September 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 175553648}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Positioned between the 2 big Stadiums in Seattle it is bit cut off from Downtown Seattle or local bars and restaurants. Great if you are going to a show at the stadium or conference center.", "title": "Good hotel position not good unless you need a stadium", "user": "Philip R", "date": "April 18, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 158092987}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Big rooms, comfortable and good quality. Best thing was the roof top swimming pool, I swam in here in the rain at night with views over the harbor and it's cranes.", "title": "Silver Cloud Stadium Still The Best!", "helpfulness": 2, "user": "cityroute16a", "date": "April 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157647472}, {"rating": 4.0, "stay_parameters": "Stayed March 2013", "text": "Bar and restaurant well laid out, allowing a range of spaces from single travelers to big groups. Cannot say anything about the food as had 1 beer and fell asleep due to jet lag.", "title": "I don't know if I'd stay here again", "user": "kimharding1", "date": "April 13, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 157624973}, {"rating": 2.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "I've posted a review about this Hotel Stadium Silver Cloud before on a previous trip. And it still gets the best rating I can give a hotel. Stayed over the past weekday and was very happy to have made reservations there. Clean. Friendly. Secure. The qualities you should expect from a hotel in downtown Seattle. The Silver Cloud Hotel Stadium does all that. If you are going to any event at Safeco Field or Century Link-stay here. You can walk to the waterfront if you want to. A hotel shuttle gets you there if it's to far to walk. A real nice hotel for a decent price.", "title": "More like 3 stars", "helpfulness": 1, "user": "Jackie B", "date": "April 13, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 4.0, "location": 2.0}, "id": 157618692}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "This hotel is nice, but pricey.", "title": "Great Hotel", "helpfulness": 2, "user": "AshleyBud", "date": "April 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 157603664}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Our first stay was a year ago, and we were impressed by just about everything about this hotel. This time, though, a few problems. The wired internet service no longer works, but the wireless does, although it's rather slow. The shuttle is often overbooked even if you call two hours in advance, this happened twice in less than two days. And try not to get a room on the 1st Avenue side of the hotel, very noisy train horns and fire sirens all night long, even on the 8th floor.", "title": "Still pretty good", "user": "Vancouver_WA", "date": "August 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 37508351}, {"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We will probably stay here again next year, but as with all new hotels, it's sad to see it go downhill from one year to the next. Oh well.", "title": "Not an OK experience", "user": "alexmoral", "date": "August 11, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 2.0}, "id": 37340002}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Arrived to the Silver Cloud Hotel on August 5th 2009, after 3:00 PM, after a long, long flight, on Game night. The hotel is just accross the street from the Safeco Field, all streets were closed by Seattle Police, detouring traffic, streets packed with cars and people. Managed to make it to the hotel despite all the traffic inconveniences, hundreds of pedestrians...first night, no problems, rested well, would have rested better, but there is a railroad facility close to the hotel and the trains blow their whistles at all times, day or night, so unless you are used to the noise (2-3 nights) you will be awake most of the time. Third day, friday, departed at 05:00H to catch the Ferry for Victoria BC . We made sure our room dooor was shut locked. Arrived from Victoria, BC on saturday afternoon and to our surprise our room door had a \"Privacy please\" sign, that we did not leave there. I thought my room had beed given away to another guest. After trying to open our room door a few times and seeing that the key was not working, we decided to give it a little push, discovering that it had been opened by someone else and left open. The room had not been touched by housekeeking at all, for 2 days. It was just as we had left it. Nothing we could do at that time since we had made reservations for dinner and were kind of in a rush. We called the main desk, asked for soap and fresh towels, which were delivered soon. After dinner we returned to the hotel, it was around 10:15PM, tried to open the room, keys did not work this time. Went to the front desk, reprogammed them, tried again, nothing. After going back and forth to the front desk to reprogam the keys, three times, our door still remained unopened. 5 staff personnel, (as if I did not know how to do it), came and tried to open the room, for a total of eight tries now, finally realizing that the lock was somehow damaged. It is now past 11:00PM, we are still locked out of the room and the maintenance person is gone for the night. Front desk stated that the hotel was at its full capacity and they could not provide us with a courtesy room to spend the night, therefore; we had to wait for the maintenace guy to come back from his home, at that time of the night , and see what was wrong with the door lock. We went back to the front lobby to wait there, were given two small bottles of Minute Maid orange juice for consolation, and were told that maintenance had been contacted and that within 15 minutes the problem was going to be solved. At 12:30 AM, after 2 hours and 45 minutes locked out of our room, tired and sleepy, front desk finally told us that our door had been opened by maintenance and that the problem was that the lock since it is electric, had run out of batteries. WHAT!!!!???? Don't they perform preventive maintenance or their equipment???? Don't they change the door lock batteries periodically?? For the price they charge for their rooms, the lock ran out of batteries, that's it??????. How do they explain that someone opened that door, left it open, placed a \"privacy please\" sign on the door, but no one reported that the lock was having problems? Needless to say my night was trashed, ruined, wasted. Next morning we were able to speak to Mr. Mark Lee, director of guest services, he was very kind and understanding of our situation.", "title": "Location is a little far away except for pro sports", "helpfulness": 1, "user": "AlegreVancouverBC", "date": "August 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 36979959}, {"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "This hotel is not a bad one, it is just that you travel and try to book a good hotel, even if you have to pay a few more dollars, so you don't have to worry about things like these, but unfortunatelly, it happens.", "title": "Noisy", "helpfulness": 1, "user": "HamonGrande", "date": "August 1, 2009", "detail_rating": {"cleanliness": 5.0, "location": 2.0, "value": 4.0, "rooms": 4.0}, "id": 36429698}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Got here by bidding on Priceline for $100 so Priceline did the choosing. It's about as far as you can get and still be classed as downtown-Pike Place. It is perfect for foot/baseball. The train was far enough that it wasn't a bother. Our courtyard room was void of outside noise. The A/C was a little noisy but worked very well. We could hear some kids screaming next door, but I assume they could be heard for blocks. The walk to Pioneer Square is about 10 minutes but is a lonely walk if there is no sporting event. It didn't feel unsafe after dark, but not many folks were around. Breakfast is not included and parking is valet parking for $20/night. The very comfortable room had fridge/micro/coffee. Counters are granite and the TV is a 42\" LG flat screen. There is a couch, we had a king bed and the desk has easy access power for your laptop. The room safe holds one laptop. Wireless connection is free and quick. There is an hourly free shuttle to deliver you to restaurants etc. Good deal? Yep, a really good deal as long as you are not intimidated by the lonely neighbourhood after dark. Oh yeah, there are two Italian restaurants a block south of Fado Irish Pub. One is street level but the one with atmosphere is downstairs. Great atmosphere but the worst Italian food ever. The congenial owner owns both restaurants. Fun if you're not there for quality.", "title": "Just OK", "helpfulness": 1, "user": "2618010", "date": "July 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 2.0, "service": 2.0, "rooms": 3.0}, "id": 35847976}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We stayed one night in August. The hotel is very close to the Amtrak station and right across the street from Safeco Field. This hotel is located a bit too far to walk to Pike Place Market and that whole downtown area, but luckily they have a free shuttle service that is easy to use. We never had to wait more than ten minutes to get picked up. The staff are cheerful and helpful. Our room was beautiful, spacious and clean with a wet bar, coffee/tea maker, microwave and mini-fridge. The only downside to the room was the mattresses are a bit on the softer side, but that is personal preference! The hotel has a swimming pool and hot tub, vending and ice. No filtered drinking water is available :( They also have a restaurant on the first floor.", "title": "Right across the street from Safeco", "helpfulness": 3, "user": "Mari A", "date": "August 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 2.0, "rooms": 5.0, "location": 4.0}, "id": 174971203}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "My adult daughter and I came into town a day before our cruise, so that we could attend a Mariner's game. We took the light rail from the airport and got off at Stadium Way. Within five minutes of my call, the shuttle not only picked us up to take us to the hotel, but the driver got us checked in early (11:00), and made arrangements for the cruise shuttle the following day.", "title": "our amazing stay", "helpfulness": 2, "user": "ruthlesskoenig", "date": "August 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174709664}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "The service was excellent, as well as the Stadium being right across the street.", "title": "Absolutely fantastic stay!", "helpfulness": 2, "user": "TiffanyC1525", "date": "August 25, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 173995363}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We were in town for the Blue Jays vs Mariners series and chose this hotel because of the location. If you're in town for a sporting event, stay here. Literally across the street from the stadiums. We also found out that Pike Place Market and the Space Needle are less than 2 kms away, Pike Place you hit going along the same street (1st Ave). It's right off the free way, another bonus. The staff were amazing, and helpful. The free shuttle we didn't use, but you book a drop off and pick up time and they take you to major attractions. Runs until around midnight, I think. The rooms were awesome! Bed are extremely comfortable. Lots of storage space, in room safe, fridge, microwave, and A/C. Yes the price is a bit high, but I would pay it again. Valet parking, never had to wait for our vehicle when we called down, it was already there. After the ball games there was a wait for the elevators, but we hung around outside the building for awhile and the crowd disappeared. Overall, I'd stay again- without question. Fantastic hotel!", "title": "A wonderful stay!!", "helpfulness": 2, "user": "gap4jason", "date": "August 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 173520393}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "My family stayed here for 2 days as part of our vacation in Seattle. The service was exceptional - from the front desk reception to the shuttle drivers. The hotel offers free shuttle rides to 5 key locations in the downtown area, and my family took advantage of the shuttle whenever possible. All we had to do was call the front desk, and the shuttle was made available for us. At times, we were the only ones in the shuttle, so it felt like a personal van service. They went the extra mile by picking us up from the nearest Light Rail station (when we arrived from SEA-TAC), and on our last day, they dropped us off at the Amtrak station.", "title": "Awesome spot for games!", "helpfulness": 1, "user": "qryche68", "date": "August 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172733444}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "Stayed here with a few girlfriends - we all live in Seattle, but need a little girls getaway. Spent the entire stay rooftop poolside with margaritas!! AMAZING view!!! Service was awesome, lots of smiles and everyone was very attentive. We made several room service orders, food always arrived quickly and sizzling hot - even delivered to us at the pool. Our 9th floor room was HUGE and super clean - bathrobes were much appreciated. Valet was fast and made sure us ladies never opened a single door. Close to all of Seattle's hot spots - complimentry shuttle took us to Il Bistro. If your looking for your next staycation and want to feel like a celebrity this is your place. We will be back!", "title": "Fabulous!", "user": "Kes2106", "date": "July 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34062546}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "I usually stay at more budget accomodations, but those options are limited in downtown seattle, so stayed here for $75 after bidding on priceline.", "title": "excellent", "helpfulness": 1, "user": "marieatta_pman", "date": "June 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 33449325}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "Pros -", "title": "Heavenly Hotel", "user": "kateeOregon", "date": "June 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 33204371}, {"rating": 5.0, "title": "GREAT HOTEL - especially if going to a ball game", "text": "very new", "user": "LillyChristina", "date": "June 23, 2009", "id": 32995265}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "very clean", "title": "The epitome of what an hotel should be!", "user": "morningbarney", "date": "June 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32850696}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "My friends and I were celebrating a girl's 21st birthday, so we made a girls trip to seattle, and stayed here for 1 night. They upgraded for free to a suite with a pull out bed/couch and seperate room with a great view of the stadium!!! I loved the ipod deck in the room, and the large tvs. We got a few complaints for being too loud, but the hotel staff were so nice, and told us they understood we wanted to party but told us to keep it down. The valet parking was nice, and the guy at the desk (concierge maybe?) gave us some coupons for clubs as well as a restuarant and some good tips on where to go. We also got a free shuttle to the restuarant. We had a drink at the restuarant and they were expensive but it was nice!!!! We got back to the hotel around 3am and we were so drunk that we hung out in the lobby for about an hour talking to the guy at the front desk, and he even helped us order food. We also had room service in the morning and it was pricey but nice!!! I would recommend this place to anyone, it was great!!!", "title": "very pleased", "helpfulness": 1, "user": "lesley85", "date": "July 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35847619}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We just returned from an Alaskan cruise. We stayed the day before our departure at Silver Cloud and 2 days after the cruise. All the reasons we selected this hotel, using Trip Advisor as our biggest research and personally speaking to Mark (hotel manager), were right on spot. The 2 room suite was perfect for my husband, myself and 2 grandchilden (11 & 14). The shuttle was a lifesaver. We would call the desk for a specific time and it always worked out for our schedule. They took us to the ship and picked us up after the cruise. We went to the aquarium and the waterfront, Space Needle, and Pike's Place Market. The drivers were friendly and very informative. We attended a Mariner's game (we're Dodger fans) and it was fun for all of us. The best part, was it was a across the street from the hotel. The only drawback and it's pretty minor, was there wasn't much around within walking distance.", "title": "Unbelieveable, honest staff", "helpfulness": 1, "user": "beach4nut", "date": "July 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 35498812}, {"rating": 1.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "BUT the most important part is the staff. My husband dropped his wallet in the shuttle and someone was at the desk with it as we were just entering the hotel. Amazing...but there's more. We returned home yesterday and couldn't find a book we had purchased and weren't sure where we left it. I called the hotel and the head of housekeeping (Alan) called this morning and found the book that we left in the business center. He is mailing the book to us. The integrity of the staff far exceeds the call of duty. The hotel manager deserves credit for having such a great staff!", "title": "Very Disappointed", "helpfulness": 1, "user": "Maxamiss", "date": "July 19, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 35118564}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "After all the great reviews I was really looking forward to our stay here but was extremely let down. There were small things lacking like the attentive service everyone spoke about (3 times I walked away from the front desk after waiting waiting waiting for them to take care of other people), or the robes on the bed. There were big things like losing my ticket for breakfast and then breakfast being pretty bland and horrible, and still costing $40. The beds were uncomfortable and my room wasnt the cleanest. Aveda products?...big deal, especially when the scent of your shampoo is mint! Im sure it was their idea of refreshing but it smelled like bengay. For such a large hotel the pool area was tiny in comparison and I was surprised that beer cans/bottles and open cups of alcohol are allowed on the rooftop pool area especially when children are present.", "title": "Great time at a classy spot", "user": "KYtransplant1975", "date": "July 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 34858063}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Our 'view' was of the adjoining building on the other side of the courtyard. If you open your window the fountain is very loud as it echos up the buildings. When I emailed to ask if my room had a view I was prompted to spend more money for a view even though I was already paying upwards of $200 a night.", "title": "A New Anniversary Tradition!", "user": "asneeze", "date": "July 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 34352669}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We stayed at this hotel for 3 nights while travelling to Vancouver. We had booked the hotel on the internet and selected it because we were going to 3 baseball games. Having read some previous reviews about the noise we were apprehensive, but our stay was wonderful. We had a room on the 6th floor which faced into the courtyard and the noise from the trains, while there was not loud enough to disturb our sleep.", "title": "Great stay", "user": "Aussie8", "date": "September 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 42718563}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "On checkin the staff were very friendly and the process was smooth and quick. When we checked out early to catch the Amtrak to Vancouver they bent over backwards to assist us with a taxi and our luggage. The shuttle service was great. We caught it to the Space Needle and then worked our way back down through the city by walking.", "title": "Location, Location, Location!", "helpfulness": 1, "user": "MINN7", "date": "September 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 40500856}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "I would highly recommend this hotel. It was expensive but worth it for the location to Safeco Field. (We probably could have picked up a better deal if we had booked later but booking from Australia meant we wanted to make sure we had a hotel in a good location for the baseball.) We love walking so were happy to walk everywhere.", "title": "Not bad, but definitely not great, either...", "user": "anibananie", "date": "August 28, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 2.0, "service": 2.0, "rooms": 3.0}, "id": 39080072}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled solo", "text": "We ate breakfast in the restaurant and found it to be good value.", "title": "Best baseball hotel in North America!", "user": "DanTTU", "date": "August 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38759135}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Would definitely stay there again the next time we come to Seattle.", "title": "Sleepless in seattle", "user": "idajimmi", "date": "August 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 1.0, "service": 4.0, "rooms": 4.0}, "id": 38491495}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Would give this five stars if it were in walking distance to downtown. But the hotel was very clean and nice. There is a shuttle, but you have to make reservations, as it fills up pretty quickly. Additionally, it only runs until 10:30 each evening. We had to drive downtown one night and didn't have much trouble parking, however. You do have to pay $22 a night for parking at the hotel.", "title": "Great place, okay location", "helpfulness": 1, "user": "troyds", "date": "April 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 157357351}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Our room literally looked into the stadium, so if you're going for a game, this is the place. It was also in walking distance to Pyramid Brewery which had awesome nachos and chili. When we go back to Seattle, we may stay somewhere closer to Pike's Place, but this was great for $89 a night on Priceline.", "title": "Great value, great location", "helpfulness": 2, "user": "JadeAndTrav", "date": "April 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 157233073}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "Very clean, great location. We scored a great deal and had a great 2 nights near the stadium! The walk was only about 10 minutes to the heart of town, and we enjoyed the helpful staff. The rooms are very nice and super clean!", "title": "Not downtown, but free shuttle!", "user": "Jimmy C", "date": "April 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 157146382}, {"rating": 4.0, "stay_parameters": "Stayed April 2013", "text": "Booked this place from hotwire, it was one of those deals where they don't reveal the hotel until you have paid for your booking. Anyways, this hotel is about 10-15 away from Pike's place, luckily they have a free shuttle that takes you to all the main areas. It's rated 4 stars, I thought it was really nice, they have a roof top pool and hot tub, even in 50 degree weather it was nice to sit out there. Being far from downtown there isn't much to eat within walking distance but there is a restaurant on the first floor which is open pretty late and they also offer room service. Also it's really close to the light rail system which takes you directly to the airport! Very convenient and saves you a lot of money instead of having to book a airport shuttle service or cab!", "title": "Very nice hotel", "user": "GCR2011", "date": "April 8, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 157092459}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We price lined the hotel. The deal was ok considering where we were. The hotel is in between the two stadiums. There were no games on while we were there. The hotel was clean, nice and had friendly staff.", "title": "Going to a game?", "user": "Rob S", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 157018516}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "Wanted to spend the last night of our trip in the downtown area of seattle to see a Mariners game. Great views of the stadium, its right across the street. Nice clean room, unfortunately the toilet was wobbly, it's a new hotel!!!!! The worst thing was the constant trains that pass by, about every 25 minutes the whistles go off and it comes barreling through. If you don't need any sleep and want to soak up the city, great place to stay. I don't recommend this to a family, older couple or anyone who wants to sleep!!!!!!! Valet is the only choice and be prepared to spend $22 a day. I would much rather stay at the crown plaza, this silver cloud did not meet the expectations we had.", "title": "If you love listening to trains all night long, stay here!!!", "helpfulness": 2, "user": "krazygreekgirl", "date": "April 24, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 15295016, "likes": {"liked": "— Mariners stadium across the street", "disliked": "— the loud trains and the wobbly toilet"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Hello", "title": "Love this place! New Favorite Hotel Chain!", "helpfulness": 3, "user": "Alatini21", "date": "April 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14895546, "likes": {"liked": "— Hot Tub, Location, Cleanliness, How Big the Room was", "disliked": "— None :)"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We went to an event at the Qwest center and this hotel was perfect! We literally walked out the doors and we were there. Also, you are right by downtown and very close to the marina etc. We were able to sit in our room hottub and look out at the Ferry coming in each day and also the Space Needle and the Seattle skyline!", "title": "Loved Staying at the Silver Cloud", "helpfulness": 1, "user": "northendmoon", "date": "April 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14883445, "likes": {"liked": "— The room was so luxurious. The location was awesome for sporting events.", "disliked": "— Not in downtown Seattle."}}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "I booked their King Jacuzzi Suite (OMG What a room!) and we stayed for two nights. Like I mentioned the view was fantastic and in addition to them giving us a new loofah, bath robes, bath salts, bath bubbles, a HUGE bathroom with a HUGE additional bath, big shower, kitchen/bar, microwave, extra sink, fridge, comfy bed, 40\" FLATSCREEN TV with HD Channels and HBO etc and free Wi-Fi we were in heaven! Very nice stay the room was spotless and the bed was so comfy.", "title": "Very comfortable hotel, clean and new, very handy for railway station", "helpfulness": 2, "user": "mulac21", "date": "March 21, 2008", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 1.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 14432067, "likes": {"liked": "— Very nice rooms - oh and a rooftop pool and spa", "disliked": "— Reception staff"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Also, we landed and were at the hotel by 10:30am. We assumed (like most hotels) this place wouldnt let us check in early...but they actually allowed us to check into our room at 10:30am! We couldnt believe it. They were so accomodating and the front desk was REALLY nice. I know a couple of other reviews said they had problems with them, but I didnt have any issues at all.", "title": "Try it, You'll Like it!", "helpfulness": 2, "user": "cjindc", "date": "January 21, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 12843376, "likes": {"liked": "— Beautiful decor, clean, comfortable mattress and close to West Seattle bridge. Free Laundry.", "disliked": "— The pillows and street and train noises."}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "Very nice lobby area and a big plasma tv in the room; room is small but should be ok for a short getaway; the bed is comfortable BUT the noise from the railway just keeps me awake for the WHOLE night!!!! Prepare earplugs or don't stay at this hotel at all!!", "title": "One word - \" Noisy\"", "helpfulness": 3, "user": "yvan31", "date": "December 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 12071159}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "One of the best hotels I've ever stayed at.", "title": "Best hotel ever", "helpfulness": 1, "user": "annabanana59", "date": "December 1, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 11186697, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "This was our second trip to Seattle. This hotel helped made this trip the best. We had the King Jacuzzi Suite and it was sweet. We arrived in Seattle at 9:30am and didn’t' think we would be able to check in but no problem, we went right to the room. It was immaculate. The Jacuzzi had a beautiful view of Puget Sound. There were bath salts, gel and a loofa (sp?) We used it every night!!! The water was so HOT the first night that we had to wait for it to cool down. The bathroom was equally impressive. Large tub and plenty of space for toiletries. The bed was very comfortable. I read reviews about train noise but I have to say, we only heard the train while we were awake. We are sound sleepers and sleep with the TV on so, unfortunately, that may be why. Worked for us. We spent two days at Pikes Market...I love it. One day we used their shuttle, which was great. The next day we took a cab from a pub we were at and walked back. It was a great walk and found a little \"specialty shop\" on the way back. Jacuzzi time again. My husband loved the plasma and daily newspaper. OK, I will admit we were there for the Seahawk/Rams game and we are Rams fans, yuk. The location is no less than perfect for Safeco and Qwest. The Pyramid Ale House is across the street, which is fun. Jimmy's downstairs has the best breakfast. Their potatoes are awesome as are the Bloody Marys. We had room service our last morning and it was perfect and not prices any higher than going to the restaurant...a first!!! We loved it and won't stay anywhere else. Hope you like it too!!!", "title": "Cloud Nine Hotel", "helpfulness": 4, "user": "TJCCalifornia", "date": "October 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10460651, "likes": {"liked": "— The Jacuzzi and Location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Just returned from seattle. First time visiting and this hotel made it just the best experience. We loved the room, sooo clean and lovely to sleep in. The tv and movie service just topped off our evenings. The pool/hottub area are just awesome and overlook the pier area and the safeco field. It has a nice restaurant in the hotel as well right across the street. It is a little far to walk some days to the pike market or pioneer square but the shuttle offered could not of been any better. When we called for pickup it seemed like we waited no time at all and the drivers were fantastic with all sorts of suggestions. We used the shuttle extensively and it never let us down. Will definitely be staying here again. Nothing but good to say", "title": "Loved This Place", "helpfulness": 3, "user": "dudesd", "date": "October 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 10267089, "likes": {"liked": "— cleanliness,atmosphere"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "NIce new clean rooms. Stayed with friends for a bachlorette party. One downside no full length mirror in room. A word of advice don't keep your window open at night because in the morning you'll hear the duck tour. Other than that an awesome hotel with friendly staff.", "title": "Clean and nice", "helpfulness": 3, "user": "Andrea1122", "date": "October 19, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 3.0}, "id": 10149376, "likes": {"liked": "— Beautiful rooms", "disliked": "— having to use the key to take the elevator"}}], "location": {"country": "United States", "city": "Seattle"}, "variance": {"poor": 24, "average": 60, "very good": 173, "terrible": 8, "excellent": 232}, "aka": "Silver Cloud Seattle", "slim_ranking": 0.344086021505, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.5, "location": 4.0}}