{"user_rating": 4.5, "review_count": 626, "name": "Silver Cloud Inn - Lake Union", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "The shuttle service is a really great feature, parking is free and really secure, and the reception on Tuesday night was very fun--good food, wine and beer and live music. Shuttle leaves every half hour and pick up time is accurate. Traveled with son and daughter in law and booked a suite with view. There are dishes and utensils, daily cleaning--this is a great place to stay if you want to eat dinner in, have breakfast free and stay in a really clean, nice place. We paid for the suite with a view and it is nice, water during the day and lights at night, but don't know that it is essential. Union Lake is not a walkable lake, no trails or hikes, it is a working lake with boats,planes, and wharves, etc.", "title": "Tuesday night is really wonderful", "user": "nancyandbob_10", "date": "October 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 119643749}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Our family of four stayed here for a long weekend during a beautiful sun-filled weekend in Oct 2011. We stayed in a king Suite with View, and the room exceeded all our expectations! The bedroom had enough room for a portable crib, and mom was able to enjoy some privacy in the other room with pocket doors! It was more than enough space, complete with a view of lake Union and the Space Needle.", "title": "Stay at the Silver Cloud!", "user": "JennandRob", "date": "October 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119593328}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Breakfast was served daily, and although delicious, it's the same thing everyday.", "title": "We found only an average hotel.", "user": "mommabean", "date": "October 22, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 119587869}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The complimentary shuttle was awesome and super convenient. The shuttle can bring you to three main attractions: Pioneer Square, Pike market and the Space Needle---as well as restaurants along the way. We never waited longer than 15mins for the next shuttle to whisk us around Seattle. The drivers were all friendly and courteous, and even made restaurant suggestions and reservations.", "title": "The best stay in Seattle", "user": "Carlose1951", "date": "October 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 119277090}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "If you have a car, the free parking is a huge plus---and very hard to come by. However, if you drive downtown, expect to pay $4/hr to leave the car.......so take the shuttle instead!", "title": "great hotel", "helpfulness": 1, "user": "Jacqueline07_69", "date": "October 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 118955695}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "I booked this hotel at a discounted price through Priceline and it proved to be a great value (even if I paid full price).", "title": "Great value hotel in downtown Seattle", "user": "joseotavio", "date": "September 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118486619}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "The room was very spacious and comfortable, they offer a very good complimentary breakfast, free Wi-Fi and free parking!", "title": "Great value!", "user": "yankeejones", "date": "September 19, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 118295488}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "The hotel location is also very good, you can walk 5 minutes and take a bus or enjoy their free shuttle service, it runs every 30 minutes and takes you to the Space Needle and Pike Place Market. There are also some good restaurants nearby, we ate at a seafood place called Duke's Chowder House and it was delicious (there's also a crab house and sushi place very close to the hotel).", "title": "A pleasant surprise", "user": "TravelingWildMan", "date": "September 18, 2011", "detail_rating": {"value": 3.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 118292982}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Overall, I highly recommend this hotel!", "title": "Fabulous find for the family", "user": "happylodger", "date": "September 14, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118127795}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We stayed here 2 nights and we absolutely loved it. The rooms were clean and comfy, view was great, and the free shuttle was a wonderful bonus. Unlike most of the downtown hotels parking is free here and with the free shuttle we could get downtown in just a matter of minutes. The front desk people were super helpful. We will definitely be back!", "title": "Fantastic place to stay- loved every minute!!", "user": "louise b", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 118002997}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "We stayed here for the weekend when attending a football game at Century Link Field. I was a little concerned that it might be far away but the free shuttle service made it extremely easy to get around and actually ran later than normal to accommodate the football fans. The pool was great for the kids and is open 24 hours. The free breakfast had a little bit of everything for everyone...although crowded both times we ate there, the food was replenished quickly. There is a little store easy 10 min. or less walk away if you wanted to pick up snacks,wine, beer, etc. The beds and rooms were comfortable and had a mini fridge. Parking was free which is also another big perk!!", "title": "Comfortable with all you need", "user": "GoBeavs", "date": "November 4, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120139474}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I stayed again at the Silver Cloud Inn Lake Union for a 3 night stay over a weekend. Once again I found the rooms to be of a good standard, staff friendly helpful and attentive. Whilst the property is not \"downtown/CBD\" the property operates a regular shuttle service to and from the central city area (takes about 8 mins) and the street tram terminal is just 4 mins walk. Just be aware that the property only offers a breakfast room eg no bar or restaurant for evening dining. (given the proximity to the lake and the views , I think it's a shame that they don't). Having said that there are a good number of restaurant choices within a 6/8 minute walk.", "title": "A very nice property, well priced and good value for money", "helpfulness": 1, "user": "NZTravelExpert", "date": "November 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 120045483}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We were greeted by the loveliest staff at check-in who were all extremely friendly and welcoming and very helpful throughout our stay.", "title": "Lovely hotel, great staff", "user": "disneycrazy68", "date": "November 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 120006023}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "The room was lovely, comfortable and clean. Breakfast was great.", "title": "Great, We liked it", "user": "Jacki R", "date": "October 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119798910}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "The shuttle service into Seattle is really well organised and very useful. There are several drop off points and there are arrangements with the various businesses to telephone for you when you are ready to be picked up.", "title": "Great hotel, price, rooms and staff", "user": "Nade70", "date": "October 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119679651}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Having spent 21 day's travelling north to south ( Seattle to San- Diego) this hotel/motel was without a doubt the best value for money it's clean tidy staff are fantastically friendly & helpful what's more free parking which is a big bonus as some of the other hotels/motel are charging up to $30.00 a night & you get the even bigger bonus of a free shuttle bus taking you to all the major attractions.", "title": "THE BEST", "helpfulness": 1, "user": "GED450", "date": "October 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 4.0, "value": 4.0, "rooms": 5.0}, "id": 118873787}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Our stay at the Seattle Silver Cloud in June 2011was most pleasant. A little way out of the city but transport in the form of a mini bus was provided for guests staying at this wonderful hotel.", "title": "Our stay at the Silver Cloud", "user": "jancooke", "date": "September 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 118684146}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The service was friendly and efficient. Our room was clean, comfortable and well furnished. A tram running a regular service down town was a short 5 minute walk away or the hotel mini bus running every 30mins. Free internet with printer readily available. The breakfast was excellent and daily tariff reasonable. I would happily give this fine hotel 7/10 and will certainly return.", "title": "Great Pick!", "helpfulness": 1, "user": "chgotraveller4", "date": "September 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118676218}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Chose this hotel based on other reviews and they were right on. Very helpful staff. Jay upon check-in suggested an upgrade to water view and it was well worth it. The view of the lake including boats and water planes was great. The hotel is clean, rooms are spacious. One of the best features is the free shuttle to downtown attractions. The drivers were informative. We never waited more than 15 minutes for a ride. Another feature is the breakfast. It takes place in a large sunny room overlooking the lake. Unlike other hotels, they use dinnerware and silverware...no plastic or paper. It was well stocked with numerous choices. Parking was also included in enclosed garage.The location is within a good proximity to downtown. We were able to walk to the Needle and downtown, but as I mentioned the shuttle is always available. Great choice for value and a quality hotel.", "title": "Great Value", "user": "Ned07666", "date": "September 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 118581059}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Our room was generously sized, clean and comfortable. The included continental breakfast was quite good. It was actually an expanded continental breakfast buffet with scrambled eggs, sausage, waffles, muffins, bagels, cold cereal, and yoghurt as well as juice and coffee/decaf and it was served in an attractive lounge. Secure on-site parking was also included as was wi-fi and the use of a \"business center\" with computer and printer. This property is competitive with Marriott's Residence Inn hotels and was definately a good buy, especially for those wishing to be close to downtown and who are traveling by car.", "title": "Unexpected surprise", "user": "RobertSuzanne", "date": "September 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118506609}], "location": {"country": "United States", "city": "Seattle"}, "variance": {"poor": 9, "average": 48, "very good": 195, "terrible": 6, "excellent": 368}, "aka": "Silver Cloud Inn - Lake Union Hotel Seattle", "slim_ranking": 0.193548387097, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}