{"user_rating": 4.0, "review_count": 197, "name": "Simon Hotel", "reviews": [{"rating": 4.0, "title": "loved Hotel Simon", "text": "Stayed in Hotel Simon beginning of November 2005 and was very impressed. The rooms were spacious and clean and nicely furnished. Very nice bathroom. The staff were friendly and helpful. We were in room 214.", "helpfulness": 6, "user": "PG Bedfordview", "date": "November 24, 2005", "id": 4141112}, {"rating": 1.0, "stay_parameters": "Stayed October 2005", "text": "Would definately stay there again and would recommend to friends and family. There was a little noise from the street but nothing too excessive.", "title": "Never Again", "helpfulness": 11, "user": "mccorca", "date": "October 25, 2005", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 4051349}, {"rating": 5.0, "title": "Ab Fab - and more gen on the rooms", "text": "The Hotel is also very close to all tourist attractions and close to a very good coffee shop/delicattessen. Found everything in walking distance and loved the area.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "October 18, 2005", "id": 4031930}, {"rating": 1.0, "stay_parameters": "Stayed October 2005", "text": "Gail Heal Bedfordview South Africa", "title": "Double booked room!!!", "helpfulness": 8, "user": "JaneinCordoba", "date": "October 6, 2005", "detail_rating": {"service": 1.0}, "id": 3996397}, {"rating": 3.0, "stay_parameters": "Stayed July 2005", "text": "I´m currently staying at the Hotel Simon and have never been so dissappointed. I got the recommendation from the Rick Steves´Spain guide. Having been on several Rick Steves´tours, I trust his judgement but this time he´s totally off the mark.", "title": "I expected a little more -- but I guess it's a 1*.", "helpfulness": 8, "user": "Steigy", "date": "August 24, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3805819}, {"rating": 3.0, "title": "This hotel was fine for the price, but only fine.", "text": "The Hotel Simon is purportedly very popular, having received praise in several guidebooks as a very good, affordable place to stay. I found it to be somewhat overrated. It is true that the prices are good, the hotel is in a central location near Seville's cathedral (though the Barrio Santa Cruz is a much cuter setting), the common areas have an interesting array of art and furniture, and the rooms are clean. However, they vary widely in terms of size, decor, etc. .... I stayed for several nights in a single room that was small, with no view, and sort of depressingly decorated, and then for one night in a double room that was infinitely more spacious and appealing (the lower price for the single was not substantial enough to justify the difference in the quality of the rooms). The air conditioning is turned off at 9 a.m. until some time in the afternoon, so if you plan to sleep in, prepare to wake up sweating (the explanation provided was that this is because the maids are usually the ones in the rooms during this time period, so air conditioning is not required while they do their work). Breakfast is not included in the room price, but there is a Starbucks located conveniently nearby (Starbucks has, after all, taken over the world). The reception staff was not particularly friendly or welcoming, which put me off a bit. In short, the Hotel Simon is fine, but next time I visit Seville I may explore other options. (My stay was in May 2006).", "helpfulness": 4, "user": "noscreennameswork", "date": "June 16, 2006", "id": 5353110}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "We stayed 2 nights in a ground floor room in the back of the hotel near the service entrance. It was noisy from both the street behind the hotel and from the service entrance. We asked to switch rooms and were told that there were none available, although the hotel did not seem particularly busy. The room was sparse, but clean. The location was very convenient, though. Last time in Sevilla, I stayed at Hotel Zaida which was rated 2 stars (there was a TV). The hotel was somewhat out of the way and less well appointed. I would stay at Hotel Simon again, but request a room in front and on the first floor (which would be the 2nd floor in the US).", "title": "Central location, but noisy", "helpfulness": 7, "user": "skippydeluba", "date": "April 5, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 4939768}, {"rating": 4.0, "title": "Good value for money", "text": "Chose Hotel Simon based on other trip advisor reviews.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "January 31, 2006", "id": 4399512}, {"rating": 2.0, "title": "biased view", "text": "Wanted something low cost, but comfortable and most importantly, in a great location.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "November 28, 2005", "id": 4148024}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "The hotel itself is a lovely restored old mansion. We had a triple room which was great. As someone mentioned, it really is like a two-bedroom room, which suited us perfectly.", "title": "Excellent in its price range", "helpfulness": 6, "user": "Glenshiro", "date": "November 27, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 4145723}], "location": {"country": "Spain", "region": "Andalucia", "continent": "Europe"}, "stars": 1, "variance": {"poor": 14, "average": 27, "very good": 103, "terrible": 8, "excellent": 45}, "aka": "Simon Hotel Seville", "slim_ranking": 0.345238095238}