{"user_rating": 4.5, "review_count": 359, "name": "Simonton Court Historic Inn and Cottages", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed June 2007, traveled solo", "text": "I have stayed in many places in Key West, and there are far better options than Simonton Court for the same price. I recently stayed for 3 nights, and there were many problems. The room was quite dirty, the noise from the street was continuous and quite loud, and the amenities that you would expect for the price range of $200 - $300 per night are almost non-existent. Even the reference to multiple pools is quite misleading, as all but one are extremely small. If you are looking to stay at a nice Inn on Key West, I would strongly encourage you to look elsewhere. This place is high on promises, and looks good on the web - but fails to deliver.", "title": "Over-promise; Under-Deliver", "helpfulness": 4, "user": "UTaka", "date": "June 18, 2007", "detail_rating": {"cleanliness": 1.0, "front_desk": 3.0, "location": 1.0, "business": 2.0, "rooms": 1.0}, "id": 7899147}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We stayed at Simonton Court May 22-27 and enjoyed every moment of it. We arrived at the hotel at 11:30 and our room was ready so we checked in and went directly to the room, the man the checked us in helped us carry our bags and made sure we were happy with everything before he left.", "title": "Great Placse to Stay", "helpfulness": 2, "user": "keywest22", "date": "June 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 7771734, "likes": {"liked": "— The room s are huge and private, as are most of the pools.", "disliked": "— Nothing- loved it!"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007", "text": "The room was beautiful and clean and had everything we needed. There was a safe which we used the entire stay. Everyday there was maid service so we would go down to breakfast, which they serve every morning and come back and our room was clean.", "title": "Some better than others", "helpfulness": 6, "user": "RTripper", "date": "March 23, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 7207982}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "I can't say enough about the place and the staff- we will be returning!!", "title": "Just Perfect!!", "helpfulness": 4, "user": "ericaumpt", "date": "March 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7191608}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "This is a pretty place, in a convient location downtown. It's a little worn around the edges, but the grounds are very pretty. My only comment would be to make sure of the room you are getting. Some are better than others, and I would ask the receptionist to be honest about which one you're booked in. SC 6 is a very nice room, the downstairs of a 2 story Key West charmer, but it's on the street. Noise is minimal and interior is new and fresh.", "title": "What a beautiful place to stay!", "helpfulness": 4, "user": "where-to-begin", "date": "February 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6849558}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "We visited Key West for the first time and selected Simonton Court. Not familiar with the area, we wanted to stay in a place that was in walking distance of most attractions. This inn is one block off of Duval Street, right in the middle of all of the action, but is also an oasis.", "title": "The most beautiful inn", "helpfulness": 4, "user": "yogibb", "date": "February 11, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13465226, "likes": {"liked": "— High quality of the facilities and the lush grounds", "disliked": "— Our room was a bit small for us but that was our choice..."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We stayed in one of the cigar cottages that had been divided into two rooms. Ours was the Lantana room which was a small room but with luxurious linens, clean designs and private as it located at the back of the small resort. We had our own entrance, which is something we prefer.", "title": "Happy Christmas!", "helpfulness": 6, "user": "newboldbobs", "date": "January 15, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 5.0, "value": 4.0, "rooms": 5.0}, "id": 12627561, "likes": {"liked": "— Semi private pool outside Hibiscus.", "disliked": "— Some road noise."}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The grounds were the best part of the inn. Extremely lush foliage, hidden lighting, several small pools tucked in here and there made this a perfect tropical setting to relax and enjoy.", "title": "Another Great Stay", "helpfulness": 3, "user": "TinkerII", "date": "January 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 12328794, "likes": {"liked": "— Room was large and livable", "disliked": "— Shower could be a bit bigger"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The continental breakfast had a wide selection and all during the day ice tea and coffee was available along with fresh fruit.", "title": "Great B&B in Key West", "helpfulness": 5, "user": "SpartanRoadWarrier", "date": "December 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 11641659, "likes": {"liked": "— Great property. Beautiful Grounds", "disliked": "— The traffic (noise from traffic) on Simonton."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The staff was extremely helpful especially with the concierge services.", "title": "Great place", "helpfulness": 5, "user": "SunandSkiers", "date": "October 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10328482, "likes": {"liked": "— Quiet and well decorated.", "disliked": "— A/C unit was dying as we departed."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2003, traveled as a couple", "text": "An old gentleman at Keywest Information Center helped us book this place. After five years, we still thank him so much for leading us to this dream place for a getaway vacation. Our original plan was to stay for one night. But we decided to extend our stay.", "title": "my No.1 vacation stay", "helpfulness": 4, "user": "notsopickyi", "date": "September 1, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8604162, "likes": {"liked": "— private pool", "disliked": "— room is small"}}, {"rating": 5.0, "title": "Exceeded our Expectations", "text": "The place is beautiful. The cottage is so cozy. We melted in the heated outdoor pool, which is surrounded by tropical plants and flowers, after coming back from water activities or shopping at Duval street, one block away.", "helpfulness": 4, "user": "Rainstorm", "date": "August 30, 2007", "id": 8548762}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "If you go at the right time, you may get very nice discount. So don't be scared by the listed price, check with the information center.", "title": "Simply the Best in Key West", "helpfulness": 5, "user": "medic7810", "date": "August 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8500074}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We think it is our best vacation stay. I highly recommend it for single or couples.", "title": "How romantic!", "helpfulness": 4, "user": "NJJoyful", "date": "August 10, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8392008, "likes": {"liked": "— clean with friendly staff", "disliked": "— not a thing-loved it!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We just spent 3 wonderful days in Key West at Simonton Court and we could not have been more pleased. I'm surprised this place is not recommended more often on TA. ....although it may be a good idea to keep it a secret. You feel the ambiance as soon as you enter the door on Simonton to a beautiful walkway full of plants and trees. Little cottages are in this area with pools located in different areas. The main pool is located in front of the mansion where breakfast is presented every morning at 8:30 with Ice water, Tea and fruit available all day. Nice touch. All rooms have a verandah or porch facing the garden, pool or street, so you can choose whatever situation that is pleasing to you. The lanterns are left on throughout the gardens all night - appreciative of this since we departed at 5:30am. We stayed in the ORCHID. King size bed, fridge - huge bathroom with old-fashioned claw tub. Completely renovated and all very Old Florida...especially the oversize porch with lovely furniture overlooking Eaton. Huge trees give you privacy but you can still sit out and watch all the activity. The Ghost tours come by at night -so you can listen to a portion of that in the comfort of your own space. Very entertaining. We chose Simonton for the location and the presentation on the website - fell in love with the place and will stay here again.", "title": "Very peaceful", "helpfulness": 3, "user": "Pennybobs", "date": "June 21, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 7957899, "likes": {"liked": "— Peacefulness enormous bed and double shower room", "disliked": "— nothing"}}, {"rating": 5.0, "title": "Elegant, Charming, but...", "text": "We recently stayed for three nights at the Simonton Court Inn. Hearing that Key West could be a little \"honky-tonk\", we wanted a peaceful place to stay - and just one block off of Duval, this is it. Once you enter the streetside gates, you are in a wonderful garden with cottages and suites off to each side, with several pools in secluded settings. Unfortunately, I booked late and being a little on the pricey side, the only room left even close to our price range was C7B - charming but very small and in need of some decoration. We tripped over each other getting dressed and using the bath/shower. The good thing was it was close to the continental breakfast (very nice, with a personal server - bagels, toast, waffles, french toast, half grapefruit, bananas, coffee, three juices). Best of all it was close to the main pool, so when we came back at night, we would take a private swim in the heated pool. But, if we come back to Key West, we will stay here again, but book a larger room.", "helpfulness": 2, "user": "newyorktraveler98", "date": "February 22, 2007", "id": 6830920}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We stayed here for 7 nights over Christmas 2005 and had such a great time we decided to book it again for this Christmas period when we got back to the U.K. We confirmed our reservation for MH1 Hibiscus - as before - in February 2006 and paid our deposit. I e-mailed the property to reconfirm just prior to our departure (on 17th December). We were therefore more than a little disappointed on our arrival on the 21st to be told that our room was being remodelled and wouldn't be ready until half way through our stay - had we not received their letter regarding this fact?! No!", "title": "Great second stay.", "helpfulness": 4, "user": "newboldbobs", "date": "January 10, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 6571045, "likes": {"liked": "— Privacy in Hibiscus.", "disliked": "— In need of a bit of a facelift."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "In all fairness to the member of staff who checked us in, he was very obliging and showed us around 2 other options on the property - we chose Cottage 4, Poppy - and told us we wouldn't have to pay for the upgrade (thanks!!) Whichever other option we chose however we would have to move part way through our 7 night stay - which ideally we didn't want to do having already had a 3 night stay and transfer from Fort Lauderdale and we were also moving on to another base for the rest of our holiday.", "title": "Fantastic experience!", "helpfulness": 4, "user": "lola06", "date": "November 7, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6083475, "likes": {"liked": "— The gardens", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Anyway, all this aside, Simonton Court is a lovely property with several (small) pools and accommodation offering a degree of privacy with private verandas with rocking chairs and swing seats in the cottages and many have their own private outdoor hot tubs. Sunbathing spots are limited at this time of year and it's mostly in the shade from approx. 3p.m. Breakfast isn't bad - mainly waffles, muffins, juice, coffee - no eggs etc. Complimentary water and iced tea by the pool all day. We would say the cottage 2 would be very tight for 4 people - although is had a queen bedroom and 2 doubles in the loft, only 1 small couch and 1 chair in the seating area and storage is laughable with a tiny very short wardrobe and drawer unit downstairs and only a waist high rail upstairs. Porch is very nice. Overall the accommodation in the complex needs a bit of a facelift.", "title": "Incredible Romantic Retreat", "helpfulness": 12, "user": "ali1298", "date": "August 21, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 5630088, "likes": {"liked": "— Well appointed rooms, staff, historical significance, proximity to Duval", "disliked": "— only suggestion is provided toiletries could be upgraded i.e.Aveda, maybe bathrobes?"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Hibiscus has been refurbished with seagrass flooring, large couch and 2 armchairs. It has its own outside hotub on the private deck right next to 1 of the small pools and it is lovely. Only downside now if this an issue for you is that it is listed as having a full kitchen and now only has a microwave - no cooker or hotplate - but with a full fridge and dishwasher. Also prone to some road noise as it is on the front but not a major problem.", "title": "Beautiful property---gracious staff", "helpfulness": 7, "user": "berrymango", "date": "August 17, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5620385}], "location": {"country": "United States"}, "variance": {"poor": 8, "average": 18, "very good": 63, "terrible": 8, "excellent": 262}, "aka": "Simonton Court Historic Inn And Cottages Hotel Key West", "slim_ranking": 0.319587628866, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "A converted mansion & 1880's cigar makers' cottage & factory, situated amid lush foliage, in the heart of the historic district."}