{"user_rating": 4.5, "review_count": 370, "name": "Sinalei Reef Resort", "reviews": [{"rating": 5.0, "title": "Sensational Sinalei", "text": "We have just returned from our Honeymoon at Sinalei Reef Resort in Samoa and just had to come online to have a rave about it! This place is awesome!", "helpfulness": 6, "user": "A TripAdvisor user", "date": "April 23, 2006", "id": 4997962}, {"rating": 5.0, "title": "Relaxed, Rejuvenated, Returning", "text": "Why should you go to Samoa? It is a truly beautiful place with gorgeous beaches, great surf, and friendly people.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "April 22, 2006", "id": 4996027}, {"rating": 2.0, "stay_parameters": "Stayed April 2006", "text": "Why should you stay at Sinalei? Because it has the lot - comfortable rooms with ensuite and air conditioning (essential if your wife isn't quite the surfer dude that you are and likes a few niceities), great restaurants / food, amazing pool with bar, golf course, tennis, spa, tours, water sports stuff, theyll organise tours for you, etc, etc.", "title": "Beautiful resort but not good value for money", "helpfulness": 6, "user": "Kate1972", "date": "April 17, 2006", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "rooms": 2.0, "service": 3.0}, "id": 4983364}, {"rating": 5.0, "title": "Absolutely Wonderful!", "text": "A couple of highlights for us - the Fia Fia night (fire dancing), friendly staff lead by Giovanni, and having no option other than to relax!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "April 12, 2006", "id": 4971837}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "We stayed at Sinalei for 6 nights and overall were very impressed. We never read tripadvisor when taking holidays as other peoples reviews can sway your own experiences. We feel that we need to write a review on Sinalei because we had a wonderful holiday and great experiences.", "title": "Loved our stay", "helpfulness": 3, "user": "madcowmu", "date": "April 10, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4954910}, {"rating": 5.0, "title": "Brilliant Sinalei", "text": "I can only concur with the above comments. As an Airline Pilot I have stayed in many great spots all over the world. Sinalei easily comes out number 1 - and the main reason is the staff. Giovanni, Princess Assetta, and all the rest. I felt like I was a personal friend by the time we left. I really felt special.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "May 19, 2006", "id": 5180969}, {"rating": 1.0, "title": "A Big Big Disappointment", "text": "It is also a gorgeous location. So archetypically a tropical resort paradise.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "May 19, 2006", "id": 5180944}, {"rating": 5.0, "title": "SInalei highly recommended", "text": "But again I get back to the brilliant service. Sinalei is not normally a place that allows kids - but considering we were there for a wedding they made an acception. They fussed over my kids (who I must say were very well behaved and bothered no-one) and made them feel special too. Because it was not normally a kids resort there is no special kids menu - but every afternoon without fail Givanni contacted us and asked what the kids would like for dinner that night. Even we weren't thinking about it in the afternoon, but Giovanni had our kids stomachs in mind. That guy is the coolest dude. From James and Sophie Giovanni - we love you.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "May 7, 2006", "id": 5041269}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "Lying on the beach, reading a good book, drinking Baileys and watching my kids snorkel - doesn't get any better. Simply the best holiday I have ever had.", "title": "Service with a smile", "helpfulness": 4, "user": "TheHaddies", "date": "May 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5032036}, {"rating": 5.0, "title": "This resort has it all!!", "text": "My husband and I spent 7 dreadful days at the Sinalei Resort and we must admit it had to be the worst Holiday we have ever experienced, from the greeting at the Airport to the Formula one drive from the Airport to the Resort to the checkin was the start of a bad omen which lead to a terrible stay, we have read the positive and negative reviews posted below and we must admit our holiday was a big disappointment.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "May 1, 2006", "id": 5025989}], "location": {"country": "Samoa", "continent": "South Pacific", "city": "Apia"}, "stars": 4, "variance": {"poor": 8, "average": 17, "very good": 71, "terrible": 12, "excellent": 262}, "aka": "Sinalei Reef Hotel Apia", "slim_ranking": 0.0344827586207, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}