{"user_rating": 5.0, "review_count": 128, "name": "Singita Boulders Lodge", "reviews": [{"rating": 5.0, "title": "Extreme luxury", "text": "As everyone else has said here this is pretty fabulous place. I think you could probably stay in your impossibly beautiful private cottage the whole time and be happy. The cottages are huge, 2 bathrooms, a bathtub, an indoor and outdoor shower, a private pool, fireplace, fabulous furniture, great complimentary toiletries (Dermologica). The game drives were great here too, we saw lion cubs, hyena cubs, leopard cubs, a pack of male lions who roared to each other while surrounding our vehicle which was amazing. The food is very good with both buffet and plated meals which is nice because some other places are all buffet which gets tiring even if the buffet is high quality. Although the food was good the thing that was really special here was the wine program. They have their own sommelier and he offers free wine tastings if you let him know a little bit ahead of time. This isn't really what you might think of when you think of free wine tasting, this is a professional fully opening his amazingly stocked cellar and sharing with you his knowledge of south african wines. I learned a lot and was able to use some of this knowledge on the rest of my trip. This was really special and the highlight of our stay, aside from the animal sightings. The only negative thing I would say is that the service is a little overly fawning at times which I find grating, and even though they say it is relaxed I found the atmosphere it a bit more formal than I would care for.", "user": "oscarfelix", "date": "November 15, 2008", "id": 21868722}, {"rating": 5.0, "title": "Luxury in Sabi Sands", "text": "Cannot compare to any place we have ever been. An experience that everyone should have.", "user": "123123NY", "date": "November 3, 2008", "id": 21518150}, {"rating": 5.0, "title": "Exceeded all Expectations", "text": "My husband and I stayed at Singita Boulders Lodge (in suite 9) for 3 nights in September. The experience was beyond incredible- from arrival to departure. Every staff member went out of his/her way to ensure our stay was in line with the true Singita experience. (Exs: our camera broke after we came back from the first safari drive- under idle threats of divorce- my husband explained the situation to the staff and we were given a digital slr camera to use for the rest of our stay- no questions asked. We missed our opportunity to sign up for a wine tasting in the cellar- which is a beautiful sight in and of itself- and upon our return from afternoon safari we were assured there was room for us. We got to share fantastic South African wines with Singita's owner Luke Bailes. A special dinner was arranged in our room along with candles, champagne, etc. The list of experiences like this goes on and on...)", "user": "sunvalleySeattle", "date": "September 29, 2008", "id": 20473122}, {"rating": 5.0, "title": "The best of the best: unforgettable Singita", "text": "Rooms: Beautifully decorated and big enough, in my opinion, to be considered a small home. They are exactly as they appear on the website and so comfortable. There is an ipod with local music and a stereo system that resonates through the rooms. There are books, sketch pads, and paints if you feel inspired by the surroundings. The fireplace was lit each night when we got home from dinner, the plunge pool was a bit cold but so refreshing, there were elephants roaming several hundred feet from our deck, there were impalas and kudu grazing directly off our deck. The feeling and sounds that come with taking advantage of the two outdoor showers were indescribable. Each guest is also provided with an endless supply of wines, other beverages and snacks. The bed is super cozy and outfitted with a mosquito net (that was never needed but still comforting to have). Laundry service 2x/day- picked up and delivered directly to your room.", "user": "KJHlincs", "date": "August 31, 2008", "id": 19574538}, {"rating": 5.0, "title": "Extraordinary", "text": "Staff: Friendly, knowledgable, helpful. Guests are provided with a personal butler and porters to escort you each night and morning to the main lodge (there are wild animals roaming through the camp- i.e. nearly squeezed my husband's hand off when we came face to face with hyenas one night and a pack of baboons the next morning). It is a fantastic thing to see a place that is run by people who are genuninely excited and happy to be there. That is the feeling we got from every staff member we came across. Special thanks to Sean for the use of the camera. Our ranger- Coleman, and spotter- Lewis, were amazing. Lewis tracked 2 male lions alone...on foot!", "user": "traveller0263", "date": "August 13, 2008", "id": 18909554}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "I recently returned from a week long trip at both the singita boulders and sweni lodges.", "title": "singita game reserve", "helpfulness": 1, "user": "scottsdaletraveler", "date": "June 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31337037}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "In a nut shell, Africa has reserved large parcels of land to preserve the natural habitat and companies bid to aquire 20 year leases. The singita properties apparently have the top locations and provided excellant lodges on these parcels. the game sightings at the boulders was better than at sweni. sweni was much newer and probably a little nicer than the boulders although the boulders was bigger. the food at sweni was probably a little better than at the boulders. the staff at both resorts was great. in the end, its about the guide as I assume people go there to view the game and everything else is secondary. It is nice to stay in a four seasons equivalent resort after traveling half the world. the only dissapointment on this trip was the food. it was good but certainly not like eating at a gourment restraunt. the spa treatments were good.", "title": "Singita boulders-one of a kind", "helpfulness": 2, "user": "ltdrebin", "date": "May 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29943167}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled solo", "text": "Singita is an experience not to be missed. The rooms are the size of small houses with each room having a heated plunge pool overlooking the animals. The food is 5 star at every meal. The service is over the top with things like afternoon wine and snacks in the middle of the bush and reserve wine served at every meal. We did a wine tasting at the Boulders (the name of our lodge) private cellar which was excellent. Following the tasting the sommelier brought us a list of each wine we tasted and a description of them. This was personalized to each guest. The game viewing is amazing but I'm sure you get that at many lodges. The real thing here is the unique nature of such incredibly luxury in the middle of the african bush.", "title": "Simply the best!", "user": "cwfrei", "date": "April 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28866816}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "A few things you might want to know that we did not until we got there:", "title": "Truly Fantastic!", "user": "padlow", "date": "February 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25013374}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "the planes flying in and out of Singita are about 10-14 seat prop planes.", "title": "Candy on the top - fantastic", "helpfulness": 1, "user": "travelfundiLondon", "date": "January 31, 2009", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 24050852, "likes": {"liked": "— felt like the world belonged to us - completely private", "disliked": "— nothing"}}, {"rating": 5.0, "title": "Great experience", "text": "Great experience, very good game drives. If one is looking for the most luxurious safari on earth, I believe this is the place.", "user": "cenoronha", "date": "April 16, 2008", "id": 15078605}, {"rating": 5.0, "stay_parameters": "Stayed March 2007", "text": "No matter where you've been in the world, South Africa is the most fantastic location ever for even the most Jaded traveller. The top safari lodges like Boulder & Ebony are worth the steep prices for the service (you get your own butler), & for the informative safari guides (they know where to find the animals & teach you all about them - the cheaper lodges aren't nearly as talented). We stayed at Ebony for 3 nights & then they packed up our bags for us & we stayed at Boulder for 2 nights. We preferred Ebony as it is more traditional British Colonial & Boulders was more modern, with one whole wall being pure glass. The food at both was fantastic, & the unique romantic dinners will be remembered for the rest of our lives. Nothing compares to what you'll experience here. Don't pack too much, because they do your laundry every day for free.", "title": "Trip of a Lifetime", "helpfulness": 2, "user": "Kikik1234", "date": "February 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13828185, "likes": {"liked": "— Service, Safai, Private Villas"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "This is more than just a hotel/resort property but rather, a magical place in which to experience the best in African Wildlife Viewing.", "title": "Amazing Service, Facilities and Game Drives", "helpfulness": 2, "user": "BayArea52", "date": "January 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12998743, "likes": {"liked": "— Professional warm staff, over the top accomodations, food and range drives", "disliked": "— Nothng to report"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We stayed at a couple of other very fine safari camps but Singita certainly has the pedigree - particularly the staff. They are all warm and accomodating to every need and comfort. The individulal rooms/lodges are over the top with private infinity pools, open mini snack and mini bar (no charges here) and include everything you'd need. We had laundry done every day which was also included. The food was amazing with a full range menu offered each night accomodating many tastes. I had one of the best beef filets there - not fancy tasting menu style but rather, exceptionally prepared 4 star meals. The wine cellar is one of the best in South Africa. Apparently, they also have a wine cellar in Cape Town with over 40k bottles of fine wine.", "title": "The best part of our honeymoon", "helpfulness": 1, "user": "MrsO_75", "date": "January 15, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12660179}, {"rating": 5.0, "title": "Perfection in the bush", "text": "The best part was experiencing the game drives. Jonathan our ranger and Gianai our tracker helped to make our trip something that will be memorable for life. They are professionals who spend years learning about conservation, wildlife management and every animal and switchback in the park. They went out of their way to make sure our experience was memorable.", "user": "mbrice", "date": "November 15, 2007", "id": 10837885}, {"rating": 5.0, "title": "Living up to \"World's Best\"", "text": "Singita has been rated \"World's Best\" by so many magazines for so many years. I was very excited about finally visiting Singita first hand and seeing exactly what World's Best meant. I stayed at Singita Boulders, which is one of two adjacent lodges, the other being Ebony.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "August 2, 2008", "id": 18556696}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The style of Boulders was right up my alley. I loved the African motif and the welcome arrival is very spectacular. The lodge is done in browns with expansive views from every area.", "title": "Unbeatable experience", "user": "fairyjay", "date": "July 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 18421024, "likes": {"liked": "— Situation", "disliked": "— That we couldn't stay longer!"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2003, traveled as a couple", "text": "Each suite is like its own little house spread over a long open floor plan. One side of the suite is made up of floor to ceiling windows looking out of a deck with plunge pool and the bush. I saw monkeys and other game right near my balcony.", "title": "All senses explored", "user": "AmericasPoloCup", "date": "June 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17348566}, {"rating": 5.0, "stay_parameters": "Stayed March 2003, traveled as a couple", "text": "The suite has bedroom, living and bath areas with generous space. Singita's staff will arrange any special services in your suite including massages and meals. I never wanted to leave!", "title": "the ultimate safari", "helpfulness": 2, "user": "mren", "date": "June 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17104424, "likes": {"liked": "— everything", "disliked": "— Whatever lenght of stay, it will be too short"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "Wildlife viewing in Sabi Sand is some of the best in Africa. I had up-close encounters with all of the big five. Animals are used to seeing humans and are happy to lie around while you snap pictures. Be sure to ask your guide for a bush walk, when you leave the vehicle for some adventures on foot.", "title": "Best experince ever", "helpfulness": 1, "user": "Sifie", "date": "May 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16546004, "likes": {"liked": "— Best accomodation I have ever seen", "disliked": "— Couldn't spend the rest of my life there!"}}], "location": {}, "stars": 5, "variance": {"poor": 0, "average": 2, "very good": 6, "terrible": 2, "excellent": 118}, "aka": "Singita Boulders Hotel Singita Private Game Reserve", "slim_ranking": 0.5, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "description": "Singita Boulders, situated in the exclusive Sabi Sand Reserve on 45,000 acres of private reserve, is built around the theme of nature. This private reserve is an area known for prolific wildlife and exlusive game viewing. Beautifully appointed alongside the Sand River, Boulders Lodge exhibits an air of tranquility with 12 luxury suites all air-conditioned and each with private plunge pools."}