{"user_rating": 4.5, "review_count": 391, "name": "Sivatel Bangkok", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Spent 3 nights here and enjoyed it. Fabulous suite, huge with just about the largest bed I've ever slept in. Bathroom as large as some hotel bedrooms with spa bath and separate shower cubicle. Staff all very helpful and polite. Had dinner in the restaurant by pool one night-excellent. Breakfast also very good with huge choice of hot and cold as well as freshly cooked eggs. Infinity pool was also great-looks right down on the British Embassy! Not a huge area around the pool so I wonder if it might be too crowded if hotel very busy? That said, we would certainly stay again.", "title": "Great Hotel", "helpfulness": 11, "user": "disleksik", "date": "February 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 152190272}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Stayed at the Sivatel last year at the end of a family holiday to Thailand. Staff were extremely friendly and professional and treated us like VIP guests even though we were dressed in shorts and t-shirts after getting off the plane from Phuket. The 2 bedroom suite was huge. The bed was the most comfortable I had ever slept in. The buffet breakfast had great quality and variety. Excellent service and coffee. Had a few meals in the Cafe on the ground floor and found the quality of the food and the cocktails to be of a high standard. There is an ATM on site which I found very convenient. The Sivatel is a short walk to the Ploen Chit sky train and close to Siam Paragon and MBK shopping centres. The kids loved the infinity pool (great photo opportunities) and myself and my husband enjoyed a few margaritas on the sun loungers. A welcome oasis from the hustle and bustle of Bangkok. The Sivatel is well presented and the staff were very friendly and helpful. Have booked in for a week in July this year. Looking forward to it!", "title": "Oasis", "helpfulness": 9, "user": "rossmck65", "date": "February 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151885774}, {"rating": 3.0, "stay_parameters": "Stayed February 2013", "text": "We had stayed at its suite but we would not recommend a stay at this hotel unless you plan to always use the subway as the sole mode of transportation even at night.", "title": "Truly Disappointing", "helpfulness": 3, "user": "Nicole L", "date": "February 10, 2013", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 2.0, "service": 2.0, "rooms": 4.0}, "id": 151850998}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Located opposite the British Embassy and near several Embassies including the American Embassy it seemed a security risk and an unlikely location for a hotel. It was unfortunate that there seemed to be a culture of taxi-drivers taking tourists for 'a ride' in Bangkok. This happens on a constant basis even though we had shown the taxi drivers the hotel address in Thai.", "title": "Perfect treat", "helpfulness": 9, "user": "ACRipley", "date": "February 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 151657245}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "On one occasion, 12 taxis and tut-tuts all refused to take us to the hotel as we were only nearby and 1only 5 minutes away by foot.", "title": "Great Location", "helpfulness": 5, "user": "Spirit2006", "date": "February 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 151522544}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "The room is spacious & modern. For the rate we paid, it's very good value for money. Check-in process was pleasant. We were served cold cocktails and served fragrant cold towels. Staff are also eager to please. Had a good sleep with the varieties of pillows provided from the pillow menu. Don't think it's a 5 star yet, but a solid 4 star hotel.", "title": "Great room", "helpfulness": 4, "user": "Mulberry79", "date": "January 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 150272349}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Modern, well located, fabulous staff. I left my iPad on the flight into Bangkok and the staff called the airport when we arrived at 3:30am and it was found and held for me! Cant fault the place, great pool, great food and again…..great staff. Booked to stay in a weeks time on the return leg we were that impressed.", "title": "WOW", "helpfulness": 5, "user": "Peter L", "date": "January 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150223951}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We stayed at the Sivatel for 4 nights in January '13. We originally booked to stay for 2 nights but decided to stay an additional 2. Fantastic location, 5min walk to the Skytrain - best mode of transport around the city as traffic can be absolutely mental from 5 - 8pm at night. We stayed in the Regal suite - room 1950 on the 19th floor with fantastic views over the city. Lunch & evening food is excellent & also reasonably priced for a 5 star hotel.. Breakfast was great, fantastic selection of hot & cold food & all staff were very attentive. We had a slight hicup with our room cards but this was recified very quickly. Would definitely recommend anyone to stay here. Enjoy.", "title": "Fantastic Hotel", "helpfulness": 5, "user": "Snuggybug", "date": "January 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150172274}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "I have stayed at the Sivatel hotel in Bangkok twice now and it's a great hotel with a great location. The hotel overlooks the British embassy and holds a central location in town and just a 100m from the sky train with only 2 stops from Siem square (20 THB). I stayed in a Regal Suite on floor 22 which offers the most fantastic views over the city especially at night when the city is bathed in light from various high rise buildings. The room is spacious with all the modern amenities you require, a walk in closet, large bathroom with shower and Jacuzzi style bath. The room as a large lounge to relax in and separate bedroom with a very comfortable bed offering a range of pillows to suit your personal requirements.", "title": "Great hotel, great location in Bangkok", "helpfulness": 5, "user": "Stephen L", "date": "January 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150072527}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "The hotel has an infinity pool and spa on the 8th floor and nice little bar set in a garden setting. The Sivatel also offers 2 restaurants, one on the ground floor and the other on the 8th both offering good food if you wish to eat in the hotel. Breakfast is also served in the restaurant on the 8th floor.", "title": "Simply The Best", "helpfulness": 3, "user": "Natiwut2013", "date": "January 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149851358}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "The stay in the Sivatel Bangkok is surprisingly good despite the price. The location is very convenient which is just just three minutes on foot from the Phloen Chit BRT station. It is reasonably close to the main tourist area in Siam and Chit Lom while also reasonably distant from the crowd. On both sides of the hotel building, there is a big construction site. Maybe in a year or two, the building would be surrounded by new tall buildings that may make the views less open, but at the same time, make the location more close to shopping and eating outlets, which is at this moment, a bit lacked.", "title": "Good value for the money spent", "helpfulness": 4, "user": "yhpian", "date": "January 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 149722208}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "There is no fancy decoration but the hotel just has provided what make one feel home. Room is spacious with separate living area and bedroom. The walk-in closet is a nice transition between entrance and bathroom. The bathroom is so big that a very large bath tub and a very large shower cubicle can be accommodated. With a fixed glass by the bath tub, it allows sight to city view while bathing. For the IT gimmick, there are two large flat screens with Apple TV and free wifi of good speed.", "title": "Excellent stay", "helpfulness": 5, "user": "UKLors", "date": "January 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149499914}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The amenity facilities are located on 8th floor. There is a fitness centre which is well equipped with machines and a big dance room. The infinity pool is small for laps but good for leisure with quite a few sun beds. The all-day dining restaurant is just besides the pool. According to Bangkok standard, the breakfast is not big, but the quality is surprisingly good. I enjoyed the prawn spaghetti very much and it is pity that the dish changed on the next morning.", "title": "Excellent. Value for money", "helpfulness": 6, "user": "IoanaEne", "date": "January 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 149478871}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The services is friendly that all staffs wear a warm smile and are helpful.", "title": "Fabulous All-Suite Hotel!", "helpfulness": 7, "user": "RachelJWZHB", "date": "January 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 149395211}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Bangkok always has a good choices of hotels with good value of money. This one is particularly good as it has pushing herself to edge of high end hotel but keeping a competitive price.", "title": "Huge room; Value for money", "helpfulness": 4, "user": "JackleJason", "date": "January 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 149045239}, {"rating": 4.0, "stay_parameters": "Stayed December 2012", "text": "The rooms are very spacious and modern. We had a big sleepingroom and a spacious bathroom with a bubblebath. The view is amazing. Hard to find a restaurant in the breakfast oké, service a little chaotic. The hotel is quite new and lacks a warm armosphere. Businesslike, but good quality for reasonable price.", "title": "Good value", "helpfulness": 5, "user": "Vakantieganger2010", "date": "February 3, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 3.0, "rooms": 5.0}, "id": 151308565}, {"rating": 4.0, "title": "Great rooms, not so great food", "text": "The service and rooms at the Sivatel were wonderful! The view was nice, the pool was beautiful, and the rooms were very relaxing. The location is great. Being right next to the sky train really makes getting around a lot easier. Unfortunately, the dinner was overpriced for the quality we received. Additionally, the breakfast was lacking in the Western area of things, but if you life Asian breakfast (rice, duck, etc.) the options are quite vast. The service at breakfast was also disappointing as it took 5 minutes to find someone for the omelet station and to get a cup of coffee.", "helpfulness": 7, "user": "Rachel W", "date": "February 3, 2013", "id": 151283877}, {"rating": 5.0, "title": "Top notch", "text": "This is a really good hotel. Situated about a 20 minute walk from Lumpini Park, it's in a good location. The rooms are spacious, very spacious actually with a large walk in wordrobe and lounge area. Bathroom with large shower and jacuzzi bath. My only criticism was that the drinks by the pool were far too expensive (especially for Thailand). Other than that, really enjoyed my four days at this hotel", "helpfulness": 7, "user": "smallsFR", "date": "February 1, 2013", "id": 151149875}, {"rating": 5.0, "title": "Excellent hotel", "text": "We were surprised at the spacious suite ( bedroom, lounge room and bathroom) we were given, fresh fruit in room, a pillow menu of 8 pillows! Also yummy Thai food served in our room. Friendly service. A peaceful cool contrast to the crazy streets far below. Value for money.", "helpfulness": 6, "user": "Fishie x", "date": "January 26, 2013", "id": 150645785}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "I stayed in Sivatel, BKK with my beloved one in December, 2012, and we loved the stay with them so much. The location is just great, it is in the very center of the city, just one stop from Central World Mall by Skytrain. The staff was friendly and polite, the room was clean, the bed was extremely comfortable and relaxing. More over, we got an upgrade, and it was a pleasant surprise on our trip. The room was very modern and well-equiped, the food was great, so we highly recomend Sivatel for your stay; and we we will consider on staying in it again when we are in Bangkok next time .", "title": "Great hotel, stylish, friendly and clean!", "helpfulness": 4, "user": "Alisa M", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150352107}], "location": {"country": "Thailand", "continent": "Asia"}, "stars": 5, "variance": {"poor": 6, "average": 18, "very good": 96, "terrible": 1, "excellent": 270}, "aka": "Sivatel Bangkok Hotel Bangkok", "slim_ranking": 0.0585034013605, "description": "Sivatel Bangkok brings to Thailand a new kind of Bangkok business hotel offering comfort, connectivity and relaxed cordiality. We are the city’s friendliest luxury central hotel accommodation in the heart of downtown Bangkok.Our central Bangkok hotel rooms and facilities make for a high-rise haven amid the city's beguiling combination of ultra-modern style and historical grandeur. Seventy-five large suites feature contemporary design elements enhanced by equally up-to-the-minute amenities. Guests enjoy metropolitan chic along with advanced information technology, maximum security systems and splendid views over the capital."}