{"user_rating": 4.5, "review_count": 427, "name": "Skene House Rosemount", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "I have stayed in Skene Suites on numerous occasions but was delighted to find myself in yet another new enhanced syle of apartment on this visit. The smooth friendly check in always creates the perfect relaxed start to a stay as its genuine and not rehersed as I feel many hotels just \"go through the motions.\"", "title": "Ladies - suites are the way forward for single travellers", "user": "WeegeeG", "date": "June 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 66412670}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "I was in a 1 bed suite but it seemed very spacious and modern. The contempory feel is now refelcted all over the apartment. The bedroom was not massive but it still had a dressing table, wardrobe large double bed and flat screen tv. The best feature as a single lady traveller is mirrors are placed near plugs and a seating area!", "title": "Best place we have stayed in Aberdeen", "user": "doricplymouth", "date": "May 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65930249}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "Kitchen was well equiped and even included a cafetiere ,washing up liquid and dishwasher tablets. (they clearly anticpate guests to use the kitchens as everything is thought of) My lounge had another large flat screen tv but the highlight for most ladies was the bathroom. Very bright, modern, with great fluffy thick towels and a fabulous double shower.", "title": "top class in every aspect", "user": "charliewhitby", "date": "May 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65719644}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Breakfast is included even though they have the great kitchen. I ventured to the friendly immaculate breakfast room for a read of the papaers and my usual healthy options!", "title": "excellant and comfortable apartment", "user": "bankser", "date": "May 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 64756959}, {"rating": 5.0, "stay_parameters": "Stayed May 2010", "text": "I cannot fault the Skene Suite experience and just question why anyone would chose a small hotel room with dodgy room servcie and no space to work or eat - v - a spacious suite with home from home facilities!", "title": "Amazing value and service", "user": "laugherson", "date": "May 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64476189}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "This is a seriously good choice: you get a suite with all the amenities, centrally located, friendly service and the best part: it's very reasonably priced.", "title": "Perfect!", "user": "silenzio", "date": "June 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67120513}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "I was expecting for a great hotel following the reviews I read here and I was happy to see it was indeed in very high standards and with all comforts.", "title": "excellent value, location and comfort", "user": "NottinghamHamble", "date": "June 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67044098}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "I would definitely recommend Skene house to anyone who finds himself in Aberdeen!", "title": "A spacious nice home for our weekend stay", "user": "Bodilla", "date": "June 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 66825097}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Wasn't sure what to expect with a suit - we paid 55 for two of us for a saturday night (may have been an offer) and found a large lounge, fully equipped kitchen (with fresh milk, juice, bread, tea/ coffee, jams, cereals for breakfast), good size bedroom and bathroom with bath - basically a proper apartment. It was very quiet as the walls are stone, 10 mins walk from the centre/ station. The staff were the friendliest and most helpful people we came across in Aberdeen (the Stagecoach staff at the bus station were appalling and the train information staff weren't very helpful either so it was a relief to have some excellent customer service). The TV doesn't have all the freeview channels but the room had free WIFI. The decor is a bit dates in places but it kind of added to the charm and it was very clean (lovely crisp duvet etc). It totally exceeded our expectations.", "title": "Very nice spacious rooms in a great central location", "user": "Foggielad", "date": "June 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66645859}, {"rating": 5.0, "stay_parameters": "Stayed March 2010", "text": "We were four grown up girls staying in one suite from friday to sunday. Nive to have so musch space and time together when we needed a time out from shopping. Helpful and attantive staff", "title": "Excellent Room, Exceptional Staff", "user": "Alan_McMahon", "date": "June 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66470297}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Had an enjoyable stay,everything as expected . The only quibble I had was that the bedroom in our \"superior\" suite was a little dark due to the window facing out onto a wall ! otherwise excellent and spotlessly fresh and clean . Management promptly responded to my comments on their feedback form.", "title": "Excellent accomodation in the heart of the city", "user": "montymuffin", "date": "June 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68974644}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "The hotel is within walking distance of the city centre, the staff were very helpful and we really enjoyed our stay,", "title": "Excellent city centre hotel", "user": "scwelchy", "date": "June 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68637758}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "These appartments were just what we were looking for. We stayed for 1 night as a birthday celebration. The appartments are very central. It was a bit of a trail to find the reception and check in was slow. Once at our appartment we were pleasantly surprised. The appartment consisted of 1 double room. Fully equiped kitchen/living room and lovely bathroom with walk in shower an nice complimentary toiletries. Buffet and cooked breakfast was supplied in the morning. a great stay and would defo visit again.", "title": "Great wee place", "user": "HappyChick2008", "date": "June 25, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 68621841}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "Another stay at Skene House Rosemount. It ticks all the boxes for an Aberdeen business trip - plenty of space to work, near the city centre, internet access and helpful staff.", "title": "Up to their usual high standards", "user": "RAWELondon", "date": "June 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 68204932}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We stayed at the Skene Rosemount for three nights and were pretty happy with it. We had a superior room which consisted of a bedroom, a bathroom and a lounge / diner / kitchen. I would be happy to stay there again and probably will do.", "title": "Comfortable and convenient – would stay again", "user": "AA_Corbridge_UK", "date": "June 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 67372485}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "Stayed here with 4 friends last weekend on one of their \"Girls' weekend\" packages in one of their 3 bedroom suites. It's a fantastic central location only 2 minutes walk from Union Street. From the moment we arrived the staff were very friendly and helpful (Rosemount reception staff particularly). The rooms were spacious, bright and welcoming. Everything was exceptionally clean and as part of our package we got food and nibbles included and found the fridge well stocked. Breakast was lovely and there was more than enough for even the hungriest traveller. Both the continental and the cooked breakfast were of a high standard. Lots of attention to detail really made the difference. Everything we could possibly have needed was provided and more.", "title": "Spacious rooms, friendly helpful staff, wouldn't stay anywhere else!", "user": "stormygreeneyes", "date": "May 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64057600}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "This place really is a wonderful find and I enjoyed my weekend there so much I want to go back already! To top it all it is excellent value for money. If I manage to come back to Aberdeen for a break I won't even consider staying anywhere else.", "title": "The best stay I have experienced in the U.K.", "user": "JintyArdrossan", "date": "April 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60174943}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "The Skene House HotelSuites in Rosemount, Aberdeen have it all. The location is excellent - handy for theatre, museum art gallery etc. The rooms are spotlessly clean and have everything needed for your stay. The staff, from the concierge to the cleaning crew are wonderful. Receptionists at the desk are extremely helpful, nothing is a trouble for them,", "title": "Excellent experience", "user": "DoriWoodger", "date": "April 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60070747}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "Great location close to good restaurants, shops, theatre and cinema.", "title": "I wish I'd discovered this place earlier!", "user": "Smudges-dad", "date": "March 30, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 59902780}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "I've stayed here a couple of times and while not cheap, it's nice to have a roomy apartment with basic cooking facilities and proper milk (not the abomination of UHT) in the fridge. Rooms are basic but comfortable and the upside is having a separate longe and bedroom, although that means you can't watch TV in bed.", "title": "Amazing Hotel - Brilliant staff and perfct location", "user": "wills_85", "date": "March 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57512843}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 15, "average": 25, "very good": 99, "terrible": 3, "excellent": 285}, "aka": "Skene House Rosemount Hotel", "slim_ranking": 0.0806451612903, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "4* Hotel Suites set in the cultural quarter of Aberdeen, only a few minutes’ walk to the theatre, art galleries and shopping centres.Smart, modern & comfortable serviced accommodation in Aberdeen with additional benefit of hotel services. Interiors have been designed by leading interior designers to offer guests a more minimal, streamline aesthetic – from the duplex penthouses offering bright and airy loft-style living to a more homely environment in Rothko’s tequila sunrise hues."}