{"user_rating": 4.0, "review_count": 678, "name": "Skyland Resort", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "I planned a three-day road trip in Virginia this past week and scheduled to spend the last night at Skyland Resort along Skyline Drive. Its essentially a sprawling lodge in the national park with a high elevation view of the countryside and in close proximity to the hiking trails. The resort had been closed up to the morning of my arrival due to a foot of snow from hurricane Sandy earlier in the week. I received an email the day before my arrival ( from Aramark which runs the resort) telling me that everything had been closed for a few days and suggesting I arrive after 4PM while they got the resort ready. I thought this was great customer service, but also a bit inconvenient as the amount of snow prevented the hiking I'd planned and I was also ready to just veg in my room after two days of driving.", "title": "Skyline drive road trip", "user": "Farmerica", "date": "November 4, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 144505411}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "I arrived just after noon and had a decent lunch of grilled chicken sandwich and mac and cheese. Service was good and my waiter was refreshingly candid about the mediocrity of some of the menu items, but I could tell that the dining room was short staffed and there appeared to be some tensions building as more diners appeared.", "title": "We love Skyland!", "user": "Jim f", "date": "November 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 144502113}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "I did not get into my room until after 3pm. It was in the Hazeltop section and I had a great view of the valley from my room. I had a traditional room with two queen beds, a balcony, and no tv, no microwave, no fridge or phone. It was well cleaned, except for a few cobwebs in the ceiling and the bathroom was full sized. It took awhile for the room to heat up and I had to use some bed pillows to block a draft area below the window. There were also a dozen flies on the window that I had to kill over the course of the evening.", "title": "Clean, functional rooms with amazing views inside the National Park", "user": "egland95", "date": "November 3, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "location": 5.0, "value": 4.0}, "id": 144401724}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "I drove back to the main lodge for dinner around 8pm and had a pleasant and reasonably priced meal of grilled salmon. Live music entertainment started at 9pm in the bar and it, too, was pleasant and the bartender was friendly and generous with giving a healthy pour. It was a quiet evening and overall a rustic but comfortable stay.", "title": "Skyland Resort is a good place to stay if you love the mountains.", "user": "Sharon S", "date": "November 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 144230722}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "I would not come back to the resort at this time of year again or in inclimate weather. It very much feels like it works best as a place to spend a summer overnight after hiking in the park or going to other nearby attractions. Though the room was far from luxurious, it was a comfortable nights sleep. I paid a rate of $136 for the night which was not exhorbitant, but $70-$90 range would make it a better value considering the lack of amenities. I did not have breakfast the next morning ( though it smelled good), but did pay $2.45 for a cup of coffee which was the only time I felt a bit gouged.", "title": "Nice but Rustic", "helpfulness": 1, "user": "Wendymennis", "date": "October 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 144093840}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "My partner and I stayed at Skyland for one night. He was unhappy about the lack of air conditioning in our room, but I am not a fan anyway (lucky it wasn't too hot). Our room had a balcony with a breathtaking view, and we had deer eating right outside in the evening. The rooms were clean and comfortable, but could use a bit of updating. We received great advice about horseback riding and hiking from staff, and everyone was friendly. Only complaint is that the food seems almost like airplane food; our dinner was delivered in a plastic shell. I'm not a fan of Aramark food, having had it at my former job, so if they could improve the quality of their food to match the location, this would be a perfect place. Their signature cocktails are unique (and include Virginia Lightning -- a legal moonshine) and worth trying!", "title": "Amazing views and location, and great, friendly people!", "user": "Queenofbees", "date": "April 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 28857534}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We drove up with our Dog and stayed in one of their great rooms. The rooms were very clean and had a great charm to them. The balcony was huge and had the best views. The restaurant served amazingly delicious food for dinner and breakfast. The Beds were very comfy and the sheets crispy Clean. The shower felt GREAT! We were very satisfied with the friendly staff and the great service. We will be coming back as soon as the leafs turn.", "title": "Great Rooms with Breathtaking views and Freindly service", "helpfulness": 1, "user": "JewishRussian", "date": "April 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28354464}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "I love Shenandoah National Park and I go there several times a year to stay at Skyland, as well as the other nearby lodge-Big Meadows. I have been going since I was a kid, and let me tell you, it is going downhill fast. For some reason, the park contracts out all of their services to a private contractor who has stripped the lodge of most of its character. Don't get me wrong--the Park itself still has enough to keep me going back forever, but don't expect much from their restaurant, lounge, or rooms. The food is very expensive and when we were there this past week, they had only one cook for dozens and dozens of diners. The fresh trout was anything BUT. The service was friendly, but wait staff were stressed to the max. We waited a good hour for our food, and the server kept forgetting things--including our daughter's meal, which was served about 15 minutes after the rest of us. The rooms are clean enough; the views are great, but they don't use fitted sheets and our bottom sheet was short--making for rather uncomfortable sleep.", "title": "The Park Service needs to take back the park from Aramark.", "helpfulness": 1, "user": "Hikinglvr", "date": "April 11, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 2.0}, "id": 27828233}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Aramark seems to be doing their best to cut corners wherever possible, and coming up short in every respect. In my humble opinion, Aramark needs to go! I will recommend this lodge, because, frankly, the lodge and cabins are perfectly situated to lots of hiking trails and the area is beautiful. Go for the mountains, but don't expect much bang for your buck at the lodges. If you want a truly worthwhile experience, camp at the campground at Big Meadows!", "title": "Skyland was perfect for this trip", "user": "blr0408", "date": "November 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 22163773, "likes": {"liked": "— Location", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "We spent five days in Shenandoah National Park - mainly hiking and enjoying the natural beauty of the area. I was originally booked at Big Meadows but changed last minute to the Skyland Resort. I was travelling with my boyfriend, mom, and aunt - we had reserved an adjoining cabin at Big Meadows, however, they could not guarantee two bathrooms for the four of us. Skyland worked out great for us - the rooms are a bit dated but a rustic, cabin feel fit the bill for this trip. The rooms are clean, spacious, and have decks (and a TV which Big Meadows didn't have). We were right near the ampitheater which has activities most nights - there were even some bear sightings down there. The restaurant at Skyland is also good and the boxed lunches are great if you are planning to be out hiking all day!", "title": "Great location, lodges are a bit dated for price", "helpfulness": 3, "user": "SummerLove11", "date": "November 17, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 21923363, "likes": {"liked": "— the beautiful views and fantastic location", "disliked": "— some of the rooms were dated and the prices were a bit high"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "We stayed at Skyland again, this time in a room with two double beds in the \"New Market\" building. This room was a fair distance from the office/dining area (walkable, but most folks would drive it). There was a television in the room, with the basic channels, a nice view, two chairs and a small end-table/nightstand. We would have liked a larger table for playing games, eating our \"brought-with\" meals, and the like. (I actually put the night table up on four soup cans to add to the height enough to serve the purpose.) There is also an ample dresser and large mirror.", "title": "It is the location that drives our stays here", "helpfulness": 3, "user": "shoshana_sue", "date": "November 12, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 5.0, "location": 5.0, "value": 4.0, "rooms": 3.0}, "id": 21797536, "likes": {"liked": "— The location and view", "disliked": "— The shower"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The outside weather was cold -- from the 20's to 40's, but the heaters in the room kept it plenty warm. The room was clean enough, though showing some signs of age. There is a small semi-private balcony in the back with a couple of chairs and small table for drinks, etc.", "title": "STARRY STARRY Night", "helpfulness": 3, "user": "CHARM2017", "date": "October 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21300262, "likes": {"liked": "— View of Stars at night", "disliked": "— Cannot make dinner reservations, first come first serve only"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "The room also had a small drip coffee maker and clock radio. Lighting was adequate -- a few table/stand lamps as well as an overhead fan light.", "title": "Rustic but comfortable", "helpfulness": 2, "user": "metalligirl", "date": "September 28, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 20456399, "likes": {"liked": "— The views!", "disliked": "— Old and a bit worn down."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "The bathroom was clean for the most part, but the heater in the wall had a lot of accumulated dust. The shower (as in all the rooms) used a water conserving head, which seemed to spray more air than water, and the shower temperature was hard to adjust -- but it can be done. The bathroom gets really warm if you leave the wall heater going with the door closed. The temperature is not adjustable -- the temperature dial is locked down on the wall heaters in both the bathroom and main room. We primarily used the bathroom heater (door open) to provide all the room's heat, with the baseboard heater in the room just serving as a \"backup\" (its temperature IS adjustable).", "title": "Great Views", "user": "Catherine-Dublin", "date": "September 26, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 20403832}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Over all, I was content enough with the room -- mostly because I had reserved it through a promotion that offered a free night and extra nights for $59 for a limited choice of rooms. It was definitely a step down from the pricier \"king\" room we had earlier.", "title": "A 2 Star place in a 5 Star location", "user": "WKA", "date": "August 30, 2008", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 3.0, "rooms": 1.0, "location": 5.0}, "id": 19550574, "likes": {"liked": "— The location and view", "disliked": "— Cleanliness issues and rundown furnishings"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Our skyline view room was excellent. Very cozy on a cold night with a beautiful view from our private porch. How peaceful is this spot on top of a mountain!! Very clean room & bath, friendly service everywhere, and some of the best food ever served in the dining room. Using local ingredients only enhanced the taste of everything we had. No cattle lines here!!!! Each dish cooked to perfection. We come here again.", "title": "Peaceful park lodge", "user": "WorldTravelers1218", "date": "October 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144090404}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "We stayed one night at the Skyland Resort to view the fall leaves. We would have stayed longer, but there was no availability due to our late booking. It's a fantastic place to stay. Everything was very close, even walking distance if it wasn't raining. We went to the stables several times to ride the ponies with my daughter and also to pet the horses. The dining area was great. Food was good and we had a very nice couple next to us who gave us some ideas for hikes. Our waitress was very accomodating with my daughters picky tastes. She also told us about a wonderful hike to see the falls. I can't wait to stay here again.", "title": "Wonderful experience", "user": "Helen754", "date": "October 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 144069678}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "It is a typical National Park Hotel: simple, honest and with the most beautiful surrounds in earth !! I was i the blue-ridge room which have a nice balcony and view. The best thing to do is hiking around the hotel enjoying the astonish views and the great Appalachian trail. I will go back as many as I can, particularly to see the fall foliage.", "title": "Excellent hotel in a Park", "user": "darwinsail", "date": "October 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 143943569}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "This is a so-so place. I was in room 2. As others stated. it is an old room. No TV normally isn't a problem, but the night I was there happened to be the final debate Obama vs Romney, so I wanted to catch it. The common area was fine except for the fireplace. My nose and eyes were bothered.", "title": "A decent place to sleep while visiting Shenandoah Forest", "user": "lauramly", "date": "October 28, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 143938518}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Other than that, the place was OK. The water in shower was not great, Very little water came out so it took forever to wash my hair and shower. The toilet was complete opposite. It seems like 20 gallons of water went into one flush.", "title": "Long Weekend Getaway!", "helpfulness": 1, "user": "jdwv", "date": "October 26, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 143769543}, {"rating": 2.0, "title": "Needs some attention", "text": "Food was of decent quality and price. However, we shelled out for two nights in the suites, believing the room would be of decent quality, but were disappointed. The location is stunning, and the view of the valley is breathtaking, but the room did not measure up - very dated. As a bonus, we did have a deer looking in our window .... which will take you off guard a bit.", "helpfulness": 1, "user": "elbojbb", "date": "July 25, 2009", "id": 35772629}, {"rating": 4.0, "title": "great location", "text": "The door to the veranda did not seal properly allowing insects and creeping varmits into the room rather easily. We did ask for a room change, but were deflected both times, and ended up using the flimsy towels to seal the door. Good help is either hard to find in the mountains, or they simply won't pay for it.", "user": "MariaDelaware", "date": "July 19, 2009", "id": 35160923}, {"rating": 2.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We spent our days hiking in the park and the location was very convenient. At night we could sit outside of our room and look at the mountains. The bed was comfortable.", "title": "Needs updating", "helpfulness": 1, "user": "HappyTrailsCanada", "date": "June 12, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 32208038}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The restaurant was good. However, we really enjoyed the dinner meals that were listed first as they were quite tasty. The meals listed under the traditional Shenandoah meal section had a lot of food but were not very tasty. The black berry desserts were quite good and we enjoyed the buckwheat pancakes for breakfast. We were pleased with the convenience and the restaurant.", "title": "Nice getaway for a night", "user": "kennethdsmom", "date": "May 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 30809617}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The location is beautiful as is the restaurant, but the cabin was not great. It was cold at night but we couldn't leave the heater on because there were no controls and it was so noisy; the smoke detector battery started beeping at 2 am and continued all night; the bed was small for two people and the bottom of the bedspread was stained as if from water damage. On the plus side we had a connecting cabin with our family, and the server in the restaurant was as nice as could be. Other staff, desk clerks, restaurant cashiers weren't the most friendly or knowledgeable. It took ages to check out.", "title": "Great place", "user": "blaqwynter", "date": "May 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 2.0}, "id": 29486455}, {"rating": 3.0, "title": "Great location but could and should be better", "text": "It is a superb location with fantastic views and wildlife (deer, chipmunk) to be seen on the site. It's best to remember that is what you went for. We found the motel style rooms depressing and dowdy. Furnishings follow a brown theme which doesn't help and the 70's style architecture of the \"motel\" blocks (there are about 6 spread round the site each with about 20 rooms) certainly doesn't blend with the countryside. That said, the room was clean and tidy.", "helpfulness": 1, "user": "Rover10", "date": "October 1, 2009", "id": 45577321}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "You aren't going to get gourmet food at this location but it is eatable.", "title": "We did not come to the woods for luxery!!!", "user": "Laine9", "date": "September 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 42545498}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Go for the scenery, the resort needs several $m spending to bring it up to standard.", "title": "Nice resort far away from everything", "helpfulness": 1, "user": "johnathome", "date": "August 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 39074616}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "If you want a 5 star resort with all frill and pomp, don't come here. This is an old resort, kept up in good condition, that is situated in one of the most beautiful parts of our country. Who cares if there is not a Wal-mart nearby!!!! I for one, am glad there is not.", "title": "Wonderful location - Disappointing lodgings", "user": "yorkshireus", "date": "August 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 37738797}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The nature, the scenery, the hiking are all wonderful. To walk on the Appalachian trail that runs right by the lodge is like a wak through history.", "title": "Long Way From Anything - And Food Is Expensive", "user": "missamilla", "date": "July 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 35865730}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "I stayed at the Skyland Resort while vacationing in Shenandoah National Park in early October. My room was clean and comfortable and with quite a view! The lodges at Skyland are spread out over a large area; my room happened to be located in a lodge near Skyland's office, restaurant, and gift shop, but those whose rooms are not can rest assured that there is ample parking available if you need to drive over to eat. Those who have never stayed in a national park need to know that these are not hotels with all the amenities; they are rustic, simple, and meant for sleeping and maybe a little relaxing on the patio/balcony. Skyland is heated, and provides a clock/radio (which is more than I've found elsewhere in the Parks) and the usual soap/shampoo/conditioner in eco-friendly wall dispensers. The beauty of Shenandoah, and the peace and quiet experienced here, very quickly brought rest to my body, mind, and soul.", "title": "Simply lovely", "user": "bobbie5", "date": "October 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143145771}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Skyland Resort on the Skyline Drive in Shenandoah National Park provides a beautiful and relaxing setting for enjoying the beauty of nature. The main building has a very good restaurant for breakfast, lunch & dinner as well as a bar/lounge with evening entertainment and a gift shop. Room are located in separate buildings adjacent to the main building and along the hillside below the main building -- most rooms have beautiful views of the valley below or of the close by wooded area. There is an abundance of walking/hiking trails for all levels of walkers/hikers as well as horseback riding.", "title": "Skyine Drive, Fall 2012", "user": "Alan S", "date": "October 17, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 143051316}, {"rating": 5.0, "title": "A wonderful get-away", "text": "I am surprised that everyone does not agree that this is a great place to be. The rooms are clean and what would be expected in a park where folks go for scenery and to enjoy the great outdoors. We loved the entertainment in the lodge, the food, the rangers, the hiking, the scenery. What was not to like? Even our toddler had a wonderful time. A great family weekend away!", "user": "Amy B", "date": "October 16, 2012", "id": 143000145}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "My husband and I have been coming to Skyland for many years and just returned from our latest trip. We always request one of two specific rooms and have been fortunate that we have always been able to get one of the two. Yes, the accommodations are rustic but honestly, we never spend a lot of time in the room and if we are there, we are usually sitting on our balcony. The rooms are comfortable but if you are one that likes luxury, this is not where you should stay. We enjoy the meals at the dining room...my husband had the turkey dinner (as always) and I had the trout this past time. I always have entree envy when I am there. This time it was for the roasted chicken breast....not the fried chicken platter (though that seemed quite popular). For dessert we had the blueberry cobbler...yum. Their house wine is from a Virginia vineyard and they serve other Va wines but surprisingly not a big selection of Va wines. We've never stayed up at the Tap Room for the entertainment. Wifi is only available in the main office building. That doesn't bother us because we aren't up there to be online. And in the fall, if we need to be online, it's nice to sit by the fire in the main room. The hiking is terrific ... Offering hikes for all abilities. Please be mindful of deer as you are driving. Speaking of deer, we are always treated to a visit or two by a deer family as we enjoy the views of Luray from our balcony. Skyland always provides a nice retreat for us from our busy day to day lives.", "title": "A nice place to recharge and get away from the city", "user": "Kim W", "date": "October 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 142999285}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "This was our third visit to Skyland lodge, staying in the Pinnacles \"traditional lodging.\" Our view was extraordinary and the room, like always, was clean, functional, and rustic. This is not a luxury hotel -- no TV or phone, but a comfortable bed with clean sheets. The furniture is worn, but sturdy -- it feels like a mountain retreat should feel -- cozy, comfortable and remote. Reminders are everywhere that you are in a nature area -- a recycling bin in our room, soap dispensers instead of plastic bottles of toiletries, reminders to save your towel and that sheets are not changed daily. Through hikers from the Appalachian trail share the lobby with the regular guests, as they stop to get a good meal and a shower. Special trash cans to keep out the wildlife are everywhere and signs to remind us to \"leave no trace on the trails.\" Anyone who is in this type of atmosphere should \"get\" that its not a spa or a fancy resort. We've stayed in many lodges run by Aramark, including the Grand Canyon, Zion, and Bryce Canyon National Parks out west. Shenandoah is typical of these lodges and measures up nicely to their standards. We love the restaurants at Shenandoah and make sure we have a hearty breakfast before hitting the trails. To save money we bring a cooler and pack lunches for the trail, but we eat at least one dinner in Skyland and one in Big Meadows while we're visiting. Bottom line, do not expect luxury in your accommodations, but instead come prepared to be awed by the natural splendor you will find instead.", "title": "Rustic beauty", "user": "Diane L", "date": "October 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142983580}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "If you want de luxe elegance, don't come here. But you wouldn't anyhow. This hotel is on Skyline Drive in the Shenandoah national park, and its the oldest hotel in the park, and it shows. The rooms are rustic, a bit dingy. But there was good heating, the bed was comfortable, however the bathroom was a bit mingy. No Internet access in the rooms, phone or TV, only in the lounge and restaurant. Very pleasant and helpful staff. Average food. Fantastic views, especially the sunsets. We saw deer nearby during breakfast. The trees are of course wonderful, glowing colours in the fall, it's a very special place. Summary, if you want more luxury you would do just as well to stay outside the park, it costs $15 to drive in but the pass lasts for a week. If you like back to nature, stay at Skyland, or maybe Big meadows , the next hotel along which looks a bit smarter.", "title": "back to nature", "user": "Daisy100London", "date": "October 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 2.0, "location": 5.0}, "id": 143650556}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "My husband and I stayed here overnight the end of September. We wanted a nice fall getaway and decided to drive through the entire skyland drive. We stayed here at Skyland for one night. It was very nice. Had a great view. Our room was on the 2nd floor. Now it's a mountain cabin type room - nothing fancy. The room was dated but clean. It has a small tv which got enough channels to watch tv while we fell asleep. We ate dinner at the lodge - the food was really good and the view was incredible. I would definately suggest staying here.", "title": "Great rustic weekend getaway!", "user": "Joy R", "date": "October 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 143632841}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "A week's visit to the Blue Ridge to enjoy some hiking and the autumn leaves with my daughter --- wonderful weather, wonderful company, and the usual great hotel and dining experiences at Skyland Resort. Originally built in the 1930's by the CCC, Skyland has been a part of my family's traveling traditions since the 1950's --- we're currently working on the fourth generation of family members who enjoy visits to the mountains, at all times of the year.", "title": "Still The Best In The Blue Ridge", "helpfulness": 1, "user": "RickSchlegel", "date": "October 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143613623}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "During this visit we were surprised to learn that ARAMARK, who has managed Skyland for the NPS for almost 50 years, is being replaced by another management company at the end of this season. ARAMARK has done a wonderful job with the facility over all those years, and we're hopeful that the new company --- who apparently already manages NPS properties at Yosemite, among other places, will maintain our favorite Blue Ridge lodge at the same high standards we've enjoyed for so long. We'd hate to lose it at this point --- we still have four more grand kids to train on the trails!", "title": "Our YearlyTrip to Skyland", "helpfulness": 1, "user": "Sandra D", "date": "October 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 143573155}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "For the past 12 years my husband and I have been making the trip to Skyland for a weekend visit to mainly enjoy the beauty of the mountains. A bonus to our trip is that we have never been disappointed in the accomondations at Skyland. The lodge is warm and enviting,the food delectable and the views are awesome!! Photos really can't capture the beauty that you take home as memories.", "title": "Spur of the moment surprise.", "user": "jerseymariner", "date": "October 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 143495419}], "location": {"country": "United States"}, "stars": 2, "variance": {"poor": 37, "average": 92, "very good": 272, "terrible": 20, "excellent": 257}, "aka": "Skyland Hotel", "slim_ranking": 1.0, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 5.0}}