{"user_rating": 5.0, "review_count": 88, "name": "Sleepy Time Motel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "I reserved a room for my husband after reading the reviews here. He was very pleased with the entire experience. We will definitely stay here when we travel to Maine as a family. My husband reported the staff (owners) was very pleasant, the room was spotless and nicely decorated. He has only positive comments about his stay.", "title": "GREAT PLACE TO STAY!", "user": "ma4", "date": "September 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39580518}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Great little spot. Close to Turnpike, close to the Irvin 24 hour stop and shop, close to nature. Mark and Lynn are just down-to-earth folks and nice as can be. They run a very clean and quiet environment. The land behind the hotel has beautiful gardens and Mark and Lynn have mapped out hiking trails. It was quite a rainy week while we were up there and didn't have good shoes for hiking but will next time.", "title": "Our new place when visiting Auburn", "user": "Hpychk", "date": "August 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 38377091}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "You cannot beat the price, location, and hospitality. Comfy rockers in the rooms, fridge big enough to hold the supplies you need. They provide utensils, wine glasses, coffee pot, microwave, and some condiments.", "title": "A Hidden Treasure", "user": "MRMPlus3", "date": "July 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36095527}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "You won't go wrong by staying here.", "title": "Best Kept Secret", "helpfulness": 1, "user": "BobcatParent", "date": "October 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20703585}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled solo", "text": "I saw the trip advisor reviews then looked at the web site and talked with the owners and booked the dates. My wife was nervous when I told her (She’s from Brooklyn), but I just felt that it was going to be good stay and went with that.", "title": "You can't go wrong", "helpfulness": 1, "user": "jgretz", "date": "August 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18815074, "likes": {"liked": "— everything sparkled", "disliked": "— n/a"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Room was neat, clean and comfortable and I would stay there again. Property is well manicured and decorated according to the season. Owner was very nice and showed me my room and offered to put AC on early in the evening as we had an engagement and checked in early (1PM).", "title": "neat & clean", "user": "spraypaint94", "date": "July 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 71803782}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "If you're looking for accommodations in the Lewiston / Auburn area, but away from the usual run-of-the-mill Econo Lodge / Motel 8 atmosphere this is the place for you. Situated just outside Auburn city proper and just off exit 75, you're not more than 10 minutes from any place in town. My wife and I found our room exceptionally clean and well cared for. The proprietors Lynn and Mark Klinger stopped at nothing to make our stay a pleasant experience. If you enjoy exploring out of the way nature trails with occasional glimpses of beaver and moose then consider giving Sleepy Time a try. Though we only had time to experience one of the trails on their nearly 100 acres. Mark has carved out several that should keep you coming back for more.", "title": "Best kept secret in Central Maine", "user": "lifespan1", "date": "June 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66665130}, {"rating": 4.0, "stay_parameters": "Stayed May 2010", "text": "My husband and I, accompanied by an adult daughter, spent three nights at the Sleepy Time in mid-May while visiting relatives in Lewiston. Both of our rooms were charming, comfortable, and had beautiful views of rolling lawn and nearby woods with walking trails. The facility was immaculate. Our hosts were gracious and went out of their way to be helpful. We loved getting to know them, and have recommended this jewel of a motel to other travelers to the Lewiston-Auburn area.", "title": "Immaculate and cozy!", "user": "mklc", "date": "June 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66367063}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "My husband and I agreed we have never stayed in a place as clean as the Sleepy Time Motel in Auburn, ME. We stayed two nights with our teenage son. We were there for the Pineland Farms Trail Running Festival in New Gloucester which was about a 13 minute drive. The room had cable tv, free wifi, a table with chairs, Lazy-Boy recliner, small refrigerator, microwave (with paper plates, napkins & plastic utensils available), user-controlled AC, and a hairdryer. The bathroom had a full size tub & shower and all the surfaces shined, they were so clean. The room was quiet at night, even though we were minutes to the highway. Great value - we'd definitely stay again!", "title": "Squeaky clean & comfortable", "user": "jensparks05", "date": "June 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66029730}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "Clean, comfortable and inexpensive ($87 w/ tax). This is a small motel (6 rooms), run by a very nice couple (Lynn and Mark). Couldn't have asked for more though. Even has free wireless. Not the Ritz ... just a very well-kept little motel. It deserves the many other positive reviews it's received.", "title": "Recommended", "user": "schulzwh", "date": "October 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46794351}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "Stayed here one night with a friend while visiting family in nearby Lewiston. Owners live on the property and treat it like an Inn. Mark checked us in and walked us to the room and showed us where everything was. Small fridge, microwave and kitchen table with 2 chairs. A recliner was in the room as well. Very clean* and you can tell the owners take pride in their investment. Close to Maine Turnpike and you can hear the highway in the distance if you open the windows, but it isn't terribly loud. This motel is on the edge of a quiet residential neighborhood. There is a spacious yard and walking trails behind the motel. Free wired AND wireless internet was a pleasant surprise.", "title": "Quaint, comfortable and great location", "user": "mellifera75", "date": "October 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82074621}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "*When we returned to the motel from the family's house for the night it was rather late (1:00AM) and we found one of the beds had a huge coffee stain on the sheets. The office was closed and we felt weird calling the number at 1:00 in the morning so we just dealt with it. When mentioning it to both Mark and Lynn in the morning, all we got was an \"I'm sorry, there was a woman in here for 4 days and she slept in the other bed, we didn't check this bed\". For this reason alone, I'm taking off a \"half\" star. I'm sure that had we gotten in touch with them when we discovered it, they'd have changed the sheets but, I think that some sort of \"compensation\" should have been offered as an act of good faith.", "title": "Wished we knew about this last year!", "user": "PNC_24_26", "date": "August 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76854071}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Having said all that, I still WOULD recommend this motel to others who are looking for a place to stay in the area for a few days.", "title": "Cant ask for better :-)", "user": "kiakia007", "date": "August 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75685837}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "In 2009 my husband and I went to the L/A Great Falls Balloon Festival for the very first time and booked a place to stay through an online service, when we got there we were extremely disappointed with the room and checked out 10 minutes after checking in. We did find another place to stay which was just ok, it was someplace to sleep!", "title": "Great Place", "user": "hcs206", "date": "July 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 72982452}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "In 2010 we were planning on attending the festival again but weI did some online research and found the Sleepy Time Motel through Trip Advisor and was amazed at the reviews and ratings, their ratings were better than one on the top Hotels in the area!", "title": "very nice owners", "user": "feelinggroovy", "date": "July 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 72616599}, {"rating": 5.0, "stay_parameters": "Stayed July 2008", "text": "This is a tiny (six rooms) 1950's style roadside motel. We picked it because of the other good reviews and were not disappointed. While the place has a serious retro appearance, everything is well maintained, clean, and comfortable. The owners are also very personable. You can't go wrong here if you are looking for a decent place to stay. The owner recommended dinner at the Fishbone restaurant on Lincoln Street in downtown Lewiston. The Fishbone is fantastic! Of particular note is the clam chowder -- by far the best that my wife and I have ever had. Costs about $30 per person without drinks. The service was also excellent.", "title": "Good Deal", "helpfulness": 1, "user": "JCW99", "date": "July 24, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 18211150}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "What a find, We stayed here when we did parents' weekend at Bates College, and again during graduation. The place is great. It's only 6 miles from campus and easy to get to. The setting is nice. The motel is surrounded by beautiful green fields. It has a nostalgic feel to it, like you are back in a slower nicer time. The rooms are nice. The beds very comfortable. Best of all, the place is immaculate. You won't find a cleaner motel. I took a shower upon our arrival and then left the motel. When I got back at 10 p.m. the bathroom had been thoroughly cleaned, and new towels set out. The owners are terrific. Mark and Lynn know the area and are very helpful with restaurant tips and directions. Mark lent me his Maine Atlas when we headed for Popham Beach. He makes sure everyone has a paper delivered to their door so it's there when you wake up. I recommended the motel to my 80 year old parents and they were duly impressed. I only wish I knew about this place when my son was a freshman. It's the place to stay when visiting Bates.", "title": "place to stay when visiting Bates College", "helpfulness": 2, "user": "Solongirl", "date": "May 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 16500954, "likes": {"liked": "— Clean as a whistle", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007", "text": "Sleepy Time Motel--", "title": "Loved this place", "user": "joaemmo", "date": "November 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10667879, "likes": {"liked": "— Cleanliness and convenience. Friendly hosts.", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "My husband and I just came back from Maine and we stayed on Saturday nite and Sunday nite. We both just loved our room. It was neat and clean. Our hosts, Lynn and Mark were very nice to us and welcomed us like we were family. Every time we go to Auburn we will stay there. It was a wonderful experience.", "title": "It deserves it's AAA Star", "helpfulness": 1, "user": "bob&ceil", "date": "November 14, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6131641, "likes": {"liked": "— Clean and quiet", "disliked": "— Nothing"}}], "location": {"country": "United States", "city": "Auburn"}, "variance": {"poor": 0, "average": 1, "very good": 13, "terrible": 0, "excellent": 74}, "aka": "Sleepy Time Hotel Auburn", "slim_ranking": 0.2, "description": "Family operated cozy New England motel of six rooms located within minutes of the Maine Turnpike. Sleepy Time offers a neighborhood location on acres of green lawns backed by 100 acres of woods laced with hiking trails. Nearby is golf at Fox Ridge, swimming at Range Pond State Park and cross country skiing at Pineland. Clean,large comfortable rooms,affordable rates and friendly hospitality are what you'll find. Downtown L/A is minutes away."}