{"user_rating": 3.5, "review_count": 36, "name": "Sleep Inn & Suites", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "I wrote a nice review of this hotel four years ago, not long after it opened. I hadn't stayed here in the interim, but returning now, I'm amazed and shocked at how much it's gone down hill. The low quality of the furnishings and finishings are beginning to show: our room needs to be freshened. Cleanliness is OK but nothing stellar. And there's lots of little things: doors that don't open easily, an elevator that takes forever, etc. Four years ago, this Sleep Inn was a shining example of what a budget hotel could be; now, it's a sad example of what lack of attention will do in a short time.", "title": "Slip Sliding Away", "helpfulness": 2, "user": "Twoprofs", "date": "June 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 131795256}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "For a Sleep Inn, this one is very good. The front desk personnel are helpful and friendly, the rooms are very clean and comfortable, and the location is central, and generally good.", "title": "Definitely an above average Sleep Inn", "user": "capjessop", "date": "April 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 128359368}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "I find it a bit pricey for a Sleep Inn, but this hotel competes with higher star hotels, and it executes on it well. If you have business in the area, this hotel is within many good restaurants and bars on Western, and a short drive from more north in Nickels Hills. Its also near the Penn Square Mall. I would, and probably will stay there again.", "title": "Decent place, nice staff", "user": "Suvihuvi", "date": "March 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 126825947}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "This hotel was clean and the lobby, breakfast area, hallways and the room were all in order. The hot tub was not very hot, and the pool was very small, but everything seemed well maintained. Hotel front desk clerk lady was exceptionally friendly and helpful. I did not hear any noise from the freeway nearby. Overall a good experience and I would stay here again.", "title": "Great Value", "user": "pearl800", "date": "February 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125050267}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "We had to make a sudden trip to attend a funeral and didn't have a chance to do much more than find a quick motel where we happened to end up. I picked up a Travel Buddy that had a coupon for this hotel and was so pleasantly surprised to get it for price that I would have expected to be higher for the quality of room and wonderful hot buffet breakfast. Just wished I had brought my swimming suit because their pool looked so inviting and would have been a great way to relax.", "title": "Mostly really good", "user": "Jane G", "date": "December 6, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 121474216}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "The hotel is new, we were told. The indoor pool was the size of a back yard pool. The room containing the pool and spa was small and uninviting. The clerk who checked us in appeared to be new or at least in need of more training. The hotel touts 24-hour complementary coffee, which could only be had by brewing tea-bag-type packets in our room. The bed and linens were quite comfortable and the depth of the room helped maintain quiet. The floors are apparently wooden, so third-floor room would be best. The television is the focal point of the breakfast room. We wondered about the rigorousness of inspection since the breakfast room doors open in. This is both inconvenient if you are carrying anything and unsafe in the event of an emergency.", "title": "No-smoking Policy is Commendable", "user": "Elderly_Andy", "date": "May 12, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 63961054}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "We got a really good rate for this Sleep Inn. The room was large, and the bed was comfortable. It was quiet, at least until the morning when I heard some traffic outside from Rt. 44. We left the fan on low all night and that helped us sleep better.", "title": "What you'd expect for the money", "helpfulness": 1, "user": "ilive4sun", "date": "April 21, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 62040569}, {"rating": 5.0, "title": "Great place to stay for biz or pleasure", "text": "The shower was in good working order, and the towels were in good condition. They provided shampoo, conditioner and lotion. Breakfast was typical fare....danish, bananas and apples, hard-boiled eggs, a wafflemaker, toast and bagels, cereal, and I think sausage gravy and biscuits (which I don't eat) - along with coffee and tea. There may have been juice too...I don't remember. We've been on the road a while and all these places are starting to look alike!", "user": "digger-ace", "date": "March 13, 2010", "id": 58437127}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The night clerk led us on a wild goose chase to find dinner, and didn't know that each floor had its own ice machine, which surprised me! She was friendly enough, but constantly on the phone.", "title": "Above expectations", "helpfulness": 1, "user": "pronto2me", "date": "December 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 52190422}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "There is a mall a couple miles down the road with a Cheesecake Factory. The location is close to I-44, but not in walking distance to typical tourist type restaurants. They provide USA Today at the front lobby. We didn't use the wi-fi.", "title": "Great place to stay!", "user": "iowadux", "date": "July 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35985259}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "I stayed at the Sleep Inn and Suites for one night for a business trip. I came into OKC pretty late and I printed out directions on mapquest to get to the hotel. The directions were fine; however, there was construction being done on the main street that leads to the hotel, so I had to get back on the highway and turn around at the next exit and then figure out how to get off the highway and maneuver through side streets to get to the hotel. Also note, that the hotel does not appear to be in the best of neighborhoods.To say the least, I was not in a good mood, when I got to the hotel. The front desk service was fine, and I was expecting a lower type hotel interior. Not so. They have definetly updated the interior of the hotel, including the corridors and especially the rooms. The bathrooms had nice new granite countertops and finishes. The rooms were nicely appointed and clean. The high speed internet was wireless and extremely fast. Breakfast is complimentary and continental, but was a full continental breakfast that filled me up for most of the day. For the value, this was one of the best hotels I have stayed at for business in a long time.", "title": "Great Hotel for the value, just a little difficult to find", "user": "spoons99", "date": "March 18, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 2.0, "service": 4.0, "rooms": 4.0}, "id": 26418014}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Helpful Hint: If you are booking a stay at this hotel ask if there is still construction, and if there is, ask for directions so you don't waste your time finding the hotel. It is worth the stay.", "title": "Cheap construction", "user": "dil345", "date": "November 28, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "location": 3.0}, "id": 22262781, "likes": {"liked": "— was able to use points and not pay", "disliked": "— poor construction quality"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled solo", "text": "We stayed one night at this hotel using points. It's fairly new but of poor construction. There were people above us and every step sounded like an elephant's it was so loud. The walls are very thin and you could clearly hear voices from the room next door, and light from there came under the door. The hallway on the third floor slopes and is not level. The food at breakfast was adequate but the room has only about 4 tables. I'm glad I didn't pay for this stay.", "title": "Great Hotel", "user": "ohwait11", "date": "September 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 2.0}, "id": 20031640, "likes": {"liked": "— Room, cleanliness", "disliked": "— Cost, location"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The area around the property doesn't feel like the best area, but the hotel itself is new-looking, clean and modern. The woman at the front desk was efficient. On the higher floors you need a cable to connect to the internet, so ask before you head up to your room. I didn't eat breakfast or use the gym/pool/etc, so this review is solely about the room and the service, both of which were fine. Little expensive, but what can you do.", "title": "Great hotel", "user": "FinickyNewYorker", "date": "August 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0}, "id": 19281484, "likes": {"liked": "— Large, clean, pretty room", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "I HIGHLY recommend going to the dive-looking restaurant Classen's right next to the hotel. The food is ridiculously good.", "title": "New, clean, and nice!", "helpfulness": 2, "user": "kyla8199", "date": "February 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 13606313}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "The desk clerk was incredibly helpful! Everything was great, breakfast was decent but better than most places. It was somewhat easy to get to and it is in a great location, real close to everything and right off the freeway. Highly recommend this place, will visit next time!", "title": "Very nice!", "user": "Paul J", "date": "October 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 119238635}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Never had I fully understood the meaning PAPER THIN walls until I stayed at this hotel. It is VERY clean, nicely decorated, and comfortable...HOWEVER everything was overshadowed by the poor construction. I have two small children and when making my reservation requested a crib be in our room...after checking in and as I'm carrying my bags, my children's, bags, pushing a stroller, and containing a 3 yr old through the lobby, the clerk plops the portable crib on the front desk and says \"Here's the crib you requested.\" Needless to say that didn't impress me. I had to go back down for a sheet for the crib. We enjoyed the nice pool that evening and returned to our room around 9pm...as we settled in for the night my enjoyed the squeaking mattress and squeals of delight coming from next door...a young child was jumping on the bed...that last around an hour before we fell asleep. At 1am the child was SCREAMING for a blanket...I finally pounded on the wall and the parents got up and quieted the child. At 2 am a smoke alarm was pulled...the front desk attendant wasn't sure what to tell people and the next morning another guest told us it was pulled by two young girls not even staying at the hotel...apparently the doors don't have card swipers to access the hotel after hours...I see this as a huge security risk and probably wouldn't of stayed there knowing that. After everything quieted from the alarm our neighbors on the other side of us returned...they proceeded to smoke and hosts guests...first of all the hotel is non-smoking, the room adjoined ours and the door had a gap around an inch wide, directly where my 10 mth old sleep. The walls were so thin we could hear them word for word. I finally called the front desk around 3:30 (thinking they'd go to bed eventually). The clerk knocked on the door and informed them they'd be charged for the smoking...they denied it and the clerk left asking them to quiet down. At that point the guy got angry and went downstairs telling his friends he'd be back...when he got back he proceeded to throw something against our wall...they talked (although quieter) until 4:30-5am. We had to get up at 7am to get back on the road. The next day checking out I complained to the front desk and the only thing I got from the front desk was an \"I KNOW...I'm trying to get them to invest in sound proofing.\" and some sympathy. It further annoyed me that it seemed to be a common complaint from guests and the management/owner was still not doing anything yet charging people the same room rate. I will never stay there again and have told anyone going through not to bother either. I wish someone had warned me before I paid for a room.", "title": "Learned the meaning of PAPER thin walls...", "user": "Ashley C", "date": "August 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 1.0, "value": 1.0, "service": 3.0}, "id": 116763972}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I travel from Tulsa and sometimes need to stay over. I chose this particular location because it is very convenient to downtown OKC without the huge cost of staying downtown. The rooms are new and updated. They are CLEAN and comfortable. The breakfast in the morning is quick and perfect and offers a nice variety. This is not a luxury hotel, BUT it is very clean and the staff is wonderful! I read some of the negative reviews and laughed. It is NOT the hotel's fault if noisy and rude people stay there. You are not going to get a huge breakfast buffet. I think people live in a dream world sometimes. I LOVE this hotel and it's my first choice any time I need to travel to OKC. Love it!!!!", "title": "The ONLY place I stay in OKC!", "helpfulness": 1, "user": "TGG24", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116283785}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "I stayed here one weekend while me and my friends came to watch an Oklahoma City Thunder game. This hotel is great! Its very new and modern and the rooms are amazingly nice. The front desk was more than happy to help us with calling us a cab and extending are stay. I really like the hot breakfast and the various types of coffee creamers available!!! I have since stayed here every time I come to watch a Thunder game. The ford center is minutes away which is really convenient..", "title": "WOW what an AWESOME hotel!", "user": "sportsfan405", "date": "March 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98722968}, {"rating": 2.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "I definitely recommend this hotel to anyone visiting OKC. Great hotel and affordable rates", "title": "I think the name of the hotel is deceiving....", "user": "SleeplessInOKC", "date": "January 26, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 94479751}], "location": {"country": "United States", "city": "Oklahoma City"}, "stars": 2, "variance": {"poor": 6, "average": 6, "very good": 12, "terrible": 1, "excellent": 11}, "aka": "Sleep Inn Oklahoma City", "slim_ranking": 0.492647058824, "description": "Newly constructed spring of 2007 - 100 percent non-smoking hotel. The hotel offers a deluxe continental breakfast. Free local calls, cable television with HBO, free high-speed Internet access, coffee makers, microwaves, and refrigerators in guest rooms. There is a business center in the lobby area. The hotel also offers indoor heated pool, hot tub, fitness center, elevator, and guest laundry."}