{"user_rating": 4.5, "review_count": 49, "name": "Sleepy Hill Motor Inn", "reviews": [{"rating": 5.0, "title": "Good overnight stop over", "text": "We stayed at Raymond Terrace so as to be close for a very early departure from Newcastle Airport, only 15 minutes drive away. The hosts (who job share, 4 weeks on, 4 weeks off) were very accommodating, giving us breakfast to take to our room, because we were leaving too early for breakfast in the breakfast room. The motel room was modern and clean, and met all expectations, nice shower, lots of hot water. We would have eaten dinner there but the Chef has left, so there are no dinners at present, we had read good reviews, but will have to try again next time. Very good overnight stay only 3 minutes drive from the shopping centre. We will stay again if flying out early in the morning.", "helpfulness": 1, "user": "andrew55b", "date": "July 23, 2013", "id": 168694749}, {"rating": 5.0, "title": "Excellent Motel", "text": "We have stayed here 3 times and always find the rooms quiet and immaculate. Good beds, pillows and big TV and everything else you could ask for.", "helpfulness": 1, "user": "geebob1", "date": "July 19, 2013", "id": 168231392}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "All the little things are done very well at Sleepy Hill.", "title": "Quite, clean and warm...exactly what we were after", "helpfulness": 1, "user": "GF_n_DF", "date": "July 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 166351743}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "The breakfast is continental with a large cereals selection and good breads, good quality jams and tea/coffee choices. No cheeses or meats but I don't look for that anyway.", "title": "Great overnighter", "helpfulness": 2, "user": "TonyfromNewtown", "date": "June 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163055804}, {"rating": 5.0, "title": "Great stopover motel", "text": "The hosts are always friendly and the value for money is about as good as you get.", "helpfulness": 2, "user": "SueKnee", "date": "May 11, 2013", "id": 160348796}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Started new job and didn't have a house initially booked for 3 nights on site managers had no issues extending stay multiple times at times last minute and with no end date. Room quite modern very clean for any hotel but this is an older style motel and had a wow factor because it was so nice and excellent value. Big comfortable bed,good bathroom, Huge TV. Microwave and minimal kitchen equipment more for overnights or eating out. Rooms numbers 30 up well away from road and noise. Heating very good for what were very cold nights Breakfast basic but good.on site management lovely couple very friendly and helpful. Stay again? Absolutely", "title": "Business stay", "helpfulness": 15, "user": "deservepampering", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 175406186}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Not sure what has happened since the last review... we stayed there based on that.", "title": "MEAN SPIRITED AND UN-HOSPITABLE", "user": "Brindle2000", "date": "August 31, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 174926045}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "Wish we had not! Unwelcome reception. The man gave us a half glass of milk for a cuppa?? When I asked for more he was obviously put out. Got a Spa room at 190 AUD and asked for more towels than the two small ones in the room - he asked me why I needed them??", "title": "AWESOME!!!", "helpfulness": 7, "user": "hankfrost", "date": "August 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171800717}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "No Spa products in the Room - miserable really. No decent glasses in the room, no KFS in case you got a take-away. No ice available! He was arrogant when I asked for ice - No! we don't do ice he said.", "title": "Best Motel Ever!", "helpfulness": 6, "user": "TianaShaz", "date": "August 5, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 170942684}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "In essence, I would not recommend this place. There must be better out there on the road to/from wherever. These people should not be in the Motel business as he made us feel so uncomfortable and sadly, we were stuck as we had booked a few days in advance with CC details.", "title": "Great Stopover -Highly recommended", "helpfulness": 2, "user": "Sharon S", "date": "July 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170079805}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "WOW the first thing I noticed when I entered our room was the TV. It was huge. To me the three most important features of a motel room are the TV (this one earned bonus points) the bed and bedding (supurb comfortable clean lots more points) and the shower. Had a bit of a breakdown here. This was one of those touchy showers where if anyone uses another tap the temperature can spike hot or cold. That lost some points. Bonus points were earned by the staff though. They were very friendly just like they were inviting you into their own house Our room was at the back of the building. Quiet and plenty of parking. All in all I liked the place.", "title": "Very good value for money", "helpfulness": 1, "user": "sirjeff9726", "date": "April 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159092471}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "This is a great motel just off the highway so the room are quiet.We had a family room and it was large and clean and nice comfy beds.All rooms come we a lovely breakfast in there breakfast room.I would stay here again.", "title": "Great Quiet place to Stay", "helpfulness": 2, "user": "Trish T", "date": "April 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 157257525}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Desperate to find accommodation and disappointed not to find anything at port Stephens we were grateful for this clean and pleasant motel. The owners were super friendly and the breakfast was awesome.", "title": "Happy days...", "helpfulness": 1, "user": "thepomsinoz", "date": "April 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 156537717}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Great motel off main road, Large bathroom and comfortable beds ,very quiet and close to clubs and Maccas and all traveling services for car travel. About two hours travel north of Sydney and about four hours from port Macquarie.", "title": "Great old style motel", "user": "Aussietraveller11", "date": "March 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 155097420}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We stopped here on our way north for Christmas & it was a comfortable quiet place to stop. The breakfast next morning was very good, and facilities looked well maintained, although we couldn't find the way in to the pool, as it seems to go through reception and the breakfast room, which meant that we didn't use the pool first thing in the morning before we headed off like we wanted to. We had a room with three single beds, and another room off with a double, plus a kitchenette, which worked well for our family of 5. I would stay here again - the staff were also very friendly.", "title": "Comfortable quiet place to stop", "helpfulness": 1, "user": "disabled_jetsetter", "date": "January 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 148935662}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Stayed overnight while returning home. Outside of motel looks a bit dated but the room was fresh & clean. Queen bed with good linen & pillows. Front door to carpark & a rear sliding & screen doors to small sitting area at rear. Microwave, fridge, toaster, tv & jug. Small table & 2 chairs. Exhaust fan in bathroom was noisy. Price included breakfast, toast, juice, cereals, tea & coffee. Restaurant was closed but plenty of good eat places short drive away. Hosts made us feel welcome and check in was quick. Will stay again if in the area.", "title": "Fresh & Clean", "helpfulness": 21, "user": "wiskey", "date": "November 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 183840092}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "We stayed at this Motel on our way from Canberra to Coffs Harbour. A pleasant surprise, comfy bed and linen. Breakfast included. Very helpful staff. Well priced. Will definitely recommend to fellow travellers", "title": "Stopover", "helpfulness": 21, "user": "Mauzie_13", "date": "October 31, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 183106250}, {"rating": 4.0, "title": "Everything I Needed", "text": "This hotel has obviously been refurbished. While the outside is still a little dates, inside the room was great, modernish and very clean and comfortable. Hot, strong shower. Excellent bed and linen. The breakfast was more than adequate. Definitely would stay here again.", "helpfulness": 19, "user": "TravellingAussieMuso", "date": "October 26, 2013", "id": 182495172}, {"rating": 4.0, "stay_parameters": "Stayed September 2013", "text": "We stayed overnight on the way to Brisbane from Sydney. We booked last minute and Michelle was more than helpful while booking - even offered a choice of rooms to best accommodate us. When asked for best locations to take the family for dinner, they suggested a number of places locally, recommended child friendly places, and provided directions for us - very helpful.", "title": "Great place and friendly staff", "helpfulness": 22, "user": "Steiky", "date": "September 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 178994091}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "The room was clean and well kept and my two boys loved the novelty of having a room and tv to themselves", "title": "Great hotel", "helpfulness": 20, "user": "Kool68", "date": "September 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 178067012}], "location": {"country": "Australia", "continent": "South Pacific"}, "variance": {"poor": 1, "average": 2, "very good": 20, "terrible": 0, "excellent": 26}, "slim_ranking": 0.333333333333, "description": "After several years of changing owners and managers this property has been brought back to life by the present owners. The property has recently been refurbished, incorporating a fresh new and up to date feel whilst maintaining the charm and elegance of an era gone-by. We have rooms ranging from single (queen bed), double (queen bed), Twin share, generous one or two bedroom family rooms, as well as King bed spa units.All guests receive a healthy, yummy, generous, complimentary breakfast each morning in our breakfast room beside the beautiful pool as our way to say thank you for choosing to stay with us at The Sleepy Hill Motor Inn"}