{"user_rating": 4.0, "review_count": 356, "name": "Sleep Inn Moab", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "This was a decent place to stay, average, I would guess, for a Sleep Inn. Fairly quiet & bedding was clean & comfortable. The huge problem was the breakfast area, which was a tiny little space off the main lobby. No hot waffles but a selection of donuts, bagels, bread, etc, juice & coffee. There were maybe 4 or 5 tables to eat at, which were always full. Twice during our stay there was a long line to go through the breakfast area. They have a sign that says additional seating upstairs & outside, but even that was full & by the time you got there, your food was cold. Pretty disappointing.", "title": "decent hotel, but breakfast needs an overhaul!", "user": "rogueit", "date": "October 18, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 83965775}, {"rating": 4.0, "stay_parameters": "Stayed October 2010", "text": "This hotel also wasn't really close to stores or restaurants, aside from a strip mall, & we had to drive each time we wanted to shop or eat in Moab. We stayed here to do some hiking in Arches & Canyonlands, & next time would probably stay at the Holiday Inn Express - it is the closest to the parks (but still not anywhere near restaurants or stores).", "title": "Nice", "user": "gumpha1", "date": "October 11, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 82994254}, {"rating": 4.0, "title": "An excellent value hotel with good rooms and staff", "text": "We stayed here for two nights while traveling through to Arizonia and Colorado and was very pleased with the hotel. The only issue is the seating for breakfast was limited and their choice for muffins and doughnuts were not the best but had other items which were good. That is theie only draw back, very nice stay and would stay again.", "user": "Abbotsham", "date": "October 5, 2010", "id": 82167317}, {"rating": 4.0, "stay_parameters": "Stayed September 2010", "text": "An excellent value hotel with very helpful staff. It's only shortcoming is the small breakfast area but as we were up early it did not affect us. Between 8 and 9 it must be pretty chaotic.", "title": "Not fancy but clean & comfortable", "user": "bcbyself", "date": "October 1, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 81779684}, {"rating": 4.0, "title": "Would stay here again", "text": "The title says it all.", "user": "Tuttle_NC", "date": "September 30, 2010", "id": 81629890}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "This is a super hotel for the money. Very well located to eat out in Moab in the evening. And great to have the pool to cool down in after a day hiking around Arches (only a few miles from the park entrance). It does get a bit chilly once the sun has gone down though! For a budget hotel, the room was spacious with 2 large double beds & the bathroom while small was very well equipped & modern. Everything seemed new & spotlessly clean with a good TV & fridge. The beds were comfortable, the breakfast was good & the staff were friendly & efficient. Very speedy to check in & out. Plenty of free car parking. I would recommend this hotel. It's just the place to get a great night's sleep while exploring this area.", "title": "Great value & location", "helpfulness": 2, "user": "hazelha", "date": "June 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113889707}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We stayed here for two nights while exploring Moab-UT ( Arches & Canyonlands ). The rooms are exceedingly well designed; the room is clean, well stocked and scent free. The staff is polite, attentive and truly concerned about your stay and overall experience. There is a heated outdoor pool, an indoor jacuzzi, laundry room and continental breakfast ( no hot food ).", "title": "Surprisingly,... One of the better selections in the Choice Hotels International chain.", "helpfulness": 1, "user": "XOEM", "date": "June 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 113573914}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "French toast, 4 juices, coffee, cereal, fresth fruit, cereal, and boiled eggs were part of the breakfast. Very well attended to by staff also. Artistically painted hot tub room! Nice place to stay.", "title": "Great Breakfast", "user": "jericg", "date": "June 14, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 113549188}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "I stayed at the Sleep Inn for three nights to explore Arches and Canyonlands parks. Upon checkin, I was pleased to find my room ready and also near the entrance, since I would be coming and going a lot to my car to explore the parks. The hotel is located south of the \"main street\" area, which is a good thing. I ate on mainstreet for my last night, and it was disappointing. Having the hotel a slight distance away from the hustle bustle means a quiter sleep!", "title": "A little out of town is a good thing!", "user": "GordonThree", "date": "June 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 112494346}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "My bed was a comfy queen with soft linens and feather pillows. The room had been recently renovated, with nice clean carpet and a modern bathroom. The AC worked decently well and was quiet. The contential breakfast was very good, with a generous assortment of fresh cut fruit not a bowl of bland apples and green banannas.", "title": "A mixed bag", "helpfulness": 1, "user": "pablored", "date": "June 9, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 112440103}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "This is a very very clean and quite hotel. Breakfast is served and the hotel has interior corridors. Breakfast is okay but not special. This stop was a very positive experience for us as a two night stay to visit between National Parks. We do not use WiFi or swimming pools, so I don't know about them. Moab is a tourist town in the middle of a really scenic area. We really liked Dead Horse Point state park, which is near Canyonlands National Park.", "title": "clean comfortable hotel", "helpfulness": 1, "user": "valleyboy38548", "date": "June 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 112107104}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "This place seemed so nice and new especially for an economy hotel! It was more upscale than I anticipated. The room was very clean and attractive and comfortable and quiet! The lady that checked us in was aloof, and the free breakfast was good but would've been much better if eggs & bacon or sausage were offered like most of the other places we've been staying in on our trip. Overall, this was a very nice place to stay and I would definitely stay here again if ever in the area.", "title": "A Nice & New Place", "helpfulness": 3, "user": "stuff3", "date": "May 28, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 110281315}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "This motel was a suprise! Good value for what you get - outside downtown Moab on south side, but still near restaurants. Surprisingly quiet place as well. Had an upstairs room looking toward the highway - but the road noise wasn't bad at all. Room was nice clean and spacious. The refrigerator was a plus - we put it to use after hot days at the parks. Only a shower, but that was just fine with us. We did not use the pool, but it looked nice.", "title": "Good Value - Great location for Arches and Canyonlands NP", "helpfulness": 2, "user": "pasowine", "date": "May 16, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 108558660}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The continental breakfast in the morning was sufficient, with an unexpected wide range of choices. We were up early, but I saw that it got really crowded for breakfast later on after 8 AM. There was also a Starbucks just up the road in one of the large grocery stores.", "title": "perfectly adequate", "helpfulness": 2, "user": "Rocker_rep", "date": "May 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 107800861}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "This motel was about the least expensive option we could find in Moab but I would highly recommend it to travelers who understand value and don't expect a 5 start hotel for under $100.", "title": "Nothing special, but close to Arches", "helpfulness": 1, "user": "grzegorz_krol", "date": "December 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 91013570}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "The whole place - Moab is extremely beautiful with its surroundings - Arches and Canyonlands. It is worth to see them. :) The hotel, like other Sllep Inns was very good, comfortable with nice stuff, who helped us to see as much as we could. Continental breakfast was served. For me it was a bit expensive, but the place was really great.", "title": "Red rock country", "helpfulness": 1, "user": "Krzysiek23", "date": "December 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 90156674}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "This was one of the cheapest options we could find for visiting the national parks and while I feel it's still a little pricey for what you get, it isn't bad.", "title": "Reasonable value for Moab", "helpfulness": 1, "user": "44rl44", "date": "November 28, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 88460315}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The room was spacious and clean. There was no bath but there is a nice pool and jacuzzi if you want a soak after a long day hiking! The corridors stank of smoke but it was fine in the room. Breakfast was just average and very cramped. There was some noise from other rooms but nothing too serious.", "title": "Clean and bright with some good facilities", "user": "teafour2", "date": "November 28, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 88422605}, {"rating": 4.0, "stay_parameters": "Stayed September 2010", "text": "One thing that did surprise me was that the staff all looked really grungy, wearing ripped jeans, hoodies and with loads of tatoos and piercings. This didn't bother me but I guess some people might not like it, didn't seem very professional somehow!", "title": "Great Stay for a Good Price", "user": "sckittygirl", "date": "November 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 86417893}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "But overall this place is fine.", "title": "Very nice place to stay in Moab", "helpfulness": 1, "user": "123110", "date": "October 20, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 84238711}], "location": {"country": "United States", "city": "Moab"}, "variance": {"poor": 17, "average": 72, "very good": 187, "terrible": 6, "excellent": 74}, "aka": "Sleep Inn Moab Hotel Moab", "slim_ranking": 0.484848484848, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "This Sleep Inn is located approximately four miles from the Colorado River and 18 miles from Moab-Canyonlands Field Airport. In the morning, a complimentary continental breakfast is served and free weekday newspapers are available. The Sleep Inn also has an outdoor seasonal pool, interior corridors, laundry facilities, and a parking area. All rooms have air-conditioning, clock radios, free coffee, irons and ironing boards, free local calls, and cable TV."}