{"user_rating": 4.0, "review_count": 71, "name": "Smith & Western Tunbridge Wells", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "If you just need a clean, comfortable room at a very reasonable price, then you can do a hell of a lot worse. I am due to stay here again so would reccomend.", "title": "Not bad at all", "user": "hunkydave", "date": "July 18, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 71382936}, {"rating": 1.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "I booked on line and checked the trip advisor site and I did not see one mention of the Sainsbury car park. Our stay here was at the back overlooking the car park and it was terrible. The single glazed windows, which all rattled in their frames, were no barrier to the constant stream of traffic. Some blew their horns for no apparent reason, car alarms went off occasionally, and boy racers on mopeds moved in when Sainsbury shut at about 23.30. We guessed that the racket that started at about 4 am on each of our 3 days here was due to the delivery lorry at Sainsbury with roller shutter doors going up and down, cages rattling round and general metallic screeching noises. The bottle bank being emptied at around 8 am was also a noisy affair.", "title": "Too Noisy", "helpfulness": 1, "user": "Globe-spanner", "date": "May 20, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 1.0}, "id": 109033847}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "To compete with Sainsbury the church bells started at 7 in the morning, the gardeners also came at 7 to use their petrol strimmers and chipper machines. A flour tanker was unloading on the first day making a high pitched racket. This was just beyond the petrol station, approx 200 yards away, but the noise carried.", "title": "Clean, comfortable and spacious", "user": "jp_from_paris", "date": "January 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 91809254}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The rooms were on the small side with no mini bar, clean and newly decorated. There was a pod type coffee machine, iron with board, hair dryer and a cheap TV hanging on the wall. I would have expected a king size bed rather than a double in a room described as a \"Superior Double\". The cowboy theme may be overdone in the public parts of the hotel but thankfully it did not extend much into the rooms, just the odd set of antlers here and there.", "title": "Brilliant!", "user": "sweetascandy1", "date": "October 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85443588}, {"rating": 5.0, "stay_parameters": "Stayed August 2010", "text": "No bath but a good sized shower enclosure. It was a pity that the water was only tepid with low flow. No vigorous hot shower here. Towels were good. There was a horrible brownish/beige shaggy floor mat that looked most unhygienic and was truly dreadful.", "title": "Quirky, fun and immaculate.", "user": "SV1000s", "date": "August 29, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 77310752}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "The only meals we took in the restaurant was breakfast and all the ingredients were there for a good meal however this was unfortunately not the case. Some of the food on the plate was cold and it was all greasy. The one time I had scrambled eggs was a time to forget. The waiting staff were mostly nowhere to be seen and it was usually the case to go and find them although the chap mopping the floor always seemed to be present.", "title": "Good for holidaymakers - bad for the business traveller", "user": "a_scot_in_exile", "date": "August 8, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 74330407}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 1, "average": 10, "very good": 28, "terrible": 1, "excellent": 31}, "aka": "Smith & Western Tunbridge Wells Hotel", "slim_ranking": 0.272727272727}