{"user_rating": 4.0, "review_count": 131, "name": "Smugglers Creek Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "Stayed in Rossnowlagh in September 2012 with a group of friends.", "title": "Beyond Stunning Meal!!", "user": "RoryMc", "date": "September 21, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 140877530}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Had one of the most outstanding meals ever in Smugglers...The Inn has just a wonderful feel about it..a great place to go on a session id say only we had our 5 month old with us:)", "title": "Grandma’s feather bed", "user": "mariposa888", "date": "September 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139658558}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The food was just amazing, best Mussels ive ever had, superb Halibut. Everyone raved about the food, just so flavoursome and tasty and quite reasonably priced..and as for the deserts...:)", "title": "Best Kept Secret in Donegal", "helpfulness": 2, "user": "harrycameron", "date": "August 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 138252388}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Definitely where to go when in South Donegal!", "title": "super stay", "user": "bigtommie", "date": "August 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 138208456}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "It is many years since I last visited Smuggler’s Creek and it is good to know that some things don’t change. The food, music, views and welcoming atmosphere at Smuggler’s are as wonderful as ever. I can’t remember noticing the beds last time round but they made an impression this time – we all agreed that it was like being in grandma’s feather bed.", "title": "Going downhill recently.", "helpfulness": 1, "user": "Jambo30", "date": "August 10, 2012", "detail_rating": {"value": 2.0, "service": 2.0}, "id": 136829096}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "we stayed here for the second time as we loved our first visit. it was a friday night and just as we finished our dinner the LOUD music stated. the amplifier was totally out of place in such a setting and the place too small for such sound. we couldn't talk. went to our room only to find we were right above the music so we had to leave until we knew it would be over. BREDA", "title": "great location but.....", "user": "Breda D", "date": "July 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 133337401}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "What do four lads (and an extra patient girlfriend) do after a triathlon on a Saturday afternoon? They take the coast road from mullaghmore to Donegal and stop off in the smugglers creek for a few relaxing  pints and a steak.", "title": "What do 4 lads do on a Lazy Saturday afternoon, after a tri", "user": "jackKerala", "date": "July 1, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 4.0}, "id": 133148131}, {"rating": 4.0, "stay_parameters": "Stayed June 2012", "text": "There you can look out on one of the best beaches in europe, watch the surfing, explain how you nearly drowned in the swim, overtook a fella the spit of Lance Armstrong (local donegalism for looks very like Lance Armstrong!) against a gale wind and attacked the hills on the run.  Or you can just sip your beer, lean back on the chair and listen to your mate waffling on and on....", "title": "Food beautiful but....", "helpfulness": 2, "user": "Cat Ron H", "date": "June 12, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 131849074}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Smugglers is a great irish pub, does good creamy chowder, has a great view and doesn't charge the earth.  The service was mostly good.  My sirloin steak ws great though the hake was tasteless.", "title": "Fish and Chips to die for!!", "helpfulness": 2, "user": "Sleepy021", "date": "June 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 131664924}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "But the point is this...no matter how good the pub, the grub or the view, you can't expect to get quicker ....if you don't train!!!", "title": "very disappointing", "helpfulness": 2, "user": "MazGilmore", "date": "June 5, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 131374102}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Located on the southern cliffs overlooking Rosnowlagh the views of Donegal Bay from the Smugglers Creek Inn are stunning. The day we visited the sun was out and the view from the restaurants windows could not have been more beautiful. We called in for lunch and had the BLT on ciabatta and the steak on forcaccia... amazing! The steak comes complete with fired onions, melted cheese and relish with a garden salad. Im not sure if these breads are made 'in house' but they certainly arn't the usual run of the mill and tasted wonderful! The staff were very friendly and made the whole visit a joy! Very much enjoyed and have no reservation recommending as one of the best lunches in Donegal! Expect to pay 10-15 euro per head for lunch including drinks...", "title": "Beautiful Lunch", "user": "bluebus", "date": "August 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "service": 5.0}, "id": 136793938}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Enjoy!", "title": "Worth Seeking Out.", "helpfulness": 1, "user": "letterkennycaint", "date": "August 9, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 136719281}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Had lunch here recently and it was a wonderful experience. Never heard of it before a colleague of mine mentioned it. She told me to go to Sands Hotel in Rossnowlagh and if the tide is out drive across the beach and up the hill to Smugglers. She was spot on. Best way to find it and a short cut also. Got seated immediately by the window which offered excellent sights over the bay. It was quiet busy during our visit but the service was top notch and with a friendly smile also. I ordered the burger and chips and had no complaints whatsoever. Would have loved to stay for the afternoon and enjoy a few drinks but because I was driving that was not an option. The bar was old style and cosy, my type of place. Now that I know how to get there I will be back, several times.", "title": "Unfortunately not as I remembered...", "helpfulness": 1, "user": "Jno2010", "date": "August 1, 2012", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 5.0, "service": 3.0}, "id": 135997784}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Staying in Fermanagh on a sibling get together, I was keen to return to a place I'd visited many times with my own family and thoroughly enjoyed many years ago.", "title": "Five go to Smugglers Creek", "helpfulness": 2, "user": "maire o", "date": "July 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 135000217}, {"rating": 5.0, "title": "Great fun", "text": "We went for lunch on a lovely sunny Thursday (one of the few recently!). On arrival we found a table easily - not the buzzing crowds of my memory it has to be said. Unfortunately we were forced to move by the awful smell of stale urine coming from the men's loos (only one of the ladies was operational but it was clean). There is NO excuse for poor,smelly facilities...", "user": "ramilli", "date": "July 21, 2012", "id": 134995742}, {"rating": 1.0, "title": "Best part of this establishment is the view !", "text": "Myself and my mother were in the area due to unfortunate circumstances. I will not go into too much detail here but we went to the Sandhouse Hotel with some flowers and card as my father had a heart attack on the 7 July 2012 on their premises and subsequently died. The staff were superb and we wished to acknowlege our gratitude to them.", "helpfulness": 1, "user": "Mark W", "date": "July 20, 2012", "id": 134922501}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "I had heard very mixed reports about the smugglers creek but I was very dissapointed with everything really. We decided to have lunch before the short journey home. When we arrived we were seated and the order was taken. The waitress was pleasant but not over friendly by any means. We made our order and had to wait around 40 minutes for our food. When it arrived I would describe it as adequate. I personally ordered the home made burger but very little chips and side salad with it. Ater we had finished our meal we were left sitting there until we finally got up and went to the bar to make payment. I decided to use the mens toilets and noticed that the door didnt fully shut and standing at the urinals you are in view of the bar. This I see has been mentioned by previous reviews but obviously nothing done about it.", "title": "Great time at Smuggler's Creek! :)", "user": "Pauline333", "date": "July 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 134650855}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "When we were leaving we come across our waitress eating her lunch. She hadn't bothered to come back to us !!", "title": "Beautifull spiritual place", "user": "Hana A", "date": "July 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134461286}, {"rating": 4.0, "stay_parameters": "Stayed July 2012", "text": "Usually in theses circumstances we would just leave it as 'ah well we just wont go back' . But unfortunately my mother has been on the toilet numerous times since we have arrived home so I felt it deserved a mention. As my title states the most positive thing I could say about the place is the view.", "title": "Sort out your toilets and u have a spectacular place...otherwise it's average", "helpfulness": 1, "user": "Sjg1112", "date": "July 14, 2012", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 134380468}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "My sister and I have been very lucky to have stayed at the Smugglers a few times over the past few years :) we have always had a fabulous time :) even have the t-shirt!! lol..the moment we decided to head to Donegal, we ensured we could get at least the one night at the Smugglers. We booked the twin room this time, on the 7th July which was ok..you do have a side view of the beautiful beach..the stripey wallpaper should go..makes the room seem even smaller and the shower head in the shower needs replaced as we made an effort to not open our mouths under the shower, as it was rather 'icky'...plus a bit of a problem with the lock on the door but the wonderful Mr Rush sorted that :):).but...the rest of our stay was fantastic!! :)..there is always a warm welcome..we had pre-booked our table, as usual, at the window..it was a glorious evening!..absolutely gorgeous dinner :)..wonderful wine..:) (ok..probably had a wee bit too much!..but hey it was our holidays!:) and the entertainment was great fun..i cant remember the name of the guy but he sang something for everyone ie from Neil Diamond to Black Eyed Peas!! very eclectic!! lol.....bar staff also wonderful :)...ach you just cant beat the place..it's truly special...thank you to all the staff who made our wee night sooo fab :) cant wait to return!! :)", "title": "Fantastic place to chill out", "helpfulness": 3, "user": "Jeff R", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133886222}], "location": {"country": "Ireland", "continent": "Europe"}, "variance": {"poor": 9, "average": 15, "very good": 32, "terrible": 11, "excellent": 64}, "aka": "Smugglers Creek Hotel Rossnowlagh", "slim_ranking": 0.666666666667}