{"review_count": 237, "slim_ranking": 26.0, "name": "Smyth In The Iron Horse Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Visited February 2012", "text": "My wife took me to this restaurant for my bday 2 days ago and I thought it was very good. They served a variety of breads and they were good. then we order beer cheese soup and spanish minestrone which were goog then i had salmon with asparagus and roasted potatos and my wife had a steak with mash potatoes and asparagus. we order a bottle of wine which wasnt so good. Service was excellent, the waitress brought us a chocolate cake since it was my bday. Nice place to come for a romantic dinner", "title": "Great food, excellent service and pricey", "user": "southamericandude", "date": "February 26, 2012", "detail_rating": {"value": 3.0, "service": 5.0}, "id": 125227482}, {"rating": 5.0, "title": "Smyth Rocks!", "text": "Great food & service! Be sure to make reservations. This is a dress casual restaurant.", "user": "SaltLife19751", "date": "February 22, 2012", "id": 125040336}, {"rating": 5.0, "title": "Friends viewpoint", "text": "Absolutely outstanding hotel and also the food is great.", "user": "Glenn F", "date": "February 21, 2012", "id": 124944362}, {"rating": 5.0, "stay_parameters": "Visited February 2012", "text": "I love the ambiance of this restaurant. The service people are attentive but not intrusive. I think the bulk of the menu centers around heavier fare, but there are options for lite alternatives. The Porkerhouse is a favorite but I had the tuna this time and it was delicious.", "title": "Smyth consistently meets my expectations for service and food.", "user": "DblmtDeb", "date": "February 20, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 124880480}, {"rating": 2.0, "stay_parameters": "Visited February 2012", "text": "We had heard good reviews but were disappointed. The appetizers were nothing to brag about. We had the rabbit and calamari. I have had much better calamari and Honestly never had rabbit before but were given maybe a fork's full worth of meat and the rest of it was bread and mushrooms. My father had gotten the flat steak which was not a good cut at all. We had tried a bite and agreed we could have botten the same steak at a grocery store. It was chewy and not worth the price at all. I had the Ahi Tuna steak which was good but nothing to brag about. We also tried a desert, which I personally thought it was the same cake I could have gotten a perkins. I was not impressed and will not be going back for dinner which is a disappointment because the hotel is amazing itself.", "title": "Was not impressed", "helpfulness": 2, "user": "NellyMarie", "date": "February 12, 2012", "detail_rating": {"value": 1.0, "service": 5.0}, "id": 124487482}, {"rating": 5.0, "stay_parameters": "Visited March 2012", "text": "For all of us it was our fist time at the Iron Horse. We enjoyed mulling around the lobby area while waiting for the restaurant to open. We had a wonderful waitress named Ashley and she was so efficient and informative that we knew from the getgo that we'd be well taken care of. We were really in love with the artichoke dip with truffle custard, so creamy and delicious. Salads and split pea soup followed and was well presented and very tasty. Next was 3 Buttermilk Chicken entrees and one flank steak. We all marveled at how good everything was. Ashley continued to be very attentive and probably one of the best waitresses we have experienced over the years. We were all so full by the time we finished that we didn't have room for dessert. We enjoyed just sitting around a more than roomy table, which was a nice change of pace, and visiting and taking in the very interesting decor. We'd recommend the Iron Horse to our friends and would remember it when we'd want to be assured of a very special evening.", "title": "Worth every bite", "user": "PatPatti68", "date": "March 20, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 126418683}, {"rating": 5.0, "title": "Fine dining at it's best", "text": "The atmosphere, service, menu selection and food quality were all top notch. One of the best fine dining experiences we've had in Milwaukee.", "user": "Mara P", "date": "March 13, 2012", "id": 126072205}, {"rating": 5.0, "stay_parameters": "Visited March 2012", "text": "My wife and I had dinner here Saturday. It was once again excellent. The service throughout the hotel is fantastic. The drinks are great. We each tried something different as an appetizer and meal and each item was great. They were very reasonable with the corkage fee, as we brought a special bottle of wine. We can't wait to go back.", "title": "Excellent again", "user": "jdeutsch", "date": "March 5, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 125664356}, {"rating": 5.0, "title": "A great night out!", "text": "The food was excellent. Manager was charming and funny and waitress was very attentive and pleasant.", "user": "bboehlke", "date": "March 5, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 125646363}, {"rating": 5.0, "stay_parameters": "Visited February 2012", "text": "My wife and I recently dined at Smyth on the weekend prior to Valentine's Day. In short, I found Smyth to be an excellent restaurant, located in a beautifully designed hotel, with friendly and smart service and incredible food.", "title": "Rabbit Two Ways - Excellent Appetizer", "user": "PrepBJ5", "date": "March 4, 2012", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 125591002}, {"rating": 5.0, "stay_parameters": "Visited March 2012", "text": "We enjoyed apps from :Smyth Restaurant\" in the lobby lounge.We had fried fish with a blu cheese dressing,which was great.We also enjoyed ,chicken tenders,and,a steak sandwich. Everything was delicious.The ambience in the lobby lounge is great with harley cycles showcased on a raised platform !", "title": "smyth is smashing", "user": "charliejoe", "date": "March 27, 2012", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 126796287}, {"rating": 4.0, "stay_parameters": "Visited March 2012", "text": "Dined with my wife and dining friends on Sat. 3/24.We reserved a 6 pm table for four because we had heard it could get loud later. We were seated promptly on time and Ashley our server started our evening of wonderful food and service.We dined on fillet, a rib-eye special, veal chop and osso busco. All were superb from presentation to flavor.We shared a bottle of Washington state Stained Tooth wine which we all enjoyed and complimented our meals.Ashley asked if this was a special event for us and brought us two mint creme brule desserts to share on the house.The only negative was the sound level,by 7 pm it was getting difficult to converse at our table. We would surely visit again.", "title": "Great food and table service to match", "helpfulness": 1, "user": "Ken M", "date": "March 27, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 126740895}, {"rating": 5.0, "title": "great food", "text": ",", "user": "labor2", "date": "March 26, 2012", "id": 126689699}, {"rating": 5.0, "title": "Great food in a relaced (but loud) atmosphere", "text": "try the flat iron steak or porkerhouse!!! Great service and ambiance!!", "user": "BosoxKen", "date": "March 22, 2012", "id": 126490239}, {"rating": 5.0, "title": "Great brunch", "text": "Went here when Jason Gorman was the chef and his food is wonderful. A little loud (what would you exect for a place dedicated to Harleys?) but hey, we can enjoy ourselves as long as the food is great! Going back in April to try the new chef's cuisine and will keep you posted", "user": "Merush", "date": "March 21, 2012", "id": 126427261}, {"rating": 4.0, "title": "Excellent Meal!!", "text": "Great appetizers, fantastic entrees and wonderful wine list. Very Nice!", "user": "VABlue", "date": "January 28, 2012", "id": 123734571}, {"rating": 5.0, "title": "Wedding Memories", "text": "Just had a wedding at the Iron Horse. The staff could not have been more attentive and courteous. The food was outstanding with an inviting presentation. Highly Recommend!", "user": "EllenKatherine", "date": "January 27, 2012", "id": 123693213}, {"rating": 4.0, "title": "a welcome treat", "text": "This is not typical hotel-fare by any means. This is a top notch establishment with a spectacular menu. Something for everyone... with a touch of the unexpected.", "user": "k_bee1010", "date": "January 26, 2012", "id": 123666278}, {"rating": 5.0, "title": "Wonderful dinner & Service", "text": "I can honestly say that, while I know I enjoyed my meal, my husband and I were simply having such a relaxed time that I remember little about the food. I know I ordered fish and he ordered a steak, but we were flirting heavily and I don't recall the specifics. I only know that the service was outstanding and the waitress was completely aware of the specialness of our night.", "user": "walk_everywhere", "date": "January 25, 2012", "id": 123581183}, {"rating": 5.0, "title": "Boutique Hotel restaurant", "text": "Great food and ambience! A definite hot spot. The outdoor patio in the warmer months is fantastic.", "user": "Ricki W", "date": "January 23, 2012", "id": 123485800}], "location": {"country": "United States", "city": "Milwaukee"}, "variance": {"poor": 10, "average": 24, "very good": 42, "terrible": 3, "excellent": 158}}