{"user_rating": 4.5, "review_count": 2701, "name": "Sofitel Legend Metropole Hanoi", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "The Sofitel Metropole is currently one of my favourite hotels. We stayed there for 3 nights during our honeymoon in the Grand Premium Room in the Opera Wing which gave us access to the Club. It is definitely a very pricey hotel, especially for Vietnam but we felt it was all very worthwhile.", "title": "Total luxury in Hanoi", "user": "misskitz", "date": "November 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120478680}, {"rating": 5.0, "stay_parameters": "Stayed November 2011", "text": "The rooms were pure luxury. It was beautifully decorated and very comfortable. I also loved how no tiny detail was overlooked. Beautiful linen, plush robes, and good quality toiletries. We spent every evening at the club having pre dinner drinks and snacks before heading out for dinner and it was a great way to unwind after all the hustle and bustle of Vietnam. A plus is that they serve you good quality champagne and delicious cocktails.", "title": "it's genuinely special", "user": "owenh_60", "date": "November 11, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 120459613}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "when you arrive you know it's special. rooms are decent size not huge. well appointed. beers at reasonable price Vietnamese restaurant good maybe not excellent.lovely big enclosed area at back. you feel special here.. recommended", "title": "Historic and modern at the same time", "user": "D P", "date": "November 10, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120438316}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "The Metropole does a good job of melding its 100+ years of history with today's modern conveniences. I stayed in the new Opera wing but enjoyed the old lobby and the retro uniforms of the female staff. If you've seen the movie Indochine you've seen the look. The rooms in the new wing are quiet and quite a bit less expensive than the historic wing. Service was good, the breakfast buffet a banquet and the Bamboo Bar a pleasant refuge from the rain. Never got to try the pool but it looked lovely.", "title": "Charming old wing, spotty service", "user": "jade55ta", "date": "November 10, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120417136}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Stayed at the Historical (Old) wing last weekend. Had a room with a balcony, though you could hear some noise from the street, it was not a bother for anyone familiar wil hanoi street noises. The double glazed windows cut out most of the noise. All the amenities as expected of a 5-star hotel. Much prefer the old wing for its character and charm. Free use of the computer and internet is in the Business Centre of the Opera (new) wing. No charge for printing airline boarding passes for online check-in.", "title": "5 star", "user": "spurtlegirl", "date": "November 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120401231}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "This is one of my favourite hotels. It's elegant and charming. The rooms are tastefully decorated and spacious. Each evening chocolates/biscuits are left in your room. I enjoyed going to the restaurants and bars in the hotel. The service is terrific. It's really hard to leave the hotel to go and explore Hanoi, you're just so tempted to hang at the hotel.", "title": "Highly Recommended", "user": "TabHK", "date": "November 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 120099586}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "There are two sections to stay in at the hotel. The old wing I prefer.", "title": "Metropole wins again", "user": "RDF0144", "date": "November 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 120094426}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Our fourth stay at the wonderful Metropole was, as expected, very relaxing and comfortable.", "title": "Charming hotel", "user": "Joanne T", "date": "November 1, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 120018498}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The staff are friendly and helpful in so many ways. We have previously stayed in the Historic Wing , butfor the first time our room was in the modern building - very good, but we prefer the old and quieter style of the Historic Wing, rooms, foyer and other public spaces are all first class. HIGHLY RECOMMENDED.", "title": "Wonderful experience, great hotel", "user": "Sandra J", "date": "November 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120009836}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Hotel with a nice, old-world charm and tasteful furnishings. It's a pity that the bathtub is a tad small. Will definitely return again when we visit Hanoi, especially to try Le Beaulieu's dinner menu.", "title": "A good hotel with great service", "user": "rockymsia", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 119998879}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "As part of a trip to Vietnam and Cambodia in November, we stayed four nights at the Metropole. The hotel grounds, interiors and service were excellent. As we arrived at the hotel, we were met at the door and invited to sit in the lounge as an attendant completed check-in at the counter. The terrific service started at this point and continued during our stay. We stayed in the newer hotel area and found it peaceful despite being on the third floor. After a day of visiting city sights, we found it thoroughly enjoyable to enjoy a refreshment at the Bamboo Bar and wind down. Breakfast buffet offered a wide range of western and local foods. The exercise gym was well-appointed.", "title": "Wonderful stay at the Metropole", "user": "VisitorBob", "date": "November 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120699683}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We are used to staying in luxury accomodation and were not disappointed by this hotel (other than the toilettries which seem to be the same the Sofitel world round!) it was hard to believe that we were some where other than a colonial hotel. We had a grand luxury room in the old part of the hotel - it had lots of character, a lovely bathroom and a fabulous balcony from which to watch the scooters and other traffic madness from! The hotel staff were execellent - unfortunately our luggage was delayed on the way over and could only be delivered by the airline to Hanoi airport \"due to regulations\" - the concierge at the airport went out of their way to collect the luggage for us only charging for a one-way cab fare from the airport as, we assume, our bags could not be accomodated on a scooter!", "title": "An oasis of calm in a fabulously busy city!", "helpfulness": 1, "user": "JJ450", "date": "November 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120604536}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The hotel has a lovely bar and pool area with a great gym and whilst we did not eat much at the hotel, the food was we did eat there was really good.", "title": "Great choice in Hanoi", "user": "sweil83401", "date": "November 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120601516}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "The only down side for us was that when we asked for a restaurant recomendation (outside the hotel), we got directed to a relatively expensive (by Vietnamese standards) ex-pat hang out which was not that great - but hey not really the fault of the hotel!", "title": "Absolutely wonderful!", "helpfulness": 1, "user": "June E", "date": "November 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120523798}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "All in all, expensive for Vietnam, but not by European standards given the quality and experience offered - would not hesitate to return!", "title": "All very good but the price", "helpfulness": 1, "user": "TravellingGosia", "date": "November 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 120517717}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "The historic wing of the Hilton Metropole is THE place to stay in Hanoi if you want to experience luxury and feel like you've stepped back to the 1930s. The problem is that the staff are terribly proud of working at The Metropole and make you feel that you should feel honoured to stay there. Of all the hotels we stayed in Cambodia and Vietnam on a end-to-end tour this was the only one that did not make us feel special when we arrived - no cool drinks, no cold towels (all of which we had at the other hotels), but rather made to wait until they were ready to check us in, despite arriving in one of their cars from the airport. Thoughout the stay the concierge made any request seem to be below him. The front office service aside, this is a magnificient hotel. As we had children with us we stayed in an interconnecting suite and room in the historic wing. It was absolutely wonderful with comfortable beds, large bathrooms and the modern touches tastefully blended in with the period furniture and decoration. We had a pool view, which meant that the noise of the busy outside road did not disturb us. Some rooms do only have a view of a brick wall so be careful about which room you end up in. The pool is a nice size and has plenty of facilities. The location of the hotel means that you can easily walk to the lake, but it is outside the old town. This hotel is not cheap by Vietnamese standards but it does provide a good experience of a past era.", "title": "A great hotel which knows it", "user": "Sayer", "date": "April 23, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 15278201, "likes": {"liked": "— The historic wing bedrooms", "disliked": "— The internet charge rate"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Club rooms were really nice - big room and amazing bath. Service was efficient. Club Lounge served snacks and drinks through the day.", "title": "Great Club Rooms", "user": "acone", "date": "April 15, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 15055003}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "It was my first trip in Hanoi after working almost a year in Saigon, first impression of this city is that it really looks like Saigon except it is all grey... Northern Vietnam is kind of sad, the weather helps but the people are much nicer, very kind and always smiling.", "title": "Surprising Hanoi", "helpfulness": 2, "user": "chrisvovan", "date": "April 13, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15001465, "likes": {"liked": "— If you look like Vietnamese, Service is awful", "disliked": "— If you look Vietnamese, service is very bad..."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "The Sofitel Metropole, has other travellers said is in an excellent location, can't find better. Right in the Old Quarters. It is a \"Honey Moon\" hotel, very beautiful with smiling young couples everywhere (I was there for work...;-)", "title": "Peaceful haven, disappointing dinner", "helpfulness": 2, "user": "globaltraveller200", "date": "April 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 14795705}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "The architecture is what you can expect from a typical colonial french building, except it is in excellent condition. It reminds me the Park Hyatt in Saigon, except the Park Hyatt is 1 year old and the Sofitel Metropole 100 years old ! Despite its age, it looks fresh, well maintained.", "title": "Marvelous!", "user": "CPH360", "date": "March 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14556484, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 4.0, "title": "Luxury in Hanoi", "text": "We stayed at the Sofitel Metropole between 27 Feb and 1 March 2008. This was our last destination in Vietnam. We had been to Saigon and Nha Trang and prior to setting off on holiday, we were looking forward most to staying at the Sofitel Metropole, having read the reviews on Trip Advisor. The hotel lived up to the reviews in every way. (However, the Park Hyatt in Saigon was the very best hotel in our view.)", "helpfulness": 3, "user": "Signet", "date": "March 10, 2008", "id": 14183492}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The Sofitel Metropole's French restaurant served excellent food. (We did not think that the Spice restaurant, also within the hotel, was as good). The breakfast buffet offered a large variety but I would warn that the mangos are not as sweet as they are in South Vietnam (I actually thought they'd been marinated in lemon juice! - but they hadn't). We ate out at Bobby Chinns restaurant which was nearby and would certainly recommend it. We took a trip with Vidotours to Halong Bay and that was a day to remember. For £50 each, we travelled by private car with a driver and a tour guide. Upon arrival, we transferred to a boat, where we were the only passengers, and the table was set for lunch, which was cooked on board as we sailed to the caves across the sea. In all of our experience of Vietnam, we found the tour guides invaluable. They all spoke English and were happy to chat about Vietnamese customs and interested in our way of life too.", "title": "Strawberries with chocolate", "user": "JAEMH", "date": "March 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 14164363, "likes": {"liked": "— Atmosphere, gym and service", "disliked": "— rooms are rather small"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The best place we have stayed in years. Everything worked in this place. Very friendly staff, fantastic rooms, good food and an excellent gym. Every evening a sweet surprise. Where in the world do you find fresh strawberries covered in chocolate at the end of the day in your room? We so much enjoyed!", "title": "Gorgeous hotel and impeccable service", "helpfulness": 1, "user": "whoisthis", "date": "March 6, 2008", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 14092247, "likes": {"liked": "— Location and Breakfast Buffet", "disliked": "— Nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed January 2008", "text": "We stayed at the Metropole for 4 nights in February at the new wing. We booked through a travel agent, and although the travel agent recommended the classic wing, we felt that it didn't justify the price. The room was modern, with recessed lighting, flat-screen tv, and a very nice bathroom with all the amenities. The buffet breakfast was one the best we had. I recommend trying the asian specialties at breakfast, including the vietnamese noodle soup. We also received two complimentary welcome drinks at the bar (no hard liquor included).", "title": "Overpriced and badly managed", "helpfulness": 5, "user": "moorke", "date": "March 4, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 4.0, "location": 4.0}, "id": 14030350}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We didn't experience some of the service lapses described by other reviewers here. In fact, we had mistakenly picked up the wrong luggage from the Hanoi Airport upon arrival and the concierge at the Metropole took care of the whole situation, including sending our wrong luggage to the correct owner at no expense. Given the language barrier, it's reassuring to let the concierge communicate with the airline and various other parties. Other than that, every staff member we came across during our stay greeted us, and every question we posed were answered.", "title": "Good, Not Great", "helpfulness": 1, "user": "Worldtreader1", "date": "February 29, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13923078, "likes": {"liked": "— Appearance", "disliked": "— Cold atmosphere, average staff."}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "This was our first experience with Sofitel and it won't be our last.", "title": "Brilliant", "helpfulness": 4, "user": "carol59692001", "date": "March 24, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 4.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14482413, "likes": {"liked": "— luxury"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Even though the hotel is quite big and very busy it is very personal with every member of staff going out of their way to make sure our visit was thoughly enjoyable.", "title": "Building works in Opera Wing and training required all round", "helpfulness": 2, "user": "SeanThompson", "date": "March 24, 2008", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 14478271}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We arrived after a disaster trip on a Junk Boat from Halong Bay, cold wet and miserable. Immediately shown to our room even though we where hours early from the designated check in time.", "title": "Excellent Hotel", "helpfulness": 4, "user": "Jun0", "date": "March 14, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14273083, "likes": {"liked": "— Spotless/Amenities"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Our room in the new block was to die for, with the added bonus of warm air fans, great just what we needed. The bed invited you to rediscover sleeping. Lots of finishing touches all to a very high specification.", "title": "An oasis in the culture shock of Hanoi", "helpfulness": 1, "user": "Aporo", "date": "March 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 14268076, "likes": {"liked": "— Ambience in public areas", "disliked": "— No view from a dark room"}}, {"rating": 5.0, "title": "Best 5 Star hotel", "text": "I accidently smashed one of the ornaments and offered to pay, most hotels automatically deduct from your credit card anyway, under no circumstances would they even think about charging me.", "helpfulness": 3, "user": "Floradora08", "date": "March 12, 2008", "id": 14248448}, {"rating": 4.0, "stay_parameters": "Stayed April 2008", "text": "If you want some luxury while staying in Hanoi, The Sofitel is the only hotel that could be recommended. Located in the old quarter of Hanoi, this hotel has a real colonial look and feel to it. We stayed in the Opera Wing of the hotel which I believe was recently renovated and is extremely comfortable with a lot of character, they tried to get us to upgrade to the Metropole Wing which I have no doubt is beautiful, however price dictated that we stuck with our original booking. The breakfast in the hotel is a rip off, the food was cold with very little selection, thankfully breakfast wasn’t included in our rate which gave us the freedom to have a proper breakfast at a reasonable price. The staff are extremely friendly and helpful and speak both English and French so there is no difficulty conversing with them. We decided to stay in the hotel for dinner on one occasion, the menu was quite extensive and looked nice but again we were disappointed with the food, quite bland and was the most expensive meal we had in Vietnam. In a nutshell I would recommend staying in this hotel but with such a great selection of restaurants at exceptionally reasonable prices, I would advise not to eat here.", "title": "The only place to stay in Hanoi", "helpfulness": 1, "user": "mgirishrover", "date": "May 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 15524526}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The Sofitel Metropole Hotel featured in my guidebook as a 'place to see'. But if visiting Hanoi, it should be your number one 'place to stay'.", "title": "chic and fabulous", "user": "AusMiss", "date": "April 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 15484082, "likes": {"liked": "— room", "disliked": "— cost"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "Despite some issues with our booking, the staff were charming, helpful and friendly. Our room in the new wing was beautiful - large, immaculately appointed, quiet. The breakfast was spectacular, the bars appropriately buzzy, the pool relaxing, the location ideal, even the cyclo drivers at the front entrance were a delight!", "title": "European elegance in the heart of Hanoi", "helpfulness": 1, "user": "charlegirl", "date": "April 29, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 15452436, "likes": {"liked": "— The architecture and the gorgeous layout", "disliked": "— robotic staff"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Our highlight was the Vietnamese restaurant Spices Garden. The food was simply the best we enjoyed in all our time in Vietnam. Exceptionally fresh and interesting dishes with only the best produce. The Australian beef noodles were one of the best dishes in our three week vacation. The restaurant was so great, we returned each of the three nights we spent at the hotel.", "title": "Beautiful oasis in Hanoi", "user": "TXfigment", "date": "April 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 15413134, "likes": {"liked": "— Bed comfort", "disliked": "— bed so comfortable I didn't want to get out to see city"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "I cannot recommend this hotel highly enough. It is expensive (particularly compared to the bargains that are available in Hanoi), but it is worth it. A truly magical place.", "title": "Heaven, I'm in heaven...", "helpfulness": 1, "user": "DoubleJacknCoke", "date": "April 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15340299, "likes": {"liked": "— Everything!", "disliked": "— Having to leave."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "We arrived from South Africa into this oasis where the staff were incredibly efficient, courteous, gently spoken and ever pleasing. Hotel itself was a colonial style masterpiece with plush carpets and intensely beautiful floral arrangements. Walking through the hotel onto the bar/pool deck with thatch-type roof, I felt like rewind had been pushed and we'd been transported into the old days. Rooms were stunning with every ameniety, five-star bathrooms and fully international compliances. Swam in their beautiful pool and drank Hanoi beer. Dolllars can be exchanged for local (though not necessary). Three terraces of breakfasts were offered, we settled for delicious smoothies.", "title": "Stately oasis in Hanoi", "user": "CPTTravels", "date": "November 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120324953}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled solo", "text": "The historic property is top notch. At least the historical wing. Watch out and do not stay in the new annex building!", "title": "Mediocre food and service in an outstanding property", "user": "RingoKringo", "date": "November 8, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 120318926}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "The service has deteriorated considerably over the years though. The staff tries hard to give you an impression of being in a French colonial hotel, but actually nobody speaks more French than \"Bonjour\".", "title": "A jewel in Hanoi", "user": "AdelaideAndrew", "date": "November 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120312290}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The once highly-praised restaurant Beaulieu is a disaster. Totally overrated, no class or style, only history. Every hillbilly can walk in with slippers and singlet, no dress code. Only mediocre, but expensive food. Some terrible faux pas occurred when I visited. Only a shadow of its former self. Sad.", "title": "Peaceful sanctuary amidst the chaos of Hanoi", "user": "Danrichoz", "date": "November 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120260174}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Strange smoking policy in the cafe: When I asked if I can smoke they reply yes, but when I light a cigar they pull back their given word. How unprofessional! I do not mind not to smoke. But I hate staff giving wrong answers to precise questions. The list goes on and on...", "title": "For the ambiance", "user": "expatsing", "date": "November 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 120223649}], "location": {"country": "Vietnam", "continent": "Asia"}, "stars": 5, "variance": {"poor": 37, "average": 119, "very good": 436, "terrible": 18, "excellent": 2091}, "aka": "Sofitel Legend Metropole Hanoi Hotel Hanoi", "slim_ranking": 0.041067761807, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Primary photo: La Terrase"}