{"user_rating": 4.5, "review_count": 325, "name": "Sofitel Legend Old Cataract Aswan", "reviews": [{"rating": 5.0, "title": "Best hotel in Egypt", "text": "We stayed at the hotel for four nights and enjoyed all of them.", "helpfulness": 7, "user": "crushdummy", "date": "March 20, 2007", "id": 7195199}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Historic hotel in a beautiful setting. Outstanding views of the Nile, the west bank, islands and temples from the patio and rooms facing the river. While the city center and the Cornice is a short walk from the hotel, it is isolated from city noise or confusion. Public spaces are very interesting and the whole facility has a very relaxed, exotic feel. The old but beautifully maintained wood floors, wide hallways and antique elevator add to the atmosphere. When you are sitting out on the patio or along the paths below the patio, you think you are in a different world.", "title": "Ok as it is best in Aswan", "helpfulness": 7, "user": "Global_Traveller037", "date": "March 16, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 7171164}, {"rating": 4.0, "title": "run-down splendour", "text": "The staff was very friendly and helpful but not very effective. The cashier never had small currency. The answer was always to go next door to the New Cataract for money. The concierge could not answer even basic questions about a trip we planned to take to Aswan.", "helpfulness": 5, "user": "elizalily", "date": "January 31, 2007", "id": 6718905}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The large (only) dining room, which serves breakfast and dinner, is beautifully decorated in the same oriental style as the rest of the hotel. We did not have dinner there but were very satisfied with the variety and quality of the breakfast selection.", "title": "Go for the character/history", "helpfulness": 9, "user": "mhmgfouy", "date": "November 21, 2006", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 6160689, "likes": {"liked": "— position", "disliked": "— limited restaurant"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "If you stay at the Old Cataract, I recommend reserving a river view room. You are already paying a high price for staying there and it is more than worthwhile to upgrade to the river view. Our room on the third (fourth level) floor had an outstanding view overlooking the temples on Elephantine Island. The garden-facing views are pleasant and quiet but miss the views.", "title": "Going back in time....", "helpfulness": 9, "user": "murphysmum", "date": "November 19, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6152519, "likes": {"liked": "— Overall period charm...", "disliked": "— Nothing..."}}, {"rating": 5.0, "title": "Grand Colonial Style", "text": "Spent one night and a full day at the OLD CATARACT. If you want modern Hyatt this is not it - BUT if you want grand colonial style IT CERTAINLY IS !", "user": "pineridge", "date": "March 12, 2006", "id": 4601853}, {"rating": 4.0, "title": "Great old hotel", "text": "We had a room on the 3rd floor with a small balcony overlooking the Nile. We thought everything was exceptional (but you get what you pay for, and it was 3 times the price of the sister hotel next door.", "user": "ashnick", "date": "March 6, 2006", "id": 4587248}, {"rating": 5.0, "title": "Romantic and peaceful", "text": "The Terrace was splendid and I thought I would see Peter Ustinov still sipping afternoon tea in the corner. The staff were excellent, and the small touches like free chocolate dipped stawberries in reception were great.", "user": "A TripAdvisor user", "date": "February 8, 2006", "id": 4446551}, {"rating": 4.0, "title": "Old Cataract could be improved", "text": "I rank it as one of the top three hotel experiences I have ever had.", "user": "egyptophile", "date": "February 2, 2006", "id": 4409982}, {"rating": 3.0, "title": "Beautiful Building and Location, So-So Rooms and Service", "text": "This is one of those great old colonial style hotels that one has to experience once in a lifetime. We have visited several such hotels and this ranks equal to most of them although not as good as the top ones such as the Mount Nelson in Cape Town. One does have to accept that the five star label does not apply at every level and adjust ones expectations accordingly.", "user": "claassenam", "date": "January 20, 2006", "id": 4366416}, {"rating": 2.0, "title": "Food Hygiene and Service at Old Cataract is long past its sell-by date", "text": "I paid three times more to stay at the Old Cataract than I could have paid to stay at several other 5 star hotels in the area, as I wanted to experience the supposed charm and character of this \"grand dame\" of hotels. After suffering stomach problems and poor service, my advice is to maybe visit and enjoy the atmosphere, but perhaps consider staying elsewhere.", "user": "HotelFerret", "date": "June 21, 2006", "id": 5372759}, {"rating": 4.0, "title": "A Great Experience", "text": "The hotel was pretty empty during my stay, due to the time of year and football. Because of that, the main 1902 Restaurant was not used at breakfast time, and a much smaller buffet was served on the terrace instead.", "user": "kazzie77", "date": "May 26, 2006", "id": 5221651}, {"rating": 5.0, "title": "The ONLY place to stay in Aswan!", "text": "I confess I am extremely cautious in my quest to avoid \"gyppy\" or should I say \"E-gyppy tummy\" and, having stayed in Le Meridien in Luxor, was aboslutely fine until arriving at the Old Cataract. The food was served outdoors on the terrace which is a personal hate of mine in hot conditions because of the swarms of flies and birds which perch on the tables pecking at your food (yes, it is sweet, and I admit I fed them, but it is still a health risk!!), and also because the food like ham and cheese is not kept properly chilled but left to fester for some hours in extremely hot conditions.", "user": "Slide-Guy", "date": "April 6, 2006", "id": 4943484}, {"rating": 5.0, "title": "Truly Unique Hotel", "text": "A fly was swimming in one of the fruit juice jugs and the waiter looked bemused as I handed it to him. Melon had been left covered under a glass dome and a serving fork and spoon had been left under the dome too - unfortunately slap bang on the melon slices, so any guest picking up the serving utensils would unavoidably have to touch the melon as well whilst trying to pick up the utensils. The buffet selection was small and no-one volunteered the information that you could order eggs to suit.", "user": "nickymLondon", "date": "April 4, 2006", "id": 4895947}, {"rating": 1.0, "title": "What a very very huge dissapointment", "text": "Needless to say I got a bad stomach and temperature, which lasted two days, and meant I spent the last afternoon of my holiday in bed.", "user": "travelbois", "date": "March 14, 2006", "id": 4618054}, {"rating": 5.0, "title": "Views and history", "text": "Staff was quite friendly. The Terrace experience for tea is all it's cracked up to be...lovely chaise lounges and plenty of time to gaze at the Nile. The food was excellent, pool area quite nice and overall I loved the Old Cataract.", "user": "Helen W", "date": "November 10, 2006", "id": 6101491}, {"rating": 5.0, "title": "Absolutely amazing", "text": "Stayed one night on a touring holiday, wished we had stayed longer as Aswan is a pretty town with lots of things to see. This hotel just oozes history, you feel like an old archaeologist staying here. It has a wonderful old lift. Rooms were a bit small but were fine, with lovely old furniture, bathrooms were modern. Views from balcony were fantastic.", "user": "Satisfied1", "date": "October 16, 2006", "id": 5959451}, {"rating": 4.0, "title": "Atmospheric Hotel", "text": "Enjoyed our meal in the 1902 room, (hint- you have to ask for the foreign wine list, they do have one).", "user": "hume", "date": "October 7, 2006", "id": 5924223}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "What shall I say about the \"Old Cataract\"? From the terrace of The Elephantine Bar, or from the terrace of the swimming-pool's restaurant, you have a marvellous view of the nile river, the felucca, the Elephantine Island, the Aga Khan tomb....What else....not much, except critics.", "title": "Desillusion", "helpfulness": 5, "user": "lubu", "date": "May 27, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 7704075, "likes": {"liked": "— The view", "disliked": "— All the remains"}}, {"rating": 5.0, "title": "One of our favorites", "text": "Though many scenes of the movie \"Death on the Nile\", with P. Ustinov, M. Farrow, J. Birkin...had taken place there, you can no more feel the same atmosphere. The welcoming at the reception is icy. The staff is not kind, except the man who gives you the towels at the swimming pool! The swimming pool!!! What a pity : it is small, with traces of rust, scales of swimming-pool very uneasy, the water too warm.Furthermore it is surrounded by an awful blue carpet on which you burn your feet, the parasol are in bad shape, the chairs are recovered whith skaï, so very uncomfortable in the sun! The food is ordinary. The location is bad, you need to walk at least 30-40 minutes to go downtown. A great, huge deception! I shall never go there again!", "helpfulness": 5, "user": "julieod", "date": "May 26, 2007", "id": 7700313}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "We really loved Old Cataract Hotel. We received a 2 category upgrade by the front desk- the only place that did that in Egypt for us. We had a huge beautiful garden room. I debated whether to just stay in New Cataract since it was so much cheaper but it was worth it for the charm.", "title": "Lovely hotel, some minor probs", "helpfulness": 3, "user": "AmandaFuller", "date": "May 17, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7635499, "likes": {"liked": "— 1902 restaurant, view of the Nile,", "disliked": "— very cheeky waiter, temperamental plumbing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The pool was nice and no one was really there. They had a great plate of hummus, felafel etc. to order from the snack bar. It was beautiful to look over the Nile.", "title": "style", "helpfulness": 8, "user": "davidcarol", "date": "April 20, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "business": 4.0, "cleanliness": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7402184, "likes": {"liked": "— Style", "disliked": "— pool was to cold"}}, {"rating": 5.0, "title": "Beautiful historic hotel", "text": "We had sunset drinks over by the terrace- only wish they had some food there as well. We were only there one night - Sunday- and went to the light show at Philae and were too tired to eat at 1902- after having a great breakfast there the next morning- we wish we had. The space was beautiful.", "helpfulness": 9, "user": "felicityLondon", "date": "April 9, 2007", "id": 7299829}], "location": {"country": "Egypt", "region": "Nile River Valley", "continent": "Africa"}, "stars": 5, "variance": {"poor": 14, "average": 15, "very good": 63, "terrible": 11, "excellent": 222}, "aka": "Sofitel Legend Old Cataract Aswan Hotel Aswan", "slim_ranking": 0.0384615384615, "description": "Hotel Complex encompassing famous Victorian-style Cataract Hotel & adjacent high-rise New Cataract Hotel (1963)."}