{"user_rating": 4.5, "review_count": 985, "name": "Sofitel Auckland Viaduct Harbour", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "On check in we were told very abruptly and by an off hand receptionist, that we were not booked in . I told her we were as I had checked the day before, because I didnt trust the Sofitel. I wasnt wrong. After telling her to check with reservations she returned to say she had made a mistake, and handed be a comptimentary drinks card and told us we could only order a glass of house wine and a beer. She then told us that we could only use our Accor Advantage Card in one of the restaurants, and no we couldnt have a meal in the Cafe 21 as it was about to close this was 2.45pm.(So much for international flight arrivals) Our room was small albeit with a nice harbour view that we had to pay extra for.There were dirty finger marks on the windows. We use our drinks card at 10.45pm and was told that the bar closed at 11p.m(isnt that early for a 5 star international hotel)", "title": "Very Disappointing", "user": "loveroflife40", "date": "December 29, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 188947553}, {"rating": 2.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "We went down to breakfast the next morning at 10.30 and were greeted with distain as we dared to arrive so late.(it closed at 11.am)We were shown to an outside table, after the maitre d briefly informed us of the food available.We waited for a long time for the food to arrive, maybe that was .A gust of wind lited up the unbrella next to us which smashed with such force sending all the crockery crashing to the ground. Thank goodness there was no one sitting there. The waiter came out laughing....", "title": "Good location - many service/quality shortcomings", "user": "Neil_in_Morristown", "date": "December 29, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 188916915}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "This hotel appears NOT to train its staff properly as throughout our stay they appeared nervous and stressed, presenting a very uncomfortable atmosphere, not at all relaxing or enjoyable. We will not be returning. This hotel is a very bad example of Accor Sofitel. I know they can do better, as I have stayed with the chain many times before.", "title": "Great luxury hotel", "user": "Tomcat1983", "date": "December 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 188915655}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "Spent 3 nights here for our honeymoon - was really looking forward to staying at this property on Viaduct Harbour close to so many restaurants and shops. The location of the hotel is quite good and it's also a short walk away from quite a bit of activity on Queen Street. Additionally the hotel is quite clean and has a modern, sleek look. The lobby/interior is styled very much like the W hotel brand. The concierge staff was quite nice & helpful - even charging our camera for free for us.", "title": "Nice hotel in decent location", "user": "u600358", "date": "December 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 188850361}, {"rating": 5.0, "title": "Service", "text": "Thanks Sofitel Auckland for a great stay.", "helpfulness": 1, "user": "Southerncut", "date": "January 1, 2014", "id": 189239182}, {"rating": 4.0, "title": "Quiet place in Auckland", "text": "Busy time of year bar and food service still very good.", "user": "L E", "date": "December 31, 2013", "id": 189088718}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "The people and service here make the difference .", "title": "Great room and location", "user": "GeorgieBoy1089", "date": "December 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 189061528}, {"rating": 3.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "We were very disappointed a second time in two months, that the Hotel did not honour their commitment to provide our room with an Espresso Coffee Maker. Both the times, the excuse was the same, they did not have a spare machine. We felt that we were deceived and felt that the staff don't really respect Accor Gold Advantage members. When reported, one of the Reception staff arranged to send us complimentary Cappucino coffee but when they arrived 30 mins late they were already cold and my wife wouldn't even touch it.", "title": "Not worth the Money at all", "helpfulness": 1, "user": "TravellerPorirua", "date": "January 3, 2014", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 1.0, "sleep": 5.0, "rooms": 3.0, "location": 2.0}, "id": 189428032}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "When reported to Vikram, Reception Staff at the time of Check-out, he apologised for the inconvenience caused as well as arranged for us to have free breakfast as a token of compensation. The Room is OK and sleep OK as the rooms have double glazed windows and the bed was comfy. But for nearly double the money you would pay at Copthorne Hotel, where the rooms have great views of the Harbour or Rendevous Hotel just a few blocks from the Sky Tower, Sofitel really IS NOT WORTH THE MONEY YOU SPEND FROM YOUR OWN POCKET", "title": "Lovely just lovely", "helpfulness": 1, "user": "travellinggranny89", "date": "January 2, 2014", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 189398568}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "This Hotel is not easily accessible to Auckland CBD and taxis are quite expensive to and fro. The Carpark also is bit expensive at $35/night where as in other hotels mentioned it is $24/night.", "title": "Family Holiday", "helpfulness": 1, "user": "polar75", "date": "January 2, 2014", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 189382360}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled solo", "text": "The Breakfast at $ 39 is a rip off.", "title": "Another amazing Sofitel experience!", "helpfulness": 1, "user": "aditools", "date": "January 2, 2014", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 189338670}, {"rating": 4.0, "stay_parameters": "Stayed January 2014, traveled as a couple", "text": "It is the first time my partner has been to NZ and I thought the Sofitel was a great being on the water in the viaduct basin. I called a few days in advance to secure a Marina view room which is worth ever penny. The Reception did a wonderful job getting us settled into the room. The service is top notch and the hotel is very smart in design and function. Some great things about the hotel: the cafe does and excellent coffee and food, the pool, the bellmen are awesome and of course the view. My only negative is something others have commented - no storage for clothing. Just a small wall cardboard which does not allow you to unpack. The room is huge and it does not make any sense at all. Sofitel needs to look into fixing that!!! The bathroom rocks thou! Not sure if I would stay here again by my partner loved the view and the viaduct so it was worth it.", "title": "Good Place to start a trip in NZ", "helpfulness": 2, "user": "sastudio", "date": "January 5, 2014", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 189688271}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "Stayed at Sofitel Viaduct before commencing a 4000Km Skiing Road Trip of NZ, accompanied by my Austrian private ski guide. Liked the French greeting Bonjour on our arrival which added sophistication to a stylish modern hotel. Room spacious and comfortable with separate seating for guests.Bathroom well stocked with French toiletries.Nice view of wharf and did not experience outside noise. Dined at the in-house Restaurant with guests, enjoying the food and NZ Sauvignon Blanc from Marlborough in an informal but beautiful setting. Used my Accor Platinium Advantage card for discount and also for breakfast.", "title": "Best Start for NZ Skiing Road Trip", "helpfulness": 1, "user": "Skidog33", "date": "January 4, 2014", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 189682988}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Hotel parking a bit expensive.Parking on the street over night is free. Take note of of the permitted hours.", "title": "Great location, service, and facilities", "user": "mksisler", "date": "January 4, 2014", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 189627351}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "Found the Gym, typical of most Sofitels inadequate.", "title": "Lovely short break from work.", "user": "planningourtravel", "date": "January 3, 2014", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 189460905}], "location": {"country": "New Zealand", "region": "North Island", "continent": "South Pacific"}, "stars": 5, "variance": {"poor": 31, "average": 78, "very good": 246, "terrible": 12, "excellent": 618}, "aka": "Sofitel Auckland Viaduct Harbour New Zealand", "slim_ranking": 0.038961038961, "description": "Inspired by New Zealand's landscape and culture and boasting panoramic views of Waitemata Harbour, this beautifully designed hotel is a true landmark destination.Superbly located on the waterfront in the heart of the Viaduct, Sofitel Auckland Viaduct Harbour harmoniously blends French spirit with the best of New Zealand culture. Sofitel Auckland Viaduct Harbour offers 172 chic yet luxurious rooms all with private balconies and floor to ceiling windows. Oversized bathrooms feature separate rain showers and deep soaking bathtubs. Each guest room also offers Sofitel's famous 'My Bed' and the luxury of a personal espresso machine. LCD televisions and Bose sound systems entertain in all guest rooms. Services include valet car parking, dedicated Concierge team, Guest Relations Manager, 24 hour in-room dining, fitness centre and indoor pool and Jacuzzi. The hotel restaurant offers a contemporary gastronomic experience, an alfresco cafe and Champagne bar, Sabrage."}