{"user_rating": 4.5, "review_count": 1878, "name": "Sofitel Munich Bayerpost", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "I loved this hotel, especially the spa! The cocktails in the bar are amazing! The room was spacious, luxurious and very modern. The only problem I could forsee for some is the lack of privacy. The door between the toilet and the room is glass and doesn't offer much privacy.", "title": "Amazing Hotel", "user": "Lynn.Mor", "date": "January 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 91571745}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Overally I'd say this hotel, the staff and the vicinity is excellent!", "title": "Stylish and sophisticated", "user": "paynotron", "date": "December 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 91013540}, {"rating": 5.0, "title": "Excellent Hotel", "text": "This was our first visit to Munich and we based our hotel selection on proximity to the city centre and travel hubs, as well as Trip Advisor reviews. I'm pleased to say the Sofitel exceeded our expectations across the board.", "user": "MidlandsTravelg", "date": "December 29, 2010", "id": 90987062}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Stayed here for one night with my wife and 2 year old daughter and had a perfect stay. The hotel has an off-street parking area in front of the entrance to use when checking in and out and secured underground parking, which was a plus having arrived by car. When we checked it, the front desk saw our daughter and immediately offered to put an extra bed in the room for us. By the time we got up to our room, hotel staff was already almost finishing setting up the twin bed.", "title": "Wonderful hotel", "helpfulness": 1, "user": "Torpeg", "date": "August 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117019831}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The rooms themselves are very nice, with good beds and bathrooms and are very quiet. Our room overlooked the train station but we never heard a thing. The rooms seem very well soundproofed.", "title": "Very styish hotel", "user": "MrsCrashish", "date": "August 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 117005417}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The breakfast buffet is also very good.", "title": "Magical Hotel, Designer rooms, Excellent stay", "user": "Alex v", "date": "August 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 117001367}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "I am sorry this is going to be a very short review but my husband and I only spent one night at this hotel and so I didn't really have time to experience everything about it. Overall, it was a great hotel.", "title": "Good Funk Factor, and Business Concious", "user": "keith g", "date": "August 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116990957}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I loved a ton of things about this hotel. Lots of storage space for our luggage, free wifi, a docking station for an iPhone, lots of easily accessible power outlets, nice shower and bathroom, efficient staff, had our room ready early, convenient location, and a helpful concierge.", "title": "Nice Hotel -Not For Family", "helpfulness": 1, "user": "papermom", "date": "August 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 116700352}, {"rating": 5.0, "title": "Real luxury at affordable prices", "text": "The hotel is badly placed being next to the main railway station. That said everything else is perfect. The staff are friendly and very helpful, the hotel is clean and spacious, the rooms are extremely comfortable and above all the beds are really good, unlike most hotels. The hotel is so well built that there is absolutely no sound from the other rooms nor from outside even those rooms that face the main road. Excellent - already stayed five times before.", "user": "A TripAdvisor user", "date": "December 29, 2010", "id": 90979710}, {"rating": 5.0, "stay_parameters": "Stayed December 2010", "text": "Stayed here for three nights in 2009. Can't wait to go back! Great location nice rooms ( glass bathroom may not be for everyone however!) Great leisure centre. Decor in reception/ restaurant lovely.", "title": "Great stay, gorgeous hotel!", "user": "paulc123", "date": "December 28, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 90906342}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Very nice luxury hotel in a central location next to Munich main train station. Rooms plush with top-quality facilities including an espresso machine. Excellent pool and spa. Tea/coffee was not replaced in the room after servicing and had to call for it. However, overall we had an excellent experience and would highly recommend the hotel.", "title": "Superb luxury hotel", "user": "arimfc", "date": "December 28, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90878918}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Charming hotel in Munich. I've never stayed at Sofitels before, but now I can feel the difference. It's very expensive, but very good. Food is terrific, and service is like in Buckingham palace.", "title": "sweet", "user": "monkeyshines86", "date": "December 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90280477}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "I stayed here with friends to see Munich and spend some time at the Christmas Markets. The location of the hotel was great - beside the main train station and close walking distance to the main sites in Munich. We found the staff to be very helpful and amenable with late checkout, access to the spa after we had checked out etc. In terms of ambience, the bar was great and the food/drinks list very extensive. Would receommend it - pricier than most hotels in Munich but definitely worth it if you are looking for some luxury.", "title": "Fantastic location and great service", "user": "OzJacinda", "date": "December 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 90230659}, {"rating": 1.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "We booked this hotel online, but were told that we would not be allowed to stay in a room with our two children 2 and 4 years old). Asked what we should do now, they then had the audacity to tell us that we had to get a suite AND had to pay 50 Euros extra for the second child. We traveled a lot with our children and never had an experience like this! So if you truly hate children go to Sofitel!", "title": "Kinder sind hier unerwünscht!", "helpfulness": 3, "user": "staschka", "date": "December 11, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 89553298}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "This is a stunning hotel, great location, the bed would be the most comfortable bed in the world, the staff helpful and courteous, great location next to the main train station (easy access from the airport) the atmosphere quiet and relaxing, great coffee and snack in the corner bar and a delicious breakfast. This is the hotel of choice when in Munich.", "title": "Stunning Hotel", "user": "jjaaus", "date": "December 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89553152}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "The Sofitel in Munich is excellent in terms of service, room amenities, and location in proximity to the main Munich train station (hauptbanhof). The location next to the train station is a perfect launching point to view all the major tourist sites in Munich or for travel to other nearby cities like Salzburg. The decoration motif of the rooms are modern chic, with a comfy mattress, plenty of place to put your luggage and also room to recline. They offer Hermes bathroom amenities. You can't go wrong with Hermes! The hotel has a spa as well as a bistro cafe, bar and other restaurant to dine at should you defer eating out in the city. Try the beef carpaccio at the bistro cafe. It is excellent. The chestnut risotto is also very good, but can be a little bit heavy so be ready. The staff is also very helpful and accommodating even for such a big and busy hotel. During Christmas time, the hotel has a ghluwein stall out front to mark the festivities in the city.", "title": "Stay here when in Munich!", "user": "Parabola", "date": "December 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89299333}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Check it out!", "title": "The Sofitel in Munich exceeds expectations every time", "user": "JLFERG", "date": "December 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88868245}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "It's highly recommended. ...the heated pool, sauna and spa, decor and design of the building... Rooms were very comfortable and clean. Staff very helpfull, great location! Our stay was absolutely wonderful ( that was our 5-th stay ).", "title": "A relaxing and pleasant place!", "user": "Tatia065", "date": "August 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117286842}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Although the reception staff seemed to have a bit of an attitude when we first checked in, the concierge was always quite helpful. The hotel is very close to the the train station, which is very convenient, but the streets surrounding the hotel tend to be a bit seedy.", "title": "Good location. Close to train station.", "user": "Roofustee", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 3.0}, "id": 117248587}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "Room was great. Check In and Check out work without any hasitations. Was the best dinner experience I ever had! Especially the service was great in sophies bistro. The waiter paid attention to everything and was very ploite. You could see the passion for profesion. I'm really looking forward for my next dinner their!", "title": "Sophies Bistro", "user": "Tim G", "date": "August 25, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 117223484}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The Sofitel hotel is placed perfectly around all the city attractions in Munich, Germany. The staff are very kind and helpful, always at the ready to help with a map, plus they speak a variety of languages. The breakfast at the hotel is amazing!", "title": "Perfect!", "user": "Michelle V", "date": "August 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 117139616}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "My Husband and I stayed at this hotel for three nights as part of a birthday treat for him. On checking in the reception staff were pleasant and welcoming, if rather \"stiff\"\". When we got to our room we couldn't believe how dirty the room was! The partial wooden floor was filthy and sticky. There was some sort of scum on the bathroom window, the taps and sinks were dirty, and when we decided to have a coffee, as there was an espresso machine in the room, even the cups were dirty and hadn't been cleaned! This is all from a supposed 5 star hotel????", "title": "Never a 5 Star Hotel", "helpfulness": 5, "user": "Lynn T", "date": "August 21, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 3.0, "value": 2.0, "service": 2.0}, "id": 117024317}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "Overall I had a nice stay in this very well located hotel.", "title": "Nice hotel, good location", "user": "johnc3720", "date": "December 17, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 90091885}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled solo", "text": "The staff were attentive, the room was clean and tidy but best of all was the hotel bar.", "title": "Very special hotel in great location", "user": "gafra", "date": "December 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 89884652}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled solo", "text": "We did not eat in the hotel and found that the spa facilities were fully booked.", "title": "Sofitel Munich", "user": "SeanKStewart", "date": "December 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89732360}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The hotel is next door to a main train station, there is also a taxi rank very close by so you can get almost anywhere from the hotel. The main tourist area with shops etc is only 5 to 10 min walk away.", "title": "Modern elegance and impeccable service", "user": "znkl", "date": "December 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 89555321}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "The Sofitel Bayerpost in Munich is an excellent hotel in the center of Munich, right in the vicinity of the main train station. The location offers great access to public transport . The hotel itself has a modern, luxurious and very appealing design. However, the check-in was semi efficient for a hotel of this category and took a tad too long. I was informed that the room type I requested was not available (smoking) and then in a not so friendly tone that there will be a substantial fee if I was to smoke in the room. Though I do understand that it is not always possible to get the requested room type, I did not appreciate that I was treated like an outcast because I wished to stay in a smoking room.", "title": "Excellent Hotel in Munich", "user": "redwrangler8", "date": "August 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "service": 3.0}, "id": 117510868}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The rooms are beautiful to say the least: They are simply luxurious and offer all amenities you can think of. The style is modern luxury, with plush and comfortable beds. There are hair dryers, safe, minibar, premium coffee maker (Nespresso), flat screen TV, Bose sound system with iPod docking station, free bottled water, bath robe, as well as the bathroom amenities one would expect from a hotel of this class. Even though the room was not very big, it offered a nice desk with sufficient space as well as well placed sockets to recharge your electronic gizmos. Internet access is available, but not free of charge. The bathroom was spacious and seperated from the bedroom by a glass wall, which can be blinded though. As expected the room had immaculate cleanliness.", "title": "Designer Pile Near the Central Train Station", "helpfulness": 1, "user": "steaknchips", "date": "August 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 2.0, "service": 2.0}, "id": 117506801}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "I did not use any other facilities of the hotel, as I only stayed on night. The check-out was a bit cumbersome as well and I was not necessarily impressed by the service given the two interactions I had (check-in and out). I would return to the Sofitel Bayerpost anytime though and as long it is financially viable for my company.", "title": "Great hotel close to the centre", "user": "MikeS71", "date": "August 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 117488324}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "At first glance the Sofitel impresses. It is the most handsome building on the street. The area is not particularly attractive but very safe and convenient for getting to all parts of the city, outskirts and further afield. The pleasant doorman toook our luggage. The air in the hotel seems scented which is not pleasant and we encountered a haughty male reeptionist which did not bode well. A nice girl delivered the luggage to our disappointing room. The dreary grey tones gave it a cavern like appearance which a couple of tangeine lampshades failed to uplift. Furthermore the window faced faced onto the grey opague windows of the railway station very close by.", "title": "One of the best Hotels I've visited.", "user": "Scooter_014", "date": "August 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117431739}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The bathroom would be suitable for a lone business traveller but too intimate for our taste as it is practically in the compact bedroom. It is as well that there is a separate shower as the bath is hazardous.", "title": "A stunning jewel.", "user": "IRestedMyCase", "date": "August 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117294925}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "A wonderful hotel - extemely good location and within 10 minute walking distance of the centre. The surrounding area is perhaps not the best, but the beauty of Munich is 5 minutes away. Rooms are good through rather strange bathrooms! Our room was one with a shower and you have movable screens to semi-block out the bathroom...but it is by no means discrete!", "title": "Excellent!", "user": "ChrisNI10", "date": "August 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116629885}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "The breakfasts are expensive, relatively (25 euro per person) but they are fantastic with an absolutely huge buffet catering for all tastes - and the staff are first rate!", "title": "perfect if you are travelling by train and close to everything", "user": "Sgirl001", "date": "August 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116511590}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "Really would recommend this hotel - very luxurious, central and teh staff are fantastic!", "title": "bathroom doors do not close", "helpfulness": 2, "user": "rbrendan", "date": "August 8, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 116414975}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Very modern, clean and pretty flash hotel. Five star check-in service, incredibly designed pool and sauna complex, we could have stayed in there all day.", "title": "Great hotel, great design, friendly staff", "user": "wilreynolds", "date": "August 7, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 116380128}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "Breakfast was extensive, though also pretty expensive. Hermes toilettries had me going out and buying more, smelled delicious.", "title": "The most cool hotel we´ve ever been...", "user": "RikiBrazil", "date": "August 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116352204}], "location": {"country": "Germany", "continent": "Europe"}, "stars": 5, "variance": {"poor": 60, "average": 118, "very good": 521, "terrible": 39, "excellent": 1140}, "aka": "Sofitel Munich Bayerpost Hotel", "slim_ranking": 0.0338541666667, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "The Sofitel Munich Bayerpost welcomes you in the heart of Munich. Only 100 m from the central railway station, the heritage listed building impresses with architectural class and cosmopolitan hotel culture. Design meets comfort, and French savoir vivre blends with Bavarian joie de vivre in our 396 rooms, 20 meeting rooms and the famous banquet hall. Our unique Spa Lagune and the exciting options in our restaurant, bistro and bar promise to tempt you."}