{"user_rating": 4.5, "review_count": 1232, "name": "Sofitel Marrakech Lounge and Spa", "reviews": [{"rating": 1.0, "title": "Never again!", "text": "We have just returned from a week in Marrakech. The whole experience was disappointing to say the least. We arrived at the Sofitel at 11.30am and were eventually, after finding our luggage, settled in our room at 4.10pm. The room with balcony and pool view that had been booked was not available (hotel was full) and we were given a small, dark and depressing room with no outlook. This was refused and eventually another was found and we were charged 30E per night extra. The concierge and reception staff were less than helpful. This attitude continued throughout our stay. The hotel was not in a convenient location and we were advised not to walk too far and to take taxis (inexpensive - but don't tell them that you are English because they double the fare). Breakfast was adequate; poolside snacks expensive - £10 for a meat baguette, £3.50 bottle of water/beer. Entertainment was non-existent. The hotel was overrun by 'corporate hospitality' involving large groups of suited persons talking loudly into mobile phones. The room was not serviced until late afternoon which could be inconvenient. There was no tourist information available and we were faced with a look of distain when requested some.", "helpfulness": 3, "user": "leonardoWales", "date": "March 1, 2007", "id": 6894034}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "Would we recommend this hotel? No", "title": "Sofitel perfect for a short break", "helpfulness": 2, "user": "wmv", "date": "February 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6846748, "likes": {"liked": "— Quality of the decor and the location", "disliked": "— Pool was a bit cold !"}}, {"rating": 5.0, "title": "Good base for Marrakech", "text": "Just back from 3 night stay at the Sofitel. We loved it !", "helpfulness": 5, "user": "cpth", "date": "February 26, 2007", "id": 6840385}, {"rating": 1.0, "title": "Bad Service, more concerned with appearances - very disappointing", "text": "Staff were helpful. Rooms were clean and spacious with all the extras you'd expect from a luxury hotel. We had a room overlooking the pool area.", "helpfulness": 5, "user": "HelenSKent", "date": "February 22, 2007", "id": 6829100}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "Breakfast buffet had an extensive choice of food and public areas of the hotel are beautiful.", "title": "Average", "helpfulness": 4, "user": "windquest", "date": "February 18, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 6807730, "likes": {"liked": "— Pool", "disliked": "— Noise and service"}}, {"rating": 5.0, "title": "Totally relaxing", "text": "We came here after a terrible experience at the Riad Amsaffah, and were so relieved to have found such a lovely haven.", "user": "Carrie74", "date": "October 12, 2006", "id": 5944728}, {"rating": 4.0, "title": "luxury but poor service", "text": "Despite being a large corporate hotel, we were greeted very warmly, and accomodated immediately. The pool was beautiful, and a great haven under the umbrellas when it was too hot to be in the Medina.", "user": "dva", "date": "September 27, 2006", "id": 5882216}], "location": {}, "stars": 5, "variance": {"poor": 67, "average": 99, "very good": 357, "terrible": 34, "excellent": 675}, "aka": "Sofitel Marrakech Lounge Hotel Marrakech", "slim_ranking": 0.450331125828, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Surrounded by a splendid garden and fountains, Sofitel Marrakech is a premier Marrakech Morocco hotel. Its 346 Marrakech hotel rooms offer terraces or balconies with views of the mountains, swimming pool, or gardens. Guests at this luxury hotel in Marrakech, Morocco, will enjoy restaurants serving local and international cuisine, 3 bars, a nearby nightclub, a poolside snack bar, 3 bars, an indoor swimming pool, a fitness centre with a Jacuzzi, and a Turkish steam bath and gym."}