{"user_rating": 4.0, "review_count": 679, "name": "Sofitel Bora Bora Marara Beach Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "We absolutely adored the Sofitel Motu. Our overwaterbungalow was amazing, we stayed in Bungalow 114 and beautiful views. We felt we had lots of privacy, there was lots of room in the covered terrace and the open terrace. We were able to jump off our bungalow into the water (although they aren't too crazy about guests doing that hee hee) The bed was so comfy, the glass covered coffee table was so cool, the bathroom was divine. I can't wait to come back to this place!", "title": "Perfect Honeymoon Resort", "helpfulness": 19, "user": "bojomania", "date": "July 25, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3698804}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "We opted for a private beach dinner and were serenaded by a polynesian guitarist and a singer, it was so romantic.", "title": "Romantic resort with a lot of bora bora feel in it", "helpfulness": 24, "user": "128", "date": "July 4, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3634126}, {"rating": 5.0, "title": "chillin' on the motu", "text": "The service is impeccable, the grounds are beautiful, I think it is the best hotel in all of Bora Bora.", "helpfulness": 10, "user": "wanderingNorwegian", "date": "June 13, 2005", "id": 3549381}, {"rating": 3.0, "title": "I didn't stay here but...........", "text": "We love that Sofitel Motu is very small resort (30 bungalows) on Private Island. We get views of Mt. Otemanu, other motus, and reef. We liked to walk to the top of the motu to look down at lagoon and we saw about four shades of blue, very beautiful. Kayaking is another great way to explore around motu and lagoon.", "helpfulness": 3, "user": "colmaboy", "date": "May 23, 2005", "id": 3495138}, {"rating": 5.0, "title": "Dream Honeymoon", "text": "We loved this hotel. You arrive with the sound of a conch shell blown by a staffer, Max. Tepoe, one of the managers and Max greeted us with flower leis, coconut drinks out of genuine coconuts, and ukulele music and singing. Our baggage was whisked away to the room and we were shown around on our way to room 117, that had a direct view of Mt. Otemanu. This resort, in our opinion, has the best view of the main island.", "helpfulness": 40, "user": "rodjune", "date": "March 17, 2005", "id": 3283370}, {"rating": 3.0, "stay_parameters": "Stayed November 2005", "text": "We spent a week at the Sofitel Motu. The setting is absolutely wonderful. However I feel I need to warn others who may be afraid of bugs---there were roaches or beetles in our room. Maybe there were things we could have done to minimize them---like keep our sliding glass door shut at night---but it was hot!", "title": "Gorgeous view", "helpfulness": 10, "user": "peyton53", "date": "December 12, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 2.0}, "id": 4236740}, {"rating": 2.0, "title": "Never again", "text": "I even found one hiding on the toliet paper. Good luck!", "helpfulness": 16, "user": "A TripAdvisor user", "date": "October 31, 2005", "id": 4076236}, {"rating": 1.0, "stay_parameters": "Stayed April 2004", "text": "Sofitel was not very good at all. Sofitel Motu considers themselves a 4-5 star hotel when I would consider them more like a Motel 8 or 1/2 star hotel. For the amount of money that we were paying we stayed in a bungalow with cockroach bugs and had to sleep with the lights on to keep them away. When we called and asked them to do something about it they said they would come spray the bungalow and then never did. According to another forum someone else stayed in same OWB that we did and had same problems. Nothing was ever done about it. So we paid all that money to sleep with cockroach bugs. Then in addition the Sofitel has very bad food and drinks. Not just breakfast meals but even lunch and dinner too. When you are remote on Motu it makes it that much harder when every meal you have to go off the island to eat. We also had to call on a daily basis just for towels. Drinks were not even good enough to drink. While we were there it was very hot so either we had to have the AC on or full breeze (which in Bora Bora is very windy). Either way the bathroom area was too hot to get ready without sweating profusely. The AC just did not work well at all. The AC was also an attempt to prevent more bugs entering room but it did not work well.", "title": "Never Again", "helpfulness": 26, "user": "Binny37", "date": "October 16, 2005", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 3.0, "service": 1.0}, "id": 4026850}, {"rating": 5.0, "title": "Perfect!", "text": "We stayed at Motu in Jan 2004 (so I appreciate things may have changed). We were on our way home from New Zealand to England and stopped for 4 nights on Bora Bora. We initially booked at the Marara, but having got there and being extremely disappointed, we decided to \"upgrade\" to the Motu. The accomodation I will admit was quite nice. We stayed in an overwater bungalow, and the snorkelling off the deck was excellent. The problem we had with this hotel was more with the absolutely appalling service we received, bearing in mind we were paying £600 per night. Firstly at breakfast, they served us tea, but no milk. I eventually found somebody on reception to go and get some milk, and they bought it out in a tea cup(not easy to pour!) The tea pot had a nasty crack down it which was black (revolting). We had melon, which had obviously been hanging around for a while as it was slimey and mushy. The bread in the basket was wet, and half of it was missing as they had run out. The service in the restaurant in the evening was not much better. One day they took the towels from the room and didn`t replace them, so I had to ring a few times for them to eventually bring us new towels. Another day they did not restock our cups, tea or coffee. I phoned three times for them to bring us clean cups etc, and nothiing appeared. I eventually went to the reception to complain. The woman on reception threw a sulk and stormed off into the kitchen basing and crashing cups around and obviously swearing about me. Also, one day one of the hotel staff just let themselves into our room, no knocking, nothing. I was gob smacked. No apology or anything. Said she was checking something and them disappeared. There were several other incidents which we found unacceptable. We found most of the staff to be sullen and rude. We paid £600 per night for this hotel, and I wouldn`t pay £60 per night. Yes the location is idyllic, but I would not go back if you paid me. We did raise our issues with the hotel manager, and to be fair she did agree that they were having problems with the attitude of some of their staff/ service and she agreed to refund one night accomodation which we accepted", "helpfulness": 7, "user": "angel h", "date": "October 5, 2005", "id": 3993499}], "location": {"country": "French Polynesia", "continent": "South Pacific"}, "stars": 4, "variance": {"poor": 71, "average": 87, "very good": 185, "terrible": 50, "excellent": 286}, "aka": "Sofitel Bora Bora Marara Beach And Private Island Hotel Bora Bora", "slim_ranking": 0.722222222222, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Sofitel Bora Bora Marara Beach Resort is located on the island of Bora Bora in the heart of the exceptional Matira Bay. The island of Bora Bora is encircled by a protective necklace of coral. Breathtaking lush mountains provide a dramatic backdrop for the luminous turquoise, lapis and aquamarine of the sheltered lagoon. There is something truly unique about Bora Bora, with its sugary sands, rugged mountains, vivid blues, lush greens and soothing lagoon waters that make it the most romantic destination in the world."}