{"user_rating": 3.5, "review_count": 698, "name": "Sohotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "I recently stayed at this hotel. The staff was friendly and extremely helpful, they went above and beyond with their help and suggestions. The room was beautifully furnished and very comfortable. Great location, would recommend to all my friends and family.", "title": "Amazing stay", "user": "talidavid", "date": "January 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 149093691}, {"rating": 1.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "There is not one good thing I can say about this place. The rooms are tiny, the building is old and therefore noisy. It's as if you sleep with the people next room. The bed was old (leaned on one side). The window didn't close well and I had some air coming in (it was freezing cold) + the noise of the street. The pillows were so old and dirty that I first thought it was my pillow cases that were dirty and asked for new ones. But I soon realized the bad smell and the yellow color were coming from the pillows. The hotel is far from everyhting (but that I could have checked better before going). The rates were incredibly high and not competitive at all, I hesitated to change but feared to lose all my money. And last, the complimentary tea and coffee are ridiculous: only lipton tea (no choice, earl grey, darjeeling, green. A minimum!!!) and only coffee (no decaf coffee).", "title": "I hated this hotel.", "helpfulness": 1, "user": "colocalifornia", "date": "January 5, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 148891591}, {"rating": 1.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "I hated it since the beginning and until my sixth night and my departure. I had asked that they wake me up at 4:45 AM and they came 5 min late. Then the taxi they had booked for me was late too. After ten minutes I decided to stop a cab on the street instead of waiting for their limo which was \"stuck in traffic\" said the manager to me (at 5 AM!!!! I didn't see any traffic of course when I went to the airport with the cab).", "title": "If you get a hotel for sleeping...don't stay here!", "helpfulness": 1, "user": "IMKristaB", "date": "January 2, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 148621371}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "This place is tiny, expensive, noisy, far away and old. Don't go.", "title": "Great location, tiny, tiny room!", "user": "rackops51", "date": "December 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 148092300}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "Great area, fantastic value (especially for new York), the staff were outstanding, loved staying at the sohotel, would recommend it to anyone.", "title": "Fantastic", "helpfulness": 1, "user": "kyliegeelong", "date": "December 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147979768}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "We stayed for a week and the service was fab, close to cares and bars, great little supermarkets to get cheap bagels and coffeesda, also really close to a a laundry mat, little Italy and china town on your doorstep, a quick 2 minute walk to the subway.", "title": "Great place, Excellent Location!", "user": "Ione C", "date": "December 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146774739}, {"rating": 3.0, "stay_parameters": "Stayed December 2012", "text": "I recently stayed at this hotel and had an amazing time! The staff was so friendly and accommodating! The location is so amazing! It was easy to get to where we needed to go. I didn't even need to rent a car, everything was in walking distances or a quick trip on the subway! I would stay here again and again!", "title": "TINY room in refurbished Bowery Walk-up", "helpfulness": 2, "user": "tonyvski", "date": "December 3, 2012", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 146713440}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "I love New York City, and I understand and appreciate the lifestyle compromises we make to live in our most densely populated urban areas. So, it came as no surprise that our room at this otherwise nicely (albeit garishly, post-hyper-trendily) rehabbed 4-floor walk-up Bowery hotel was TINY. And, yes, this hotel's name should more accurately be the Soho-adjacent-el as it is located more on the Soho/Bowery periphery. But, I was aware of and actually prefer this location. Just be forewarned that even though it is very close (just a few minutes stroll) from the center of Soho, the hotel itself is more on the fringe.", "title": "Nice, if you have a quiet room . . .if not, go to the other place!", "user": "Hana K", "date": "November 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 146168467}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "I would like to have given the hotel a better rating because it is clean and safe and convenient, but I can't--not just yet--because there are some flaws that I hope they'll work out soon.", "title": "How to cope in a crisis.....", "helpfulness": 2, "user": "VincefromUK", "date": "November 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 145800550}, {"rating": 1.0, "title": "Dicey at best", "text": "For a last minute 1 day trip to NYC, for which I refused to spend app $250/300 for a single nite (which was what I was coming up with in addition to striking out on Priceline), this place near the neighborhood I needed to be in came up for around $100 (which as a 10 year resident of the city I knew full well was way too cheap for Manhattan.)", "helpfulness": 2, "user": "A TripAdvisor user", "date": "December 7, 2004", "id": 2867044}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "I stayed here this week since thanks to hurricane Sandy I am still currently homeless. My boyfriend's company has been trying to help us out and gave us a strict budget to work with...and Sohotel was the only hotel in this price range that was available this week.", "title": "Nice location...but bugs", "helpfulness": 1, "user": "MissKris626", "date": "November 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 145522864}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Considering how much we paid per night, and the great location of the hotel, it was a pretty decent deal. The room was pretty small....the bathroom was somehow even smaller than the bathrooms I've had on cruise ships (which are pretty dang small). And I found a couple of cockroaches. Bugs are a big \"hell no\" for me, but considering I didn't really have a choice in where to crash for the night I really can't complain. So even though there are some big negatives, the service was pretty great (the receptionist allowed us to keep some food in their employee fridge which I thought was really nice), and the location is right next to some great stores, restaurants and bars...so you're never really in the hotel anyway!", "title": "Great location", "user": "Theboyz T", "date": "November 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 145423346}, {"rating": 3.0, "stay_parameters": "Stayed November 2012", "text": "This hotel is in a great location. Nice rooms, average size by New York standards. If you get a deal exceptional. This is way better value than the trendier James around the corner, but a BIG corner.", "title": "Soho and close", "user": "ARLR77", "date": "November 10, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 145066940}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "1 train and A C E trains steps from your door.", "title": "More than ur money's worth", "user": "pucha13", "date": "November 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 144837059}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "Bar is noisy, younger and trendy. Not a standard hotel bar.", "title": "Happy Getaway from Finland, even happier to get away after Sandy.", "user": "Kurviska", "date": "November 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 144539175}, {"rating": 1.0, "title": "Beware! Stay Away!", "text": "There's nothing good in this hotel. Dirty, painting falling down the wall and extremely noisy. For sure the smallest room and bath i've ever encountered in the world. At 6 am you won't be able to sleep anymore: hotel staff start to work and as the door don't close properly the noise become terrible. I've stayed in December and the heater warmed too much and there's no temperature control. Result: i were obligate to sleep with open window!!!!????!!!!! For the same price you'll find many better options.", "helpfulness": 3, "user": "hlevenst", "date": "May 19, 2005", "id": 3488289}, {"rating": 4.0, "title": "Great Hotel for Budget Travelers", "text": "My boyfriend and I stayed at the Sohotel from April 29-May 1st, 2005. I was nervous because of all of the negative reviews I was reading. My main concern was safety in the neighborhood/hotel. The rooms seemed safe to me, as they had a strong bolt in addition to the handle lock. When we checked in we were allowed to see the room before paying. We had room 309 and it was more than adequate for a cheap place to stay in NYC. It was clean, the bathroom was much better than I expected and we even had maid service. There are towels provided, but I suggest you bring an extra pillow. We only had one to share the entire weekend and requests for an extra pillow fell on deaf ears. If you don't sweat the small things like that, you will definitely be satisfied with this hotel. (We had hot water and the t.v. picked up many channels, although not cable). We also had a nice view over the Bowery intersection. Vending machines are also in the downstairs hallway. We came down to see a show at the Bowery Ballroom and this hotel is one block away if you are interested in that venue. I would stay again, seeing as the price was so good! (Just a note: there is a $10 deposit for the room key which you get back at the end of your stay and the room taxes are about $15/night). If you call the hotel directly you may get a better nightly rate (ours was $89/night, compared to $99/night online). Hope this review helps!", "helpfulness": 14, "user": "A TripAdvisor user", "date": "May 2, 2005", "id": 3433179}, {"rating": 2.0, "title": "Not good, But tolerable", "text": "i was with a tour group going through the east coast of the US, and our stay in the sohotel (14/4 - 17/4) was somewhat interesting.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "April 21, 2005", "id": 3395279}, {"rating": 1.0, "title": "Ahhhhh!", "text": "half of the time there was no hot water, \"renovation\" was being done on the building, even though it didnt change during our stay, they had signs up notifying that water would be out between specific times. if you want to walk anywhere its a long walk to any of the major attractions, like the ferry to the statue of libertey, times square and the empire state building. and even though it is a couple of minutes walk from the subway, it can be confusing for a tourist to take the subway, our tour group got lost several times. i came back one night to find my luggage all messed up, as though it had been searched through.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "April 10, 2005", "id": 3348719}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "First of all I have not experienced this incredible noise. This hotel is located in a city with millions of people and whose windows are not super soundproof ... apart from that:", "title": "read it all !!", "helpfulness": 1, "user": "marco.to", "date": "January 28, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 150839857}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "I had a nice room on the reception level (first) it was very large, with two double beds and one single. the room was well-kept and very clean. the bathroom old but clean. the only real drawback I found at night: i slept in a fridge.....! There was only one small radiator. the second night, after having pointed out, the hotel gave me an electric heater that has fully resolved the situation. In front of the room there are the vending machines and ice machine ... were a bit 'noisy. There is free wifi in the rooms, in the lobby and in the restaurant (which is not directly part of the hotel) on the ground floor. They also provide free tea and coffee in the lounge. coffee is really bad.", "title": "Splendid Time! Stay here!!", "helpfulness": 1, "user": "Scott-fan", "date": "January 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 150223760}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "Overall I would say that the hotel is nice they are also carrying out various refurbishment. As others have said at the ground floor there is a restaurant that is not anything special but it is certainly convenient and also serves Sunday brunch.", "title": "Good value stay for girls on shopping wekeend!", "user": "IdaSweden", "date": "January 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 150091193}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The location, in contrast to what has been said by others, I think it's very appropriate. one block is the line J, and is close to many restaurants some of them are also not 4 tourist.", "title": "Cute, Cozy & Comfortable.", "helpfulness": 1, "user": "Sharonila", "date": "January 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 149102909}, {"rating": 1.0, "title": "A comfort bed but no hot water", "text": "The only thing I really ask for in a hotel is for it be clean, the bed be comfortable and to have a hot shower in the morning. Well this didn't happen at the Sohotel. We stayed 2 nights and the first morning we had a trickle of warm water in our shower and only warm after 15 minutes of running the water and then the next morning no hot water whatsoever, not even a trickle. We had friends staying at the same hotel and the same morning we had no hot water, there toilet wouldn't flush although they did have the trickle of hot water. When we were standing in the lobby to leave we heard the front desk tell someone they had 5 toilets backed up that morning.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "March 21, 2005", "id": 3291432}, {"rating": 2.0, "title": "Great until something goes wrong", "text": "The beds were clean and comfortable and the rooms adequate but the water was a big problem and that had never been mentioned in any of your reviews.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 21, 2005", "id": 3291005}, {"rating": 3.0, "stay_parameters": "Stayed February 2005", "text": "We will never stay here again..", "title": "not as scary as the reviews", "helpfulness": 12, "user": "Colborne", "date": "February 21, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 3214372}, {"rating": 2.0, "title": "First impressions...", "text": "My husband and I stayed here March 19th for one night. The location was great -- close to Soho, Chinatown and Little Italy. The room was clean and the price was great. However, the water went out sometime in the early morning and many people in the hotel didn't have showers or toilets that worked. Everyone was understandably irate, but the management's only response was \"Sorry, someone is coming out to work on fixing it. Come back and stay with us again.\" Needless to say, I will not be staying with them again.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "December 14, 2004", "id": 2879924}], "location": {"country": "United States", "city": "New York City"}, "stars": 2.5, "variance": {"poor": 59, "average": 144, "very good": 254, "terrible": 91, "excellent": 150}, "aka": "Sohotel Hotel", "slim_ranking": 0.589164785553, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.0}, "description": "Sohotel in New York has a great location and great prices. Located in the center of downtown our hotel is comfortable, clean, and charming. We offer a great way to visit NYC and our commitment to customer satisfaction is our #1 goal."}