{"user_rating": 5.0, "review_count": 529, "name": "Sojourn Boutique Villas", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "This is a very special place. One of the most unusual places we've stayed in. This was sadly just an overnighter for us, but I know we will be back very soon. We decided to stay in Sojourn on our last night in Cambodia - mainly because it has such rave reviews on tripadvisor, but also because we loved the idea of the 'destination dining' experience to celebrate our wedding anniversary. If this is your first destination in Siem Reap you may feel a little uncomfortable with the location - but have no fear! Although It feels like it's a million miles from anywhere, it's actually not that far from the main area of Siem Reap and tuk tuks are very cheap and plentiful. The villas are simply furnished but spotlessly clean and very tastefully adorned with flowers and nice touches here and there. The floor and walls are constructed of 'polished' concrete which works really well - I've never seen this before in a hotel / villa, but it makes for a very attractive and stylish room design. We had time for a massage here, and the two girls were an absolute delight and very good at their job. Their English isn't the best, (but much better than my Cambodian!) but we had such good fun and giggles with the language barrier - and the massage is as good as any I've had in a top quality European resort / hotel. At the time of writing there is no spa, but I believe there is an intention to build one soon, so at the moment the massage takes place in the comfort of your room. There aren't too many rooms at Sojourn so the place immediately takes on a very cosy and intimate atmosphere. The pool is probably one of the cleanest and best kept pools I've ever seen. Living in Queensland we know how difficult it is to keep the pool and water so crystal clear and clean during the rainy / humid seasons. You really have to get the balance right with the chemicals - but these guys must have a wonderful pool maintenance man who I would definitely like to borrow! Whilst here, we opted for a walk of the local village, which is a very humbling experience, something everyone should do. I would love to have met the owners of Sojourn but they were overseas at the time, but it is evident from their involvement with the local village that they are very kind and charitable people. The highlight of our stay here was the 'destination dining' experience. WOW!!!! Now... we are massive foodie fans, but being in Cambodia, our expectations weren't too high. But the idea of our own private pavilion, private chef, waiter and musician was just too much for us to pass by. And the food?? FANTASTIC! The setting was just absolutely stunning. It's pitch black, but you're surrounded by candles and every now and then you can catch the fireflies flickering around you. There's frogs croaking and fish leaping out of the water (catfish we think!). This was a very private affair for us and one of the most romantic meals we've ever experienced. The waiter was top class, very charming and his timing was always absolutely perfect. This experience doesn't come cheaply by Cambodian standards, but is worth every penny and costs FAR less than a regular quality meal in Australia or Europe. Just one word of warning - the pavilion setting is a short walk from the hotel, but it's pitch black. You are led to the pavilion by torchlight, but don't wear heels like me (God knows what I was thinking at the time!!) We left very early for our flight home the next day so we missed out on breakfast, but the reception staff had made us some lovely sandwiches to take with us. The hotel's driver was unlike any we'd experienced in Cambodia - his car was immaculate and his driving was cool, calm and collected. Very rare indeed. The driver's English was fantastic too. We can't wait to come back to this place and spend a few days. It's not the cheapest, and it's not the best located, but it honestly doesn't matter because the experience is second to none. Whilst we were in Siem Reap we spent a few days at Golden Temple Hotel too - another fantastic place (see my seperate review) and also 3 nights at Raffles (very nice - but bedrooms definitely in need of refurbishment) so if you want the best of both worlds and have at least 5 days in Siem Reap then I would recommend you split your time between Golden Temple and Sojourn. They are VERY VERY different but equally special in their own seperate ways.", "title": "WOW! WOW! Can't wait to come back...", "helpfulness": 1, "user": "destinationqld", "date": "July 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115230944}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Loved everything about Sojoune Villas, from the location to the very helpful, friendly staff, the fantastic restaurant. The Manager likes to be called Basil, but is nothing like Basil at Fawlty Towers!!!", "title": "We wanted to come back and hadn't even left yet!", "user": "BHP534", "date": "July 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115138618}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "We stayed at Sojourn for the 2nd time, after a previous visit last year around the same time.", "title": "Perfect Stay - Again !", "user": "MnEtravels", "date": "July 7, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 115123479}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "This place is still a gem, a refuge in the middle of the countryside - only 10 minutes by tuk-tuk from Siem Reap town.", "title": "Topspot!", "user": "susiqsc", "date": "July 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115030239}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Not only an oasis of leisure and quiet, also great food, very friendly and personal service from the staff, intimiate small scale, so no groups of tourists.", "title": "A hotel doing everything the right way, you miss an experience if you don't stay here", "user": "titanwiz", "date": "June 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 114859173}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "This was one of the best resorts we have ever stayed in. Beautiful rooms, loving staff and responsible tourism makes this place unique. We took a cooking class that was not only affordable but delicious! The Angkor Wat tour was affordable and thorough with a guide who spoke English. Right From the moment we arrived we felt pampered. Massages are a wonderful option and the atmosphere will make you glad you didn't stay in the city. It's worth every penny.", "title": "Luxury and Experience of a lifetime", "helpfulness": 2, "user": "jmagee1985", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 116159652}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "really a place to stay! Rooms with a simple yet meaningful design, flowers from the large garden scattered in subtle touches in all areas of the hotel. Staff is always smiling and well trained and the manager is very helpful. Aplace to recommend for couples as well as families.", "title": "lovely staff in a wonderful place", "user": "flo1905", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 115957138}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We stayed here for 2 nights as part of our 3 week stay in South-East Asia and wow, it was incredible! First of all, the service was incredible right from when we booked our trip with helpful emails helping us to arrange trips to the temples and destination dining. We stayed at a cheaper hotel for one night as we flew in at 6pm and then were getting up at 5am for the temples but a Sojourn tuk-tuk driver picked us up from the cheaper hotel, took us out to the temples (all incredible) and then back to the hotel to pick up our bags and took us to the Sojourn, all for about $11 - great service! The staff were all so helpful, smiley and friendly.", "title": "Wow! Truly the best hotel in Asia!!", "helpfulness": 1, "user": "MU28traveller", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115900185}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The hotel is set just outside of town which is nice as you get to experience the 'real' Cambodia, we went for a walk in the village one morning and got some awesome photos of the smiley locals, cows, rice paddies etc but the best part was going to the Pagoda where a friendly monk (in an orange robe) showed us around their temple! It was a highlight of the trip, there is the oldest temple in Cambodia there, the practice to Angkor Wat and we got some great photos, he also introduced us to the chief monk and practiced his english with us! So definitely take a walk around.", "title": "An oasis in Siem Reap.....", "user": "TravelCollins", "date": "July 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115709908}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The villas are set around a gorgeous pool with a swim up bar, we had lunch there one day and there are some lovely sun-beds to relax on. The villas themselves are incredible, we booked a temple villa that had a bath and an outdoor shower. They also give you a stack of books in your room to read or exchange which is nice. They do a chocolate turn down service every evening (although they leave the chocolates in the fridge so make sure you check there!) and one night left petals in our sink and in the shape of a heart on our bed which was a lovely touch!", "title": "Gem in Siem Reap....We loved it and want to return ASAP!", "user": "AlohaLadyHonolulu", "date": "July 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115625537}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We just departed Sojourn a few days back on our Cambodia expedition and could have not been more pleased with our TA based selection. You all know the perils of planning from a distance and hoping the folks here are accurate in their perspectives. This gem was as wonderful as I hoped and the gratious staff went far beyond my difficult expectations to provide exemplary, world class service and facilities. All for a hundred bucks a night inclusive of too much to mention here! You get what you pay for and if you don't mind an idealic location 10 minutes out side of the mayhem of Angkor and down a dusty dirt road then give this piece of Nirvana a try. Pool, massages, food, transpo, tours, smiles and value were all outstanding- They set the standard for the rest of our trip!", "title": "This Gem is world class!", "user": "dreemin2", "date": "March 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 98714512}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled solo", "text": "Overall, I would rate this hotel very highly. To be honest, the hotel is an oasis in Siem Reap. While a little off of the beaten path, it is definitely the suggested path to take. A short $5 ride (with a driver that stays with you) to town allows you the connection to the town and the bars, while missing the noise and people of Siem Reap.", "title": "Fantastic oasis with good service and better food", "user": "Jsoucek", "date": "March 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98494724}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "A couple of highlights, the food is fantastic. The breakfasts are great, and I doubted that they would be that good beforehand, but upon experiencing two of them, they truly are fantastic. Probably the best breakfasts that I have had in all of my travels in Asia.", "title": "Can't go wrong here", "user": "Glembidor", "date": "February 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97665390}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "A couple of notes worth knowing:", "title": "Truly wonderful and unique. This is a very special place.", "user": "juliefromhadleigh", "date": "February 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97661100}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "1. From the airport, it is about a 15 minute drive. The first third is on a paved road through town, no problem. The next two thirds go down non-paved roads with a couple of turns that may make your heart jump as one is a blind curve. At this point, I did ask myself, what did I get myself into. Again, no worries, right after the turn you turn into a walled compound that is great.", "title": "Heavenly poolside oasis away from the noise and big hotels", "user": "Fi_and_Matt", "date": "February 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97380836}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "The dirt track might at first seem a little alarming but the remote location is part of the attraction. A beautiful boutique hotel with a very personal and friendly service. We stayed 3 nights, we regret we are not here for a week. We would love to return again soon.", "title": "A peaceful and serene real Cambodian village experience in a beautiful hotel.", "user": "Dale_and_Sam", "date": "June 28, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 114820430}, {"rating": 5.0, "title": "oasis", "text": "Previous reviewers sum its up. Out of town in the middle of a country village area. Having said that everything is close to the city here as its not particularly big. An easy 10 minute drive from the airport and efficient pick up", "user": "ziggystar", "date": "June 20, 2011", "id": 114484441}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Rooms are impressive. Large, immaculate and huge comfortable beds and very large bathroom. Lots of private areas.", "title": "Terrific stay", "helpfulness": 1, "user": "auntkake", "date": "June 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114025871}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Pool is fantastic with a great swim up bar.", "title": "Dream Stay on a Dream Place", "user": "HellPacific", "date": "June 17, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114012048}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "Food very good however there is lots of great food in the city as well.", "title": "Flawless", "user": "Unclechapchap", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 113333853}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Sojourn Siem Reap was fantastic. The rooms (villas really, we were in number 4), the pool, the restaurant, the landscaping - all were clean and beautiful. The staff were amazing, from the moment we arrived at the airport and were greeted with our driver, to walking through all of the tours we'd chosen when we checked in, to any questions that we had during our stay - even allowing us a later breakfast than expected when we spent more AM time at the temples than expected. We booked an English speaking driver for 2 days and a guide for 1, and both were extremely friendly and helpful. The hotel is near the Treak Village, which we walked to/near during the evenings and saw very picturesque rice paddy fields and life in Siem Reap.", "title": "Our favorite hotel in SE Asia", "helpfulness": 1, "user": "Alybyzrp", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116958373}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "There is no question - if you are in Siem Reap, stay here.", "title": "FANTASTIC", "helpfulness": 2, "user": "caroline s", "date": "August 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116891755}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "A truly brilliant hotel. We were here in July with our ten month old girl. The rooms are really lovely and include a turndown service. The food is excellent and includes a different special every day! The staff are wonderful and knew all our names. We had the same driver to the temples everyday and he was wonderful. This really is the place to be in Siem Reap. I think a spa will be opening soon in the Soujourn which will be a great addition. We were so pleased that we chose this hotel ... definitely give it a try!", "title": "Amazing hotel - highly recommended", "helpfulness": 4, "user": "kataliahl", "date": "August 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116878670}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We stayed at the hotel for 3 nights when visiting the temples. The Hotel is a 15 min ride from the city centre / Angkor Wat by Tuc Tuc, which you can hire at the hotel for $3 (all night) or $15 (full day). We really enjoyed the peaceful environment of the hotel and after long days visiting the temples staying in a hotel away from the crowds proved to be the right thing for us. Rooms are spacious and clean and there is a very nice swimming pool area. Food at the restaurant is amazing and not overpriced, so we ended up eating in 2 out of 3 nights. Staff is also super friendly and very efficient in organizing guides, tuc tuc etc. I can only recommend this place.", "title": "Follow the bumpy dirt road...", "helpfulness": 2, "user": "ZabierekR", "date": "August 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 116684999}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "About 15 minutes after being picked up at the airport, my husband and I found ourselves wondering what on earth we had gotten ourselves into. The representative from Sojourn Boutique Villas was driving us further and further away from \"civilization\" while trying to avoid gaping muddy holes on a narrow dirt road. Then suddenly, like Brigadoon rising from the mist, we caught sight of a gleaming white wall - the main entrance to Sojourn Boutique Villas. Stepping out of the car and being greeted (by name) by the thoughtful staff, we began to indeed realize what we had gotten ourselves into... a little slice of paradise.", "title": "The best staff anywhere", "user": "Dion S", "date": "August 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116601051}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "We were truly pleased to stay at the Sojourn from our pickup at the airport to our drive to Phnom Penh. Everything was well done, well thought out and unique. We are also not the typical tourists who like to be coddled, we also enjoy roaming around on our own.", "title": "Clever Package", "user": "JC505", "date": "February 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95453620}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "We did take the Sojourn up on their offer for guided tours of Angkor Wat, and were delighted. We had the same driver from the airport to our last day, and he was super. Had a great sense of humor, was clear and seemed happy to be with us. Not many drivers take the time to also be comfortable with their guests. Our guide was top notch, we liked him so much that we asked for him for an extra day. (I am horrible, and I am so sorry to them for not remembering their names).", "title": "Awesome Hotel and Awesome Service", "user": "jet2dresq", "date": "January 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94956982}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Our driver was rather flexible and allowed us the freedom to make minor changes to our itinerary. The biggest was changing our sunrise visit to another day, so that we could go that night to the Water Festival being held in Siam Reap. What a pleasure it was to visit, and experience this most important event.", "title": "Paradise in Siem Reap", "helpfulness": 2, "user": "treju", "date": "January 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94800343}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "We also rented bikes from the Sojourn and toured around on our own. We also rode the bikes at night, and they were more than happy to find us flashlights to use. We never felt unsafe or lost, and was a great adventure.", "title": "1st Class Accommodation In A Peaceful Rural Setting", "helpfulness": 1, "user": "1Jayne", "date": "January 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94536952}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "We truly liked the fact that the hotel was away and somewhat remote. It allowed us the luxury of escaping the hustle and bustle of touring the Sites and Siam Reap - a bit of an oasis.", "title": "Hidden garden spot away from the city; outstanding staff.", "helpfulness": 1, "user": "Charlie Sierra", "date": "January 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 94385695}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We had 7 perfect nights at Sojourn and could have stayed much longer. ALL the staff are amazing,so helpful and friendly ( without being intrusive) the food is wonderful and the sunsets from the \"terrace\"room are stunning. There is nothing more to be said that hasn't already been written, and wants more it's all true!!!!", "title": "Absolutely the only place to stay in Siem Reap", "helpfulness": 1, "user": "welltravelled039", "date": "January 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 93112804}, {"rating": 5.0, "stay_parameters": "Stayed December 2010", "text": "Anthony and Fiona's dedication to improving the lifes of the local villagers is amazing and by taking part in the village tour and the cooking class, which by the way was great fun, you to and have a direct impact on the lives of the local people.", "title": "Even better the second time around", "helpfulness": 1, "user": "radvani", "date": "January 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 92615887}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We rarely vist anywhere twice as the world is too big a place, but we are already planning a return trip later this year.", "title": "Stunning.....", "user": "asiarocks67", "date": "January 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92309365}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "I booked my second stay at the Sojourn thinking I'd know what to expect. I was wrong! For the second time, Sojourn exceeded my expectations.", "title": "Of all the hotels I've stayed in 64 countries, Sojourn stood out as the best", "user": "DanSchlesinger", "date": "January 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 92123835}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "This trip was with my family for 5 days during Christmas. We booked 2 Apsara Villa rooms, which are comfortable & extremely spacious, with a lovely stone bathtub in the toilet.", "title": "A Botique Hotel with a difference", "user": "Beans52", "date": "January 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91925904}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "My family stayed at this hotel 3 nights. After the days we were there we understood quite well about it. It had a group helpful and friendly staff. When we came the staffs welcome us very warmly. The room was very clean and was decorated modern facilities.Staying in good room we always feel cozy and safe. The location is very comfortable to go shopping and to visiting. I would highly recommend this hotel.", "title": "Very good !!!", "user": "Mooreconnor", "date": "February 18, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 97065560}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "I and my honey had a sweet honeymoon at Sojourn Boutique Villas when we came to Siem Reap - Combodia. A nice hotel with 10 private villas, good accommodations, friendly staffs and excellent services. I really missed the time after travelling, we watch sunset together, We imagined the day sinks into the palm trees. Besides this hotels also provided a \"cooking classes\", with only 22$/person, we were taught to make a Cambodian dish and enjoyed our it at the end. That make our honeymoon too amazing and memorable. And I'll suggest Sojourn hotels to my friends.", "title": "Sweet place makes sweet honeymoon", "user": "romainthomas90", "date": "February 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 96815397}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "I have been to Siem Reap before (10 years ago)", "title": "Beautiful poolside villas outside noise/congestion of Siem Reap", "user": "CalifTravelBuddy", "date": "February 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 96087576}, {"rating": 5.0, "stay_parameters": "Stayed January 2011", "text": "It is now a noisy/congested town now with many hotels and tour buses.", "title": "Absolute heaven", "user": "simplesimon70", "date": "February 9, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 95994930}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "15 minutes outside town (part of the way is a bumpy dirt road) is an oasis of quiet luxury", "title": "unbelievably good!", "user": "ek5", "date": "February 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95496959}], "location": {"country": "Cambodia", "continent": "Asia", "city": "Siem Reap"}, "stars": 4, "variance": {"poor": 4, "average": 10, "very good": 45, "terrible": 0, "excellent": 470}, "aka": "Sojourn Boutique Villas Hotel", "slim_ranking": 0.0288461538462, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Nestled among rice paddies and palm trees lies Sojourn, the place to unwind and experience Siem Reaps best treasures. Imagine relaxing in tropical surrounds, enjoying decadent cocktails poolside, or at the swim up bar or perhaps indulge in a massage at our 'Origins' Spa. And when a hard days travels draw to a close, watch our magical sunset, as the day sinks into the palm trees. Sojourn offers unique accommodation, the best Khmer hospitality and a team committed to ensuring you have the ultimate escape. With only ten private villa rooms Sojourn offers journeys of an entirely different nature.Located only a short drive from Siem Reap town, within walking distance of the Ancient Wat Athvea temple and purpose built for your ultimate experience....Welcome to Sojourn"}