{"user_rating": 3.5, "review_count": 2413, "name": "Sol Sirenas Coral Resort", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "This was our 3rd trip to Cuba. First time was Melia Las Antillas, second was Melia Las Dunas.", "title": "Very Disappointed", "helpfulness": 1, "user": "DgQ", "date": "March 14, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 126118805}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "First off, the beach was perfect, and the grounds were nice (as we expected).", "title": "Had a great time!", "helpfulness": 4, "user": "arm_deb", "date": "March 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 126110905}, {"rating": 1.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Being our 3rd visit to Cuba, we expected the bed to be hard as rock, and the buffet to be adequate with decent selection.", "title": "Worst hotel ever!", "helpfulness": 7, "user": "Bob S", "date": "March 13, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 126048877}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We arrived late on Feb 24th, and by Feb 28th my wife and I both had the worst case of food poisoning. Stuck in bed (that was hard as rock) for days, shivering cold, followed by extreme sweats. The only time we could get out of the room was to pick up a piece of fruit and some juice so we wouldn't completely dehydrate. It was surprising how much liquid can be expelled from every exit point in ones body.", "title": "Nice place to relax :)", "helpfulness": 5, "user": "jobleueyes", "date": "March 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 125886811}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Anyway, thankfully we recovered enough to get on the plane and go home on March 2nd.", "title": "Good Times As Usual", "helpfulness": 5, "user": "vitor f", "date": "March 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125858481}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "This was my first trip to Cuba and I went not expecting the food and accomidations to be that great. I was surprised. The hotel room we had was slightly outdated, but our friends had a better room. The food to me was great, they cook fresh meat and fish in front of you as well as pasta. The breakfast was great with many options with freshly made omelets and creps. The 3 restaurants were great, mexican, italian and chinese. The staff were all so friendly and happy. The entertainment staff was one of the best I have seen. They provided great activities for everyone and all of them were very friendly, making our trip even better. I can't say one bad thing about any of the entertainment staff. We made great friends and want to return very soon! No regrets for choosing this hotel. Was better to be on the Sol Sirenas side because it was more family oriented. Many kids stay at the Sol Coral side on group trips, but we went during march break. The food, bars and entertainment were better on Sol Sirenas", "title": "Beautiful and great staff! Will be going again!", "helpfulness": 1, "user": "Karen T", "date": "March 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 126505877}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "My husband and I spent a week at Sol Sirenas Coral from March 12 to March 19. It was fantastic! We stayed on the \"Sirenas\" side of the resort but had access to the \"Coral\" side too. The staff, and Animacion crew were very friendly. The food and drinks were amazing and plentiful. The beach was close, a two minute walk and had plenty of beach chairs. If you walked a few minutes to the west on the beach there is also a bar on the beach and an Animacion crew with volleyball. I would stay at Sol Sirenas Coral again. Loved it!", "title": "Spring Break 2012", "user": "Cynthia1964", "date": "March 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 126494734}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "The only complaint we had was not of the resort, but the S Trip grade 12 boys from Ontario. Unfortunately, they had to brag to their friends loud enough for others to hear about their evenings exploits with the graduating girls (these accounts were sexually explicit and there were children sitting close by.) I was almost embarrassed for them, their parents and Canada.", "title": "Hotel is aging but beach & staff wonderful", "helpfulness": 4, "user": "gtgciao", "date": "March 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 126449133}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The hotel is old and in need of some repair, but the staff and beach made up for it all. The first room we were given was unacceptable, but there was no problem in changing our rooms. The showerhead was not working well, but was replaced with a new one the same day. The food was ok to good. The fresh fish and chicken & turkey was the best bet. Good to check out the restaurants for some variety. The beds are hard. The lobby restrooms are clean but really in need of updating, some stalls had no seats, doors with no locks etc. The Michael Jackson Tribute was great, don't miss it! The beach was the best one I have ever been to. Lots of live music in the evening. We enjoyed the beach grill at lunch and most days there was live music there as well. You have to put a 15 pesos cash deposit for each towel at check in and return them between 9-5, then get a note saying you've returned the towels to get your deposit back. Exchanging towels sometimes a problem, they would run out. Might be easier to bring your own towel from home. Overall the staff were very nice and most helpful and the hotel is good value. Like anything if you can roll with it, you'll love it, if not, go to a 5 star.", "title": "Surpasses Expectations", "helpfulness": 2, "user": "Jim A", "date": "March 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 126303462}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "My partner and I holidayed here March 10-17. With the usual thought of halving the star numbers,we were pleasantly surprised by just how good this hotel is. From our check-in to our boarding the bus to catch our return flight we were thrilled with the staff,the food,the great beach and the room. There were physical improvements that could have been made to the room but nothing that interfered with our enjoyment.The staff in all areas were very proactive in ascertaining that we were being cared for. Lots of good food,good variety of entertainment venues and friendly staff- we were truly impressed.", "title": "It is real 4 stars hotel and I would go there again. Great place!", "helpfulness": 10, "user": "peljo", "date": "March 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 126128944}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "My husband and I lucked out with a wonderful, quiet room on the Coral side and great weather. We enjoyed the drinks and fun at swim-up bar in the Coral pool during the day, our dinners at the Sirenas Buffet, the Italian restaurant and the Mexican a la Carte in the evening. A nice surprise was the pig roast and mixed grill with buffet at the Ranchon Playa restaurant near the beach every day at 1:00. I love my daily dance lessons, my husband likes his ping pong tournaments, but most of all we love the PEOPLE! We love the 5 star beach and the shows in the big theatre were awesome! So much talent! We've stayed at the Sol Sirenas Coral before and will go back again. The servers, bartenders, maids and animators are so friendly and fun and the front desk is always helpful.", "title": "Wonderful, romantic, fun get-away at the beach", "helpfulness": 7, "user": "Toni562", "date": "March 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125837257}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "My adult daughter and I stayed on the Sirenas side of this resort from Feb. 18 - 25. This was reading break and both sides of the hotel were full to capacity. Even so, the buffet easily handled everyone and there were always free loungers around the pool and at the beach. Most of the loungers were new, much appreciated when we saw the filthy, saggy ones at the more expensive hotels nearby.", "title": "Everything a relaxing holiday should be!", "helpfulness": 11, "user": "Bev05", "date": "March 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 125775804}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "The greatest attribute of this hotel is the wonderful staff. This was my 3rd visit, and the service has been impeccable every time. A special thanks to Liset in the Sirenas buffet, Yainely at the Coral lounge bar and all the staff at the Sirenas snack bar (who make the best cappuccinos at the resort). The reception staff is friendly and helpful too, which makes it so much easier to deal with any little problems. Ernesto, the massage therapist, is very professional. An hour with him will make your holiday pace even more relaxed - perfect!", "title": "Don't listen to negative comments!! Nice hotel, friendly staff, standard food, clean rooms, beautiful grounds and beach", "helpfulness": 11, "user": "apanic", "date": "March 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 125764857}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "This must be one of the cleanest hotels in Varadero. Staff are always mopping floors and cleaning, and the lobby bathrooms seem to be checked and cleaned about once per hour. During the week's stay, there was missing toilet paper only once, and the counters frequently sported beautiful tropical flowers. Our room was well- cleaned too (thanks Yanet). Bathrooms were provided with 4 towels for 2 people, so there was one to wrap your wet hair.", "title": "Nice resort", "helpfulness": 6, "user": "Becky R", "date": "March 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125753243}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Food at this resort continues to improve. There was always lots of fresh fruit and fresh vegetables and excellent cheese. The smoothie station for breakfast was a great addition. Three nights of my stay there was delicious roast turkey, always cooked to perfection. The only disappointment is the fries - consistently cold, even when freshly put out. My daughter is a vegetarian, and she always found plenty of choices. The service in the Sirenas buffet is excellent. If you do want to venture off-resort for a meal, Kiki's, at the other end of town, is a great choice.", "title": "1 week at Sol Coral", "helpfulness": 3, "user": "VancouverWoman", "date": "March 5, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 125681988}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "Was at resort from March 18th-25th. There is definitely something for everyone at this resort, the rooms are aging but really a minor issue when you think of the facilities and options available to everyone. Food was ok, if you are patient and willing to wait in line, you can have fresh fish, chicken, meat, pasta prepared for you, just the way you like it. Breakfast options are wonderful as well, great omelettes...In terms of activities, the entertainment staff, usually had something going on, at the beach, at 4pm by the pool at Sirenas side. At night, you can hang out at the lobby bar, where they usually had live music or you can watch the nightly shows...the location of the resort is excellent if you are looking to head into Varadero, it's a quick cab ride away, or you can take the double decker bus. The beach as always was fantastic, I would not hesitate to return to this resort.", "title": "Beautiful Grounds -- 3.5 stars", "helpfulness": 3, "user": "scoop9", "date": "March 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 126734905}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "the pool bar of the hotel was the best place to go !! I have meet 3 good member of the personal like Enrique, Dunia and Olga !! always happy, good service, fast service. I was always there to drink and have fun .", "title": "the pool bar !", "helpfulness": 2, "user": "Vincent B", "date": "March 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126704981}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "le bar a la piscine etait la meilleur place a aller. jai rencontrer 3 membre du personnel comme :Enrique , Dunia and Olga ! ils sont toujour content, on a un bon service et un service rapide. jétais toujour la pour boire et avoir du plaisir.", "title": "I will come back!", "helpfulness": 3, "user": "maryse c", "date": "March 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 126659369}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Hi Enrique, Olga and Dunia, if you read this i wanna thank you for your good services. !! I love you ;)", "title": "Mini paradise", "helpfulness": 8, "user": "Bucketlist201", "date": "March 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 126653926}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Vincent", "title": "Absolutely BEAUTIFUL... please read.", "helpfulness": 14, "user": "Tamara T", "date": "March 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 126616017}], "location": {"country": "Caribbean"}, "stars": 3.5, "variance": {"poor": 314, "average": 475, "very good": 885, "terrible": 233, "excellent": 506}, "aka": "Sol Sirenas Coral Hotel Varadero", "slim_ranking": 0.389830508475, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.0, "location": 4.0}, "description": "All Inclusive Four Star resort with 651 rooms. Located alongside the beach in Varadero. Hotel complex surrounded by tropical gardens which convey an informal atmosphere. The property excels for its superb entertainment program. Recommended for families traveling with children.Guest Rooms651 rooms: 505 Standard, 63 Standard Ocean View, 10 Standard Superior, 55 Junior Suite, 6 Suite, 12 Family SuiteDining7 Restaurants (A la Carta, Buffet), 1 Cafeterias, 8 Bars"}