{"user_rating": 3.0, "review_count": 380, "name": "Sol Azur Beach Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "My family stayed one week at this hotel and feel that we was part of the big \"hotel family\" from day 1. Old people and children are specially treated well. For kids, they offerred with various activities for each evening at the mindisco. Friendly staff provided with top quality service whenever we needed. We were mostly impressed by the hotel staff who generally speak 4-5 languages (Arabic, Franch, English,German, Russian). We experienced NO communication problem. A hotel to choose if you want to visit Hammamet in Tunisia.", "title": "A wonderful hotel for holiday", "user": "Maple888", "date": "February 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 57302193}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "If you're on a bit of a budget, you can't really go wrong with the Sol Azur. Great views, food could be worse, nice enough rooms. I was a student when I went with my girlfriend and we both really enjoyed it. I wouldn't say anything blew me away about the hotel, but nothing impeded the enjoyment of our stay.", "title": "Beautiful location - Good value hotel", "user": "GlasgowFavre4", "date": "February 1, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 54942532}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Although the hotel is good, add ons are very expensive, eg if you want to use the gym. The Animation team can be quite loud and the pool can be quite busy. But, at the price, it isn't going to be absolutely perfect, but it is incredibly good value.", "title": "Nice Hotel, Huge Rooms, Amazing Views! Well Worth It!!", "helpfulness": 1, "user": "Dubai-Mafia", "date": "November 29, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 5.0}, "id": 50297245}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "I don't normally do package holidays and rather book everything my self, however when it comes to certain destinations you have to go package! I booked this holiday for 1 week through Thomas Cook for only £350 last minute. Not bad for July.", "title": "pleasant and relaxing", "helpfulness": 2, "user": "BarnaclebillLondon", "date": "November 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 49324564}, {"rating": 4.0, "title": "Hammamet", "text": "We arrived and was told we got a free upgrade to a sea view room which was nice. I heard a few people complaining about the hotel but i had no problems at all. Staff are very nice and friendly, entertainment staff could not be better and the view from the rooms are amazing.", "user": "BeeKimGreene", "date": "November 1, 2009", "id": 48225875}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "I went to Sol Azur with my Family (all adults). We chose this hotel becasue it was within our price range and it was a five star hotel. As we were travelling from the airport to the hotel we passed through yasmine hammamet, we saw the 4 star hotels which looked absolutely spectacular. So we were expecting something on par if not better than what we had seen! Unfortunatley the exertnal facade of the Sol azur was not on scale with what we had seen. It seemed old and worn. From the outside it seemed like a 4 to 3 star hotel. The reception area also looked old and worn. From the pictures it seems quite grand and majestic. But in actuality .......its not.", "title": "An absolute great location.A good to average hotel!", "helpfulness": 1, "user": "iorek_0083", "date": "April 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 61654016}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "The rooms were good. Although the chamber maid did not seem to have specific times when she arrived to clean the room, and seemed to pick and choose when to change the towels (even though we followed the rule : leave towel in bath if you want a new one)", "title": "value for money", "helpfulness": 1, "user": "cybergirl1", "date": "April 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 61308748}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Despite the above we decided to give the hotel a chance. And we are glad we did. Since the back of the hotel is where it excels! Its location and back pool area was really spectacular. The pictures do the area justice. The pool area had a bar at the side , a small bridge which crosses half the pool to end at a small island in the middle and the deck chairs were free to use and there was always some spare if the main ones had ran out! Then directly after the pool area the hotel opened on the the beach... The sand was clean the deck chair and huts were free, the attendant was very helpful and was always offering to pull the chairs out for you. The sea was as clean and blue as the sky. Very very idyllic. AND DEFINATELY ONE OF THE MORE REDEEMING FEATURES OF THE HOTEL AND AREA.", "title": "Great food, lovely location and marvelous animation team", "user": "MercuryMotel", "date": "April 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 60407978}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Not that I used any of the facilities, but apparently you can use the facilities of the two hotels near by (bel azu and royal azur.", "title": "Splendid Food & Beverage Staff", "user": "xarmejnzizzi", "date": "March 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 59592386}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "The immediate area around the hotel is (exception of the beach) Is nothing special. A few gift shops and cafes and bars around but nothing for a good night walk. The nearest town centre (to go shopping ) is a bus ride away or a 20 min walk where there is a promenade (where there is a rocky beach and where boats leave from ). there is also a BAZAAR area where the shop keepers seem to badger you to death! lol.. all part of the experience though. This town centre area is alot more lively and has more hustle and bustle about it compared to the immediate area around the hotel.", "title": "Remember the context of where you are", "helpfulness": 1, "user": "T0tty", "date": "March 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 58196220}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "This was our 6th. visit to this hotel. As usual, the atmosphere was calm and welcoming. The food was varied, plentiful and of the usual high standard. Nothing was too much trouble for the staff. The room was large and well appointed and the air conditioning worked perfectly. We booked a tour for 3 days to the Sahara and it was marvellous. We booked our flights, transfers and accomodation independently and stayed for 3 weeks for £700 each. We are going back again next year.", "title": "Great Food, great service,friendly staff.", "user": "ghsedge", "date": "June 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 68328005}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We arrived at the hotel after a one and half hour transfer time, was greeeted and quickly taken to our room, this had the biggest bed in i have seen and was very comfortable, the room was cleen and overlooked sea and pool. Maid service very good she even made pretty shaped swans with white sheets and fresh flowers. Food we thought was excellent always something i liked, the waiters friendly and efficient. Hotel had entertainment with their own animation team whom did try hard to get everyone involved but sometimes this did get a little bit of a nuisance. They were very helpful and friendly. Location of hotel is a good base to travel from, but surrounding area just has a few shops and cafes. We walked to the Medina about 20 mins, great if you enjoy a good haggle but i felt a bit intimidated by the men, again they the men sweem to have a thing about older ladies and blonde ladies. Went on 2 trips, one being on a camel in to the hills above Hammamet and visited Carthage and Tunis but nearly missed the coach home as got lost in the medina there, this was quite frightening. For those travelling with Thomas Cook, we were contacted about some building work going on and asked if we wanted to change but honestly we never noticed any disturbance and from where we were no visual disturbance.", "title": "Excellent hotel for a Chilling holiday", "user": "sue1964", "date": "June 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 68010460}, {"rating": 4.0, "stay_parameters": "Stayed May 2010", "text": "I came on holiday with my mum for two weeks in late may. We arrived at 1am and were shown up to our rooms very quickly after filling in some forms. The next day we didn't get shown around but we picked it up quickly.", "title": "Really good holiday but a few downsides...", "helpfulness": 3, "user": "georgiecoughlin", "date": "June 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 66864688}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Breakfast was served downstairs from 6am until 10am with no disabled access but there was a decent variety of food although throuought the holiday it got a bit repetitive and boring.", "title": "A great holiday with some haggling fun!!", "helpfulness": 1, "user": "RJT_1000", "date": "June 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 66618741}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Dinner was also a buffet served from 7pm with a wide variety of food to appeal to guests from other countries including Italien, French and traditional Tunisian. The waiters were polite and you were served your drinks quickly - water and soft drinks were cheap at 2 Dinar each.", "title": "one of the best holidays ever", "user": "allyisace", "date": "April 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 62563724}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We’ve just returned from a week away in Hammamet. (25.07.10 to 01.08.10). We had booked a week, half board in the Sol Azur (supposedly 4 star!) . Reviews looked good and it certainly wasn’t cheap. Well it was horrific, we absolutely hated it! I wanted to cry. Luckily for us the sympathetic Cosmos Rep (Maher) took pity on us and moved us to a better hotel up the road (Royal Azur- supposedly 5 star). Even so we missed over a day of our 7 day holiday. So these were the problems...", "title": "beware- hell hole in high season!", "helpfulness": 2, "user": "SARobinson", "date": "August 2, 2010", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 2.0}, "id": 73416842}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "1)The whole place stinks of cigarette smoke", "title": "The worst holiday ever 7/07/10 - 14/07/10", "helpfulness": 3, "user": "goldfish95", "date": "July 31, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 1.0}, "id": 73152133}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "2)The whole place was rammed with people (mainly Algerians)", "title": "Fantastic Getaway", "helpfulness": 2, "user": "Beau1969", "date": "July 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 72156288}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "3)The towels, when we finally got some (after asking twice over several hours!) were cheap and rough", "title": "great for young families but disappointing for others", "helpfulness": 2, "user": "ragsb71", "date": "July 24, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 72131201}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "4)The toilet roll was cheap and rough", "title": "Great food, pool, service and next to a lovely beach", "helpfulness": 1, "user": "br3nd4n", "date": "July 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 69723745}], "location": {"country": "Tunisia", "continent": "Africa", "city": "Hammamet"}, "stars": 4, "variance": {"poor": 46, "average": 69, "very good": 121, "terrible": 79, "excellent": 65}, "aka": "Sol Azur Beach Hammamet", "slim_ranking": 0.708661417323, "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.5, "rooms": 3.0, "location": 3.5}}