{"user_rating": 3.5, "review_count": 223, "name": "Sol Duc Hot Springs Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "I really enjoyed my stay at Sol Duc. If you want to stay in the beautiful rain forests of the pacific Northwest and don't want to camp, this is a lovely alternative. The dinner at the restaurant was excellent (the free breakfast was edible, not great). If you like hot springs, and hiking and don't want to camp, this is the place to go. I would definitely return.", "title": "Beautiful location", "user": "lbmore", "date": "June 5, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7780691, "likes": {"liked": "— Access to hiking"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "I'm continually amazed that people flock to National Park lodgings and expect the luxury. My family and I just got back from a great weekend away from phones and TV. Our cabin was clean and quiet. We went out and explored the rain forrest, the falls and did some wonderful day hiking. If your worried about the cost of food at the resort, bring a cooler and some snacks. Wonderful photo ops and day hikes abound in the Olympic State Park. We will definately return.", "title": "We came to enjoy nature not get a luxury suite...", "user": "bkpker66", "date": "May 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7656631, "likes": {"liked": "— Great access to the park.", "disliked": "— Nothing"}}, {"rating": 1.0, "title": "A sleazy swindle", "text": "The hot springs attraction consists of three large hot tubs (plus a regular heated - not hot - swimming pool) full of sulfur and little flakes which are actually friendly bacterial colonies (a sign assures you \"It's not skin!\"). They're all right next to each other in a paved, fenced-in area adjoining the main building. It's no different from going to a decent heated outdoor swimming pool with a hot tub, only with a rotten-egg smell thrown in.", "helpfulness": 6, "user": "groo", "date": "May 15, 2007", "id": 7624361}, {"rating": 1.0, "title": "Over Priced", "text": "The one good thing about Sol Duc Hot Springs is the location, in the middle of Olympic National Park, close to some beautiful waterfalls, forests, and mountains that are well worth hiking through. Go see all that, but don't waste your money at Sol Duc Resort. Stay in a campground -- there's one 1/2 mile down the road.", "helpfulness": 5, "user": "NativefromWashington", "date": "May 11, 2007", "id": 7589437}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "If you want a nice clean civilized hot tub, just go someplace in town that has a hot tub. It'll be cheaper, and it won't stink. If you want the rugged, natural hot springs experience, go to Olympic Hot Springs. It's the real thing, and it's free.", "title": "Great for a family", "helpfulness": 3, "user": "stormville", "date": "November 16, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6139089, "likes": {"liked": "— Location, kitchen, isolation", "disliked": "— Nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2006", "text": "We just spend 3 nights at this location. The hot springs are unique and the location is beautiful. But keep your expectations very low.", "title": "The Only Game In Town", "helpfulness": 21, "user": "ClevelandMom", "date": "August 24, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 5706102, "likes": {"liked": "— Sol Duc Hot Springs", "disliked": "— Dirty hot springs."}}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "If you want to sleep in a bed at the Sol Duc Hot Springs, you have to stay at this resort. So you have to pay through the nose for a very simple, very basic room. That's fair. But IMO, for $185 a night, you should not find hair and caked food (chocolate?) on the sheets when you check in. And I think everyone would agree that when the sheets are changed as a result of your complaint, the new sheets shouldn't have different caked food (egg yolk?) on them. If the desk is open, they will order a change, so inspect quickly and speak up firmly.", "title": "Sol Duc Hot Springs 'not so much a resort' Resort", "helpfulness": 18, "user": "j3mmr71", "date": "July 31, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 3.0}, "id": 5532072, "likes": {"liked": "— Good location to all our travels in and aroundn Olympic National Park", "disliked": "— Cleanliness, ammenities versus cost"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The stove was not filthy but it wasn't clean. And were we supposed to pack our own potholders? Didn't realize.", "title": "Resort?!", "helpfulness": 20, "user": "86900", "date": "July 23, 2006", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 5500015}, {"rating": 3.0, "stay_parameters": "Stayed July 2006", "text": "As for the hot springs - people are directed by signs to shower and wash with soap in the attached facilities before entering. But there is no enforcement. Many folks just waltz right in to the pools dry - and are they dry! There are signs that say that the stuff floating in the pools isn't skin, it's some sort of algae. Oddly, it is much more prevalent at the end of the day - by which time the water color has also changed. Ew.", "title": "not very special", "helpfulness": 19, "user": "Jolanda-Netherlands", "date": "July 22, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 5495362, "likes": {"liked": "— the hot spring pools"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2005", "text": "Maybe people would be more likely to shower if there were adequate shower facilities. Of the 6 shower heads in the women's locker room, only 3 offer hot/warm water. Since campers use this shower to clean off, the competition for shower space can get pretty intense, particularly when several families are trying to bathe at the same time that people are trying to shower to simply enter or exit the pool.", "title": "Disappointing...", "helpfulness": 11, "user": "librarianofbabel", "date": "June 9, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 2.0}, "id": 5327354}, {"rating": 1.0, "title": "Sol Dive is more like it", "text": "My partner and I were on our way back to Seattle from camping in the Hoh Rainforest and were looking forward to our weekend reservation at Sol Duc. At first sight, we were astonished at the number of cars lining the entrance, and then the cars that filled the enormous parking lot. The pictures on the new website are extremely misleading, the \"resort\" is more like Disney land with out the rides. Each of the hot pools was filled to the brim with people, with people sitting on each other. (honestly, we were so turned off my how crowded it was we were too grossed out to get in. There was no room to get in without touching someone else.) The man at the front desk was relatively cordial, but a total deadbeat. No helpful information, just the facts about the reservation. No friendliness, no enthusiasm. He might as well have been a sign. At least he wasn't rude. For $125 a night, we expected much, MUCH more. Quote from the website: \"In order to allow our guests to enjoy their Sol Duc getaways with as few distractions as possible, our cabins offer no telephones, televisions or radios.\" While we have no complaint about the lack of telephone or TV, there were plenty of other things to distract us. The cabins offer no privacy and are lumped together about 15 feet apart from each other, with hardly any trees. People were walking by all of our windows the entire time while we were there, as well as campers from the nearby campgrounds picnicking literally steps outside our front door, not to mention the children running laps around our cabin at 7:30 in the AM. We have nothing against children, it just was not our idea of hot-spring soaking and relaxing (of the three spring fed pools, not a single one is \"adult only\", watching children snorkel around in their water wings is anything but relaxing.) As for our cabin, one of our windows screens was actually duct taped to the cabin, and when we opened the curtain in the morning, the entire screen fell out to the ground (which we found unacceptable for the money we paid.) There were spiders nested in two corners on the ceiling in the bathroom, but at least the linens appeared clean. We were looking forward to a nice dinner in the restaurant after reading the previous reviews on trip advisor, and having cooked over a campfire for the last 3 days, but it was really overpriced, which just fueled our frustration and disappointment, since one of their rules is \"absolutely no food in the cabins\" leaving you no other choice. We ended up canceling our second night's reservation and headed back to Seattle early. We would not recommend this place to anyone who does not have kids with them. While the location and National Park trails are gorgeous, the \"resort\" is not worth visiting, never mind paying for, espcially if you like privacy, or were hoping for \"cozy\" or \"romantic\". Honestly, your money is better spent somewhere else.", "helpfulness": 34, "user": "A TripAdvisor user", "date": "September 6, 2005", "id": 3847265}, {"rating": 1.0, "title": "Worst place I have ever stayed.", "text": "I was Terribly dissapointed with everything about Sol Duc. First to turn off the road and find out I have to pay $10 to get there, then to find way more cars than the cabins can accomidate, (come to find out all the campers use the hot springs as their bath) so it was hard to find a place to park. The cabins are in a circle looking at each other so no privacy like I was hoping for on my extended weekend, the insides were filthy cobwebs and felt dirty allthe way around, the light next to the table didn't work, something was wrong with the socket. the light next to the bed fell apart in my hand when I turned it on. The hot spring was soo crowded people were touching arms. the food was awful (don't try the tortelini with white wine garlic cream sauce, it comes to you tortileni wth big pieces of breaded chicken swimming in chicken broth tastes terrible. the women that was waiting tables in the morning told a couple of elderly ladies that they could not wait in the dining room for their room to get finished becaause they were cleaning. I tried to get my money back and just drive 6 hours home the girl at the front desk told me she could'nt rent it I told her I don't the they are rentable. Don't go", "helpfulness": 29, "user": "A TripAdvisor user", "date": "September 6, 2005", "id": 3846784}, {"rating": 4.0, "title": "Sol Duc is Great", "text": "I just wanted to let everyone know, Sol Duc is a wonderful place to stay. I had a great time. the pools were wonderful and the hiking trails began almost at my doorstep. It was a great weekend! I especially liked the girls at the front desk. You could tell they really liked their jobs.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "July 17, 2005", "id": 3674742}, {"rating": 4.0, "title": "worth the glitches", "text": "First of all, let me start off by saying that I too have been going to sol duc hot springs for a very long time and I am very well acquainted with much of it's staff. I have been camping and staying with the resort for about ten years. The resort has had a new company own it called Aramark, I think that they have really made some great changes, the staff was very courteous, especially the front desk and the meals were just lovely. (I especially liked the steel head) I too arrived on a date when the large pool was closed, but I did understand the circumstances. I mean the life guards are not hired to be baby sitters. That's not their job, that would be the job of a parent. There are some circumstances that just can't be helped by the staff, you can't really expect the resort to have to refund every person, because one person wasn't paying attention. How was that their fault, I've seen that they have a little swimmers, notice on the wall, and if a child isn't equipped and isn't old enough to contain it's self than perhaps unsupervised that big pool isn't the place for them. I also found the rooms quite cozy...rustic but cozy. I had a little miss communication about what our room price entailed and the staff was very sympathetic and went above and beyond their call of duty to help figure everything out. I have been to one too many snobby hotels that didn't give a darn about my problems or complaints to let their good work go un noticed. In short I had a lovely stay, and although there were a few glitches, it was nothing that couldn't be bared, and was delt with kindly.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "July 15, 2005", "id": 3668436}, {"rating": 4.0, "title": "Enjoyed our stay very much", "text": "My huband and spend a weekend in a cabin at Sol Duc and enjoyed ourselves very much. We were suprised to read that they were rated so poorly by others. I have to wonder what expectations people have of a National Parks Department run facility.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "July 13, 2005", "id": 3663913}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "after reading the other reviews I felt that I had to say something. I have spent time at sol duc every summer since I was a child.", "title": "family get away", "helpfulness": 13, "user": "kampkaoss", "date": "May 19, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "service": 4.0}, "id": 5182640}, {"rating": 1.0, "title": "Time for a complete overhaul.", "text": "Sol duc is a great place to relax while visiting the olympic nat park. That is unless you are looking for a private kid free pool. There are many places to visit that cater to the high end no children crowd. For the rest of us it's great to have a place to go that is affordable, relaxing and close to all the things that the olympic peninsula has to offer. I found that the staff is very friendly and ready to help out as needed. Despite what other reviews have lead you to believe there are showers at the pools and campers enter the water as clean as any other person. I would say for those of you who are looking for an exclusive resort free of the \"rif raf\" you may want to actually spend the money that exclusivity warrants", "helpfulness": 16, "user": "A TripAdvisor user", "date": "April 17, 2006", "id": 4982800}, {"rating": 4.0, "title": "A great place for seeing nature", "text": "I booked this last minute for the Easter weekend, so I didn't take the time to check the reviews. Most of the bad reviews that I read here still apply except that the pools were not crowded while we were there.", "helpfulness": 19, "user": "A TripAdvisor user", "date": "September 16, 2005", "id": 3907730}, {"rating": 4.0, "title": "Fun at Sol Duc", "text": "The staff seemed disinterested. I brought it to the attention of the reception clerk that our kitchen cabin had no dishes, pots/pans, or utensils. He looked at his watch and told me he would take care of it. Two hours later still no equipment. I went and asked the next clerk on shift (perhaps the first guy looked at his watch to see if he was near the end of his day and avoid dealing with the situation). She provided me with a plastic bin of stuff left over from the worst garage sale in history. Two more visits to the reception desk to try to get the necessary utensils. The clerk said the kitchen sets were \"ok as long as you aren't cooking anything gourmet\". My gourmet meal plans included a need for a knife. We made frozen pizza as the garage sale bin did not contain even the basics for making spaghetti. This wouldn't be a problem if they just informed people to bring their own; however the website indicates that kitchens are equipped.", "helpfulness": 20, "user": "A TripAdvisor user", "date": "September 13, 2005", "id": 3898129}, {"rating": 1.0, "title": "Worst of the Worst", "text": "The cabins are in need of a good thorough clean and as this is the beginning of their season, I shudder at the thought of what they may look like in September. The same applies to the general repair of the place as our cabin had one non-functioning lamp and one of the chairs was damaged. I like the concept of no TV or phone; however I think that this is more about cost than the quiet natural setting. The cabin faced a parking lot. Most resorts that do the no TV/phone idea also have a common clubhouse area so guests can get out of their rooms. The hot springs have limited hours and the weather is often rainy, so other common spaces are needed.", "helpfulness": 21, "user": "A TripAdvisor user", "date": "September 8, 2005", "id": 3886971}], "location": {"country": "United States"}, "variance": {"poor": 30, "average": 35, "very good": 83, "terrible": 16, "excellent": 59}, "aka": "Sol Duc Hot Springs Hotel", "slim_ranking": 0.266666666667}