{"user_rating": 4.0, "review_count": 220, "name": "Sole Inn and Suites", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "I have reviewed Sole before, but I felt like it warranted more feedback after my last stay. Overall my opinion of Sole has not changed, I still feel like Sole is a great place to stay when visiting Downtown Pensacola.", "title": "Just as good second time around!", "user": "Chris H", "date": "February 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124707696}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "I'll start with the reservation process, it was quick and easy and the person who took my reservation was very friendly and accommodating. When I checked in, I was again greeted warmly and with a superior level of customer service that is, unfortunately, very rare this day and age.", "title": "Good place to stay in Downtown Pensacola", "user": "thepeters", "date": "January 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123844499}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "During this stay we opted for the regular King room versus staying in a suite and I must say that I was equally as pleased with the room. While not cavernous the room was spacious enough, nicely decorated, and very clean. Honestly, Sole's housekeeping staff does a tremendous job and everything was spotless. The closet in the room is large and a nice touch, it really saves alot of space which in turn gives the room a larger feel. The bed was extremely comfortable and made for a very restful nights sleep.", "title": "Wonderful Stay After a Night on the Town", "helpfulness": 1, "user": "campaholickat", "date": "December 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 121990872}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "The next morning the wife and I went to the lobby for breakfast. We were again greeted warmly by the desk staff and made to feel at home. Breakfast consisted of cereal, pastries, bagels, toast, yogurt, and fresh fruit so there was something there for most tastes and the food was fresh and constantly stocked. Checkout was a breeze, we were again provided with superior customer service and there were no hassles during checkout.", "title": "Stayed here last weekend very nice", "helpfulness": 1, "user": "Randy988", "date": "December 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121734956}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "Overall, my experience at Sole was once again a very good one. Yes this property is an older property but has been renovated and modernized and the properly is very well maintained and in immaculate condition. The customer service is second to none and that alone makes the stay worthwhile. I would recommend Sole to anyone and will definitely be making another return trip!", "title": "Great location for downtown activities and easy access to the interstate.", "helpfulness": 1, "user": "Arabella6", "date": "December 12, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 121653347}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "Normally when I visit this coast of Florida I'll go to Navarre Beach, nearer the Nat'l Gulf Seashore, but this time I thought I'd try Pensacola Beach--then when I was searching I found this newly renovated what looked like a boutique hotel to me in the historic district of downtown Pensacola instead, which I've never even driven thru before...", "title": "Surprised to find a fun boutique hotel in historic Pensacola", "helpfulness": 1, "user": "SharonInAVolvo", "date": "March 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 126867783}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "I didn't know what I was missing--I liked the historic district & wish I'd had more time to explore it, as it was I only spent 1 night at Sole' Inn & Suites...", "title": "Very cool, unique hotel", "user": "Bre53", "date": "March 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 126367153}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Link to hotel webpage: http://www.soleinnandsuites.com/", "title": "sole inn", "user": "softballguy60097", "date": "March 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 126082283}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Was up the next morning to go for coffee at The Leisure Club (had read they were the best, plus asked my Barista friends where I should go & they agreed) & took a quick (OK, not so quick) browse thru the Natural Foods Market--Ever'man on my way out of town toward the beaches...", "title": "Not as impressed as I expected I would be", "helpfulness": 1, "user": "lionfan91", "date": "March 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 125990381}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "Link to coffeehouse webpage: http://www.theleisureclub.net/", "title": "A comfortable nights sleep in the heart of Pensacola", "user": "Flfitguy", "date": "February 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124959713}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "It was one of the best places too stay. It was close to the beach and down town. I will always stay at Sole when I am in town. The suite was large and had plenty of room. We are going down in a couple of weeks and I'm booking the same room I had last time. The only small problem we had was there needs to be more covers on the bed. Other then that is was great. I loved happy hour. Free beer and wine. It was a nice touch.", "title": "!!!Great!!!!!", "helpfulness": 1, "user": "Michael H", "date": "October 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 118864638}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "This hotel is very beatiful, it is just not functional for the regular traveler. The rooms are VERY small. Do not expect housekeeping to make the bed or sweep while you are staying. There was no place to place for the shampoo or soap in tiny shower or on the black counter. No towel hanger except below the sink where all the towls where pilled ontop of each other. The black counter becomes so spotty after one use and then they do not clean it ever. The toilet water splashed on our feet when the toilet was flushed..every time. The information the hotel provides about the area has a great pizza place I tired to call, to bad it closed a year ago. Very little parking and no warning that the street is ONE-WAY coming out of lobby. No one ever cleaned our coffee pot, maybe that is our resposibility, new on me. The door is so heavy I could barely open it. There was many long black hairs on extra blanket and I know it was not in my party, maybe an ocassional wahing would be great. Over all, this place should not be close to #1 or #2", "title": "Pretty does not mean perfect...........", "helpfulness": 1, "user": "travelwomen2010", "date": "October 1, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 118824634}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We enjoyed our stay here - the rooms were good, in that style where your window faces onto the balcony walkways, so you have to keep the blinds closed if you want privacy - so it made it quite dark but otherwise we were happy with our choice. A minor point but couldn't see an in room safe - for overseas travellers with cash, cameras, passports etc it would have been useful. Loved the free nibbles and drinks during the early evening and the breakfast was fine. The location of this hotel is great - a short walk to the main street with great bars and restaurants - fun for people watching. Much better place to stay than in a motel on the side of the freeway.", "title": "Lives up to the reviews", "user": "Lisa_J_B", "date": "October 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 118821129}, {"rating": 4.0, "stay_parameters": "Stayed May 2011", "text": "This hotel looks just like the pictures on the website. It's very contemporary and a nice remodel. The furniture and room design almost makes you feel as though you're in a boutique hotel. However, it still reminds you of an upscale sleep inn. The beer and wine at the afternoon reception and the rate makes it a solid choice.", "title": "Good stay for the pay!", "user": "my2centsontravel", "date": "September 30, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 118800573}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "We stayed only one night. It is a remodeled motel, done very well. It was a cheap cab ride from the airport, then a short walk to the downtown area. Arrival and check in was quick and easy. The room was cool (over 90 degrees outside!) and clean. The staff was friendly. I would definitely recommend this hotel.", "title": "Clean, friendly and great value", "user": "Kbucks", "date": "September 1, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 117529707}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "Nice place. Appeared clean and newly renovated. The rooms have a modern look to them and includes a coffee pot, microwave, TV, and small refrigerator. I stayed in room 105 and king bed was very confirtable. I also like zero tolerance quite time after 11PM each night to insure a good nights rest. They also have a happy hour in the evenings and breakfast in the morning.", "title": "Nice place located downtown.", "user": "Brassclaw", "date": "December 9, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 121564631}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "My husband and I stayed here for one night in July... it was the night before the annual Blue Angels Air Show on Pensacola Beach.", "title": "Nicely upgraded property in the heart of Pensacola", "user": "TVChick16", "date": "December 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121326728}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "I made my reservation online, and received a rate of $89 (AAA rate).", "title": "Tried but failed", "user": "Graylar", "date": "November 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 120548374}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Upon arrival, we were greeted by the desk attendant and told that complimentary happy hour had just begun. We checked into our beautifully decorated room and then ventured back to the lobby for happy hour. There was an array of snacks, beer, wine and lemonade. We grabbed some refreshments and enjoyed them on the outdoor patio. The happy hour lasts for a couple hours and is a nice welcoming touch!", "title": "Call Before You Book", "user": "FloridaSlim52", "date": "October 25, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 119709081}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "The Sole Inn is within walking distance to all of the downtown hotspots. After a nap (too much happy hour... lol) we walked to Hopjacks Taproom. There was a good nightlife scene in downtown Pensacola, but we were pretty tired so after dinner we just retired to the hotel.", "title": "Great hotel for wedding guests", "user": "Carlene12589", "date": "October 10, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 119138827}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 10, "average": 26, "very good": 66, "terrible": 6, "excellent": 112}, "aka": "Sole Hotel", "slim_ranking": 0.229508196721, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}