{"user_rating": 3.5, "review_count": 68, "name": "Solvang Inn and Cottages", "reviews": [{"rating": 4.0, "title": "Solvang Inn & Cottages, Convenient, Clean, Friendly Staff", "text": "We always stay at the Solvang Inn & Cottages. We've been staying there for over 10 years and have never had a problem with anyone being unfriendly. We find the staff to be very helpful.", "user": "FlynGramma", "date": "February 2, 2008", "id": 13215188}, {"rating": 3.0, "stay_parameters": "Stayed December 2004, traveled as a couple", "text": "The motel has two story and one story units, so anyone handicapped can stay at this motel. The cottages are very nice.", "title": "Rustic and cozy but not for everyone", "user": "Buzbee", "date": "November 10, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 10728890, "likes": {"liked": "— Huge bathtub, and a real roaring fireplace", "disliked": "— Cold, dark, dangerous outdoor stairways, unhelpful staff"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "There is a small pool and hot tub. Parking for the one story units is a little congested on a weekend. The motel is located close to restaurants and the local bus stops in front of the motel, plus the Chumash Indian Casino Shuttle stops at the motel, too. For the price of the rooms, I don't think anyone would find a better deal in Solvang. I would, highly, recommend the Solvang Inn & Cottages.", "title": "Barely Adequate but Quaint", "helpfulness": 1, "user": "momziekins", "date": "September 1, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 8600928}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "I have mixed feelings about this Inn.", "title": "Great weekend get away", "user": "peacful", "date": "July 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8123877, "likes": {"liked": "— big", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled solo", "text": "On the one hand it was quaint and charming. The hotel and cabins are rustic in decor. The room we were in had a wonderful, HUGE bath tub big enough for my 6'3 inch husband to soak in. It had a wonderful fireplace too.", "title": "Just a basic Solvang motel, but great location", "user": "Orion_240", "date": "June 28, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 4.0, "location": 5.0, "value": 2.0, "rooms": 4.0}, "id": 8017469, "likes": {"liked": "— Pool area with lots of sun", "disliked": "— no hair drier in bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We were impressed with the cleanliness and location of this quaint little motel. It had a great Burger joint (the Big Bopper) right next door and its complimentary breakfast is at the bakery across the street (Olsen's and the Danish was FANTASTIC). The staff was very tourist friendly and were helpful in finding places to eat (they have Albums full of menus) and sites around Solvang.", "title": "Inexpensive, great value, parking and service", "user": "Marquis_J", "date": "August 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 73984202}, {"rating": 1.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "We used to love this hotel Especially their Annex Property at Atterdag and Copenhagen. This last trip we had our camera bag taken (Nikon & Minolta lost) from our locked room. The guests across the courtyard from us lost a lap-top, I-pod, and camera from their locked room the same weekend. The maid had been there and the door was secure in both instances. The maids have a habit of leaving the doors open and not blocking the open doorways with their carts while cleaning, meaning anyone could have entered while she was in the bathroom or wherever. So, I am not saying I believe the house keeping staff did it themselves - they simply provided the opportunity. Shame on us for leaving valuables in the room. We were also there last January. When we got home my wife noticed she had jewelry missing. We figured she had just misplaced it. Now we think otherwise. Same hotel. They accept no responsibility.", "title": "Theft Problems - Guests Beware", "helpfulness": 3, "user": "Filmwritin", "date": "May 18, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 64613257}, {"rating": 2.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "My husband and I just returned from two days in Solvang. Solvang Inn and Cottages was a great location; however, every hotel/motel in Solvang is a great location. For midweek, the price was reasonable, but not exceptional; however, the room was substandard. In the middle of the night, someone in another room was taking a shower--I thought it was in our bathroom. The room had not been thoroughly cleaned as, when leaving, I checked that we had everything and found articles of previous guests under the bed. The toilet leaked and water would run periodically throughout the night. On a positive note, enjoyed the Cafe Angelica and the Hitching Post for dinner.", "title": "Great Location--Poor quality", "helpfulness": 1, "user": "calota", "date": "April 10, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 60919253}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "This place was not luxurious with marble and what not, but it was simple and cozy. A perfect little get away Inn.", "title": "Simple and cozy", "user": "pmr3150", "date": "August 10, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 37271877}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "My husband and I stayed here for one night. Everything was fine until we came back from dinner around 10 pm. We were watching television and talking and at 11 pm the telephone rang. It was the front desk saying they had a compliant of too much noise. We were talking and commenting about a show on MTV. It's not like we were partying, boozing, etc. We are a couple in our mid-30's. It was 11 pm. Hello. Anyway, that is my main compliant. I say the walls are thin because now only could our neighbor apparently here us, but I could here him each time he coughed and the next morning, I could here his television, so BE AWARE. Also, there is a gap underneath the door that connected the two rooms, I'm sure this added to the thin wall factor.", "title": "Thin Walls", "user": "Travel4workand4fun", "date": "May 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 29266385}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Nothing special to this hotel room. I was surprised how clean our room (122) was. Everything looks like it was well maintained. The manager was friendly and helpful. The staff helped when asked and didnt bother us during our stay. The location was great. The shops close early so get out as soon as you can. We had a wheelchair bound person with us and stayed in a regular room. The doorway was wide enough and worked well for us but be aware of limited wheelchair access to some of the rooms from the parking area. They do have a wheelchair cottage available too. Oh, the wireless internet is only available in the office. Not very convenient.", "title": "Basic hotel room, surprisingly clean with convenient location", "user": "Godzgrl", "date": "April 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 2.0, "rooms": 4.0}, "id": 27917887}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "its a comfortable place, just walking distance from the main small town. Staff were ok, nothing too friendly but nothing too bad. Solvang closes early, so be prepared to spend a lot of time in your hotel room, and this hotel as I can see is one of the best.", "title": "perfect place for solvang", "helpfulness": 1, "user": "Cathaycaptain", "date": "April 12, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 27834359}, {"rating": 1.0, "title": "you get what you pay for", "text": "Traveling with 2 children we booked this hotel because it had a heated swimming pool, only to find out on are arrival that they no longer heated it. Would have been nice if they told me that when i made the reservation, also the chairs stuffing was coming out and the toilet kept running all night I guess for 100 dollars a nite I expected more.", "helpfulness": 1, "user": "Roc45", "date": "February 27, 2009", "id": 25257591}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We stayed in room #142. Very large room and very comfortable bed. Breakfast voucher was a wonderful treat to a fresh Danish and coffee across the street. Adequate parking and looking forward to our next visit in September for Danish Days.", "title": "Great big room!", "user": "Bunnyfan", "date": "May 29, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 16478656, "likes": {"liked": "— Right close to main streets and attractions we wanted to see.", "disliked": "— Heard noise from next room over"}}, {"rating": 3.0, "title": "Don't expect much for the price", "text": "Looks better from the outside. The room looked old and had a moldy smell. My husband and I stayed for one night. I don't think I could've stayed longer. You get what you pay for.", "user": "rubistar", "date": "March 3, 2008", "id": 14004307}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "I've been to many little dives in my day, but Solvang Inn and Cottages was not a bad stay, if you don't mind spiders!", "title": "An Average Stay If You're Not Suffering from Arachnophobia!", "helpfulness": 1, "user": "morgie55", "date": "August 8, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 3.0, "service": 4.0}, "id": 116442056}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Yes, spiders. On the wall outside the apartment and one landing on my friend's bed. Oops. Good thing I like spiders, but you may not!", "title": "Not bad for the price", "helpfulness": 1, "user": "nlcatter", "date": "August 2, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 4.0, "service": 3.0}, "id": 116186763}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "First Impressions:", "title": "The Inn is a reflection of the town", "helpfulness": 1, "user": "kato", "date": "June 13, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 113140462}, {"rating": 2.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "So we get to the front desk to a man who seemed a bit bored or something. Not sure what was going on there. Anyway, we came to activate our reservation and they said we had two separate apartments! No, we wanted ONE apartment with TWO rooms! Finally got that straight.", "title": "Worst Hotel", "helpfulness": 1, "user": "scaackler", "date": "March 25, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 3.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 101566539}, {"rating": 4.0, "stay_parameters": "Stayed August 2010", "text": "We got a free package of cookies for the inconvenience, yummy.", "title": "Comfortable, affordable home base for wine tasting", "user": "MrDuber", "date": "August 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 77541466}], "location": {"country": "United States", "city": "Solvang"}, "variance": {"poor": 14, "average": 14, "very good": 24, "terrible": 6, "excellent": 10}, "aka": "Solvang Inn And Cottages Hotel Solvang", "slim_ranking": 1.0}