{"user_rating": 4.5, "review_count": 398, "name": "Somandshjemmet Bethel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Its really all been said about this great little hotel in a perfect location in Copenhagen so this is just to highlight again the main points; great value for an expensive city in a wonderful location on Nyehaven, its like living in a picture postcard; attentive and helpful staff who can't do too much for you and manage this in a wonderfully relaxed and informal way; good breakfast included and complimentary coffee and cakes available all day; basic rooms but adequate and very clean - we didn't even mind the wet shower room! We stayed three nights in Copenhagen and it was our first visit so we were knocked out by how lovely the city is and how easy to walk around it is. A irresistable combination of great history, superb modern architecture and waterways makes this a terrific weekend break. And all this less than two hours flying from Birmingham. We only wondered why we had not got round to it before!", "title": "Fantastic Small Hotel!!", "helpfulness": 1, "user": "Kenfaisey", "date": "August 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 39352479}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We spent two nights in this hotel and I guess you could not find a better location in Copenhagen - right on the Nyhavn. We were fortunate to have a room facing the canal and it was just idyllic.", "title": "Ideal location", "user": "rivercross", "date": "August 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 38794579}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled solo", "text": "The hotel is basic but very clean and the staff are very friendly and helpful.", "title": "A friendly place to stay if you want to be in walking distance to Copenhagen's best sights!", "user": "proudbruin", "date": "August 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38058260}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Breakfast was good and there is a facility to have tea or coffee at any time during the day", "title": "Its location, service and price make Hotel Bethel a great place to stay in expensive Copenhagen.", "helpfulness": 2, "user": "ProfJason", "date": "August 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37840947}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "If you want a reasonably priced hotel with the best location in Copenhagen then this is the place.", "title": "Fantastic- The Staff is great and the location extraordinary", "user": "Heloguy77", "date": "August 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37602599}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We stayed two nights in September. We were very impressed with the service level of hotel staff. Our room was clean and sufficient in size. The breakfasts were great and value was noteworthy. The only caution we advise is if you are a -very- light sleeper. On Saturday evening, the music from the Nyhavn bars ended on this weekend evening around 3am. If you are out there in the fun, you won't notice it. If you go to bed earlier and sleep lightly, you may have issues.", "title": "Enjoyed our stay", "helpfulness": 1, "user": "VisitorBob", "date": "September 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 44682192}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We stayed in the Hotel Bethel for three nights and we found the location to be outstanding. The staff was extremely friendly and helpful and the breakfast was excellent. This family-run hotel was everything that we could have wanted. Some have complained that the rooms are small, but we found our room to be pretty typical of a European hotel in the city center. The central location more than made up for the size of the room, and the friendly helpful staff would not have been found in a large American style hotel.", "title": "Great location, service and value", "helpfulness": 1, "user": "mlinc", "date": "September 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 44183358}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Stayed here for two nights in September 2009. Firstly I was in room 122 which must have the best view in Copenhagen, the only room with a balcony looking out over the Nyhavn and many of its bars and restaurants.", "title": "Best view in Copenhagen", "user": "Chariotchoogle", "date": "September 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 43039406}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Hotel rooms are clean and comfortable, for want of a better expression basic with no frills, and I feel guilty for saying that. Breakfast is filling; cold meats, cereals, great pastries and coffee available all through the day, and the staff are very friendly.", "title": "Good value for the price", "helpfulness": 1, "user": "cannes101", "date": "September 19, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 42874707}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The bars and restaurants, did not prove to be a problem at all, rooms had big windows which was nice to watch the night draw in and the sunrises over the canal in the morning.", "title": "Bravo to the Bethel !", "user": "iloveorlando", "date": "September 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 40047990}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled solo", "text": "What a gem! I was in Copenhagen for the wedding of friends which was out of the city, so needed one night beforehand. This was one of their recommended hotels. I booked in early May and got the last single room available for end July/early August. I can understand why - the location is amazing, the staff who run the hotel are fantastic.", "title": "5-star+ staff and amazing location", "helpfulness": 2, "user": "traveller2007", "date": "August 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 36628960}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The building is old but refurbished inside and is clean, comfortable and cheap (for Copenhagen).The hotel seems family-run, but is veryprofessional and also very generous - the non stop tea/coffee and even cakes and fruit, was marvellous. Breakfast was delicious. Internet was fast, newspapers plentiful. The view from reception was amazing and you cannot beat the location. The wedding party I had to meet literally met outside the front door (by coincidence) as Nyhaven is THE place to be, especially as a tourist on a sunny day!", "title": "Friendly hotel in an excellent location for reasonable cost", "helpfulness": 1, "user": "Clare59Otley", "date": "August 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 36383615}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "I had a decent sized single room facing a very quiet courtyard so slept soundly. Only very minor complaint was that I'd have liked a bigger bath towel, and the hairdryer in my room wasn't working, but it was only a matter of seconds after asking at reception, that I received a replacement dryer. When I asked for an iron and board I was also given one immediately. I've stayed in 5 star hotels where I've waited a lot longer and had far less polite service....here I could not fault the staff, even though it was full and very busy in reception, I never detected any stress or impatience.", "title": "Would not stay anywhere else- Perfect Location. Great Staff", "helpfulness": 2, "user": "travelmutter", "date": "July 31, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 36283855}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "I loved Denmark and would love to come back- and will certainly stay at the Hotel Bethel again.", "title": "Absolutely Delightful", "helpfulness": 2, "user": "Weredingo", "date": "July 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 35625201}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We loved this budget hotel in the centre of Copenhagen. What you don't get in soft furnishings is more than made up for by the helpful staff and friendly atmosphere. The idea of having the dining room open all day to help yourself to tea/coffee and what ever is left over from breakfast is a great idea. No-one seemed to object to guests making themselves a sandwich to take away with them either and they even provided the foil for wrapping. Our room was spacious, comfortable and spotlessly clean. Be aware that the pillows are the square feather type which take a bit of getting used to. I think next time I would take an inflatable pillow with me. Our room was right at the front and we spent ages watching people along the waterfront, but beware if you are a light sleeper it can be very noisy and the Danes keep late hours!", "title": "Perfect little hotel in the middle of Copenhagen", "helpfulness": 2, "user": "nushh", "date": "July 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 35592088}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We stayed at Hotel Bethel for 2 nights prior to boarding our cruise ship. We had a corner room, so we had a fabulous view from two sides overlooking Nyhaven Canal. It was just like a postcard picture. The room was very clean, with simple decor. Our friends had the room next door and it was nice, but not as spacious as our corner unit. Bed was comfortable. Breakfast was delicious, traditional European selections of cold cuts, pastries, toast, boiled eggs. The staff was very helpful and attentive. Bathroom was very compact, with shower and toilet in the same space. Great value, would stay there again if I am ever in Copenhagen again.", "title": "Hotel Bethel - great location with fabulous view", "user": "travelbugbob", "date": "September 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 40021534}, {"rating": 5.0, "title": "Fabulous Hotel", "text": "Everything said about this wonderful hotel is true. The location is fantastic, right on Nyhavn close to bars and restaurants. The rooms are simple and clean and ours had a great view out over the canal but was not at all noisy. The wet shower did not bother us at all.", "user": "Katt", "date": "September 6, 2009", "id": 39961752}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "The breakfast is adequate with plenty of choices and you can help yourself to tea and coffee at any time of the day. The staff are really helpful and friendly and answered all of our questions.", "title": "Good hotel in expensive city", "user": "SG1974", "date": "September 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39776728}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "It is a great find in a very expensive (but beautiful) city.", "title": "Excellent, can`t speak highly enough of the staff.", "user": "smartoneDublin", "date": "September 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39519796}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "Pros:", "title": "Great location and good value", "helpfulness": 1, "user": "Bellini6", "date": "July 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 35456011}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "-Spotlessly clean.", "title": "great value, great location", "user": "gulfcoastbreezes", "date": "July 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34931950}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "-Very comfortable. The room was spacious and we already knew the shower would have no separate platform, so no surprises there. It wasn't a big problem either: there was plenty of space so as not to get the rest of the bathroom wet.", "title": "Perfect stay", "helpfulness": 1, "user": "Londonbelongstome", "date": "July 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 34696426}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "-Great location. 5 minute walk from a metro station. Lots of great bars and restaurants nearby and it's a short walk from most touristic sites in the city.", "title": "FANTASTIC!", "user": "garden2406", "date": "July 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 34631395}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "I definitely recommend this hotel to people who want to be close to all of Copenhagen's tourist attractions. It's super easy to get here from the airport ... the metro stop is close to the hotel. The staff are so friendly and you will love its location.", "title": "Don't bring a car!", "helpfulness": 1, "user": "Lacemaker", "date": "August 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36708599}], "location": {"country": "Denmark", "region": "Zealand", "continent": "Europe", "city": "Copenhagen"}, "variance": {"poor": 8, "average": 47, "very good": 164, "terrible": 3, "excellent": 176}, "aka": "Somandshjemmet Bethel Copenhagen", "slim_ranking": 0.0642201834862, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 3.5, "location": 5.0}, "description": "The Hotel at the corner."}