{"user_rating": 4.0, "review_count": 1575, "name": "South Seas Island Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2013", "text": "I have stayed at SS Island Resort three times.", "title": "Tennis Villas", "helpfulness": 1, "user": "StephySunshine5", "date": "July 21, 2013", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 168419151}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "The Tennis Villas are the best value. They have been remodeled and are inexpensive compared to the beach side rooms. The Tennis Villas are a quick walk to the stores/Starbucks and off property restaurants.", "title": "The Best Place for a Family Vacation!", "user": "russmeade", "date": "July 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168036086}, {"rating": 1.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We've enjoyed the trolley service around the resort. Make sure to explore the entire grounds, otherwise you will miss out! The best way to do this is to take part in the Scout About program. It is free and tons of fun for all ages. A walk around the north tip of the island is well worth it.", "title": "Awful, horrible, dirty, noisy place - stay home !!!!!!", "helpfulness": 4, "user": "vlane", "date": "July 15, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 3.0}, "id": 167713099}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Our favorite beach is middle beach with the volleyball courts, parks and snack shack. This is only beach that offers service.", "title": "Over priced and generic", "helpfulness": 3, "user": "kvf1", "date": "July 14, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 167581179}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Our kids love Scoops for dinner and a sweet treat. We also love shelling in the early morning.", "title": "Very nice resort on Captiva Island", "helpfulness": 1, "user": "cmd69", "date": "July 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 167564539}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We just returned from the 4th of July holiday weekend at South Seas Resort. We had a great time! We stayed in a 2 bedroom beach villa (bldg 2200) and our room was amazing! Very clean, super comfortable beds, beautifully decorated living & dining rooms, and fully equipped kitchen. Both bedrooms had windows and the living room had the beach view (albeit with a couple of palms between the room & beach). The housekeeping staff was amazing! We have 3 young boys and never did I need to request one thing. Without even needing to ask, they brought us extra towels and supplies. They were very quick to clean the rooms; we would go to the beach in the morning and come back to eat lunch a had our room was spotless. And when you passed the housekeeping staff, they were all so nice and always said hello. Check-in staffs as very nice and the security staff at the gate waved and smiled every time you entered back onto the property, which made you feel very welcomed. Besides the beach being very close, there is also a pool right outside your room as well...the best for kids! We brought a cooler with times of food, so for breakfast & lunch we ate at our villa, but we did enjoy some wonderful dinners on Captiva.", "title": "Holiday weekend delight", "user": "Pairandspare", "date": "July 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166951096}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "On a needs improvement note, the trolley system could be run much better!! You must take a trolley to get to the north end of the property where the resort pools with water slides, restaurants, and ice cream shop are located. It is at least 30 minutes between trolleys, which is ridiculous. It was a holiday weekend and they only had 1 trolley running (there were other trolleys...just they weren't using them?!). It seemed like they were really pushing you to rent a golf car and with rates at $100 for the 1st day and $60 everyday thereafter (for the 4 seater- the 6 sweaters cost even more!), that is insanely expensive. Plus, for a resort bragging to be earth conscious, why would you encourage gas powered golf carts?! Some people had absolutely no business driving a golf cart, especially after indulging in way too many cocktails, which was unsafe for the bikers and walkers. More trolleys would be better & safer for all.", "title": "Great Stay But.......", "helpfulness": 2, "user": "tim c", "date": "July 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 166848001}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "Other notes: 1. based upon other reviews, it is true- the beach does not have the powder white soft sand that the area is very well known for. This resort was devastated during Hurricane Charley in 2004, so I am guessing that the sand was part of the major restoration project that occurred. Not an issue for us, but something to note if that if the powder white sand is what you are expecting. 2. Also, at the beach villa beach area, the resort does provide towels, chairs, and umbrellas. We brought our own, but with 3 little ones it was fantastic to just show up and have these amenities available. No, there is not a refreshment/bar area anywhere near this area. It would be a bonus if there was a place to get a frozen, fruity cocktail (you are at the beach after all!) but it didn't ruin my fun, relaxing time. 3. The resort pools at the north end with water slides are very, very crowded. Just something to expect, but it was a little overwhelming for all of us. I was ready to leave after a short time there. 4. Harbourside Restaurant had great food & wonderful service, but the menu is limited and very expensive. It may be best to eat off property (Kelime Bistro is delicious!).", "title": "Relaxing time for a Family Vacation", "helpfulness": 2, "user": "Gilda B", "date": "July 8, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 166828587}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Had a Great time at the South Sea's The Location is awesome but If your planning on going some things to be aware of.", "title": "Not exactly as described!", "helpfulness": 3, "user": "Monique M", "date": "July 8, 2013", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 166796291}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "The resort charges each adult $17 per day including the day you check/out for use of the Facilities.", "title": "Relaxing getaway", "user": "Marybel13", "date": "July 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 166779054}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "I was here for a destination wedding. The room was very spacious with a mini-fridge there without being ordered. Nice bathroom too. But, it was frustrating that the fitness room was at the other end of the resort, I couldn't get a chair by the pool next to my husband and the food at the wedding reception was unexceptional. The prices for everything were high and the resort fee was annoying. I won't be returning.", "title": "Expected more for the price", "helpfulness": 1, "user": "rmgronsky", "date": "July 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 167347949}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We just returned from a wonderful first trip to South Seas. With a few caveats--we enjoyed it and even purchased a timeshare unit and are negotiating on another. We stayed in the Beach Villas, Building 2300 on the first floor. we were told no elevator--but there was one . We would rather have been higher--but we live south of Captiva, on an island and were mainly interested in a getaway. The view was lovely, housekeeping was terrific, BUT--the villa need some updating. The bed was GREAT as were the pillows.Typical vacation villa kitchen supplies and housekeeping was generous with the towels.", "title": "Great week at South Seas", "user": "Debijaynes", "date": "July 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 167322450}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We used the trolley service just once and it was great--short wait and no parking hassle. We rented a golf cart but found we didn't need it.", "title": "The best trip!", "user": "blakes936", "date": "July 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 167239423}, {"rating": 2.0, "stay_parameters": "Stayed July 2013", "text": "As we live in SW Florida we are accustomed to the prices on the island--we thought everything except for the grocery store opposite the entrance was very reasonable priced.We ate breakfast in the unit, and then I went to the beach and my husband played golf every day. Great course and it highly influenced our decision to purchase several time share units.", "title": "Very Disappointed in service", "helpfulness": 2, "user": "bridgette h", "date": "July 11, 2013", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 167198035}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We did notice that people were dressed VERY VERY casually in the the restaurants, both in and out of the resort. Maybe it was just the Fourth of July weekend as it did improve towards the middle of the week.", "title": "Wonderful stay at a beautiful resort!", "helpfulness": 3, "user": "sdmindia", "date": "July 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 166999928}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "This place was really amazing. The resort is located on the north end of Captiva Island, with a wide range of accomodations avaiable from traditional hotel suites to private estate sized homes. The beach is straight out of a postcard with incredible sunsets. The marina is picturesque and offers a range of activites from boat rentals, to cruises to sailing lessons to fine dining to casual dining and ice cream. There a number of resort pools and a kiddie water park area with waterslides as well as other activies. A range of shops are on the ground or nearby, but expect to just relax in the resort and enjoy. Worth renting a golf cart or bikes to get around the property. Rentals are available on site, but may be cheaper in town in Captiva. Sanibel and its wider range of restaurants and shops is just a 20 min drive away. Truly paradise.", "title": "Beautiful resort property on North End of Captiva", "helpfulness": 1, "user": "joylama", "date": "July 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168614507}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We have been to South Seas every summer for the past three years. Great family vacation place. Kids love it; relaxing for adults. This year the service and condition of the apartment we rented was slightly below previous years. Hope it's not a trend because it is a great place to relax in the sun for a few days.", "title": "Florida Family Fun", "helpfulness": 1, "user": "Marta B", "date": "July 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168583880}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "I admit I was worried reading the negative reviews, and I did call and say I would like a renovated villa, I don't know if that helped,but we were pleasantly surprised. The service was wonderful , any staff member we came in contact with was truly gracious and helpful. We stayed in a beach villa , nice walk to local restaurants, etc. the north end pools were fun and neat. We rented a golf cart which is great", "title": "Great experience", "helpfulness": 2, "user": "menusnob", "date": "July 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 168479804}, {"rating": 5.0, "title": "A paradise! Rediscover what it means \"TO LET GO\"!", "text": "to have, since parking is", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 21, 2013", "id": 168459592}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "limited. Prices are typical resort prices , not bad. Great long weekend !!'", "title": "Great Family Vacation", "helpfulness": 2, "user": "kitchena", "date": "July 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 168430167}, {"rating": 1.0, "title": "Don't travel here if you expect service or family fun", "text": "We chose South Seas Island for our spring break and haven't even left yet and I wish I could change. I've tried calling to get reservations for dinner and family activities and the best you can do is leave a message for the concierge to call you back. Which never happens. Then you find out the Sanibel Sea School which they tout on their website for the kids is not even open on Monday or Tuesday. Now the cherry on top is they have decided not to have the school on Saturday either because they have something to do. So during our four day trip we don't even have the opportunity for my son to go to the school. They have been difficult to work with and if I could get my money back for flights I wouldn't be leaving tomorrow.", "helpfulness": 6, "user": "kcannata", "date": "March 4, 2011", "id": 98933715}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "Just got back from a wonderful stay at South Seas. The only negative I thought was the woman who checked us in and the man that checked us out. Both were not very polite, nor happy that we were guests. Make sure to have the keys put on lanyards. Our checkin woman neglected to ask us if we wanted them. I liked that the resort was cash free. Less hassel. Had a Harborside Room which was strategically located. Rented bikes. Played golf. Kayaked, banana boated. The golf course is beautiful. Par three. A bargain. As for the negative writeup previously... The resort clearly stated that there were no life guards on duty. That seems to be the norm these days. Encourages parents to actually pay attention to their kids. Always had towels and a chair by the pool. Brunch was a great deal. Next time, we will rent a boat as well.", "title": "So fun for everyone", "user": "FlyerMa", "date": "March 3, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98827384}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "My wife and I stayed in a Beach Villa in late February and I requested an updated one if possible since I had a chance of having a business affiliate visit. For once, we had a great week of weather..75-80 deg everyday. We got a beautiful place, great kitchen with basics for utensils/cooking items. Excellent housekeeping service. HOWEVER, we made the big mistake of not taking other's advice and stopping at Publik's grocery before coming over the causeway. The only two tiny \"provision\" stores adjacent to the resort are astronomically expensive and limited and basically there was NOWHERE to get fresh fish or meat except from a truck that arrived bet 10 and 2 on Tues and Thursdays in town. Clearly this town was set up to maximize your eating out. Every restaurant was overpriced, but good. (Dont waste your time with the famous \"Bubble Room\". Musty cramped loud hurried place which boasts desserts which has only oversized under-flavored pieces of cake which not many kids are interested in...and creepy boy scout uniforms for the servers)", "title": "Outstanding service,attitude,room...and oh yes...the bill", "helpfulness": 6, "user": "DrJoeS", "date": "March 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98755289}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "The 9 hole 3-par golf course is absolutely gorgeous and a real treat, but priced at a rate of an 18 hole course ($45 ea). Club rentals are $25, but when we arrived in the am, our clubs and cart were all set up to go waiting for us. The boats available to go fishing, or have a captain take you out are inhibitively expensive, unless you get a large group together...so I chose to just rent a pole. The pools on the North side are perfectly picturesque, but are definitely for families and kids and are crowded. Great drinks at the bar. The beach is beautiful, a 45 second walk to the beach down a nice path, shells small but nice. Our 5 year old had a ball. However, the \"kid programs\" offered are not terribly enticing for a 5 yo. Shells are better down the road (need a car)on the sand bar at Blind Path Beach. Beach chairs, towels (don't pack towels!) and umbrellas are included and set up by the staff on the beach....extremely convenient and helpful.Even supply small plastic tables. The fitness center could use a little work and is not connected to the spa which is a little weird with a resort of this level. Overall, it a breathtaking place, all the staff is cheerful and more than helpful (came to return our bikes for me immediately on the last day when we ran short on time). Eating however is coercively expensive, unless you stock up before you get there. There are only about 5 or 6 restaurants to choose from within walking distance, and there is nowhere close to your villa to casually walk over and go get a quick drink. Cheapest wine in the provision store is$25 a bottle and small jar of peanut butter is $8.00. Get the picture?. I still dont understand why it is so difficult to get fish to cook in a place like that. Clearly this town wants you to eat out. Cant complain the room was expensive since I knew the price when I booked it, but made the big mistake of booking it during President Day week. Got nailed with airfare, car rental and room fees being jacked way up. Additional fees for the room added another $100 a night. Ouch. However, if you have the money, and not obsessed about eating all the time, ENJOY the treat!!", "title": "Amazing Beach Vacation on Secluded Island", "helpfulness": 4, "user": "SandShellsBeach", "date": "March 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 98722557}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "My family and I just got back from South Seas and it was AMAZING.", "title": "Wonderful vacation - can't wait to go back!", "helpfulness": 4, "user": "WendyRI", "date": "March 1, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98502765}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "Resort has a island feel to it but you are in the US. Absolutely beautiful real estate. Manicured lawns, pathways, flowers, walkways. Very relaxing. It was a treat to stay here. You feel catered to and pampered. The resort is very large taking up the tip of the entire island. We were 2 adults and an 8 yr old boy. We were only there for 2 nites. We stayed in the pools and by the beach but there was golf, boating and activities for the kids which we didn't try. They put out chairs and umbrellas at the beach which was heaven. Bring a bag to carry shells. Had a studio by the marina with one king. Not sure why we didn't get 2 queens but we fit fine. Just little things with the room but nothing major. I did not like the bath area. It had lever doors so even if you closed the lever pocket door to the bath area you can hear everything. No privacy. Also thought they should have put a small microwave in the room. Loved sitting on the porch watching the boats. The views are amazing but they need to put a small table on the balcony to put your drinks on. There were dolphins and manatee in the water. We went to the grill at the pool but no one served us so we left and went to the Scoops and Slices because my son was starving. They had decent salade there. We ate both nghts at the BBQ pit. The price is reasonable and the burgers aren't bad. They had other places to eat but the menu didn't appeal to us plus the place had a great arcade area for my son. Each time you order they say thank you Mrs. Soandso which is a nice touch although I'm sure the workers must tire of it all. Coffee at ship shore is terrible but I didn't see other choices. The store has got a stupid layout. Wine bottles all over the place. Saw 2 people knock them over. Pools are great although one thing that really annoyed me was people were thowing balls in the pool over my head all over the place. I can't stand that but it wasn't just the kids doing it. The resort is cashless. They give you a keycard to charge items. Drinks by the pool are not that great and very pricey. We stopped at a publix before the bridge to get sodas, water, snacks and drinks. We met very nice people thoughout our stay. Mostly families from NY looking to escape the cold like us. Can't imagine what it would cost for a timeshare here but I didn't dare ask and no one approached us about it. I'd recommend staying here for a few nights. I could have stay a night or two longer but I think I'd get bored after that.", "title": "Nice Stay", "user": "Southport-TRIP", "date": "February 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 98423981}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "As a family of five, we were looking for a warm weather vacation that satisfied the interests of all. Nature lovers, sun soakers, golfers and foodies will be happy with their stay at this resort.", "title": "Exactly what we were hoping for!", "helpfulness": 1, "user": "philadelphia5", "date": "February 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98414014}, {"rating": 5.0, "stay_parameters": "Stayed February 2011", "text": "Our particular two bedroom villa overlooked the marina which worked out nicely as it was within walking distance to the beach, sailing, restaurants, golf course and pools. I saw some families using rented golf carts, but it was not necessary where we were staying. The beach was well attended and spotless. The restaurants were overpriced---but we expect to see that on vacation. Our kids loved the pool and my husband and I enjoyed the fact that we could relax with a cold drink while the kids were happy doing their thing. I must also mention that Housekeeping definitely kept up with our three messy kids. The ladies were happy to help with our extra requests during our stay.", "title": "Awesome place best vacation I've ever been on!!", "user": "Tnsully", "date": "February 27, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 98291540}, {"rating": 1.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "Overall, the perfect winter getaway.", "title": "Horrible Rooms -- Misleading Website -- Total Ripoff", "helpfulness": 5, "user": "ceabee115", "date": "February 26, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 2.0}, "id": 98146488}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "Everyone should go amazing place!!Loved it! Very fun and relaxing for kids and grown ups service was awesome too!!!!!!!", "title": "great stay...", "user": "Dennis0155", "date": "February 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 97875486}, {"rating": 4.0, "title": "Good time, nice resort", "text": "The grounds are beautiful here as well as the beach and pools. We stayed in a beach cottage right on the gulf and it was very roomy and comfortable. However, it could use a little updating, for the price you would expect a bit more. There is plenty to do here and renting bikes is a great way to see the resort and get some exercise. The markets on the resort are totally unreasonable in their prices, I expected to pay more than at a regular grocery store but the prices are so high as to be comical. Be sure to stop at Publix before crossing the bridge to Sanibel Island. The restaurants we went to were pretty good. All in all a great time.", "user": "Dreaming", "date": "March 26, 2011", "id": 101654868}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "We went there for a wedding March19-22,2011.Everyone enjoyed themselves and had a good time.The rooms were nice,very clean and had two very comfortable beds.I will go back again next year.", "title": "SouthSeas Island Resort was one of the nicest Resorts that I have stayed at.", "user": "frankbousquet", "date": "March 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101565112}, {"rating": 5.0, "stay_parameters": "Stayed March 2011", "text": "I stayed here for a week in March with my two boys aged 5 and 7. Stayed at the bayside villas. The villa was nice, the one bedrooms have a nice open living area with a small but fully functional kitchen. There are many activities and great facilities. The restaurants on the property are good and reasonably priced. The main pool area is huge and overlooks the bay - it is beautiful. My boys loved the pool with the slides and going to the quiet beach area. One of the best things about the resort is that it sits at the north tip of the island and is gated and secure. It is a huge and beautiful property. The staff is willing to go the extra mile to make your stay pleasant. I could not find pull ups for my five year old - Rick and Daniel from the executive office found some for me. Kudos to South Seas! We will be back.", "title": "An excellent family friendly resort with many activities and great staff.", "user": "KentPChicago", "date": "March 25, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 101559056}, {"rating": 4.0, "title": "DO NOT RENT FROM ROYAL SHELL VACATIONS WHEN STAYING AT SSR", "text": "We booked a week vacation at the South Seas Resort through Royal Shell (Royal Shaft) Vacations because the resort was sold out. When I talked to Royal Shell they informed me that I could purchase access to the amenities and even told me to stay at a more expensive room closer to the resort pool because I had a 5 year old. When we got down there we were told that we COULD NOT purchase the amenities package. We could not do ANYTHING!!!!! (no chair or towel at beach, no resort pool, couldn't buy ice cream etc)", "helpfulness": 4, "user": "hodge440", "date": "March 24, 2011", "id": 101449577}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "Everything at the resort requires that you have an amenity card. Our place was outdated (the bedding looked about 20 years old)", "title": "Best vacation resort for Families!", "helpfulness": 1, "user": "LaurieMass", "date": "March 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 101131617}, {"rating": 5.0, "title": "pure pleasure", "text": "Just returned from a 4 day trip to south seas island resort. we are a family of 5, my husband and i with our 3 adult children (19 - 24). we had a wonderful time. the guys played golf while my daughter and i went to get a pedicure. the guys had a fabulous time on the course. my husband is a professional golf pro and really enjoyed the challenge of the par 3 course. we rented jet skis a couple times which was awesome. we spent time on the beach and in the pools. used the resort restaurant for the breakfast buffet and lunch at holy smokes........delicious. had dinner outside of the resort 2 nites. we stayed in a 3 bedroom beach villa which was perfect for us.......enough room for everyone to have their privacy. the beach villas are at the south end of the island so needless to say, we either walked or took the trolley to get to the other end. ten minutes was the longest time we had to wait for a trolley. there is certainly something for everyone at the resort and plenty of wildlife to appreciate. we had a wonderful time", "helpfulness": 2, "user": "novifamily", "date": "March 15, 2011", "id": 100283900}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We travel often and have a few favorites that we stay at. This was our first time at South Seas. South Seas will definitely be added to our favorite list!! It is beautiful there. The service is great. Our room had a beautiful view. The beach was awesome. The grounds are kept up very well. Loved the location. For being such a big resort, it is taken care of so well. Wish we could have stayed longer.", "title": "Paradise", "helpfulness": 1, "user": "amuench40", "date": "March 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100278559}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "We just returned from a 5 day stay at Captiva\"s South Seas resort. Overall, we really loved the resort and were very happy with our choice to stay at the Beach Cottages. We have a 7 month old and a 2 and a half year old, and wanted something easy and as close to the beach as possible, with a kitchen. We got that, and I liked the layout of the Beach Cottages, it was an easy place to stay with little kids, and the smaller pool near the cottages was perfect for them, no real need to go to the big resort pool until they are older.", "title": "Beach Cottages--Good and Bad--mostly good!", "helpfulness": 1, "user": "sundog888", "date": "March 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 100276501}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "That said, our individual unit (1408) was dated and not well-equipped. The entire contents of the condo probably cost approximately $500. When you are paying $800 per night, you expect comfortable chairs, decent furniture, and a kitchen that has some basic cooking equipment in it. We didn't get any of that.", "title": "Relaxing and fun", "helpfulness": 1, "user": "AnnArbormommy", "date": "March 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100082342}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "The condo also had some maintenance issues--we had maintenance out twice in the first few hours we were there--first to fix one of bathrooms, then the lock on the sliding door to the balcony. They did take care of the problems quickly, and the maintenance guys, as well as pretty much everyone else we encountered at the resort, were very friendly and accomodating.", "title": "Inconsistent", "helpfulness": 1, "user": "yellowplumtree", "date": "March 10, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 99710491}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 132, "average": 233, "very good": 450, "terrible": 88, "excellent": 672}, "aka": "South Seas Island Hotel Captiva Island", "slim_ranking": 1.0, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "South Seas Island Resort is located on 330-acres on tropical Captiva Island, on the west coast of Florida, just off the beaches of Fort Myers, Fl. South Seas is an iconic resort village combining a natural wonderland with modern resort amenities and accommodations. The resort offers many styles and sizes of accommodations including guestrooms, one to three bedroom villas, cottages and spacious private homes.Activities at the resort include tennis, golf, water sports programs including kayak tours, boating and parasailing. Kids will have a great time at the Sanibel Sea School while learning about the surrounding environment. Enjoy three lagoon style pools, complete with private cabanas located at the Pointe and H2Whoa with two fun water slides. The resort also features some of the best shelling in the world on the miles of sugar sand beach. For relaxation, the Kay Casperson Boutique and Spa is located in the South Village, providing special pampering with a complete spa treatment menu.Dining at South Seas Island Resort is as varied as the activities, with The Harbourside Bar and Grille and The Pointe located at North Pointe. Visit Scoops & Slices, located next to The Pointe, for ice cream or coal fired pizza. In the South Village, other options include Starbucks and the Captiva Provision Company, a gourmet deli."}