{"user_rating": 4.0, "review_count": 21, "name": "Sparrows Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The El Rancho Lodge will forever take up the best memories with respect to our honeymoon roundtrip in the western U.S.!", "title": "Most fond memories of our U.S. roundtrip!", "helpfulness": 1, "user": "tjielp23", "date": "September 17, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5808775, "likes": {"liked": "— Romantic atmosphere, quietness", "disliked": "— Window curtains are pretty thin"}}, {"rating": 1.0, "title": "Nothing special", "text": "After having been to Miami, Las Vegas and touring Utah and Arizona, we were ready for some quality relaxation time. Palm Springs being the next stop, we decided to go for a quaint, relaxed accommodation instead of a larger hotel chain. As we did not book upfront, we viewed about 5 rooms in different hotels, all of which left us feeling bad. We were about to book a room in the Quality Inn, when I spotted the El Rancho sign across the road. Since this was on my list of favourite hotels (prepared before our departure to the U.S.), I urged my husband to go check it out. The owner, Sandy, showed us a room and a patio suite. Even though they both seemed old-fashioned at first, we opted for the patio suite (we are both smokers).", "helpfulness": 6, "user": "A TripAdvisor user", "date": "May 29, 2006", "id": 5232742}, {"rating": 5.0, "title": "An oasis in the desert!", "text": "What can I say? Yes, the decor of the room is not the best and the kitchen comes straight out of the 50's/60's and yes, the breakfast is virtually non-existent. But ah, the quietness of this accommodation, the personal attention, the picturesque athmosphere... the pool, lit up at night, the romantic feeling of it all.... the extensive DVD library. We had the best time there!", "user": "A TripAdvisor user", "date": "April 22, 2006", "id": 4994735}, {"rating": 5.0, "title": "Great time at the El Rancho", "text": "Upon recommendation from the owner we ate at Manhattan (deli further on the road) twice. Brilliant and inexpensive. They have the BEST bakery and pastry section, which is open all day and where you can get a lovely breakfast in the morning. Starbucks closeby too.", "user": "Pythonesque", "date": "April 18, 2006", "id": 4985102}, {"rating": 2.0, "stay_parameters": "Stayed February 2005", "text": "We did have a car, this is necessary if you stay here, but don't let it bother you. It is great, driving Palm Springs at night!", "title": "Just Ok -", "helpfulness": 4, "user": "Amadoresoftravel", "date": "March 9, 2006", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 4597107}, {"rating": 5.0, "title": "Loved the atmosphere, quaint, quiet and RELAXING!", "text": "This charming little lodge is the perfect getaway. It is quiet, quaint, and very very relaxing. The rooms are sweet, with their full kitchens, and most are poolside. Their prices were unbelieveably low for Palm Springs. It is close to shopping, and very close to the downtown area. It really does have a \"home away from home\" ambiviance. They have a terrific pool and jacuzzi. Also, the continental breakfast in the mornings, which is included was an added bonus! It is definately worth checking out! Definately one of Palms Springs jewels!", "helpfulness": 11, "user": "A TripAdvisor user", "date": "June 5, 2003", "id": 1071293}, {"rating": 2.0, "title": "Lack the basics", "text": "Stayed at El Rancho Lodge for 3 nights in Rooms #2 and #12 (transferred to #12 as the other room was booked). Since both rooms face E. Palm Canyon Dr., the vehicular traffic was quite noisy; one can hear the traffic by 5:30 a.m..", "helpfulness": 2, "user": "A TripAdvisor user", "date": "March 2, 2006", "id": 4568797}, {"rating": 5.0, "title": "Great Hotel", "text": "There were four windows in room #2, and sheer curtains were inadequate in blocking out the sunlight shining through the windows.", "user": "elaine_shoe", "date": "August 15, 2005", "id": 3767044}, {"rating": 5.0, "title": "Perfect Palm Springs Haven", "text": "At dawn, temperatures got pretty cold, but the rooms had no portable heater. In Room #2, only the heater in the bathroom was functioning.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 28, 2005", "id": 3713154}, {"rating": 5.0, "title": "New Owners are the Best!", "text": "This place is no better than the Best Western, Travelodge, or Motel 6 just down the street, maybe even worse.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 2, 2005", "id": 3241080}, {"rating": 5.0, "title": "Best Experiance", "text": "The DVD player and small fridge does not make up for lack of basics.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "June 9, 2003", "id": 1073260}], "location": {"country": "United States"}, "variance": {"poor": 2, "average": 0, "very good": 3, "terrible": 4, "excellent": 12}, "aka": "El Rancho Hotel", "slim_ranking": 0.923076923077, "description": "An intimate desert hideaway with a hacienda flair...a relaxing oasis in a hurried world, with the personal attention of a country inn: Palm Springs' only ranch-style boutique hotel."}