{"user_rating": 5.0, "review_count": 304, "name": "Spillers Farm", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "We have just returned from an overnight stay at Spillers Farm as part of a dining experience at River Cottage HQ.", "title": "Go for it !", "helpfulness": 2, "user": "Nige7", "date": "October 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143130761}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We could not have been made to feel more welcome and the accommodation is first class - so a big thank you to Keith and Bridget. Perfect hosts !", "title": "Made to feel welcome", "user": "David_Pritt", "date": "October 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 142799461}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Having stayed at other B&B's in the area beforehand, this is by far the best, and so a great big thumbs up !", "title": "Perfect.", "user": "travelqueenUk", "date": "October 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142788022}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Thank you .....", "title": "Lovely stay at Spillers Farm", "user": "PaulBraydon", "date": "October 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 142387452}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "This was our first visit to Spillers Farm which was convenient for our visit to the Autumn Bash at River Cottage HQ. Keith and Bridget made us feel at home, and introduced us to their farm at feeding time. A lovely stroll around the lake, where we met the ducks who came to visit us as we sat watching the world go my, slowly. On the stroll back the the house the sheep came over for a tickle behind the ears.", "title": "Great B&B", "user": "Daniel H", "date": "October 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142368659}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "This was our second stay at Spillers Farm. Having enjoyed our one night last year we booked for 2 nights this time for our visit to River Cottage HQ. Bridget and Keith are the most lovely friendly hosts you could imagine. The farm is beautiful and Merrick the dog took us for a tour to stretch our legs after the drive down. The rooms are clean and comfortable with everything you need for a stay and the bed was probably the most comfortable bed I have slept in away from home. Breakfast is great and Keith's homemade sausages are the meatiest we have ever had. It is ideally situated for visiting this lovely area of Dorset and Keith has a great knowledge of the local area and can recommend plenty of places to visit.", "title": "Lovely Relaxing weekend at Spillers farm.", "user": "kevandcatt", "date": "August 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137930155}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "I am sure this will not be our last visit.", "title": "A great place for a restful night", "user": "Katrina C", "date": "August 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137902550}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "You will not be disappointed if you stay at Spillers Farm.", "title": "The real Good Life", "user": "TRC3", "date": "August 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137717865}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We stayed here for my dads 60th birthday after Sunday lunch at River Cottage. Keith and Bridgette gave us a very warm welcome and after a quick change we made use of the farmland and the lake to walk off lunch, even using the row boat!", "title": "Friendly and comfortable", "user": "Emma I", "date": "August 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 137139599}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We all slept very well in the accommodation and before we knew it morning had come round and breakfast was served...very delicious it was aswell. Great recommendations for our final day and we will definately be visiting again!", "title": "Perfect!", "user": "Rosie M", "date": "August 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137002849}, {"rating": 5.0, "title": "We cant wait to come back!", "text": "We just want to say thank you to Keith and Bridget for such a lovely break! Spillers Farm had absolutely everything we could ask for, lovely welcoming hosts, well equipped nicely decorated rooms with very comfy beds and a big selection of teas, coffees, biscuits and sweeties, beautiful scenery (even a lake) and lots of friendly animals to make the stay extra special! The cooked breakfast was a real treat every morning with yummy Spillers farm sausage, eggs and bacon (not forgetting the homemade jam!) We also particularly enjoyed reading the information pack in our room which had all the info you could need on the resident animals, places to eat, things to do and useful local numbers! We really had a lovely time Keith and Bridget should be very proud of their B&B we will be recommending it to all our family and friends!", "user": "Louise136", "date": "October 3, 2012", "id": 141911149}, {"rating": 5.0, "title": "Most Amazing B and B", "text": "A big thank you to Keith and Bridget for making us feel very welcome, the service at this bed and breakfast is amazing! Nothing is too much trouble ! I was very impressed by the range of teas offered, something for everybody! Only stayed for one night but it was soo relaxing it felt like a mini break instead! We will definitely be going back to stay for longer in the near future!", "user": "Sam H", "date": "October 1, 2012", "id": 141765007}, {"rating": 5.0, "title": "Little Gem", "text": "Spillers Farm is a wonderful place to relax unwind and be as one with nature, having a lovely lake to wander round or sit a while, or even try out the rowing boat. The animals were an added bonus with Marlene the pig and her 10 piglets, very comical, the sheep, ducks, (look out for limpy), chickens, Merryck the dog and Sila the cat. Keith and Bridget made us feel very welcome and showed us to our room. We chose the Superior Room, which was spacious, clean and well equipped, the bed was very comfortable with feather duvet and pillows. There was a choice of still or sparkling bottled water, and fresh milk in a small fridge replaced everyday to go with the wonderful selection of teas, coffee's and hot chocolate.", "user": "MandJDorset", "date": "September 21, 2012", "id": 140832708}, {"rating": 4.0, "title": "Very handy for River Cottage", "text": "The en-suite shower was huge with a selection of lovely toiletries. There were also make up remover wipes, cotton wool balls and buds, a lovely thoughtful added extra. The breakfasts were delicious with all home grown produce, and Keiths home made jams are to die for !!", "user": "bigredbucket", "date": "September 14, 2012", "id": 140248980}, {"rating": 5.0, "title": "Home from home (but without having to do the washing up!)", "text": "Keith and Bridget are wonderful hosts and nothing is too much trouble, always sparing the time to stop and have a chat, during their busy day.", "user": "Catherine C", "date": "September 10, 2012", "id": 139884453}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "Booked in for a night after going to a One Day Cookery Course at RC. Perfect location for that purpose, only 5 mins drive away. Not far from other local beaches - Beer, Seaton, Lyme Regis etc. Very pretty, green and lush views.", "title": "Lovely stay", "user": "Kate W", "date": "September 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139641375}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "Thanks to Bridget and Keith for being wonderful, friendly hosts. You guys really have hospitality down to a tea....its all about the detail! It did not go unnoticed ;-)", "title": "Warm friendly stay with fabulous hosts", "user": "Snazzle", "date": "September 3, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 139262935}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Rodney, Delboy and Cassandra wont be forgotten! Brilliant.", "title": "Wonderful", "user": "Jayne R", "date": "September 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 139179081}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Will definitely be back...", "title": "No ordinary B&B", "user": "dawne k", "date": "August 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 138583499}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Stayed at Spillers as we were going to River Cottage. Very convenient, only 5 mins drive away. Keith & Bridget were brilliant hosts, couldn't do enough for you. Room spacious & clean, full English delicious with their own cured bacon & sausages. You are free to wonder around the small holding & meet the animals. Merick the dog is very friendly & will walk with you. Fabulous stay, would certainly recommend.", "title": "Perfect stay completed by perfect hosts", "user": "Sarah C", "date": "August 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138553046}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 1, "average": 2, "very good": 14, "terrible": 0, "excellent": 287}, "aka": "Spillers Farm Musbury, Devon", "slim_ranking": 0.4, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "description": "Situated in some of East Devon’s most spectacular countryside, Spillers Farm B&B accommodation and holiday cottage is a haven of peace and tranquillity. Nestling in the beautiful village of Musbury, near Axminster, in the Axe Valley - an Area of Outstanding Natural Beauty - Spillers Farm B&B is a working smallholding, ideal for those going to Hugh Fernley-Whittingstall's River Cottage HQ. A recommended bed and breakfast and accommodation provider for River Cottage HQ and The River Cottage Canteen in Axminster, Spillers Farm is one of the closest B&B's to each, being just a a five minute drive away from both. It is also ideal for those wishing to explore the East Devon countryside and the coast, being just a few miles from the Regency seaside town of Sidmouth and fossil-hunting on the Jurassic Coast at Lyme Regis where celebrity chef Mark Hix has recently opened Mark Hix's Oyster and Fish House. Spillers Farm offers the visitor numerous options for a relaxing break. Stay for one or two nights' B&B in our comfy bedrooms, or for a week in Cassie's Cottage, the spacious, self-contained Devon self-catering holiday cottage. All our own produce in our breakfasts - home-reared rare breed sausages and hand-cured bacon, free range eggs, organically-grown tomatoes. We also sell the best quality pork, sausages, bacon and ham from our own rare breed pigs, succulent roasts from our own lambs and fresh eggs from our free range hens or ducks, so why not take some home with you?Working smallholding on the Devon and Dorset border. Five minutes from River Cottage HQ and 10 minutes from Lyme Regis. Gorgeous unspoilt views, private lake. Farm Shop and Tea Rooms on site using and selling own produce. Also self-catering cottage sleeping six. Guests are welcome to row round or picnic by the lake or help out feeding the animals(hand-bottle feed our lambs in the spring), or just relax in the comfy en-suite rooms. Dog friendly in cottage."}