{"user_rating": 4.5, "review_count": 1271, "name": "Spindrift Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We came to Monterey to celebrate our 9th wedding anniversary and we stayed for 2 nights in Marriott, but than decided to extend our trip. We were walking by this hotel and decided to check in. They gave us AAA discount. Room is so nice, clean, nice bath robes, safe and has wood burning fireplace and bay windows that can be open - and so we did to enjoy the sound of the waves. Bed is so nice and soft. They bring you complimentary continental breakfast to your room. Nothing to brag about, but coffee was good. Would love to come back.", "title": "Awesome experience", "user": "Aruba2004", "date": "May 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160374875}, {"rating": 4.0, "stay_parameters": "Stayed May 2013", "text": "Ticks all the boxes and more... great location, lovely comfortable rooms and good service. Complimentary breakfast is a great way to start the day and the wine/cheese hour stsrts the evening... all adding to the experience! Highly recommended.", "title": "Spindrift - a wonderful experience!", "user": "amandave63", "date": "May 11, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 160373037}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Could not have had friendlier staff, caring personalised service, we could not have been ma de to feel more welcome.", "title": "A totally charming ( and very comfortable) hotel - we loved it", "user": "matthewshreeve", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160019059}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Complimentary breakfast to your room and a complimentary wine and cheese late afternoon snack were unexpected and very welcome benefits from staying at this lovely hotel.", "title": "Comfortable and classy", "user": "Darlene C", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159935879}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "The room was beautiful and comfortable. Spent extra to have a waterfront room and it was worth it. We were able to walk everywhere, but found that we loved to sit (and nap) on the window seats with the cool breeze and salty smell....heaven.", "title": "The best hotel in Monterey", "user": "nico g", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 159871381}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "I have previously always stayed at the Plaza down the street, but this trip I decided to try the Spindrift for a change. It is a favorite of some friends of mine. They always stay at the Spindrift and love it. I was very very impressed--it is smaller and more intimate than the Plaza and it has more charm. The Plaza is nice,dont get me wrong, but it's a much bigger hotel. If you want more personal service and a more boutique, romantic type of setting, I highly recommend the Spindrift. Our room was beautiful, with a huge window overlooking the ocean. You could sit on the window seat and gaze out to sea. The sitting area in front of the fireplace was perfect and very comfy. Fresh flowers added a nice touch to the room too. In the late afternoon, they have a wine reception for the guests in the lobby.... and we tried some nice local wines. Very tastefully done. This is my new favorite hotel.", "title": "Very lovely place", "user": "greengoddess1960", "date": "June 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112923076}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We enjoyed our 1-night-stay in a slightly overpaid but very nice room. The staff was very friendly. BUT the breakfast was a JOKE!!! Obviously they were out of bagels and toast since we couldn't select them on the breakfast-list. So we ordered cereals and fruit. We got: cheese, 2 (mushy) strawberries, 2 bananas and 2 \"slices\" of orange along with the ordered muffins. The cereal came without milk!!!. The coffee was the worst we had during our 2 week trip (and we drank a lot of coffee). If our stay would have been longer I would have definitely complained. It's a good place with nice people but the breakfast just didn't live up to the hotel standard.", "title": "oh well.....", "user": "thetruth74", "date": "June 12, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 3.0, "service": 5.0}, "id": 112829148}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Stayed 3 nights at Spindrift Inn, didnt want to leave. The staff go out of their way to make guests feel at home. Walk in to a warm, inviting lobby where they serve complimentary wine/cheese everyday 4:30-6:30pm.Valet/bellmen are prompt, courteous, helpful. I had a cannery row room since I was on a discounted rate of $126 per night, bay view rooms were $269. Lovely rooms, with hardwood floors, rugs, comfy canopy bed, flat screen above the fireplace mantle, wood stocked in the room, sitting area along windows. At night you can leave the windows open and smell the fresh air. Also has a ceiling fan above the bed, small fridge in the corner, lovely bathroom stocked with high end products. Continental breakfast delivered to the room daily, very limited menu , would like to see them expand a little.This 45 room hotel is a 5 star and worth trying, I do agree cannery row side is a little noisy in the morning with delivery trucks and such, especially if your windows are open. Valet parking is $20 a night, but they do have free wi-fi. Cant wait to go back!", "title": "wonderful bayside hotel, excellent staff", "user": "indytraveler1", "date": "June 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112628187}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We stayed for two nights and the staff were always excellent and nothing was too much trouble for them. When we arrived, were were initially concerned that the area was quite busy with tourists, so we managed to pay to upgrade from a road facing room to one with a sea view, which is well worth doing for the relaxing views over the ocean. We opted for the Valet parking as there is no hotel car park, but there is a public car park within walking distance.", "title": "Warm and welcoming", "user": "DanAirUK", "date": "June 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 112622720}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "The outlook from the room over the sea was excellent. We had a visit from a sea otter just below the bedroom window and a sighting of 4 or 5 dolphins further out at sea. The continental breakfast delivered to your room was a nice touch, as was the wine & cheese in the evening. The hotel is in a very central location in the Cannery with many shops/restaurants nearby and the excellent aquarium just 5 minutes away.", "title": "Romantic Anniversary on Monterey Bay", "user": "CharyF", "date": "June 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 112278617}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We purchased the package that included a massage, champagne and $100.00 at the Sardine Can restaurant. We were given an upgrade on the room to an end unit 2nd floor with a partial ocean view which was very nice. The drawback was that you did overlook Cannery Row which was quite busy and noisy, although it was during the week so not as bad as it probably would have been on a busy weekend. The room was MUCH smaller than we expected and the bathroom had barely room enough for 1! The shower curtain was dirty and the floors needed a REAL good grout cleaning! The 1st day the continental breakfast was really bad, the muffins seemed to be leftovers, very dry and unedible. The 2nd day we opted for the bread and fruit that was much better.", "title": "Not quite what I had expected", "user": "rdheat", "date": "June 13, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 3.0, "service": 4.0}, "id": 113182319}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "The massage was wonderful. The 2 ladies arrived on time and made us feel very comfortable as we had never had an in room massage we were not sure what to expect. Pleasantly surprised!", "title": "Romantic", "user": "janellelewis1", "date": "June 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 113155853}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We had dinner at the Sardine Can and were quite disappointed. The food was VERY pricey and although the presentation was excellent the quality and quantity were definitely lacking. We forked out an additional $60.00 on top of the $100.00 certificate and did not leave feeling like we got what we paid for. The service however was excellent.", "title": "Most Romantic Room I've ever stayed in...", "user": "gfdeb", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 113094787}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "I am not sure if the restaurant next door is associated with the hotel but we did try lunch there one afternoon. The food was decent however note that their is only 1 refill on your soda!!!! I was shocked when they came back after my 2nd one and swiped away my glass and when I asked the waitress about it she said \"oh you only get 1 refill, do you want to pay for another\"? Come on now, can't you raise the price a little (it was already $2.50) and give free refills like all the other restaurants around???", "title": "One of the best we will definitely be back!", "user": "Roblesedo", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113071572}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Last thing, I think with the price of the rooms, the hotel should not charge for parking.", "title": "Perfection amid the tourist traps of Cannery Row", "user": "BuffCrone", "date": "June 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112936199}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "From the feather beds to the beautiful sound of the ocean crashing and crackling fire we couldn't have picked a more perfect place to celebrate our 12th Anniversay. We will be back and recommend to all our friends.", "title": "Best place to celebrate out Anniversary", "user": "bkwilliams", "date": "February 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56668683}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "This was one of the most comfortable hotels I've ever stayed in. My husband and I booked Cannery Row view to save some money and I was a little nervous about the reviewers who had said it was loud, but we hardly heard any noise at all...it was the off-season so it could be worse in summer. The room was so cozy with the fireplace and the window seat. The bed was so comfortable we didn't want to leave and the sauna in the room was fantastic! It was the perfect place to stay in the chilly weather. The wine reception is no joke...the wines are really good and you can pretty much have as much as you want and take it wherever you want...we enjoyed our wines and awesome cheeses on the rooftop deck and watched the sun go down. The included breakfast was great too...especially since you can order as much as you want. For included amenities, it was amazing how generous they were...we would have easily paid $20-$30 per person for the in room breakfast at any other hotel. The staff was great too, everyone was very friendly and helpful. I can't wait for the opportunity to go back to Spindrift!", "title": "Perfect for a relaxing weekend!", "user": "aknoble", "date": "February 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56195255}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Beautiful room with ocean view and fireplace. The staff could not have been more helpful or welcoming. This is a lovely hotel we would recommend for any getaway to the Monterey/Pacific Grove/Carmel area. Be sure to request a room with a view.", "title": "A beautiful room with a beautiful view.", "user": "MFSSantaBarbara", "date": "February 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55876039}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We stayed at the Spindrift Inn about 20 years ago and it still has nice rooms. Small but quaint and functional. Loved the sound of the ocean at night and a functional fireplace. Good place to stay for relaxation and romance.", "title": "Great place to stay", "user": "kenzarch", "date": "February 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 55513317}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The staff is very caring and attentive. Rooms are inviting, warm and cozy. Great place to go and just relax. We were able to enjoy time reading and watching tv in comfort. Great overstuffed chairs.", "title": "Staff and rooms are as awesome as the views", "user": "SanJoseSkywatcher", "date": "February 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55483098}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "My husband suprised me with this hotel and its the only place I have stayed in were you can light a real fire in your room (yes it works on gas,but you put real logs onto burn). The room was beautifully furnished with a huge bed which when you slept in it was like something from the story Princess and the Pea. You had a lovely window seat that over looked the beach. i was great listening to the waves lapping on the beach with a fire on,how romantic. Guys you will earn browny points with this hotel, the staff were excellant, Karen on Reception and Juliet the lovely lady form Vietnam who does the free wine service between 4pm-6pm. The hotel has a roof garden where we took our wine and cheese upto to enjoy the sun. You also get breakfast in your room free.Also eat at the Sardine Factory the food is amazing", "title": "out of this world", "user": "courtod", "date": "March 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59092404}, {"rating": 5.0, "title": "Gorgeous", "text": "My boyfriend and I stayed here in December, and it was absolutely divine. We had early check-in, and a corner room facing cannery row. First, the room was enormous with feather beds, and plush window seats. The interior was gorgeously decorated, and the amenities were generous. I was especially fond of the wood fireplace and rooftop garden. Also- the wine and cheese reception is amazing, don't miss it! The concierge was extremely helpful, going so far as to get us reservations and discounts at a local restaurant. It was so enjoyable that we're going back for our anniversary next week!", "user": "m_touhey2", "date": "March 19, 2010", "id": 58951123}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "This year for my husband's b-day & our Anniversary [which are a day apart] we decided to pack up the car, hit the PCH and see where the wind would blow us. We ended up in Monterey. With NO idea where to stay, we started looking thru the little brochures we had picked up at a Chamber of Commerce. After a quick discussion, it was decided that we would spend an evening at what sounded like a beautiful place: Spindrift.", "title": "PCH drive...", "user": "Sissypoo", "date": "March 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58576516}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "It was just as beautiful as had been described to us and more. From the moment we walked in the door, we were impressed. After a 450 mile drive up the coast, we couldn't have asked for a better place to relax. The ocean was literally right outside our window and the fireplace is THE perfect touch to an already magical ambience. Falling asleep in the featherbedding was AAAHHHHmazing....", "title": "A much needed weekend away at an Inn with the perfect ambiance for romance and relaxation.", "helpfulness": 1, "user": "SanJoseDandS", "date": "March 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58034951}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "we may just fly up there next time--but we'll MOST DEFINITELY be back.", "title": "Awesome place to stay... lovely, friendly and just perfect...", "helpfulness": 1, "user": "megalittle", "date": "March 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 57883845}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We spent our 20th anniversary at The Spindrift and had a lovely time. The service was amazing. Warm and friendly, from the second we arrived -early, as there is a 4p.m. check in, and that is the ONLY con. Even so, Renae assured us our room was already ready. She was even kind enough to make us reservations for that evening at The Charthouse, which is very nice and short walk from the hotel.", "title": "Fantastic service in a gorgeous location.", "helpfulness": 1, "user": "happeekamper", "date": "February 1, 2010", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54886417}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Our room was #408 and very cozy. Loved that it was a corner room, so that there was a window that faced the ocean, and the other faced Cannery Row. When we walked in, it was sweltering, but it was quicklynfixed by opeding the charming windows and letting in the sea air and using the ceiling fan to circulate. The room was very clean and pretty. I did notice a few small cobwebs in the canopy fabric of the bed. I know some people complained about the woodsmoke smell, but I found it added to the charm, and it was not overpowering. We never could figure out how to work the CD player, which would have been nice. There was a bottle of wine and a card addressed to us, wishing us a Happy 20th Anniversary. A very kind touch, which made it feel more personal.", "title": "An awesome and enjoyable experience.", "helpfulness": 1, "user": "alexsacramento", "date": "January 31, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54866848}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We put some things away and headed out for a walk on Cannery Row. When we returned, our bed was already turned down, and chocolates on the nightstand.", "title": "What a wonderful get away place right on Cannery Row", "user": "EdmondOKTraveler", "date": "January 25, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54330661}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "When we got to The Charthouse that night, we were given VIP seating, and personalized menus, congratulating us, as well as a very nice dessert on the house, after a decadent meal of scallops and prime rib. Like The Spindrift, the service was wonderful. The waitstaff was friendly and attentive and even the manager came by our table.", "title": "Delightful, Great Customer Service, Friendly Staff, Terrific Location", "user": "zeegal2", "date": "January 24, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54260651}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "The next morning, after sleeping in a very fluffy bed, with sounds of the ocean, we awoke to a silver tray breakfast brought to us. We had a relaxing moring, lingering over coffee and breakfast before noon check out.", "title": "Thanks for the memory", "user": "evocsteve", "date": "January 19, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53901281}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Great place to stay for families or couples so cozy & romantic!!! Great views !!! We stayed in the ocean view room & got the aquarium package!! Great deal!!! Refrigerator+ continental breakfast delivered to ur room!!!! Also a wine & cheese reception @ nite!!! Close to aquarium, Starbucks, & yummy restaurants!!!!", "title": "Great views & cozy", "helpfulness": 1, "user": "Roxy61580", "date": "June 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113943622}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "My husband and I are travelling the coast and decided to spend a little extra to stay at the Spindrift Inn.", "title": "Worth the extra $$", "user": "Kisstine25", "date": "June 16, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 113941061}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "Staff is very friendly and helpful. Beautiful rooms and Inn has a roof top patio. Fire wood in out room for the fire place, a bottle of wine, chocolate and a note to welcome us to the Inn. The continental breakfast is ordered by a card in the room and delivered the next morning. Great location, free wi-fi and wine & cheese (free) in the afternoons. Well worth the extra $$.", "title": "Absolutely wonderful Inn! Super friendly staff! Gem of Cannery Row!", "helpfulness": 1, "user": "Peacelovevacation", "date": "June 15, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 113767031}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We just got back from a 3 night stay at the Spindrift. We got the room for $219 a night. It was a great deal compared to other places in Carmel and Monterrey. The hotel is very quaint and in my opinion does not belong on the touristy Cannery Row. It has the charm of Carmel with a cute little beach in the back with a great view of the \"endless\" ocean. The room was spacious and maintained well. We enjoyed the little extras here: the chocolates on the pillows, Aveda bath products and the fireplace! We stayed on the second floor im a Cannery view room. It was noisy but it didnt bother us - if you've ever stayed in a city it's the same. We just left the TV o until the singers at Sly McFly's stopped and we slept with our patio doors cracked and the fire blazing. We had a wrap around patio - really nice to sit out on and people watch. The rooftop garden is well maintained as well and gives you a great picture of the entire ocean.", "title": "The best Hotel in California", "user": "marceeB", "date": "June 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113762256}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "This was our first visit to Monterrey/Carmel and we didn't really know where to stay. The drive into Carmel is about 10 minutes. I would say that this is THE place to stay in Monterrey! However, we did not enjoy the eating options at all on Cannery Row. If you want good food venture out to Lighthouse road (just a few streets over) or head into Carmel for delicious one-of-a-kind resturants or Del Monte if you want big chain resturants.", "title": "Beautiful ocean views right in the middle of town", "user": "preciouslizzy", "date": "June 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 113294404}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We decided on the Spindrift Inn at the last minute on Memorial Day weekend. We called the day before and were able to get an ocean view room using the AAA rate. The room was charming and quite comfortable. It was very relaxing to sit on the window seat with a gorgeous view of Monterey Bay watching the otters, boats and scuba divers. The cocktail reception was nice - we took wine and cheese to our room. As others have mentioned, the breakfast wasn't anything special but the overall experience and service were outstanding. We'll definitely return.", "title": "Ocean View Room was Spectacular", "user": "DFHS", "date": "June 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 114255302}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Chose based on TA reviews. This was way better than we expected. The rooms are gorgeous, big puffy beds, really nice seating area. We had a corner room with a double window seat looking over Cannery Row and the Ocean - the windows opened, it was great. The silver tray breakfast was good, the afternoon wine-time was really good. The front desk (table) ladies are really helpful - and you can tell they like their jobs, it is their pleasure to help!", "title": "Nice hotel", "user": "SueMass", "date": "June 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113997565}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "From check in until check out, the staff (reception and the rest) could not have been more friendly or helpful. The rooms were clean and very nicely annoited. We had a wonderful view of the ocean. Having traveled throughout Europe and the States, I would highly recommend to both couples and familes.", "title": "Cozy Hotel with Great Service", "user": "world61traveler", "date": "June 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 113962836}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "Great value, well located, friendly, excellent room with fireplace overlooking the bay. A great ecperience. We will be back!", "title": "Just great value", "user": "Aviator414", "date": "June 17, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 113953961}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "My wife and I are currently on our honeymoon that started in San Francisco and is taking us down the coast. By far this is the best hotel we have stayed in so far, great service, beautiful rooms, and great location and views. To top it off we left our room for a couple of hours and came back to a nice welcome gift of a bottle of wine and chocolates, and we did not even mention we were on our honeymoon. If I am ever in this area again I will definitely stay here again", "title": "Would not think twice about recommending this hotel!", "user": "jayham22", "date": "June 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113943779}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Stumbled onto this place and fell in love. We will certainly be coming back. Beautiful, central location - close to shopping, beach, nature walks, etc. Warm and friendly staff. Great value.", "title": "Beautiful, central location - close to shopping, beach, nature walks, etc. Warm and friendly staff. Great value.", "user": "Joel D", "date": "April 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 158590897}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Why does Trip advisor require a minimum review length - this is lame...", "title": "2nd visit and we still love it", "user": "2peripatetics", "date": "April 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 158329533}, {"rating": 5.0, "title": "Outstanding Cannery Row accommodation", "text": "Downtow Monterey along Cannery Row is pretty touristy but if you'll be there anyway, try the Spindrift Inn...it's wonderful. This was our second stay and we just love the ocean front corner rooms. The rooms are very nicely decorated and quite comfortable: great bed and linens, 2 comfortable upholstered arm chairs with a shared ottoman, window seats and a set of binoculars. It's more like a the private residence of a friend who knows how to do it right than a hotel room.", "user": "Harry_Melbourne_Aus", "date": "April 19, 2013", "id": 158248767}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "From the comments I've read, not everyone likes the continental breakfast. If you're looking for a big, cooked breakfast - bacon, eggs, etc - go out for breakfast. But if you might enjoy a light breakfast in the privacy of your own room, give it a try.", "title": "Very Cozy", "user": "Benzarch", "date": "April 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 158140376}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "One tiny disappointment: It sounded like there was a family of baby elephants upstairs from us so next time we stay (and we certainly will), we'll ask for a top floor room.", "title": "An oasis in the middle of Monterey", "user": "ginge21", "date": "April 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157969297}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "I planned a trip down the coast for my husband's 60th birthday. The Spindrift was the perfect spot. The location is fabulous- our room had a water view with complimentary binoculars to watch the dolphins and seals from our window. Room was beautiful - loved the fireplace and feather bed! When the staff (Renee) found it was my husband's birthday she sent a bottle of pinot noir to our room. From the staff to the accommodations to the picture perfect location this Inn is a must!! We'll be back!", "title": "Wonderful romantic getaway!!!", "user": "AuntieMia", "date": "March 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57846498}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "I surprised my wife for her birthday with a weekend get away to the Spindrift Inn. My wife has wanting to stay here for some time. Spindirft was everything we expected and more... The front desk was very helpful the concierge was right there to help with restaurant recommendations, the cheese and wine reception @ 4:00pm was a nice relaxing time to chat with fellow guest in front of the large fireplace in the lobby area. It was wonderful to wake up to the ocean waves at our window every morning and a continental breakfast served in your room every morning. If you get a chance don't miss the opportunity to stay here!!", "title": "Great Romantic Get Away", "helpfulness": 1, "user": "deadgrassdog", "date": "March 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57528148}, {"rating": 5.0, "title": "Motorcycle trip to Santa Cruz and back...what an amazing hotel!", "text": "First rate lodging right on the Waterfront with Bay windows that opened out for an amazing panorama view! Juat an amazing stay!", "user": "AnjanetteC", "date": "February 25, 2010", "id": 57101768}, {"rating": 1.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We were having our morning coffee and enjoying the view from the room when the bathroom started flooding. The sewer system was coming out of the shower and the bath tub was full of sewer water. We started getting our bags out of the room into the lobby and the front desk said, I'm glad you are already packed and asked if they could get our car us. At $400.00 + a night there was no offer to refund money, we would of stayed the last 2 hours of our time and enjoyed the view and the balcony over looking Monterey instead we were whisked from the hotel with have a nice day with toilet water following us to the street.", "title": "Plumbing Problems", "helpfulness": 2, "user": "wwwwwwwwSca", "date": "February 22, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 5.0}, "id": 56761470}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "My husband and I planned a last minute getaway for our 17th wedding anniversary. Spindrift Inn was only an 1 1/2 hour drive from the SF Bay Area but I felt as if we were in a whole different world. The service, reception area, the room, the fireplace, the bed, the robes and everything, down to the smallest details, were perfect. No wonder Spindrift Inn was voted Best for Romance in the U.S. We will definitely make a trip back.", "title": "So very romantic", "user": "travlnmrsdarcy", "date": "February 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56719494}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Been aware of the Spindrift for years...never stayed there until now. What a mistake! This hotel is comfortable and friendly, and has all the amenities needed for a getaway weekend. We loved our room, listening to the seagulls all night and the \"white noise\" of the ocean. The Spindrift seems like a hidden gem on the coast. We'll definitely go there again soon!", "title": "Perfect Weekend Getaway!", "user": "Jeannie R", "date": "May 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159713099}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We arrived two hours before check-in and learned that if a room's ready to go, you can check-in and go upstairs.", "title": "One of the best locations in the world!", "user": "Alex R", "date": "May 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159448507}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "The Spindrift is located right on the Monterey Bay, which is exactly what we wanted. We were on the 4th (top) floor with a bay view. Is that view mesmerizing! If we'd been looking for a different experience, we might have been content to never leave the inn. Our room view was spectacular and the rooftop garden view is even more so.", "title": "Customer for life!", "user": "BigDaddyBru", "date": "April 30, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 159305388}, {"rating": 4.0, "stay_parameters": "Stayed April 2013", "text": "The continental breakfast is delivered to your room!", "title": "Very Romantic get away for my husband and I.", "user": "Shellshrman", "date": "April 28, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 159030130}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "One of the best values around, I'd say!", "title": "The Spindrift Experience: Boutique B&B Feel - Very Courteous Staff!", "user": "Bo Z", "date": "April 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158804281}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "I needed to have one day of rest and rejuvenation and I got it at Spindrift from the featherbed to the soothing music to the wood-burning fireplace to the bath salts-- I was so comfortable and it was a beautiful stay! The continental breakfast in the morning was very nice as well.", "title": "Exquisite!", "user": "CPia", "date": "April 16, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 157960980}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "This B&B vibe hotel is a gem!! The attention to detail and the staff were far beyond our expectation. The location of this hotel is hands down the BEST! The small beach right in Cannery Row has been a favorite of mine for years!!!", "title": "Worth every penny", "user": "Helen731", "date": "April 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157924659}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "I wanted a romantic one-night get away for our 2nd Wedding Anniversary, and my wife and I are so glad that I chose the Spindrift. Everything about our stay was perfect.", "title": "A Wonderful Romantic Experience", "user": "TravelingB0B", "date": "April 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157550070}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled solo", "text": "All of the Spindrift rooms have fireplaces that use gas to burn the split wood logs, but when I found out that not all rooms have a full canopy covered bed, I upgraded our reservation to an ocean view corner room. It was amazing. There's nothing like hearing the waves outside your window while the room is lit only by the light of the fireplace. A little wine and that king sized canopy bed, and you have the perfect romantic night. Oh...and the bed was amazingly comfortable. I wish I could replace my tempurpedic at home with the bed from the Spindrift!", "title": "Spindrift Hotel", "user": "Katherine N", "date": "April 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157368583}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The hotel is perfectly located on Cannery Row, with easy walking distance to most attractions. All the staff were extremely helpful and polite, from the time we drove up to the valet stand until we finally said goodbye. The hotel has an excellent \"happy hour\" with wine and cheese and an opportunity to just relax in the lobby in front of a fireplace.", "title": "Wonderful stay", "helpfulness": 1, "user": "JimD811", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157113115}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 26, "average": 49, "very good": 206, "terrible": 21, "excellent": 969}, "aka": "Spindrift Hotel Monterey", "slim_ranking": 0.0377358490566, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}}