{"user_rating": 3.0, "review_count": 735, "name": "Split Rock Resort & Golf Club", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "Just spent several days in a Westwood Villa with four adults and two teenagers and can't wait to go back. We were in a recently renovated villa (1010) and were very impressed. I expected a lot of woodpaneling, but there was none to be found. Instead we found modern wallpaper throughout. I loved the full kitchen and cooked daily. The gas fireplace was great, just push the switch and instant fire. The jacuzzi was wide and deep and the sauna looked nice, but we never used it. The three bathrooms and three televisions made everyone happy. The villa is very large and no one felt cramped or got in each other's way. The kids loved being upstairs on the pull-out since they had access to the largest t.v. and refrigerator. The layout is perfect, everyone has their privacy. We skied and snowboarded at big bolder, we also had a lot of fun tubing together. The family tubing should not be missed, but get there early to avoid a long line. The Galleria is directly across the road - what a fun place - the arcade and bowling alley were great, the movie theatre is there, along with a very large pool, a large romantic lagoon type hot tub which is upstairs by the gym. Also upstairs is the ping pong tables, and pool tables. Downstairs also has great indoor tennis courts, a nice restaurant, ice cream parlor, bar, night club and a large sunken lounge. As you can see, there is plenty to do whether you ski or not. While the kids are entertaining themselves, we also want to recommend Benchwarmer's Bar. Earl, the bartender is attentive and friendly and the sausage pie and chicken wings were delicious. You will really enjoy Split Rock and will not be disappointed. To be fully prepared I recommend bringing the following if you are staying in a Westwood Villa: salt/pepper, non-stick frying pans, napkins, shampooo/conditioner, a comforter or two, coffee, tea, sugar, and of course, whatever snacks, alcohol and food you plan to eat. Oh, and don't forget quarters for the toll road.", "title": "Terrific Family Fun", "helpfulness": 13, "user": "ChampagnePrincess", "date": "March 1, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4568049}, {"rating": 3.0, "stay_parameters": "Stayed January 2005", "text": "We stayed at the Split rock resort January 2005. We had 3 adults and three children, so they set us up in the Villas. It was spacious split level with three bedrooms, had a whirlpool tub, sauna, fire place. It was nice, though; it was in need up an update. We stayed during a holiday weekend. snowtubing line was a loonng wait. Though, the ski lifts weren't bad for waiting. Also, the rates were very high since it was a holiday weekend. They don't actually have skiing on the resort, but very close by at Big boulder and Jack Frost. They do have sledding on site which is free. My six year old son absolutely loved it. Our stay included a meal plan. If you do this be careful. My daughter ordered a caesar salad instead of an entree and they charged us for this even when I tried to explain this was her entree. So, just be aware of what is does and does not include. The dinner at the Lodge was quite good. The meals at the Galleria (main building) were Ok breakfast was buffet style. Also, the Galleria is were the action is for activities...ping pong, pool, swimming, bingo, movies, gift shop, you can buy discount tickets here for skiing. All in all we had a very good time. We didn't want to leave. My advice, don't go during a holiday, be careful with the meal plan, don't expect ultra deluxe accomadations, and have a good time. We did!", "title": "we had a good time.", "helpfulness": 16, "user": "Melli56566", "date": "February 7, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 2.0}, "id": 4442426}, {"rating": 3.0, "stay_parameters": "Stayed January 2006", "text": "We just got back from spending a long weekend at the Galleria and I was pleasantly surprised with our visit. I must admit that I really did not want to even go here after reading the prior reviews of this facility. But my husband said to give it a chance after we had already traded our 5 star Orlando timeshare at the Marriott Grade Vista for a week in the Poconos. We had a two bedroom unit in The Galleria. It was a non-smoking unit and was spotless. It smelled fresh and clean and did not smell of any smoke. I am extremely sensitive to smoke smells, but there were none. The bathrooms and the kitchen were very clean and the towels and bed linens were fresh as well. We had a beautiful view from our windows of a small hill covered in snow and pine trees. It was very pretty and relaxing. We were in unit 3680/ 3681. We traveled with our two children a 3 year old and a 7 month old. I was very nervous about the unit being clean enough for them, especially for the baby who is crawling all over. But carpet looked brand new and was very clean as was all of the furniture. We made use of the indoor pool, which was clean, used the bowling alley several times and my husband even won money playing bingo! We ate once in the restaurant in the Galleria, the food was OK but the menu was limited. We ate in the ice cream pallor on Sunday, but we were disappointed to find it closed on Monday. All of the restaurants in The Lodge were closed on Monday as well which was odd considering it's a ski resort. We did eat at The Terra Cotta Cafe down the road for lunch which was really good as well as charming. The rest of the time we used the kitchen in our room. All of the pans and dishes were clean. The Galleria had an entire list of activities going on all of the time. We were limited in what we could do because of our small children but had a good time. King Kong was playing at the theater but we didn't go considering that it is over 3 hours long. Our room had a VCR and DVD player so we brought some movies from home to watch at night once the kids were asleep. I would here again. It was clean and we never had to leave the Galleria unless we wanted to find something else to do that they didn't offer. Keep in mind it is the Poconos so some things do look a little dated but if you remember that it's not owned by Disney and don't expect the sun, moon and stars you should be pleased!! Happy Vacationing!!", "title": "A pleasant experience", "helpfulness": 15, "user": "RoomServiceMe", "date": "January 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 4349556}, {"rating": 3.0, "stay_parameters": "Stayed December 2005", "text": "This is our 2nd trip there. We are timeshare owners and got this vacation for $149 for the week. We stayed in Westlake - Villas. They were a great improvement from the time we stayed at the Galleria (a converted hotel in need of updating). A 2br, splitfoyer with bedrooms on lower level, a fireplace, updated appliances, but outdated carpet, furniture, and bathroom fixtures. The toilets clogged a lot and the water had to run awhile to get clear in the tubs. But it was large, clean, comfortable..just don't expect the Ritz. The onsite activites and amenities is why we go here every chance we get. Activities GALORE, lots of amenities (their sleeping accomodations are not great though) like onsite sports complex, basketball, golf nearby, kiddie corner daycare, bowling, movie theatre, restaurants, 2 pools, massage therapist, coming soon (onsite indoor waterpark), discount tickets, shuttle service to New York City and other sites. They have tons of games, a bar with live bands, the restaurants are convenient. GO TO DINNER at TERRA's COTTAGE the food, service and decor was great!", "title": "Fun..Fun..Fun..in Lake Harmony", "helpfulness": 12, "user": "lprstn", "date": "December 31, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 4.0}, "id": 4313770}, {"rating": 1.0, "title": "close down", "text": "first of all we were there early dec,when we were trying to find the resort we called and the front desk gave us wrong directions they should have said they dont know and put someone else on the phone that was 1. the second thing was the .25 to enter which is crazy and the security guard was basically arguing with us about it, the 3rd thing was the horrible stay the resort is so dirty i wonder if they have housekeeping and if they do were are they. the room and the resort smells of smoke which we dont smoke. you have to pay for everything and the high prices for not good service, the rooms are not nice there not updated by no means, when you need something the night staff really doesnt care to much you just get looks like i dont know what to do or you get the morning shift can help you i dont want to wait that long. (why should I) a lot of things were down. and then time share bothers you when you dont want them to. i would not buy there for nothing, i heard they were going to open a water park i wont go there if there pools are horrible and dirty whats the park going to be like not well maintained the .the decor is boring nothing to look at. not really kid friendly. the arcade is so small as the work out room alot of machines are down, or people dont know how to help you. when you need something done for maintance they take forever and when you call the desk they say they will there shortly.no bellman, no conceige, no nothing. get with it or close your doors. i dont forseee you being around to much longer sorry but the stay was horrible and we will never be back.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "December 21, 2005", "id": 4255140}, {"rating": 2.0, "title": "Great services, lousy service", "text": "This resort has everything except workers who want to be there. As long as you keep your contact with the staff to a minimum, you will have a great time. The golf course is very good and extremely challenging. The miniature golf was great. Bowling was a lot of fun. The food was fine as long you kept to standard american fare - the jambalaya was horrible and the don't even think about getting the tiramisu.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "July 21, 2005", "id": 3690323}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "The wife and I stayed Oct 4th-6th. We stayed in a cottage as no regular rooms were available due to a convention. The only negative comments we have were my wife didn't sleep well because of the uncomfortable bed (I slept fine); the cottage had a fireplace but we had to drive to the gift shop to buy a few logs as they do not provide them; and everytime you enter the resort there is a toll gate at each side and it costs 25 cents. Now 25 cents is not much at all and I didn't mind paying it just would have been nice to know that in advance.", "title": "Just got back from our mini-vacation at Split Rock", "helpfulness": 11, "user": "FatherOfTwins40", "date": "October 7, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4000467}, {"rating": 1.0, "stay_parameters": "Stayed September 2005", "text": "The positive comments we had are the cottage was very private and quiet; the staff was very friendly; and we went to the indoor pool which was only a minute walk away and had it all to ourselves. I found the place to be very clean. The only meal we ate there was the breakfast buffet which was good.", "title": "Don't - don't - stay at the Lodge at Split Rock", "helpfulness": 13, "user": "waltlayton", "date": "September 25, 2005", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "service": 2.0}, "id": 3937804}, {"rating": 1.0, "stay_parameters": "Stayed August 2005", "text": "There weren't any kids there due to the time of year but there is plenty for them to do if there were kids there.", "title": "Tired, poorly managed, and misrepresented", "helpfulness": 9, "user": "greenwichgirly", "date": "August 27, 2005", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "service": 1.0}, "id": 3811160}, {"rating": 2.0, "stay_parameters": "Stayed July 2005", "text": "Overall the place was a fun time and there is lots to see in the area within a 30 minute drive.", "title": "Bad experience - watch your credit cards!", "helpfulness": 13, "user": "cathijaxs", "date": "August 9, 2005", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 3750722}, {"rating": 1.0, "title": "Terrible place!", "text": "I can think of nothing to recommend staying here. We stayed two nights in the Lodge. It is completely outdated; I can't decide between shabby and seedy to describe it. Musty odors in the hallway, old, faded and worn furniture and carpet, dirty windows, dirty, gritty floor around the indoor pool.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "August 2, 2005", "id": 3729938}, {"rating": 1.0, "title": "Beware!!", "text": "Beware!!! My family and I arrived at Split Rock \"resort\" over Thanksgiving weekend. The first thing I noticed was the stench of cigarette smoke throughout the entire Galleria building. The decor was unatractive to say the least and the building was filthy. We arrived at our nonsmoking room which of course wreaked of smoke as well. We requested a change and we were moved to the Willowbrook Suites. I have to say that although the Split Rock Resort was extremely under par, the Willowbrook Suites were clean, attractive and really quite lovely. If only we didnt ever have to go to the other parts of the resort for the food and activities... then the Willowbrook would have been fine. The activites offered were all in the Galleria building and although there were numerous activites, most of them were not working, broken or closed down. The pool was disgusting and filthy. The food was mediocre, similar to.. but not as good as Diner food. This resort is costly but luckily when we left 2 days early", "helpfulness": 26, "user": "A TripAdvisor user", "date": "December 13, 2005", "id": 4240945}, {"rating": 1.0, "stay_parameters": "Stayed November 2005", "text": "some of our $ was refunded. We will never return to this \"resort\" and I felt the need to write this review in order to warn others!", "title": "Not impressed!", "helpfulness": 12, "user": "Wildcat228", "date": "December 2, 2005", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 1.0, "service": 2.0}, "id": 4159088}, {"rating": 1.0, "title": "BIG Disappointment", "text": "My husband and I were completely unimpressed with this resort! We arrived after dark and nothing was well lit! We had to get out and walk to find the right villa, because you could not see any numbers from the street. (After bad directions from the front desk). We then went to the pizza restaurant on site... Do not do it! It was terrible and they tried to charge us for tap water!", "helpfulness": 23, "user": "A TripAdvisor user", "date": "November 9, 2005", "id": 4102097}, {"rating": 5.0, "title": "We loved It!!", "text": "Upon arrival to the unit, I found several spiders.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "November 2, 2005", "id": 4082245}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "The unit was described as \"rustic\" - I personally would call it outdated and dirty. The kitchen was tiny, unclean and the microwave had to be the first to ever be invented. The back door would not even lock! The 2 person jacuzzi was the only highlight of the entire week!", "title": "Willobrook Units at Split Rock Resort", "helpfulness": 10, "user": "dbirchRhodeIsland", "date": "October 14, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4022545}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 116, "average": 141, "very good": 222, "terrible": 125, "excellent": 131}, "aka": "Split Rock Resort & Golf Club Hotel", "slim_ranking": 0.333333333333, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.0, "rooms": 3.5, "location": 4.0}}