{"user_rating": 4.5, "review_count": 168, "name": "Springhill Suites Albany-Colonie", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "The staff were exceptional here. Our room was very clean and comfortable. The extremely small pool and lack of a jacuzzi was a bit of a disappointment but not a big deal. Price was quite reasonable for the quality, size of the room, and amenities in the room. Conveniently located to lots and lots of restaurants and mall and stores.", "title": "Very professional staff at this nice hotel", "user": "happyinvt", "date": "May 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160411321}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "I stayed here for two nights and thoroughly enjoyed my stay. The place had very comfortable beds and the rooms lacked some of the stains I have seen in comparable hotels (sorry Hyatt). The breast fast food was better than average and featured blueberry waffles and assorted meats.", "title": "Excellent place to stay in Albany for business or pleasure.", "user": "Anthony G", "date": "April 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 159073640}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "The staff were average except for Kaitlyn and Catelyn; they were superb. Very friendly and personable. The housekeeping staff also was top notch. The lady who took csre of the fourth floor was great. The hotel also featured two elevators....a definite must.", "title": "Very Nice Hotel", "user": "shar615", "date": "April 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158193200}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "My only suggestion is if you are staying here for over a week, get a suite, not a studio. The latter could definitely get cramped after a few nights. My only complaint are the tv sizes....they could be bigger, on par with Hyatt Place.", "title": "Super staff", "user": "Dirigo9", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157061076}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Great stay....will be back.", "title": "Great value", "user": "DCBiztraveler", "date": "April 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 156998888}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "When I arrived, my first impression from the surrounding area was \"this is probably not as nice as I thought it would be\". Upon arriving inside, its very nice, clean, and up to date. The young lady at the front desk was very friendly and welcoming, and she let us check in early. The room was a very clean, up to date suite. I got this room on priceline for less than half of the online listed price and I am shocked at what I got for the money. Theres even an all you can eat buffet with they typical scrambled eggs, waffles, yogurt, oatmeal, fruit, and juices, INCLUDED.", "title": "Nice place for the money", "user": "MatthewJPeacock", "date": "March 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 155503812}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I have visited this hotel mutiple times over the last 1 1/2 years for work and I have to say that I always am satisfied with my visits. Michael at the front desk is fantastic and always quick to help out. The hotel is kept very clean and I have never had any problems with the maid service. The WIFI can be unpredictable but I believe they have that worked out now. The location is great. It is very close to the freeway and multiple restaurants including Koto Japanese Steak House and Delmonicos (one of my favorites). I have not been there in a while but I look forward to my next trip.", "title": "Mike is fantastic everytime I go there", "user": "Stephen W", "date": "March 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 155471863}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "I stayed at the Albany SpringHill off and on for over year, and while it is a myth that a hotel is like home or a staff can make you feel like home, the staff at the SpringHill does their best to make one's stay as trouble free, convenient and comfortable as humanly possible. Carrie Kerr has the textbook skill of managing the hotel with the dexterity of a winning football coach but never misses the opportunity of providing assistance with any request or issue, no matter how large or small. The staff is just short of excellent and seem to anticipate any request or need, more importantly they pay attention to detail. All of this and with a sense of humor and an uncanny ability to pick up when you have had a bad day.", "title": "A great place with great people", "user": "Room213", "date": "March 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 155295650}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "The rooms,the building and the grounds are kept meticulously clean. The buffet Breakfast is well throughout and satisfying to even the most pickiest eater.", "title": "Great staff. Nice new hotel", "user": "sdr138", "date": "March 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 155223896}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Without a doubt a great place for the lone traveler and particularly great for couples and families that want a clean, safe and friendly place to stay.", "title": "Clean, Comfortable Hotel", "user": "Summergirl1959", "date": "March 17, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 154912038}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "I wish I could rate the SpringHill Suites in Albany/Colonie, NY higher because there were so many very good features to our room there, unfortunately a number of annoyances, including a number that made it difficult for two people to get a good night's sleep, prevented that. For some, including those traveling alone and those who are heavier sleepers, the SpringHill Suites may well rate higher. The details follow.", "title": "Wish I Could Rate It Higher", "helpfulness": 1, "user": "Rags2006", "date": "June 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 162857542}, {"rating": 4.0, "stay_parameters": "Stayed May 2013", "text": "Some aspects of this property were much appreciated. We occupied room 433, a larger king bed suite. As is often the case these days, \"suite\" did not indicate a unit with two separate rooms, but in this case the separation between living/working area and sleeping area was much greater than in many other modern one-room \"suites\", and the unit as a whole was much larger than most hotel/motel rooms, and even larger than most other one-room \"suites\". The desk/working area, with Ethernet connection, task chair, and good lighting, was separated from the sleeping area by a floor (almost) to ceiling unit that closed off more than half the width of the room. If less privacy was desired, the section above the desk consisted of sliding panels which could be opened giving the unit an open, spacious feel and facilitating communication; closed, the separation between areas was good. The working area also contained a convertible sofa and, off to one side a kitchenette unit of microwave, coffee maker, and (surprisingly effective) small refrigerator. Thoughtfully, the microwave came with a disposable kit of disposable plastic plates, tableware, and napkins.", "title": "Not bad for a one nighter...worth the price I paid", "user": "jlg72085", "date": "May 30, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 162484534}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "The HVAC wall mounted unit with separate controls on the opposite wall worked well, although the control/thermostat took a bit of figuring out initially.", "title": "Very clean, great stay", "user": "FunInTheSun761", "date": "May 29, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 162320814}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "The window opened and the sliding section had a screen making it useful; the option to have fresh air, as always, is very welcome.", "title": "This is an awesome place. The staff is super-friendly!", "user": "cmhcoop", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162201599}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "While we stayed on a Marriott \"certificate\", I'd checked prices and the SpringHill Suites was relatively reasonably priced compared to (the many) comparable properties in the area of the Airport, Wolf Road, and Central Avenue.", "title": "Very nice stay", "user": "Nrknits", "date": "May 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 161869109}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "We have a son who plays sports at UAlbany, so we've been visiting quite often this year. We initially stayed at Spring Hill Suites solely because of the price and the free breakfast (parents of a college student have to stick to a budget!), but it is the wonderful service at this hotel that has kept us returning! We tend to arrive at night, so we're greeted by Michael at the front desk, who is just a gem. He made us feel welcome from the first visit, by helping us find a late-night restaurant, suggesting places to visit, and hinting at some local shopping gems. Michael is a font of information and shares it willingly - what a great person to have at the front desk! Similarly, other staff members are helpful, kind, and polite. We won't even consider staying elsewhere when we're in Albany!", "title": "Such a great hotel, and the low price isn't the main selling point", "helpfulness": 1, "user": "GayleTee45", "date": "March 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 153656330}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "I must say my husband and I have traveled quite a bit, and covered quite a few states in the U.S. in the last ten years, but this is truly the first, very first time I have been blown away by the front desk checkin!!!! I arrived early to get settled in before picking up my husband at the airport and was immediately greeted by Michael. The most friendliest, beautiful smile, efficient hotel desk manager I have ever come in contact with!!! I have never been made to feel so special as I did with Michael. Upon picking up my husband and returning, as swamped as he was with check-ins, as I looked over and called out \"I've got him\", he immediately came from behind the desk and greeted my husband just as he had upon my arrival and made sure everything was to our liking. In all honesty, there is nothing about our stay that doesn't rate all the stars possible. We really love the decor and how the baths are situated with lovely glass pocket doors. Everything about this establishment is top notch in our opinion!!! I hope you are as lucky as we were to be greeted by Michael upon your arrival also. . . . SUCH A TREAT!!!!!", "title": "Doesn't get any better!!!", "helpfulness": 1, "user": "DACOE1953", "date": "February 25, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 153154332}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Have stayed in this fairly new property several times. Location is near the airport and all the restaurants on Central Ave and Wolf Road. Staff has always been friendly and helpful. Having stayed in many Marriott brand properties, this one is superior. The Courtyard and the Marriott on Wolf Rd can be very pricey, this place typically has good room prices. Albany can be expensive when the legislature is in session and when they are racing at Saratoga", "title": "Nice location great property", "user": "alice a", "date": "February 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 152128885}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "I have stayed at a lot of Marriotts and you can expect very much the same thing, especially for similar brands. I had never stayed at the Albany-Colonie Springhill, but I gave it a random try. I was on a trip I did not want to make and was honestly in a very bad mood because of it, but the staff changed that right away. Right from the beginning the desk manager, Mike, was so friendly and welcoming. And this positive attitude is true of the whole staff, all of whom were also knowledgeable and professional. I've got to say, even the housekeepers were upbeat, smiling, always saying hello. Like most Marriotts, this hotel is up to standard, it's clean and spacious. But what really makes the difference and the reason I would recommend it is because the staff is amazing. Thank you!", "title": "Clean & Spacious, but Staff Makes The Difference", "helpfulness": 1, "user": "Ronald O", "date": "February 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 151648165}, {"rating": 4.0, "stay_parameters": "Stayed February 2013", "text": "The service at the hotel is stellar. From beginning to end the experience was better than I expected for a short overnight stay.", "title": "Excellent experience.", "helpfulness": 1, "user": "ByAirByLandBySea", "date": "February 2, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 151274269}], "location": {"country": "United States", "city": "Albany"}, "stars": 3, "variance": {"poor": 6, "average": 17, "very good": 59, "terrible": 3, "excellent": 83}, "aka": "Springhill Suites Albany-Colonie Hotel Albany", "slim_ranking": 0.14}