{"user_rating": 4.0, "review_count": 67, "name": "SpringHill Suites Tempe", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "Room was clean. Size was perfect. Beds were fine. Location a block from Mills Mall and about 10 minutes from the Sky Harbor Airport. We were catching an early morning flight, so this was a quick overnight stay on Xmas night. Would stay again Thanks!", "title": "Spot On!", "user": "Bobkatevan", "date": "December 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 188839929}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "This hotel is very convenient to Highways, Shopping and Restaurants. The rooms are just what you would expect for a bargain hotel. Staff was friendly and helpful. Registration was quick and painless. Overall service was very good. Easy parking and quick checkout.", "title": "Good for Business Stay", "user": "bmb11", "date": "December 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 188460755}, {"rating": 2.0, "stay_parameters": "Stayed December 2013, traveled on business", "text": "Overall, this hotel is tired and needs some work. My room was not clean in terms of Marriott standards. The trash can by the desk still had receipts in it from the previous guest. Hallway carpets are worn and dirty. Also, I think only one out of the two elevators may have been operating while I was there. However, the most disgusting part about the room was the blood stained yellow chair. I should have complained to management during my visit, but had already been in meetings for six hours and flown over 1400 miles and was absolutely exhausted.", "title": "Similar to previous reviews: Not up to Marriott standards", "user": "Gozags2012", "date": "December 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 187008703}, {"rating": 2.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "In the morning, the breakfast attendant didn't show up. Therefore, breakfast was completely continental and was not ready by 6am. In addition, the hotel's juice machine was completely broken and out of order. They didn't even put out a pitcher of water for guests. Some staff members were attentive, but the morning clerk didn't even apologize for not having a hot breakfast (which is advertised excessively around the hotel) or ask how my stay was. Overall, I probably would not return since there are lots of other choices in the immediate area, but management has made an effort to reach out to try to rectify the problems. Definitely not worth the $106 government rate I paid.", "title": "Not up to Marriot standards", "user": "ladymiryaa", "date": "November 12, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 184538111}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "Having stayed at numerous Marriots, including this one last year, I was highly disappointed by our stay this time. The shower had no water pressure and did not even get hot. There was no way we could wash our hair in the small amount of water coming out of the shower. We asked the front desk staff twice for an extra blanket for the pull out bed and were told they would send one up. We NEVER got one. The second night we stayed, our room NEVER got cleaned and we did not have the privacy notice up at all. We were at an event all day and it was very disappointing that the room never got cleaned. The air conditioner also only seemed to hit one area of the room making that one part extremely cold. Since this was the sponsored hotel of the Susan G Komen 3 Day for the Cure, we were disappointed that although we were ensured there was a shuttle for crew and walkers, the shuttle did not start running until 530 am and the crew had to be there by 4am so we ended up taking our own cars which was not planned at all. When we discussed this with the staff at the front desk, they told us there was nothing they could do. Very, very disappointed in this stay.", "title": "Enthusiastic staff", "helpfulness": 1, "user": "Greg S", "date": "October 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 182144810}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 2, "average": 11, "very good": 27, "terrible": 0, "excellent": 27}, "aka": "Springhill Suites Tempe Hotel Tempe", "slim_ranking": 0.382978723404, "description": "Discover the newly renovated and completely reinvented SpringHill Suites Tempe Arizona Mills Mall hotel. Perfect for business or leisure travel, our Tempe hotel lies at the gateway to the Tempe high-tech area near numerous attractions such as ASU, Arizona Mills Mall, and companies such as Bank of America Insight, and Intel. With complimentary shuttle service available Monday -Friday from 7am to 10 pm, getting to Phoenix Sky Harbor has never been easier. All suites at have been completely recreated and feature new luxurious crisp linens, elegant fixtures, comfortable sleeper sofas and mini-fridge, microwave, and coffee makers. Complimentary high speed internet access in all suites and a 24 hour business center will keep you connected and productive. Offering a chef inspired complimentary hot breakfast in our stylish new lobby, your day is sure to start off right. Our reinvented hotel coupled with our friendly hospitable service, the SpringHill Suites is sure to be your choice hotel in Tempe, AZ!"}