{"user_rating": 4.0, "review_count": 179, "name": "SpringHill Suites Asheville", "reviews": [{"rating": 4.0, "title": "Comfortable and Stylish", "text": "This is my third trip to Asheville and my first time staying at this hotel. Very pleased with this property: convenient to downtown Asheville, spacious and well designed room. The double bed suite includes a separate area with sofa bed, kitchenette and work space. It would sleep 2-3 adults comfortably. The color choices in the public areas and room are pleasant and soothing. Pool and exercise areas look well maintained.", "helpfulness": 1, "user": "ladytez", "date": "July 22, 2013", "id": 168537420}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "The lobby / breakfast area is cleverly designed. I appreciated the separate section which enabled me to enjoy my breakfast without view of the TV. Food choices included scrambled eggs and Canadian bacon, a wide assortment of breads, including bagels, croissants and more, oatmeal with 6 choices for toppings, yogurts (including Greek yogurt!) and more. Great attention to detail - honey and agave offered in addition to the regular sugars, and real butter along with other spreads. The little things show that someone is paying attention! My only wish would be for them to eliminate the styrofoam. It is out of place, especially in a eco-friendly place such as Asheville.", "title": "Home away from home", "user": "BHornbackTN", "date": "July 15, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 167724582}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Great hotel - I look forward to booking here again.", "title": "Good for Biltmore package", "user": "Susna92", "date": "July 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 167168605}, {"rating": 4.0, "title": "Very pleasant family stay", "text": "I am a business traveler and this property has become my home away from home when traveling in WNC. The refrigerator and microwave are convenient for left over restaurant food. Sam and Frank at the front desk are exceptional. Patricia the breakfast host is phenonimnal.", "user": "MichelleKM", "date": "July 10, 2013", "id": 167024547}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We stayed at the Springhill Suites because it had a pull-out sofa for our son and included tickets to the Biltmore for our entire stay. The front desk was very accommodating and our tickets were ready when we arrived. The breakfast in the morning was good, but did not include biscuits and gravy which we love on vacation. The room was our only issue; it was just not a good suite. With only a partial wall dividing the room with a sofa from the bedroom, it made the bedroom very small and if the sofa was pulled out to a bed, there was no way to get to the coffee pot by the front door except to crawl over. it seemed rather dangerous if there was an emergency and you needed to reach the front door. With only one door to the bathroom the guest on the sofa bed had to go around the bed to get there. The bathroom was well maintained, but again the design was flawed. You had to stand up to reach the toilet paper roll on the wall across from the toilet.", "title": "A comfortable stay", "user": "Catherine P", "date": "July 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 166642600}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We recently stayed here on a pre-planned road trip stop and was not too happy with the accommodations or the service. When we arrived the receptionist was on the phone with another customer, but did not look up or let us know she will be a few minutes...I did go to the front desk later o n in the evening to get extra towels...the receptionist was using a iphone and an ipad...in a back room...I could see her and I am 100 percent sure she could see me but she literally ignored me for SEVERAL minutes as I tried desperately to give her eye contact...anyway...a young man who was cleaning the area walked up right by my side and told her I needed assistance...she acted like she hadn't seen me...rude...the rooms layout was okay...the two televisions in the room was convenient and the desk and kitchenette area were towards the front of the room in a small nook...beds were not as comfortable as the other hotels we had stayed at...the hotel is in need of some updating though and unfortunately the carpet looked as it needed to be vacuumed and the closet's shelves had a thick layer of dust...black dust...I'm guessing they have never been wiped down...there are about 3 extra side shelves that were a plus but we had to wipe them down with a wipey...the top shelf was the worst though and disgusting really....in the morning during breakfast...staff member was incredibly cheerful and sweet but the area again looked as if it needed to be vacuumed...and some of the bins with food looked like they needed to be cleaned...this was one out of 4 hotels we stayed at on our trip and the only we encountered this at during the breakfast buffet and the dirty closets...for the price you would think at least the rooms would be clean and service really does need improvement. Stay at an updated Marriott and go out for breakfast...this marriott is not in the league of others I have stayed at.t", "title": "Not worth the price; receptionist too busy to help", "user": "rubiicela", "date": "June 30, 2013", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 165813269}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We stayed 2 nights here on a road trip and found the property to be very acceptable. It was great value at $60 a night so who can complain at that? Free Wi fi and breakfast too. Not sure how they make a profit! The hotel is not located in Asheville just on the outskirts but there is a Carrabba's next door so you can walk to get something to eat. The town is 5 minutes away in the car.", "title": "Great value for money!", "user": "keith Y", "date": "June 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 165536315}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "The aircon is noisy would be my only negative about the property.", "title": "Nice Hotel technology lacking", "user": "WuSongLong", "date": "June 25, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165218854}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "I love to stay at Marriott Hotels, and I took on this property using my Rewards Points. It was an expensive rate for points, but I am just a loyal customer. Let me begin by saying the staff was great, and the property was clean. I was not disappointed in that. I have increasingly found that some Marriott Hotels are lacking in access points and good wireless internet. This has happened to me in at least three cities. The management was not very helpful, and offered to give me the number of the Internet company. What? If I am spending a lot of money to stay, I am not the person who should be making the call. This seems to be the question I have been asked at all three places. He told me that the hotel met the basic Marriott requirements....Too bad it did not met my needs. If the technology woes continue, I will have to switch brands. McDonalds has better connection in the McCafe'. Sorry to have to give a down review, but maybe someone at corporate will take on this challenge.", "title": "Great hotel; a little overpriced", "user": "NMurphy", "date": "June 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 165182667}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "My husband and I stayed here for one night as a date night trip to Asheville. We live in Knoxville TN which is approx. 1 ½ hours away. The springhill suites brand is pretty consistent and I found this to be no exception. The rooms are always clean and they are always spacious. I think that for the location, the rate could have been quite a bit lower. Asheville has character but it is not a metropolis. We paid $254 in October 2012, which was not a holiday weekend or anything. I would expect this rate at a b and b, which is what Asheville is known for, but this hotel is not near the downtown area so driving is a must. The price is the only negative, but with Marriott points or with an advance booking to get a good rate, I would stay here again.", "title": "Very Basic", "user": "VerdantTrip", "date": "June 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 164878868}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "This will sound like a \"deva vu\" of another property I reviewed in Savannah, GA...but...our room was on the second floor, and the ceiling creaked from the people walking in the room above ours. It was so distracting...especially while trying to sleep! (Even with the air conditioning on). It was Memorial Day weekend and rooms were in short supply. We checked out 2 days early. Otherwise...it's your average SpringHill. I recommend you stay on the top floor!", "title": "Structural issues?", "user": "JEFFYG10", "date": "June 20, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 164622948}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "The room was cLean and, comfortable (we had a king suite). The breakfast was a solid, standard breakfast you get in most similar type of hotels. Hot breakfast was waffles, eggs, and sausage. Strong, free WiFi in the room. The hotel is close to downtown and to UNC-Asheville. Good price for a good stay.", "title": "Solid hotel, good location", "helpfulness": 1, "user": "RRRice", "date": "June 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 164320858}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "A pleasant hotel with an easy 5-7 minute drive to downtown Asheville via Tunnel Road. The indoor pool and hot tub are nice features, along with an outdoor patio with comfortable seating. Note: if you are a geocacher, there are several within walking distance.", "title": "Convenient to Downtown Asheville", "user": "Gene K", "date": "June 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 164176950}, {"rating": 5.0, "title": "Great hotel for families", "text": "We stopped here for a night after a long day of driving. We got in late and there was no issue with a quick check in. The beds were fine and the room was a good size. Breakfast in the morning was good - pastries, hot oatmeal, fruit, yogurt, milk & chocolate milk cartons, v8, juice, scrambled eggs, sausage, hard boiled eggs, cold cereal and make your own waffles. There was something for everyone. I have a severe food allergy was was able to eat. I'd stay here again for sure.", "user": "emnb", "date": "June 16, 2013", "id": 164151691}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We stayed here because of the special with the Biltmore Estate which included admission, lunch and ice cream in the village. The rooms are on the small size but clean and adequate. The included breakfast bar is very nice and always being replenished. The pool and hot tub were put to good use. A great place for. Families.", "title": "A great family hotel", "user": "CandyfromCalifornia", "date": "June 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 163441695}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The Springhill Suites are definitely worth the money - two queen beds, clean bathroom, kitchenette, 2 tv's and a sitting area. Front desk personnel were very helpful, and the complimentary breakfast offering was very good too", "title": "Good clean suite that is worth the money", "helpfulness": 1, "user": "Papagaaidq", "date": "May 15, 2013", "detail_rating": {"service": 5.0}, "id": 160843346}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Very nice hotel and very convenient to The Biltmore Estate. Also very convenient to many excellent restaurants.", "title": "EXCELLENT PLACE TO STAY WHEN VISITING THE BILTMORE", "helpfulness": 2, "user": "Gallowayfamily", "date": "May 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 160259042}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The hotel staff was very friendly and accommodating.", "title": "Quiet in the midst of activity", "helpfulness": 1, "user": "Becky V", "date": "May 2, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 159466251}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "The room was very clean and the bed, comfortable.", "title": "Good value", "user": "W4ATL", "date": "April 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 158096124}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The free morning breakfast was excellent.", "title": "Comfortable room, disappointing breakfast", "user": "loradan", "date": "April 13, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 157564838}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 11, "average": 30, "very good": 81, "terrible": 6, "excellent": 51}, "aka": "Springhill Suites Asheville Hotel Asheville", "slim_ranking": 0.551724137931, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "If you are looking for Asheville hotels near Biltmore Estates, downtown Asheville and the Blue Ridge Parkway, experience the modern style of the newly renovated SpringHill Suites Asheville ,which is just minutes from it all. With incredible mountain views and nearby attractions like Chimney Rock Park, the Thomas Wolfe Auditorium, Nantahala Outdoor Center and the North Carolina Arboretum, you will surely enjoy your stay at our award-wining Asheville hotel. Our all suite SpingHill Suites by Marriott Asheville hotel feature rooms that are 25% larger than comparably priced hotel rooms, all while providing the amenities of a modern lifestyle. Enjoy free high-speed Internet, spacious work stations and modern furnishings with innovative room layouts. Our Asheville hotel offers a complimentary hot breakfast buffet, heated indoor pool & spa and a 24-hour fitness center. When visiting beautiful western North Carolina, you will never want to leave and the SpringHill Suites Asheville is here to make your stay memorable."}