{"user_rating": 4.5, "review_count": 72, "name": "SpringHill Suites Sacramento Roseville", "reviews": [{"rating": 5.0, "title": "Brand new hotel - great place to stay in Roseville!", "text": "This is a wonderful, brand new hotel in Roseville. From the minute you walk in, it's obvious this is not the old-style SpringHill Suites (which are nice in their own right). The lobby area is very chic and modern. Extremely inviting! The rooms are laid out like most SpringHill Suites - a separate living room area with desk, pull out sofa, and wet bar area - but the furnishings are much more modern and sleek! A large LCD TV is a nice high-end touch.", "user": "Calif0rnia_traveller", "date": "February 24, 2009", "id": 25112152}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "The breakfast is great - both hold and cold items.", "title": "Good but has some minor problems", "user": "AHM", "date": "January 1, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 23159854, "likes": {"liked": "— New and clean", "disliked": "— Room noise and temperature"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "I'll be staying here on future trips to Roseville and highly recommend it for everyone!", "title": "Really nice experience at this brand new all suites hotel!", "user": "2cents4u", "date": "December 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 22395223, "likes": {"liked": "— The cleanliness, friendliness of the staff, the amenities included in the price, especially the breakfast!", "disliked": "— That there was no door or curtain between the bedroom area and the pull-out couch"}}], "location": {"country": "United States", "city": "Roseville"}, "stars": 3, "variance": {"poor": 3, "average": 6, "very good": 27, "terrible": 1, "excellent": 35}, "aka": "Springhill Suites Sacramento Roseville Hotel Roseville", "slim_ranking": 0.444444444444, "description": "Welcome to the SpringHill Suites Sacramento Roseville, where our stylish and smartly designed suites are 25 percent larger than a comparably priced hotel room, giving you room to succeed. Located about 10 minutes northeast of Sacramento and within two hours of San Francisco and Lake Tahoe, you can enjoy day trips to ocean beaches, snow covered mountain peaks, or the breathtaking outdoors. Nestled together are the cities of Roseville, Rocklin and Lincoln where you can enjoy attractions at two regional shopping centers. The Westfield Galleria and the Fountains Lifestyle mall feature over 300 distinguished brand and boutique stores such as Nordstrom’s, Tiffany, and Louis Vuitton. Entertainment options abound with Thunder Valley Casino Resort, Golf Land Sun Splash Water Park, PGA quality golf courses and celebrity dining options. Near major corporations like Hewlett Packard, Oracle and State Farm Insurance, the SpringHill Suites Sacramento Roseville provides the service you deserve, the comfort you need, and the room to succeed."}