{"user_rating": 4.0, "review_count": 47, "name": "SpringHill Suites Austin Round Rock", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "nice, clean new hotel, located 1 exit down from Chili's, Bennigans is walking distance, excellent TexMex food at Chuy's one exit down. Wish these discount suite hotels had a door separating the bedroom from the living area,, had toddler sleeping on the pullout bed. The lobby and pool are very nice. Great breakfast.", "title": "great hotel, price an location", "user": "Herk_Driver", "date": "July 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8231811, "likes": {"liked": "— nice new hotel", "disliked": "— no door separating 2 rooms"}}, {"rating": 5.0, "title": "Awesome! Perfect for 3 business travellers.", "text": "OK I do ALOT of travelling. I had a last minute trip to Dell Headquarters in Round Rock Texas and did a quick internet search and Spring Hill came up, I didn't realize it was a Marriot property. There were 3 of us travelling and we wanted to save money and stay in one room.", "user": "A TripAdvisor user", "date": "July 15, 2006", "id": 5468373}, {"rating": 3.0, "title": "Like the floorplan & includes kitchenette", "text": "The rate was below $100 and we got a full suite with kitchenette, 2 beds and a pull out couch. We comfortably slept three, had a really filling FREE breakfast in the morning, and the service staff was really helpful booking the next leg of our trip (San Antonio) - where we of course stayed at their other property.", "user": "YOSEgal", "date": "March 6, 2006", "id": 4589553}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "This is the best value for 3 people I have come across - very clean, very nice. HIGHLY recommend this property.", "title": "Perfect for extended stay as well", "user": "arstrobelt", "date": "February 18, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 3.0}, "id": 4468237}, {"rating": 5.0, "stay_parameters": "Stayed August 2005, traveled on business", "text": "I like the layout of this studio suite: the kitchenette and living room are in front by the door. The bathroom is in the back by the beds. I wish it wasn't a studio, but the price was right and included a couch, chair, coffee table, kitchen table, small microwave, small refrig, and small sink. We only stayed one night in January 2006. We ordered food (free delivery) from a restaurant nearby. The bathroom toilet kept clogging every couple of uses, but the manager sent up a plunger when I called late at night. I was able to unclog it myself after quite a bit of plunging. The next morning it clogged again. The next day I asked for a 30% discount and they obliged plus offered an apology. The staff was pretty nice about it.", "title": "Worth it!", "user": "JoeSchlambe", "date": "September 11, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3895010}], "location": {"country": "United States", "city": "Round Rock"}, "stars": 3, "variance": {"poor": 8, "average": 5, "very good": 19, "terrible": 0, "excellent": 15}, "aka": "Springhill Suites Austin Round Rock Hotel Round Rock", "slim_ranking": 0.521739130435}