{"user_rating": 4.0, "review_count": 359, "name": "SpringHill Suites Orlando Convention Center", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "We just checked out of these hotel today. We had a wonderful experience. The staff is very courteous. The conditions of the hotel are excellent. The breakfast buffet is good. My only complaint is that the scrambled eggs are tasteless. The rest of the items in the breakfast bar are very good.", "title": "Nice place to stay in the Orlando area", "helpfulness": 1, "user": "golflover26", "date": "September 6, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 176037168}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We got the room for 65.00 a night on Labor day weekend, which is a steal. Anyways, new lobby, good buffett, clean rooms. We stayed in a Suite right next to elevator, I say that because they design of that particular room is terrible. I am not sure if the other rooms are like that, but this one was plain weird. We had a king size bed, but one side of the bed is right up against the place to hang clothes, you couldnt walk between the bed and \"closet\". Other than that, it was ok. It had fridge, microwave, etc. For 65.00 a night, I would stay here again. Parking is a bit scarce if you come back late.", "title": "Good Hotel for the Price we paid...", "user": "Gobux927", "date": "September 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 175773972}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The staff is outstanding though, they were very helpful in anything that we needed!", "title": "Just ok", "user": "Laura P", "date": "September 2, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 175313147}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Nothing great about this hotel. They said they just renovated the hotel but I don't think they renovated the whole place. The lobby & front area seemed like they were renovated but not the rooms. There was a large stain on the carpet & a stain on the couch. Other than that the place was clean. It is really close to Universal Studios which is why we picked this place. They had a nice spread for breakfast too. We stayed out late one night & when we got back there was no where to park so we had to go inside to find out what to do. The security guard moved his car so we can have his spot.", "title": "Great Hotel!", "helpfulness": 1, "user": "Farah V", "date": "August 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 174673183}, {"rating": 3.0, "stay_parameters": "Stayed August 2013", "text": "Stayed at this place for 6 nights in August! It was a great location right on Universal Blvd! The first room we got had a noisy AC - they immediately switched us rooms to a better place. The room is quite spacious with a partial wall to separate living from sleeping. Well lit - lots of mirrors!!! Breakfast was phenomenal - very fresh. The ladies every morning were helpful, courteous and greeted us with smiles and 'good morning' each day! Great assortment of food! The place was crowded when we went with tourists from everywhere - but despite that food was plenty and people were kind! The only downside is that there are 2 elevators for a building this large! And for the amount of people who stay here, be prepared to wait for a while to get an elevator especially during breakfast hours!", "title": "Adequate", "user": "mgoblue81", "date": "August 22, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 173564923}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Arrived a little earlier than expected and was checked in at 1:30 since we were in the area. We just came for fun to walk around Pointe Orlando. The hotel is in a great location for reaching those i drive fun places. the hotel has recently been renovated. The decor is lovely. There was a bag given at check in (two of us at the desk) with one bottle of water. I wondered why not two but then it was a luxury not a necessity to the stay. :) There was water near by in two water pitchers...one with lemon and limes, the other plain-nice touch. The lovely, professional, friendly ladies at the desk set us up on the 7th floor, 714. Walking into the room it was SPACIOUS! The front living space had a 4 seater couch, a desk/dining table, a microwave, fridge and sink. I imagine utensils and such but we didn't eat in. That was nice to see so I expected the bedroom to have a lot of space. It didn't you HAD TO go in sideways to one side of the bed close to the closet which I would hit the ironing board on that side. No room. The other side near the window had little space to. There was a 2 drawer chest with a tv on it. (The tv could be hung high on the wall.) That space was more tight than it should be, esp to be ADA compliant. The curtain in the room should be longer. There was sunlight streaming in. The A/C was adequate when we came in. We turned it down to cool the room off. It didn't seem to stay cool but it was comfortable. The bathroom had a weird layout with the toilet being RIGHT UP next to the shower tub. The toilet paper roll was far across on the opposite wall..just a weird, uncomfortable layout. Again, these toilet and tubs aren't used the whole time so it was weird just when using them. The bed was fine and comfortable. The thing I look for in a hotel is the cost compared to amenities. I go to a hotel to get rest and relaxation. This is what I am paying for. Springhill Suites was outstanding. There was a lot more good than not so good. I would recommend this hotel but likely suggest a different room because of the tight fit around the bed. The best part was that I didn't hear any disturbing noise from nearby rooms or the hallway. That's a big plus when it comes to resting...We went to breakfast though the layout was uncomfortable and inefficient. There was lot of dining space so this could be accommodated some how. The rate we paid ($108) for included parking, wi fi, a king suite room, breakfast, a noon check out, and pool I see that the SHS has the Marriott brand down pat...great job!", "title": "lots of good, little not so good", "user": "KathyRcoupon", "date": "August 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 173392906}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "I spent one night with my family. I gave excellent review for cleanliness of the room, and the great service and friendliness of the staff.", "title": "I'll go back", "user": "OakRamble", "date": "August 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173078938}, {"rating": 4.0, "title": "Good location and staff", "text": "We arrived at 12 am; the receptionist smiled at time, which I think puts customers at ease, and show that they care about their customers. The room was nice and clean and all what you need amenities. Service was great the next day at breakfast. We got free quick queue for sea world which was awesome. Let alone the very convenient location of the hotel to Orlando attractions. The hotel also has a nice pool and gym room.", "user": "Kimolus", "date": "August 18, 2013", "id": 172891564}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "In general, it is not a fancy business hotel, but surely is a great family vacation place!", "title": "Nice hotel", "user": "PAULETINO", "date": "August 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 172247688}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We stayed for a conference in OCC and this was a suitable location for us. We used the trolley to go to OCC and walked back as the trolleys did not run that late. It was not too hot so late to walk and the distance is only about 1 mile. We also had a good service from the Springhills staff especially Scott at the check-in. He gave me good instruction where to buy the trolley multi day ticket and also some other information. Also I like to comment the staff at the breakfast bar. Often it was quite busy but they continually filled empty dishes so it was flowing quite well.", "title": "Good hotel. Great staff", "helpfulness": 1, "user": "Hearts1874", "date": "August 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 171661796}, {"rating": 1.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "As I write this review, it is 2:35 am. I cannot possibly sleep, because management and security of this hotel broke into my room about 30 minutes ago. Shortly before that, I heard a brief argument in the hallway and someone at my door. Figured it was an intoxicated guest on the wrong floor or something. About 10 minutes later, more noise at the door. Got up to go check the peephole, and call for security, and got to the door just in time to push it shut as someone broke the lock (the one with the solid bar). Looked in the peephole and no one was there. Called the front desk to ask for security - no answer. Waited a few minutes and got \"Abraham\" who told me I'd better get down to the front desk because he had called the police on me for being \"an unauthorized guest\" in the room -- which I had checked into (and my credit card was charged) at 2:45 pm. I refused, as he answered the phone with \"hello\" - not \"front desk\" or \"guest services\" and I was afraid something more sinister was going on -- and I was not comfortable leaving my 2 daughters alone in the room with a broken lock. Police arrived about 5 minutes later and refused to file a report -- saying it was just a misunderstanding. There was a do not disturb sign on the door -- my credit card was charged (and I hope my identity was not stolen) -- and the security bar in the room was closed. How the heck did they think I got in there, and why on earth would they not wait until morning or call the police to deal with this -- at 2 am??? Why didn't they at LEAST try to CALL the room before breaking in?? AT TWO AM!!!!!! Seriously -- if an unauthorized person WAS in the room -- and had ill intent -- the person breaking in the door (the night manager and unarmed security officer) could have been shot at point blank range.", "title": "WORST STAY EVER!!!! DO NOT COME HERE!", "helpfulness": 7, "user": "Islandgirl2992", "date": "July 20, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 4.0, "location": 3.0}, "id": 168257409}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "I asked to speak to the General Manager and was told I would hear from someone \"in the morning\" because the GM was sleeping. Wish I could sleep -- but apparently they don't care too much about that! Last words from Abraham? \"Have a pleasant evening!\" Seriously??????? Don't you think it's a little late for that????? If you value your security (not to mention a decent nights sleep) -- stay somewhere else!!!!!!", "title": "Ok - would check on renovations", "helpfulness": 1, "user": "stschaefer", "date": "July 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 167622558}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Used this as our last day on our Orlando trip. Looks like a renovated hotel that Spring Hill Suites took over. Renovated room, with AC on the fritz. Air Conditioning in our room was set at 60 degrees when we entered, and it didn't feel like it got cooler then 75 during our night (ran all night long). Other patrons noted they had to change rooms for same reason. Had a good breakfast with eggs, sausage, bagles, muffins, cereal, waffles, oatmeal, yogurt, fruit - but was all put in a single line where everything backed up. Would help if they had stations so that everyone didn't have to wait in line for someone to toast their bagle, mix their condiments for oatmeal, etc. Tub was backing up and water actually stopped during shower. Let down of a stay after a great stay at Sea World mariott hotels.", "title": "Clean,Convenient & Family Friendly", "helpfulness": 1, "user": "Samurray815", "date": "July 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167547506}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "I stayed with my family for 12 nights. We found the hotel very clean. The room was very spacious with separate living area and small kitchen. Lifts were busy at times this was difficult at times as we were on 7th floor. Front desk staff especially Robert and breakfast staff especaially Amy were more than helpful. We would definately stay here again.", "title": "Clean, Convenient, Economical", "user": "PSBChris", "date": "July 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166956502}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "I stayed a couple nights at the SpringHill Suites Orlando on Universal Blvd the weekend prior to July 4th. The hotel is easy enough to find, and conveniently located between Universal and Sea World, and very close to the Convention Center.", "title": "Clean, affordable, family friendly.", "user": "SillygirlP", "date": "July 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166857457}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "I stayed here in July of 2013 and want to go back it's affordable, clean and comfortable it is also set near some great amusement parks such as SeaWorld and Epcot the swimming pool was great and spacious it was amazing. so in total the hotel added up to be a great use of my time as well as a well cooked breakfast and a comfortable gym my stay was fantastic and so will yours.", "title": "Good Stay", "user": "TheReviewer2329", "date": "August 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171466406}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Jason London, England", "title": "great stay", "user": "rickyspeelman", "date": "July 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169339148}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "front desk was great on check in-rooms was clean and housekeeping did a great job keeping towels clean and beds was great and clean-kitchen area was nice and clean-air condition was great and cold-over all we had a great stay and was close to all parks and places to visit.over all great place to stay.rick north carolina", "title": "Clean and good location", "user": "AaronSpeak", "date": "July 23, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 168708386}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "I stayed here in July with family. Chose the hotel for value and location.", "title": "Clean and pleasant stay", "user": "Katmar83", "date": "July 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 168373087}, {"rating": 4.0, "title": "location and value", "text": "Plus - I-trolley at the door step, complimentary breakfast, very clean rooms, complimentary drop off at Epcot, Walgreens within 5 minutes", "user": "waltapod", "date": "July 21, 2013", "id": 168363621}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 9, "average": 40, "very good": 123, "terrible": 10, "excellent": 177}, "aka": "Springhill Suites Orlando Hotel Orlando", "slim_ranking": 0.310030395137, "description": "Savvy travelers will delight in SpringHill Suites® by Marriott® Orlando Convention Center’s spacious studio suites. Located just a 15-minute walk to the Orlando/Orange County Convention Center and steps away from many of INternational Drives restaurants and attractions. Guests will also want to advantage of our free scheduled shuttle to the Walt Disney World® Resort Theme Parks. After a long day of work or play, you’ll feel right at home in your comfortable retreat that includes a sofabed, mini-refrigerator, microwave, and free high-speed internet access. Don’t miss a workout with our on-site fitness room, and be sure to take a dip in the outdoor heated pool with kids play fountain. Whether your plans include business or pleasure, SpringHill Suites Orlando Convention Center is the ideal hotel to suit all tastes and budgets. SpringHill Suites Orlando Convention Center has 167 studio suites on seven floors. A heated outdoor pool, whirlpool and fitness center are also available."}