{"user_rating": 4.0, "review_count": 101, "name": "SpringHill Suites Philadelphia Willow Grove", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "We loved this place. The rooms are larger than average. The quality of the accomodations were above average. The pool is very nice and there is a separate jacuzzi. The breakfast buffet includes everything one needs for a full breakfast. Staff was very helpful. I would have liked a tip jar for the breakfast staff but there wasn't one. As a business person I really like the hard wired high speed internet because it is much more secure than wireless. Even casual users should feel safer using a credit card or checking a statement than on a wireless setup. Location is near the interstate but in a quiet area.", "title": "Great place for family or Business", "helpfulness": 6, "user": "MikeDAtlanta", "date": "March 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4588803}, {"rating": 5.0, "title": "Lovely Place to Stay", "text": "This was out third stay at this fine hotel, and I must say that it just keeps getting better and better with each visit. First, the staff are very friendly. They always say hello and give you a sincere smile. The rooms are quite nice and very quiet. There's a bedroom area, a sink/mirror area, a bathroom, a living room area with a sofa bed and TV, and an office area with a desk, microwave, bar sink, and additional storage. Everything was extremely clean -- as if we were the first people staying there. We always tip the chambermaids a few dollars; this is one of the first hotels I can recall where they left us a thank you note!", "helpfulness": 5, "user": "A TripAdvisor user", "date": "January 30, 2006", "id": 4397583}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "They have a wonderful pool, jacuzzi, and an exercise room with nicely maintained machines, including a treadmill, stair climbing machine, weights, etc. The equipment looks out over the pool, but is kept in a separate glass-enclosed room to control the temperature and humidity. The arrangement allows you to keep an eye on your kids in the pool area, while you work out in comfort.", "title": "THE BEST!", "helpfulness": 4, "user": "BklynMom2", "date": "August 8, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3745552}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "The breakfast is included and has an excellent selection of items, including cereals, yogurt, milk, various kinds of juice, muffins, pastries, scrambled eggs, sausage, waffles, bagels and fruit. It was way beyond the typical included continental breakfast you find at other hotels. Everything was fresh, the quantities were plentiful, and the hours were great for those of us who like to sleep in every once in a while. My son, who's a picky eater, normally wants to go to McDonalds for breakfast when we stay at a hotel, but here he loved the fresh waffles he could make himself on the commercial duty waffle irons.", "title": "Faultless", "helpfulness": 6, "user": "hertstraveler", "date": "July 13, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3663843}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "The hotel itself is located in a nice, safe area where there are plenty of restaurants and there's also a great mall a few miles away. You're also right off the Pennsylvania Turnpike, so it's easy to get just about anywhere.", "title": "Friendly & Helpful", "helpfulness": 4, "user": "trincity", "date": "July 9, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3651727}, {"rating": 5.0, "stay_parameters": "Stayed April 2005, traveled on business", "text": "Suite with free internet, desk area, mini kitchen with wet bar, microwave and refrigerator, large bathroom with separate sink area. We had 2 beds and a pull out sofa as well. Two tvs! Spacious, clean, inviting. Great variety of food at complimentary breakfast. Helpful with directions for travel to Philadelphia at front desk. My first experience with Spring Hill Suites, recommend highly.", "title": "Met Every Expectation!", "helpfulness": 1, "user": "Vermont95", "date": "June 3, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3527096}, {"rating": 4.0, "title": "Nice, newer property in a quiet, pleasant area", "text": "Booked a rate of $139 via marriott.com; stayed one night on 09/23/2004.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "September 28, 2004", "id": 2606451}, {"rating": 5.0, "title": "Agree with above two reviews", "text": "This property is located just off the PA Turnpike at Pa Route 611. Pleasant, relatively new property with spotless rooms. Outstanding continental breakfast. Microwave oven, small fridge, and wet bar in room, but no full kitchen like in TownePlace Suites or Residence Inns (just so you'll know).", "helpfulness": 3, "user": "A TripAdvisor user", "date": "July 2, 2004", "id": 2264157}, {"rating": 4.0, "title": "Very nice!", "text": "Pleasant staff, indoor pool, the ususal amenities in a business-oriented property. Would definitely stay here again if I needed to be in the Willow Grove/Abington area. 20-30 mins to Doylestown, too, which is good since there aren't any business-oriented hotels there. 1 hour to Center City Philadelphia via PA611.", "user": "bscrowt", "date": "May 10, 2004", "id": 1924826}, {"rating": 4.0, "title": "A good suburban hotel", "text": "I agree with the above two reviews. I would stay there again and recommend it to others. Two cable TVs , iron and board, and kitchen facilities were a plus.", "helpfulness": 3, "user": "bworks1", "date": "March 3, 2004", "id": 1702400}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We stayed for 2 nights over Thanksgiving and were more than pleased with the room and with the property itself. I was surprised that the hotel was 4 years old because it seemed brand-new. The rooms are a little tight, but everything you need is there - sofa, microwave, wet bar, desk. Very convenient to the Penna. Turnpike. This is a very quiet property in a residential area. We look forward to staying here again because the price was right, the service was superior, the property was clean, and the room was restful.", "title": "Delightful!", "helpfulness": 3, "user": "Criticaltraveller", "date": "November 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6182204, "likes": {"liked": "— Very clean; very convenient", "disliked": "— Rooms were a bit tight"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "My 4 year old daughter and I stayed here for most of our trip to Philly and really enjoyed it. This was our second experience with this particular property and it was even more positive than the first time we stayed here. The hotel is clean, well-maintained and quiet. We had plenty of space in our room and the convenience of refrigerator, sink and microwave in the kitchen area. The complimentary breakfast saved us time and money and we enjoyed using the heated indoor pool, hot-tub and exercise room. The staff was extremely helpful and friendly. At first we were following AAA directions to get to the various tourist attractions, but when I mentioned to the nice man at the desk that we were hitting a lot of traffic, he gave us much better directions which we used for the duration of the trip. Willow grove is a safe, clean town with a big mall and lots of places to eat within 5-10 minutes of the hotel. I would definitely stay here again.", "title": "Excellent Family Friendly Hotel", "helpfulness": 2, "user": "tbdisney", "date": "October 12, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5945819, "likes": {"liked": "— The helpful staff and spacious room", "disliked": "— Check your directions/travel plans with the front desk staff"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "My family and I stayed here for a full week and thoroughly enjoyed our stay. It was clean and quiet with plenty of room for us to spread out. The complimentary breakfast was very good and frequently replenished. We really enjoyed the pool and hot tub as well. The hotel is 15 minutes from Sesame Place and only 45 minutes from downtown Philly plus there were several good restaurants nearby, so it was very convenient. I would definitely recommend staying here again or at any Spring Hill Suites.", "title": "Clean and comfortable!", "helpfulness": 2, "user": "cara704", "date": "August 21, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5631468, "likes": {"liked": "— New hotel - clean and in a good location."}}, {"rating": 5.0, "title": "Excellent Can't Say More", "text": "We discovered Marriott's Residence Inns and Suites recent by mistake, and will probably never stay in a regular hotel room again. They are perfect for families. This particular one could not have meet our needs any better. It was clean, the pool and spa were wonderful and the staff was top notch. If you are traveling with kids you have to check these suites out!", "helpfulness": 1, "user": "KPMD", "date": "August 6, 2006", "id": 5563901}, {"rating": 5.0, "title": "Two Thumbs Up!!", "text": "My family and I stayed at the SpringHill Suites over Easter Weekend while I visited New Hope and Peddlers Village. I loved the hotel, staff and the free breakfast buffet was great - hot & cold food!! The pool was smaller than I thought but for a weekend, the kids were satisfied and entertained. I would definitely go back and recommend this hotel to others. Enjoy!!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "April 26, 2006", "id": 5010505}], "location": {"country": "United States", "city": "Willow Grove"}, "stars": 3, "variance": {"poor": 4, "average": 17, "very good": 47, "terrible": 7, "excellent": 26}, "aka": "Springhill Suites Philadelphia Willow Grove Hotel Willow Grove", "slim_ranking": 0.6}