{"user_rating": 3.5, "review_count": 42, "name": "SpringHill Suites Prince Frederick", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "The room was very comfortable, staff very nice and efficient and breakfast was good and lots of it.", "title": "Nice New Hotel", "helpfulness": 1, "user": "GordonFScott", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 130894183}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I was down stairs very early, 5:30 am and breakfast wasn't due out until 7am (Sunday) and the lady preparing the breakfast fixed be coffee and omellete without even asking me.", "title": "IN and Out,,, this was not the closest to my appointment but the best", "user": "bigcreek", "date": "May 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 130482703}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Really nice down home staff at this hote.", "title": "Nice little hotel in a small town", "user": "MAAM19", "date": "May 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 130284967}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Hotel close to Eastern Shore and other Southern Maryland attractions.", "title": "Perfectly Lovely Stay", "user": "IVBandit", "date": "March 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126495510}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Flew in for a job interview,,, this was about half hour north of where i needed to be, Awesome time, actually I reserved this online, and when I showed up, no reservation,,, but the front desk was great, no sweat, she also fixed my old rewards card, gave great recommendation to local eatery as well,,, just a great place to stay", "title": "Great price, great room!", "user": "Katkit04", "date": "January 12, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 122994793}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Stayed at the SpringHill Suites Prince Frederick for one night as part of a group of rooms blocked for a wedding so we received what we thought was a good rate ($119), especially considering it was Labor Day weekend. Booked a suite with two double beds for my family and I. We wanted to like this hotel, really we did. It looked nice in the photos online and appeared attractive and clean upon arrival, but we left with mixed feelings. My family stayed in 3 different hotels over the course of our trip (1 in Hershey, PA, 1 in DC and this one) and of the 3, this was our least favorite.", "title": "Looks nice on the surface but there are a few problems...", "user": "hadley72", "date": "September 6, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 4.0, "service": 5.0}, "id": 117775213}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "LIKES:", "title": "Clean & comfortable", "user": "PhillyLindsay", "date": "August 5, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116311918}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Nonsmoking property was #1. Both of the hotels we stayed in on this trip prior to arriving in Prince Frederick had nonsmoking rooms but we kept smelling cigarette smoke from somewhere and it was annoying. Having no-smoking anywhere on at the hotel was fabulous! Can't rave about this enough.", "title": "The good and the not so good...", "user": "js551", "date": "July 29, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 115973569}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Very friendly and helpful front desk and housekeeping staff. They let us check in an hour early which was a god-send so we were able to get to the wedding we were there for on time and everyone working who I encountered greeted me in a very friendly and genuine fashion.", "title": "GREAT HOTEL!", "helpfulness": 1, "user": "smdsales", "date": "May 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 107884320}, {"rating": 1.0, "title": "These \"suites\" best rented by the hour", "text": "Attractive, clean rooms and the property overall was tastefully decorated and visually looked well-kept (didn't see any coverlets on the beds like they show in the photos though...doesn't matter to me..just saying).", "helpfulness": 1, "user": "A TripAdvisor user", "date": "April 27, 2011", "id": 105764040}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "I travel to this part of Maryland several days every month, and this is the best hotel option in the area. It's nothing special, and meets all of the standards of a SpringHill Suites by Marriott. I have stopped eating in their breakfast area because the area isn't kept as clean as I think it should be, even though there is usually a bucket with rag sitting in view of the counter, but again, it's standard fare for a SpringHill Suites.", "title": "Good option if you need to be in this area", "user": "pbadeer", "date": "February 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 98032714}, {"rating": 1.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "Over the last 20 years I have averaged over 25 nights/year on the road. This experience over labor day week by far is the worst experience I have ever had in a hotel. Apparently the hotel booked 3 different blocks of rooms for wedding parties. They then decided to put our room on \"Fraternity Row\" - We had to deal with drunks, noise, load music, yelling in the hallways until after 3 AM. Sound carried right through the walls. Calls to the front desk to complain about the noise were met with the answer of \"what do you want me to do?\". After the second call the night desk clerk told the other guests to take the party to the hotel's outside patio. This was 2am. Guess where the patio was located - right beneath our 2nd floor room's window.", "title": "Worst Hotel Experience I ever had", "user": "Frederick_MDTim", "date": "September 12, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 79249881}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Upon checking out the next morning I attempted to speak to someone at the front desk. No one was to be found? We have tried to email the General Manager to complain and are still waiting on a response.", "title": "FABULOUS hotel", "helpfulness": 1, "user": "Sharkmako", "date": "September 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78659715}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We had a fabulous stay. The hotel was clean, the staff was outstanding and very helpful. They even accomodated our request for an early checkin. I would absolutely return. The hotel location to where we needed to go was very centrally located. We also appreciated the location to the shopping centers, Solomons Island, and 2 wineries.", "title": "will be returning", "helpfulness": 1, "user": "jen526", "date": "August 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 77135938}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "This hotel is very nice for the price. No problems to complain about only minor issues. Beds were a little too firm for my liking however i would have rather them be to firm than to feel mattress springs. Only other issue is that I had to ask the front desk for towels after seeing there were none in the pool area. The lady acted as if I were bothering her and seemed irritated that I interrupted her conversation with a fellow employee. Other than that our stay was great. Nice rooms, large bathroom and I enjoyed that it had central air. I didn't have to get up in the middle of the night to turn off the a/c because I was too cold like I have had to do in other hotels. Overall we had a good experience and will likely return when in the area again.", "title": "Absolutely Wonderful", "helpfulness": 1, "user": "bschh", "date": "August 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 75375800}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Overall this hotel was very good - just what I would expect from a Springhill Suites. Comfortable, nice decor, friendly people, and good work space in the rooms. There seems to be a bit of deferred maintenance at the hotel though - the toilet bowl in my bathroom had a crack in it, the door to my room stuck and had to be pushed hard to open and close, and things of that nature. Nothing huge, just a few things that keep me from giving the hotel a rating of 5.", "title": "Good hotel with a little deferred maintenance", "user": "november_moon", "date": "September 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 140725488}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Stayed here for a week for work in July. Front staff was very nice (even tried to get us free use of the mini-putt and batting cages across the street, but that place closed a day after we arrived!) and welcoming.", "title": "Clean and comfortable", "user": "Beezlebubba", "date": "August 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 136333039}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The rooms were kind of like a Hyatt Place (I think this is becoming a growing-and welcome!- trend) where the large flat screen TV pivots between a bedroom area and a living/work area. Pretty nice and comfortable, I prefer the sectional that the HP uses, but this is still nice. Mini-fridge and microwave were standard and nice. Room was painted a rather ugly yellow.", "title": "Proper service, during a bad experiance.", "user": "PineapplePrincess82", "date": "July 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 135830568}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Breakfast was standard Marriott grub...3rd or 4th one I've stayed at in the last couple months, and they are identically provisioned. I used the wired internet. It was fine, but required too many re-log-ins. Shower was an 8 out of 10. Nice and hot, high enough that I didn't have to stoop (6' 2\"), needed more pressure. In the same parking lot as a liquor store and small Italian (counter service) restaurant. Too far from downtown to use this as a base of ops, but close to a couple nice state parks and beaches.", "title": "Great stay", "user": "NEPhillyGirl006", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133871090}, {"rating": 4.0, "stay_parameters": "Stayed April 2012", "text": "We stayed at this hotel while collecting fossils at Calvert Cliffs. The hotel was fairly new in decor. Room looked clean with the exception of a used condom under the nightstand. During our stay the AC broke, the hotel responded by trying to fix the problem quickly it took them two tried and a few hours but the room finally cooled off. This hotel has a lovely pool and hot tub we went to the pool while we waited for the AC to work. I also slipped and fell out of the shower bruising my arm on the toilet and tearing the shower curtain. We ate a a steak house down the street and had a good meal it was nice and close to the hotel. Upon check out the woman behind the counter asked how my stay was, and I told her what happened and she said, \"I am sorry your stay wasn't better please allow us to comp you for the inconvenience.\" While I didn't have the best time I would give this place another chance because everyone has bad days and I think they genuinely tried to make up for missing the condom and the broken AC.", "title": "Functional for Brief Stay. Surprisingly Good Breakfast.", "helpfulness": 2, "user": "gnomemoss", "date": "July 9, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 133833783}], "location": {"country": "United States", "city": "Prince Frederick"}, "stars": 3, "variance": {"poor": 0, "average": 9, "very good": 16, "terrible": 6, "excellent": 11}, "aka": "Springhill Suites Prince Frederick Hotel Prince Frederick", "slim_ranking": 0.666666666667}