{"user_rating": 4.0, "review_count": 74, "name": "SpringHill Suites by Marriott Edgewood Aberdeen", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "We were in Baltimore for the weekend for an Orioles vs. Boston game and due to poor planning we didn't have a hotel until we got to Baltimore. And this being one of the biggest baseball weekends of the season, there weren't any rooms available within a 15 mile radius of Baltimore. Luckily we found this hotel which had limited availability. I must say that the Front Desk attendant (and I'm sorry I didn't get her name to give her props) was great. She handled the rush and pressure very well (because like us there were many others who didn't pre-plan OR were on their way home or on vacation and needed a place to crash).", "title": "Great Place for a great price..", "helpfulness": 2, "user": "MJ24", "date": "July 19, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3682197}, {"rating": 5.0, "title": "great and clean", "text": "The room was very nice. We didn't get a chance to utilize any of the amenities offered. Bed was comfortable and the air conditioner was blasting (we actually had to turn it off the room was so cold!). Breakfast was ok the next morning. We got there a little late and just got the leftovers but even the leftovers were just ok, nothing to write home about.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "June 21, 2005", "id": 3588459}, {"rating": 4.0, "title": "First Rate Hotel by Marriott - The Leader in Hotel Stays", "text": "All in all, great place to stay if you are on a budget and don't pre-plan like we did. I would definitely stay there again if my travels find me on I-95 otherwise I'd probably aim to be closer to Baltimore.", "helpfulness": 5, "user": "DeRa", "date": "August 2, 2004", "id": 2355066}], "location": {"country": "United States", "city": "Bel Air"}, "stars": 3, "variance": {"poor": 5, "average": 12, "very good": 29, "terrible": 5, "excellent": 23}, "aka": "Springhill Suites By Marriott Edgewood Aberdeen Hotel Bel Air", "slim_ranking": 0.8}