{"user_rating": 4.5, "review_count": 2357, "name": "St. Ermin's Hotel - Autograph Collection", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We stopped for one night at St Ermins 27th April. Accommodation is fine and the setting very beautiful. But the service is shocking. The fresh milk I ordered before bedtime from Room Service never arrived. I queried this the following morning and was casually told that staff had probably forgotten. And as for the service in the bar, we waited 15 minutes for our first drink and 25 minutes for the second. Bar snacks, ie burgers and club sandwiches were okay, but the chips were made by someone who doesn't know one end of a chip from another. Pale, soggy miserable little things served in a cup for heavens sake.", "title": "Poor service", "user": "Traidervic", "date": "April 28, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 159063117}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "This was our first, and will not be our last. The hotel is stunning, the art deco styling is fantastic. I spend 90% on my work life staying in hotels and the staff some of the best I have experience.They were welcoming, informative, very helpful and made the stay a real pleasure.", "title": "A Gem of a hotel", "helpfulness": 1, "user": "expatscot60", "date": "April 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 159060341}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "he delightful St Ermins Hotel that is so stylish and well situated. It is within walking distance of most tourist attractions around London and transport is easily found. The beautiful old building has been carefully restored and decorated with an eclectic mix of old and new. Our room was lovely, light and airy (great that the windows can be opened for fresh air). The staff are exceptional and very friendly and obliging, nothing is too much trouble. The Concierge local knowledge is excellent and assisted us with our sightseeing ventures.", "title": "The delightful St Ermins Hotel", "helpfulness": 1, "user": "Susan B", "date": "April 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 158988431}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "A memorable experience and when in London again that will be the hotel of choice.", "title": "London charming hotel", "helpfulness": 1, "user": "vfabiano", "date": "April 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158968379}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Nice stay in a charming hotel. Good location, close to everything interesting, walking distance to St. James Park, The Big Ben, London Eye, Buckingham Palace and also in a very calm neighborhood. Warm stay supported by nice hotel attendees, from reception, to the restaurant which even have excellent food and wines (not a norm at most hotels around the world!). Congrats to the St. Ermin’s team for the good job! Only one remark is concerning the internet access, instable and too complicated access provided by an external provider, should consider its replacement for another one at the St. Ermin’s level.", "title": "Stay at St. Ermin's", "helpfulness": 1, "user": "Abraham S", "date": "April 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158927309}, {"rating": 5.0, "title": "Highly Recommended", "text": "I stayed at the St Ermins for just the one night, a complementary stay offered after a poor review made earlier in the year, and I have to say, from check in to check out this hotel more than lived up to its 4* rating.", "user": "KnightsDweller", "date": "January 20, 2013", "id": 150135493}, {"rating": 5.0, "title": "Great location", "text": "After a very easy check in, a handmade note and little cakes were waiting in my room. I stayed in an deluxe king, which was a very good size and clean with a well appointed bathroom (including white company toiletries!), robes, slippers, large screen TV and a well stocked mini bar.", "user": "fat60", "date": "January 20, 2013", "id": 150097741}, {"rating": 4.0, "title": "Perfect to explore London", "text": "The bed was comfortable and just what I needed after a long day exploring - which is so easy to do from this hotel as the location is fantastic. Landmarks such as Buckingham Palace, Westminster etc are so close, not to mention the tube station less than 5 minutes walk away.", "user": "ClassyLad", "date": "January 20, 2013", "id": 150077279}, {"rating": 5.0, "title": "Expensive but a wonderful location", "text": "I didn't eat at the hotel's own restaurant (the Caxton Grill) but at the recently opened Blue Boar Restaurant, which is part of the new Intercontinental hotel around the corner from the St Ermins. I will post a separate review on their page, but it is also worth a visit if you have deep pokets or a sugar daddy ;-).", "user": "limerickphoenix", "date": "January 17, 2013", "id": 149903876}, {"rating": 5.0, "title": "St Ermins", "text": "Althought it is expensive, I would definitely stay at the St Ermins again due to the service, quality and location.", "user": "Amanda186273", "date": "January 17, 2013", "id": 149898605}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Stayed for 3 nights at this lovely hotell - and there is much to like. The lobby is just stunning, and the entrance leading up to the hotell is beautiful. Smiling and quick receptionsists, nice rooms (bit small, but that did not bother us), big and comfortable beds, a good continental breakfast (including an excellent carrot cake) and everything looked clean and tidy.", "title": "So close to Excellent...", "user": "Einar S", "date": "January 22, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 150252805}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "2 reasons I am not able to rate the hotell as excellent:", "title": "Superb family hotel", "user": "supermac549", "date": "January 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150197006}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "1) No eggs included in the continental breakfast. My wife wanted 1 boiled egg. It had to be ordered from the kitchen and cost us 5 GBP.", "title": "Nice Hotel, good value for central london", "user": "ScotlandJSmith", "date": "January 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 150195925}, {"rating": 5.0, "title": "Superb weekend", "text": "2) A few days before travelling I sent the following message to the hotell:", "user": "Debbie G", "date": "January 21, 2013", "id": 150181397}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "-------------------", "title": "Excellent stay", "user": "sashapaton", "date": "January 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150156623}, {"rating": 5.0, "title": "Lovely Hotel - Will visit again!", "text": "Booked last minute and was not disappointed. Lovely room great location and will definitely go back. 5 min walk to Buckingham Palace and round the corner from St James Tube. Staff very helpful and friendly.", "helpfulness": 1, "user": "Laura S", "date": "April 29, 2013", "id": 159161632}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "I booked St Ermin's after finding a great deal and reading the stellar reviews here on TripAdvisor. We stayed three nights in a fabulous third floor room with a view of New Scotland Yard, which was a treat for this film/TV buff, who's seen the rotating sign featured in many movies and shows. (It's not as big as it seems on screen. ;)) The high point is location - close to the Tube at St James Park and rail station at Victoria; also walking distance to major tourist spots, while also being quiet enough at night to ensure a sound night's rest. Also, the room was spacious. The large shower, with its rainfall shower head, wad a treat for a weary traveler. While the lobby is grand and ornate, the room was decorated in a modern manner. Loved every moment of my stay. Courteous staff. Beautiful approach/driveway. Highly recommended!", "title": "Perfect location, perfect stay.", "helpfulness": 2, "user": "aliasrlm", "date": "April 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159153368}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "I stayed here with husband and our two daughters. We were automatically upgraded to an executive suite which was ample, clean and stunningly decorated. We didn't eat or drink at the hotel as out all day. This hotel is close to st James park tube or near main bus route. We used both and hotel was situated conveniently for us. We forgot out phone charger and hotel had a spare for us to use which saved us. A thoroughly relaxing stay .", "title": "Stunning hotel", "helpfulness": 1, "user": "Joannaburns", "date": "April 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159147516}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "I stayed for one night prior to taking part in the London Marathon and I couldn't have hoped for a better place to stay. We were upgraded to suite which was a wonderful surprise and my only disappointment was that we were only staying for one night and could not take full advantage of the beautiful room and hotel facilties. The bed was one of the most comfortable I have ever slept in and the turn down service had a few nice touches. Considering how nervous I was about the next day I slept like a baby.", "title": "Wished I was staying longer....", "helpfulness": 3, "user": "MrsRoos", "date": "April 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159141974}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Will definitely be staying here again and making sure I try out the bar and restaurant.", "title": "Fabulous quirky hotel!", "helpfulness": 2, "user": "Chookster99", "date": "April 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159115208}, {"rating": 3.0, "title": "Shame the £30m refurb didn't run to heating", "text": "Definite wow factor on arrival in lobby/reception but oh my goodness how cold can a bedroom be? Despite fiasco over breakfast - was it/wasn't it included in the rate - I would definitely return ....but in the summer or with a hot water bottle.", "user": "Paul B", "date": "January 23, 2013", "id": 150413198}, {"rating": 5.0, "title": "Great hotel. Central location.", "text": "My husband and I stayed for a week from 13th Jan. I had booked a superior Queen plus and we were upgraded to a Deluxe King on arrival as according to the gentleman at the desk we would be needing a larger room seeing as we were going to stay for a week. The room was on 4th floor overlooking the garden at the entrance.", "user": "BCSantos", "date": "January 23, 2013", "id": 150377404}, {"rating": 5.0, "title": "i feel so content (Excellent service that beyond expectation)", "text": "Everything was spotless and remained so during the whole of our stay. The staff were very friendly and helpful and it was service with a smile.", "user": "FairyMantra", "date": "January 23, 2013", "id": 150317481}, {"rating": 5.0, "title": "Wow factor, central location.", "text": "I cannot comment on the food as we went on a room basis only. However 3 mins walk away we hit upon a little cafe called Exlnt which provided an excellent full English breakfast for £4.95.", "user": "mumoftwopointfour", "date": "January 22, 2013", "id": 150278485}, {"rating": 5.0, "title": "A lovely hotel", "text": "The hotel was central and we ended up walking to the West End on various occasions. As other reviewers have mentioned it is also very near to Westminster, Whitehall, London Eye and just round the corner from St James tube station.", "user": "owensmum47", "date": "January 22, 2013", "id": 150273889}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "As soon as you get to the St. Ermin's, you can feel how your experience is going to be: From the nice exterior, to the kindness and speed of check-in, to the concierge ample information...", "title": "Nice, modern, central. Great choice in London", "user": "ARUANO", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 159887839}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "They have spent a lot of money in this renovation. You can see it. The rooms are, like all in London, small for a hotel this category, but they have managed for you not to feel it. The sheets, the bathroom ammenities, the tea and coffee in they provide to you, all are of excellent quality, So is the wifi signal (something some good hotels lack these days).", "title": "Great location and hotel", "helpfulness": 3, "user": "old-jogger", "date": "May 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159846874}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "The situation is perfect. You are steps from Buckigham, a short stroll through St. James Park to Piccadilly, one tube station to Victoria.", "title": "Great location, great hotel!", "user": "Bonnie406", "date": "May 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 159841484}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "If you can, pamper you with an stay in St. Ermin's in your next visit to London.", "title": "amazing hotel", "helpfulness": 1, "user": "oohshinny", "date": "May 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159798926}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "St. Ermin’s is a unique hotel, located conveniently for many London attractions. Clientele seemed to be mainly tourists, with a sprinkling of business people. It is a very short distance from an underground station on a quiet street in Westminster. From here a reasonably fit person can walk to St. James and Hyde Parks, Buckingham Palace, Trafalgar Square, Westminster Abbey and the Houses of Parliament, theatres and (if you want a longer walk) the British Museum, St. Paul’s, the Globe Theatre, London Eye and the South Bank.", "title": "Lovely stay at St Ermins", "helpfulness": 1, "user": "MoBest", "date": "May 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 159713111}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "I stayed here while attending a show. This hotel is beautiful with excellent service, all the staff from reception to housekeeping are so helpful. The location is very central to many of the sights of London, all within walking distance. I loved it.", "title": "Great location in a beautiful hotel", "user": "InishowenCmg", "date": "October 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142895400}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "We had a lovely weekend break at St Ermins with friends and I have to say its just such a beautiful hotel. Lovely bar, great drink selection and the perfect location for seeing all that London has to offer. From the moment the wonderful Amy on reception checked us in until the time came to leave, we had the most amazing stay. Id definitely recommend this hotel to anyone who comes to London as Im sure you'll love it as much as we did.", "title": "Another great stay at St Ermins", "user": "ghp12377", "date": "October 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142843051}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Just stayed 6 nights at St. Ermin's and I believe it is one of, if not the nicest, hotels I've ever stayed in. The rooms are quiet, the bed is very comfortable and the service impeccable. If I ever return to London this would be the only place I would want to stay and it's central locatiion is one of the best. You will not be disappointed. The shower head was supersized and I felt like I was bathing under a warm waterfall. Then, to top it off I slipped into one of their cozy robes that they provide free of charge. They also provide a French press for coffee and tea and if you want fresh milk to go with it, no problem. Just call and they bring it up immediately. I can't say enough good things about St. Ermin's...so many lovely aminities. I felt truly spoiled.", "title": "Lovely Hotel with Fantastic location", "helpfulness": 1, "user": "Jan749_12", "date": "October 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142808855}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The Ermins is an excellent hotel with a great location. I often stay here for both work and pleasure and have always had a great stay.", "title": "My Favourite London Hotel", "helpfulness": 1, "user": "GLD2", "date": "October 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142804400}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Rooms: The rooms are modern and very well equipped. The beds are very comfortable, the bathrooms are plush and have great facilities. The rooms have large flat screen TVs which are perfect for relaxing and watching a movie, with room service. Mini bar is stocked with a good selection too. Rooms over looking the entrance are very nice.", "title": "One year on and its even better...", "helpfulness": 1, "user": "Clare M", "date": "October 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 142803801}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Central London hotels can be hard on our budget, but with only two nights in town on this visit, we were willing to pay for a great location. At the time of booking, the hotel offered 30% off if paid in full at least 4 weeks in advance, so the room averaged less than $270 per night including taxes. Terrific! Plus, since we mentioned a special occasion in the comments box, we were upgraded to a room with a lovely view overlooking the front court. The room wasn't huge, but fine for two nights. Wish there'd been a second chair--just one for the desk. Rooms are attractively furnished, have a safe, minibar, very nice marble bath. Wi-fi is free only in the lobby--and it's a beautiful lobby--get the password from the concierge. We didn't spend the 15 pounds per person per day for the breakfast... enough little shops and cafes nearby.", "title": "Special offer made this affordable", "user": "wunderwoof", "date": "October 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143480589}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Needed a place to stay for a weekend break with young children. I was really impressed by the service of the staff from the moment we arrived (Which was early!). The room was ready and they let us check in straight away. Room was decorated to a high standard and perfect for 2 adults & 2 children. Centrally located and easy to find highly reccomend, will stay here again !", "title": "A truly wonderful hotel", "user": "GwinnieB B", "date": "October 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 143451222}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Great hotel, facilities, people, infrastructure, location and so on. If you are planning to visit London for 3-4 days, I'd recommend you to pay what this hotel cost, as considering its location and services, you will finally agree that it is convenient. Breakfast is excelent, weekends extenden until 12pm. You will be a couples of blocks from House of parlament, London Eye, underground, etc.", "title": "Great Hotel, highly recommended", "helpfulness": 1, "user": "DrMart", "date": "October 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143449770}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "We stayed here on a recent family mid-term break to London and would definitely stay again.", "title": "Stylish hotel in great location", "user": "Dave H", "date": "October 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 143412814}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Stylish rooms and public areas with efficient friendly staff.", "title": "excellent hotel", "user": "Marian2103", "date": "October 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143373195}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "My boyfriend and I stayed for a few nights this past April. You couldn't beat the location. We could walk to Buckingham Palace, the houses of Parliament, West Minster Abby, and many other places. The rooms were nice, very clean however a little on the small side and the views were terrible. The continental breakfast was great, we thought about getting the hot breakfast however there was no need!!", "title": "LOCATION LOCATION LOCATION", "helpfulness": 1, "user": "gincon", "date": "May 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 159697707}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "I first went to this hotel some 15 years ago for a breakfast meeting and remember being amazed by it's grandeur, style and breakfast selection. Then I visited to stay on a business trip about 5 years ago and it had really gone downhill - the rooms were shabby and the breakfast area was like a canteen - and not a very nice one. I am pleased to say that the recent renovations have changed all of that and during a recent stay I had a lovely room and great breakfast. The hotel is ideally placed for visiting the London sites and two minutes from St. James Park tube station.", "title": "Glad to see the hotel restored to it's former glory", "helpfulness": 1, "user": "spml13", "date": "May 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 159694159}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "I have always known that this hotel was here; just never booked to stay here until I needed a room very close to a particular office in Victoria…Now that we have tried the St Ermin’s Hotel we will definitely be back! The hotel enjoys a surprisingly quiet setting just off a very busy road with a lovely front entrance complete with first floor terrace bar. We booked a deluxe king room (£259 room only –midweek peak time) and were very pleasantly surprised. The room itself was big enough with a lovely, comfortable king sized bed, good selection of TV channels & films and tea and coffee making facilities. The bathroom was very small (you need to manoeuvre round the door carefully to get to the loo!) but had everything we needed. The shower over the bath was fine, towels were big and sparking white and the White Company toiletries very acceptable although I’m a bit disappointed at the growing trend for London hotels to put “captive bottles” in bathrooms where you can never get quite enough product out in one go… Check in and check out went without a hitch and the staff were pleasant and professional. As we were working very late we had hoped to grab a bite from room service, but the menu was very limited – not too much of a disaster as there are numerous restaurants in this area so we just ate out instead. All in all I’m pleased I finally tried the St Ermin’s and would use it again for a hotel in this part of London.", "title": "Really very nice!", "helpfulness": 2, "user": "quin-i-bog", "date": "May 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159527492}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "in the morning we were in the rest.for having breakfast.The man shown us our table and before sitting we collected our dishes from banket and ordered extra omlet to our table. after sitting our table we sow same wet cloth on the table, some leakage milk from table to our pants and chair. we called waiter to shown condition of table and changed our table to the next. they apologized and cancelled our payment for our extra order. that happened normal for us, but your waiter did not know how to clean table that one abnormal.i dont explane what they did.", "title": "medium", "user": "atak197478", "date": "May 2, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 159444832}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "floor of room covered nice carpet but when we started to walk in the room you can hear you step noise. even next room floor noise too.", "title": "Great Location and quiet!", "helpfulness": 2, "user": "Larrybill", "date": "April 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 159202358}, {"rating": 3.0, "title": "Great service masked one significant fault", "text": "I have just returned from a two night stay on business. The hotel seeks to present itself as a high-end 4 star and in terms of the friendliness and staff courtesy it is in 5 star territory. However, what really let the hotel down was that the room I was allocated had no natural light. I did not immediately notice when I arrived because it was dark and I had to work and by the time I did realise it was quite late in the evening. In the morning, however, it became clear that because the windows looked directly into another bit of the building they had been painted over. This may not make too much of a difference in January but in July it would have totally unacceptable, especially if working in the room. Had I been paying privately I would certainly have demanded a change. Another problem was that for a significant part of the second day there was no hot water in the hotel from early morning until late afternoon. The hotel was apologetic and I received a free breakfast upgrade to compensate so I don't hold it against them but what might otherwise have been a possible 5 star review cannot exceed 3 stars simply because of the painted windows. I would rather have look into an ugly brick wall than to have the lights on.", "user": "BigMac58", "date": "January 25, 2013", "id": 150624837}, {"rating": 5.0, "title": "Superb hotel in the heart of London", "text": "We were treated to a long week-end by our daughter as a Christmas present and ttokup the offer over the worst snowy weekend of January 2013. We should have known that the hotel would rise to the challenge; the imposing entrance, opposite New Scotland Yard, was free of snow as the taxi pulled up. The concierge was at the door of the taxi before we could get out and from there onwards the long week-end was fantastic! The entrance hall is extraordinary and feels like you are walking into a decorated wedding cake, all white and decorated plaster work ceilings. Warm and welcoming with fire places and seating in \"family\" settings make for a really positive immediate impression. The room we had was equally welcoming and the heating was effective and easy to control, the bed was large and one of the most comfortable we've encountered. Breakfast was excellent; we chose the continental style option which gave extensive choice, cereals, meats, cheeses, patisseries etc. The staff were charming and attentive, adding to the experience. We'll have to have another visit when the weather is better as we like to walk and the location of this hotel is good for easy access to some of the best bits of London.", "user": "Julian C", "date": "January 25, 2013", "id": 150567194}, {"rating": 5.0, "title": "What a beautiful hotel!", "text": "I last stayed here when it belonged to another company. The remodelled and upgraded hotel took my breath away with its old grandeur now brought back to life. It's very expensive but worth it for a special treat! The care from the staff and the detail of their service was excellent. Be careful if you pay a high rate for B&B - you may expect you've paid a full English and just get a croissant (I did)!", "user": "Jayne451", "date": "January 24, 2013", "id": 150527773}, {"rating": 2.0, "title": "Cold....", "text": "Normally stay in the Park Plaza, but decided to try this hotel as it is round the corner from my office. When I arrived my room was cold and somebody had wheeled in a portable radiator. That did eventually warm the room up by breakfast time.", "user": "Doohill", "date": "January 24, 2013", "id": 150468880}, {"rating": 5.0, "title": "Sensational", "text": "I tried to order room service and found myself in a protracted debate about a specific salad that the receptionist claimed didn't feature on the menu I was staring at. Got a call back to say that this complex piece of culinary construction ( a mozzarella and tomato salad) was in fact on the old room service menu of which I had a copy in my room. I was offered a Greek salad in exchange which was £8 and minute. I guess the ingredients would have cost sub £0.50. When my room service was delivered the chap seemed keen to engage in a philosophical discussion about why I had the old menu in my room. I politely suggested that he was asking the wrong person. So I had my fish and chips (£16) and my miniature Greek salad (£8) and went to bed.", "user": "JaneCaps", "date": "January 23, 2013", "id": 150451123}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "DISCLAIMER: The following review is of the afternoon tea experienced in St. Ermin's Hotel's library, not of an overnight stay.", "title": "Afternoon Tea: A Serene, Classic Experience", "user": "malioil", "date": "October 17, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0}, "id": 143038319}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "There is something special about St. Ermin's Hotel- perhaps it is the history behind the property, or perhaps it is the stupendous theatrical architecture by the renowned architect E T Hall, that creates a truly grand space, yet still managing to be intimate enough to not look out of place in a large home. In fact, the reality is that it is a mix of all of these fine attributes that delightfully work together to create a warm and comfortable atmosphere- a perfect one in which to consume fine tea. The service found in the library was warm and intuitive- you are treated well, and your wishes met. Granted, on the day we were there the Persian version of the X Factor was filming, hence there was some disruption, but the hotel's security did do its utmost to try and keep the film crews out of the hotel's main areas. The collection of tea was, while not exhaustive, more than adequate, with more than 20 teas of different origin and nature. The cakes, scones and sandwiches were also filling and tasty. Overall, it was truly an afternoon well spent- and at only £56 for a couple, a delightful value.", "title": "Very Disappointing Service....", "user": "Feltish", "date": "October 16, 2012", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 1.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 142944315}, {"rating": 5.0, "title": "Exceptional hotel & service", "text": "We stayed at St. Ermin’s from 05 Oct until 12 Oct. I booked through Booking.com specifying two adults and one child through their drop down menu. When the results pop up, no more than two adults were indicated under the Max column (occupancy). If you roll the mouse over the icon, it brings up a box indicating this is standard occupancy. Between this and the blurb at the bottom of the page:", "user": "B19ACP", "date": "October 15, 2012", "id": 142906424}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "St Ermin's hotel is a London gem. It is located near Westminister and Parliament making it convenient for business and tourism. Winston Churchill used the hotel in World War Two to plan a covert war against Hitler in Europe. The rooms are clean and comfortable. The breakfast is quite good. Service is efficent and reliable.", "title": "A great hotel in the heart of London.", "helpfulness": 1, "user": "NelsonVNile", "date": "October 20, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 143298141}, {"rating": 5.0, "title": "Great Service", "text": "The service was great at this hotel. Our room was also a very decent size, clean and lovely looking. The front desk was very helpful and was able to store our bags for us. The location was perfect. You were very close to the tube station and with a little walk could reach a lot of the main sights.", "user": "trisha j", "date": "October 20, 2012", "id": 143269496}, {"rating": 5.0, "title": "Great location, charming service and excellent \"family\" rooms", "text": "Traveling with my sisters, I searched London hotels that were suitable for two adult women to share a room. So many hotels in Europe do not offer twin rooms, let alone, double beds in one room. St Ermin's not only offers double beds in their rooms, they offer family rooms that have two bathrooms within one room! Incredible! Besides the conveniences, this hotel is charming on every level- the staff was helpful, personable and simply nice to deal with. The rooms were immaculate, the beds were OH SO COMFORTABLE... it was hard to leave them in the morning! The in room coffee service was just the right touch to lure you awake. The St James tube stop is next door, so getting around London was a breeze. Best tip for future travelers, eat breakfast each morning in the little restaurants just inside the tube station. Less than 5 pounds and you'll be set for the day. I highly recommend this hotel for the location, service and value.", "user": "A TripAdvisor user", "date": "October 18, 2012", "id": 143160936}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "We were due to stay here in August, but due to a close family bereavement we had to cancel last minute. The hotel were really understanding and allowed us to change the dates without fuss.", "title": "Fabulous, helpful and perfect.", "user": "Dazmiester", "date": "October 18, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 143130495}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "On the stay we found lovely surroundings, lovely rooms and centrally located for all the sites. I definitely recommend this hotel.", "title": "Nice !!!", "user": "V12Aston", "date": "October 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 143052407}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 4, "variance": {"poor": 34, "average": 96, "very good": 580, "terrible": 14, "excellent": 1633}, "aka": "Jolly St Ermins Hotel", "slim_ranking": 0.0306976744186, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "St. Ermin's Hotel re-opened its doors in April 2011, following a dramatic £30 million refurbishment. Nestled in the heart of London, this four star deluxe hotel is at the center of the city's vibrant business, leisure and government landmarks. St James’s Park, Parliament Square, the London Eye, Westminster Abbey, Houses of Parliament, and Queen Elizabeth II Conference Centre are all just minutes away."}