{"user_rating": 4.5, "review_count": 1330, "name": "St. Regis Princeville Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "My wife and I spent 8 nights at the St Regis Princeville. It was our 4th time on Kauai and 6th time on the Islands. We were celebrating our 15th Wedding Anniversary and we usually stay down in Poipu at the Hyatt but we wanted to do more up on the north shore this time so we figured we would give it a whirl at the St Regis. Very impressive property and top notch service from the staff. No complaints there. We were upgraded unexpectedly to a Jr. Suite with a butler and loved the room and the view. We had just finished staying a week on the Big Island at the Four Seasons Hualalai, which along with the Hyatt, are our two favorite properties to stay at while in Hawaii. Our Travel Agent Nancy Herron with Journeys to Hawaii out of Oregon was incredible to work with considering we are from New Hampshire. She was instrumental in getting us the room upgrade. The negatives for this hotel were we didn't like the pool as much as the one at the Hyatt or the Four Seasons and thus spent very little time there; second: the hotel bar seemed to require people to be a little more dressed up, which is fine if they had other options besides the pool bar. Also, we were told no flip flops allowed there.??? Considering that is pretty much all we wear when in Hawaii.; third: we knew they required guests to use valet at what we thought was $20/day but found it was $30/day (might have increased from when we booked back in November) but to add insult to injury, they taxed us on it!!??? The Four Seasons Hualalai gave us the option to self park and if we valet parked it was $20/day and no tax!; fourth: there are no ice machines so you have to call for ice delivery and of course, unless you wanted to feel like a jerk, you tipped the person who brought it to you, so therefore were really paying for ice; fifth: no self launder services, so you have to pay an outrageous fee to get things laundered (thank God we went to the Four Seasons first where they have laundry machines for guests to use and ICE MACHINES, so we were able to wash our clothes before going to Kauai and the St. Regis). There are also no close laundrymats to go to either. This would have been crazy if we had stayed here the first week of our two week vacation considering weight restrictions from airlines on luggage. We actually ended up having to wash some shorts in the bathroom, hang dry them and purchase a few t-shirts that we didn't need or want, to get us home. Cheaper than paying the St Regis to launder them. Look, I'm all about paying for what I get and rewarding great service. Our stay here was a good one but these negatives really hurt the overall experience. Again, I don't want to take away from the beauty of the property, rooms or staff, all top notch, but.... If we were to do it again, we would probably spend half of the stay on Kauai down at our still favorite resort the Hyatt and then rent a condo or B&B for the time we spend up on the North Shore for the second half of the trip, if you care for my advice. There is so much to do and see on the North Shore but your hotel options are limited to the St. Regis or the Westin. The St Regis is an awesome property for those that like that atmosphere but we get an unbelievable experience at the Four Seasons Hualalai and the Grand Hyatt on Kauai with a balance of elegance, five star resort accomodations with a down to earth atmosphere. That's my story and I'm sticking to it. Aloha and Mahalo!", "title": "Very Good but a Little Too Stuffy for our Taste", "helpfulness": 5, "user": "Daniel M", "date": "September 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 140782921}, {"rating": 5.0, "title": "Pacific Dream Photography was Fabulous!", "text": "We stayed at the St. Regis for 7 nights and really enjoyed the hotel, but I will save the review of the property for a separate thread. This review is for Pacific Dream Photography, which is based in the St. Regis hotel and offers a free professional photoshoot on the beach for hotel guests. My fiance and I walked by the desk and signed up on a whim - Matthew and team were very accommodating and were able to squeeze us in for a sunset photoshoot that was absolutely fabulous. Hanalei Bay at sunset is an experience of unparalleled beauty and we are so happy that we did the photoshoot so that we can re-live the memory. The shoot itself was a lot of fun and the pictures turned out amazingly. Highly recommended!!", "user": "Michael J", "date": "September 19, 2012", "id": 140722347}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "This is my favorite spot in all of Hawaii....I loved it before it became St Regis, and I love it", "title": "Bali Hai in Princeville", "helpfulness": 1, "user": "Shelly B", "date": "September 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140699418}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "even more now....The setting is magnificent with its views of Bali Hai...(The Sleeping Giant) -", "title": "Far from 5 Star", "helpfulness": 6, "user": "FDFTJA", "date": "September 18, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 140640277}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The beach is lovely with its palm trees jetting into the clear waters, and you can snorkel right", "title": "\"The worst hamburger I ever ate!\"", "helpfulness": 5, "user": "TurtleburgerReno", "date": "September 17, 2012", "detail_rating": {"value": 1.0, "location": 4.0, "service": 1.0}, "id": 140560452}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "I was expecting to be wowed, but was severely underwhelmed. Property was so in need of a update. Furniture was severely worn, room door was so scratched and dented. I stayed on the fourth floor where you have a outside entry room. HUGE rust stain on the wall, running down from fire sprinkler. Mattress was worn and lumpy, windows were dirty and I saw a bunch of ant like bugs on the furniture.", "title": "A Five Star disappointment.", "helpfulness": 5, "user": "Ndalsteve", "date": "September 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 141063328}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Now the bathroom, shower tub combo thing that is open, up against a glass wall that looks into the room. It's one of those flip a switch and it turns frosted. So while showering people in the room have a great silhouette of you taking a shower, this is a huge fail. I was staying with two fiends, you should be warned about this. The AC was hardly working and was very humid in the room.", "title": "Service, an Amazing View and Sunset", "user": "ChrisCTB", "date": "September 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141050032}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "Not a great stay. SO disappointed!", "title": "A majestic escape", "user": "LOVE2LOUNGE", "date": "September 22, 2012", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 140957725}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "If you travel to the North Shore of Kauai you must stay at this property. While there are nice properties on the south side of the island there really isn't anything as grand as the St. Regis in Princeville.", "title": "Breathtaking views and friendly staff", "helpfulness": 2, "user": "TravelSmart007", "date": "September 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140800831}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The views are to live for and the service is going to spoil you.", "title": "Review of Sunday Brunch", "helpfulness": 6, "user": "cruisin*tigger", "date": "September 20, 2012", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 2.0}, "id": 140788408}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Use valet parking, then enter one of the most beautiful hotel lobbies anywhere. Head across the lobby, stopping at the indoor water feature to admire the stunning view. Downstairs to the left is their premiere restaurant in one of the most beautiful settings in the world: Hanalei Bay with its surrounding mountains. By all means, be seated outside.", "title": "Lunch on the terrace with a Spectacular View", "helpfulness": 1, "user": "SuperRVer", "date": "September 24, 2012", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0}, "id": 141142561}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The food and service are first class. Many of the friendly staff have been here through several ownerships of the \"Princeville Hotel\" and know how to take care of you, quietly and attentively. Enjoy an excellent lunch, carefully prepared, presented, and delicious. Dinner here is also excellent, but we recommend having at least one lunch here as the highlight of your Kauai visit. Expensive and very well worth it.", "title": "Pure Luxury", "user": "ANCOfficer82", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141135526}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "If you ever travel to this island, this is the only place that truly encompasses the beauty and milieu of Kauai. Make sure you reserve a vehicle for your stay, since a one-way trip from the airport to the resort is about 90 USD, so its worth renting, plus you can drive around. The staff is extremely hospitable and professional. The views are breathtaking and the amenities are plenty abundant. The rooms (or at least the one I stayed in) are just ridiculous. WIth high quality furniture, electronics, sheets, and materials it's luxury at your fingertips. Breakfast, though expensive (40-50 USD), I would have to say is worth the price, unlimited buffet with gorgeous views allow you to soak up what you are there for, a getaway pampering vacation, an escape from reality. Spoil yourself and stay at this resort.", "title": "You'll have a hard time trying to find better.", "user": "Cary B", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141122755}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "This is one of the nicest hotels that I have ever been to in Hawaii. The grounds, rooms, food, etc were all AMAZING!!! But the staff...you could not find better! They were all so full of Aloha, warm welcoming and friendly. We will absolutely be back soon. I love this place!!!", "title": "paradise found", "helpfulness": 1, "user": "dallasgirl53", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141103680}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Truly a five star hotel experience with jaw dropping views of Hanalei bay. From the moment we arrived, the care the valet staff took to get us into the registration, to the moment we had to say \"aloha\" when we departed after 5 nights, we felt that the service was top notch-helpful without being obtrusive.", "title": "A fantastic time at a laid back resort", "helpfulness": 1, "user": "lillian771", "date": "September 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 141098227}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "This was our second stay at this hotel, which commands the best position on the North Shore of Kauai. The best features of this hotel are immediately visible upon arrival: the view and setting is spectacular and, in my opinion, one of the most enchanting and haunting tropical views in the world. The hotel looks across the beautiful and unspoilt Hanalei Bay to the peaks beyond and in particular Makana Mountain, also known as Bali Hai. On a good evening the sunset is outstanding, especially when viewed from the lounge or terraces of this hotel. As one person said to me, this place really looks as good as your screen-saver!", "title": "A heavenly spot but no balconies and limited dining options detract", "helpfulness": 4, "user": "Toofastcat", "date": "September 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 141474123}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Also exceptional is the remodelled pool area, which was totally recreated when this hotel was transformed from a Sheraton to a St Regis a few years ago. The pool is a beautiful creation, with enough loungers well-spaced around it, with lawns and a sandy beach below. There are also a few quiet areas further along the shore, or you can simply walk out along a normally quiet public beach and paddle, swim or surf in the sheltered bay.", "title": "Beyond Expectations to say the least", "helpfulness": 1, "user": "BrianNElaine", "date": "September 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141414147}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "That’s the outside; the problem is that the building doesn’t live up to it. This is basically a concrete-construction Sheraton, built in 1985 – in the era of big scale high ceilinged public roomed hotels. That was when the emphasis was on the public spaces rather than private spaces. Although it was closed and remodelled in 2009, the original structure remained intact. The rooms are of Sheraton proportions, not overly large (for the price) and very importantly all lack a balcony. That’s right – NO BALCONIES! The best you can do from your Ocean View room is to watch the ocean from the window - very disappointing. They have nice bathrooms, but that hardly makes up for the inability to enjoy a sunset cocktail on your own terrace.", "title": "Conflicted", "helpfulness": 6, "user": "361Roomwithaview", "date": "September 26, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 141346585}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The interior of the hotel has a mixture of refined touches tacked onto the original bold but budget Sheraton format. The two main indoor restaurants are located under a double height area, which, with the rather gloomy lighting at night, makes them somewhat depressing. The menu is passable, nothing fabulous. You can dine outside on the restaurant terraces, which by day would be spectacular. But they are closed for lunch! You may enjoy breakfast or dinner only and the Kauai Grill is closed some nights, leaving you precisely one restaurant to choose from. Not very 5-star.", "title": "Best view on Kauai, don't forget your wallet", "helpfulness": 3, "user": "pvalen", "date": "September 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141271628}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The poolside bar/restaurant has a very limited menu which will serve you a snack or a burger but not anything more, while the Deli Shop in the hotel has no sandwiches left by lunchtime and closes at 3pm.", "title": "Lovely Resort", "user": "Galhotel", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141188392}], "location": {"country": "United States"}, "stars": 5, "variance": {"poor": 54, "average": 109, "very good": 230, "terrible": 31, "excellent": 906}, "aka": "St. Regis Princeville Hotel Princeville", "slim_ranking": 0.2, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "A 2006 AAA Four Diamond Hotel Award winner, Hawaii's St. Regis Princeville Resort offers 23 idyllic acres for rest and play. Luxurious dining, spa, swimming, and golf on the northern shore of Kauai"}