{"user_rating": 4.5, "review_count": 142, "name": "St. Philip French Quarter Apts.", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled solo", "text": "I checked out of one of the big, chain hotels and transferred to the St. Philip. The St. Philip is clean, relaxed and in a great location. When I stay in New Orleans, I prefer a more authentic experience and that means staying in an old French Quarter building with a courtyard, no elevator and the feeling of being a local. I was happy to stay here.", "title": "Relaxed at the St. Philip", "helpfulness": 1, "user": "MEPM", "date": "August 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 170691682}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "Couldn't ask for a better location in the French Quarter. While not a Hotel, the rooms large and private. Great amenities for those who want the comforts of home on vacation. Prices are very reasonable and the staff is professional.", "title": "What a Jewel", "helpfulness": 1, "user": "BillBiggs", "date": "July 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166192466}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "Bill Biggart", "title": "The best hidden gem in New Orleans", "helpfulness": 1, "user": "dluke1516", "date": "June 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164637196}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "If you are looking for a place with a lobby, a concierge, a valet, and elevators...this is NOT your place. But if you are looking for a place that embodies the heart and soul of the greatest city in the country then look no further. The rooms are top notch, the atmosphere of the building is indescribable, the courtyard is amazing, the location is fantastic. The gentleman who runs the place (Craig) is passionate about his building and is willing to accommodate any needs or wants you might have. There is no better place to stay in New Orleans than the St. Phillip. I can guarantee that you will not be disappointed if you stay here, and every time you return to this great city, you will want to stay at the St. Phillip.", "title": "A hidden gem in the heart of the French Quarter", "helpfulness": 1, "user": "Qualzog", "date": "June 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164435707}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "My wife and I recently spent 7 nights at the St. Philip French Quarter apartments to celebrate our honeymoon in New Orleans. We looked at many other options before deciding on booking here and we finally settled for the St. Philip after exchanging a few extremely friendly emails between the owners and myself. WE WERE NOT DISAPPOINTED. If you've read any other reviews, you will have learned that this isn't a \"hotel\" in the traditional sense. No maid or room service, no restaurant or bar on site (its NOLA there's a 24 hour bar across the street!) etc. If you require that, look elsewhere.", "title": "Coming home to our appartment at the St.Phillips.", "user": "momiofall", "date": "May 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162536354}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "I stayed at the St. Philip Apartments with friends in September but didn't organize the travel. So I was completely WOWed when we arrived and the staff was friendly and laid back and eager to please. We had such a great time that I couldn't wait to go back. When I showed the pictures of that visit to my family, we planned our own trip in December. We stayed 3 nights in a beautiful second floor room that had it's own covered patio that overlooked the french quarter. It was an easy walk to anywhere we wanted to go. The room had enough room for my mother and two sisters and myself and we all slept comfortably. The room was spacious and colorful and well appointed. I can't say enough nice things about this place. The downstairs courtyard was beautiful and decorated for Christmas. We had a wonderful time and can't wait to pick a date for our next trip down there.", "title": "Great Family Trip", "user": "Casandra K", "date": "March 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154560905}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "I stayed four nights. The staff was very friendly and informative about area attractions, places to dine, etc. My room was \"funky chic\", very clean and comfortable. Like other reviewers, my favorite spot was on the balcony.", "title": "Perfect Location", "user": "Nestor B", "date": "March 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 154294361}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "Fantastic location and a great place for 2 couples to share the trip of a lifetime! The staff was very helpful before and during arrival. The balcony was our favorite spot to people watch and relax. Definitely go to Irene's (across the street) for dinner, worth the wait!", "title": "Super time at the Super Bowl!", "user": "Diane D", "date": "March 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 153982067}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We stayed in Rm 16 for 4 night during the Super Bowl and it was perfect. We were close to the action both Bourbon Street and Frenchman Street but separate from all the noise and havoc. I didn't even have to use my earplugs once! The newly renovated kitchen was great and we loved the eccentric decorations. Our room was one bedroom separate from the living room/kitchen combination so lots of space. The manage was very friendly and helpful with restaurant suggestions. I will definitely stay here again in the future. Be aware that there are stairs and no elevator.", "title": "Great Location!", "user": "california94941", "date": "February 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 152970936}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The St. Philip has ideal location nestled in between the French Quarter and Marigny. The units have recently renovated modern kitchens and that unique sense of style typical of New Orleans boutique establishments. We have stayed here on multiple occasions with the most recent being Mardi Gras 2013. It was perfect. A king cake and full bag of ice awaiting our arrival and everything we wanted to see within 1 mile. While the party raged 24/7 on the street, the courtyard offered a quiet oasis from the madness.", "title": "A hidden gem", "user": "Vincent T", "date": "February 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152485619}, {"rating": 2.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "I thought a lot about this review. I have read a great deal of other peoples reviews on this property, both positive and negative. I have also found the owner/operator’s responses interesting and occasionally revealing. My wife and I stayed here for a long weekend in April 2013. The location is very good, right in the French Quarter but far enough off of Bourbon Street to keep you out of the mayhem when you need a break from reverie. Easy walking distance to pretty much everything you’d want to see in the city. An inexperienced traveller might not make note of the fact that this is not a typical hotel, but rather more like a vacation rental. I didn’t really know this up front ( We booked through a 3P site ) but I read everything provided carefully and pretty much knew what to expect. What does it all mean? Well, there is no daily room service ( but you can get clean towels daily ). Things like soap and shampoo are not necessarily provided ( although a slippery half travel sized bottle of some one’s shampoo was left for us ). At the end you will be expected to do the bulk of the work in cleaning up after yourself. It’s much like staying with someone in their spare room. On the face of it, the place was pretty tidy but certainly did not have the feeling of being professionally cleaned. The bed was just okay and the linens are strictly grandma’s garage sale material. As I said, you are away from the nightly cacophony of Bourbon, but deliveries and other truck related activities begin very early so don’t bank on a late morning lie-in. There is more or less a full kitchen set up which with so many amazing restaurants in the area you’ll likely not need it, but I always appreciate a fridge. This one was big. I suppose the main question is value. We came unbeknownst to us, on a busy weekend and we all know rates rise and fall based on demand. My personal opinion is; stack this up against any hotel that charges over $330.00 per night and the value just isn’t there at the St. Philip’s. That kind of money gets you a great deal more almost anywhere else, and that is just a fact. I expect this review will elicit", "title": "Louisana Purchase", "helpfulness": 6, "user": "HavanaBob", "date": "May 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 159376373}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "a response from the proprietor as I have made some remarks here that are uncomplimentary. That is fair. Whatever their response I urge you to balance your opinion due to the fact that every single patron who has made a complaint or disparaging remark has, in the owners opinion, been 100% responsible for their own poor experience. I don’t think that shows a propensity for objectivity or the probability of learning from ones mistakes.", "title": "Great place but way too pricey for what you get", "helpfulness": 3, "user": "Jess H", "date": "April 28, 2013", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 1.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 159041477}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Stayed here two years ago and had an amazing time with the best service from the owner. Unfortunately the owner was gone for most of our stay so service was poor. And by poor I mean no one was around. At one point we accidentally broke a glass in our suite but didn't have a broom in our apt. No one was to be found so had to clean it with Kleenex and our hands. Got glass in our feet, it sucked (were Canadian so without thinking take our shoes off when we go indoors, oops). Toilet paper etc. was scarce (again due to lack of staff) and there was zero concierge for ideas and tips while in town. I'm not a picky traveller (normally stay in hostels) but I found that this time around for the price it wasn't worth it. Everything else was fabulous though (we were in room 8 and made good use of the balcony). May consider giving it one more shot but will research other places too for next time. I think we were just there at a bad time.", "title": "Location, location, location!", "user": "Nancy N", "date": "April 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 158014229}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Friendly and accomodating service, a fantastic location, delightful courtyard and a great balcony--this place is a real gem! You are literally a couple of blocks from both Jackson Square and the French Market. Lots of great restaurants are nearby. The staff provides great recommendations, reading materials, and friendly advice. People walking up St. Philip street would see us on our balcony and call up, \"Wow! Love your place!\" I couldn't agree with them more.", "title": "Warm & Friendly", "user": "Elizabeth L", "date": "April 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157792003}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "It's the best place to stay in the French Quarter! It is close to many great restaurants and attractions that the Quarter is known for. The St. Louis Cathedral and French Market is around the", "title": "In LOVE with NOLA", "user": "DallasGal1", "date": "March 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 155895269}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "What a great way to enjoy the atmosphere of one the most entertaining cities I've ever visited. I was very fond of this location and the people here, June and Tyler were amazing to help out with suggestions and directions. I really had fun staying in the comfort and safety of these apartments nestled in the convenience of the French Quarter. I even considered not sending my five star rave review for fear I'll never get in here again! I hope to come back and stay here again(~:", "title": "Laissez les bon temps rouler", "helpfulness": 1, "user": "Soozy M", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162211931}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "One of the best places we've ever stayed! We chose the St. Philip Apts. for our anniversary stay in New Orleans' French Quarter and love it here! The train was late getting in but Tyler met us at the door and we knew immediately we were in the right place, she's waayyy cool! She made us feel completely welcome despite our late arrival, so very nice after a long tiring day. The apt. is spacious, well appointed & with everything you'll need and has a true French Quarter ambiance. The courtyard welcomes you to sit and enjoy it as you plan the day or just relax to the sound of the fountain as you read that book you've been wanting to get lost in.", "title": "Merci Beaucoup!!", "user": "Trailwalker55", "date": "May 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161211236}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "Within walking distance to everything, we found the St. Philip Apts. the absolute best place to stay in the French Quarter and they made our anniversary a memorable one. Merci Beaucoup!!", "title": "Unique, fun, great location. Not stuffy like a hotel and has great charm!", "helpfulness": 1, "user": "Rp2133", "date": "May 7, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 160010872}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "We stayed here for jazz fest. It is located perfectly in the middle of everything yet quiet and cozy. Has great charm and is comfortable. Will stay here again and again! If you are looking for a full service hotel, look elsewhere. If you are looking for a fun, friendly locally owned property in the heart of the city, this place will exceed your expectations!", "title": "Location,Location,Location", "helpfulness": 1, "user": "aswing4ever", "date": "May 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159480667}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Located in the Heart of the French Quarter is one of many pluses in staying at the St. Phillips. The staff was very friendly and always available, walking distance to restaurants, The Market, Jackson Square etc. The courtyard is nice, quiet and a nice place to hangout and relax.", "title": "UNBEATABLE ! A true TREASURE in the French Quarter", "helpfulness": 1, "user": "ascotusa", "date": "May 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159455511}], "location": {"country": "United States", "city": "New Orleans"}, "variance": {"poor": 3, "average": 8, "very good": 36, "terrible": 5, "excellent": 90}, "aka": "St. Philip French Quarter Apts. Hotel", "slim_ranking": 0.210526315789, "description": "Experience the true vitality of one of the most historic neighborhoods in the world by staying like a local at the St. Philip French Quarter Apartments. The St. Philip location couldn't be more perfect! Located in the heart of the French Quarter, we are nestled between Royal and Chartres Streets. Walking distance to all major French Quarter destinations and landmarks, such as the world famous Bourbon Street, Decatur Street, Mississippi River, French Market, Jackson Square, Cafe DuMonde, and St. Louis Cathedral. Bars, restaurants,shops, galleries and music clubs are all within feet of the front door.Large suites, one and two bedroom units are available. Units are much larger than an average hotel, and have a true residential feel. Perfect for extended stays, and those who want a truly unique experience. 4 floors total, all units are stair accessed (no elevator)."}