{"user_rating": 4.0, "review_count": 1781, "name": "St. James's Club", "reviews": [{"rating": 4.0, "title": "Well I liked it....", "text": "Having read some of the reviews shortly before departing on September 11, I was a bit worried, to say the least. So let me put my views out there on a few of the issues raised.", "helpfulness": 8, "user": "Alan6870", "date": "September 29, 2004", "id": 2607443}, {"rating": 3.0, "title": "Not bad....perhaps???", "text": "Location - On the south side of the island, about 35 minutes from St John's, but 5 minutes from English Harbour and Nelson's Dockyard. Taxis are expensive, so if you want to be mobile, you will definitely need to hire a car.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "September 16, 2004", "id": 2579776}, {"rating": 4.0, "title": "Very good hotel to get R&R or take the family", "text": "Beaches - pretty much as reported elsewhere, one beach on the Atlantic side, one on Mamora Bay, very calm. We spent our time on Mamora Bay and loved it. Plenty of shade under the coconut trees, no shortage of loungers, and the much maligned drinks cart was sufficiently frequent to keep our thirst at bay. Absolutely no hassle from the few locals selling their wares. Watersports were more than adequate, no problem with availability of equipment or tuition. I found Jody to be the most helpful of the watersports staff.", "helpfulness": 8, "user": "LongIslandGuy", "date": "September 12, 2004", "id": 2525673}, {"rating": 5.0, "title": "Been there twice", "text": "A note on scuba diving - we wanted to do the intro course and found that the dive centre on the complex was not keen and wanted us to take the full PADI course. So we found Aquanaut in English Harbour, paid much less and had a much better time. They have John's number from Aquanaut at Guest Services.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "September 11, 2004", "id": 2523817}, {"rating": 4.0, "title": "Good for 40 and 11 year olds alike", "text": "Food - No complaints. We were at the St James's Club on All Inclusive as opposed to the Beach Club and could eat at any of the restaurants (Piccolo Mondo at a $35 surcharge). We ate at all of them, a la carte on about 12 of the 14 nights. Piccolo Mondo is fine for a change, but we didn't feel it really merited the extra charge, when the Docksider was every bit as pleasant.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "September 10, 2004", "id": 2521966}, {"rating": 4.0, "title": "A Fine Hotel", "text": "This is a fine hotel with a wonderful understated elegance. Two great beaches, helpful staff and pleasant rooms. Several fabulous restaurants to choose from and a wonderful cocktail bar with adjoining casino. Great views from the pool deck and grounds.", "helpfulness": 5, "user": "marshall", "date": "November 25, 2004", "id": 2846549}, {"rating": 5.0, "stay_parameters": "Stayed October 2004", "text": "Anyone who writes a bad review about St. James's clearly has never stayed at the Grand Pineapple Hotel on the other side of the island! Go with the pace of life in Antigua and enjoy the casual and old fashioned atmosphere that is St James's.", "title": "Much enjoyed!", "helpfulness": 15, "user": "BahrainYiddo", "date": "November 16, 2004", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 2827248}, {"rating": 2.0, "title": "Save yourself some disappointment and book elsewhere", "text": "My family & I (2 adults a 2 yr & 4yr old) just returned from a 2 week stay at the St James Beach club with Virgin Holidays. We thoroughly enjoyed the whole experience and have to advise any family or couple on this location.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "November 10, 2004", "id": 2817541}, {"rating": 5.0, "title": "Excellent experience", "text": "We had the all inclusive deal staying in a superior room in papaya block. The accommodation was more than satisfactory with excellent AC, which is definitely needed. In general, with one or 2 exceptions, the staff were very friendly, accommodating and over all pleasant. They were particularly good with the kids. (Mr James, Carlene, Pearl & Troy, all from Cocos to name just a few)", "helpfulness": 4, "user": "simplebloke7", "date": "November 1, 2004", "id": 2799082}, {"rating": 3.0, "title": "enjoyed our stay", "text": "The kids club was good & had structured timed activities that meant you can schedule the little ones time away, and even on an evening, open until 2200 if you fancy one dinner alone as we did!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "October 27, 2004", "id": 2790657}, {"rating": 5.0, "stay_parameters": "Stayed October 2004", "text": "I have just returned from two weeks at the St. James Club, and I really enjoyed both the resort and my holiday. We chose to go European plan rather than all inclusive, as we prefer a variety of options as far as food is concerned. We did not find this much more expensive than the price quoted for all inclusive. The resort itself was very attractive with well kept grounds and and good facilities.", "title": "Well worth a visit", "helpfulness": 17, "user": "redalex261", "date": "October 19, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 2758050}, {"rating": 1.0, "stay_parameters": "Stayed December 2003", "text": "On arrival we were upgraded to a Bay View suite with a lovely view of Mamora Bay. This happened without any prompting from us, and we could not believe our luck. The suite was lovely with a separate seating area and bedroom - a few cracked tiles in the bathroom, but powerful hot shower, fridge, iron etc provided. Housekeeping called at wildly varying times for some reason, and although this didn't bother me I can understand that some people wouldn't be happy with this. The a/c was very effective and could maintain a steady 16 deg in the bedroom, although the living area tended to be a bit warmer.", "title": "Outrageously bad!", "helpfulness": 7, "user": "OxfordUKTraveller", "date": "October 18, 2004", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 2754792}, {"rating": 2.0, "title": "St. James Club a far cry from 4 stars", "text": "We found Mamora Bay too warm for sunbathing as it is so sheltered. Also the sand here was grainy and hard - it appeared to be a man-made beach, so we mostly sunned ourselves at the ocean side or at one of the pools. The ocean side was very nice with a cool breeze and softer sand. A drinks cart called round, and full bar was nearby. There was some seaweed, but not a big deal - landscape staff cleared it twice daily. I was shocked to see that some guests sailed off leaving drinks bottles, cups and rubbish lying about the sand - I personally feel that it is totally unacceptable to do this anywhere, but especially on a beach. Beach activities were good, and there did not appear to be a shortage of equipment for those wishing to use boats etc.", "helpfulness": 7, "user": "keg3035", "date": "October 14, 2004", "id": 2703791}, {"rating": 2.0, "title": "Overall disappointed", "text": "The breakfast and lunch buffets were good value, and provided a good selection of dishes, served in the attractive Rainbow Restaurant. The BBQ lunch at Mamora Bay was excellent value - the fish burger was delicious!! I do not know how often the menu was varied as we did not eat in the resort every day. We only ate dinner in the resort twice - once in Picolo Mondo and once in Docksider's. Food was reasonable but not great, especially at the prices charged.", "helpfulness": 10, "user": "pkminnj", "date": "October 10, 2004", "id": 2694796}, {"rating": 5.0, "title": "Fantastic Antigua", "text": "All the pools were well maintained and not too busy, the best being the tiered adults only pool next to the villas. Clean beach towels were available daily.", "helpfulness": 6, "user": "Graham S", "date": "October 5, 2004", "id": 2620180}, {"rating": 4.0, "title": "Excellent Trip!! Much better than expected.", "text": "My girlfriend and I stayed at the St. James Club Antigua fo seven days in August 2004. We went All-Inclusive. We can honestly say this was an all-around wonderful experience. Upon arriving at the hotel, we were greeted warmly and offered a rum punch to take the edge off the long flight. Check-in was simple and easy and the staff was courteous, kind and thoughtful. They booked out dinner at the Rainbow Garden upon arrival at the hotel.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "September 9, 2004", "id": 2520086}, {"rating": 4.0, "title": "better than expected having read reviews .....", "text": "HOTEL ROOM: We found the hotel room to be very nice, spacious and immaculately clean. Cleaning service was good and done once daily. The view from our private patio was incredible.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "September 7, 2004", "id": 2517266}, {"rating": 1.0, "title": "Faded Luxury", "text": "FOOD: The restaurants and service are definitely hit or miss. Docksiders was the best restaurant. The staff could not have been more accomodating. The service picture perfect. You never had to ask for your drinks to be refilled and the food was superb. We did elect to pay the $15.00 per person upcharge a couple of times in order to have the Surf-n-Turf, which was great. The view from the Docksider is spectacular. The only down side is the lack of a breeze. Rainbow Garden is also a wonderful restaurant. The service is very hit or miss. For dinner the service is wonderful. For breakfast and lunch, it was another story. Most, not all, of the staff appears less than happy during the lunch and breakfast times. The advantage of Rainbow Garden is the nice breeze you get. Also, they had entertainment on Saturday night which was great. Coco's is horrible and I do not recommend wasting your time eating there. The staff is rude, curt and completely awful. We went there once for lunch and would discourage anybody from going there. We found it to be an aggravating experience. Not exactly what we needed to deal with on vacation. We didn't dine at Piccolo Mondo.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "September 3, 2004", "id": 2511624}, {"rating": 4.0, "title": "Good", "text": "DRESS CODE: A lot of people complained about the dress code in their reviews, but we found it to be a nice touch. Men's dress code is strictly enforced and I had no problem wearing long pants and a polo shirt during dinner. For one thing, the bugs will bite your legs quite a bit if you wear shorts. (Note: You can wear shorts on Thursday and Sunday). The dress code kept the aura more elegant as well.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "August 20, 2004", "id": 2478453}, {"rating": 1.0, "title": "Butlins in the Caribbean", "text": "CHILDREN AND OTHER GUESTS: No complaints here. I have to say that the British know how to raise their children extremely well. No screaming kids or kids running around like you deal with constantly in the United States. Frankly, we in the states, could learn some lessons from our friends in the United Kingdom. Most of the guests were of English descent, which was fine with us. I played sand volleyball with them and had a great time. After seeing how nice people from the U.K. are, we have decided to visit England within the next two years.", "helpfulness": 5, "user": "Cheshire81", "date": "August 16, 2004", "id": 2453543}], "location": {"country": "Caribbean"}, "stars": 4, "variance": {"poor": 104, "average": 175, "very good": 541, "terrible": 49, "excellent": 912}, "aka": "St. James`s Club Hotel", "slim_ranking": 1.0, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}}