{"user_rating": 4.0, "review_count": 240, "name": "St. Michaels Harbour Inn Marina & Spa", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "After a three day conference in Arlington, VA my husband and I stopped over in St. Michaels for some quality time. A friend of mine kept telling me about St. Michaels and I am glad we went...charming place.", "title": "I am glad I stayed here", "helpfulness": 1, "user": "MsLibrarian", "date": "April 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 61784553}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "Let me say this, the Harbour Inn was not my first choice. I was very skeptical of the hotel because it has like 11 terrible reviews, so usually that's a red flag. However, there is not a lot of hotels/inns in downtown St. Michaels so you don't have that much to choose from. There are plenty of Bed and Breakfasts but I wasn't really in the mood for a BnB.", "title": "\"Lower your expections is no more - Robert Pascal and staff care\"", "user": "Sunshine55va", "date": "April 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 61145817}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "So what we did once we got to St. Michaels is drive around to all the hotels and see what deals they had available. So we didn't make any reservations ahead of time; this was truly a spur of the moment thing.", "title": "So good we stayed an extra night!!", "user": "Fun4Tchr", "date": "April 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60480485}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "What we did find out is that the \"Inn at Perry Cabin\" is the best hotel is St. Michaels, however it very expensive (too expensive for the area) and we were only staying for one night and I didn't want pay $295 a night.", "title": "Relaxing weekend", "helpfulness": 1, "user": "KrisCox", "date": "April 5, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 60416177}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "I didn't like the way Harbourtowne Golf Resort looked from the outside and the Best Western is not in the main town of St Michael's.", "title": "Ringing in the New Year with family and friends.", "user": "daisy2u", "date": "March 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59787568}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We went to St. Michael's for a weekend getaway and stayed at the Harbor Inn. We were in room 208 (a waterfront jacuzzi suite) with a lovely view of the docks and historic district Since it was before high season, there were only a few boats slowly coming and going and, most of the time, there were more mallard ducks swimming by than we saw boats.", "title": "Quaint harbor view - relax", "user": "No_Camping", "date": "March 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59228158}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The suite was very large, clean and comfortable. Two doors (one from the bedroom, one from the living room) led to a balcony that comfortably sat two people with a drink table between us. The bathroom had a jacuzzi tub, a walk-in shower, his/her sinks and was bigger than some master bathrooms for houses. The jacuzzi tub worked like a charm, the water was hot and the jets were powerful. We had a king-size bed with plenty of room surrounding the bed -- it is not a cramped bedroom. Sofa, desk, bar sink and refrigerator were also in the main area of the suite.", "title": "Comfortable room, friendly personnel, reasonable rate.", "user": "Southeastgirl14", "date": "November 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48997394}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We had breakfast through room service (try the french toast). Within 20-25 minutes it arrived hot and displayed very nicely. Complimentary coffee and tea could be found in the hotel lobby if we wanted a little something to wake us up before ordering breakfast.", "title": "Total Relaxation", "user": "bertpennsylvania", "date": "November 10, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 48874798}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We walked to town in about eight minutes. There are complimentary bikes available through the front desk. Improvements? Only one and it isn't a deal breaker. A coffee maker in the room would be really nice. Otherwise, I would certainly stay at this hotel again without any qualms whatsoever. Keep up the good job!", "title": "The Harbour Inn at St.Michaels is star quality.", "user": "sunfish687", "date": "October 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46972276}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "My husband and I live in Washington, DC and we wanted to get away for the weekend without spending hours on the road. We were somewhat familiar with the hotel as we had previously stayed there (3) years ago. Our room was most comfortable and clean. We enjoyed shopping and strolling through the downtown streets. A helpful receptionist encouraged us to try the restaurant there as the menu had recently been revised due to a new chef. I am glad she suggested it as the dinner was exceptionally good. The crab cakes are unbeatable!", "title": "Not worth the $$", "helpfulness": 1, "user": "mh6776", "date": "July 26, 2009", "detail_rating": {"cleanliness": 1.0, "location": 2.0, "value": 1.0, "rooms": 1.0}, "id": 35864709}, {"rating": 1.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "I booked a Pajama Party Package for four guests staying one night at the Harbour Inn. At the time I booked the package, I mentioned to the reservationist about a Spafinder discount I had found online (20% off or more for dates before April 30, 2009). He acknowledged the discount was valid and I met all the discount criteria. The next day when I received the email confirmation for our stay, the rate did not reflect the agreed-upon discount. When I spoke to the front desk manager, I was told that the reservationist \"doesn't know what he's talking about\" and that the discount is included in the standard package rate. After some discussion, the front desk manager got very defensive, telling me that she will not honor the rate I was quoted at the time of reservation and then told me I would have to pay a $25 cancellation fee if we chose not to come. Nowhere on the Spafinder site or the Harbour Inn site does it state that the discount is already included, and the math just simply doesn't add up. In fact, on Spafinder, the discount is advertised as a savings. In general, when a company advertises a savings, that would be discounted from the standard rate, not part of the standard rate. Finally, after being informed of the filing of a consumer action complaint was I allowed to cancel without a fee. This front desk manager knows nothing about customer service.", "title": "Beware - Bait & Switch", "user": "TravelMom_Bowie", "date": "March 11, 2009", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 26008131}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "We got a giftcard to stay at this hotel, I didnt have that high of expectations because of the reviews I had read, Luckily we had a very nice experience. I agree with other reviewers that this hotel is def. not worth the price, if it werent for a giftcard we would have never stayed here, but the SPA was awesome, it didnt even look like it was part of the hotel, it was so clean and new and the people were so delightful.", "title": "The spa was wonderful!", "user": "ladylump", "date": "November 14, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 21844037, "likes": {"liked": "— SPA"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We stayed in a King Jacuzzi room, the view was absolutly beautiful, the little light house was right across from our room.", "title": "Great Views - and that's about it.....", "user": "Griller333", "date": "October 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 1.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 21407206, "likes": {"liked": "— The view", "disliked": "— Not as clean as one might hope"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The room was clean and the bed comfy, the decor was super outdated and the paint/dry wall work was very... sloppy. My husband notices things like this, not me.", "title": "Great location", "user": "lablover2", "date": "October 27, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 21298377, "likes": {"liked": "— the location and view"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "I think with a face-lift this hotel could be top notch.", "title": "Below average hotel", "user": "kathyoPennsylvania", "date": "October 14, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 20878658, "likes": {"liked": "— Nothing", "disliked": "— Very over-priced"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Despite hearing some negative recommendations about this property, I was willing to give the Harbour Inn the benefit of the doubt. Big mistake. My husband and I were in town for a wedding, and nearly all of the other properties had a 2-night minimum. On the phone the Harbour Inn told me it did not have such a policy, so we ignored the warnings and took the plunge. The $250 room rate (with no water view) was still less than the cost of staying at the other properties for 2 nights. Besides, how bad could it be?", "title": "Overcharged, bloody pillow, nasty staff and unwanted wake-up call", "helpfulness": 3, "user": "RoseTea", "date": "July 23, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 35596350}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "The hotel's website was down so rather than book online, I had to book over the phone. The day before our arrival, I printed out our email confirmation and noticed that there were 2 errors in the booking. It listed our stay for two nights instead of one, and my husband's name was misspelled. I immediately called the hotel and notified them. The representative who answered the phone told me she would update our reservation for arrival the following day. No problem.", "title": "Excellent Location, Service, Views but Pricey", "user": "alabaaster", "date": "July 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 35028610}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "Upon our arrival, we headed to our room. It was totally outdated, but we were prepared for this--no big deal. What we were not prepared for was when my husband and I immediately laid our heads down for a short nap, to our great horror and repulsion, his pillow was BLOODY! And yes, he noticed this after he plopped down his head, so this unsanitary dried blood actually touched his face. We called for a new pillow and one was brought to us relatively quickly, but with a half-hearted apology only after my husband expressed his disgust.", "title": "It was a great experience", "user": "Asi_Wannabe", "date": "May 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 29601260}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The following morning, we were rudely awoken at 6:30 AM by a wake-up call neither of us had requested! Evidently, I am not the first guest of the hotel who has experienced this unacceptable sleep disruption. No apology. But wait. We then noticed our bill had been slipped under our door. It indicated that our credit card was charged for TWO NIGHTS! This was a completely unauthorized charge. When we checked in and put down the credit card, we confirmed with the front desk representative that we would be staying for ONE NIGHT. To charge our card, in an unauthorized fashion, is unacceptable and frankly illegal. And furthermore, in any reputable hotel, blood on the pillow and an unwanted early wake-up call would likely warrant a comped night, or at least an APOLOGY.", "title": "Little improvements would help with reviews", "user": "Snooky44", "date": "April 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 28983624}, {"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "I will spare you all most of the details of our conversation with Frances, the manager on duty, but suffice it to say, she was not only unapologetic, but rude and nasty, complaining that she was too busy to speak with us. She claimed the blood on the pillow was not blood but some other type of red stain (!!!) and encouraged us to contact our credit card company to remove the charge since she wasn't going to do so. My husband and I travel extensively for work and pleasure. Never have we been verbally abused or had any confrontation with a member of a hotel's staff, and we've never felt a need to write a negative review of any property ever.", "title": "Not much bang for the buck", "user": "holidaystuff", "date": "April 11, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 27797470}], "location": {"country": "United States", "city": "St. Michaels"}, "variance": {"poor": 13, "average": 32, "very good": 75, "terrible": 17, "excellent": 103}, "aka": "St. Michaels Harbour Inn Marina Hotel", "slim_ranking": 0.5, "description": "Contemporary hotel located on the waterfront with views of Chesapeake Bay."}