{"user_rating": 4.0, "review_count": 1248, "name": "St. Pancras Renaissance London Hotel", "reviews": [{"rating": 3.0, "title": "Disappointing", "text": "The Hotel building and the restoration are absolutely breathtaking but sadly that is where the experience ends.We stayed one night on the 6th floor.The rooms on this side of the hotel are bland although a reasonable size.There was no bath and apparently I should have known that I had to ask for that when I booked .If you book online as we did there is no option and it does say that the room has a shower/tub so be warned if a bath is important to you.The bed was extremely comfortable but the air condition is a nightmare to use ans the temp it displays is not what you dial in.We ate in the Gilbert Scott restaurant for which we paid a £4 cover charge each plus a 12.5%gratuity which we refused as the service was slow and unfriendly.You also have to pay extra for any veg or salad you want with your main meal.The food was good but not outstanding.The booking office bar also charges you £2.50 service charge for the privilege of having them pour you a drink.Breakfast is appalling don't bother eat in the concourse at one of the many excellent eateries .We asked for fresh milk to be bought to the room and English breakfast tea and a newspaper.Once again as I hadn't ordered the paper I was made to feel I was being a nuisance and no fresh milk ever did arrive.The whole cost of one nights stay was close to £500 and while the building downstairs is stunning the rest of the hotel does not feel five star more like one big rip off.I tried to voice my feelings when we checked as the bill was also wrong but I was cut short and it was made clear the staff couldn't have cared less.If you love architecture go have afternoon tea and look round,don't bother staying.", "helpfulness": 1, "user": "gdean1610", "date": "July 1, 2012", "id": 133182777}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "the St. Pancras Renaissance is new to the scene, and I am a fan. I only stayed here one night, but I wish I had a few more nights to enjoy the location. The staff was great, the room was comfortable, and the building and bar are beautiful.", "title": "New and nice", "helpfulness": 2, "user": "mtwojo", "date": "July 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 133174385}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Having said that, some tourists may find the location a little less than ideal. It is great if you are taking the Eurostar or trains to North and East of England/Scotland, but it is a little out of the way to the central tourist spots in London. Tourists will find themselves in cabs and on the tube a lot. That wouldn't be a deal breaker for me, but I might look for a hotel deeper in the West End first.", "title": "Excellent place to stay for a Eurostar Connection", "helpfulness": 4, "user": "agluyas1977", "date": "June 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132938612}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "This is a beautiful hotel, although very pricey. The big bonus for us was that the Eurostar leaves from downstairs, making it very easy to catch an early train with luggage. I was a little flabbergasted at the price for the internet - especially when the Irish Pub across the road had free wi-fi (and great beer).", "title": "Another visit", "helpfulness": 4, "user": "Hampshire-resident", "date": "June 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 132909632}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "I first stayed in 2011 just as the hotel reopened and tried it again this year. An excellent offer was avaialble on the website meaning that this time I took a one bedroom suite rather than a \"standard\" chambers room. The room, on the second floor, overlooking the front of the hotel was superb with a large sitting room, a bedroom and a well-equipped bedroom. The receptionist showed me to the room after check-in, which was infinitely better than last year's drawn out experience. There was no evidence of the promised butler, but didn't miss this as we had no need of the service. There was some noise from the road, but no vibrations from underground trains and the noise didn't disturb my sleep.", "title": "Nice Hotel", "helpfulness": 3, "user": "JarenH", "date": "June 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 132883147}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Stayed in a Chambers room in the refurbished \"Midland Grand\" part of the St Pancras Renaissance for 4 nights in April during the hotel's soft opening. The room was stunning, 20-25 ft ceilings, floor to ceiling arched windows, lots of light, wonderful bedding. These rooms were not originally en-suite when built in 1873, so they basically created a \"room within a room\" for the bathroom - but it worked well and the shower was wonderful. I would agree that some of the staff seemed rather new to the service industry (servers in the lounge, security detail), but the front desk staff and the head Chambers lounge staff were delightful. In addition to our room, the public spaces in the old part of the hotel were breathtaking - lobby, Booking Office, grand staircase, hallways, views into the lobby/rail station, Ladies Smoking Room and side room (these last two are private function rooms) were clearly renovated to their former glory with meticulous care. I did feel a little out of place in jeans in such a grand place - thank goodness it was just soft opening. Kings Cross location not withstanding, I envision this hotel becoming THE place to stay in London and host once-in-a-lifetime, memorable events. The hotel is not too long of a walk from Regents park or Camden area, and you can always pop next door to the British Library if you want to view the original Magna Carta [one of 4 or 6, IIRC] or Canterbury Tails. One thing to note: the pool is more like a big spa - beautiful but small. I hope to return soon!", "title": "Grand historic hotel with modern refit", "user": "bluering", "date": "April 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 103108912}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "This is a stunning building and the refurbishment does the place proud. Unfortunately the service does not. There is considerable work to do by the management on bringing this up to the standard that is reasonable to expect of a premier establishment.", "title": "Could do better", "helpfulness": 2, "user": "DavidVachell", "date": "April 5, 2011", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 102970220}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "Some of the problems relate to some staff's poor command of English and others relate to simple lack of process discipline. Room service that takes twice as long as promised and exec lounge staff that do not know whether food can be obtained in the lounge.", "title": "Amazing building, great intentions, improvable service", "helpfulness": 1, "user": "tommy2rows", "date": "April 4, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102778989}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "If they get this sorted out then this promises to be a truly great place to stay but at the moment they are at risk of being very adversely compared to the excellent competition.", "title": "Hotel refurbished to modern standards - Excellent Service", "user": "yhi904", "date": "April 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 102686909}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "I would recommend it but with some qualification.", "title": "Fantastic hotel - a few minor teething problems, but it hasn't 'officially' opened yet...", "user": "Teemo70", "date": "April 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102640508}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Review St Pancras Hotel now Renaissance", "title": "St Pancras Renaissance Hotel Thank goodness for John Betjeman", "helpfulness": 1, "user": "Regmaiche", "date": "May 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 109806262}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Thank goodness for John Betjeman other wise politicians would have demolished", "title": "Possibly the finest building in London - still a little work to do as a hotel", "user": "Want_the_facts", "date": "May 25, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 1.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 109790858}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "for hypermarket", "title": "Awesome restoration, fabulous building but hotel staff need polishing up", "user": "Karen7", "date": "May 24, 2011", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 109680146}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The building and staircases are magnificent sadly my Nikon did not take", "title": "GORGEOUS building, operation still warming up, but wow overall", "user": "Snappers_Inc", "date": "May 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 109620082}, {"rating": 1.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "very good photos.So recommend look at web site. Better still stay a night", "title": "You can do much much better with your money", "helpfulness": 9, "user": "Fernetbrancaevermore", "date": "May 24, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 109579421}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We stayed here for two night over the weekend.", "title": "location, location, service", "user": "RallyMonkey", "date": "July 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 134465593}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The hotel is obviously idea if you are taking Eurostar, but it also very well placed on several tube lines allowing most of London to be reached directly by tube.", "title": "Great Hotel in London!", "user": "MerryBanker", "date": "July 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134456136}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "The hotel also features and excellent bar and lounge combination, with good food. The staff are efficient and attentive.", "title": "Marriott Rewards Members - careful!", "helpfulness": 1, "user": "alan s", "date": "July 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 134311752}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The room are easily reached, and well furnished. There is plenty of storage space but they are not large. The beds are comfortable. The room lacks any character, we has a view of the roof of the main station terminal.", "title": "Great stay", "user": "Cathy S", "date": "July 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 134210841}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "The main drawback is the small bathroom. One small sink and a deep but short bath. No separate shower.", "title": "Stunning hotel...maybe not for business", "helpfulness": 1, "user": "jsmitherscsi", "date": "July 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 134103235}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "This hotel itself is amazing, the architecture and renovation has more than done justice to the once dilapidated building and it's original features. The hotel is located right next door to Kings Cross stations (main line and tube) so easy access to just about anywhere you need to be.", "title": "Awesome Hotel let down by very poor administration", "user": "Fialko", "date": "July 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 134078542}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The room was extremely comfortable and had just about every facility you would need during your stay though on floor 7 our view was non existent at all - literally looked on to the arched roof of the railway station next door so nothing but slates. Mini bar, in room service, wifi etc were available but extremely expensive though this is to be expected given the hotel's rating.", "title": "WOW! What a hotel", "user": "BurleighBT", "date": "July 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134059815}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We we booked in as part of a theatre break weekend booked through Virgin Experiences and although i am loathed to say it the Marriott chain did everything they could to ruin the experience from the offset, which is where the negative part of my review regarding the administration come in.", "title": "Great experience", "user": "CWGators22", "date": "July 10, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 134008110}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "We had paid for 5 star luxury theatre break but were initially limited to three Marriott Hotels in London, which was not an issue other than none of them would allow me to book a room! The first time i tried i was told i'd left it took late so the next time i tried i was told i was too early (3 months). Despite explaining i neede to book a room to be able to book show tickets they refused to budge and tickets to the show i wanted to see were selling out. Caught in a vicious circle i had to go back to the third party company who administer Virgin Experiences and explain the situation. They did sort the issue for me and i was allowed to book in advance to the St Pancras and booked show tickets.", "title": "Stunning Victorian hotel in London's Camden district", "user": "scshannon", "date": "July 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 133993312}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "However, 2 nights before i was due to go (have paid and for and booked rail travel and additional show) i called the St Pancras to confirm my reservation - LUCKILY, as they told me categorically i was not booked into the hotel. I was passed to central administration in case the wrong hotel had been booked and again i was told i wasn't booked in. This was Thursday night at around 8 pm so there was no one i could speak to. I spent 2 hours stressing, trawling old e-mails, calling the hotel again and arguing with my partner before giving up and waiting until the next day.", "title": "Unreal! Exceeds expectations...", "helpfulness": 1, "user": "Ari129", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 133859639}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Stayed here for a 3 nights! I normally stay at Marriot hotels if I can since I am a gold member and normally get some extra perks! This hotel was great! there are a couple of details that need to improve since the hotel just opened but it can only get better. I stayed in the new part of the hotel and the room was clean and neat, not amazing, but exactly what you expect from a large hotel chain, you know you cant go wrong normally. The windows dont open because it is law in London, not because they had a choice. When I arrived I was very well greeted, they only had 1 room of the 2 we had reserved, but we were offered a shower and access to the spa if we wanted to relax before the room was ready. the chambers club, which was the concierge level for Gold members was great! right next to the Booking office which is the bar, restaurant they have in the lobby. great atmosphere and the food was awesome!!", "title": "Great Hotel!! Will only improve!", "helpfulness": 2, "user": "panajoe81", "date": "May 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110547038}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "overall great location, you have st pancras station right next to you so you have access to everywhere in London, we went to Wembley stadium direct from our hotel! you cant beat that!!", "title": "Extraordinary building and staff", "user": "KathSnide", "date": "May 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 110427031}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "highly recommended! look for the promotions on the website, I stayed 3 night and paid for 2 since I was using my Amex card!", "title": "Bland and expensive", "helpfulness": 11, "user": "JJRodger", "date": "May 27, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 110069195}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "I stayed at the hotel for one night for a friend's wedding in London. I arrived tired, missing my family and too early for check in. The staff, especially Manisha, were incredible accomodating and made me feel right at home. Just waiting in the lobby for a room was a treat. The architecture, design and floral arrangementswere truly spectacular. In fact, it may be one of the most extraordinary buildings I have ever visited. As the hotel was new, they were still working out some kinks like a power outage in the pool and card keys that needed to be re-coded. That said, staff was great about acknowldedging the problems and trying to accomodate guests. The only real problem with the hotel from my experience was that I didn't want to leave the hotel to sightsee :)", "title": "A Special Treat In A Special Place", "user": "nottsnet", "date": "May 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 110041413}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Let me be plain at the outset. This hotel is situated in a beautiful and apparently very well-restored building. It is extremely convenient for Eurostar or Kings Cross. The standard of the room was very high. However, my room (the least expensive, but hardly cheap at £390 inc VAT per night, room only) was dull and characterless and could have been a room in any premium chain hotel, the public spaces are extraordinarily noisy and dinful and the service is superficial and impersonal. This was not the special treat that the price and building promised.", "title": "An expensive treat, a fun experience.", "user": "Witshub", "date": "May 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 109835417}, {"rating": 3.0, "stay_parameters": "Stayed May 2011", "text": "In criticising upper upscale hotels one always risks sounding like a spoiled Prince Charles figure moaning about the straightness of toothpaste squeezed by a valet onto the brush.", "title": "Extraordinary building, fine restoration, let down by poor service", "helpfulness": 4, "user": "JamesAnderson11", "date": "May 22, 2011", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 5.0}, "id": 109298678}, {"rating": 4.0, "stay_parameters": "Stayed May 2011", "text": "However, paying for an upper upscale necessarily puts the details into focus. There are certain basic things which a hotel like this has to get right which this one doesn't yet deliver and needs to fix before its reputation becomes established.", "title": "Great 5* hotel let down noise by noise and not best value for the price", "helpfulness": 1, "user": "GShore1", "date": "May 12, 2011", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 108001662}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "First the good stuff. The building and restoration are spectacular and our guest room 184 in the old Chambers wing did not disappoint. High ceilings, lots of beautiful decorative touches, a cleverly executed bathroom with lots of goodies, decent entertainment system, comfortable bed. Nice use of good contemporary furniture whilst preserving the Victorian theme.", "title": "Am-az-ing", "helpfulness": 3, "user": "sophieljmorris", "date": "May 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 107546199}, {"rating": 5.0, "stay_parameters": "Stayed April 2011", "text": "The bad stuff:", "title": "Birtday presant ;D", "user": "JellieBean2", "date": "May 7, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 107268556}, {"rating": 5.0, "title": "Great hotel!! You must stay here !!", "text": "1. Lousy service in the bar. Staff had a poor command of English and brought my wife's drink ten minutes after mine. The bar snacks did not appear until the drinks had been paid for and we were ready to go to dinner. We were not charged for them but it would have been nice to have them.", "helpfulness": 4, "user": "FortLaudtraveler", "date": "May 4, 2011", "id": 106907219}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "When I told my London taxi driver of 17 years where I was going he said, \"I have never been here. There has been a veil over the front of this building for over 4 years.\" To his surprise a hotel, rather a enormously large building was there and had been open for business for a little over 1 month.", "title": "A review from your extended stay business traveler (on vacation for once)", "helpfulness": 4, "user": "Chase71", "date": "April 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 105549996}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "What a surprise when the taxi drops us in front of this late 1800s building that was once part of a central train station. And that's just the beginning. Once you enter this hotel and you see its sprawling red brick walls that encompass an impeccable lobby entrance one has to wonder whats next. Well there's more. Walk further inward past the lobby and you enter another section of this \"station\" that is now a stylish dining, meeting, drinking spot. You'll be greeted by virtually every hotel staff member as you peruse this traditional but modernly appointed hotel. To one side are windows revealing a very large open space and a door. Exit through the door and you unexpectedly step right into London's international rail terminal. Yes this hotel is adjoining to one of the largest London train stations for both local \"Tube\" and international travel, along with with shops, coffee bars, restaurants, and others.", "title": "Beautiful", "helpfulness": 2, "user": "jessicaaa14", "date": "April 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104861125}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Back to the hotel. Rooms are very modern, clean, well appointed. Excellent!", "title": "Fantastic Hotel - Impeccable service!", "helpfulness": 2, "user": "CheshireJuney", "date": "April 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104772424}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Staff: Absolutely top notch. Service is impeccable at this hotel.", "title": "Beautiful but noisy", "helpfulness": 4, "user": "worldtrav147", "date": "April 20, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 4.0, "location": 3.0}, "id": 104739919}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "For Marriott Platinum members: Complimentary very high speed wireless service throughout the hotel. (I made crystal clear Skype calls back home on my Android phone from the lobby). An executive lounge with a complimentary hosted outstanding breakfast.", "title": "Beautiful Hotel but Chaotic Organisation", "helpfulness": 4, "user": "JaneSoames", "date": "April 19, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 104628486}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "As a Marriott die hard fan I have been waiting with baited breath for this hotel to open for years. I am delighted to say that my wait was well worth it. I have stayed in Marriott / Renaissance hotels all over the world and I can honestly say that this one sits well and truly at the top of the pile.", "title": "Put this hotel on your bucket list", "helpfulness": 3, "user": "Reaper1", "date": "April 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104599830}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled solo", "text": "It is hard to know where to start in reviewing this hotel. Your experience actually starts before you even set foot inside it with the breathtakingly imposing exterior (in my opinion one of the most fabulous buildings in London) towering over you as you approach. The interior continues in the same vein with original features and detailing meeting perfectly with modern design.", "title": "Stunning Hotel with great Service!", "helpfulness": 3, "user": "1957_Travel", "date": "April 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 104536875}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "The reception lobby is spacious light and airy and certainly has the wow factor as you enter. The 'Booking Office' (the old booking hall for St Pancras station) has been superbly converted into the main bar and restaurant area and it is a fantastic place to hang out and soak up the atmosphere. The food is also very good and you 'must' try the ice cream sundae - divine! For those of you who are Marriott members or lucky enough to have access to the Executive Lounge, the 'Club' as it is called is outstanding in every respect from the general ambience to the waitress service and complimentary drinks, they even have jars of 'old school' sweets which kept the children busy.", "title": "They have to give more for these prices", "helpfulness": 5, "user": "lalalee", "date": "April 12, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 103818345}, {"rating": 4.0, "stay_parameters": "Stayed April 2011", "text": "We had two adjoining rooms (a King and a Twin Double) as we were travelling with our two little ones (5 and 4) and we were delighted with them. With the hotel having only just opened (and not even having it's official opening yet!) everything was shiny and new. As in every other part of the hotel the fixtures and fittings were top notch and continued the theme of elegance, travel and relaxation evident everywhere in the hotel. The bathrooms were fully equipped with REN products (which my wife appeared to be delighted about?!), which leads me on to the Spa. I have run out of superlatives already so all I will say about the Spa is - go and visit it. The pool area in particular is stunning.", "title": "New", "helpfulness": 2, "user": "Davidfab", "date": "April 8, 2011", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 1.0, "rooms": 5.0}, "id": 103238674}, {"rating": 5.0, "stay_parameters": "Stayed April 2011", "text": "Despite of all the grandeur and sumptuousness of the hotel it is not actually this that made it 5* for me - it was the staff. Every single staff member that I met greeted us with smiles and could honestly not have been more friendly and helpful. They ALL seem so proud of their hotel (and rightly so) and are keen to tell you all about the buildings history. Tours run four times a day for those who want a comprehensive overview. The staff also made a big deal of the kids which was great.", "title": "Fantastic refurbishment, small improvements can be made", "user": "Hotelaholic63", "date": "April 7, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103191458}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "If you don't know the history of the building start here http://www.urban75.org/london/st_pancras1.html and then take a random trip through the search engines to see how close we came to losing an iconic piece of Gothic architecture. This was a long awaited trip for us after being long time admirers of the external appearance and enjoying a behind the scenes tour (including sneaking off to see some of the rooms that were not on the tour) a few years ago. Full credit to Manhattan Loft / Marriott for their roles in bringing the building to life again.", "title": "A trip we waited a long time for and were not disappointed", "helpfulness": 5, "user": "Andy99", "date": "May 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 106542927}, {"rating": 4.0, "stay_parameters": "Stayed May 2011", "text": "For our two day stay the hotel was in the late stages of a soft opening and the visit pretty much timed to perfection. The first surprise was to be told to leave our car directly outside the hotel for no charge. Gabor (a very friendly and efficient member of staff) greeted us, assured me the car could stay outside for the duration of the stay and swiftly arranged for our luggage was taken up to the room. I doubt free parking will be available once the hotel is fully open; nevertheless, this was a very nice start to our weekend. Check in was efficient and within five minutes we were in our room in the Barlow wing, which was a reasonable size for central London. This new build part of the hotel was clean, tastefully decorated, had all the expected amenities for both business or a pleasure stay and our room on the fifth floor appeared to be well soundproofed. Be prepared for a view of the tiles on St Pancras station roof though.", "title": "Good but surprised at superlatives used in other reviews.", "helpfulness": 3, "user": "Ashpartout", "date": "May 1, 2011", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 106403465}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "Stayed here with a friend, using husband's Marriott points, for a night. We had a fantastic time. The hotel has been beautifully restored to its former glory. The staff also deserve a mention, especially the chambers club staff who had the right mix of service and humour! The chambers club and the pool area were definitely the highlights. Brilliant complimentary drinks and food, in particular the delicious breakfast. The pool is lovely and we enjoyed a restorative sauna and steam room session also on the Sunday morning. Definitely recommend and will be returning!!", "title": "Great hotel and staff!", "helpfulness": 1, "user": "SLEWIS1970", "date": "July 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 133607981}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "As you come out of St Pancras there is a lift to take you direct to the hotel, it has a wow factor. Lovely reception and welcoming, very well organised. The Gilbert Scott restaurant was lovely you expected a train to come through any minute! It was one of the best meals. The waitress also reserved a table for us in the pub lounge , and that had the original bells on the ceiling. The breakfast was served and you could over look Eurostar, there was a good range of food.", "title": "Fantastic restoration an very romantic!", "helpfulness": 1, "user": "Dibbla51", "date": "July 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 133571647}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "This hotel and the station have been faithfully restored with a lush modern twist, and if you don't stay here, then put it on your Top 10 Things to Visit in London list.", "title": "Breathtaking Restoration", "helpfulness": 4, "user": "JaneYost", "date": "July 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 133513025}, {"rating": 3.0, "title": "My Fifth Visit, Slipping a Tad?", "text": "If we thought we were impressed with the stunning Kings Cross station restoration, we were completely floored by St. Pancras ... both the station and the hotel ... discovered none-too-soon during our last 3 days in London. As circumstance had it, we had to find alternative accommodation for our last night, and it was a hands-down decision.", "helpfulness": 4, "user": "crkport", "date": "July 4, 2012", "id": 133453649}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Originally built in the 1870's, both hotel and station fell into disuse and/or government use in 1935, then the beautiful old hotel was condemned as a fire hazard in the '80's, and had not been used since then. Huge efforts to save it from demolition paid off, and the St. Pancras Renaissance Hotel was restored and finally re-opened in 2011. Except for some necessary yet sympathetic modern touches, the majority of the hotel was quite faithfully restored to it's original condition.", "title": "WOW", "helpfulness": 4, "user": "Andy C", "date": "July 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133331636}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "This hotel is in the breathtaking neo-gothic station and the fit has really made the most of the impressive building. the reception is well done - but restaurant is really badly thought out.", "title": "Not a great start but huge potential", "user": "voicetv1234", "date": "March 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 102005100}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Chairs impossibly low, half height tables which are too long and sofas which you cant sit on comfortably. I was looking for standard restaurant style seating but found a kind of bizarre knee height huge lounge. Food good, staff friendly and once the teething troubles are over.......", "title": "A Fantastic Hotel with Great Service", "user": "ForgeDynamic", "date": "March 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101626215}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "I stayed here with my partner last night and had a fantastic time. We enjoyed cocktails at the bar before having a lovely dinner. Service was excellent - attentive yet not overbearing or intrusive. Any issues we had were quickly sorted - not that we had any major problems. I would happily recomend this hotel and will be staying again.", "title": "An amazing anniversary in a fantastic london landmark that has waited too long to be re-awakened", "helpfulness": 1, "user": "ssamstevens", "date": "March 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 101569512}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "Room - amazing, unbelievably high ceilings, and windows, good city-scape view over kings cross, huge bouncy but firm bed, great bathroom- the corridors in the old hotel are amazing and stretch for what seems like miles, with ornate old glass over the doors.", "title": "the most amazing building in the world", "helpfulness": 1, "user": "steamovershap", "date": "March 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 101296799}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "It felt like being at the start of something special, attentive and eager staff, everything looked well presented and polished, like the revival of a former top hotel that will really give established landmarks a run for their money. The chamber rooms come with fantastic extras in the form of complimentary sweets, cakes, breakfast, all lovingly laid out", "title": "Will be tremendous", "helpfulness": 1, "user": "ChrisRu", "date": "March 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 101174591}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 5, "variance": {"poor": 60, "average": 158, "very good": 384, "terrible": 30, "excellent": 616}, "aka": "St. Pancras Renaissance London Hotel England", "slim_ranking": 0.185873605948, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}