{"user_rating": 4.5, "review_count": 60, "name": "St. Martin's Bed and Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "Fodors and Frommers do not rate this B&B and I would not have found it without the help of a friend in a chat room. What a delight! Location could not be beat - 2 minutes to the town, if that - but far enough away so there's no town noise (perfectly quiet, in fact). Mary is the best. Warm, friendly, accommodating. Terrific breakfasts cooked to order - and when we had to meet a 7 a.m. bus and missed the hot breakfast she provided more than enough cold food to keep us sated. It's homey and charming, with a wonderful view of the river. Tubbs, the dog, is the absolutely highlight, but the hot water bottle at night was such a treat! Mary was helpful with directions and suggestions, and even though we arrived before our room was ready she said we could come right in. Mary has neither a website nor email access (so you have to call Ireland to make reservations), and she only takes Euros, not credit cards, but never fear, it was top notch, while maintaining the charm you're looking for in an Irish locale. My 22 year old niece can be hard to please and she said it was the most comfortable bed she'd ever been in. This visit is one of the few times I've wanted to send a proprietor a thank you letter. Overall, one of the nicest places I've ever stayed.", "title": "Hot Water Bottles, Great Location & a Delightful Corgi!", "helpfulness": 23, "user": "PaulaRuth", "date": "November 15, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4113100}, {"rating": 4.0, "title": "Incredibly Charming", "text": "It took us forever to find the phone number for this place, but it was worth the search. I'll make it easy for you: 353-91-568-286 This B&B is so cute -- the best parts are the dining area (overlooking a gorgeous backyard, a river, and a great view of the town), the location (a pedestrian bridge 10 steps away leads you over to the heart of Galway instantly -- perfect!) and the service (Mary was very friendly and breakfast was great). The rooms were a little strange -- ours had 3 beds packed in and way too many kleenex boxes and cleansing wipe dispensers (I think all together, more than ten!) But, the decor was pretty (very flowery) and the bed was really comfy. The room wasn't completely spotless -- it was definitely like staying at your quirky aunt's house (Mary's a bit of a pack rat), but we didn't mind. We'll definitely be back!", "helpfulness": 22, "user": "A TripAdvisor user", "date": "September 11, 2005", "id": 3894464}, {"rating": 5.0, "title": "Absolutely Charming Bed and Breakfast", "text": "My boyfriend and I stayed at St. Martin's just a few days ago. We went for a romantic weekend away from the hustle and bustle of Dublin. It was an absolutely wonderful weekend, thanks in part to Mary Sexton's charming B*B.", "helpfulness": 16, "user": "A TripAdvisor user", "date": "July 28, 2005", "id": 3707549}, {"rating": 5.0, "title": "Wonderful stay in Galway", "text": "I will admit that my boyfriend was nervous when he saw the area we had to drive through to get to St. Marin's. However, when we saw the entrance to Mary's place, we immediatley relaxed. It's location actually turned out to be perfect. It sits right on the canal in the middle of the city and is only a short walk to Shop Street.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "July 2, 2005", "id": 3629627}], "location": {"country": "Ireland", "region": "Western Ireland", "continent": "Europe"}, "variance": {"poor": 0, "average": 2, "very good": 10, "terrible": 5, "excellent": 43}, "aka": "St. Martin`s b&b", "slim_ranking": 0.370967741935}