{"user_rating": 4.5, "review_count": 442, "name": "St Brides Spa Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We spent most of the Easter bank holiday at this hotel and had high expectation, given the price. Our room was £140 b&B without a sea view. The room was quite small but the bathroom was large as the room we were allocated was one adapted for disabled guests. I would agree with previous reviews which highlight the lack of robes, water etc which you would expect when paying these prices. The staff were very friendly but you got the impression that things were a little disorganised (our dinner reservation had been lost etc). We ate in the restaurant both nights as didn't fancy any of the restaurants in the town - the food was expensive but very nice, although the restaurant felt quite crammed on the Friday night. The waiters went out of their way to be helpful and did a great job! The hotel is beautifully and tastefully decorated and the bar is a great place to relax, with a selection of board games on offer, too. I could imagine this being really cosy in the winter months. We also made use of the spa - whilst I was taken aback at having to pay I came to the conclusion that had it been free of charge to residents it would have been absolutely swamped and not very relaxing at all. As it was there were very few of us in what is a relatively small smace and it meant we were really able to relax. The infinity pool is lovely - with great views of the bay. Thick robes were provided and the staff were lovely. All in all a good stay but I would say that it is over priced.", "title": "Great views but quite pricey", "helpfulness": 5, "user": "JosieH", "date": "April 13, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 7344909, "likes": {"liked": "— The decor and the views"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "This hotel is all about the location, cliff top overlooking the town, harbour, beach and sea. Everything about the hotel position is geared to the view, with a lovely patio bar area and sea view from the restaurant.", "title": "Location Location Location", "helpfulness": 4, "user": "CumbriaJo", "date": "April 10, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7304370, "likes": {"liked": "— Location", "disliked": "— Impersonal feel"}}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 10, "average": 32, "very good": 88, "terrible": 4, "excellent": 308}, "aka": "St Brides Hotel Saundersfoot", "slim_ranking": 0.2, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "A destination spa hotel with 46 rooms, 20 with sea view and balcony. Cliff top restaurant and marine spa with thermal suite and infinity edge vitality pool."}