{"user_rating": 3.5, "review_count": 243, "name": "St Christophers Bauhaus", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed December 2005", "text": "My stay here was the second worst experience I have ever had at a hostel (and I've stayed in numerous hostels all around Europe). Problems began immediately: our room smelled overpoweringly of raw sewage, and the room itself was filthy. I never let my bare feet touch the floor because the carpet was so gross. We couldn't find the source of the stench problem until we opened the shower door, and what we saw was truly revolting: rusting shower (that no one would feel safe in) and a drain that apparently was connected directly to the sewage line. When we mentioned the problem to the hostel management they told us -- in a not-so-friendly-manner -- that it was our problem, and they could not help us until the next day.", "title": "Disgusting. Avoid this place at all costs!", "helpfulness": 7, "user": "katecolorado", "date": "June 16, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 5353923}, {"rating": 1.0, "title": "Filthy pit", "text": "One of the assistant managers smelled our room from the hall and checked in to see what was going on. We appealed to him for help, and his solution? Smoke some marijuana to cover the smell. Nothing more. Exasperated and disgusted we slept on the floor of our friend's room. We would have left immediately, but it was late and every other hotel we looked in was closed for the evening.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "April 12, 2006", "id": 4967300}, {"rating": 2.0, "stay_parameters": "Stayed February 2006", "text": "The hostel's toilet situation was not any better: each floor of the hostel has only one toilet, and consider yourself lucky if the staff cleans them or refurbishes toilet paper once a week. It got so bad that we tried to avoid ever having to use the toilets here.", "title": "Great location, Poor hotel!", "helpfulness": 2, "user": "wenzfam", "date": "February 19, 2006", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "service": 4.0}, "id": 4470742}, {"rating": 1.0, "stay_parameters": "Stayed July 2005", "text": "The bar next door includes breakfast with the price of the room, but skip it. My first encounter with breakfast was a food-crusted coffee cup and stale bread. The fork I picked up had obviously not been washed since its last use.", "title": "Stinky mess worst hostel in the world", "helpfulness": 2, "user": "GirlWhoTravels", "date": "July 29, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 3721255}, {"rating": 2.0, "stay_parameters": "Stayed June 2005", "text": "The location of the hostel is not great either. It is at the end of a long road leading to the city center. There are much, MUCH, nicer hotels closer to the center for approximately the same cost. Do a little exploring to find good deals, and I guarentee that you will find something better than this place.", "title": "Great pub, poor Hostel", "helpfulness": 4, "user": "plod", "date": "July 23, 2005", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "rooms": 1.0, "service": 2.0}, "id": 3694704}, {"rating": 1.0, "title": "What a joke!!!", "text": "This was my first time in a hostel.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "June 2, 2005", "id": 3521951}, {"rating": 2.0, "stay_parameters": "Stayed March 2005", "text": "On paper, the bauhaus sets a high standard for itself. In reality, it falls short in every possible area.", "title": "The bar business was more important than the hostel.", "helpfulness": 4, "user": "Viking-travels", "date": "April 10, 2005", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "rooms": 2.0, "service": 2.0}, "id": 3349003}, {"rating": 1.0, "title": "very interesting", "text": "Enough said. You have been warned.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "February 20, 2005", "id": 3212371}, {"rating": 1.0, "title": "Not secure", "text": "First, I was turned off by the fact that I was an afterthought while trying to check in for my 3-bed room. You see, the bar has a duel role of selling spirits and managing the hostel. Maybe I should have ordered a beer and in passing say that I wanted to check-in. They were more interested in the bar business than the hostel business. Brugge is wonderful and the place was cheap, so I would recommend the place for budget travellers. The shared shower facilities could have been more clean. The location is not ideal, but the historic town center is very walkable so it was not bad. A bus does run from the train station to the hostel or it will take to a good 15-20 minutes to hike up there.", "helpfulness": 4, "user": "sixteencmg", "date": "December 20, 2004", "id": 2905704}, {"rating": 1.0, "title": "Stinky!", "text": "well for young people who dont care where they are staying its all right!! what i mean is it is VERY basic the pub attaching it has the best atmosphere you could ever imagine but put it this way the first thing i saw was a pile of dog poo in the middle of the floor and the fact that a mouse appeared in our shower from the middle of nowher ws amazing! i think i liked it so much cos im young and dont get phased by it but i can understand why people dont like it. id go back but only for a couple of nights at the most. oh and may i add we had to dispose of the mouse ourselves as after the second day no one had got rid of it!!!!!!!!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "October 18, 2004", "id": 2754895}, {"rating": 3.0, "title": "I quite liked it", "text": "It must be pointed out that Bauhaus provide both hostel accommodation and hotel accommodation in 2 separate buildings! I stayed in the hotel part with two friends and found the place rather nice. It was simple, yet clean and inexpensive. I would stay here again, but from what I have read, I would avoid the hostel section of the building. Prime location on a lovely street.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "January 24, 2004", "id": 1611692}, {"rating": 1.0, "title": "Disgusting!", "text": "I have no idea why this Hostel is recommended in the Let's Go Book, it was disgusting! The bathrooms were a nightmare, and the showers we terrible. We weren't even told we'd be staying in a Co-Ed Room till some men walked into our room! I would NOT recommend this place at all.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "August 1, 2003", "id": 1183666}, {"rating": 1.0, "title": "Bauhaus? hostel or h***", "text": "the Bauhaus is a joke. After 48hrs of travelling our college group arrived at the Bauhaus. We were made to wait to get in the rooms as they were still been cleaned at 4pm. When we got to the rooms the pillows had stains, the sheets were invested with lice and the bins were not emptied. The shower was mouldy the decor was very basic. Overall a big dissapointment and if that was not enough you always have your boiled egg and grusty roll with a cup of stone cold tea to look forward to if you survive the night.", "helpfulness": 4, "user": "as4185", "date": "January 27, 2003", "id": 847681}], "location": {"country": "Belgium", "region": "Flanders", "continent": "Europe"}, "variance": {"poor": 27, "average": 58, "very good": 74, "terrible": 38, "excellent": 46}, "aka": "St Christophers Bauhaus Hotel Bruges", "slim_ranking": 0.458333333333, "description": "AMAZING Pod Beds now available in dorm rooms of 10 and 16 beds. Pod bed features include individual power points, reading lights and curtains for extra privacy. Spacious and brand new! FREE Bruges Discount Card. FREE Wifi in reception and bar plus some rooms. FREE Belgian Beer Sampler – Try 3 delicious Belgian beers for free when purchasing a main meal in our restaurant. FREE Walking Tour of the city – Every Monday, Wednesday and Friday afternoons and a Saturday evening tour! FREE Use-it City Maps and self guided Bike and Walking tour maps. FREE Continental Breakfast for all our guests – in our restaurant."}