{"user_rating": 4.5, "review_count": 1167, "name": "St Martins Lane London Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Lets be clear art the outset. St. Martin’s Lane is a high concept, modern hotel with urban flair that will not appeal to everyone. If you don’t like modern design, small rooms, or high-concept urban experiences then you will probably not like St. Martin’s Lane. Or at least, you won’t be very forgiving of its particulars. There are plenty of equally expensive major label hotels in London for people who enjoy that kind of experience. If you’re a budget traveller then this place should not be on your list. But if you’re looking for something hip, off-beat, and a little unusual then St. Martin’s Lane is worth a visit.", "title": "Fun hotel, great location, but not for everyone", "helpfulness": 2, "user": "sabos93", "date": "January 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 12577416, "likes": {"liked": "— Location, style, comfort", "disliked": "— Expense, space"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "I have stayed here twice and found the staff to be professional, the rooms comfortable, and had all of my needs well served. There is also a decent gym. Not large but it does have tread mills, elliptical, circuit machines and weights. Its clean and well kept with water and towels for quests.", "title": "OK (if you like being ripped off)", "helpfulness": 4, "user": "silkerfish35", "date": "January 5, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 12345036, "likes": {"liked": "— Location", "disliked": "— Awful customer relations"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "Of course, another appeal of this property is the location. From St. Martin’s central London location you are in walking distance to Piccadilly Circus, Parliament, The London Eye, and Victoria Embankment on The Thames. If you don’t mind longer walks then Hyde Park and the West End are within reach. You are also close to a terrific and equally designer Indian restaurant called Mint Leaf just off Trafalgar Square on Suffolk street. I know there is an abundance of great Indian cuisine in London but Mint Leaf is special and worth the trip.", "title": "Trendy hotel, albeit a bit snobby", "helpfulness": 3, "user": "cheyse", "date": "January 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 1.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 5.0}, "id": 12266254, "likes": {"liked": "— atmosphere, location, asia de cuba restaurant, excellent shower!", "disliked": "— staff attitude, over priced drinks, everything in the room is for sale"}}, {"rating": 5.0, "title": "Prefessional staff, comfy bed and totally awesome decor", "text": "Stayed at SML for over a week last month and besides the location and grand lobby, nothing too impressive about the hotel and the rooms.", "user": "labonnevie", "date": "December 30, 2007", "id": 12069044}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Rooms are small and lack some basic things you'd expect - tiny, standard TV house in a cabinet, no proper wardrobe, etc", "title": "Not worth the money. Not a 5*", "helpfulness": 3, "user": "victoriay", "date": "November 5, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 10607590}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "Feels more like boutique NYC hotel than London. Small rooms and bathrooms carefully designed with lots of little features - like mood lighting around the bed. All depends whether this is your cup of tea - everything is tad too cool for my liking - all very knowing. The location is superb, The higher up floors have some nice views of London.", "title": "A little bit of New York", "user": "Kingmaker", "date": "November 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 183680148}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "Went to London for a long weekend with my sister and mother and was blown away by St. Martins Lane. The hotel itself is beautiful and our room was pure indulgence. Amazingly comfortable beds, ample wardrobe space, plush carpet, you name it. The staff was extremely accommodating with all our special requests (computer charger, earplugs at 11pm when my mum really started snoring etc). Our fantastic dreamy bathroom was complete with tub and super nice toiletries from Malin + Goetz. The hotel is not only clean, friendly and happening, I thought it was also a fun place to stay. Alex, Amy and Joey are all great concierges who gave us brilliant recommendations. Alex especially managed to get completely in tune with what we wanted to do during our stay and we went to some fantastic eats (and we're all extremely picky foodies) on his advice. Altogether 100% greatness on all levels, I would definitely come back, and definitely recommend warmly.", "title": "Long weekend with sister and mother", "user": "Anna H", "date": "November 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183678298}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "St. Martin's Lane offers superb service in every aspect. Excellent restaurant, invaluable advice from concierge, spot on wait staff, amazing decor, excellent bed and bath. Short walk to Trafalgar Square and theater district.", "title": "St. Martin's Lane London Hotel", "user": "Pam P", "date": "November 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183622293}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Just home from a weekend in London and feeling very happy !! This hotel is fantastic. All the staff are so friendly and service was excellent. They knew in advance it was a special occasion and did everything they could to make it unforgettable. We ate in the hotel restaurant which was one of the best meals we have ever had and at the end they bought out a special dessert for us with chocolate writing wishing us a Happy 1st Anniversary on it. Our room was clean, comfortable and a well stocked mini bar. We would like to make this a yearly trip but the thought of staying anywhere else in London is now not an option!!! Roll on next year !", "title": "1st anniversary stay", "user": "Ashking2013", "date": "November 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183406952}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Sophisticated, trendy hotel with staff to match. Great bathroom accessories and excellent bed and pillows and bathrobes. Exclusive toiletries available for purchase and displayed in room.. Great location and could be missed if you are not aware of location. Hotel has own transport available but stick to taxi as it can be expensive. Bar and restaurant available. Good central location for walking and sightseeing.", "title": "heart of theatre land", "user": "ileana318", "date": "November 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183342189}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "I've stayed in many hotels, and this was one of my favorites. Beautiful room, great service, friendly staff in a very cool neighborhood of London. I can't think of any downsides. They also have an excellent health club next door where you get free entry.", "title": "Outstanding hotel in a great area of London - highly recommended!", "helpfulness": 1, "user": "jeffr0s", "date": "October 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181193177}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled solo", "text": "I recently stayed at 'St Martins lane' hotel again - 11th Oct through to monday the 14th and to say I was impressed is a mere understatement. I find the place vibrant, beautiful and well designed. This however is not a patch on the smiles you are given at this hotel and the warm that radiates from the Staff.", "title": "A hotel worth returning to", "user": "Angela H", "date": "October 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181117062}, {"rating": 4.0, "stay_parameters": "Stayed October 2013", "text": "I would like to say a particular thank you to Alex on the conceirge desk. He is highly skilled at mixing a professional manner with one of friendliness and warmth. He during is a face I am always so pleased to see on the Conceirge desk. He is always willing to help and fairs well under pressure when the desks get busy. I have been witnessed to him juggling helping staff at the check in desk and manning the conceirge side of his job. He truly should be a valued member of this hotel, he certainly is from a guest perspective.", "title": "Tired of nonfunctional design", "user": "Ralph R", "date": "October 14, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 180991455}, {"rating": 4.0, "stay_parameters": "Stayed October 2013", "text": "Amet, the bellman is also a name I want to mention. He, like Alex, always in my experience goes above and beyond for his guests. I watched him hail cabs on Saturday evening for many guests and he is always polite, efficient, and welcoming. Again, he seems to have this incredible balance between efficiency and friendliness. I am delighted to honor him by writing this email because his work truly is exceptional.", "title": "Quality product as expected", "user": "BowTieCurryClub", "date": "October 14, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 180937461}, {"rating": 3.0, "title": "Great location but room too small", "text": "I would also like to take the time to mention Paris and Sonia on the check in desk and Amy on the Conceirge desk. These women are again, so efficient and good at what they do. It is a pleasure to enter the hotel and have people you feel care about you staying there. I commend their work too as they truly are three remarkable women who are amazing at their job.", "user": "Jordan1964", "date": "October 14, 2013", "id": 180885126}, {"rating": 5.0, "title": "Fabulous!!!", "text": "Stayed here for 1 night and what can I say? Wow!!", "helpfulness": 1, "user": "Sisterpurds", "date": "October 27, 2013", "id": 182607389}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "My partner booked this hotel as a surprise, we were celebrating a special occasion and he had been in contact with the con concierge staff and Nicole the guest experience manager prior to our arrival. They arranged for an upgrade, fresh rose petals spread throughout the room, a bottle of champagne and complimentary cocktails in the bar, the perfect touch!!!", "title": "Awesome Hotel!", "helpfulness": 1, "user": "cfordiani09", "date": "October 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 182413924}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "The hotel itself is in the best location close to everuthing and everywhere. The staff are very helpful and the rooms lovely.", "title": "Friendly retreat from busy London theatre district", "user": "Buzz J", "date": "October 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181830785}, {"rating": 4.0, "stay_parameters": "Stayed September 2013", "text": "Will definitely recommend this hotel and will be returning, hopefully for longer next time.", "title": "Very nice modern bright hotel.", "user": "sftcat", "date": "October 21, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 181781910}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Everything about this hotel is perfect. We arrived off of a 4-hour train ride from Edinburgh, tired, peckish, and slightly damp from navigating the alleyways from the Leicester Square station in the rain (which is ridiculously close, but for two disoriented Americans, it's not). Ed, at the front desk, was so sweet and accommodating that he had our gigantic soggy suitcases wiped down before he took us to our room. That right then and there was above our expectations, for I'm sure those bags suffered far more abuse from Virgin Atlantic than a little rain. Anyway, our room was fantastic - located right behind the English National Opera House, so it was very quiet. Even though it's smack in the middle of the very busy Leicester Square/Covent Garden (and we were there during Cocktail week) it was very peaceful. Everything was new and clean, the amenities plentiful, and most importantly, the bed was very comfortable. I also loved the plant hanging on the wall, and how a member of the staff would light a candle in the bathroom in the evening. It was those small details that made this hotel so lovely. But I have to say, it is the staff that really makes this place so special. Everyone is so kind and knowledgeable. I cannot count the times we went to the concierge (each and every one of you is a credit to your service) for help, whether it was cheap theatre tickets, how to get a refund for the Oyster Cards that never showed up, or how to make a simple local phone call (which is quite complicated if you've only dealt with no more than 10 digits for the majority of your life...11 if it's a 1-800 number...I swear we're really not that incompetent). To top it off, the hotel's location is perfectly centralized to EVERYTHING even though it's smack in the middle of the very busy Leicester Square/Covent Garden We mostly walked everywhere, but it's so stupidly easy to take the tube anywhere and everywhere as well. Thank you everyone at St. Martins Lane Hotel for making our holiday in London that much more enjoyable! We will be back soon, and we will be staying with you!", "title": "How Fabulous is this!", "helpfulness": 1, "user": "LondonTolly", "date": "October 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 181781121}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Spent 2 nights at this hotel at £450 per night. We arrived to be greeted by friendly reception staff who then checked us into a room, that judging by the shopping bags lying around and the un-made bed, was clearly occupied. On returning hastily to the reception I was asked, “did you actually see anyone in the room” no said I, “its not occupied then” came the reply. To compensate for this potentially embarrassing faux pas they up graded us to a suite! A smoking suite! Which, when we found it (manager got a bit lost) was very nice, but it smelt like an old ashtray. We were given a bottle of champagne which was a nice gesture.", "title": "You can't make it up", "helpfulness": 4, "user": "MattGoulding", "date": "February 3, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 13230327, "likes": {"liked": "— Stylish", "disliked": "— Service"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Dinner at Asia de Cuba that evening was very good and passed without incident. Breakfast the next morning was good, even though it took 30 minutes to arrive and bared no resemblance to what was ordered. We went out for the day and came back to relax in the room, late afternoon, before going to the theatre, to find it had not been serviced, so we had to leave the room again while this was done.", "title": "St Martins Lane - Outstanding", "helpfulness": 1, "user": "Newks", "date": "January 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12909593, "likes": {"liked": "— The whole package.", "disliked": "— Leaving."}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Breakfast was included in the rate which would usually set you back £20.00. However, on the 2nd morning my partner ordered pancakes and we were charged an extra £6 as they were not part of the full English our rate applied to. So £26 for 2 pancakes it was. I had smoked salmon and scrambled eggs was also not part of the full English but this was allowed. I have no idea why and after enquiring still don’t. At £450 a night service should be superb. These guys need to go to Asia or America to see how it’s done. Still, if you’ve never had proper service and you liked Faulty Towers you’re going to love it.", "title": "A silver experience for us!", "user": "Laura_and_Sean", "date": "January 22, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 12890500, "likes": {"liked": "— Very white and interesting style and lighting", "disliked": "— No tea making facilities"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "I stayed at St. Martins Lane as a treat for the wife, and as we were going to a show 'next door' at the Coliseum. I have eaten at Asia de Cuba several times and always been blown away by the place. For the more 'trendy' the Light Bar is a fantastic place for early or late drinks. However I had never stayed at the hotel before, and having booked, I was a little concerned by so many negative reviews on this site. I even contacted the hotel after booking, just to express my concerns and also check if any refurbishments / alterations were taking place that could have disappointed people. I was astounded by the speed of a reply almost immediately from the Hotel Manager expressing her assurances we would have a pleasant stay, and that hotels are always frustrated when people pass negative comments without informing the hotel and giving them the chance to answer or rectify.", "title": "Triumph of style over substance", "helpfulness": 2, "user": "sandysviews", "date": "January 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 12812047, "likes": {"liked": "— The Staff", "disliked": "— The Noise in the bar, the darkness in the bar, the prices"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "Why did I worry? The experience from the moment I was politely greeted by the door staff and the delightful reception staff was truly outstanding. The hotel room was magnificent, large and light, and not at all noisy as other reviewers had commented. We requested a bath, which we were fortunate to get, and what a bath it was. Superbly comfortable, and huge! Similarly in an enormous bathroom with all the usual ammenities, and touches one would expect in such a hotel. The towels, for those that are interested in such things, were luxurious, and can be ranked up there with the bed-linens, which my wife described as beautiful and 'expensive'.", "title": "Sticker shock", "helpfulness": 1, "user": "prague79", "date": "January 18, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 4.0}, "id": 12773339, "likes": {"liked": "— location, bed, shower; the food at Asia de Cuba is also fantastic", "disliked": "— not business friendly, too many added on fees, old electronics"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Husband booked this hotel with theatre package to see joseph, which is brilliant by the way if you haven't seen it go.", "title": "great location hip hotel but expensive for what it is", "user": "louderry", "date": "March 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 14375191, "likes": {"liked": "— location", "disliked": "— price"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "Paid £350 for 1 night including theatre tickets", "title": "Great Hotel Experience", "helpfulness": 1, "user": "Daniel08Paris", "date": "February 8, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13371506}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "Hotel is very close to covent garden and the strand so easy to go sight seeing, a 10 minute cab ride from waterloo station which costs around £7.00", "title": "What a fabulous hotel!", "user": "roo15", "date": "February 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13370332}, {"rating": 4.0, "title": "Very nice, but a little too hip and funky for me...", "text": "The hotel is very modern all mdf and white walls with gold tooth design chairs, check staff very nice got upgraded to a garden room,", "user": "runalot", "date": "February 6, 2008", "id": 13330945}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "The garden room has a small patio garden with table and chairs if you want to sit outside.", "title": "St Martins Lane Hotel - stayed at better", "helpfulness": 2, "user": "SunnybabeCheshire", "date": "February 4, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 5.0, "value": 2.0, "rooms": 3.0, "location": 5.0}, "id": 13264989, "likes": {"liked": "— Clean room and comfy bed", "disliked": "— Lack of service/ bad attitude of staff except for the man who brought me breakfast via room service"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "With regards to the hotel itself, the decor is amazing. Very modern. (Rooms very cold though!).", "title": "Let down by poor service", "helpfulness": 3, "user": "Ashley321", "date": "April 23, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 5.0, "value": 2.0, "rooms": 4.0, "location": 5.0}, "id": 15272914, "likes": {"liked": "— Decor, location", "disliked": "— Staff/service"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "However, the same cannot be said for the staff. On checking in, we were ignored by the reception staff even though they saw us waiting and seemed not to be busy with anything else. We were standing at the desk for quite a while before we were served. Reception staff were rather cold and unfriendly. The same applied to the restaurant. Whilst waiting to be seated we were ignored three times by the staff. Usually staff in other restaurants would say \"I'll be with you in a moment\" but we were not even acknowledged. They simply brushed past us as if we were in the way. When we were seated, the waitress managed to take our order without smiling or any eye contact whatsoever. The service was also very slow. My boyfriend and I both work in the customer service industry and know how customers should be treated, and this definitely wasn't it.", "title": "Memorable stay", "user": "KathyOxfordEngland", "date": "April 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 14725313, "likes": {"liked": "— Beautiful decor, great location", "disliked": "— No tea/coffee making facility, a bit stingy with the freebies"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "Check out was much the same as check in; payment was asked for and that was it. Nobody asked how our stay was, or if we needed a taxi etc.", "title": "HIp, Hip, Hip", "helpfulness": 1, "user": "Supergo", "date": "March 31, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 14681582, "likes": {"liked": "— Style, Style, Style", "disliked": "— no dock to play my iPod"}}, {"rating": 5.0, "title": "Chic Hotel, Great Service and Location", "text": "I feel that the hotel is relying too much on the aesthetics of the place to attract custom, whilst overlooking the way that the staff treat their customers. Had it not have been for the way we were treated, we would have gone back.", "user": "jf414", "date": "March 29, 2008", "id": 14644783}, {"rating": 1.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "I stayed here for one night with my husband and two teenage children. We were immediately struck by the decor, its very modern and artistic and we have never stayed anywhere that looked like this before. As we went up to our room in the lift there were little tv's showing arty short films, and the lights change to purple when the lifts move. We found this really entertaining, although I imagine you are supposed to be very serious about it all, it made us smile.", "title": "Of the moment (5 years ago)", "helpfulness": 5, "user": "000xxx", "date": "March 26, 2008", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "rooms": 1.0, "location": 5.0}, "id": 14550831, "likes": {"liked": "— location", "disliked": "— everything else - expecially 'couldn't care less attitude' of senior staff when made complaint."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We chose the St Martins Lane Hotel because we found a special offer on it and have always wanted stay there. The Reception staff were friendly and helpful and even though we had turned up very early hoping to just drop off our bags, the reception lady found us a room and we were able to check in.", "title": "Fabulous Christmas Getaway", "user": "ZilmitLondon", "date": "January 1, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52292070}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The room was ultra modern but still comfortable, we booked a Deluxe King Room. Bed was firm but still very comfortable with a range of pillows.", "title": "Great hotel", "user": "DiManMilan", "date": "December 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 52124454}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "The bathroom was spacious with a great shower, amazing water pressure.", "title": "Always on my short list when visiting London", "user": "notstiller", "date": "December 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 52039614}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "Along with this there were other nice little touches our room came with a ipod dock speaker and a dvd / cd player (with an extensive list of cd's and dvd's which could be borrowed - dvd's came with popcorn although we never got to try this).", "title": "GREAT HIP HOTEL", "user": "turbosports", "date": "December 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51698928}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "we had lunch at Asia de Cuba the next day, again the staff were very friendly and helpful their recomendation of one starter and two main courses was more than enough food - we had the spare ribs followed by the Cuban Chicken and the Steak. All portions are designed to be shared which is what we did.", "title": "Amazing - everything just right!", "user": "MarkandCat", "date": "December 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51560303}, {"rating": 5.0, "title": "What are you complaining about?", "text": "I read a number of reviews from TripAdvisor after my girlfriend had made the booking for us and I was starting to get concerned.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "July 10, 2006", "id": 5446454}, {"rating": 5.0, "title": "Perfect end to my trip!", "text": "WHAT IS ALL THE FUSS ABOUT? The hotel is fantastic. It is a great place to stay. The entire team that works there is nothing but warm and friendly.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "July 8, 2006", "id": 5440199}, {"rating": 4.0, "title": "Loved it!", "text": "We were in a standard room and yes, it might not be the biggest place to stay, but the hotel is right in the heart of Leicester Square and Covent Garden. We did not book to be in this location just to sit in our room!", "helpfulness": 4, "user": "ATurner39", "date": "June 9, 2006", "id": 5327260}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "The restaurant and the bar were amazing. They are the place to be seen in and have a really cool crowd with a great atmosphere. All the action happens in the lobby area and this is the place to hang out.", "title": "Very Modern, Great Location", "helpfulness": 2, "user": "Detailsimportant", "date": "June 5, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 5305016}, {"rating": 3.0, "stay_parameters": "Stayed May 2006", "text": "The hotel appears to be offering something different. If you have a traditional view of hotels or you want to play it safe…. go somewhere else and be boring!", "title": "Fake Corner Suite Size", "helpfulness": 2, "user": "rc3hk", "date": "June 3, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "service": 4.0}, "id": 5295966}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "There are some positives about this hotel as it is very pretty, though small, and the staff was terrific but the buck stopped there. As Priceline guests we received a room that was 220 square feet (not even shown on St Martins Lane website in room descriptions) and our 5* \"luxury\" room had no bath, shower stall only. The previous poster below rated this correctly as a \"boutique\", it is not a 5* hotel. I have never heard of a luxury hotel that offers no bath tub, a 220 square foot room and has an 8 by 10 inch tevision. The main positive was that the staff was definitely helpful and personable with us, sorry some previous posters had different experinces. I will not bid on a 5* accomodation in London as long as this remains a Priceline \"luxury\" hotel. Did not have a chance to try the popular Asia de Cuba restaurant though I understand it gets high remarks. Hope this is helpful.", "title": "Regrettably not a 5* as anticipated", "helpfulness": 3, "user": "frequenttraveler27", "date": "September 20, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 5819616, "likes": {"liked": "— personable staff, concierge and bellmen", "disliked": "— substandard room quality"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled on business", "text": "Unfortunately a case of form over functionality and certainly an example of trendiness over friendliness! In terms of atmosphere, it is exactly what you would expect for a boutique hotel and design of the hotel and rooms is great but that is where it ends. At every encounter the staff prove extremely unhelpful and while they all look extremely young and fashionable that appears to be their only function. If you don't look like a supermodel, you will constantly be asked to present your key in order to use the bar of the hotel or get access to the restaurant. Most disappointing of all was the fact that you will be asked to present a credit card for security when ordering at the bar as they will not accept your room card as a guest of the hotel! When I queried this I was told by management this is because people can 'forge' the room cards! So it seems the hotel is patronised by trendy dishonest people. In addittion to this, business facilities proved very poor and we had to hold a meeting at the back of the restaurant as there were only 3 small meeting rooms. Very disappointing!", "title": "Trendier than thou!", "helpfulness": 3, "user": "Bowsy", "date": "September 16, 2006", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 5805937, "likes": {"liked": "— Location", "disliked": "— Staff attitude"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with friends", "text": "We found great rates for this hotel via Travelzoo and booked two awesome rooms for about half the regular price. The hotel is very swanky (think the Mondrion Hotel) and I feel like it was in the middle of everything...located a short walk from Trafalgar Square, the theater district, great shopping and great nightlife! A great concierge helped us find the best restaurants in London, and helped us secure very hard to find theater tix!! Great, friendly staff and rooms were nice & clean, though not the most spacious. The bar here is also fun, though drinks can be quite pricey.", "title": "Loved it!", "helpfulness": 1, "user": "CaliTrvlGrl", "date": "September 5, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5769355, "likes": {"liked": "— the friendly staff", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Disappointed with the smaller than expected standard rooms (and we booked a twin and double but got two doubles) but great views and fantastic service. When will hotels like this realise that no-one", "title": "Small but funky rooms", "helpfulness": 2, "user": "hopyard", "date": "August 31, 2006", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 5730839, "likes": {"liked": "— style, views, some great staff", "disliked": "— small rooms, stupid mini bar prices"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "unless blind drunk will pay 3.50 for a standard kit-kat.. so on-one buys anything.. my kids were disappointed not to be allowed to raid the mini bar!", "title": "Supremely Well Located Hip Design Hotel", "helpfulness": 9, "user": "RovingTraveller1900", "date": "July 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5511973, "likes": {"liked": "— Great Light Bar and Asia de Cuba Restaurant", "disliked": "— Poor Quality Mattress - being replaced"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Stayed 10-14 December 2009 in Deluxe King.", "title": "As good as always...", "user": "pelun", "date": "February 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55096447}, {"rating": 2.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "I have stayed several times at St Martin’s Lane as well as Sandersons. Like both hotels very much. Surprisingly they both maintain a high standard and rooms are kept in a good condition. Love the simple but cool rooms having floor-ceiling windows. Bathroom large and comfortable. As think mentioned in previous reviews, the hotel may not be everyone’s cup of tea. Design, design, design and white. Hip and chic. Staff in general good although can sometimes be a bit stuffy. Light bar is nice even if not extraordinary. Asia the Cuba serving great food. Although cannot understand why hotel doesn’t have better influence with next door night club Bungalow 8. It’s literally located in the hotel. Shame. Anyhow, location is perfect. So, see no reason why shouldn’t return.", "title": "Disappointing", "helpfulness": 2, "user": "MargaretLil", "date": "January 21, 2010", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 2.0}, "id": 54039974}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "I was very excited to stay at the St. Martins Lane hotel during our long weekend in London. Knowing the Morgan group quite well from extensive experiences with the Clift Hotel in San Francisco, I was prepared for a top notch experience. Unfortunately, our experience was average at best.", "title": "Modernistic hotel in a fantastic location with extremely nice staff", "helpfulness": 1, "user": "Marina L", "date": "January 13, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 53336942}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "First, from the website, I was expecting more from the decor. During the week they tone things down, and it was not until Saturday night that the lobby looked even remotely as exciting as it had online.", "title": "Very impressive", "helpfulness": 1, "user": "MisterBalls", "date": "January 8, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52957112}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "Second, it was dirty dirty dirty! I wish I'd taken pictures, but the carpets in the hallways were filthy. It may have been snowing, but in a 5 star hotel with a 5 star price tag, I expect the floors to be clean.", "title": "Wonderful Stay!!!", "user": "makarska1997", "date": "January 1, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52322727}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "I enjoyed a fantastic birthday weekend in this hotel with my mum and sisters. I hadn't even stepped out of the cab when already Ed from the hotel was providing a great warm welcome. We had two double double rooms a few doors apart and they were great - modern, spotless, surprisingly roomy for central London and very well equipped. You really get a sense that the staff in this hotel love what they do and that makes such a difference to your stay. Check out the Light Bar and be wowed by the dancing bar and security staff - they don't do routines but they are having such fun working they just dance around!", "title": "A little London gem!", "user": "Fiona R", "date": "November 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183330913}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Stayed at this hotel on the 19th October for one nights accommodation upon entering the hotel you are very much welcomed by all staff that you meet reception was quick and efficient and you was straight up to your room which are compact but very we'll set out .we were staying to go and see a show in the strand which is very convieniant with the hotel booking we had a meal in the hotel Cuban style which is very lively and great atmosphere we had the taster meal which included starter and main course which was lovely with great staff we totally enjoyed our stay and would return again", "title": "Birthday/theatre", "user": "DayAllan61", "date": "October 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 183075982}, {"rating": 5.0, "stay_parameters": "Stayed October 2013", "text": "Staying in St Martins Lane hotel, was like feeling like the cool kid at school. I felt exclusively special due to the incredibly helpful and friendly staff. I felt in-the-know because the hotel was situated literally in the West End, London's hub of culture and experience. I felt accommodated due to the cosy modern rooms and amazing turn-down services which was akin to being tucked in to bed. I felt I could maintain my homely rituals of exercise due to UK's state of the art gym, Gymbox, being just next door which we had full access to. In general, I felt like I had stayed in a place which combined the comfort of my home life with the luxury and escapism of a hotel.", "title": "The perfect London experience", "user": "Linkdiddy", "date": "October 30, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 182988238}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "The key difference between this hotel and others, is the phenomenal people that work here. The reception staff were friendly, energetic and efficient. The concierge and doormen had encyclopedic knowledge of good places to eat, drink, explore and were happy to pass on this information. The security boys at the hotel's bar were also a stand-out, namely CJ. Thanks for teaching me those moves man.", "title": "My most wonderful vacay in London!", "helpfulness": 1, "user": "Sue K", "date": "October 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 182876941}, {"rating": 5.0, "stay_parameters": "Stayed October 2013", "text": "When you do inevitably arrive there, seek out a girl by the name of Nicole Messham, because she was a vital factor in our amazing experience. Just a lovely person in every sense of the word who will go out of her way to help with whatever she can.", "title": "Marvellous St Martins... a must stay!", "helpfulness": 1, "user": "MrsAJC", "date": "October 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 182742401}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Look at their website. If it just looks too odd - don't go. If, like me, you think it looks amazing then re-mortgage the house, sell the family silver - whatever it takes - just visit!!", "title": "Amazing - just go there!!", "user": "JZH09", "date": "December 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50419681}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "I think all the bad reviews on here are from people who just don't get it?", "title": "Fabulous!", "user": "exotic1983", "date": "November 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 50226365}, {"rating": 3.0, "title": "Overpriced", "text": "Took my Partner overnight for her birthday. The hotel is stunning. A wonderfully eclectic mix of styles. Gold teeth and gnome seats next to a giant chess set in the foyer - need I say more!!", "user": "BeniaminoD", "date": "November 26, 2009", "id": 50130955}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "Staff are wonderful and made the day absolutely perfect. Booked the 'romatic package' and our room looked amazing on arrival with champagne and rose petals.", "title": "I Love This Hotel", "user": "Vin004", "date": "November 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49162992}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Didn't eat dinner at the hotel but had cocktails in Asia de Cuba at midnight when it was packed but still they found us a table for 5 in 3 minutes somehow. A fabulous vibe and really relaxed atmosphere for somewhere so busy.", "title": "eh, just\"ok\"", "user": "JZH09", "date": "November 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48821109}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "It was the second time my partner and I stayed in St Martin's Lane last weekend.", "title": "2nd time there... but disappointing", "user": "martata", "date": "December 15, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 51283861}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We went there for a nice weekend 2 years and loved the experience.", "title": "Bijou Chic in the Heart of London", "user": "carolesg", "date": "December 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51221129}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The staff was at the time really helpful (sorting out theater tickets for us and amazing restaurants)", "title": "Different hotel but worth the visit", "user": "dubaiman", "date": "December 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 51104285}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "This time, the experience was a bit different, and I must admit disappointing", "title": "Stylish hotel but without the service to match", "user": "robert1234London", "date": "December 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 5.0}, "id": 50619677}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "On arrival we wanted to reserve a restaurant for the evening. We have been as usually guided to the concierge, but this time, we faced a man quite arrogant and not even explaining which restaurant was what.", "title": "Friendly & relaxed", "user": "Roguesbird", "date": "December 4, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 50615175}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "This place is definately worth it if you get a great rate. We were checked in early (by a really obnovious guy - the only negative to our experience) and upgraded to a deluxe - which was a perfect size - wouldn't really want it any smaller. The rooms are all white which i love - expect at night you can change the lighting to blue, pink, orange etc above the bed. The table also lit up which was one of my favorite touches. Also nice were the floor to ceiling windows. This hotel has been around since 1999 but everything looked almost brand new and perfectly clean- there must have been recent refurbishments. The king bed was very comfortable but you won't like the rooms if you're looking for big cushy chairs and lots of seating. The bathrooms were also amazing. I prefer the Sanderson - the lobby at St Martins doesn't compare. But the value is slightly better. Don't stay here if you're going to complain about comfort or design. I don't get how people book to stay here and then are surprised by that.", "title": "Fun Experience", "helpfulness": 1, "user": "fan987", "date": "January 17, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6611778, "likes": {"liked": "— Restaurant, Design", "disliked": "— Check-in staff"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "I paid above what I could afford to treat my boyfriend for his 27th birthday but it was worth every penny. We ate in Asia De Cuba. The food was amazing, the clientele - good looking and glam. I dressed up to the nines in a lovely dress and felt like a supermodel! The staff were all very friendly. The hotel was space age and glam. The room was small (it was the cheapest) but it was still very glam (except the rotten old TV). My boyfriend is a very glam person and he loved it. Romantic evening and we stayed late into the next day which was okay. But - I got what I'd paid for. It was all pretty pricey.", "title": "Glamour at St Martin's Lane", "user": "vclipLondoner", "date": "January 17, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 6611606, "likes": {"liked": "— Looked very modern", "disliked": "— The price"}}, {"rating": 4.0, "title": "Posh. Ideal Location. Just Don't Make a Phone Call.", "text": "As long as you don't pick up the phone in your room, you'll have a fabulous time at this modern, highly stylized hotel located in Covent Garden. From St. Martins Lane you can easily walk to Leicester Square, Trafalgar Square and Soho and enjoy the hundreds of restaurants and shops along the way. Multiple tube stops and buses surround you so you'll have no problem getting to wherever you want to go in this magnificent city.", "helpfulness": 3, "user": "roguemh", "date": "January 17, 2007", "id": 6607050}, {"rating": 3.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "As for decor, somehow St. Martins Lane is able to marry the austerity of a museum with the warmth of a living room. Candles illuminate the lobby, restaurant and bar and the framed pictures on the wall in the restaurant add to the feeling of home living.", "title": "Light and Odd", "helpfulness": 2, "user": "candid1", "date": "January 8, 2007", "detail_rating": {"front_desk": 2.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 6564740, "likes": {"liked": "— Rooms", "disliked": "— Staff"}}, {"rating": 3.0, "title": "Too hip- needs more comfot", "text": "Here are four things I think you should know:", "helpfulness": 1, "user": "TransATL", "date": "January 3, 2007", "id": 6546155}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "This was my third or fourth stay at St. Martin's Lane and probably my 10th at a Morgan's hotel. This will probably be my last stay at this specific hotel. There was nothing horrible about the hotel but it was just not a good value for the money. To be fair, the currently weak US dollar is part of a problem here. The hotel's location is excellent. Very close to Covent Garden, Trafalgar Square and The Strand. The Philippe Starck design is playful and funny. I love the LCD displays in the elevators that play an ever-changing variety of video art. The limestone clad bathrooms are very efficient and well-designed for their footprint. The rooms are small but that is fairly common in London where hotels are generally not a good value for the money. The bed was very firm which I thought I'd appreciate but it ended up putting a knot in my back each morning. I had never had a problem with the beds at this hotel before. The color wash wall was cool but some of ours were burned out so we did not have a full spctrum of color. The lobby and some of the public areas of the hotel were a bit ropey: dirty carpets and broken tiles in the lobby. As I have experienced at other Morgans hotels the staff can be alternately helpful or surly. We used the concierge once he acted like we were putting him out to inquire about the weather forecast. The lack of a bathtub is a big issue, especially after a long flight from the west coast of the US. If you love design this hotel is creative and interesting but it needs to be freshened.", "title": "Showing its age", "user": "cjboffoli", "date": "December 3, 2006", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 6321006, "likes": {"liked": "— location, design", "disliked": "— cost, lack of bathtub"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Outstanding location is probably it's best asset. Staff are excellent, friendly and welcoming (notwithstanding queues on checking out). Rooms very nice and although on small side, feel remarkably spaceous with lots of natural light.", "title": "Location, Location, Location", "user": "docframe", "date": "December 2, 2006", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 6317525, "likes": {"liked": "— Location, staff, rooms", "disliked": "— relative lack of daytime amenity"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "Make sure you have a credit card though as debit cards are not accepted for purposes of bill payment or credit checking - most surprising for a supposedly ***** hotel.", "title": "Not fabulous anymore ", "helpfulness": 4, "user": "coffeebar", "date": "November 4, 2006", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 6055792, "likes": {"liked": "— The location", "disliked": "— Doesnt \"have it\""}}, {"rating": 2.0, "stay_parameters": "Stayed December 2004, traveled solo", "text": "Minibar prices outrageous (£3.50 for a bounty bar!)", "title": "low value for money", "helpfulness": 3, "user": "stefanosmet", "date": "November 3, 2006", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 6051921}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled solo", "text": "Relatively lacking in public space amenities until bar opens but perhaps that's not important given that the West End is on doorstep.", "title": "I went to London for fun and found it here!!!!!", "user": "Maria del Mar44", "date": "October 7, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5925010, "likes": {"liked": "— The location", "disliked": "— Doesnt \"have it\""}}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 5, "variance": {"poor": 57, "average": 107, "very good": 326, "terrible": 26, "excellent": 651}, "aka": "St Martins Lane London Hotel London", "slim_ranking": 0.0780669144981, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "From its dazzling location at the hub of Covent Garden, West End theatres and Trafalgar Square, St Martins Lane is a dramatic and daring reinvention of the urban resort. Smart, witty and sophisticated, the hotel is filled with energy, vitality and magic. Unique features include the acclaimed Asia de Cuba restaurant, wildly popular Light Bar, and interactive light displays in every Guest Room that encourage guests to personalize their own individual space, and help to turn the hotel into a beautiful and ever changing mosaic of color. St. Martins Lane Hotel offers seasonal packages and special offers including weekend, holiday, and breakfast packages. These offers are exclusive to the site and are available for a wide variety of room types and sizes."}