{"user_rating": 4.0, "review_count": 61, "name": "Stamford Suites", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed December 2003, traveled on business", "text": "With several nice hotels in the Stamford area, I would avoid this one if possible. I stayed here because the rate was decent and it was the only non budget hotel that was available that night. The one good thing I will say about this hotel is the rooms are very large. Each room has a seperate bedroom, kitchen, and living area. However, the room was not properly cleaned and the hallways were disgusting. One other reason why I chose this hotel was because they claimed to have a free \"deluxe breakfast\". What a joke. I guess they consider a deluxe breakfast a few old pastries and some OJ. I can deal with some of these issues, but the caper was the fact they charged me 150.00 for damage to my room that I didnt do. In fact, in the end it was determined that there wasnt even any damage to the room, but it was a simple \"communication\" issue. It took 3 weeks for the charge to be reversed. That is just flat out horrible service. I will give the hotel 2 stars though based on the fact that the rooms are probably 3 times larger then the average hotel room. But that doesnt make up for the number of other problems.", "title": "Avoid if possible.", "helpfulness": 6, "user": "icem2829", "date": "August 9, 2005", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "rooms": 5.0, "service": 1.0}, "id": 3748579}, {"rating": 2.0, "title": "Better hotels in area", "text": "While I wouldn't say the hotel is \"disgusting\" like the previous reviewer, it definitely could use improvement. Staff were not knowledgable on basic issues such as rate, check-out time, etc. This set a bad first impression. However, since it was late, I didn't know the area, and my girlfriend was tired and just wanted to sleep, I felt compelled to take what I could get. The one good thing is that the suites are large with kitchenettes and large king beds. However, the furniture is quite dirty- My girlfriend refused to sit on the sofa beside me it looked so soiled! It's quite pricey too, but hey, this is Stamford, CT. Another good thing is the location- walking distance to trendy downtown spots and restaruants. For a few dollars more you're better off staying at the Marriott, but the rooms aren't as large.", "helpfulness": 4, "user": "err230", "date": "August 15, 2004", "id": 2450866}, {"rating": 1.0, "title": "Horrible stay", "text": "This hotel is absolutely disgusting. There are rodent bait traps in the bathroom, and the staff did not inform me of this, even when they set up a crib for my baby in the room! I walked into the bathroom and saw her reaching for a black box that was filled with poison! When I called the fron desk, they conceded that they do have a rodent problem, and that they place these bait traps in all the bathrooms. I was very upset that I had not been told, even as they knew that I had a small child with me. The hotel clerk told me that it was up to me to watch my child, and that she would never have had this happen with one of her children. (Of course not, she knows the traps are there). She was very arrogant, and I never even received an apology. Apart from this, the smell in the room was horrible, the room was filthy and I wouldn't even use the bathtub as it was so disgusting. Take my word for it, find somewhere else to stay if you can. I travel frequently on work related trips, and I have never stayed in a place that was this horrible.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "July 25, 2004", "id": 2320679}], "location": {"country": "United States", "city": "Stamford"}, "stars": 2.5, "variance": {"poor": 5, "average": 4, "very good": 24, "terrible": 3, "excellent": 25}, "aka": "Stamford Hotel Stamford", "slim_ranking": 0.142857142857}