{"user_rating": 4.0, "review_count": 1077, "name": "Stanford Court San Francisco", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "We just returned from a 4-night stay at the Stanford Court. I booked our stay as a combination hotel/car package through the Marriott website, which saves money ($550 for 4 nights with economy car, and includes all taxes) but also creates a couple of problems: (1) you cannot specify the type of room or bed; and (2) you have to find somewhere to park your car; the hotel valet costs about $43 per night. When we checked in, the desk clerk tried to get us to \"upgrade\" our room to a queen non-smoking ($30 more per night) or a king ($50 more per night). We decided to stay with the room she offered (a queen in an \"optional\" smoking room), and the room turned out to be smoke-free, with a nice view. It was a bit dated, but perfectly adequate--I would rank it as a 3.5 star. Our room overlooked the cable car intersection, but the noise wasn't that bad. As for the parking, it turns out there is a small parking lot right across the street from the hotel, which charges $20 a day (no in-and-out privileges, however). You can also park at the lot for $15 for up to 12 hours. This is a bargain as the commercial garages in the Nob Hill area charge about $3 for every 20 minutes, with maximums of $27-$31 a day.", "title": "Good Location for Nob Hill, So-So Rooms", "helpfulness": 2, "user": "pashber", "date": "March 16, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 3277408}, {"rating": 3.0, "stay_parameters": "Stayed March 2005, traveled on business", "text": "The greatest advantage of this hotel is the proximity to the other hotels on Nob Hill. The Fairmont is right across the street, the Mark Hopkins at the end of the block (uphill), the Huntington another block up, and the Ritz-Carlton 2 blocks down.", "title": "Not Walker-Friendly", "helpfulness": 6, "user": "hbyerly", "date": "March 3, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 4.0}, "id": 3250013}, {"rating": 4.0, "stay_parameters": "Stayed February 2004", "text": "The biggest problems, of course, are the steep climbs up from the Union Square area. However, if you take your time up the hill, it will be ok. I wouldn't wait for the cable cars, as they are usually packed to the gills.", "title": "The price was right!", "helpfulness": 4, "user": "hairdoday", "date": "February 16, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3197999}, {"rating": 2.0, "title": "There are better places to stay", "text": "All in all, the hotel was fine, but I would stay elsewhere on my next visit to the Bay Area...the hills and the parking were a bit much.", "helpfulness": 4, "user": "SoCal322", "date": "February 12, 2005", "id": 3181961}, {"rating": 4.0, "title": "Like it a lot", "text": "The beautiful lobby and great service is somewhat offset by the small, older rooms. The location is at the top of Nob Hill, which means it's just two (VERY steep) blocks from Chinatown, and two of the main trolly lines pass just outside.", "helpfulness": 3, "user": "kahng", "date": "February 2, 2005", "id": 3112384}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We stayed at this hotel for the first two nights of our honeymoon enroute to Hawaii. I must admit, the hike from the Powell Street BART station is quite steep. These two midwesterners weren't expecting the 8 block climb that gets progressively steeper to California. (In fact, California is on top of the hill, so there is no further climbing which is good and bad)", "title": "Excellent hotel, location, and amenities", "helpfulness": 1, "user": "CTA76", "date": "August 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18560563, "likes": {"liked": "— Best beds", "disliked": "— We loved everything!"}}, {"rating": 4.0, "title": "Right in the middle of everything", "text": "The hotel was awesome. I mentioned we were on our honeymoon and despite using Priceline, they upgraded our room to a king size room on the 5th floor. We saw signs for the on-going construction, and unless you were at the hotel during the day, you probably wouldn't notice it.", "user": "Clarkvara", "date": "July 13, 2008", "id": 17855093}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The room was probably one of the nicest we've ever stayed at. The bed was one of the plushest beds we'd seen. It was so comfortable, we regretted not staying in this city and in this hotel for longer. The bathroom was also very nice and the bathrobes were an excellent touch to the hotel.", "title": "Nice Rooms, but lacked common ammendities", "user": "NoodleDaddy", "date": "July 8, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 1.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 17660251, "likes": {"liked": "— Location & cleanliness", "disliked": "— Inferior Room Service"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "One nice service the hotel offers is a free private car service to local locations between 8am and 3pm (I believe those are the hours). We used the service once, waited for about 10 minutes and they dropped us off at the correct location. The driver was friendly and knowledgeable.", "title": "Nob Hill Star", "helpfulness": 1, "user": "jannielb", "date": "June 20, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 17090746, "likes": {"liked": "— The Staff", "disliked": "— Charges for internet access"}}, {"rating": 4.0, "title": "Was a good stay", "text": "We used the concierge to help us find a post office to mail a few items home before making our trip to the middle of the Pacific. They were accurate in telling us there was a post office, but failed to tell us that the location was for pickup only. We had to walk another 6-7 blocks to another post office. (Luckily, there wasn't a hill to climb, or I'd be pissed) I would rate the service average at best.", "helpfulness": 1, "user": "AnaesDoc", "date": "June 19, 2008", "id": 17049305}, {"rating": 1.0, "title": "Terrible bed and snotty staff.", "text": "The offer of free coffee certainly does not balance out the horrid mattress, or the snotty front desk staff. We booked a room with a king-sized bed but discovered that we had been put in a room with a queen-sized bed. When we inquired, we were told that the hotel \"considers\" a \"request\" for bed size but that they can't guarantee such a request unless the hotel guarantees bed size at the time the reservation is made. In other words, you have to even know to ask for such a guarantee. Talk about double talk. There was no attempt at an apology from the counter person or the manager. It was like talking to a wall. Their attitude was bad enough -- but the bed was absolutely horrid. And I'm not talking size -- I'm talking the absence of even minimal comfort. My husband and I rolled toward a depression in the middle of the bed, and it felt as if the bed had no padding whatsoever. It was so hard that my hip bones ached the next morning. The only difference between the bed and the floor would have been that, if we had slept on the floor, we wouldn't have rolled together. We didn't ask for or expect much of a view, but the windows opened to a dark alley and a view of the moldy wall of the building across the alleyway. The towel heater would have been a nice touch -- if it worked. But the absence of a fan in the bathroom was not offset by the nonfunctional towel heater, or the tiny robes offered for guest's use. No, the room wasn't outrageously expensive (although parking was). The room and the bed were just not acceptable. I've had better rest at a Holiday Inn.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "January 31, 2005", "id": 3102835}, {"rating": 4.0, "stay_parameters": "Stayed September 2004", "text": "We stayed at the Renaissance Stanford Court for three nights in September 2004. The service was excellent and the staff members were all helpful and friendly. We loved the location, close to public transportation and also close enough to walk to several attractions. Our room was very comfortable, quiet and peaceful and we loved the little luxuries of turndown service and morning tea delivered to our door.", "title": "Great hotel and service", "helpfulness": 3, "user": "greenberry", "date": "January 31, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3102094}, {"rating": 5.0, "title": "A real treat!", "text": "On our next visit to San Francisco, we will definitely stay here again!", "helpfulness": 3, "user": "ATourist2day", "date": "January 24, 2005", "id": 3060264}, {"rating": 4.0, "title": "Good room, pleasant service", "text": "I stayed 3 nights in a fantastic room overlooking California street. The service was great! The staff was very pleasant. Considering that the posted room rate was $250 a night, I am shocked to read some of the comments other writers has left especially considering they paid around $80. Parking in the city is expensive at ALL hotels. I cannot believe some complained about it when their room was so highly discounted. I really enjoyed that the valet would have my rental car ready at a moments call. But with two criss-crossing cable car lines just outside the hotel door it was seldom used. It was nice to come back after sight seeing to find the beds turned down and a robe layed out. Such nice little touches that I didn't recieve when staying at other more expensive hotel. I suggest you give them a try.", "helpfulness": 2, "user": "charlotte32", "date": "January 11, 2005", "id": 3000802}, {"rating": 4.0, "title": "great christmas stay 12/22 - 12/30", "text": "I was worried about the type of room and service we would receive as we booked the hotel through Priceline for 48 GBP per night and previous reviewers expressed that staff at the hotel weren't very nice if you went through priceline; but I was pleasantly surprised. We stayed from Jan 5th to Jan 7th. The staff at the desk were very nice and not snobbish at all, and we had a good room, perhaps not what everyone would expect form a four star hotel but it had all the amenities we needed, it was clean, and a good size. I would recommend staying there, it's also in a great location.", "helpfulness": 2, "user": "lufiboo2000", "date": "January 7, 2005", "id": 2986805}, {"rating": 5.0, "title": "Updating \"a classic\" -- very nicely done", "text": "Booked via Marriott.com and got a price quite a bit lower than the super-luxe hotels in the Financial District and/or the high-end tourist hotels on Russian Hill or Union Square. Interestingly, the location of the Stanford Court is just as good, as it is essentially within a 5~10 minute walk of all of these points!.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "March 18, 2008", "id": 14361958}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "This is an older building, built around a courtyard, without the 40 stories that offer spectacular views of the Bay or Telegraph Hill, but it is 2nd to none regarding location, appointments, convenience and service. Biggest test in these older buildings are the bathrooms and the \"corner\" areas -- bottom line, they passed. The property has been nicely updated and all the modern amenities are in place.", "title": "Great hotel, and good location to explore.", "user": "what_beach_next", "date": "March 15, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14305883, "likes": {"liked": "— Everything!", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": ".", "title": "Wonderful Hotel", "helpfulness": 2, "user": "littlegirl1229", "date": "February 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 13948250, "likes": {"liked": "— location", "disliked": "— cost"}}, {"rating": 4.0, "title": "Loved the Standford Court!", "text": "In very few cases, I say this, but I would DEFINITELY seek and attempt to stay in the Stanford Court on my next trip to San Francisco.", "helpfulness": 1, "user": "DianneTahoe", "date": "February 12, 2008", "id": 13493317}, {"rating": 2.0, "title": "Not as good as expected from a Marriott", "text": ".", "helpfulness": 2, "user": "Coolmover", "date": "January 22, 2008", "id": 12883542}, {"rating": 2.0, "stay_parameters": "Stayed May 2005, traveled on business", "text": "The Good: Very courteous staff; new, comfortable mattresses; complimentary Town Car available; free coffee/beverages delivered at your door in the AM; great tourist location.", "title": "Past Its Prime", "helpfulness": 6, "user": "Criticaltraveller", "date": "June 6, 2005", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 3534737}, {"rating": 3.0, "stay_parameters": "Stayed May 2005, traveled on business", "text": "The Bad: Old 1970's furniture; noisy rooms on lower floors facing the street (cable cars and other street traffic all night); small TV's; dark small rooms facing the inside courtyard where it's quiet; slow elevators.", "title": "A little tired", "helpfulness": 6, "user": "ljnative", "date": "May 25, 2005", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 3499260}, {"rating": 4.0, "stay_parameters": "Stayed May 2005, traveled on business", "text": "The Deal Breaker: I reserved a junior suite and requested a high floor. I was given a room on the 2nd floor facing the street. I asked politely and reasonably to be moved to a quieter location, was given a much smaller room facing the inside courtyard. This was not what I wanted or what I was willing (and prepared) to pay for. I would gladly have paid a premium price to have had a junior suite on a high floor which is what I reserved. The front desk clerk told me that they were sold out and there were no junior suites on higher floors available. [My reservation had been made 4 weeks prior to my arrival and I am Marriott Platinum Elite]", "title": "Bad situation turns into KUDOS for Stanford Court", "helpfulness": 9, "user": "Travillez", "date": "May 7, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3447824}, {"rating": 2.0, "stay_parameters": "Stayed August 2004", "text": "I left after one night, cutting short my stay, and chose to stay at the Omni instead. Too bad, because the restaurant at The Stanford Court is very good, especially breakfast.", "title": "Great location, dirty, old room", "helpfulness": 9, "user": "angelasmom", "date": "May 5, 2005", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "service": 2.0}, "id": 3440180}, {"rating": 4.0, "stay_parameters": "Stayed January 2005", "text": "I stayed here on business for one night. The location is great, right in front of the cable car line which takes you to the Embarcadero, Union Square, Fisherman's Wharf, North Beach or Chinatown in just a few minutes. It's a good spot for tourists, but not so great for business. It was pretty quiet during the week and I had the definite impression that the hotel has seen better days. The furniture was dated and worn, the fixtures were old and the lobby and public areas look dated. That being said, the customer service was fine and they have FANTASTIC feather beds with Frette linens. The bed was the best thing about the place. If it were shined up a bit and had a little more bustle it would have been great. Given a choice I would stay at the St. Francis or the Fairmont over this place, but it was certainly ok if you can get a priceline deal or similar.", "title": "Nice Weekend Place to Stay", "helpfulness": 6, "user": "Macsog6", "date": "April 4, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 3328044}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "We had a wonderful stay at the Stanford Court this weekend. We found the staff to be unfailingly courteous and extremely helpful. Our room was spacious. We thoroughly enjoyed our complimentary hot coffee and cocoa. We booked the hotel with Priceline and NEVER had a negative response from the hotel staff (as some prior reviews noted).", "title": "Had a Great Stay", "helpfulness": 9, "user": "LG803", "date": "April 4, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3326578}, {"rating": 4.0, "title": "Great Hotel!", "text": "Summary: very pleasant stay, would definitely book there again, great location, fantastic staff", "helpfulness": 8, "user": "A TripAdvisor user", "date": "March 25, 2005", "id": 3300947}, {"rating": 5.0, "stay_parameters": "Stayed March 2005, traveled on business", "text": "I stayed at the Stanford Court in March 05 and had a great time. The location is great within walking distance to Union Square and Chinatown and we even walked to Fishermans's Wharf ( 18 blocks). The cable car stops right in front of the hotel. The hotel itself was very nice, rooms are fine although some might be a little small. Try to get a room facing the courtyard less noisy. The complimentary coffee, tea or hot chocolate with your wake-up call is a very nice touch. The staff is very friendly and helpful. I wouldn't hesitate to stay here again next time I visit San Francisco.", "title": "Great Location! Great Price! Superb Staff!", "helpfulness": 5, "user": "bill2242", "date": "March 24, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3299265}, {"rating": 1.0, "stay_parameters": "Stayed March 2005", "text": "I just got back from a six-night stay at the Stanford Court. I was totally pleased with the hotel. The rate was great...$170/night. I also stayed on the eighth floor and did not detect any odors whatsoever. The room (also interior facing) was more than adequate...with nice touches such as gym equipment brought to your room if you did not want to go to the fitness center. But what impressed me most was the staff. They were consistently and uniformly wonderful. It seemed that no favor was too big to ask of the staff and that they really wanted to make sure that you enjoyed your stay.", "title": "The pits", "helpfulness": 6, "user": "Dawn31", "date": "March 17, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 3283122}, {"rating": 4.0, "title": "A nice hotel in a great location", "text": "Was the room the biggest room I ever stayed in? No. Is the hotel the most deluxe hotel in San Francisco? No. But it was extremely comfortable and I would not hesitate to stay there again and would strongly recommend it to others. The ONLY problem I encountered was with the shower. It reminded me of the shower in my college dorm...anytime somebody flushed the commode in another room, the pressure would noticeably drop. Other than that, I truly enjoyed my stay there.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "March 16, 2005", "id": 3278573}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "Stayed here for 5 nights on a business trip in December 2009. The hotel is at the top of Nob Hill, about 5 blocks from the downtown shopping area of San Francisco.", "title": "Good hotel, great location, a little pricey", "user": "Paulo1179", "date": "December 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 51096553}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Checking it was a tad slow, but got there in the end. The decor in the corridors is a tad outdated, but the room I found excellent, small but modern and functional.", "title": "Nice location, comfortable room, but a little noisy", "user": "jongable", "date": "November 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 49977911}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The web access was very very very slow though and priced at $14.99 per day....", "title": "Small rooms but excellent value for the price we paid", "user": "MoreTravels", "date": "November 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 49939622}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Breakfast was excellent, if not a little overpriced. The meeting room we had was excellent, service was good, but again it was expensive.", "title": "Top of the Hill in more than one way!", "user": "3437", "date": "November 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 49918193}, {"rating": 2.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "All in all, a good stay.", "title": "A Big Disappointment", "user": "Montecito1", "date": "November 21, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 2.0}, "id": 49784112}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "the first room I was given was claustrophobic and garish, decorated in shades of gold, gray and black. When I requested an upgrade, the desk clerk went out of her way to acommodate me. The new room was much larger, more tastefully deocrated and had a nice view of downtown.", "title": "Can't say much about the first room but the service was outstanding!", "user": "Shreveportspoon", "date": "November 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 2.0}, "id": 49712408}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "During my stay, the staff always did more than I expected. Room service arrived in 10 minutes and they called to make sure the order was correct and if I needed anyone else. One night we requested a taxi to go to dinner and the hotel provided their town car for the trip. The waiter in the bar remembered me from the night before and also remembered my preferred drink. The hotel operator was friendly and helpful whenever I called.", "title": "Outdated", "user": "cpanyc007", "date": "November 19, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 3.0}, "id": 49539057}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "It feels that they need to hire few designers to put this place together. It is outdated, despite to the fact that the restaurant and the lounge were recently remodelled. Rooms are clean, few things here and there have to be either replaced or repaired.", "title": "Loved This Hotel", "user": "CelesteD", "date": "November 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48918309}, {"rating": 4.0, "stay_parameters": "Stayed April 2009", "text": "Restaurant is terrible. Items are overpriced and simply are not the best.", "title": "Great Nob Hill Views of the Bay", "helpfulness": 1, "user": "DC_World_Traveler", "date": "October 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 47039656}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Be prepared that vallet parking attendants tend to adjust your seat, wheel and mirrors for some reason, even though the drive is several yards from the hotel to the garage.", "title": "A good choice...", "user": "Tania_EU", "date": "October 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 46611266}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We stayed at the Stanford Court, for 5 nights in August. The first of the three centred holiday (moving on to Vegas and then Longbeach, LA). We had a fabulaous welcome at the hotel - nothing was too much trouble. Our room was situated on the 4th floor / corner room. It was spacious, comfortable (especially the beds), and clean, with pretty good views. It was rated by our travel agent as a 4*, which seems a pretty fair reflection. The breakfast buffet was the only thing to let the hotel down. But we'd highly recommend ordering from the breakfast menu, which was slightly more costly, but everything is made to order. The lemon souffle pancakes with raspberries were fantastic! We found the location of the hotel to be very convenient, especially as the cable car line runs directly outside the entrance. The most economical way to travel, is to buy a MUNI passport (which can be bought at the information desk at the airport - $24 per person, for a 1 week pass). When you add up the cost of every 'single' trip cable car ticket costing $5, the passport was exceptional value. It can be used without limit on ANY of the Muni transport around the city i.e. - cable cars/ electric trams/ trolley buses/ & 'bendy' buses. We found these passports invaluable, and we hardly used taxis nor the hotel limo service, (which is provided on a first come first serve basis). Despite public transport being very accessible, if you've never been to the city before, be prepared to do a lot of walking (so comfortable, flat shoes are a must). We loved the city, and plan to go back one day, and would stay in the Stanford Court once again, without hesitation.", "title": "Looking forward to the next visit!", "helpfulness": 2, "user": "MAGS-Llanelli", "date": "October 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10035393}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "we stayed here on the second leg of our honeymoon from august 5th for one week.", "title": "Not 5 stars", "helpfulness": 1, "user": "Mrs-U", "date": "September 29, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 1.0, "cleanliness": 2.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 10017939, "likes": {"liked": "— location", "disliked": "— overpriced bar and food, shower too low for 6ft tall and over"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "Our brochure stated that it is a 5* hotel - i would disagree with this, the recption was nice but the corridors were dull and in need of sprucing up.", "title": "Great place to stay", "helpfulness": 1, "user": "bilti", "date": "September 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8739010, "likes": {"liked": "— location", "disliked": "— nothing to dislike"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "our room was ok, but the shower was too low on the wall to use properly and it cannot be moved. the bathroom was grubby too and badly lit. We were not impressed with the cleaners service either. No fridge in room. Bed and pillows gave us really bad neck and back ache.", "title": "Fab Stanford Court", "helpfulness": 1, "user": "Nush7", "date": "September 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8675136, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled solo", "text": "The bar prices were high and the food was extremley high priced so we never tried it. it was quite difficult to find places to eat close to the hotel. Mainly we went to fishermans wharf or union square.", "title": "Great Choice, Great Hotel", "helpfulness": 2, "user": "Mid_West_Traveler", "date": "September 5, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8659784}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "I just got back from a four day trip to San Francisco for business. I was pleasantly surprised by the wonderful service and great location of this hotel. From the time we got there, the service was super. I needed an extra chair for my room so my colleague and I could work on a project, it was brought to me within 10 minutes. The breakfast was served with a refreshing fruit smoothie taster and we were sent on our way for the day with a granola bar. When we arrived back at the hotel at the end of a long work day, we were greeted with a glass of cold champagne. I had some trouble with the internet and it was immediately removed from my bill. We rarely had to wait for a taxi as the valet fetched one as soon as we asked for it. The turndown service with bottled water and chocolates was also a welcome touch. The location is so central, you could walk or cable car wherever you needed to go.", "title": "Super location in the heart of town", "user": "didntwinthelotto", "date": "June 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 16777140, "likes": {"liked": "— location, service, food, ammentities", "disliked": "— cable car noise"}}, {"rating": 4.0, "title": "Good Find / Great Deal", "text": "I would definitely stay here again!", "user": "BWinDallas", "date": "May 20, 2008", "id": 16261261}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled solo", "text": "The Stanford Court is perfectly located directly on the cable car route between Market Street, North Beach, Fisherman's Wharf, whatever you need. The Top of the Mark club is virtually next door, and my wife and I loved the the cheesy yet playful Tonga Room across the street. The staff was more than accommodating and they never failed to go above the call of duty. The lobby is under reconstruction as this is written, and hopefully, the rooms will be updated as well. All in all, we will definitely stay here on our next visit.", "title": "Posh piece of Nob Hill", "helpfulness": 1, "user": "ElleSheri", "date": "May 12, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 3.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15973020, "likes": {"liked": "— The classy ambience", "disliked": "— Busy concierge"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "I love this hotel..It's regal, five star , posh ambience is surprisingly wonderful. It is located perfectly on top of nob hill amongst the other wonderful hotels... just minutes down the hill to china town, union square.... and if you love your walk, you could even reach fisherman's wharf in no time at all!", "title": "A San Francisco Classic", "user": "AnonymousTravelerUsa", "date": "April 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14927307, "likes": {"liked": "— Location, comfort, service"}}, {"rating": 4.0, "title": "Lovely Hotel, great view", "text": "The room was fabulous! Extremely large considering it is in a city like SF... the furniture was absolutely classy! Yup, this place is class all the way.. I absolutely love the retro elegance of the bathroom....", "user": "pekingeserescue", "date": "March 23, 2008", "id": 14474761}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "I like the location although that hill is steep. We asked for and got a nice view from our room. I booked this through a Priceline auction and we got a great deal so some of the little things didn't bug me. They are doing construction on the hotel so the drive up entrance was not available. The concierge floor wasn't available. However, the dishwasher in one of the room being worked on released some steam which caused the fire alarms to go off at 1AM and a total hotel evacuation. This was then compounded with a locked exit stairwell which had there really been a fire would have been a disaster. They just don't quite have it all together there yet.", "title": "Other than the fire drill at 1AM-- it was good.", "user": "Luv2TravelNJ15", "date": "October 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 46426919}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "I stayed here August 22, I was in the city with friends for my birthday celebration. I made my reservation online and specified a King room for 3 guests, checked off that I would need extra towels and a rollaway. Also specified that we would be a later check in.", "title": "Nice Hotel, Disappointing service", "helpfulness": 1, "user": "1801First", "date": "October 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 46308037}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "When I got to the hotel, I was told that all the rollaways were already being used for the evening...even though I requested one specificaly at the time of reservation and they knew we were arriving late. Why wasn't one placed in my room?? The rooms are nicely decorated and modern, but VERY small and my \"king\" bed, looked more like a Queen. And there were no extra towels like I asked for. Not exactly a conducive situation for 3 people! It was also very noisy and I didn't sleep well at all. At about 6am it sounded like someone was moving big garbage cans around outside! I know the city is generally noisy but a hotel like this should invest in double pane windows to drown out some of the noise, it was bad.", "title": "What a pleasure.", "user": "ErinCulling", "date": "October 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46266502}, {"rating": 5.0, "title": "San Francisco Adventure", "text": "Breakfast in the restaurant was decent but nothing to write home about, and the service was very slow, even though the restaurant wasn't even half full. The location is good on Nob Hill, but I would think twice before returning to this hotel.", "helpfulness": 1, "user": "RoseyMorrisCounty_NJ", "date": "October 8, 2009", "id": 46214440}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "An excellent location on Nob Hill at the \"top\" of the city with easy public transportation access to all areas. The intersection right outside has two cable car lines or you can enjoy a nice steep walk downhill to SoMa or the Embarcadero/Pier 39. A definite plus for little kids to see the cable cars going by all the time. And there is a great little park a block down for enjoying a newspaper by the fountain or letting the kids play. The staff couldn't have been more genuinely friendly and helpful - from the valets to front desk to housekeeping. Love the recent redecoration of the rooms with comfy beds, large tv and extra table and chair. You can't beat the gratis \"extras\" - cozy robes, in room refrigerator, coffee and hot chocolate delivered to your door at the time of your wake up call. It would be nice to have a real dresser so we could unpack more thoroughly, a gym and pool on the property and of course SF overnight parking fee is steep, but those are things we can overlook considering the wonderful, welcoming and relaxing atmosphere offered by Stanford Court. We'll be back!", "title": "Nice hotel with beautiful rooms and helpful staff", "user": "Dawn G", "date": "October 7, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 46126829}, {"rating": 4.0, "title": "Great Classic SF Hotel", "text": "I pricelined my reservation for a rate of $70, which was a steal. This is the second time I stayed at this hotel, and I was glad to stay there again. The location is great--right in the heart of Nob Hill. If you are interested in riding the cable cars, two lines run right outside the front of the hotel. If you are a runner like me, you will be rewarded with a nice downhill run to the Bay and challenged with a tough uphill run back to the hotel. Take Jones street for a real workout...", "user": "havanahipster", "date": "July 1, 2007", "id": 8032839}, {"rating": 4.0, "title": "Amazing experience!!!", "text": "The decor is old/classic style. The rooms are fairly spacious. But the beds are OUTSTANDING. The beds have down pillows, featherbeds, and down comforters that are way better than Westin Heavenly beds. The bathrooms have marble vanities.", "user": "valsgirl", "date": "June 27, 2007", "id": 8003263}, {"rating": 5.0, "title": "Lovely neighborhood", "text": "Insider tip: Make sure you place a wake-up call (whether you need one or not). All wake-up calls receive a pot of coffee, hot chocolate, or tea delivered to your front door. Nice touch.", "user": "shario", "date": "June 24, 2007", "id": 7975714}, {"rating": 5.0, "title": "Perfect Stay", "text": "We have just returned from a week in San Fransisco at the Renaissance Stanford Court Hotel. What an amazing week! I have never been treated so much like royalty. From the moment we arrived, until we checked out we had a great experience.", "user": "Jabeka", "date": "June 20, 2007", "id": 7953660}, {"rating": 4.0, "title": "Not a bad place to stay", "text": "We could never describe how amazing our \"personal concierge\" was at assisting us in every little detail. He pointed us in the right direction, made arrangements for us to get there, and made sure we had a good time afterwards. That was a personal touch I have never had at any other hotel.", "user": "Lisa18", "date": "June 18, 2007", "id": 7927545}, {"rating": 3.0, "title": "only ok", "text": "DECOR: This hotel is done in an understated traditional style with Asian influences and antiques. I really like the hotel's style. I disagree with other reviewers that this hotel is dated. I think of it as well preserved and in my opinion, in a very good and charming way. It's like going to my rich aunt's house in the 1960's. The furnishings are, at first glance, not remarkable. Upon further inspection, however, you're forced to admit that while not flashy, everything is tastefully done and of high quality.", "user": "ostrichhh", "date": "August 19, 2007", "id": 8451858}, {"rating": 3.0, "title": "Nightmare for group travel", "text": "ROOM: I had deluxe bay view room one night and an executive king room the last two nights. Both rooms were wonderful. I'm not sure I'd pay the additional cost for the executive king, though. It did have a very comfortable couch, however. I love the featherbeds placed over the mattress - - great sleeping and lounging. Oh, the down pillows and duvet were very comfortable. I like the color scheme: teal carpet, cream walls, blue upholstery, crystal lamps, floral drapes, and Asian accents. My room was spacious, quiet, clean, and comfortable. I also liked the marble bathroom. It had a large vanity and closet. The airconditioning worked very well and kept my room comfortable.", "user": "loves2travel101", "date": "August 2, 2007", "id": 8281078}, {"rating": 5.0, "title": "Great location & service", "text": "SERVICE: Very good. Staff here is not as friendly as some of the other hotels I stay at, but they're never rude and are always helpful.", "user": "tripchick29", "date": "July 26, 2007", "id": 8235563}, {"rating": 4.0, "title": "Great Introduction to San Francisco", "text": "FITNESS CENTER: The hotel has a nice fitness center with great equipment. Most of the machines have individual TVs on them although I don't think headphones are provided - - so bring your own.", "user": "jo_no_anne", "date": "July 3, 2007", "id": 8051786}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We recently stayed in this hotel for three nights and it was great despite the renovations going on in the lobby. The renovations are suppose to be finished at the end of Sept/08.", "title": "San Francisco Treat", "helpfulness": 4, "user": "Brklynrider", "date": "September 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 19861221, "likes": {"liked": "— Great staff and location", "disliked": "— $51/day parking"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "POSITIVES = 1 -great rooms. Recently remodeled and have a lot of nice touches to them. Everything from the elaborate carpet design in the hallways to the leather headboard for the beds. Very nice touches to detail throughout the rooms. Plus, turndown service at night was great with the classical music left on as we entered the room each night. Very nice.", "title": "Under renovatoin", "helpfulness": 3, "user": "burchard", "date": "August 31, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 19575174}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "2- Hotel Property. I am a Marriott Gold Member and this is by far the nicest of the Marriott properties in SF. I visited the other two Marriotts and they both looked very corporate/business hotels. This hotel has charm and personality. The Fisherman's Wharf Marriott looked like a dump actually.", "title": "Love this place.", "helpfulness": 1, "user": "txlitig8or", "date": "August 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 19491228, "likes": {"liked": "— The room.", "disliked": "— The valet situation."}}, {"rating": 2.0, "title": "trolly car bells ALL THE TIME!", "text": "3- Staff. They were very friendly, remembered us in the lobby and every day at breakfast. Offered us bottled water upon check in. Gave us a better room with a better view. Smiles and greetings throughout our stay.", "user": "hastababy", "date": "August 25, 2008", "id": 19354119}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "4- Location - Nobb hill, like some of the reviewers have posted is a bit of a steep incline, but being from NYC we are use to walking so it wasn't a big deal for us. The hotel is in prime location otherwise.", "title": "High on the hill!", "helpfulness": 1, "user": "bethany63", "date": "August 20, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 19176737, "likes": {"liked": "— Area", "disliked": "— The disruption of the renovations"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "As a member of the Ritz Carlton club, I will freely admit I am a hotel SNOB. When we found ourselves unexpectedly in need of a hotel on New Year's eve and NOT wanting to further blow the budget, we booked this hotel ....one day shy of the big holiday. We stayed in a standard king room and I can't tell you how pleasantly surprised we were by the beautiful updated, fresh decor, cleanliness and soft music welcoming us upon our entrance to the room. It was so inviting, spacious and surprisingly quiet, even on New year's eve....although we did select a room WITHOUT a city view which faces an interior courtyard which i would recommend for any light sleepers. The only downside was the location on top of the Powell cable line hill on California Street....not for the faint of heart!", "title": "VERY picky traveler LOVED this hotel", "user": "cttravelgal", "date": "January 2, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 52377923}, {"rating": 5.0, "title": "Cool and fun!", "text": "Loved this hotel.", "user": "blaecpoodle", "date": "January 1, 2010", "id": 52317966}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Room was spacious, spotless and so comfortable.", "title": "Great staff", "user": "Arcadia_R", "date": "December 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 52185638}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Staff were friendly, engaging and efficient. They organised dinner, bags, transfers, cabs and check in and out in minutes.", "title": "beautiful hotel....minus the carpets - and no wake-up call!!!!!", "user": "Londonrevue", "date": "December 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 52109623}, {"rating": 5.0, "title": "Hands down - my favorite Marriott affiliated property in SF", "text": "The touchscreen maps in the lobby were great.", "helpfulness": 1, "user": "KimKDallas", "date": "December 28, 2009", "id": 52024171}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "The rooms have been recently renovated. However the room I had was very small with no closet or dresser space. There was a place to hang your clothes in the bathroom! View looked onto a courtyard that was very depressing. A large flag blocked the light into the room with a strobe effect in the late afternoon. I slipped and fell in the bath tub taking a shower and was unable to get a bath mat.", "title": "small room with a terrible view", "user": "DrTomPls", "date": "August 14, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 18961667, "likes": {"liked": "— Location", "disliked": "— size of rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The staff seemed nice but I had little interaction with them. I was there for a meeting. Facilities were adequate.", "title": "Comfortable at Stanford Court", "helpfulness": 2, "user": "kmc2", "date": "August 11, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 18847020, "likes": {"liked": "— Comfort/Price", "disliked": "— Few ammenities in room (no ice machine, charge for internet, no gym or pool, etc.)"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "I do like Marriott and stay at Marriott when I can. I am afraid if this is what they are aiming their renovations at in this property they have missed the mark. I would stay elsewhere if I was to return for a conference.", "title": "Renovations were bothersome, but beautiful", "helpfulness": 2, "user": "Magg1ema3", "date": "August 10, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 18817368, "likes": {"liked": "— Newly refurbished", "disliked": "— Small rooms, no dresser or mini-bar, no hotel lounge"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "I booked three rooms for three nights for our family get-together in San Fransciso. Everyone really enjoyed comfy, clean rooms and the price was very reasonable on Priceline. All three rooms were newly renovated on the upper floors! Free champagn in the Lobby on Thursday evening welcomed us to the hotel - very nice. The concierge was fabulous! We had trouble getting reservations to The Slanted Door - a restaurant that was highly recommended to us. The concierge was able to book our reservations like magic. The concierge continued to be our best friend throughout the weekend. The hotel is undergoing renovations but we were only disturbed by noise on late Friday afternoon. Everything was quiet over the weekend. This is a nice location with easy access to public transportation. The trolleys were very crowded most of the time but well worth the wait to back to the hotel...as it's a very steep walk from almost any direction! We had breakfast at the hotel one morning and it was pleasant and delicious - although the service was a bit slow. We did have difficulty keeping ice in the room with no ice machine available. Room service would bring ice - but it usually took awhile. We took the hotel limo to SFO airport for a very reasonable price. Overall a very nice weekend!", "title": "\"Less than Stellar\"", "user": "sdavis3908", "date": "August 6, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 18685037, "likes": {"liked": "— Location", "disliked": "— Lack of service"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We stayed here for 4 nights with our two sons. The staff is very professional and usually friendly and helpful. The layout of the hotel is a little strange and it was undergoing extensive renovations, so I'm not sure we saw it all.", "title": "Just Fantastic", "user": "toandfrotraveller", "date": "August 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18664782, "likes": {"liked": "— The loactiona and staff, new renovations.", "disliked": "— not a thing"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "We had two rooms for two nights at the Stanford Court. The rooms were booked approximately 6 months in advance with a request for two rooms together on a high floor (as the trip was to celebrate my Father’s 70th Birthday – so we wanted it to be special).", "title": "Not good", "helpfulness": 2, "user": "airedale_travellers", "date": "June 2, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 7740238, "likes": {"liked": "— Location", "disliked": "— The service"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "When we arrived we were told our rooms were not yet ready as the previous guests (Virgin airline staff had a late check-out arrangement) – therefore we had to wait in reception for the rooms to come free (great for the people in the rooms but not good for us). After about 45 minutes one room came free, so my parents moved into that one.", "title": "They were so good to us", "helpfulness": 2, "user": "B_Pope", "date": "May 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7715467, "likes": {"liked": "— Hotel staff--friendly and attentive.", "disliked": "— I never like parking in the city."}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "A further 45 minutes later our room became available – but the rooms were neither together or on a high floor (one was on floor 2 and one on 3).", "title": "dissapointing", "user": "oresh", "date": "May 28, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 4.0, "location": 5.0, "value": 4.0, "rooms": 1.0}, "id": 7707982, "likes": {"liked": "— The lobby was very nice", "disliked": "— The room was very small and plain"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The room we were allocated was right at street level (due the hilly disposition of SF!) therefore it had no view and was very noisy.", "title": "Great Hotel!", "helpfulness": 1, "user": "walruslady", "date": "May 23, 2007", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7682147, "likes": {"liked": "— The location is fantastic, and the staff friendly and helpful."}}, {"rating": 5.0, "title": "I loved it", "text": "We queried this with the desk and they basically said that there were no other rooms – after further discussion they gave us one new room on the 7th Floor - this was classed as a ‘Parlour Suite’ – little did we realise that this meant two uncomfortable nights on a sofa bed in a room that never seemed to get warm.", "user": "debbi1998", "date": "May 19, 2007", "id": 7645154}, {"rating": 4.0, "title": "Very good hotel in a great location", "text": "We booked the Rennaisance hotel through priceline for a price of $90 per night. I wanted to celebrate my wife's birthday by spending a weekend in San Francisco. Considering the location and ameneties, the price that we paid was incredible! However the downside (from a cost perspective) is the ridiculously expensive parking charges - $46/day (including taxes). But given the prices for parking in the city ($30~$50/24-hour period) there may be no way to avoid this - unless of course you arrive using public transport!", "user": "bullman99", "date": "October 3, 2007", "id": 10036860}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "We recently stayed at the Stanford Court on Nob Hill in San Francisco. It has just undergone a major renovation. Unfortunately the rooms are extremely small and the closet is in the bathroom. We were unable to get breakfast at the hotel and our TV didn't work most of one day -all we got was excuses. This hotel does not now live up to its old reputation for excellence. There are many good hotels in San Francisco and this is not one of them. The Stanford Court has 4 star prices and 2 star service.", "title": "Overrated Stanford Court", "helpfulness": 2, "user": "62redtag", "date": "October 1, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 3.0}, "id": 20532962, "likes": {"liked": "— Nothing", "disliked": "— Size of room and service"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We stayed for 2 nights here at the end of a west coast road trip. The hotel is undergoing some renovations to its lobby area, i would have like to see it in its 'full glory' once complete, but didn't bother us really - we were out most of the day.", "title": "great location - great rooms", "helpfulness": 1, "user": "D28", "date": "September 28, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20439037, "likes": {"liked": "— The rooms", "disliked": "— Building work - but this wasnt a major problem and will be finisihed soon!"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "the room we had must have been one that had been updated recently. it was lovely... the best of our 2 week trip. we cant believe what good value we go it for (booked before we went through tour operator). it had a lovely big bathroom, and the bed was big and comfy. we asked to be on the road side overlooking the street. you can hear the trams going past but this didn't bother us.", "title": "Stay somewhere else-", "helpfulness": 2, "user": "bun44", "date": "September 15, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 20087150, "likes": {"liked": "— bed was OK", "disliked": "— front desk, not clean, lobby area"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008", "text": "we didn't use any of the other services at the hotel, apart from the concierge (helpful), so cant comment on these.", "title": "Under construction...", "user": "OrbExplorer", "date": "September 14, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 20075468}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "location wise it was great - right at the stop for the trams. before we got the hang of them though we did do a couple of trips up and down the hill which was not a good idea!!!! my calf muscles didnt recover for a few days!!", "title": "A Very Friendly Place to Stay", "helpfulness": 3, "user": "ankh1", "date": "September 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19898503, "likes": {"liked": "— Nothing", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We stayed at this hotel for a weekend in September 2006 and absolutely loved it. This is probably one of the best hotels that I have stayed at in San Francisco, and I loved the location of the Hotel, as well. Me and my then fiance were in town for our anniversary and the staff was very nice and friendly, asking why we were in town, and when told that it was for anniversary they assigned us to a very nice corner room on their top floor. Our view was awesome! The room was immaculate. Very large, spotless, and with great amenities. We ordered room service and it was and delicious. I would definitely recommend this to people coming into town on a romantic getaway!", "title": "Lovely weekend at Standford Court Renaissance", "user": "Spillthemoment", "date": "April 29, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7481935, "likes": {"liked": "— location and quality of service and product"}}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 4, "variance": {"poor": 49, "average": 140, "very good": 438, "terrible": 26, "excellent": 424}, "aka": "Renaissance Stanford Court Hotel", "slim_ranking": 0.263829787234, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Stanford Court San Francisco is fresh, fashionable and at the center of everything savvy visitors want to see and do. Enjoy sweeping views of the city, the bay and the majestic Golden Gate Bridge from our convenient location atop historic Nob Hill. Discover the best of San Francisco's charm and character while enjoying our contemporary boutique hotel as your home base.An ideal location, we are conveniently situated in Nob Hill close to premier shopping, dining, and attractions in Union Square. We are steps to the historic cable cars, a short walk to Chinatown, Fisherman's Wharf, Union Square and the Ferry Building.393 newly-renovated rooms and suites, offering cool, contemporary accommodations. Three cable car lines running directly in front of the hotel, waiting to whisk you to San Francisco’s hottest neighborhoods and landmarks"}