{"user_rating": 4.5, "review_count": 686, "name": "Stanwell House Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We stayed over at Stanwell House Hotel for my wifes 40th birthday with our 2 year old daughter and had booked a four poster room. The hotel itself is very nice and the room was well presented, well decorated and very clean and looked the perfect choice, until night time. The room we had been put in was above the bar and restaurant so we had to endure noise from downstairs all evening. Obviously this upset our daughters sleep so we all ended up with a very bad night’s sleep. I don’t know whether the staff were expecting us to have had a bad night or not, but not one of them asked if we had slept well, not even on checking out. I filled in the comments card in the room detailing what had happened on our stay but have not even received a courtesy call or email to follow up my comments.", "title": "Lovely hotel, but avoid room 23", "helpfulness": 2, "user": "adethomp", "date": "July 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 166147876}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "The website misled me into believing we were going somewhere a bit special. The reality was quite a disappointment. Our twin room was very pokey with the narrowest beds I have ever encountered. The 'dog friendly' room was so small we had to push one bed in front of the garden door to make room for our lab to sleep on the floor. No room for a dog bed. The interior design had the feeling of an executive style estate house whose owner believed B&Q homewares to be the cutting edge of chic.The service was a bit hit and miss. Language barriers made ordering white wine in the bar a tricky proposition reminiscent of foreign holidays of yesteryear! Only the breakfast waitress seemed to have English as a first language. All in all, not a 'boutique' experience. More travelodge with a Changing Rooms style makeover.", "title": "Avoid room 6", "user": "DrogoBrighton", "date": "June 28, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 165576529}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We visited Lymington and we always try to eat/drink in as many places we can when away.", "title": "This is based only on the bar", "helpfulness": 1, "user": "MOJONO1", "date": "June 11, 2013", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 2.0}, "id": 163677672}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We did stay here nor eat here, only have drinks.", "title": "Characterful and Comfortable", "helpfulness": 1, "user": "Philwil69", "date": "June 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 163505995}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We went in early one evening on our way to a reservation at another restaurant.", "title": "Don't stay in a garden suite unless you like dogs", "user": "Betty N", "date": "June 7, 2013", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 163242873}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "stayed here quite a few times very consistent staff great,breakfast great all round nice place give it a try.nice walk down to harbour from hotel,some nice pubs local.Good base to travel around new forest.", "title": "great hotel in great town", "user": "gary o", "date": "May 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 160173711}, {"rating": 1.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We popped into Stanwell House Hotel this morning for breakfast, having sat in the conservatory area for 20 minutes and been ignored by the older waitress we decided to leave and take our business elsewhere. We often stay in dog friendly hotels and accommodation and were potentially going to book a stay here. But a non existent welcome, and lack of staff put us off. ( I even poked my head into the other part of the dining area but alas not a soul to be found or a friendly face.", "title": "Disappointing Service", "helpfulness": 3, "user": "AnnieMcy", "date": "May 8, 2013", "detail_rating": {"cleanliness": 3.0, "service": 1.0}, "id": 160052698}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "We have just had the most wonderful day at our daughter's wedding reception. Stanwell House made the event truly memorable, the service was impeccable, the meal delicious and we loved the way everything just seemed to \"happen\" as & when it should, it appeared effortless but we do appreciate that an awful lot of hard work was going on behind the scenes and we were all very impressed with the hotel's extremely high standards and the friendliness of all the staff. Breakfast was amazing - as was our suite (once again, lovely squashy, soft pillows!)", "title": "Wedding reception!", "user": "Cat223", "date": "May 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159769340}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "Will be calling in to see them all again when next in Lymington.", "title": "Fab afternoon tea!", "user": "Mollycoddle3", "date": "April 28, 2013", "detail_rating": {"cleanliness": 5.0, "location": 5.0}, "id": 159061865}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "Celebrated mums 80th birthday on Sunday afternoon for afternoon tea-lovely food, attentive service but discreet. Fabulous!!!", "title": "My favourite hotel ever, the most dog friendly you'll stay in!", "user": "cattyniccy", "date": "April 26, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 158870594}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We booked for a sunday night in late April 2013. This was done directly with the hotel because it was the same price as the cheapest 'third-party' internet sites except that breakfast was included. When we arrived the receptionist was on the phone taking a booking but immediately (and very professionally) acknowledged us. Check-in was quick and easy and we were made to feel welcome (they enquired about our journey etc in a very genuine manner).", "title": "A real 'find' in a lovely place", "user": "minskyuk", "date": "May 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 161861382}, {"rating": 4.0, "stay_parameters": "Stayed May 2013", "text": "We had been booked into a Georgian Double room but were upgraded to a suite (photos are below). We were shown up to the room and given all the requisite information about breakfast etc. The room was of a very high standard (as was the extremely large bathroom with roll-top bath and 'rainforest' shower). Being a suite, there was a small 'ante-room' with a large flat-screen tv and sofa, a main bedroom (with another flat-screen tv) and the bathroom.", "title": "Characterful town centre stay", "helpfulness": 1, "user": "Taylersons", "date": "May 26, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 161859401}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "All the rooms were spotless. I have not stayed at the Dorchester but have been into one of their rooms to visit and the standard of cleanliness was very similar at Stanwell House. The staff were friendly and approachable without being over-familiar. Parking is offered a short walk away (behind the buildings across the road). This is important if you're driving in Lymington as it can get quite busy.", "title": "We will return to Stanwell House again and again.", "user": "Alex V", "date": "May 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161422328}, {"rating": 2.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "We wanted to eat out locally and the staff recommended 'The King's Head Inn' which is just down the road. It's a very characterful place and is obviously popular - and the food was very good. Back at Stanwell House the bed was very comfortable and we were not disturbed by any noise during the night. In the morning breakfast is offered in a lovely room with views of the garden. Choice is of continental or cooked breakfast and this of a good standard with plenty on offer. Check-out was easy and efficient.", "title": "Very Disappointing lunch", "helpfulness": 2, "user": "CazWr", "date": "May 20, 2013", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 161274543}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "I would return to Stanwell House Hotel...in fact I'm about to re-book and I'm looking forward to it.", "title": "Marvellous weekend break", "user": "wefstag", "date": "May 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 160183047}, {"rating": 4.0, "stay_parameters": "Stayed May 2013", "text": "My partner and I travelled here for a close friend of mines wedding. Knowing the area and my friends tastes I was expecting grwat things and it didnt disappoint. The civil service was lovely, informal and friendly as it could be and not robotic at all. Luckily for us the weather held off for the photos and a lovely pimms reception. I feel we were squashed in a little into the ceremony room and the garden and that capacity isn't really at what the hotel claims. The food was lovely; though the fish cake lacked that real fish taste abd mayonnaise tho nice tasted like normal mayo not truffle. The two mains were duck and beef which were both lovely. Veggies were a little too al dente as if they were hurried to the table. Service was a little slow and muddled, not knowing where to put what meal and dishing out in a random order not by table meaning people were waiting. One lot of veggies came out half way thru the meal which I found bizarre. Puddings were lovely, good choice of tea, and the venue seenes very helpful with allowing a personaliseddtouch. Having two rooms plus the outside space was nice, though thwre needs to be air con in them, it waa roasting during dinner, let alone when people were dancing. Evening buffet was lovely, bar waa too expensive although i was impressed that the left over I wine from dinner was put out for people to help themselves. We didn't stay so I cant comment on breakfast or the rooms but overall it was a lovely day.", "title": "What a wonderful wedding day", "user": "Ssparkle123", "date": "May 31, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 162535843}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "We had a lovely few days at Stanwell House. We were attending a relatives wedding there so booked some extra days to make it a nice break. All the staff we met were very accommodating and ensured we had everything we needed. It is centrally located in the town and close to the railway and bus stations. We stayed in a Garden Room Suite which was spacious and light. Only downside is lack of parking available as the hotel car park can only accommodate around 8 cars.", "title": "A lovely few days", "user": "Fanofspas", "date": "May 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 162526688}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Four Ladies Who Walk thoroughly enjoyed their stay in this centrally located, lovely hotel. Two of the rooms were fabulous, and the other two OK but smaller and somewhat oppressively red. Marilyn at reception happily showed us what else was available and we swapped those two for larger, lighter rooms on the other side. Coffees, teas and hot chocolates were delicious and served with delectable home-made biscuits and, later, more-ish pistachio fudge. Dinner was excellent, but be aware that if you take the 'dinner included' option you might be better off a la carte, particularly if you don't want all courses. Breakfast was plentiful and good quality. The staff were exemplary. A suggestion for improvement is the ability to lock the bedroom door from the inside. Ensure you get instructions on the parking, as it's hard to find. Now I know where it is, I'll come again!", "title": "Simply Lovely", "user": "celloconcert", "date": "May 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 162321115}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Having been here for lunch with my husband and being very impressed we then booked to come with a few friends the following week. Both meals were excellent and the service was friendly and efficient. We are locals and in comparison with the chain restaurants on the High Street - well there was no comparison! Also our meal and the wine was actually less expensive and so much better.", "title": "A LOVELY LUNCH & EXCELLENT SERVICE", "user": "Mandi S S", "date": "May 29, 2013", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 162319289}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We will be bringing our summer visitors here this year!", "title": "The most amazing boutique hotel and restaurant", "helpfulness": 2, "user": "PaulDRSouthampton", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 162202845}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 43, "average": 58, "very good": 153, "terrible": 18, "excellent": 414}, "aka": "Stanwell Hotel Lymington", "slim_ranking": 0.166666666667, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Stanwell House is a cosmopolitan and stylish boutique hotel situated at the heart of Lymington, near the New Forest in Hampshire. As part of your stay at Stanwell House you can be sure you will enjoy a warm welcome and superb stay complimented by fine dining and sumptuous wines at our cocktail bar, bistro and seafood restaurant whilst absorbing the relaxed and tranquil ambience, ideal of all the family."}