{"user_rating": 4.5, "review_count": 855, "name": "Starhotels Anderson", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We chose the Starhotels Anderson due to its proximity to the Central Station. We took a morning train from Venice, spent the afternoon and evening in Milan, stayed the night, and then headed the next morning to Switzerland. We enjoyed seeing the Last Supper and visiting the Duomo. However, I don't feel any need to head to Milan again, unless it again serves as an essential place to change trains. Milan seemed to have a more business-centered, efficient culture than other cities we visited in Italy. While I expect this is important for the city's economic well-being, it's not as much fun for a tourist.", "title": "Just fine", "user": "NC_Rambler", "date": "August 23, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "location": 3.0, "service": 3.0}, "id": 173732130}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "It is important to understand that this hotel is located next to the train station, but the station is not in the center of the city. There is a convenient Metro, but we preferred to walk. If you plan to spend several nights in Milan, it probably would be better to stay in a more central location.", "title": "Convenient location, nice room, good service, great value", "helpfulness": 1, "user": "SeamasterFrance", "date": "August 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 172972305}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "The exterior of the hotel is a pretty basic dark box, but the interior has a contemporary feel. When you enter the hotel, you have to go down the stairs to get to the lobby. Reception was efficient but not particularly warm or friendly.", "title": "Loved our stay!", "helpfulness": 1, "user": "Benanza", "date": "August 15, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 172419364}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We were able to check-in early--an unexpected plus--but the room smelled smoky, even though (I think) it is a non-smoking hotel. The decor appeared recently re-done and generally nice. However, while it looked modern and clean, it also somehow appeared inexpensive and with more of an emphasis on trend than comfort. The bathroom appeared very nice, with stone tiles and counters. However, the glass divider in the shower was ineffective, and we used most of our towels drying the floor.", "title": "Amazing service", "user": "Michael C", "date": "August 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 172252412}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We recently stayed 2 nights here on vacation. Came and left via train, so loved the location right next to the Central Station (as you come out the front of the station, it's to the left -- the police working at the station did not know this?!). Also saw lots of airport buses leaving the station so it would be super-convenient for anyone needing to go to the airport. Bought a metro pass and went the quick 4 stations or so to city center (Duomo) for sightseeing. Beware scammers in subway. Room was nice and quiet, with double windows, could open the outer one just slightly to get a read on the weather. Bathroom was spacious with good toiletries. Breakfast downstairs was included and was OK. Liked the cappuccino and croissants. The scrambled eggs were so-so, and the chopped hotdogs were room temperature and not so good. Other offerings include yogurt, cheeses, cereals, juices, pastries. Would stay here again, upon checkout they offered to keep our luggage. We didn't need that, but if we did, would have avoided long queues in the rail station to do the same.", "title": "Nice leisure stay, quiet property", "user": "steptravel", "date": "September 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 178565807}, {"rating": 4.0, "stay_parameters": "Stayed September 2013", "text": "I have stayed here several times on business but recently came with several others for a leisure weekend. This hotel holds up very well on both counts.", "title": "Great hotel for business or weekends, perfect location, helpful staff", "user": "SimSP1", "date": "September 14, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 177101377}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Positives: front desk staff are fantastic! Helpful with travel plans, calling restaurants and taxis and have great suggestions and generally very friendly and professional. Rooms are a good size, very well equipped and appointed. Higher floors are better so that you don't get the rumbling from the train station nearby. Beds are very comfortable and choice of pillows is good. Breakfast is good and nice wide choice - must mention the fantastic staff in the breakfast room - very attentive! Concierge staff, especially the man from Mauritius, were very helpful and efficient.", "title": "A quality hotel in convenient location", "user": "Roadstercrv", "date": "September 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 176318926}, {"rating": 4.0, "stay_parameters": "Stayed September 2013", "text": "Negatives: there aren't that many but the things that could be a mild hindrance for me staying again were - the long flight of stairs to access the hotel lobby from the main entrance was difficult for high heels and older people (though I'm sure they have alternative access as we saw a wheelchair bound guest being catered for very well). Also, there was no plug by the bed, so couldn't have my phone next to me. Dinner menu prices were in keeping with that of a good restaurant but too expensive for a hotel of that size. Really didn't like MTV on the screens in the bar area - didn't feel very sophisticated. Also, I wouldn't say that this is a good romance hotel as the rooms not very intimate like the Westin for example.", "title": "Great boutique hotel with lovely staff", "user": "Stephtheaussie", "date": "September 7, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 176212906}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "However, we needed to access the station a lot over the weekend and the convenient location can not be beaten. Just a short walk at the end of the day and flipping down onto the hugely comfortable bed!", "title": "Deceptive appearance", "user": "AndyA43", "date": "September 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 175378476}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "We needed to stay close to Milano Centrale overnight to be able to catch an early morning Malpensa Express to the airport. Having researched all possible options, we’re so glad to have chosen this hotel. It’s so close, you don’t even bother looking at the map – just find the Piazza Luigi di Savoia exit and walk across the carpark and there you are! The airport shuttle buses are literally within spitting distance. The metro is also close by, so despite checking in late afternoon we still managed to visit the Castello and the Duomo that day.", "title": "Great value railway hotel option with an upmarket feel", "user": "geckopoo", "date": "September 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 175197595}, {"rating": 4.0, "stay_parameters": "Stayed August 2013", "text": "Railway hotels tend to be cramped, old and daggy, relying on a captive market of tourists needing to be close to the train station for one reason or another. Well, Starhotels Anderson is not just an average railway hotel. This hotel is modern and spacious, very efficiently run and seems to have an upmarket feel all over. From the outside the building is unremarkable but who cares about hotel architecture? We were pleasantly surprised, however, at how quiet and peaceful it was once you are inside the hotel – and what a sanctuary from the hustle and bustle of Milanese traffic! Also pleasantly surprised at how reasonable the rates were for the quality of accommodation available. We stayed on the 9th floor, the room was clean, spacious, well appointed, very comfortable bed, big window looking over the city (not much of a view though but it was fun watching the lightning preceding the thunderstorm that evening). You can set the aircon to a pleasant temperature of your liking. Oh and there’s a bathtub in the bathroom (one must not assume that this is standard issue in Italian hotels). I didn’t mind not having free wifi in our room, I just got a couple of complimentary vouchers from reception – I used my first hour in the lobby, the 2nd in the breakfast room. And breakfast, well, it’s generous and the staff were friendly. By the way, the lift is rather funky - lots of mirrors and lights - an experience in itself.", "title": "very good value chic hotel near centrale station little away from centre", "helpfulness": 2, "user": "AjayKDubai", "date": "August 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 174534876}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "I don’t think I would stay more than 2 nights in this hotel, as there must be better options closer to the centre, but for what we needed it for, it was perfect! If I had to stay overnight in Milan again, I would not hesitate to book this hotel once more.", "title": "Nice room no restaurant, shower leaked all over the bathroom floor.", "user": "SydneyBaxter", "date": "August 27, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 174288713}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Likes: value for money, clean and comfy room, modern décor, efficient (but not officious) staff", "title": "Four stars in name only.", "user": "Chris J", "date": "August 27, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 174284845}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Dislike: stairs from street level to the lobby, not really ideal when one has heavy luggage, even a ramp would have been useful", "title": "Perfect for an overnight stay!", "user": "Tophillgreen", "date": "August 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174276498}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "This place is exactly what you'd expect of a hotel located near the central train station. Convenient, clean, not pretty on the outside but who cares if the bed is comfortable. There are a number of good restaurants close by but avoid those closest to the station as they are just nasty. Walking around the area at night and during the day is fine mind you we were back in the hotel by 11pm each night so I can't vouch after midnight. Depending on your level of fitness you may find the major attractions a bit further away than you hoped but the metro is easy to use, cheap and safe. We're not fitness fanatics but we happily took our time and walked to all the attractions including the Science museum. The bed is comfortable, the room clean. There are coffee / tea facilities. We stayed in a deluxe room so we probably had more breathing space. The internet is fast and included. Breakfast was variable and could have been avoided. you could hear the rumble of trains occasionally but it wasn't unbearable and I honestly thought it was a loud car stereo with the windows up at first. It's perfect for the convenience factor.", "title": "good location near the station but you can hear the trains occasionally", "helpfulness": 1, "user": "Ree21", "date": "August 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 172128047}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "I was a bit disappointed at the exterior view of the hotel, but inside, it was super nice. Very clean room (slightly small though). No free wifi in the room, but free wifi in the lobby area. Decent breakfast. Location was super convenient (literally across from Milan Central Station- on the side where you get on/off the shuttle bus to Malpensa Airport). About 10-15 Min walk to Corso Buenos Aires. Friendly staff. Area inside/near Central Station can be shady, so be careful. Nothing very dangerous, but apparently lots of pick pockets. I was tense when buying subway ticket since several people insisted that they help me (I had to push one guy away). I also stayed at Hotel Berna a few days later. Both were excellent, but if you want the room to be more \"slick\", stay here. Hotel Berna offered free wifi, free minibar (about 5 non-alcoholic drinks). Breakfast at both places were adequate.", "title": "Very nice place (if you must stay near the Central Station)", "helpfulness": 1, "user": "KSC75", "date": "August 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 171818735}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Nice hotel right next to the central railway station. The hotel is much nicer from the inside than one would expect by the outlook. The reception area is one floor downstairs from the street level, but the friendly staff was was helpful with our luggage. We had a beautiful and well equipped room. Wifi costs 6 euros per night. The breakfast room was quite small and it was a bit crowed. The buffet was excellent - best bacon and scrambled eggs on our Italy roadtrip! Air condition was excellent.", "title": "Excellent hotel", "user": "Anders_Faldo", "date": "August 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171166026}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "With city temperatures hitting 39 degrees, Milan in late July was almost unbearable, however Starhotel Anderson made our trip as comfortable as was physically possible!", "title": "A cool oasis in the middle of scorching Milano!", "user": "Mary-Lee-Slade", "date": "August 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 171021389}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The location of the hotel is great for exploring the city - directly across from Milano Centrale and the metro stop - however, at the height of summer, you'll soon discover that underground travel without air conditioning is horrendous to say the least!", "title": "Close to main station", "user": "LuckyCountry15", "date": "August 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 170546024}], "location": {"country": "Italy", "region": "Lombardy", "continent": "Europe", "city": "Milan"}, "stars": 4, "variance": {"poor": 19, "average": 68, "very good": 395, "terrible": 9, "excellent": 364}, "aka": "Starhotels Anderson Hotel", "slim_ranking": 0.0875576036866, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "The Starhotels Anderson Hotel in Milan is located near the city centre, directly opposite the Centrale Train Station. True to its location, our 4 star hotel in Milan has a metropolitan lounge atmosphere and is a landmark hotel for the Italian fashion industry.Staying here means it's easy for you to reach the historical centre and explore the most exclusive shops and Galleria, fashionable spots and the Navigli. The Starhotels Anderson in Milan features 106 contemporary rooms and suites, 4 conference rooms for up to a total of 70 people. Our Fitness Room is open 24 hours a day."}