{"user_rating": 4.5, "review_count": 282, "name": "Station House Hotel Letterkenny", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "This is our second stay at the Station House Hotel and once again we had a super short break. The location is great and very central to shops, cinema, threatre etc.as well as a good base for touring Donegal. Our room was very comfortable with modern bathroom with shower - pity there was no bath! my only negative point. The food was delicious and service excellent and the staff were very friendly. Overall great value for money and we would definitely come back again.", "title": "Great hotel and location", "helpfulness": 2, "user": "paulinefay", "date": "February 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 125038407}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "...with sincere apologies to the previous reviewer, my wife and I held our joint 50th birthday party on Saturday night.....sorry if we kept you awake.", "title": "Great night....", "helpfulness": 3, "user": "CiaranCunningham", "date": "February 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124590101}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We had a superb experience at the Station House. The room, meal, staff...and the music (our band, not the hotels fault if it was too loud) The hotel also supplied the cake for our evening free of charge, one of the many touches which all added up to a great evening.", "title": "Really nice room, shame about the noise", "helpfulness": 1, "user": "MissC32", "date": "February 13, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 124539045}, {"rating": 4.0, "stay_parameters": "Stayed February 2012", "text": "Thanks to the staff, especially Tracey who was so helpful and went out of her way to make it a special evening. Will definitely be back.....well before our 60th, when we won't be so noisy. ;)", "title": "Great value and location", "helpfulness": 1, "user": "donegallucky", "date": "February 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 124409088}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "We stayed on a Saturday night. The room (on the first floor) was gorgeous, really modern and nice and the furnishings were very comfortable. The only problem we encountered was the music coming from downstairs, which sounded like it was right next door. We werent sure if it was a one off party or a regular thing, but it was so incredibly loud that even with headphones in and my ipod turned fully up you couldnt drown out the noise. We called reception who advised that the band would finish at 1am, and offered to move us temporarily upstairs into a twin-bed room. At this stage it was almost midnight, and we doubted that it would be any quieter upstairs, so we stayed put. Thankfully it did end on time and we slept well the rest of the night.", "title": "Great new years eve", "helpfulness": 1, "user": "traveller173", "date": "February 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 124175640}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "I was not overly impressed with this hotel. Our bedroom was quite small and had a fit-out bathroom with a step up into it. The noise was incredible, as the street below was busy with cars, and being the summer, we had the windows open because of the heat. I found the breakfast a bit on the poor side. There was a poor selection of food, and especially the sausages were shrivelled up from sitting there for so long. On the plus side, we had lunch in the bar before we left, and we both thought our food was lovely, and good value. There was a small underground car park and parking was free. Overall I felt this hotel was too close to the road, and noisy as a result, so we will probably stay elsewhere the next time", "title": "Bring your earplugs", "user": "BurstYourBubble", "date": "July 6, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 2.0}, "id": 133574647}, {"rating": 4.0, "stay_parameters": "Stayed June 2012", "text": "We arrived to a wet and windy letterkenny. Greeted by a very friendly lady at reception. First impressions, clean bright and", "title": "So close to perfect!!!!!", "helpfulness": 2, "user": "amandaandtony", "date": "June 24, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 132644465}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "modern. we had a room on the third floor . Overall, a good size room with a large bed. While the room was clean, the wall beside the bed could have been wiped down, it was scuffed and stained. The mirrors, both in the bathroom and in the bedroom needed cleaning..... They just needed a quick spray of glass cleaner . The lightshade on the lamp in the corner of the room needs to be replaced . It was damaged , and looks bad when the lights on. The bathroom was modern and very clean.", "title": "Lovely stay", "user": "lyn102", "date": "June 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 132527606}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We had a meal in the restaurant on our first evening, as part of the two night stay. The meal was delicious . Starters and mains couldnt be faulted. Desserts were a little disappointing .... My husband had banoffee with maltesers, while it tasted fine, presentation lacked . I had pavlova, I was surprised after the fine meal we'd been served to find tinned fruit cocktail left on the plate beside a square of meringue, with raspberry sauce squished on top . A child could have made it. . When the young lady returned with our coffee she asked if everything was ok, I told her I was surprised to see the standard of dessert. Surely a bit of fresh fruit wouldn't be to much to ask for. She took my plate and returned a few minutes later with a five star dessert. A similar piece of meringue had a side of frsh fruit raspberry coulis and cream, with fresh strawberries. After the fabulous meal, the desserts just need tweaking.... Very tasty excellent value for money.", "title": "Golf break", "user": "george q", "date": "June 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 132244887}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We had breakfast next morning at around 9.30. As it was Tuesday morning we arrived down to an empty dining room. Only one other guest: Juices and milk were left out in jugs. Unfortunately both were room temperature, as breakfast started at 7. Chilled would have been nicer. Perhaps as there was so little guests and three service staff it could have been served to us fresh. Cereals were in individual boxes. There was crumbs all over the ttable in the area of the bowls... Again with so much staff on would it have been difficult to keep cleared away??? No place to leave the empty boxes other than in the way of the next guest. We had cereal with milk that was sitting on the counter long enough to be warm, accompanied by warm juice... We then proceeded to the hot food area. Were there was bacon sausages pudding hash browns beans mushrooms and tomatoes . All left out for self service.....They must have been there since 7, all exposed with no covers , they were all dried out and crispy and hard. The beans had a hard scum on the top. The bacon sausages and pudding could hardly be cut they were totally uneatable. We were served tea in a chipped tea pot. Surely with so little guests to cater for breakfast could have been cooked as required and not left too spoil for hours. We left without saying anything , but it left me dreading breakfast on the following morning. On returning to the hotel in the evening we had a few drinks in the bar. Again the staff were great super efficient and friendly . Day two and breakfast was surprisingly different. Same friendly greeting from the staff. Same warm juice. We had to ask for milk which was brought fresh and chilled to the table. The cooked food was so much better as it was covered with lids, at least it wasn't dried out.", "title": "Recommended", "user": "tighoriain", "date": "June 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 131802730}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "My husband and I stayed here for 4 nights as part of a Newmarket tour of Donegal and The Giant's Causeway. We found the hotel to be very comfortable. The staff are helpful and friendly and go the extra mile. Nothing is too much trouble for them. They are all hard working and efficient and none of them stand around chatting. The meals we discovered are excellent value compared with other restaurants in the town. My sculptured fruit salad was a work of art and reminded me of the food we ate on a cruise to Norway 3 years ago. Everything was beautifully presented and the portions were huge! I felt my waistband tightening towards the end of our 4 day stay. The rooms were very clean and modern with laminated floors, comfortable furniture and a king size bed. The bathroom was state of the art with a wet room type shower. Toiletries were of a high standard but these were not replaces daily;. However, when I asked for extra toiletries this wasn't a problem and additional ones were provided. The staff are rightly proud of their Trip Advisor rating, which is displayed in the reception area. In my opinion it is rightly deserved. You get the impression that the staff work as a team and identify with the hotel, which is not always the case in all hotels. It was nice to see the owner also working hard over the busy Easter weekend in the restaurant and bar. The fact that so many local residents frequent the hotel on a Sunday night when entertainment in the form of a singer is provided and dancing takes place is a tribute to this hotel. Well done Station House!", "title": "True Irish hospitality", "helpfulness": 4, "user": "BarbaraEverest", "date": "April 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 128015399}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "Good food, great rooms that are spacious and clean. Staff are fantastic.", "title": "A warm welcome awaits you", "helpfulness": 2, "user": "paleail", "date": "March 31, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 127010365}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Visited Station House and really liked the staff, the food, the bedroom and the value for money!", "title": "Overnight stay", "helpfulness": 1, "user": "artosullivan", "date": "March 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 126896360}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "very central hotel .Price was great for B&B. Staff very friendly, if a bit young.", "title": "great location, nice hotel", "user": "wheelieWoo", "date": "March 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 126895876}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Breakfast not amazing but at the price we paid, there were no complaints. All nightspots within a short walk.", "title": "Trip to Letterkenny", "user": "RuthMartin20", "date": "March 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126788386}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Stayed here on a three night stay and had booked a great deal of £85 for bed and breakfast! The girl on reception managed to find us a smoking room which turned out to be a large corner room with a huge picture window overlooking the street with view to the country. Room was large,very comfortable and clean. King size bed and bedding were excellent.", "title": "Great hotel", "helpfulness": 2, "user": "JiggyMac", "date": "March 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126696795}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Bathroom was more of a wet room and very impressive although toiletries were not replaced. Room safe was provided.", "title": "Comfortable", "helpfulness": 1, "user": "Keith_hp", "date": "March 12, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 125993995}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "Breakfast was fine although sausages were quite poor quality. But everything else was good. Plenty of tea, coffee and toast.", "title": "Lovely hotel", "helpfulness": 2, "user": "KarenMag", "date": "March 8, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 125804993}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "Hotel staff were excellent and very helpful. Five minute walk to town centre. Ample parking at rear of hotel.", "title": "Warm and friendly", "helpfulness": 1, "user": "ruthiey", "date": "March 7, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 125757953}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "I would stay again at this hotel without hesitation and highly recommend it.", "title": "sadly I have to leave", "helpfulness": 2, "user": "sharon189", "date": "March 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125584459}], "location": {"country": "Ireland", "continent": "Europe"}, "stars": 3, "variance": {"poor": 10, "average": 19, "very good": 76, "terrible": 12, "excellent": 165}, "aka": "Ramada Letterkenny", "slim_ranking": 0.230769230769, "description": "Professional family run boutique style hotel located in the heart of Letterkenny. Conveniently located within walking distance from the high street shopping area, theatre, multi screen cinema and all the culture and night life that makes Letterkenny such a delight. Offering year round entertainment, Letterkenny is the perfect base for exploring the diversity and magnificent beauty of County Donegal. We endeavour to provide you with an unforgettable stay, let our family take care of your family! We look forward to welcoming you soon..."}