{"user_rating": 4.5, "review_count": 2650, "name": "Staybridge Suites Times Square - New York City", "reviews": [{"rating": 5.0, "title": "Perfect hotel for our NYC trip!", "text": "We visited NYC for a girls' shopping trip over April break, and Staybridge Suites was the perfect hotel for our group! The hotel was clean and stylish, and we always felt very safe and comfortable. The front desk staff were extremely friendly and helpful! The hotel is centrally located near Times Square, and we enjoyed a short walk to the shops, restaurants and Rockefeller Plaza.", "user": "KLiz222", "date": "April 22, 2012", "id": 128363989}, {"rating": 5.0, "title": "Great Experience in NYC", "text": "Upon arriving at the Staybridge, we were pleasantly surprised by the evening reception - wine, beer, pop, chips, mini quiches and various hot appetizers - fantastic! We relaxed in the comfortable, spacious hotel lounge by the fireplace. This area also served as the morning breakfast room where we enjoyed eggs, sausage, toast, pastries, fruit, yogurt, coffee - the perfect start to each day. Overall, we thoroughly enjoyed our stay and would definitely choose Staybridge Suites for future trips to New York City.", "user": "Anne H", "date": "April 22, 2012", "id": 128353044}, {"rating": 5.0, "title": "Great hotel, friendly staff, good location - we got exactly what we wanted and expected", "text": "Just wanted to say what a beautiful Hotel the Staybridge Inn on Times Square is!! Our room had a wonderful view, and was always very clean. Easy access to entire city! Great breakfast, and happy hour during the week. And hats off to Jamie, Eddie. and Elliott for making our stay even more enjoyable.T hey were very friendly, and were very helpful and lots of fun!!! Your entire staff was great. Would recommend HIGHLY!!!", "user": "TheMorgans100", "date": "April 22, 2012", "id": 128340511}, {"rating": 4.0, "title": "Conveniently located and well suited alternative for a family break in NYC", "text": "Had a great 6 nights for our family of four. Staff were very friendly. Breakfast busy but fine and yes the lifts can take a few mins when busy but did not bother us. Within a couple of mins walk you're in the middle of many of the main sites. Tue to Thu you even get a free buffet and drinks. Would definitely return.", "user": "RobHod", "date": "April 22, 2012", "id": 128317393}, {"rating": 3.0, "title": "Reasonable location but overcrowded", "text": "You don't come to NYC to sleep! But a good hotel is important when the family has been running around the city all day long. The location close to 40th and 8th is convenient for all the main attractions that the city has to offer. Less than 5 minutes to Times Square and a 15 minute jog to and from Central Park. The hotel is located behind the central bus station and this does mean that there are some interesting characters on the street, but by and large, this was not an issue. The lobby is somewhat small and congested for a hotel of this size but the helpful staff do their best to relieve the congestion. The communal breakfast is a bit of a bunfight but we always managed to find a table for the family. The concierge is also very helpful assisting with booking restaurants, cars and attractions but she was not completely au fait with the details of booking a trip to Ellis Island. The free afternoon snacks, beers or soft drinks was a great boon. The rooms are not overly dimensioned but this is NYC! The beds were somewhat soft for our tastes but we slept fine. The rooms also benefited from ironing boards, fridge/freezer and washing machines. Beware that the rooms are not well soundproofed and many conversations and all energetic activity are subject to a public audience in the lobby! The main drawback concerns the lifts which are simply not adequate for a hotel of this size. We stayed on the 13th floor and were forced to use the stairs virtually every day. The longest wait was over 10 minutes at peak time. All in all we were very content with the Staybridge and are happy to recommend the hotel for a family break in NYC.", "user": "CB23", "date": "April 22, 2012", "id": 128313930}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "Second time staying there, and it will be our base in NYC from now on. Sure, it's in a great location - but so are lots of other hotels, some priced as well. What distinguishes Staybridge Suites is the experience itself - from the friendly staff, to the completely equipped rooms (full fridge, stovetop, micro, dishwasher, and fully stocked to enjoy anything you can imagine), to the full, tasty breakfast, to complete focus on customer service. Need to print out tickets? Go to their bank of computers, call up your email, hit 'print', and walk to the desk. No charge, and it's instant. Wifi is free. Rooms are kept clean and are very comfortable. Lobby is lively, with lots of international travellers. There's a complimentary 'light buffet', with wine and beer, Tuesday thru Thursday.", "title": "Central, friendly, lots of extras", "helpfulness": 2, "user": "ocanada1973", "date": "September 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140274683}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Special mention: Jamie is the guy who pushed it over the top in both friendliness and helpfulness the first time we stayed, and we were delighted to see him again this visit. Have him teach you the special hand-bump routine.", "title": "Another Fantastic Stay at Staybridge Times Square", "user": "samthefish06", "date": "September 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140208350}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "I decided to stay once again at Staybridge Times Square as my last stay was flawless and very enjoyable (review previously posted). As usual the staff were friendly, courteous, and professional. The facilities modern, sleek, clean, and the amenities more than ample. Wifi connection strong and without disruption. Another fantastic stay at Staybridge NY!", "title": "Better Than the expensive Ones", "user": "wallis_a", "date": "September 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140159269}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "This time around I had a room with 1 King bed rather than 2 Full sized beds. Having 1 bed felt roomier, while having the 2 Full sized beds felt a bit cramped. Great night of sleep, cannot hear the noise from the street or other rooms.", "title": "Excellent choice for a city break!", "user": "petrina_k", "date": "September 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139976042}, {"rating": 4.0, "stay_parameters": "Stayed September 2012", "text": "Some other reviewers have noted the rooms are not 'suites' - true, they are not suites in the sense of having multiple bedrooms and a sitting area at the penthouse. However, with the more than adequate kitchenette and full-sized fridge, it is a 'suite' in another sense of the word.", "title": "Nearly 5..", "helpfulness": 2, "user": "Sean T", "date": "September 9, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 139805938}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "I only have great things to say about this place. From the time that we checked in until the time that we left, we felt at Home. Dealing with the Hotel Staff was probably the best experience that I have ever had. When we walked in, we met Eddy. He was there to load our bags onto his cart and bring our bags to our rooms. He was in the lobby most of the time that we entered or left the hotel. He always was pleasant and talked to us about what we did or what our plans were. My family and I really liked that. Eddy was the Best. We also had the pleasure of dealing with Daniel who checked us in promptly and was very professional. I could go on and on about all of the staff. They always greeted us with smiles and asked if we needed anything. BEST STAFF EVER! The room was very, very comfortable. The cleaning staff was perfect. Having refrigerator, toaster, stove top, dish washer, etc. was fantastic. Who ever hired the People that work at this Hotel should be commended and so should everybody that works at this hotel. The breakfast and coffee were also great. In previous reviews, i read about the slow elevators. The elevators are not slow. As a matter of fact, there are very quick elevators. The problem lies with the people who push the both up and down buttons when they arrive at the elevators. DO NOT PUSH THE UP AND DOWN BUTTONS AT THE SAME TIME. THIS TAKE THE ELEVTOR TWICE AS MUCH TIME STOPPING AT EACH FLOOR THAT IS PUSH TWICE. If you are going up, push the \"up\" button. If you are going down, push the \"down\" button. This will cut the travel time of the elevator in half. So in closing, I would like to THANK all at the Staybridge for the wonderful stay. We will be back and highly recommend this place.", "title": "Excellent Stay", "helpfulness": 1, "user": "John K", "date": "April 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128622582}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "I had a very nice stay at this hotel. Staff are friendly and helpful. Our room was clean and the little kitchen was convenient. I found the bathroom and the small side but very clean which is more important.The bed was comfy. The free breakfast that is included is a plus since many hotels in NYC do not include one. It is not a huge breakfast but has hot and cold basics which is all you really need. I would stay here again and would recommend it. It is well situated. Turn right and you are in the theatre district/ time square and go left, you are in Hell's Kitchen area.", "title": "Impressed", "helpfulness": 1, "user": "MontrealGeorgia", "date": "April 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 128593941}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "We stayed at the Staybridge from the 8th tothe 18th April. We were just minutes away from Times Square. It was convenient because it was near where my husband was plced on a business trip, and as I was with him I was very close to all the attractions in the Big Apple. What was really good is how friendly the staff were and what pride they took to look after their guests and also their knowledge of the City. Very enthusisatic and knowledgable, particularly all the concierge statf I spoke to during my trip! They made me feel welcome -NYC can seem very daunting to me if I was going to be on my own for most of the day- but nothing was too much a problem. The staff were very patient.", "title": "Very friendly and comfortable stay", "user": "nlbl", "date": "April 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128533238}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The room was fine...appreciated the free ;laundry room and the kitchenette! And even the dishwasher was loaded and run for us. No problems with wifi or charging our iphones....this was provided!", "title": "Comfortable hotel in Manhattan", "user": "SwissChipmunks", "date": "April 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 3.0}, "id": 128506971}, {"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "All smiling friendly faces.", "title": "Best hotel experience. Period. Superior staff. Superior rooms. Exceeded expectations. Accomodating down to the very last detail", "helpfulness": 1, "user": "Kristen57", "date": "April 23, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 128476893}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Stayed 8-12 Sept and booked it based on Trip Adviser reviews and we were not disappointed. A great hotel with friendly staff especially the Reception and Bell Boys, nothing is too much trouble.", "title": "TOP CLASS HOTEL IN A GREAT LOCATION", "user": "Greg B", "date": "September 14, 2011", "detail_rating": {"value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 118130329}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Breakfasts were great and the free reception on the Thursday was very welcoming.", "title": "STAY HERE!", "helpfulness": 2, "user": "LOZ1217", "date": "September 14, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118117521}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Location is fantastic being 5 mins toTimes Square and central to all the main sites and good transport links.", "title": "Not as good as expected", "user": "padsar", "date": "September 14, 2011", "detail_rating": {"value": 4.0, "location": 3.0, "service": 5.0, "rooms": 3.0}, "id": 118099857}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "Area is very safe so dont be put off by people saying otherwise. Lifts were great all the time we were there.Our room was on 26th floor and could see Empire State Building.", "title": "Great Staff and Location", "helpfulness": 1, "user": "suzyqtrippin", "date": "September 13, 2011", "detail_rating": {"value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 118091757}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Rooms are very clean and beds you really can relax in. I cant fault anything in our visit and will return if i'm back in NY. I intend to tell any friends visiting to book it as you wont get better for the money. Thanks for making our stay so special and memorable.", "title": "Fantastic stay at the Staybridge in NYC!!", "helpfulness": 1, "user": "Sharon7211", "date": "September 13, 2011", "detail_rating": {"value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 118086592}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "It is rare that I say a hotel stay was excellent. However, I cannot think of anything negative during my two night stay at this hotel. The decor is very modern there is a lobby in the bar and a comfortable lounge/breakfast area. The hotel offers breakfast in the morning and a happy hour three nights a week that includes wine beer and food. The room was spacious enough and includes a full size refrigerator and dishwasher and a small microwave. The bed was beyond comfortable. Service at the front desk was incredibly pleasant. This was a nice contrast to the service I received the first time I stayed there a few years ago when it first opened. The only slight downside is that they allow pets. However, I recognize that's a plus for some. Nevertheless, I didn't see any while there this time. This is a worthwhile stay particular for those who are stayng several nights in the city and want to be in the middle of everything. The hotel is very near Port Authority and Time Square.", "title": "Comfortable, Convenient & Cute", "helpfulness": 1, "user": "2SunSisters", "date": "September 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140449387}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "This place was such a nice surprise! From the quick check-in ( and even w/ early check-in which can be unusual in NYC) to the nice,well outfitted room to the evening snack complete w/ free beer/ wine and hot bar and morning breakfast - just great service and an amazing value in the city. Our room had a very comfortable king sized bed and also had a full kitchen w/ fridge/ freezer ( and icemaker) + microwave and dishes/ utensils. Although we mainly ate out - it was nice to have plates/ glasses and ice for the few times we brought pizza and soda back to the room. Our TV had a problem the final night and a very nice maintenance person came and repaired it within minutes! Be aware - this hotel is across the street from the Port Authority - which is wonderful for access to the subway, but a bit unsavoury too. The parole board is a neighbor so there will be long outdoor lines of recent convicts on the block thruout the weekdays. Perhaps this is why the place is so economical for all it offers.", "title": "Clean/ quiet room/ amazing service at this price", "helpfulness": 1, "user": "sam86228", "date": "September 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 140443072}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Stayed with my husband and 2 teenage sons. Large room with full size fridge. Good location but several blocks walk to Times Square. Close to most attractions and you felt walking even after midnight. Great variety aft breakfast and staff were quick to clean areas when someone left. Very busy breakfast but worth the wait. Front desk staff were friendly and found a room to allow us early check in. I was unable to use my priority club points to book a room but would definitely stay again.", "title": "Large Rooms", "user": "Elizabeth J", "date": "September 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 140416382}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Just returned from a 3 night stay at Staybridge Suite. It was my girlfriend's first visit to NYC, but was my third. We were both thoroughly impressed by everything to do with hotel.", "title": "Great hotel.", "user": "Paul P", "date": "September 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140358021}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Great location, no issues with Parole office or bus station (even at night.) Felt safe walking past at all times.", "title": "great location, wonderful service, nice big room....excellent!", "user": "Dany D", "date": "September 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140338744}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We stayed at the Staybridge Times Square from July 27-30, 2010. This is a beautiful hotel. We were a family of 4 including 2 teenagers. The room size was good, beds were very comfortable and we really appreciated the kitchen facilities. The housekeeping was great, fresh fluffy towels and plenty of them every day. Free wi-fi in the rooms, teenagers really liked that. We really enjoyed the free breakfast buffet included with our stay. Breakfast included scrambled eggs, bacon, muffins, toast, cereal and even real Tropicana OJ. The breakfast buffet was constantly replenished and there was plenty of food at 9:30 even though the buffet finishes at 10:00. We didn't have too many encounters with the rest of the hotel staff but everyone is very friendly. We especially liked the doormen, Sunny and Jamie. Had a minor problem getting our car from the parking and Sunny stayed with us until our car was delivered and all of our bags were loaded. The parking lot associated with this hotel was very reasonably priced by NYC standards, only $24 per day. The only minor downside to this hotel is the location of the parole office down the street. There can be some shady characters around but there is a strong police presence. This is not the fault of the hotel. The port transit authority is across the street and it makes getting on the subway very easy. Times Square is just a few blocks away and really enjoyed seeing it lit up at night. Central Park is a good walk away but it's fun to people watch on your walk. We really enjoyed our stay and would definitely would stay at the Staybridge Times Square again!", "title": "Staybridge Suites-an excellent hotel for exploring NYC", "user": "ndgbird", "date": "August 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 74526224}, {"rating": 5.0, "title": "cannot say enough GOOD about this hotel", "text": "Stayed 2 nights--4 adults room (incl 2 teens). STAFF--outstanding!! Friendly, helpful, smiling, respond to all requests. ROOM-tight but highly efficiently organized. When we first walked in wondered how we would fit all our \"stuff\"--no problem. Trendy--very contemporary. Were on 22nd flr with decent views. COMP BREAKFAST & RECEPTION--complete and generous; food was good. You can likely skip dinner out-- the hors d'oeuvres are generous. LOCATION--1/2 block from subway, 1 1/2 from Times Square; quiet location, safe & plenty of restaurants nearby. Cannot wait to get back to NYC & stay at this hotel.", "user": "HWAYMI", "date": "August 9, 2010", "id": 74437193}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "I had the recent pleasure of staying at Staybridge Suites Times Square. The hotel is clean and fresh. But what made this stay superior to other hotels is the Staff. From the desk personnel to the bellmen/doormen to the concierge and even the maintenance personnel. In particular there were four that stood out above the rest. The night bellman Omar was the best. The day bellman Sunny was just as his name implies. The day bellman Joseph is nice and efficient. And the concierge Kim got me to every destination the most efficient way and added her suggestions to the trip that enhanced it tenfold. The rooms are very comfortable and clean.", "title": "Staff Was Awsome", "user": "lherwitz", "date": "August 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74421255}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "I booked this hotel as part of a package and was not really sure what I would be getting. At first, I was disappointed with the location: it was a little outside of the hub of Times Square. However, we all really liked the spot as the weekend unfolded. It is quiet, but everything is easily accessible. It is a little bit gritty, but we (2 women with their teenage daughters) always felt safe and comfortable. THE BEST pizza on the corner for $1.00 and a liquor store a few doors up. What more could you need? Room was very comfortable and we all slept well. Wait time for the elevator is minimal. Breakfast was crowded but good - a happy hour with appetizers and wine available during the week. Probably the best aspect of this hotel is the staff. Everyone is very gracious and friendly. (Thanks for your help Jaime:) Will stay here again!", "title": "Great Weekend at Staybridge", "user": "traveller4791", "date": "August 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 74364365}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We are travelling throughout the Summer and have to say that this hotel is amazing. The staff here are extremely helpful, caring and genuine. The location is just a short stroll from the main bus station in Times Square. Free wifi is awesome, breakfast varies daily, rooms very comfortable with large flatscreen tv's, fabulous air conditioning. We will return for sure. If you see Joy at reception please say hi from me.", "title": "This is your home away from home", "user": "tanduay999", "date": "August 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74044607}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "This was our first trip to NYC so we were a little apprehensive. We chose the Staybridge Suites Hotel as a result of reviews in Trip Advisor and we were not disappointed. It is in a great location within walking distance of Times Square and many of the sights we wanted to see. For sights too far to walk the \"Hop-ON-Hop-Off\" bus stops and public transport are very close. We felt very safe walking in this area, even when returning to the hotel close to midnight. When we checked in at night after a long flight the receptionist, Senada, was so cheerful, positive, and helpful that we felt \"at home\" immediately. The concierge recommended several restaurants within walking distance and the one we selected from her list was excellent. The hotel was VERY CLEAN - an important point for us. The breakfast buffet, which is included in the room rate, was good and the staff who looked after it kept the tables clean and the buffet dishes replenished. All of the hotel staff we met in the halls, elevators, etc. were very cheerful and seemed to enjoy their work and take pride in doing a good job. A unique feature for us was the FREE Happy Hour on Tuesday, Wednesday and Thursday from 5:30 to 7:00. It included beer, wine, cheese, crackers, chips and dip, and two or three hot items. We really enjoyed the opportunity to relax after a day of sightseeing and found that it was a great way to meet other tourists and share tips. The one negative for us - the hotel is very \"Pet Friendly\" - a problem for people like me who are allergic to animal hair.", "title": "Great NYC Location for Sightseeing and Theatre", "helpfulness": 5, "user": "Brynny2", "date": "May 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129147115}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "A group of us chose the Staybridge for 3 nights in April, 2012. It was our first time in New York, and the location is perfect for walking or using public transportation. We arrived on Amtrak at Penn Station (Madison Square Garden) and walked with our wheeled bags to the hotel, about 10 minutes. Getting around is easy. We caught the subway right across the street at the Port Authority. It's a five minute walk to Times Square, the Theater district, and good shopping near Macys in the other direction. We also walked to Central Park, but that was a bit far. The rooms are large and very clean, with a nice little kitchen that has a full size fridge, two burners, a microwave oven, a dishwasher, and all the cookware and dishware you need, even wine glasses! We didn't cook, but loved the fridge for keeping drinks and snacks cold, and the microwave for warming up leftovers. The free breakfast was delicious and so convenient before a big day on the town. We got an early start each day (7:00am) so were able to avoid waiting for breakfast or elevators. We never had to wait long for the elevators as others had.", "title": "Perfect location, super clean, and great price", "helpfulness": 1, "user": "molokaigirl808", "date": "April 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129055567}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We stayed here for two nights during our recent April vacation with our teen and tween daughters. This place is new, clean, and well located near Broadway. Staff are friendly and courteous, with special kudos to Sunny, a doorman who went out of his way to point out available elevators, help stow our bags so we could wander the city the second day after we checked out, and even had the courtesy to give us room keys to use the hotel bathrooms on our arrival to get our bags and our car. The deal that includes valet parking next door is also a very good value and convenient. As others have said, the rooms and bathrooms are a bit snug, but they are clean, the shower is beautiful, and the beds are comfortable. Having the kitchenette also is a big plus. The breakfast the next morning adds to the value. It is not the best breakfast we've ever had, but was solidly good, with either scrambled eggs or mini-omelets, a choice of breakfast meats, toast, muffins, etc.", "title": "Great NYC value for money", "helpfulness": 1, "user": "57Kid", "date": "April 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129030937}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "My partner and I stayed here for 4 nights in March. It was my first time in New York and the location was brilliant for exploring all the sights. Approximately 5 mins from Times Square on foot and ideal if you wanted to catch the metro at Port Authority. When the receptionist learnt that it was my first time in New York, he allocated us a room with a view of the Empire State building. We only ate breakfast once in the hotel, it was difficult to find a table, but the food was adequate and there was plenty of choice. The staff were always helpful and polite. The bar is a nice place to relax after an evening out and was never very busy whilst we were there. The room was big compared to some city hotels, and the kitchenette facilities were good and would suit a family wanting to do some cooking in the hotel. I would thoroughly recommend this hotel to anyone travelling to New York. Good value for money and well located.", "title": "Excellent Hotel", "user": "mandbennett", "date": "April 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128984376}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "OMG the seven of us were in complete awe of this establishment. Great rooms, great breakfast, great happy hour, just about \"great\" everything. I have read other reviews and any further comments on my part, would just be repetitious. We stayed for a week in New York and after each day's outing, we were always looking forward to returning to our apartments to unwind.", "title": "Stay at \"Staybridge\"", "helpfulness": 1, "user": "Brynny2", "date": "April 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128969447}, {"rating": 5.0, "title": "Great Property", "text": "What can I say that has not been said? The staff is friendly and more than eager to please. The breakfast is great, the rooms are very nice and clean, it is simply a SUPER property. We stayed here for 2 nights before our cruise and everyone (especially Sonny) went out of thier way to make us feel at home. Thanks to all of the wonderful staff!", "user": "daisy20071960", "date": "August 29, 2010", "id": 77405053}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "Great location!", "title": "Great Place with great peple!", "user": "coltrane9172", "date": "August 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77161231}, {"rating": 5.0, "stay_parameters": "Stayed August 2010", "text": "My wife and children just spent 4 nights at this outstanding hotel. The room was very clean with a great kitchen, comfortable beds and a great layout. The housekeeping staff did a fantastic job refreshing our room every day. The hotel is located within walking distance f sme of the cities best attractions including Times Square, 5th Avenue and the U.S.S. Intrepid museum. There are several parking garages on the street and the hotel offers discounted rates for parking at a few.", "title": "ideal location for time square but not too close to not get a good night sleep", "user": "alliemay57", "date": "August 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 77128080}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "The htel staff was outstanding. The front desk staff was very helpful and the bellhop, Jamie, went above and beyond on several occasions, yet was able to treat my 5 year old like she was the most important guest in the hotel! Thank you Staybridge for a great stay! See you all again!", "title": "Great staff, great value & great location", "user": "Paul_UKNortheast", "date": "August 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76652685}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "having just returned from nyc this hotel is in an ideal spot you wouldnt think that by the street", "title": "Excellent hotel, very helpful staff", "user": "Laurasdad", "date": "August 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 76629929}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "Great location, extremely quiet - never heard any other guests in other rooms, great extras - breakfast, evening social, free laundry services.", "title": "Great", "user": "hender4", "date": "August 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75449518}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "Great hotel. Just 4 months old. The size of the rooms is great when compared to other NYC hotels. Breakfast is included in the hotel. Nice gym.", "title": "It surprised me. Excellent choice!", "user": "Piloteador", "date": "August 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 75341931}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Good location.", "title": "Great value and clean for Manhattan", "user": "InsideTrack", "date": "August 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 74976357}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We stayed here with our kids during family vacation. It's about three blocks from all of the action in Times Square so it's a bit of a jog. But the location is a nice escape from all of the havoc.", "title": "Great Stay in amazing suite", "user": "LucyandCydsMom", "date": "August 10, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 74697679}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "I believe this hotel opened in March 2010, so it's still very new and clean. Trust me, new and clean is hard to find in downtown Manhattan for a reasonable price. Room was a bit small for a \"suite\", but again it's New York. Free breakfast is served downstairs every morning and there's free happy hour mid-week so you can't beat that.", "title": "Would Love to Stay Here Again", "user": "frequentlyricochet", "date": "August 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 74661403}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Stayed with small children. The city on your doorstep. Easy walk to everything including the subway. The staff here is truly accomodating. From Andy our doorman on arrival to the amazing Sunny who was so patient and accomodating when we were leaving. The front desk staff always greeted us arriving or leaving. Plentiful hot breakfast, well stocked and patient buffet staff. Lovely calm, down sundowner reception in the evenings.", "title": "Hotel with great attitude!", "user": "eehmTraveller", "date": "August 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76364468}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "We enjoyed our room and convenieces. We were not bothered by any noise. we were on the 16th floor, and our floor maid was so accomadating to our family schedule. The manager introduced himself on our last day, and we had to tell him how delighted we were. We have stayed everywhere and this property is special and the people are more special. Best views are from the 22 floor, ours was fine. You may wait a little while for an elevator in the morning, but compared to other hotels nearby, the property is worth the wait.", "title": "Good deal in Time Square district", "user": "manywhere", "date": "August 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 76272814}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "I stayed a few nights with my partner and baby last June.", "title": "One of the best hotel experiences I have ever had!", "user": "Claire1949", "date": "August 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76200861}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "As this hotel is brand new, we got a decent pre-opening rate.", "title": "Would definitely stay again!!", "user": "Vtgirl642", "date": "August 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 75692935}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "As other reviewers already said, the street is not very friendly (some works, bus terminal, etc.), but we did not feel any security issue, even at late night.", "title": "Wonderful Hotel, friendly and helpful staff, amazing rooms, one of the best hotel stays I've had", "user": "DeltaBCFamily", "date": "August 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75551143}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Visited NewYork with my wife for our 25th wedding anniversary easter 2012..for 5 days", "title": "Great Hotel, Great Staff, Great Location, .. :-)", "helpfulness": 2, "user": "Red-wine59", "date": "September 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 139786193}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "When first looking at booking this hotel was a bit unsure of the location but the pro's out numbered the con's.", "title": "Cosy & comfortable", "user": "GumLeaves", "date": "September 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 139760206}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Location...", "title": "fantastic hotel", "helpfulness": 3, "user": "Lynne C", "date": "September 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139675891}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The adult store and booze store are just doors in the street wouldn't of noticed them really if the PC reviewers hadn't mentioned them. The parole office was closed over the easter weekend but on the monday morning we walked past about 10 guys waiting to get in, no one looked at us or bothered us never felt threatened at any time by the location..", "title": "Great location friendly hotel", "helpfulness": 1, "user": "AMagwood", "date": "September 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 139675444}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "Subway at the end of the street and another 5mins and you were in the centre of the hustle and bustle of times square, great place to start your day.", "title": "This is what a New York hotel should be", "helpfulness": 1, "user": "lizsterine", "date": "September 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139672530}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Wow, we arrived into New York city along with Hurricane Irene. Our Hotel was well equipped and the staff fantastic particularly front desk. We had a great time again in New York and the location of Staybridge is outstanding. Would recommend even to the most hard to please. Great place, breakfast a welcome start in the sunny atrium room. Well done.", "title": "Excellent location in the heart of Manhattan", "user": "wanderlustLangwarrin", "date": "September 15, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118174036}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Wonderful view and well appointed rooms. The restaurant for breakfast and drinks is wonderful but WAY to small if the hotel is busy.", "title": "Great hotel location", "user": "LBcouple", "date": "September 15, 2011", "detail_rating": {"value": 3.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 118168803}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Hotel is modern and newly-decorated with a fresh, clean look. Staff is friendly and helpful. Great free \"Happy Hou\"r in the lounge at 5 pm as well as a complimentary breakfast with everything from cereal to eggs, homefries and sausage. Rooms have large windows looking toward Times Square above about the 10th floor (Port Authority bus terminal blocks views below that level).. Fairly roomy by mid-town standards. Bed is very comfortable with a choice of pillows. Kitchenette well equipped -- you could live here. Being on 40th St. West of 8th, it is quiet in the room, yet you are 2 minutes walk from Times Sq, the subway and numerous bus routes. Lots of theater and tourist pedestrian traffic in the area so it is busy and quite safe to walk around.", "title": "Great hotel in the heart of Times Square", "user": "GandG079", "date": "September 15, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118163997}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We stayed at the Staybridge from August 15-21 2011 and I booked this hotel purely off the reviews from trip advisor and the location (across the road from port anuthority subway) and we were very very impressed. The rooms were small but were jam packed with features. Even though we didnt use it it had a full ktichen with a large fridge. The room was very clean and modern. They had a great selection for breakfast and considering it was free you cant complain really. It also had free laundry facilities which was a bonus as we were on a 4 weeks holiday. Even the detergent was free. They had quite a few massive commercial washers and dyers all in excellent condition and could be used 24 hours a day. The location is only a 5 min walk to Times Sq and there are a number of food places in very close proximity. The subway was right there so it ticked all the boxes for us. The next time we go to NY we will definately stay here. Also the hotel staff were all lovely, friendly and very helpful.", "title": "Couldnt ask for anything more!", "helpfulness": 2, "user": "thehobbit2010", "date": "September 15, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118143009}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I was there with my daughters in August 2011. The service at this hotel is excellent and the staff is very friendly. I enjoyed my stay in NYC especially because of the hospitality of the staff there even though we had to stay 6 days more because of IRENE (!!)", "title": "Stay at Staybridge", "helpfulness": 2, "user": "Claudia H", "date": "September 15, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118138327}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The hotel is situated in a great location five mins from Time Square, a couple of mins from the subway which is very handy way of getting about,", "title": "Our Stay @ The Staybridge Suites", "user": "horse1uk", "date": "September 13, 2011", "detail_rating": {"value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 118073342}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "The hotel is located in close proximety to the Port Authority bus terminal also very handy for transfers around the city and also to airports,", "title": "Great stay at the Staybridge Times Square.", "user": "lancasterdar", "date": "September 12, 2011", "detail_rating": {"value": 5.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 118024255}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "On arrival we were greeted by very helpful and attentive reception staff, we were early and they had a room made up ready so no delays, the room was great, spacious and comfortable larger than the average city hotel size, the in room facilities were great, multi function microwave oven, 2 double hobs, huge fridge freezer and a dishwasher ! all with required crockery and cutlery.", "title": "Close to the Times Square action", "user": "lonereignger", "date": "September 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "service": 4.0}, "id": 117960268}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The bathroom was spacious and well looked after", "title": "Very clean, great staff, good food!", "helpfulness": 1, "user": "maddieBocaRaton_fl", "date": "September 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 117882218}, {"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "The room was in good order and very clean, maid service daily with both clean towls and sheets.", "title": "will not be back in a hurry", "helpfulness": 1, "user": "loafofbread", "date": "September 8, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 2.0, "value": 2.0, "service": 4.0}, "id": 117845997}, {"rating": 4.0, "title": "Succeeded my expectations", "text": "I stayed in staybridge times square in April, 2011 and it was one of my best experiences in new York. Definitely the best hotel you can find in times square with that price. The location is just perfect, situated at walking distance from practically everything you need to find in times square. The hotel staff were very nice and helpful, and when I was late for checkout (I was out doing some last minute shopping and called in to ask if I can checkout an hour late) they were really understanding and had no problem at all. My room was EXTREMELY clean and the bathroom was intact! The breakfast selection was better or similar to most hotels I've been to in considering states, and considering it's free! I was particulary impressed with this hotel, after being to so many hotels during a tour in the US, where I have paid more money, and didn't get the same service.", "user": "SaraSGS", "date": "April 27, 2012", "id": 128917525}, {"rating": 5.0, "title": "Excellent hotel for a short city break", "text": "The only negative would be the elevator wait. Sometimes I had to wait for a good 10mintes for the elevator. I would've given it a 5 star rating, if they could find a way to solve that problem.", "user": "kathleen369", "date": "April 27, 2012", "id": 128863800}, {"rating": 5.0, "title": "Excellent", "text": "We stayed at Staybridge in late April 2012 and it was ideal for our NewYork visit. Whilst being a budget hotel rather than a posh one,it ticked all the boxes so far as we were concerned. The room was a goodsize for New York with a very big bed and included a kitchen area with microwave, hob, sink fridge freezer and a good range of pans, dishes etc. We did n't do any cooking and judging by the condition of the pans no one does, but it was nice to have facilities to make drinksand prepare packed lunches etc. Public rooms were limited, but adequate. The self serve breakfast was better than we expected and included hot dishes well cooked. The breakfast room could get rather crowded at times. We were particularly impressed with theevening \"happy hour\" with snacks and drinks on offer on a self serve unlimited basis. A special word for the staff who were very welcoming and friendly without exception. It was nice to have the use of a computer in the business area to check in to our return flights cand print boarding passes.", "user": "Kerry H", "date": "April 27, 2012", "id": 128830840}, {"rating": 4.0, "title": "Wonderful Stay - Would Return - Hoping for a better view next time", "text": "Staybridge is conveniently located on the SW edge of Midtown Manhattan and a 5 minute walk will get you to Times Square. A twenty minute walk will get you virtually anywhere in Midtown Manhattan eg southern edge of Central Park or Grand Central Station. The Hotel is opposite the Port Authority Bus Terminal from where runs the Airporter express bus to the airports - could n't be better", "user": "Monica532406", "date": "April 26, 2012", "id": 128669136}, {"rating": 5.0, "title": "The staff really cares!", "text": "Thank you, perfect choice for my sister and I to have our first mini holiday in New York; clean, modern apartments, really appreciated the mini kitchen - strange though to have coffee machine and no kettle - but saucepan OK for heating water for tea (the English have to have their tea!). Sorry that we couldn't have the two-bedded room we had requested, but the bed was so huge we didn't mind sharing. Good choice at breakfast thank you - really set us up for a day of heavy sight-seeing. Staff all very helpful - thank you Jamie and your colleagues on front desk. Had read about slow elevators - but this wasn't a problem we encountered. Excellent location, excellent accommodation - I hope we'll be back.", "user": "Susan L", "date": "April 26, 2012", "id": 128659815}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "We stayed at the Staybridge Time Square on Labor Day weekend. The hotel was sold out yet we had no trouble at check in, riding the elevators, complimentary breakfast or with our room. The hotel is located within an easy walk from the heart ofTime Square. This is why we picked this hotel, that and the complimenatry breakfast and that it was a mini-suite.", "title": "What a great Place!", "helpfulness": 1, "user": "Mary C", "date": "September 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "service": 5.0}, "id": 117813174}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I initally had trouble using my Priority Club points but one of the managers was more than helpful in taking care of the problem. All the staff were amazingly friendly and accomodating.", "title": "We loved il and we'll be back without Irene!", "helpfulness": 1, "user": "Eliza P", "date": "September 7, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 3.0, "service": 3.0}, "id": 117807972}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Everything in the hotel was as described. The room was a bit tight but we didn't go to NY City to spend time in the room. Everything was clean and in working condition. The complimentary breakfast was better than any other complimentary breakfast we have ever had. Would definitely stay there again!!", "title": "I would definitely go back to this hotel", "user": "Shawn K", "date": "September 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117802007}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "All the staff were very polite, helpful and friendly. Our whole family found all your staff were very afficient and we particuly appreciated a young man called Barry who we give our five star award to!!!", "title": "We will stay at Staybridge again!", "user": "shastapasta", "date": "September 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117771849}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "It's very rare to come across someone like Barry, who paid particular attention to all visitors in your hotel, always remembering to use their names and to take some time when his work allows to talk to your clients. He's extremely polite, respectfull and friendly. He's a great person to have working in a hotel!", "title": "excellent hotel on a seedy street", "user": "carol999", "date": "September 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117766844}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "We had a great time here. The rooms were a little small (we are from Texas after all) but they were beautifully clean and everything about the hotel was modern and crisp. We were just a few blocks from everything we wanted to see in Manhattan, Time Square, the library, etc. We were able to walk safely to dinner and other entertainment venues. Sunny the at the front door was extremely polite, helpful and funny. We had a really good time. The only downsides, the size of the room (I'm sure it's great for New York!) and the costs/access to parking (but I'm sure it was great for New York too!!).", "title": "Great Place to Stay", "helpfulness": 1, "user": "Traveler2463", "date": "September 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140510128}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "This was our first stay in NYC and I am so glad we read the reviews as staying here proved to be an excellent idea!", "title": "Nothing is too much trouble!", "helpfulness": 3, "user": "Glossopshark", "date": "September 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 140505197}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We stayed for 10 days in September and I can only say positive things about the hotel, as even the odd little issues we had were acted upon and sorted out with immediate effect.", "title": "short break", "helpfulness": 1, "user": "gedscott", "date": "September 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 140485482}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "You are 2 blocks away from Broadway and 4 blocks from Times Square, so whilst it is in a slightly less salubrious area and the bars and restaurants in the local area can be expensive, it is very central and the addition of a full sized fridge in the roomsmeans that you can reduce the costs a little. On the downside, the rooms git very warm and the AC units were in room and far to loud to put on if you wanted to get any sleep!", "title": "Staybridge Suites Times Square New York", "helpfulness": 1, "user": "katalinbrisbane", "date": "September 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140469179}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The room we stayed in was a decent size for a capital city and had a microwave,fridge/freezer, dishwasher, filter coffee machine and hobs, as well as an iron and ironing board.", "title": "Amazing stay in NYC", "helpfulness": 2, "user": "Sandy M", "date": "September 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140455003}], "location": {}, "stars": 3.5, "variance": {"poor": 24, "average": 144, "very good": 856, "terrible": 11, "excellent": 1615}, "aka": "Staybridge Suites Times Square - New York City Hotel New York City", "slim_ranking": 0.0835214446953, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "When you're traveling to New York City, you want to be confident that your accommodations will meet your every need. Staybridge Suites • Times Square •New York City has been meticulously created to do just that. No hassles. No mysteries. Just a single focus on you! A short walk to Times Square, a block from the nearest subways and the Port Authority Bus Terminal, you’re in the heart of Manhattan, with all the city attractions in easy access at your doorstep. It’s All On Us! We’ve included in your stay a COMPLIMENTARY breakfast each morning, complimentary wi-fii/high speed internet in all rooms and throughout the hotel, complimentary cocktail hour/social reception with free drinks/beer/wine/and appetizers 5-7pm Tues-Thur, complimentary in room coffee/coffee maker and tea daily, in addition to complimentary coffee/tea/and hot cocoa in our great room-lobby throughout the day, complimentary newspapers by our front desk; and, complimentary laundry facility, business center and fitness center. Each room comes with its own fully equipped kitchenette, with a full-sized refrigerator, microwave, stove top, dishwasher, pots, pans, utensils, and cookbook to make you feel completely at home. On site is a concierge service to help you with tourist/and travel arrangements, bellman/porter service for car and luggage assistance, bar/lounge space open in the evenings, 24-hr pantry and convenience mart for late night snacks and last minute travel needs, and board games by our great room fireplace. Our hotel allows pets. 24-hour security is onsite. Reduced rate parking at nearby hotel garage just one block away. Stay a Night, Stay a Week, Stay a Year. Our hope is you never want to leave!"}