{"user_rating": 5.0, "review_count": 132, "name": "Staybridge Suites North Charleston", "reviews": [{"rating": 5.0, "title": "Excellent stay, wonderful amenities.", "text": "We stayed here for 3 nights -- 2 adults and an infant. Place is immaculate, just clean as can be (probably because it's brand new). Staff was very friendly, without fail. I loved the large suite with full kitchen, 2 TVs, and the bedroom totally separate from the living/kitchen area. More like a compact 1 bedroom apartment than a hotel room. I also find that the Staybridge chain outdoes the others when it comes to amenities. This place not only gave us a free full-breakfast, but they also had a \"happy hour\" every night that was a complete free meal. One night was grilled hamburgers and hot dogs with all the fixings, plus free beer and wine, plus non-alcoholic drinks. Plus free internet, free laundry, pool and fitness room, and the rest of the usual stuff. I'm definitely a fan of Staybridge -- they have the formula right.", "user": "Paul99501", "date": "December 3, 2009", "id": 50597864}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "We decided to meet our daughter half way between Jacksonville, FL and Wake Forest, NC for the Thanksgiving weekend and chose to spend the holiday at the Staybridge Suites in North Charleston. It was the best 'home away from home' experience we've had. We will definitely look for Staybridge in other cities we visit.", "title": "Best home away from home.", "user": "Bahamamama716", "date": "November 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 50203175}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "This place is truly unreal. Granite countertops, ceiling fans, hardwood floors in the kitchen at an amazing price. The suites are huge and have all the conveniences of home. This hotel is perfectly located in Charleston and offers beautifully appointed suites. It had apparently just opened when I stayed. There are several restaurants within walking distance. I would highly recommend this hotel to anyone. Only snafu was a small issue with a credit card form at checkin. Resolved within a reasonable amount of time so no biggee.", "title": "An astounding stay in an amazing hotel", "user": "Carl B", "date": "November 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48302223}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 1, "average": 0, "very good": 22, "terrible": 1, "excellent": 108}, "aka": "Staybridge Suites North Charleston Hotel", "slim_ranking": 0.0344827586207, "description": "At the Staybridge Suites Charleston, discover the best of the Lowcountry with modern amenities. Our new hotel offers spacious suite accommodations with kitchens and upscale features including indoor pool and fitness center. We proudly serve a complimentary daily hot breakfast and an evening manager s reception from Tuesday-Thursday. A convenient location in North Charleston is within just a few miles from the region s largest employers including the US Naval Weapons Research Center (SPAWAR), Robert Bosch Corp., Global Aeronautica, Boeing, American LaFrance, Charleston Convention Center, and the Charleston Airport. If you re in the area for leisure, the hotel is convenient to Historic Downtown Charleston, North Charleston Coliseum, South Carolina Aquarium, Kiawah Island, Drayton Hall, Magnolia Place, Fort Sumter, Patriot s Point, Family Circle Tennis Stadium, numerous golf courses and hundreds of shops in Northwoods Mall, Centre Pointe/Tanger Outlets, and Mount Pleasant Town Center. Our pet-friendly hotel offers spacious studio, one-bedroom and two-bedroom/two-bathroom apartment suites featuring fully-equipped kitchens (including refrigerator, dishwasher, and microwave), 42 LCD TVs, free wired and wireless Internet, cordless speaker phone and voice mail. Other features include 24 hr business center, library, free laundry facilities, fitness center, and indoor pool. Children under 18 always stay free, and sleeper sofabeds in every room are perfect for kids and groups."}