{"user_rating": 4.0, "review_count": 160, "name": "Staybridge Suites Rochester University", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "For years, we have found cottages on the water for our anniversary.", "title": "30th anniversary saved!", "user": "TeeEff", "date": "March 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154145253}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "This year owing to outside issues we thought it impossible. But, on short notice, we found this beautiful location online and booked it.", "title": "Clean, comfortable and friendly", "user": "SomervilleReisender", "date": "March 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 153599768}, {"rating": 5.0, "title": "Nice place to stay", "text": "We had a wonderful stay. The riverview from our room was perfect! and romantic each night. Gorgeous, long, dog-walks by the river and on campus were just what we love. Combine that with its proximity to so much to do in the city, makes this an ideal location.", "helpfulness": 1, "user": "SusanL938", "date": "February 7, 2013", "id": 151615793}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The suite was comfotable and cozy. The kitchen had everything we needed. The breakfast bar offered something for everyone and the fresh fruit was excellent, ripe, and abundant.", "title": "Great for an overnight!", "user": "GiselleF", "date": "February 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151487584}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "The staff was very welcoming and helpful. The housekeeper went out of her way to make sure we had everything we needed. And knowing that we wished for another night but all booked up, the desk called us quickly with the news of a cancellation.", "title": "Great value...great service.", "user": "teamsjk", "date": "February 2, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 151233916}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "I had a very nice and pleasant stay at this Staybridge Suites. They were very accommodating when assisting my family when we needed a lodging facility that would allow pets. They did, and did not discriminate when it came to the size of the pet. We had our dog that weighs about 75 pounds and only charged a small additional fee to let him stay with us. It overlooks a river which was very nice, and convenient to downtown Rochester, NY. The complimentary hot buffet breakfast was also nice and comparable to other Staybridge Suites. I would stay again.", "title": "Very Accommodating & New(er)", "user": "TravelerManDan", "date": "January 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150899396}, {"rating": 2.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "When we arrived at this hotel I thought it was a gem that I would try to find where-ever we traveled. The 2 bdrm suite was great and very clean. There was a minor glitch at check-in about over-booking but they were able to give us a room that we had reserved. The issue that we had during our stay was with the rude, unsupervised, aggressive teens and young children there. We were only staying over-night and I could not wait to leave. Running in the hallways, playing with the one elevator that was there which made the wait a lot longer, and the terrible behaviour at the breakfast. Plates filled to over-flowing with-out regard to other guests and if anything fell it stayed where it was, cutting in line, no supervision. I did not feel safe there and I don't know if the staff tried to do anything. First impression count a lot and mine was not a good one. I won't book anywhere at this hotel again.", "title": "Struggled with this review.", "helpfulness": 2, "user": "family201113", "date": "January 24, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 150501310}, {"rating": 2.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "We stayed here this past weekend, and loved the layout of the room. Very spacious and clean, with friendly staff. The unruly and rude guests made us decide to never go back here again, though, and that's saying a lot coming from someone who's been on quite a few hockey tournament trips. The buffet would have been nice if guests would use the serving utensils instead of just using their hands that they were just coughing into and if the person in front of you didn't take the last sausage links and omelets so that the rest of the line couldn't get any (I'm talking at least 8 sausage links and at least 8 omelets). Or if people wouldn't talk on their cell phones while making waffles and act like they were the only people there for breakfast. Also, showers and clean clothes would have been nice on the other guests instead of smelling bad and wearing their pajamas. Can't we have some rules of decency for guests at hotels? I know that the hotel has nothing to do with the guests, but I feel that people should know what they might be getting into if they stay here. I don't know if it was just the location or what was going on, but it was really bad and sadly we would not go back to this hotel, ever. Also, they only have one elevator and it can take a really, really long time to get it. Especially when the other guests think it's funny to ride the elevator all day and press all of the buttons so it goes to every floor constantly. This would be a great hotel if it were in a different location, since the rooms were great and the price was reasonable.", "title": "Very nice rooms, but the other guests ruined it", "helpfulness": 1, "user": "Nockian", "date": "January 21, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 150200538}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "My husband and I recently stayed for 4 nights over Thanksgiving while visiting our daughter who is a freshman at the University of Rochester. The proximity to the River Campus makes it ideal, as it is a 2 minute drive over the road bridge from the hotel to the campus or a 10 minute walk over the footbridge to her dorm building.", "title": "Everything you need", "helpfulness": 1, "user": "Love-to-Travel-er", "date": "December 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147600614}, {"rating": 1.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We booked the one room suite which allowed for my husband and I to have the private bedroom and for my daughter to sleep on the pull out double bed in the sitting room. There is a television in both areas. I was happily surprised at the kitchen which really did have everything we could need in terms of silverware, crockery, washing up liquid and even paper towels provided. We took advantage one evening of the complimentary light supper and free drinks which are served, I believe, Tuesday thru Thursday evenings. The breakfast buffet also had everything we wanted, from eggs to self-serve waffles, fruit and yoghurt, and cereals.", "title": "Worst Hotel Experience EVER", "helpfulness": 2, "user": "s m", "date": "December 14, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 147469692}, {"rating": 3.0, "stay_parameters": "Stayed March 2013", "text": "Two bedroom, two bath suite was attractive and nicely furnished. Very cokmfortable beds. Baths conveniently had granite-topped sinks separate from rest of bath. Kitchen had basics for cooking and eating in. Dishwasher is quite noisy. Service was quick and friendly - from check-in to prompt delivery of missing part for coffeemaker. Free breakfast included hot and healthy options. Although the Univeristy of Rochester is a 10 minute walk accross the river, there is very little in the way of restaurants and entertainment within walking distance. Nice hotel, but price presented only an average value.", "title": "Convenient to University", "user": "skisurfer17", "date": "April 8, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 157108797}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "Met friends for an overnight stay in one of the suites. The suite was quite spacious and sparkling clean. There were always helpful staff members at every turn. The breakfast area was quite large and inviting. No problem parking outside this hotel. I would highly recommend staying here.", "title": "Wonderful Stay!", "user": "16Dania", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 157043753}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The Staybridge Suites in Rochester is clean and well maintained. The staff is friendly and professional. Our \"suite\" with queen size bed consisted of one good sized room with a kitchenette, desk, chair and couch. Fine for a 2 or 3 night stay, and at little over $100.00 a night for double occupancy. However, like many hotels in which I've stayed, there is absolutely no sound insulation and every little noise is transfered, seemingly ampliphied, through the floors and walls. If you happen to get a room on the river side of the hotel, you get a great view of the Gennese and the university campus beyond (an easy walk over a pedestrian bridge). If you happen to be on the other side, as we were, you get a view of the rear of a neighborhood of old tennaments. And the free breakfast buffet is not very good at all; if we stay here again, we'll skip it.", "title": "Average it is.", "user": "larry d", "date": "March 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 155790027}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We stayed at this hotel while visiting Rochester University. First of all the hotel was very clean and located literally within walking distance of campus! The staff was very friendly and helpful and gave us an upgrade to a two bedroom suite! The rooms are clean and include a small working kitchen. The windows were a little drafty but the beds were comfortable. The hot breakfast was good and there are many areas to sit and relax in the lobby area. I would definitely stay there again if I was in the area. Another plus - the staff was so quick to clean our vacated room that they located a forgotten item and were able to give it to us before we departed. This is the mark of a well-run hotel!", "title": "Best choice for your stay - right at Rochester University", "user": "Luv2travel601", "date": "March 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 155242754}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Incredibly hospitable staff, good breakfast, big, new, clean suite, and the best for me, they welcomed my dogs. I have two well-behaved Labradors, and never felt so welcomed at a hotel with them before. The hotel is right on the Genesee River and there is a very long walking trail that I enjoyed with my dogs after a long day at work.", "title": "What a find!", "user": "Fussy22", "date": "March 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 154560418}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We stayed for a single night over this past Easter weekend prior to Green Day concert. Nothing but great things to say about the Staff - very friendly, helpful and genuinely concerned that you were having a great stay. Excellent service staff. Rooms were large and comfortable...basically what we have come to expect from Staybridge Suites. Breakfast was very good as well. People have previously commented about \"bad\" location...yes its not in \"downtown\" Rochester but location is fine and only a short ride into town. If we are back in Rochester we will definitely come back.", "title": "Great Place!", "user": "J-Roc123", "date": "April 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 157646222}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "For visiting the University of Rochester, this hotel is about as convenient as it gets. The University is an easy walk across the foot bridge. The hotel provides a shuttle, too, although it's probably faster to walk than to wait for it. The amenities are pleasant, and well-designed. The breakfast area is as much like a living room as you could expect for a hotel. Similarly, the floor plans and furnishings in the suites are practical and pleasant. The main down side is that the place feels cheaply built. The floors and walls feel hollow, which is especially true of the stairwell. Unfortunately my room was adjacent to the stairwell, and I did not sleep well, since the slamming doors of all 3 floors resound (hollowly) very loudly in my room, and the sound of people traipsing by on the hollow floor was also clearly audible. If you're planning to stay a while, definitely go for a room on the top floor away from the stairs! There was also a used towel wedged behind the bathroom door, and it was there both days I stayed.", "title": "convenient, if not comfortable", "user": "Andromeda07", "date": "April 11, 2013", "detail_rating": {"cleanliness": 3.0, "sleep": 2.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 157468143}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "This place is my home away from home when I'm doing business in the Rochester area. The staff are genuinely friendly and helpful. The suites are roomy and clean. The beds are comfy and you have a good amount of channels to choose from on the television. There is adequate work space with free internet. They also have \"socials\" at night in the dining room during the week so you don't have to go out for dinner after a long day. I've been there so much that I usually get one of my two favorite suites that overlook the water when I'm there. This is definitely the place to stay when in Rochester! I get upset if they are fully booked and I have to stay somewhere else when I'm in that area.", "title": "I luv this place!!", "user": "Desiree R", "date": "April 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157425819}, {"rating": 3.0, "title": "clean and comfortable", "text": "The room was clean and spacious. The front desk was very helpful and parking was no problem. As other reviewers have said, there is not much in the way of restaurants and entertainment within walking distance.", "user": "travelbug242", "date": "April 9, 2013", "id": 157255669}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "Several old friends and myself decided to get together and have a night out--we rented two suites at Staybridge and had a marvelous time. The hospitality and helpfulness of staff couldn't be beat and the suites were designed just right. Breakfast was more than adequate and we enjoyed the river view. Would definitely recommend!", "title": "Wonderful Place!", "user": "Julie B", "date": "April 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 157244521}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 13, "average": 16, "very good": 49, "terrible": 9, "excellent": 73}, "aka": "Staybridge Suites Rochester University Hotel", "slim_ranking": 0.241379310345, "description": "The Staybridge Suites hotel in Rochester, NY blends sophisticated, extended stay hotel surroundings with friendly service in a beautiful suburban setting. We are easily accessible from the NY Thruway, I-390, I-490, I-590 and are located just minutes from the Greater Rochester International Airport. Our hotel is just minutes away from the University of Rochester, Rochester Institute of Technology, and several major corporations such as Kodak, Bausch & Lomb, and Wegmans. You will experience comfort and convenience with our spacious studio, one-bedroom suites, and two bedroom suites, each complete with living room and full kitchen. Our daily breakfast buffet features hot items, and our free Sundowner Reception (featuring a light dinner with beer, wine, & soft drinks) is available Tuesday - Thursday evenings. If you prefer to dine out, choose from any number of restaurants that feature a range of cuisine and ambiance. When it's time to unwind, relax in the courtyard or at our indoor pool or workout in our fitness room. Leisure opportunities are plentiful- we are just minutes from Seneca Park Zoo and Rochester Museum and Science Center, and within a 1 hour drive to Finger Lakes, Casa Larga Vineyards, and the Genesee Country Village."}