{"user_rating": 4.5, "review_count": 390, "name": "Staybridge Suites London-Stratford City", "reviews": [{"rating": 5.0, "title": "On top of the world...", "text": "Accidentally, I stumbled across the \"jewel in the crown\" of the Holiday Inn brand. This not-so-secret residence is my future choice for any possible alternative to the regular hotel fodder that you find on the usual internet travel sites. Why haven't I been aware of this particular brand before? I even lived in the US for two years without rumbling the delights and practicality of \"Suite\" living.", "helpfulness": 2, "user": "Chris F", "date": "December 17, 2012", "id": 147638078}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "OK, so you get my point, not well known, but just in a class of its own. The Westfield Shopping 'mall' is incredible too, built as part the regeneration of the East of London as a legacy of the 2012 Olympics, so take empty suitcases so you can shop till you drop. Superdry JPN, David & Goliath and Jack Wills were targets for my daughter, so you won't be disappointed if you follow fashion.", "title": "great stay!", "helpfulness": 2, "user": "amar r", "date": "December 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147605313}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Back to the hotel, sorry Suites, the reception (and lounge & dining areas) are on the 12th floor (on top of the world) and what a view of the city! Imagine this as you digest your complimentary breakfast, a panoramic vista; dramatic winter sunbeams cracking through the atmospheric cloud base, silhouetting the towering iconic Cityscape in a moment that will stay with you, at least until you finish your bagel...! Incredible, seriously.", "title": "Excellent Overnight Stay", "helpfulness": 2, "user": "zspearl", "date": "December 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147600405}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "To top off the stay, it cost me just Priority points. Another reason that reminds me why I switched from HHH, without regret.", "title": "Wowee what a view & what a great hotel manager!", "helpfulness": 2, "user": "HollyB26", "date": "December 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147590027}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "fantastic view, fantastic facilites, friendly and helpful staff, everything you could want from a hotel really, and a great location as well..cannot recommend this hotel enough, great job staybridge, we look forward to staying with you again.", "title": "staybridge suites stratford city", "helpfulness": 1, "user": "sam t", "date": "December 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 147320796}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "This hotel was near perfect. Very nice staff, clean rooms, very little noise. Close to the shopping centre and perfect for shopping. You also have a great variety of restaurants on your doorstep. The only letdown was the breakfast for me. I have celiac disease and I'm used to having to ask for gluten free bread. Most hotels cater for this, I have to wait a bit longer, but that's ok. However, be aware that Staybrigde suites does not offer gluten free breakfast. The solution for me was that I had to buy my own bread and toast it in the rooms. So, if anyone working at the hotel reads this: Buy a gluten free frozen toast bread. When someone asks for gluten free bread, take a few slices, put them on a clean bakingtray and warm them for a few minutes in the oven. And voila, you can now offer your guests a gluten free alternative!", "title": "Near perfect", "helpfulness": 2, "user": "EGHT", "date": "December 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 148467724}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "My stay was over the Christmas/boxing day period with my boys. Check in was warm and welcoming, I loved Chloe?? (the dark haired girl with the Northern accent) And Rafael was equally attentive and warm and tried very hard to accommodate me and my requests. Rooms were very nice and not as small as I thought it would be (i had a 1bed suite) with everything you could need", "title": "Very enjoyable stay, with great staff", "helpfulness": 3, "user": "hoxtonbabe", "date": "December 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 148463376}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "Breakfast was good with lots of choice, and loved the concept of helping your self to cartons of juice as if you have a large party you could simply take a carton to your table for all to share, only downside was it ends at 9.30, I think 10am would be a better option, but you can take the food up to your room should you wish.", "title": "Our home away from home for one wonderful week!", "helpfulness": 3, "user": "Jhlr322", "date": "December 31, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 148408513}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "My major gripe with hotels is noise, I can say that I did not hear a peep not even from other guests during my stay, however I was placed on the Olympic side.", "title": "Excellent!", "helpfulness": 1, "user": "itamo", "date": "December 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 148408386}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "So why the 4 and not 5 stars? My stay was not without its glitches, albeit minor however I addressed this upon checkout and they seemed to genuinely take my concerns/constructive criticism on board.", "title": "AMAZING EXPERIENCE!", "helpfulness": 1, "user": "Sufff", "date": "December 29, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 148316581}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Close to the Stratford City Tube Stop, close to Westfield mall (largest mall in Europe), incredible 360 degree view. Great customer service. Clean, comfortable room, Manager's Reception time in the evening, hot breakfast, concierge service.", "title": "Great hotel in the middle of shopping district.", "helpfulness": 4, "user": "stevans_11", "date": "December 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148211399}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Wife and I snuck away from Arizona to enjoy London during Christmas time. Even with bitterly cold weather and wind and rain, the hotel was more than ample for us.", "title": "Wonderful Staff !", "helpfulness": 3, "user": "PoddyThailand", "date": "December 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147889319}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "I would encourage anyone to use this hotel on a trip to London.", "title": "How convenient can a hotel be.....", "helpfulness": 2, "user": "SF60insulation", "date": "December 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 147810556}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "If you want to 'shop 'til you drop' this is the hotel for you! It is a short walk from the railway/tube station, followed by a quick ascension, in a fast lift, to the 12th floor, where charming and helpful receptionist are waiting to assist you. We were checked in by Sophie, and later met Timothy (when I requested a room change) Nothing was too much trouble for either of them. The rooms are excellent, with everything one could need - I would like a slightly softer mattress (or perhaps a 'topper' on the mattress) also a choice of softer pillows,but that is all a personal preference. Microwave, hob, dishwasher, fridge and sink, which is handy if one wants to stay in and cater for oneself.", "title": "Great hotel, perfect price", "helpfulness": 2, "user": "KiwiandCheese", "date": "December 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 147752247}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "The breakfast was a 'help yourself to everything' and was more than adequate. Hot and cold choices, with good juices, fresh fruits and a small selection of hot food. Unfortunately we missed the evening nibbles with wine or beer on the Tuesday night (too busy shopping)", "title": "On top of the world!", "helpfulness": 5, "user": "Chris F", "date": "December 19, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 147727313}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Stayed only for one night and my first time at a Staybridge Hotel. Great location, staff were super freindly and I'd go back anytime. Love the concept.Managers cocktail reception is a great idea (Tues-Thurs).", "title": "Excellent Hotel and staff", "helpfulness": 3, "user": "jamiexx", "date": "January 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 148966095}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Hotel is moden, clean and feels homely. I wish more hotels has such friendly staff.", "title": "Great Place!", "helpfulness": 4, "user": "Andrew T", "date": "January 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148830544}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We fancied a short shopping break at Westfield but didn't want to miss out on the excellent food and wine available at the numerous bars and restaurants at this great London mall. We decided we would book a hotel stay for 1 night, and chose the Staybridge Suites. Result! From the moment we checked in, we were greeted like royalty and made to feel like we were at home in our new surroundings.", "title": "If you want perfection this is it!", "helpfulness": 3, "user": "menmeluv", "date": "January 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148783910}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "Everything was explained to us, and we were also told that we were invited to the Manager's Reception at 6.30pm that evening (every night Mon-Thurs) where we could chat to staff and fellow guests over complimentary food and wine ( & beer ).", "title": "Excellent place to be near mall, restaurants and Olympic park.", "helpfulness": 3, "user": "Mac147", "date": "January 2, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 148645611}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The rooms/suites were superb, and the bed was extremely comfortable! If you are staying for a longer period of time, this place is perfect! The rooms have a full Kitchen and as there is a Marks & Spencer and a Waitrose in Westfield, you won't be short of things to cook. However, Westfield is blessed with lots of great eateries and top notch restaurants too!", "title": "Extremely mixed sentiments", "helpfulness": 1, "user": "im_ships", "date": "January 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 148491729}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 4, "variance": {"poor": 2, "average": 19, "very good": 69, "terrible": 0, "excellent": 300}, "aka": "Staybridge Suites London-Stratford City England", "slim_ranking": 0.0195348837209, "description": "Choose a relaxing home-from-home at Staybridge Suites London Stratford hotel, located in the Westfield Stratford City Shopping Centre and just a 5 minute walk from the 2012 Olympic Village.From the minute you step inside the bright, welcoming Lobby of Staybridge Suites London Stratford, you'll feel at home. Unwind by the contemporary fireplace in the Lounge or head to your smart Studio or 1-bedroom Suite. You'll find complimentary wireless Internet throughout.Staybridge Suites London Stratford is in the heart of Europe's largest shopping centre and is one of the onsite hotels for the 2012 Olympic Village. With only a 200 metre walk from Stratford Tube, Railway and DLR Stations, you are within minutes from London City, Canary Wharf, the O2 Arena and the ExCel Exhibition and Conference Centre.Most of Stratford's most exciting bars and restaurants are literally on your doorstep, but if you fancy a night in, the fully equipped kitchen in your Suite makes it easy to cook your own dinner. You'll find all the groceries you need at our 24-hour Pantry. Complimentary breakfast is served in our Hub Kitchen, while guests can network or mingle over complimentary drinks and snacks at our evening reception, held Tue-Thu. Guests can make use of our complimentary laundry room.After a long day, you can energize in the Fitness Centre or meet in the Den meeting room. Ask our team members about exploring the city of London, a few tube stops from home"}