{"user_rating": 4.5, "review_count": 798, "name": "Staybridge Suites Lake Buena Vista", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "We stayed at Staybridge for 3 nights while on a business / Disney trip. Customer service was awesome. We even needed a late checkout on the final day and it was no extra charge. The rooms were clean and the beds were comfortable. Bathrooms were a little small but the sink area was outside of tub area which made it nice so that one person could use sink while other showered. Very convenient to Disney and Downtown Disney. Also convenient to grocery, gas, major highway to airport.", "title": "Staybridge was great!", "helpfulness": 7, "user": "Suuki", "date": "May 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7585739, "likes": {"liked": "— Free hot buffet breakfast every morning"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Myself, husband and two children stayed at the Staybridge suites Lake Buena Vista for the last 2 weeks in April. I had booked the one bedroom suite but then wished I’d chosen the two bedroom as I did think the extra bedroom/bathroom would have been better with two daughters but I can quite honestly say at no point while on holiday did I feel cramped. Our suite was on the third floor facing in, overlooking the pool. The huge double bed along with the total absence of any road / other guest noise gave us the most restful nights sleep I’ve ever had in any hotel. The girls also found their sofa bed to be very comfy and it took all of two minutes to make up and put away. The suite was a little tired but it’s overall comfort and amenities more than made up for a few scuffed walls and slightly ageing appliances. Iron, ironing board, hairdryer, free digital safe, Full size fridge/freezer, dishwasher, full size oven/hob, toaster, microwave, coffee percolator and even a bedside clock radio is provided. The free buffet breakfast was a great boon. The breakfast was self-service and each day there was one hot egg product, omelette plain/cheese or scrambled egg and one hot meat product, bacon or ham, sausage or even corn beef hash one day. Everyday there was four types of cereal + porridge, fresh fruit salad, yoghurt, bagels, boiled egg, various cakes make your own waffles and toast and unpeeled fresh fruit, four types of fruit juice, tea, coffee, hot chocolate, cold milk. There was something for everyone and as much as you liked, they even provided disposable plates/cutlery for in case you wished to eat in your room or on the go. Three evenings a week the hotel held a little sun-downer where they served a free snack/meal and either wine, beer or a soft drink. We were usually out so only partook once and then we had hotdogs with chilli beans. Within a very short walk there is a sizzlers, steak and shake, Italian restaurant, set price Chinese buffet and just about every other eating place you can think of within a very, very short drive. We did soon get a bit tired of eating out ( sad I know ) and so shopped at the huge Wal-Mart a few miles down the road, so cheap!!. There is a small hotel shop but they don’t stock much so the wall greens across the road were handy. The hotel pool isn’t large but quite adequate and they provide free pool towels and pool inflatables. There is a small gym, free towels once again, a small games room for the kids with a few arcade type machines and one computer for their use. They have a free business centre room in the hotel with three computers and a printer for adult use only. A laundry room is available at a small charge through a token machine, I would take a few washing powder/liquid tablets next time though as I wasn’t keen on the token meter dispensed powder. We didn’t use the free shuttle buses to the Disney parks so can’t comment, though the hotels nearness to Disney and its provision of transport was one of the reasons we booked here. Originally we weren’t going to have a hire car but were persuaded by friends to make use of the included car hire, which came with our holiday package, and we are so very, very glad we did. My husband is a fairly confident driver in the U.K and except for a few understandable first panicky nerves we managed to drive all over Florida and covered 1600miles. We barely went to the parks in the end as there is so much more to see and do in Florida We did hire a sat nav but returned it the day after and saved $130 as we really didn’t need it. Once you get the hang of all roads run roughly east/west or north/south and remember that going the wrong way is all part of the experience and what’s the rush anyway? You’re on holiday it just adds to the fun.", "title": "lovely holiday", "helpfulness": 11, "user": "tatty-teddy", "date": "May 8, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7564742, "likes": {"liked": "— homely and relaxing and fully equiped with all you could need and very comfy beds", "disliked": "— Rooms begining to look a little tired."}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "One thing I wished I had brought or bought in the first few days would have been another cooler. I had packed a small colapsable fabric 6-can cooler for water/drinks but missed a larger one more useful for sandwiches and snacks (bought at Wal-Mart and very tasty) In the end I improvised and used a rucksack. I froze tap water in our empty water bottles to use as ice blocks but an insulated bag would have been better. You cannot take food (only water) into the Disney theme parks but you can into the water parks. I would rate this hotel as one of the most comfortable and homely I’ve stayed in and absolutely loved Florida.", "title": "Loved It!!!!", "helpfulness": 8, "user": "Legenlo", "date": "May 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 7549539, "likes": {"liked": "— Size of rooms and breakfast", "disliked": "— Pool stays open until 11pm, should close at 10pm"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "We have just returned from a one week vacation to Orlando with our 3 kids (15yrs, 11yrs and 7yrs). We booked our vacation with Westjet Vacations. We are from Ottawa, Canada. We stayed at Staybridge and loved it. The rooms are spacious, we rented a 2 bedroom, 2 bath, Fully equip. kitchen, dinning room and living room with sofa bed. The pool was great, toys for the kids a nice waterfall and above all, it was heated! The jaccuzzi was nice but too hot. The breakfast was GREAT. They had everything, scrambled eggs, cereals, sausages, bacon, warm biscuits, muffins....and the best of all, you can make your own waffles and they are DELICIOUS!! The kids loved it. From Monday-Thursday between 5:30-7:30 they had free refreshments (Beer,wine, cola..) and they even had BBQ's for FREE!! I couldn't believe this, one night they had hotdogs and beans, the next night was ravioli with fresh buns.", "title": "Value, Value, Value", "helpfulness": 5, "user": "LawAlpharetta", "date": "April 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7484448, "likes": {"liked": "— Value", "disliked": "— No interior hallways"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Upon check-in they will give you a calendar with what's on the menu.", "title": "Loved This Place!!", "helpfulness": 8, "user": "chelb33", "date": "April 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7303963, "likes": {"liked": "— Price and Location", "disliked": "— Like everything."}}, {"rating": 4.0, "title": "Great Value", "text": "We booked the Staybridge Suites with Trailfinders as part of our trip to Florida in Sep 2005.", "helpfulness": 5, "user": "RoryMc", "date": "July 17, 2007", "id": 8131785}, {"rating": 5.0, "title": "stay here you'll love it", "text": "From memory, this was a perfect base when staying in Orlando; very reasonably priced, clean, and the suites were spacious, tidy and quiet.", "helpfulness": 6, "user": "sparklew0rks", "date": "July 14, 2007", "id": 8116383}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "Check-in was efficient and the hotel had a well run feel to it, never felt crowded and was very relaxed. There was a good business centre with internet facilities, and a regular free shuttle bus to the various Disney parks. Breakfast was very good, with plenty of choice to fill you before a busy day in downtown Disney!", "title": "most comfortable hotel beds ever", "helpfulness": 13, "user": "clwBoston", "date": "June 16, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 7856972, "likes": {"liked": "— comfortable beds"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "If returning to Orlando, i would certainly consider staying here again!.", "title": "L O V E D the Staybridge Suites!", "helpfulness": 9, "user": "TNFamily", "date": "June 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7835144, "likes": {"liked": "— Pool area"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "loved the staybridge suites. would recommend it to all", "title": "Couldnt have asked for more!", "helpfulness": 10, "user": "JAtkinson", "date": "June 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7802066, "likes": {"liked": "— Everything", "disliked": "— Nothing to dislike"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Just back from two weeks at the LBV Staybridge and would definitely return. I would echo all of the recent positive comments about the rooms / amenities / staff. In particular, we liked the:", "title": "Great family hotel - lots of extras + handy for Disney", "helpfulness": 3, "user": "Diffy", "date": "April 8, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7292449, "likes": {"liked": "— Good sized rooms (2 beds + lounge / kitchen + 2 baths)", "disliked": "— Not having our own car, it sometimes took a while to get a bus / taxi to get around"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "- free breakfast buffet (lots of choice)", "title": "Great Place", "helpfulness": 5, "user": "traveler029", "date": "April 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7278659, "likes": {"liked": "— Suite", "disliked": "— Lack of Elevator"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "- free Tues - Thurs Sundowner snacks / drinks", "title": "Was better than expected", "helpfulness": 4, "user": "zikki4", "date": "April 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7270418}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "- free buses to Disney Parks (a bit late at times but it was v. busy)", "title": "Great Place to stay", "helpfulness": 4, "user": "bzartman", "date": "March 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7238416, "likes": {"liked": "— comfortable rooms", "disliked": "— no elevater"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "- the pool area", "title": "Great place for families", "helpfulness": 4, "user": "cathsann", "date": "March 6, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6920581, "likes": {"liked": "— 2 bedrooms", "disliked": "— noise"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "Our family just returned from a 6 night stay at the Staybridge Suites in Lake Buena Vista and had a fabulous time. We booked through West Jet Vacations and got a reasonable package deal and were really impressed with the hotel. We had a 2 bedroom suite with 2 bathrooms a kitchen with a full size fridge stove microwave and even a dishwasher.The rooms were clean and the beds very comfortable. THe pool was very nice although we only used it once as we were on the go the whole time lots of loungers and towels. The grounds very well kept. The buffet breakfast was wonderful even for fussy eaters like my kids they found plenty to chose from. We did not use the shuttle system as we rented a car since we have small children and did not want to have to wait for a shuttle. I did look at the shuttle schedule and it did look like it ran on a regular basis. This hotel is in a great location just 15-20 min away from the 4 disney parks and downtown disney. There were plenty of restaurants near by and also a Winn Dixie across the street which was handy to purchase drinks and groceries if you wanted to cook. We booked our disney passes with ticketmania they have a web site and got a bit of a better price than getting then from Disney I think we saved the tax which is a big savings when purchasing 5 tickets. We had them deliver them to our hotel the day we arrived which was only an additional $6.00 and they were there waiting for us with a welcome package with loads of info. We also booked a make over for my daughter 6 years old at the Bibbity Boppity Boutique which we booked a few months ahead this was worth every penny for $45.00 she got the crown package which includes a hairstyle which includes hair piece hair accessories makeup and nails by a fairy god mother in training. She wore her own Belle Costume so we did not purchase one there. THis is an amazing experience for little girls they are made to feel like little princesses. We also went for a photoshoot and purchased 5 pictures for $30.00 and they are beautiful they did a wonderful job. After the make over we went to Epcot the Norwegian Pavilion Akerishus for Story Book Dining and had dinner which was also booked ahead of time. Belle Jasmine Princess Aurora and Cinderella were there they stopped at each table to sign autographs and have photos taken with your children a great experience. This was a wonderful vacation and we can not wait to return to the Staybrige Suites.", "title": "Wonderful place to stay", "helpfulness": 8, "user": "canukbajan", "date": "June 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7796689, "likes": {"liked": "— Location and buffet breakfast", "disliked": "— not a thing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "We stayed at the Staybridge Suites - Lake Buena Vista - from May 16-23. Check in was easy - with the representative explaining which rooms were \"quieter\" - we selected one on the end away from the main highway.", "title": "Great Hotel", "helpfulness": 8, "user": "PAlovestotravel", "date": "June 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 7774219, "likes": {"liked": "— cleanliness", "disliked": "— no elevator"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "The 2 bedroom 2 bath suite was great! Very clean. The kitchen area consists of a microwave, full size refrigerator, dishwasher, sink, full size stove. We found the suite gave us lots of room - 2 kids and one adult. The bedroom with the king size bed was", "title": "Great time at the Staybridge.", "helpfulness": 6, "user": "Gigantorq", "date": "June 1, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7731316, "likes": {"liked": "— The breakfast buffet", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "large, with an inroom safe and walk in closet. The other bedroom had 2 double beds with a large closet and it's own bathroom. The suite had 3 TV's.", "title": "Great Place for Family Vacation", "helpfulness": 6, "user": "niceicelady", "date": "May 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7672045, "likes": {"liked": "— Accomodations were perfect for a family vacation", "disliked": "— Kitchen a little dated"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "There is a laundromat on site and they even provide a laundry basket in case you decide to use the laundromat!", "title": "Loved the Staybridge Suites", "helpfulness": 7, "user": "madness0284", "date": "May 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7644850, "likes": {"liked": "— Like home away from home", "disliked": "— Nothing, honestly"}}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 21, "average": 71, "very good": 243, "terrible": 22, "excellent": 441}, "aka": "Staybridge Suites Lake Buena Vista Hotel Orlando", "slim_ranking": 0.0668693009119, "detail_rating": {"service": 4.5, "cleanliness": 4.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Staybridge Suites Lake Buena Vista is the perfect spot to choose as your home base for your next Disney Vacation. Located in the Lake Buena Vista Resort Area, the hotel is just one mile from the magic of the Walt Disney World; Resort. Our Signature Two Bedroom/Two Bath Suites provide comfort and convenience for everyone in the family. Other attractions nearby include Universal Orlando and Sea World. Convenience and comfort abound at Staybridge Suites Lake Buena Vista. With this convenient location you'll find numerous restaurants, shops, and small attractions are either within walking distance or just a short drive away. On property you will find recently redecorated suites, an inviting lobby area, beautifully landscaped grounds, courtyards, gazebo sitting area, a heated swimming pool, children's pool, jacuzzi, video game room, as well as laundry facilities. Our Disney Vacation Packages offer flexibility and money saving options. Magic Your Way Tickets offer each family the ability to customize their tickets for their next Disney Vacation. Getting to the parks is also no problem, with the complimentary scheduled shuttle service to the four Walt Disney World Parks. Our Reservation Sales Agents are standing by to help you plan your next magical Orlando Vacation. Call our Orlando Reservations Office at (800)866-4549 and make Staybridge Suites Lake Buena Vista, Your Place!"}