{"user_rating": 4.5, "review_count": 852, "name": "Steigenberger Hotel Berlin", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "My partner and I stayed at the Steigenberger Hotel for 3 nights in late August 2011. I knew that I wanted to be in West Berlin and adjacent to good public transport. In this respect the hotel is excellent; a shortish walk from the airport-city centre bus stop at Bahnhof Zoo and convenient too for the Underground. The hotel location is also fairly quiet, with no major thoroughfare close by.", "title": "excellent choice", "helpfulness": 1, "user": "revitalise", "date": "November 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 120562320}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Accommodation was excellent, the room having evidently been recently refurbished. It was not especially large but perfectly adequate. The bed was extremely comfortable. The bathroom did not have a bathtub but the shower was powerful and very acceptable.", "title": "solid hotel, great location, decent price", "user": "arnsch", "date": "November 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120542704}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "The buffet breakfast was splendid, one of the best I've seen. The restaurant in which it is served is light and airy.", "title": "Could have been 5 points...", "helpfulness": 2, "user": "Hans55", "date": "November 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120491586}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Staff throughout the hotel were extremely friendly and efficient.", "title": "excellent hotel in a great location", "helpfulness": 1, "user": "rbc_8", "date": "November 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120415827}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "The hotel is located in walking distance from Zoo train station - even with a bit of baggage. The trip from the airport by public transport was very easy.", "title": "Nothing less than brilliant!", "user": "etroyoslo", "date": "November 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120323192}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We’ve stayed in Berlin previously (At Alexanderplatz) and chose to go back as we love the city and had a great time when first there. We chose the hotel because there was a good deal on Expedia.", "title": "Fantastic hotel, perfect location", "user": "Stappers", "date": "July 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 35499751}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "We arrived at Schoenefeld and got the train to Zoologischer garten for only a few Euros each and took about half hour. Zoologishcher garten to the hotel is about 5 minutes walk at the most so I couldn’t recommend this more.", "title": "Great Hotel for Conferences", "user": "ansjohnson7", "date": "July 5, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 33944656}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "Check-in at the hotel was quick and we got shown to the room that was hassle free. The rooms were excellent and furnished to a high standard. We couldn’t complain about anything in the room. The bed was very comfortable and the shower was excellent and was upto the four star standard expected.", "title": "Ok, but not for business travels", "user": "JimBeam", "date": "April 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 27410478}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "We didn’t use any of the facilities at the hotel other than the office, with internet access that was free charge. They also have a free wireless internet connection. We looked in the spa that looked fantastic and had a huge Jacuzzi aswell as a sauna, steam room, loungers and some fitness equipment. This rarely seemed busy whenever we walked passed especially during the day when it was almost deserted.", "title": "Staff and service exceptional, in a very good hotel - strong recommendation.", "helpfulness": 1, "user": "george57l", "date": "March 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25512025}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled with friends", "text": "The staff were very helpful from reception to the cleaners and the concierge who were all very friendly and went out of their way to help on every occasion.", "title": "Quiet, comfortable 4*, but soul-less", "user": "PontySpur", "date": "February 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 24958101}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Alright so another 4+ Star hotel in the books and I must say this doesn't compare to others I've stayed in that are equal or higher in star category. I ended up choosing this hotel for a couple reasons. First, I was short on time and availability for avail rooms for New Years Eve in Berlin. Second, location was key in my decision as i wanted easy access to public transportation, a friendly neighborhood for the wife to walk the dog, shopping, food both the fast and the sit in variants and enclosed parking for the car. Last I was using previous customer reviews to help sway my decision. Now the hotel for the price was only okay. As mentioned in previous reviews there may have been a renovation or something at one point as the lobby and entry into the hotel was magnificent but when we entered our room it seemed like the forgotten one...actually the forgotten floor or more specific one of the non smoker floors. Maybe this is just Steigenberger quality or Berlin flare but the room didn't really meet my expectations of a 5 star hotel of such a prestigious European chain. Wood cabinetry seemed dated, tv was antiquated (still don't get why not just use LCD screens at places like this) and the bed was actually the Euro standard of two separate beds put together to form \"one\". Surely they would just have one piece queen/king mattresses, no? The best part of the room for me was the bathroom. Seemed as if it actually got the makeover. Nice granite countertops with dual sinks for me and the lady and a nice deep bath/shower. Also of note is that this hotel does allow dogs at the rate of 15 Euro a night, which is fine with us because we love travelling with our 7 month old Boston Terrier. Overall i rate this as only a decent hotel as far as specific facilites go to match star rating. When it comes to location and access it's near the top as it puts you smack dab in the center of the main shopping boulevard and a quick step to the U/S Bahns and even the bus station (local hub at Zoological Gardens). Oh and free Wi-Fi, you just have to ask for the key otherwise you will never know.", "title": "New Years 2009 in Berlin!!!", "user": "harryo2b", "date": "January 5, 2009", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 23291239, "likes": {"liked": "— Location, ease of access, parking", "disliked": "— 5 Star hotel without the 5 star room quality."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We visited Berlin on a three day trip Sunday through Tuesday at the end of October 2008 and stayed at the Steigenberger Berlin.", "title": "Berlin Experiance", "user": "jcjimc", "date": "November 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 21856381, "likes": {"liked": "— Access to city centre"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We drove to Berling arriving early on the Sunday morning at 10.30am after parking our car in the hotels underground parking facility we took the elevator to the reception area and our Steigenberger experiance began.", "title": "Nice hotel", "user": "qcbear", "date": "October 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20776521}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled solo", "text": "The staff on reception were so helpful and we were allocated our room immeadiately as normally one has to wait at such an early time in the day.", "title": "Very solid hotel in a great location", "user": "midway42", "date": "October 5, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 20650542, "likes": {"liked": "— Location.", "disliked": "— Nothing."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled solo", "text": "The location is in the heart of the city and within walking distance of many tourist attractions as well as easy access to the underground train system.", "title": "What a breakfast !", "helpfulness": 2, "user": "NorthWalesMillie", "date": "August 29, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 19505836, "likes": {"liked": "— Breakfast", "disliked": "— never found the stairs"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "To start with the obvious, this is not quite a five-star hotel. It simply lacks the elegance, the small small details, of those really exceptional hotels that are few and far between.", "title": "Great hotel, excellent service, excellent location", "helpfulness": 1, "user": "ysolde", "date": "December 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 122331346}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "That said, the Steigenberger is an amazing place. It is located on Los Angeles Platz, just off the fashionable Ku'damm (Berlin's version of the Champs Elysees). Incredible shops, restaurants, boutiques, and cafes are just steps away. The view from our room was to Los Angeles Platz itself, and it was a lovely way to wake up each morning. Our room, on the sixth floor, was large enough and quite comfortable, and included a bathroom with two sinks, something every couple could use.", "title": "good and well locate hotel", "helpfulness": 1, "user": "Agos2011", "date": "December 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 122179325}, {"rating": 4.0, "stay_parameters": "Stayed December 2011", "text": "The Steigenberger really distinguishes itself with excellent, excellent service. When I had a bad head cold and was feeling worn out, an extra comforter and even a space heater were quickly found for me (on Christmas!). Meals at the hotel restaurant were delicious and served by a delightful staff that seemed truly happy to be there. Housekeeping was prompt and helpful every time we called them. The front desk was available, friendly, and incredibly helpful day and night. This is how you run a hotel!", "title": "Top class accomodation, in an excellent location!", "user": "BladonFamily", "date": "December 22, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 122003316}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Loved this hotel for a family Berlin holiday. The two rooms were quite confortable and the staff were very helpful and friendly. Good styled hotel in a good position a few blocks from KaDeWe meant that the metro and an abundance of great restaurants were minutes away. Buffet Breakfast was really good (german style).", "title": "All under one roof Hotel", "user": "KoningBokko", "date": "December 18, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121852984}, {"rating": 1.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Had a very enjoyable stay at this hotel in Dec , less than a 10minute walk from the train station. The hotel is in a fab location to reach other parts of Berlin. We walked one day past the zoo through the park & upto the main historical sights, Brandenburg Gate, Reichstag, Tv tower and numerous Xmas markets, etc. Hotel room on floor 2 was great quite close to pool, sauna, etc which was lovely to use at the end of the day. Only drawback was the high cost of drinks in the hotel, but as there is so much near by it is easy to get food, drink elsewhere. Really nice Italian restaurant called Doro, turn left out of hotel & left again, very good food at reasonable prices. Hotel reception most friendly and helpful. Highly recommended.", "title": "Overbooked!", "helpfulness": 1, "user": "Kate-go-round", "date": "December 17, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 3.0}, "id": 121818651}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "I really enjoyed my stay at the Steigenberger Berlin and would recommend it to anyone travelling to Berlin for the first time. The hotel location is perfect and is situated in a relatively quiet street just off the heart of the shopping district, the Ku'Damm. The staff were friendly, helpful and professional, especially Mr Lendt, who helped us with most our our quieries.", "title": "Highly recommended for first timers in Berlin", "helpfulness": 2, "user": "hippyhappytraveller", "date": "December 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 121627538}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "The room was very comfortable, clean and modern and the spa facilities were great after a hectic day of sightseeing! The buffet breakfast was fantastic, lots of choices, so there was no need for a big lunch.", "title": "Nice Hotel, good location and perfect service", "user": "mary0128", "date": "December 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121585557}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "It proved to be great value for money, especially for 4 days, and I would definitely stay here again.", "title": "Lovely hotel with a friendly atmosphere.", "helpfulness": 1, "user": "Andraprinceppe", "date": "December 5, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 121429170}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "We went to Berlin on a business trip and chose this hotel because it has a perfect location. Shops of the Ku-damm are just close by and there are plenty of restaurants to choose from. The hotel has a nice lobby and neat rooms, very warm and comfortable. I really liked the fresh rose in the bathroom which gave it a special touch. The breakfast is great. The breakfast area was crowded one morning and we were seated in an additional room. Although we were the only ones there, there was always someone taking care of us, even though it was a busy time. The staff at the front desk was also very nice and helpful. I would absolutely recommend this hotel to anyone who would like to stay close to the Ku Damm in the heart of Berlin.", "title": "Fabulous Hotel", "helpfulness": 2, "user": "dumbo77", "date": "December 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121414077}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "Thoroughly enjoyed our 3 night stay at this lovely hotel. The staff were friendly, helpful, welcoming and professional. The facilities were very good, pool lovely and warm. The location was good, very near to main shopping area. The piano bar is very relaxing after a day of sightseeing, lovely cocktails or tea/coffee and delicious cakes for the non drinkers, with live music at the weekend. We stayed in an executive room on the 5th floor, large comfortable room but bathroom a bit on the wee side. The beds were super comfortable and all in all, i would definately stay here again.", "title": "Decent stay", "helpfulness": 2, "user": "Gourmand_nl", "date": "December 4, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 121374442}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The Steigenberger, Berlin where we spent 4 nights over 5th to 8th Aug, is like a well preserved ‘jewel’ hidden away just a block away from the bustling Ku’Damm in a quiet garden area! Apart from its excellent location right next door to the Ku’Damm & the vast selection of restaurants and stores, the Executive Floor we were upgraded to had rooms classy in looks and fittings and a dream of a bed going with it! The view into the leafy garden next door was pleasing on the eye. While strict efficiency was very much on display in the hotel lobby, housekeeping etc, the hotel management might want to encourage their Reception Staff to sport a smile or two while welcoming guests! It only adds to your ‘Class’.", "title": "Quiet Elegance!", "helpfulness": 3, "user": "VSKrishnan", "date": "November 30, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121242612}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "I took my wife, son and an aunt for a nice weekend in Berlin in January '10.....the two rooms we booked shared a nice private entry. Although rather small they were tastefully furnished, with very comfortable bedding and of course immaculate overall. The location, on quiet Los Angelesplatz within walking distance of the Zoo station, can't be beat....Ku'damm and Kaufhaus Des Westens department store (KaDeWe) are within a few hundred meters. We were very impressed with how quickly the city workers cleared the streets after a major snowstorm/near blizzard (,,Daisy'') and the hotel staff kept the icy-wet doormat from becoming a mess. Staff is very helpful, yet the piano bar downstairs was nearly empty, and seemed a bit dated-looking. The giftshop and restaurant were forgettable, and the atmosphere overall seemed just a bit stuffy and dated, like it had seen better days. After staying at the newer Steigenberger in Dresden I came to expect exemplary service for the five-star hotel chain. The Berlin Steigenberger seemed just a bit shy of exemplary but adequate nonetheless. After two days we moved to the nearly-new Mercure Hotel Checkpoint Charlie.....Berlin-Mitte seems so much more alive!", "title": "Very good, just not quite GREAT. Your grandmother's hotel choice, maybe", "helpfulness": 2, "user": "jimwentzell", "date": "November 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121099991}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "I've stayed at the Steigenberger twice this year. Liked it so much when I stayed the first time that I came back. The rooms have been renovated, so they're very modern, clean and comfortable (my only complaint is the bed -- time to turn the mattress -- too soft on one side; and btw, I wish someone would tell me what German hotels have against placing a single large blanket on a queen sized bed rather than two single-sized blankets!). The hotel sits on a plaza (Los-Angeles-Platz), so if your room faces the plaza it's very scenic... lots of trees and grass, and very quiet. Front desk is always very helpful, especially when you need directions or recommendations for Berlin sightseeing. The Steigenberger is just a block from the main shopping district in Charlottenberg, including KaDaWe, a very large, very cool department store with huge selection and nice atmosphere. 4-star quality for 3-star rate. Highly recommend it!", "title": "Comfort, Service, Location +++", "helpfulness": 2, "user": "Jetspin", "date": "November 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 121095836}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I go often in Berlin for my work, and always I stay in this hotel..", "title": "Very good hotel", "helpfulness": 1, "user": "Uchy0", "date": "November 16, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120653302}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Is really a very good hotel, the rooms are nice, the personal is kind.", "title": "5 star experience", "helpfulness": 1, "user": "CAOLILAWELL", "date": "November 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120629624}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "This hotel is not a 5 star. (as Expedia rate it)", "title": "Not a 5 star... Great Location", "helpfulness": 1, "user": "KatPrints", "date": "January 24, 2008", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 2.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 12963960, "likes": {"liked": "— Location", "disliked": "— House Keeeping"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "On the luxury front it barley scrapes a 4 star.", "title": "Disappointed", "helpfulness": 1, "user": "Vonsie", "date": "November 9, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 2.0}, "id": 10715617, "likes": {"liked": "— Great breakfast - make sure you get it in your rate!", "disliked": "— Not great if there are three people in one room."}}, {"rating": 3.0, "title": "Not my option of 5 Stars", "text": "The rooms are outdated, tired and in need of renovation.", "helpfulness": 2, "user": "tony1976", "date": "September 17, 2007", "id": 8739267}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "That said it is fantastically located; in easy reach of most of the sights, just off Berlin’s main shopping streets, 2 minutes from 2 different underground stations and 10 minutes from the train and bus terminal. It is close some very nice (if tourist-y) restaurants and bars.", "title": "Best value in Berlin", "helpfulness": 2, "user": "1doyler", "date": "August 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8433793}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "It is value for money (if mis-starred and therefore mis-sold)", "title": "Great hotel in a great location!!", "helpfulness": 7, "user": "GraceDublin", "date": "May 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 7704892, "likes": {"liked": "— location and great service", "disliked": "— room size and view from room"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "Don't bother reading the other reviews, as this hotel is as good as it gets for the price. It is a 4/5 star hotel and has all the services you need. This was my third stay and it is great value for money and a great city centre location for tourists. I was at a conference in the hotel and the conference facilities are some of the best in Europe. The only negative thing is the outside look of the hotel which is very 1960s, but inside it is great and the rooms are not large, but quite adequate.", "title": "Lovely hotel and reasonably priced", "helpfulness": 1, "user": "Berkshire_UK", "date": "April 18, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 15117417, "likes": {"liked": "— Executive floor", "disliked": "— Outside look of the hotel"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "Taxi from the Tegel airport is less than 20 Euros....", "title": "First Class Hotel", "user": "Nisirian", "date": "March 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14140968}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "On this stay I was upgraded to the Exec floor, with lounge facilites available until 9pm, inc Champagne.....", "title": "Excellent", "helpfulness": 1, "user": "karamera", "date": "February 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 13686619, "likes": {"liked": "— Location, breakfast, spacious room"}}, {"rating": 1.0, "title": "book somewhere else", "text": "Don't bother looking anywhere else.....stay here!", "helpfulness": 1, "user": "torontotoronto75", "date": "February 7, 2008", "id": 13368518}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Central location for tourists & within easy walking distanceof the railway station & shopping malls.", "title": "Personality Conflict: 3 Star trying to Be 4 Star, Classic Trying to Be Modern.", "user": "Montylicious", "date": "January 26, 2008", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 13004151, "likes": {"liked": "— Bar", "disliked": "— Front Desk Service and outdated room"}}], "location": {"country": "Germany", "continent": "Europe"}, "stars": 5, "variance": {"poor": 38, "average": 74, "very good": 305, "terrible": 9, "excellent": 426}, "aka": "Steigenberger Berlin Hotel", "slim_ranking": 0.101949025487, "description": "First class hotel with a fabulous location in the heart of the city near the landmark “Memorial Church” , known for its traditional quality, german style and friendly, efficient service. Ideal for all: shopping, business, leisure, relaxation. The hotel offers 387 renovated guest rooms and 11 suites equipped with air-conditioning, in-room safe, minibar etc. Free WiFi throughout the building. 2 restaurants, 1 bar, swimming pool, sauna, massage, boutique, hairdresser, cigar shop, garage. 16 banqueting rooms with natural day light for up to 500 people, State-of-the-art techical facilities."}