{"user_rating": 4.5, "review_count": 704, "name": "Steigenberger Hotel Herrenhof Wien", "reviews": [{"rating": 5.0, "title": "High quality & very conveniently located hotel", "text": "Most of tourist Vienna is within quite a small area, inside or very near the Ring. The Steinberger is perfectly located: Very central but also very quiet. It is an easy walk to most places of interest.", "user": "gmbklm", "date": "January 27, 2010", "id": 54483170}, {"rating": 4.0, "title": "Very centrally located - good hotel", "text": "Front of house reception was very helpful and very efficient.", "user": "Ragnhild", "date": "January 14, 2010", "id": 53469637}, {"rating": 5.0, "title": "Fantastic", "text": "Our stay included the 2009 New Years Eve period. Vienna really outshines most other places on 31st Dec. Great atmosphere and lots to see and do; and to drink and eat !!", "user": "Tyrian S", "date": "January 12, 2010", "id": 53242812}, {"rating": 5.0, "title": "perfect", "text": "Our 4th floor room was very quiet, facing the subway side rather the front road. The bedroom was very modern, well appointed with high quality fittings and linen, very tasteful furnishing, and with a very comfortable bed. Had a free basic minibar, which is a low cost nice touch.", "user": "bezzaEngland", "date": "January 4, 2010", "id": 52559435}, {"rating": 5.0, "title": "What a great hotel!", "text": "The shower room was very good: Spacious and very well equipped. But that is a key part of what you’re paying for.", "user": "JulianeT", "date": "January 2, 2010", "id": 52376198}, {"rating": 4.0, "title": "Going to congress in Vienna, part 2", "text": "As I wrote in a previous review of K+K Maria Theresia (KKMT) I wuld try another hotel and this is it. Once again it was Marc and time for the annual congress visit. This tiem I decided to try a larger and more expensive hotel to see what I am missing. Steigenberger Hotel Herrenhof Wien (SHHW) seemed like the best choice.", "user": "screenname060309", "date": "March 10, 2010", "id": 58250485}, {"rating": 3.0, "title": "Concierge ruins the night!", "text": "Location: there is virtual no difference between SHHW and KKMT, but still SHHW is minimally better. First of all it is very close to major attractions, especially the central café which is very nice and elegant. The distance to subway is 10 sec! which is almost one-two minutes less than the distance between KKMT and the nearest subway. In order to go to congress center you have to change your station anyway.", "user": "dry_surfing", "date": "March 1, 2010", "id": 57487012}, {"rating": 4.0, "title": "Top location, top food - a very good hotel", "text": "Convenience: As you enter the hotel you have two steps and there is a doorman to greet you. There is no ramp. Therefore the situation is much better than KKMT.", "user": "yogimo", "date": "February 27, 2010", "id": 57224123}, {"rating": 5.0, "title": "Great hotel, excellent location, would definitely come back and recommend it to others", "text": "Rooms: the room I had was a corner room at the last floor. The room was very spacious and large. The only problem was that there was another door almost immediately behind it. Unlike KKMT the doors are very heavy and thus much better noise isolation. KKMT was not disturbing but you could hear people walking in the hallway. The two heavy doors however made going with stuff very difficult. For instance when I had room service one night and I wanted to leave the tray outside, it proved very difficult to manage this alone. The doors were also a problem, they did not open easily as I had to try many times for the electronic key to become activated. The ceiling was very high and nice. The views from the room were great.", "user": "Miruna_R", "date": "February 25, 2010", "id": 57055003}, {"rating": 5.0, "title": "great location, excellent service", "text": "It did snow a lot when I was there but SHHW does not provide umbrellas like KKMT.", "user": "Jumuju", "date": "February 1, 2010", "id": 54935419}, {"rating": 5.0, "title": "Extraordinary Service", "text": "This hotel is wonderful. Expedia completely messed up our reservation - i.e. after airline delays we arrive at almost 11pm and there is no reservation for us, even though we'd already paid through Expedia! To make matters worse, the hotel was completely full so they couldn't accommodate us. This had all the makings of a disaster weekend trip. But, the manager on duty was called in and took charge. We were sent to sit in the lounge while she talked to tried to sort out the error and tried to talk to Expedia. Expedia was useless. But, the manager arranged a room for us at another hotel AND arranged a taxi to take us over there. The next day they had space so we would come back then. They even upgraded our room for the night we were with them. Remember NONE of this was their fault!! I would highly, highly recommend this hotel.", "user": "NYer_in_London", "date": "December 17, 2009", "id": 51388537}, {"rating": 4.0, "title": "everithing is ok", "text": "excelent location", "user": "a_decent_tourist", "date": "December 9, 2009", "id": 50949812}, {"rating": 4.0, "title": "Be careful", "text": "the room is great", "user": "Olos", "date": "December 8, 2009", "id": 50896025}, {"rating": 5.0, "title": "Perfect", "text": "the services and the personal are good", "user": "AlterAthens", "date": "December 6, 2009", "id": 50759840}, {"rating": 5.0, "title": "Fantastic hotel in a great location", "text": "I will stay there anytime I will go in Vienna", "user": "stalban55", "date": "November 23, 2009", "id": 49918319}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "We really enjoyed our stay in the Herrenhof. The staff could not have been more helpful particularly Bernard the Concierge who recommended some lovely restaurants. We had breakfast in the Central Cafe every day and it was fantastic value.", "title": "Friendly, helpful staff in a lovely hotel", "helpfulness": 1, "user": "MelMPM", "date": "November 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49765083}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "We stayed for one week in Oct/Nov and chose to stay here based on travelocity reviews. We were not dissapointed! The hotel was exactly what had been discribed; luxury, great location, helpful and friendly staff.", "title": "Lived up to expectaions!", "helpfulness": 2, "user": "LeslieGarland", "date": "November 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49553249}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Wonderful hotel and excellent central location. All the lovely sites of Vienna on your doorstep and within walking distance. If you don't want to walk then the Uber bahn is just round the corner. Hotel and service were first class and didn't disappoint once. Excellent all round.", "title": "WOW", "helpfulness": 2, "user": "Catsusie", "date": "November 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49176462}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "Stayed here for two nights on a business rate so was upgraded to a loft suite. It was simply excellent on all fronts. I agree with previous reviews which have covered most issues in depth. My only regreet was that I was not here with my family to enjoy such a plush room and service.", "title": "Excellent hotel", "helpfulness": 1, "user": "nkem", "date": "November 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 48710893}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "not sure if i was more impressed by Vienna or this hotel ... location of the hotel was fantastic as it was very near to and Michaelplatz and not far from Stephansplatz. great starting point to see the sights, and the hotel was also very grand and quite modern. it was new-ish and the staff was very helful ... my only complaint was that the internet was down when i was there", "title": "Fantastic, almost like the movies ...", "helpfulness": 1, "user": "DQC_76", "date": "November 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 48700681}], "location": {}, "stars": 5, "variance": {"poor": 10, "average": 54, "very good": 197, "terrible": 8, "excellent": 435}, "aka": "Steigenberger Hotel Vienna", "slim_ranking": 0.0762942779292, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Many of Vienna's greatest attractions are right on our doorstep. Located in the government quarter in the first district, the Steigenberger Hotel Herrenhof is in the very heart of the old town. The hotel, restaurant, cafe and bar are popular among business and leisure travellers alike. Take a stroll past the Hofburg, Kohlmarkt, State Opera House and the many other nearby sights. Most of Vienna's cultural treasures are just a short walk from the hotel. Starting on January 1st 2014, the usage of the WLAN will be free of charge for guests of all hotels of the Steigenberger Hotels AG."}