{"user_rating": 5.0, "review_count": 285, "name": "Stocks Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Unfortunately we were only able to spend one night in Sark at Stocks. The room (Dixcart) was lovely and the bathroom exquisite. The small 'touches' throughout were very much appreciated. A room we would certainly request on our next visit.", "title": "Comfort at its best", "user": "Sauvarin", "date": "June 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164714858}, {"rating": 3.0, "stay_parameters": "Stayed June 2013", "text": "The reception rooms were very relaxing, a plus point for bad weather days. Smugglers Bar was very atmospheric (keep an eye out for pirates!!). Congratulations to the gardeners for keeping the grounds immaculate.", "title": "Disappointed stay", "helpfulness": 1, "user": "zetamay2", "date": "June 18, 2013", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 164338981}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "We can certainly recommend the Sark Farmhouse breakfast. You won't need anything else for the rest of the day!", "title": "Superb Hotel on Sark", "helpfulness": 1, "user": "alphabravo1", "date": "June 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164305916}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Feel very disappointed with stocks hotel. Very expensive for what you get. Asked for a very quiet room not near the bar got a downstairs room directly outside the bar with stairs running at the side of the room with no privacy at all and this was a luxury suite room. Food choice on menu was very limited and the food itself was only mediocre. I am a chef myself and my steak was overcooked when requested medium rare. Staff were very nice. The best part of the stay was the horse and carriage ride and lovely Julie the very experienced handler.", "title": "Just wonderful!", "user": "1977couple", "date": "June 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164231017}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Stark has a timeless quality. As you cycle down earth roads with no cars, tarmac or streetlights and with fields on every side, it feels as I imagine Britain must have been like in the early years of the twentieth century. Stocks fits right in but with every modern convenience. It is a lovely hotel with an old world 'family' feeling. The staff are are friendly, the food excellent, the rooms are bright and spacious. We stayed four days in May/June and would have loved to have stayed longer. We look forward to staying again.", "title": "Faultless.", "user": "JRRBerkshire", "date": "June 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163961357}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "We have holidayed on Sark for over 20 years, but now we visit the Channel Islands more often than ever, on short stays, as our son has married a Guernsey girl! Stocks Hotel has always been the friendly and welcoming family-run establishment for which Sark is famous. The recent redevelopment has added many wow factors, and make it easily the best hotel on the island. High quality accommodation (my tall husband could stand up straight everywhere!), excellent friendly service, and superb restaurant - what more could anyone wish for? Not to mention the magical surroundings of course. (I don't want anyone else to read this - Stocks might get too popular...!)", "title": "Lovely peaceful break", "helpfulness": 1, "user": "909Jane", "date": "June 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 162947827}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Truly a first class experience staying at Stocks this week.The food was excellent, very attentive and accommodating staff, a lovely bedroom and of course the lovely weather helped too. Also I thoroughly recommend both the massage with Marious and the horse and carriage tour. Thank you Stocks for putting the magic back in Sark!", "title": "Fabulous stay", "helpfulness": 1, "user": "MAJ71", "date": "June 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162754384}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "A great trip to Sark with just one night in Stocks. We got a fantastic rate by ringing the hotel directly and were welcomed to a lovely room with a huge bath and shower. They gave us a bottle of Champagne to welcome us and we spent the afternoon by the lovely pool drinking cocktails. Dinner was great and their selection of whiskeys in the bar from around the world is truly out of this world. The crowning glory, in my opinion, was the Sark farmhouse breakfast with a great cooked full english, homemade pastries and a wonderful selection of cheeses, juices and homemade yogurts. The staff were really welcoming, and all in all it was a fantastic place to stay. Will definitely be going back!", "title": "A great short break in a beautiful hotel", "helpfulness": 1, "user": "James_Smith273", "date": "June 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 162700850}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "An excellent hotel with a great family room for 2 adults and 2 kids. Staff were very friendly and helpful and food was excellent.", "title": "Great family hotel for a relaxing break", "helpfulness": 1, "user": "Andrew q", "date": "June 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 162652102}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Sark is a wonderful island to relax and get away from a busy life for a few days and the Stocks hotel atmosphere definitely adds a lot to the relaxing process - even with two young kid!!", "title": "Five star comfort in a unique environment", "helpfulness": 1, "user": "ArtemisTT", "date": "June 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 162636362}, {"rating": 5.0, "title": "Brilliant as always", "text": "Fabulous breakfast of eggs benedict. Most delicious lunch of crab linguini and did try another venue for afternoon tea which was far from pleasant so came back to Stocks for afternoon tea and they delievered once again. Top notch!!", "user": "Jayne S", "date": "August 24, 2012", "id": 138177790}, {"rating": 4.0, "title": "Lovely recently-renovated hotel", "text": "As with most establishments in Sark, this hotel is in a very quiet location, which we discovered at the end of a footpath leading away from the tourist office. It can also be reached by road which is slightly further.", "user": "BobHilbourne", "date": "August 21, 2012", "id": 137907282}, {"rating": 5.0, "stay_parameters": "Visited August 2012", "text": "The property has been extended and renovated very tastefully and finished to a very good standard.", "title": "Lovely way to spend an afternoon.", "user": "heppers", "date": "August 18, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 137525256}, {"rating": 5.0, "title": "pretty perfect", "text": "We were just looking for lunch and found a table by the pool bar. Drinks were good - a cider for my wife and a local CI draught beer for me.", "user": "guernseyone", "date": "August 17, 2012", "id": 137495737}, {"rating": 5.0, "title": "Divine food", "text": "The food was excellent with the emphasis on fresh seafood.", "user": "EBL83", "date": "August 16, 2012", "id": 137344307}, {"rating": 5.0, "title": "Like all eataries in Sark Stocks does fine dining well.", "text": "I love the fish dishes as it is usually locally caught.Fine dining on such a small Island as this is exceptional. Even cream teas along the way are good value.Ferry fare quite high but you can entertain yourself well and eat well. The Ferry ride over is enjoyable if you like boats but perhaps be warned there is a bit of a swell coming into the small harbour.", "user": "Denise P", "date": "January 9, 2013", "id": 149278900}, {"rating": 5.0, "title": "Excellant", "text": "Quite a few hotels on the Island but so glad we choice Stocks. Excellant service, excellant staff, excellant hotel and excellant surroundings", "user": "Yvonne0408", "date": "November 9, 2012", "id": 145038945}, {"rating": 5.0, "title": "Sarks Little Gem", "text": "Second visit in three months, staff exceptional, hotel brilliant, rooms and food probably the best on the island.", "user": "G960", "date": "October 24, 2012", "id": 143605219}, {"rating": 4.0, "title": "But losing its gentle Sarkness", "text": "You'd be delighted to arrive at Stocks for a holiday, perhaps especially with a young family, it's really very good, its just that once you have arrived you could be anywhere. We had a celebratory lunch for twelve, three Mancunians, six Jersey beans and three Sarkese. It was terrific in every respect, one barman was a joy, one was not. The food was great and we did all have a lovely time. I just preferred the days when it was a little more idiosyncratic and a lot more charming. Even tho' I personally don't like the changes, I think I understand the rationale and fully admit that all the new works are beautifully thought out and executed.", "user": "Paul B", "date": "September 25, 2012", "id": 141211704}, {"rating": 5.0, "title": "spectacular seafood", "text": "fresh local produce, even the butter! The seafood platter was ridiculously good although a bit too much for a couple.", "user": "OliverJS", "date": "August 25, 2012", "id": 138320696}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Stocks Hotel is a great place to stay with a family in Sark, have stayed at the hotel twice and both times have been great. The grounds and Hotel are beautifully kept and the pool for the children is amazing, all though a little on the chilly side!! The staff are very friendly and super helpful, food was a delight and breakfast was very much enjoyed by all the family especially with fresh doughnuts on the menu!!", "title": "Fantastic Family Friendly Hotel", "helpfulness": 1, "user": "Kelly B", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 162173660}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "My only one negative would be the pillows on the bed as I am a really sucker for a feather pillow and sadly they have the man made pillows. However I would highly recommend this hotel to everyone as it is a wonderful hotel in Sark who really care that your stay is the absolute best they can offer, I will definitely will be going back.", "title": "Charming, relaxing break", "user": "Gerryandlinda", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162103498}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "A lovely room, spacious and spotless en-suite shower: birdsong by day and starlight by night. Charming and attentive staff, in all areas, with nothing too much trouble, and especially recommend a massage from Mariuzc in the Venus room to work away office stress. Excellent food and wine in the restaurant. The whole hotel site is clean and tidy and well looked after, in a lovely setting. All in all an excellent hotel experience.", "title": "Great times in the pool!", "user": "Wigglyw00", "date": "May 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 162069799}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Another fabulous long weekend staying with the lovely people at Stocks on Sark! Great food, relaxed atmosphere and the weather came up trumps too with unbroken blue skies (until today when it has rained just to make us appreciate the previous three days even more). Our daughter has had a great time playing in the pool every day after long bike rides round the island and exciting explorations of gorgeous deserted beaches and sea caves.", "title": "We'll be back!", "user": "Sally O", "date": "May 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161847034}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We have been looked after really well and hope to be back very very soon.", "title": "\"A real hidden gem \"", "user": "davidgbarker", "date": "May 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161782602}, {"rating": 5.0, "title": "Stocks go the extra mile", "text": "Having had some very disappointing meals in other sark establishments, we visited stocks for a mid morning coffee and toilet break and loved the ambiance and setting and friendliness of the staff. Decided to return later for our evening meal and braced ourselves for a cold evening in the garden outside as we had our dog with us. Not so! We, together with our large collie, were escorted through the main hotel and up the stairs to the bistro restaurant where we were made most welcome and where jack our dog was made an absolute fuss of. We enjoyed a fantastic meal, in the warmth of the bistro where we stayed quite late as we were having such a lovely time. Stocks also have doggie friendly rooms for overnight hotel. Highly recommended.", "helpfulness": 1, "user": "rghunter", "date": "June 9, 2013", "id": 163489333}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "When I visited Stocks my expectation was huge as so many people told me how good it was-I was not disappointed. The room was tasteful, comfortable, luxurious. Everything was sparkling clean and whilst we were at dinner someone came in and gave the bathroom an additional clean. The food was amazing, fresh, well-cooked, in generous portions and beautifully presented. I liked being able to choose between eating in the Dining Room or Brasserie, although it was a hard choice because they were equally good.", "title": "A Jewel in Sark's crown", "user": "LindaLeVasseur", "date": "June 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163468355}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "The hotel is wonderfully quiet, surrounded by green meadows full of wild flowers. The only interruption to the peace is the sound of the birds. We didn't use the pool as it was rather windy, but had the weather been warmer we would have found it extremely inviting.", "title": "Best Hotel in Sark !", "user": "ElaineCaleta", "date": "June 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163335429}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The staff were all friendly from Paul who runs the hotel to the bar staff, waiting staff and domestic staff and they were all on a mission to make our stay as perfect as possible-nothing was too much trouble for them. I cannot fault Stocks in any department of their service- it was the perfect weekend and I will most certainly go back there.", "title": "Understated luxury", "user": "Lawnturtle", "date": "June 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163289341}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Chose this Hotel because traveling with family. Had lovely grounds, perfectly maintained, fantastic relaxed atmosphere. Very friendly staff, nothing too much trouble - made us feel very welcome and we would certainly love to return one day soon - The Hotel,s - Smugglers Bar - a lovely place to relax in the evenings - before ( or after ! ) dinner ...........", "title": "A great place", "helpfulness": 2, "user": "Rex W", "date": "June 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162972182}, {"rating": 5.0, "title": "Superb Food", "text": "Very efficient and attentive staff. Good menu and added touches of chef's taster before your starter. Lovely room, well decorated and nice atmosphere.", "user": "SinginSuzy", "date": "July 25, 2012", "id": 135352557}, {"rating": 5.0, "title": "Beautiful Settings", "text": "Extensive choice of food on the menu and food was excellent. Service a little slow at times but the staff were clearly very busy", "user": "Holidaymaker27_11", "date": "July 24, 2012", "id": 135218012}, {"rating": 5.0, "title": "Lovely A la Carte Meal", "text": "A lovely dinner at Stocks hotel, excellent service and delicious food. Enjoyed a few drinks after dinner in the bar.", "user": "CSA296", "date": "July 23, 2012", "id": 135188989}, {"rating": 5.0, "title": "Fine dining on the island", "text": "The menu had great offerings of local fresh seafood.The scallops and lobster were tastefully prepared .The ravioli was divine and so subtle in its flavour.", "user": "Designdoll", "date": "July 11, 2012", "id": 134087483}, {"rating": 4.0, "title": "Lovely outdoor meal", "text": "The presentation was excellent and the service impeccable.The Desserts were sinful but not to be missed!great wines to accompany the meal as well.", "user": "GuernseyPhil", "date": "July 4, 2012", "id": 133438841}, {"rating": 4.0, "stay_parameters": "Visited May 2013", "text": "We ate here on a Bank Holiday Sunday and although we had booked in advance they seemed to have been taken by surprise by the number of \"drop-in\" diners who had not done so - apparently a number of other venues had not yet fully opened. This meant that parts of the service we received were a little slow but no matter. The food was excellent, the new staff for the season seemed to be settling in nicely and the whole set-up was excellent. It is clear that some serious money has been spent on the venue. We were blessed by having fantastic weather but I have little doubt Stocks will deliver come rain or shine.", "title": "Well worth a visit", "user": "BigMac58", "date": "May 7, 2013", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 159980866}, {"rating": 4.0, "stay_parameters": "Visited April 2013", "text": "Walking on Sark on a day visit, came across Stocks for a bar lunch and had lovely food, service and all with a nice atmosphere. Staff friendly, the hotel/restaurant all looked nice and clean and bright. Wouldn't mind staying for a couple of days next time.", "title": "A nice find", "user": "r_hgs", "date": "April 29, 2013", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 159104229}, {"rating": 5.0, "title": "The place to go in Sark !", "text": "Great food, lovely ambiance and nice service. The food is homemade, with great attention and care, the products are allways fresh (some come from the owners bio garden), the service is very nice, the ambiance is elegant but relaxed, this hotel has a soul.... We highly recommend it", "user": "Michaela T", "date": "April 26, 2013", "id": 158845807}, {"rating": 5.0, "title": "Lunch time break", "text": "Were walking in Sark and stopped at Stocks for a quick lunch. We both had souo followed by desserts and some really good white wine. Sat outside in the the Sun (and it was March!). Lovely hotel and location.", "user": "Tristate99", "date": "March 24, 2013", "id": 155487778}, {"rating": 4.0, "stay_parameters": "Visited September 2012", "text": "I've been to Stocks restaurant a couple of times and the food is always of exceptional quality, the service is great and the atmosphere is wonderful. It's a top notch place and the only reason I don't give it a \"Excellent\" rating is that the bar prices are on the high side.", "title": "Excellent food", "user": "MikeFawson", "date": "March 17, 2013", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 154860582}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 3, "average": 2, "very good": 21, "terrible": 0, "excellent": 259}, "aka": "Stocks Island Sark", "slim_ranking": 0.166666666667, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "description": "Stocks is a family-owned luxury country house hotel set at the heart of the beautiful island of Sark. Totally refurbished during 2010 the hotel offers fine dining and discreet personal service. Stocks is the perfect escape from the stress of the 21st century."}