{"user_rating": 4.5, "review_count": 267, "name": "Ston Easton Park Hotel", "reviews": [{"rating": 5.0, "title": "A very special place", "text": "A lovely hotel - wonderful setting, beautiful building, efficient friendly staff - nothing too much trouble, exceptional food & luxurious rooms.. In my top 5 hotels ever! No sorry that's not right - TOP THREE!", "user": "DWSBee", "date": "February 25, 2013", "id": 153126758}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Just back from a lovely weekend at Ston Easton Park. Excellent value with a Travelzoo offer. Beautiful surroundings, friendly staff, comfortable room with a lovely big bed. We had the 5 course tasting menu dinner which was delicious. Enjoying taking Oscar the resident spaniel for a walk round the grounds. This trip was for my husbands special birthday and it felt very special at this lovely hotel.", "title": "Lovely weekend", "user": "Andrea R", "date": "February 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152957376}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The approach to the hotel is impressive - and nothing from there on fails to continue this feeling.", "title": "Pure Pleasure", "user": "andrewmartjames", "date": "February 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 152474894}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We arrived at the end of january in the snow so it was very picturesque. We had booked a 3 night break using the Travelzoo offer. We upgraded to a better room and were given the Terrace Room which was fabulous as it is the only room with an outside area. Its on the 3rd floor so a bit of a climb but well worth it. If like me you like an odd cigar with a brandy before / after a meal this room is for you!", "title": "Excellent service", "helpfulness": 1, "user": "AmandaDorset", "date": "February 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 151333131}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "My wife had a massage in the room (masseuse Lesly - very good) which she thought was great as she could then just fall straight into bed!", "title": "An absolute gem, make it your mission to stay here!", "helpfulness": 1, "user": "finchaa", "date": "January 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150853333}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We stayed here for one night last week after a great deal on Travelzoo which included breakfast and the tasting menu. The hotel is a lovely old country manor house away from anything else. The hotel public rooms are very comfortable with lovely fires. Our room was clean and the bed lovely. The breakfast was perfect. Why have I only given it 4 stars? We had the tasting menu which was excellent but not in anyway enough. I appreciate the concept of the tasting menu but each course was just a small mouthful. We were both still hungry afterwards! That aside, we would still go back though.", "title": "Lovely!", "helpfulness": 1, "user": "Chris4817", "date": "March 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 155965183}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "Stayed here as part of a travel zoo deal and it was perfect. The hotel grounds and rooms were beautiful. Service was second to none and the food was fantastic. Perfect relaxation. I had a lovely time and would certainly go back.", "title": "Perfect", "user": "ceemlove", "date": "March 29, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 155948385}, {"rating": 5.0, "title": "Pure relaxation", "text": "This was a gift from our son for 2 nights and it was perfect.", "user": "Frankie B", "date": "March 22, 2013", "id": 155360841}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "The hotel is a beautiful stately home with log fires and lovely comfortable beds in grand rooms.", "title": "Amazing!!", "user": "Jo T", "date": "March 22, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 155339457}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The food was excellent and as I do not eat meat I thought it might be a bit difficult when I saw the menu, however James was wonderful and said that it was not a problem and they would cook something different for me which they did happily.", "title": "Sumptuous relaxation!", "user": "SarahB1957", "date": "March 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 154618352}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "My husband and I stayed in the Pavilion suite, and our package included 2 nights dinner and a glass of prosecco as well as full English breakfast both mornings. The staff overwhelmed us with hospitality, catered to our every whim, and made us feel like royalty. The rooms was impeccably decorated and very clean. We had turn down service every evening, and a paper and coffees delivered every AM. The concierge made an incredible recommendation for our second evening meal at a local gastropub that was phenomenal. There is very limited mobile and wifi service, although if you are in desperate need of connectivity, there was free wifi access granted by the front desk upon request.", "title": "Service Perfection", "helpfulness": 1, "user": "Jessica C", "date": "January 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 150764806}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We found a special deal for one night's B&B plus the 5 course tasting menu. What can I say? From the moment we arrived to be greeted by Charlotte and Oscar the dog, until the minute we left, everything was perfect. Our superior room was spacious and extremely comfortable, and had great views over the lawn. Dinner was delicious and the accompanying wine flight was well matched and breakfast was also of a superior standard.", "title": "De-stress delight!", "user": "shoesandkittens", "date": "January 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150717297}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We arrived exhausted after a long week at work and, after only one night, left feeling completely refreshed and rejuvenated.", "title": "Quality in Every Area", "user": "SteveM45", "date": "January 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 150684954}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "For my wife and I our stay was close to perfection. Our one night visit with a 5 course 'taster' dinner was a Christmas present purchased as an internet deal. Our stay had to be cancelled a week earlier because of snow which made travel impossible, the hotel accommodated our late cancellation and re-booked us without any fuss, despite the terms & conditions stating no cancellations or refunds.", "title": "Elegant country house hotel in lovely grounds", "user": "Babeth49", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 150372211}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "This hotel displays quality in every area, the country house and gardens are beautiful, the bedrooms luxurious, the food scrumptious and the service efficient and friendly. Our stay was so relaxing and we thoroughly enjoyed exploring the gardens and fussing the hotel dog, Oscar. The hotel is well located close to Bristol and Bath so whether you are looking for some retail therapy or to take in the history of Bath, or perhaps Cheddar Gorge you are not more than a few miles away.", "title": "Too relaxing to go out!!", "user": "AiryTraveller", "date": "January 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 149854531}, {"rating": 1.0, "title": "Not for Families", "text": "Just by word of warning to any families who were hoping to stay at The Ston Easton Hotel near Bath. We booked a dinner bed and breakfast package for a family of four, only to be told that children under the age of 8 years were not permitted in the restaurant ( our very well behaved girls are 6 and 8 ). There are no alternative arrangements made for the children, such as high tea. Obviously this is false advertising and this information should be available at the time of booking.", "helpfulness": 4, "user": "Helen W", "date": "March 14, 2013", "id": 154528694}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "I would suggest by the tone of the Hotel staff that children are not welcome, and therefore it would certainly not be relaxing family time.", "title": "3.5 Stars", "helpfulness": 1, "user": "cmathews", "date": "March 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 154324721}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "My husband and I stayed for one night in the Chinese Room in March 2013. It was a bit like staying in a stately home. It's the sort of place that all the guests speak in lowered tones in the public rooms!", "title": "An experience of bygone class and luxury", "user": "johnowen2004", "date": "March 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154235475}, {"rating": 5.0, "title": "True luxury", "text": "The hotel is a beautiful building, with lovely gardens (I imagine they're amazing in the summer), and our bedroom was spacious and elegantly decorated. Unfortunately when it got dark, the lighting in the bedroom was so poor that we couldn't even read. I had to put my make-up on in the bathroom, leaning over a wet sink, which I didn't enjoy. When we mentioned the inadequate lighting to Reception, it was clear we weren't the first people to complain. The dressing table mirror was so dusty, I was able to write 'Clean Me' on it, although the rest of the room didn't appear dirty.", "user": "Ian C", "date": "March 4, 2013", "id": 153710225}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We whiled away the afternoon sitting in the Library, which was very pleasant, and had pre-dinner drinks in the main lounge. Cocktails were very good.", "title": "One Night was not enough", "helpfulness": 1, "user": "viv s", "date": "February 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153348332}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 4, "average": 14, "very good": 52, "terrible": 5, "excellent": 192}, "aka": "Ston Easton Park Bath", "slim_ranking": 1.0}