{"user_rating": 5.0, "review_count": 42, "name": "Stratos House", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We had a wonderful 5 days in this charming little village of Kalavasos, an excellent central location between Larnaca and Limassol for touring other parts of the island. The property has 2 apartments in the traditional old house and 1 more modern apartment upstairs. We had to adjust ourselves a bit the first days to the spring mattrass and the early daylight with birds chirping but even this is part of the local charm.", "title": "Real Cypriot character and hospitality", "helpfulness": 2, "user": "indegloria", "date": "March 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 59723788}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "The houselady reminded me of my mum (65+), she is so sweet and helpful (she had cooked us a bit of dinner on our evening of arrival with a little bottle of wine) and even though she does not speak English, we understood each other completely. And when necessary she calls her daughter Elena who does the overall management, in Greece for translations. At night we would visit the local tavernes and get to know even more people from the local community. A heart-warming experience!", "title": "GREAT PLACE FOR RELAXING", "helpfulness": 2, "user": "manos123", "date": "September 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 39887575}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Absolutely no complaints about our stay here. Our ground floor apartment was spacious and charming, with traditional and antique furnishing and ornaments. It really felt like staying in someone's home rather than a holiday apartment. There was a kitchen, a large room with distinct bedroom and sitting room areas and a bathroom with a good, always-hot shower. For outside space we had the choice of the courtyard outside our room, where there are tables, chairs and more old-fashioned objects, or a sunny terrace on the first floor. We used both.", "title": "Delightful traditional home-from-home", "helpfulness": 2, "user": "SeafoodQueen", "date": "June 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132522776}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "When we visited the central square of Kalavasos was being dug up (sounds like this is a semi-permanent state of affairs!) and we had some difficulty finding Stratos House. Despite this, we liked Kalavasos, and found everyone we met to be friendly and helpful. The owners of the house - Georgios, Elena and Panagiota - were very welcoming hosts, and a couple of times shared some of their (delicious) cooking with us. At the Tenta taverna we ate home-cooked meals most nights - don't ask for a menu there, just find out what's cooking, and drink the house wine. If you want a menu, the Bridge Taverna is also good, particularly for meze.", "title": "Suite was spacious,quiet and comfortable", "helpfulness": 1, "user": "atarnove", "date": "April 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 127500717}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "There are plenty of day and half day trips you can do from Kalavasos if you have a car, but I probably wouldn't recommend coming here if you're relying on public transport. Although there is a small shop in the village, there are bigger and better shops at the top of the road to Zygi from the motorway junction - including a nice bakery and very good fruit and veg. Sunday lunch (which has to be fish!) in Zygi is a good time to mix with local families, but arrive early if you don't want to queue for a table.", "title": "Charming place to stay in rural Cyprus", "user": "northstarstate", "date": "November 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120528541}, {"rating": 5.0, "stay_parameters": "Stayed April 2011", "text": "We were very pleased with our suite. The room was very large with a spacious bathroom.", "title": "One of the best B&Bs in Cyprus", "helpfulness": 5, "user": "b_robin5", "date": "April 6, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 103024680}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "The bath was over sized and we both commented on how nice it was to shower with the extra room. Very quick check in. Our room over looked the parking garage but it really did not bother us.", "title": "A gem in the heart middle of Kalavassos", "helpfulness": 2, "user": "HelmutNassauer", "date": "January 7, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 92054343}, {"rating": 5.0, "title": "little gem", "text": "Me and my husband booked a family suit at this house we booked last minute . Although we never met the owner as it was Christmas and we didn't book until 24 hours prior to arriving , he was most helpful via the phone and email the family suit we had , had everything we needed and more . The old house is just perfect if you want a authentic place to stay its not so far from the beach although you do need a car . There is NO pool at this property . We stayed over the Christmas period and were the only guests staying there intact we were the only visitors to the village . It was a little quiet in the vvillage but I guess in a couple of months it's will be a thriving . The main square is being renovated but this didn't bother us . We had breakfast with a token given to us by the owners mother at the squares cafe called geogre . The owner George was very good he looked after us morning and night the locals very friendly when we arrived at the the house we had wine and food left for us also Xmas day we recieved a bottle of bubbly . All in all really enjoy our few days here I think tho to get the most out of this lovely house and courtyard a spring summer trip would be good . A big thank you to the owner for the little bits and pieces left for us .", "helpfulness": 2, "user": "UkSand", "date": "December 29, 2012", "id": 148270070}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "I've never written a review before, simply because no place I stayed in was worth the effort. Well, until now.", "title": "Perfect hosts", "helpfulness": 1, "user": "Dragan M", "date": "December 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148132016}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "I'm not gonna go into details about the reasonable price, location, amazing breakfast, services, fully fitted apartment with everything one could need, etc, because everything was simply great. And even the parking a couple of meters away from the house was not a problem.", "title": "Lots of character and friendly owners", "helpfulness": 2, "user": "shigglediggle", "date": "October 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 144142604}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "I'd like to point out the following - the owners literally fulfilled every wish of ours and went out of their way to make sure we are well taken care of. Any parent of young child will certainly appreciate that.", "title": "A magical stay", "helpfulness": 1, "user": "the_luggage", "date": "October 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142780331}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "Giorgio and Elena made us feel at home - what more can you want?", "title": "The Cyprus we love", "helpfulness": 3, "user": "Bert C", "date": "September 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141387896}], "location": {"country": "Cyprus", "continent": "Europe", "city": "Kalavasos"}, "stars": 3.5, "variance": {"poor": 0, "average": 0, "very good": 3, "terrible": 0, "excellent": 39}, "slim_ranking": 0.166666666667, "description": "Stratos House is situated in the picturesque and beatiful village of Kalavasos near the main square.The family run house is located only 5km from the famous fishing village with tavernas Zygi and Governor's beach and is ideally located to visit all main cities of Cyprus(Limassol 20km-Larnaca 28km-Lefcosia 45km).The 300 year's old stone built House consists of 4 uniquely styled traditional suites,decorated with authentic antique furniture from the family and fully equiped with all necessary accessories of a self-catering apartment.There is a free wi-fi and satelite flat tv's for all rooms.Guest's can relax at our stone built jacuzzi in the romantic Courtyard with the atmosphere of another epoque under the arches and the sun loungers by having a cooffee from their Nespresso machine or enjoy a drink by the 2 vine-covered verandas.Services includes a free use of a swimming pool with a panoramic view nearby and massage treatments in the suite by a professional lady after appointment.The famous musician and singer Michalis is ready to fascinate you with his music in the courtyard under the stars.Guests can rent mountain bikes in order to explore the Natural paths and go for fishing trip by boat from Zygi.Horse riding is also available at Drapia farm.Cosmetics are from Korres while bedrooms feature Guy laroche and Zara Home linens.Stratos family welcomes their guests with a bottle of local wine,home made sweets,a bottle of water and during their stay can taste many other home made specialities of the Cyprus cuisine.Coffee shop for a traditional Cyprus breakfast and restaurants are only 100 metres from the House."}