{"user_rating": 5.0, "review_count": 175, "name": "Sueno del Mar Beachfront Bed & Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "My husband and I recently returned from our Honeymoon in Costa Rica. We booked just one night at Sueno Del Mar in the Honeymoon Suite as we were at an all-inclusive up the coast in Playa Hermosa. Our night at Sueno was amazing and we certainly wished we had stayed longer. The hospitality and friendly staff add to the amzing ambience of the B&B. The honeymoon suite is like nothing we had stayed in before...ythe loft room has the feel of almost a tree house as you are surrounded by large screened in windows and trees. The sound of the ocean waves all night was hypnotizing. We saw howler monkeys in the trees while using the outdoor shower. It was an enjoyable 20 minute walk along the beach into Tamarindo and a 10 minute walk in the other direction to the other beach area (I have forgotten the name) Great swimming in the surf!", "title": "Sueno Del Mar is a must!", "helpfulness": 1, "user": "twoepps", "date": "May 6, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 7552716}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Suneo del Mar is definitely on our \"must return to\" list.", "title": "So amazing we came back", "helpfulness": 1, "user": "KristiandJay", "date": "May 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7489416, "likes": {"liked": "— Location, hospitality, knowledge of the area, cleanliness, attitude, atmosphere", "disliked": "— Everything was perfect!!!!"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Unbelievable and magical are the two words that come to mind about Sueno Del Mar. If you are planning a trip to Costa Rica and Tamarindo, Sueno Del Mar should be your only choice.", "title": "Must Stay", "helpfulness": 1, "user": "jrdip", "date": "April 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7430216, "likes": {"liked": "— removed from the city", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Our first trip to Costa Rica two years ago, we discovered Sueno Del Mar on Tripadvisor.com. We spent two weeks at Sueno and not once ever doubted that we had found the best location, value and hospitality in Tamarindo.", "title": "Magical beachside B&B", "helpfulness": 1, "user": "Butzel223", "date": "April 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7364827}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We loved Sueno Del Mar so much, that after spending the last two weeks in Jaco/Playa Hermosa we made the 3 hour drive north to spend just one night in paradise. Now if that is not a testimony to how special Sueno is, I am not sure what is.", "title": "Best place we stayed.", "user": "fargo2814", "date": "April 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7327132, "likes": {"liked": "— Sunsets", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "...who would like something romantic, upscale, and secluded and are not the \"Four Seasons\" type. If you like boutique hotels rather than the old-school, posh luxury, you will be extremely pleased here. We stayed in one of the \"casitas\" - more than a room, slightly less than an apartment. And yes - if it's storming...the power goes out. It's Costa Rica. But to us, it was all the more romantic because of it. Our hosts could not have been more personable and charming, and they let their guests set the pace and amount of privacy they're looking for. We alternated between being active for a few days, and then secluding ourselves to work on a manuscript. The staff is meticulous and genuinely warm and caring. They take great pride in their work and it's obvious that they are very well treated by the owners. There is an overall \"sweet\" vibe to the place. And the breakfasts are different every day and include 3 homemade, light, but satisfying courses. I really hope we have the opportunity to stay here again.", "title": "Perfect for Honeymooners...", "user": "Kristina108", "date": "September 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10009296, "likes": {"liked": "— ambience, food, staff, beautiful beach to sit on", "disliked": "— can't think of anything"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "My husband and I spent our May honeymoon at Sueno del Mar. It was a delight and we couldn’t have asked for anything more. The staff was amazing and catered to our every need and didn’t tire of our endless questions about the area. They even booked all our tours, ordered take-out for us, and gave us a personal tour of the property. They also arranged to have a local chef serve us our very own personal, four course, supper on the veranda. It was amazing! The daily breakfasts were also very tasty and filling.", "title": "Wonderful...An Amazing Staff!", "helpfulness": 2, "user": "marie1979", "date": "September 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 8885787, "likes": {"liked": "— The accomadations and staff service", "disliked": "— Tamarindo was a bit too touristy"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We stayed in the honeymoon suite which I would certainly recommend. It was a quiet retreat and we could literally hear and see the ocean from our bed every morning. The outdoor showers were wonderful.", "title": "Nice but...", "helpfulness": 1, "user": "pdevince", "date": "September 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 5.0, "cleanliness": 3.0, "value": 2.0, "location": 1.0, "rooms": 2.0}, "id": 8718440, "likes": {"liked": "— Scenery", "disliked": "— The odor"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "My husband and I wouldn’t hesitate to recommend Sueno del Mar to any visitor.", "title": "Amazing!!!!!!", "user": "ChefMatthew", "date": "September 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8692509, "likes": {"liked": "— The grounds are amazing. the staff is the best!!!", "disliked": "— no complaints"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "This place was beautiful, was set in a very picturesque location on a natural beachfront, served tasty breakfasts, and was run by gracious hosts; however, there was a \"funk\" that pervaded the bed-and-breakfast due to a septic system, the beach was (and is always) un-swimmable, the power goes out during storms (sometimes), the roads to and from the hotel are dirty and scoured with potholes, and overall...it was pricy to stay here for limited amenities and attractions. We had to walk 25-20 minutes several times a day in order to get something to eat. We could have paid for taxis, but that adds up quickly. Roads are DANGEROUS whether you are walking on the side or in a vehicle, and they are filthy because they are mostly wide swaths of dirt and mud. Furthermore, the Costa Ricans and visitors to the area exhibit no courtesies on the road.", "title": "Still dreaming of Sueno del Mar", "helpfulness": 1, "user": "Nicole_and_Jeff", "date": "August 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8281548, "likes": {"liked": "— Unique & small hotel- more attention to detail", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Although I’ve used TripAdvisor for a while this is the first time that I’ve felt I’ve had to write a review. We stayed at Sueño Del Mar in the New Year and had an amazing time. In fact we were there just before Tina and Andreas’ wedding and heard Tui talking about the arrangements and thought what a great place to have your wedding. In fact reading the review brought tears to my eyes as the sentiments raised by Tina and Andreas are exactly as it was. We weren’t even getting married but had the same level of attentiveness from all the staff, Tui and Kris in particular.", "title": "Spot on with the ambience", "user": "Samkirk9", "date": "January 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12738866, "likes": {"liked": "— The location, the ambience and the people", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Well, where to start…. We arrived after some really bad weather in Monteverde and were looking forward to a bit of sunshine to brighten up our holiday – little did we realise that the place we were staying in would brighten it up further. We were greeted by Tui who was very friendly and welcoming and showed us to our amazing casa – we stayed in Casa Osita. The attentiveness shows throughout – Tui asked if we wanted a while before we were shown around as we’d travelled a long way, but we were happy to be shown everything straight away. As well as the perfect beach front location and the place being a private hideaway once you’ve come through the little wooden door – everything has been thought of: the hacienda style with white walls and wooden beams and posts, the pretty courtyard with rocking chairs, the open kitchen and living room area with music from an iPod to choose, the dining area opening out onto a secluded pool, which further opens out onto an almost exclusive beach with hammocks swinging in the shade of the trees, sun loungers for you to bask in the sun and then chairs for you to watch the amazing sunsets over the pacific with only a handful of people in site. The Casa that we stayed in was amazing – huge settees to lounge around on, kitchen area and a huge comfortable bed upstairs. A large pretty private outdoor area leads you to the prettily tiled outdoor bathroom.", "title": "Fairytale Wedding....Unforgettable...", "user": "olatui", "date": "January 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12562008, "likes": {"liked": "— Tui, and the staff,but overall we loved everything!!!!", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "On top of all that, there are free boogie boards and snorkelling equipment, beach towels, sun tan lotion and insect repellent, a book exchange, free internet access, sarongs in the room and a very reasonably priced honesty bar.", "title": "Great Client Service", "user": "5_Continents_7", "date": "November 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 10984649}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "And finally, the people who work there really make this place…. From Tui who looked after us from the moment we walked in the door and then rearranged our travel plans when we decided, practically straight away, to stay an extra night, to Kris who looked after us in the afternoons to Zaq who cooked us an amazing vegetarian meal, which I thought was very reasonably priced, to Ashton who gave us a discount for the additional night we stayed to the ladies who cooked an amazing three course breakfast, which was different everyday and prepared with the same passion that a chef would do, and finally to all the staff we didn’t know the names of who were all very pleasant and looked after place.", "title": "Pura Vida", "user": "Bouquet61", "date": "November 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10692391, "likes": {"liked": "— The value, charm, intimate size, great food, beautiful sunset."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "This truly is a home away from home that will always be thought of with fond memories and if we lived nearer we would definitely make this a regular getaway.", "title": "Finally you get what you pay for", "user": "JacketFan14", "date": "October 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10026875, "likes": {"liked": "— location, great price, friendly staff", "disliked": "— I did not stay long enough"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "My husband and I stayed here in April for a week and it was the best vacation we have ever had. This little bed and breakfast hotel is the most relaxing place we have stayed, truly wonderful! The staff is amazingly helpful and very friendly. They have plenty of recommendations for things to do and places to eat. We had a great time and we would definitely go back. The breakfasts are very good as well!! Thank you Sueno Del Mar for making our stay such an enjoyable one.", "title": "Great place for relaxation!", "helpfulness": 1, "user": "adaskye", "date": "June 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8027582, "likes": {"liked": "— Unique place to stay", "disliked": "— Nothing!!"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "My fiance and I just returned from the quaint B&B where we celebrated our engagement. We loved the honeymoon suite with it's spectacular ocean view and sounds of the waves all day long. It was the ultimate setting for the couples massage. The breakfast and coffee was so delicious and a wonderful way to start each day. The beach is private and although it is not great for swimming it is a short walk up the beach to a great swimming area. It kept the privacy this way. As all the reviews say the sunsets are remarkable and we loved picking a different spot on the beach each night to watch it. The restaurant recommendations in town were amazing however our favorite meals were prepared at Sueno Del Mar by Zack the gourmet chef. We particularly enjoyed our private meal one evening by the pool. We loved the friendliness of the staff and have decided to get married there next year! We are looking forward to our return!!!", "title": "A little piece of heaven", "helpfulness": 1, "user": "Bellamunckin", "date": "June 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7873247, "likes": {"liked": "— Comforting and beautiful surroundings", "disliked": "— Security"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "My (new) husband planned our honeymoon himself and did a great job. We had so much fun in Costa Rica for 2 weeks!", "title": "Can you hear me?", "helpfulness": 3, "user": "KamaLinn", "date": "May 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 7715079, "likes": {"liked": "— Proximity to beach, staff", "disliked": "— Lack of privacy"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Tamarindo was the end of our stay. We loved the location of the hotel and the way you could walk out on the beach. My husband enjoyed borrowing the snorkel gear and checking out the tide pool that was created in the afternoon right outside the hotel. We also enjoyed the public areas (chairs, pool) at the hotel. The staff was great. We liked touring the city and this was the first place that we saw any American chains (Subway, Pizza Hut, etc.).", "title": "very nice little hotel", "helpfulness": 1, "user": "michanw", "date": "May 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 7645078}, {"rating": 5.0, "title": "The Perfect Escape!", "text": "Here is my concern. We've been married for 2 weeks and we're staying at a place with an \"outdoor\" shower (which I was okay with until I got there). It was kind of outdoors--got rained on a few times in there. We were in one of the rooms toward the end of the hallway walking out to the beach, so our shower backed up to the hallway. (It was open to the hallway above our heads with plants in the opening and open to the sky at the top.) I once said something in the shower and someone in the hallway answered me!! The other issue with privacy was that there were screens on the windows with shutters--remember, we were right off the main open-air hallway (and could hear people in the hall too). We tried to put paper, etc. in the cracks of the windows, but still felt like everything that was said in our room could be heard in the hallway. Lack of privacy (at least for the room we were in) was the biggest problem we encountered here.", "helpfulness": 1, "user": "MrsMarqy", "date": "May 9, 2007", "id": 7573378}], "location": {"country": "Costa Rica", "continent": "Central America", "city": "Tamarindo"}, "variance": {"poor": 1, "average": 6, "very good": 14, "terrible": 1, "excellent": 153}, "aka": "Sueno Del Mar Hotel Tamarindo", "slim_ranking": 0.0689655172414, "description": "Sueno del Mar is a boutique B&B on the beach. We are know for our gourmet breakfast made with fresh local ingredients. On the beach we created a very comfortable setting with hammocks and lounge beds to relax and watch the incredible sunsets. Included in our room rates we also offer the use of our complementary snorkel equipment, bicycles, surf boards, fishing poles and body boards. We are looking forward having you stay with us. Pura Vida!"}