{"user_rating": 3.5, "review_count": 2299, "name": "Sugar Bay Resort & Spa", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We stayed for the weekend,Oct 2 thru 6, what a nice hotel, rooms well kept and beautiful views of the ocean, grounds were beautifully kept up, beach was perfect, pool was clean and sparkly. It was a little hard to get around due to the landscape, but if your in shape, a stroll never hurts while on vacation and if your not they will golf cart you around. the food was good to better with breakfast in the Manor house, lunch at the pool and Dinner in any one of the 3 restaurants. The service at the pool bar was good with the Cruzan rum overflowing the drinks and several TV to catch any scores that you might need. however at the pool, pool bar and beach areas the resort plays this awful NYC elevator music that even put the Iguana to sleep. How about playing some tropical Caribbean sounds that actually make you feel like your in a warm beautiful place. The staff was nice and very helpful except the few wait and cooking staff at the pool restaurants, were they made you feel like you were imposing when asking to put on a cheese burger and fry's at the grill or get a cup of coffee after a great meal, god forbid.", "title": "Nice! BUT?", "helpfulness": 2, "user": "jhayand3", "date": "October 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 20729229, "likes": {"liked": "— Beautiful location and grounds", "disliked": "— atmospher"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008", "text": "We also lined up a massage and facial at the journey spa with reservations in advance, great looking place, top notch amenity's however when we arrived they then told us they could only take one at a time and facials were not available due to staffing problems. a phone call would have been nice after working our whole day schedule around that service. I guess they just look top notch, but cant back it up!", "title": "awesome!!!!!", "helpfulness": 2, "user": "nyice34", "date": "October 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 20649539, "likes": {"liked": "— setting", "disliked": "— music stopped playing fairly early"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We also inquired about scuba diving as published as one of the amenity's, however all they offered was snorkeling and was no longer set up for scuba diving and we had to go off site locally, get a cab and end up with only beach diving. Again a little notice of changes in amenity's would have allowed us the time to research better off site diving establishments that offered multiple dives per day with off shore spots...another bust!", "title": "Nice Vacation", "helpfulness": 3, "user": "bryant72", "date": "October 3, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 20588676}, {"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The weather was warm and mostly sunny with warm Caribbean winds and the water you could stand in all day at about 80. we found the hotel casino and bar on our last night, fun place, small, but great place to kick back and relax with a drink or 10 and play anyone of the 100 slot video machines that all offer the same game, no table games. but great if you want to drop small change and relax, maybe dance a little, but if you like BIG time gambling go to Vegas.", "title": "We'll NEVER go Back EVER!", "helpfulness": 4, "user": "ambrikat", "date": "September 29, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "cleanliness": 3.0, "value": 1.0, "rooms": 4.0, "location": 4.0}, "id": 20480110, "likes": {"liked": "— the beds", "disliked": "— the staff"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We just returned from 5 wonderful nights at the Wyndham Sugar Bay Resort. In the beginning I was a little skeptical after reading some of the reviews here and on other sites. I knew someone who went last year and they also had a wonderful experience. We had a ceremony on the St. John's terrace and reception at the Ocean Club terrace and it was wonderful. Monica the wedding coordinator was very helpful and because of her our wedding was much talked about during our week stay. Unlike other peoples experience the staff was courteous and helpful. My favorite bartender Doc deserves Kudos. Don't worry about the stairs down to the pool there is a shuttle that runs every 15 min. But after eating all the wonderful food we needed to work out a little anyway. Some of the complaints that my guest had were (the buffet food wasn't hot, food at the Caribe wasn't hot when it arrived and they took the plates to the wrong people twice. The ribs at the Iguana Grill were excellent but weren't frequently available. Also I really think that Bride & Groom should be offered a suite. We booked in March and were told no suites were available yet they offered a suite to one of my guest.) Even with that said our overrall experience was great and we would definitely recommend Wyndham Sugar Bay to others.", "title": "Debating between Wyndham and Marriott? Read me.....", "helpfulness": 5, "user": "vinniemasch", "date": "September 28, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 20455513}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "Let me first just say I already miss St. Thomas, just got back last night and am sitting here at work daydreaming about our vacation.", "title": "Review by young adults", "helpfulness": 5, "user": "redgraffittisky", "date": "September 25, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 20366693, "likes": {"liked": "— The proximity to everything", "disliked": "— Food"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The beaches in St. Thomas and St. John are gorgous. As far as the hotel it was perfect for us as it really was only a jumping point for us to all the great places these islands have to offer.", "title": "Really nice, but not excellent", "helpfulness": 4, "user": "Corley", "date": "September 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 20301609, "likes": {"liked": "— grounds", "disliked": "— bar"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "If you know how to plan your trip right you really do not need an all inclusive, there was no need for us as we had already researched a ton of great places to go to for an authentic adventure filled vacation.", "title": "Thoroughly Enjoyed our Stay at Sugar Bay", "helpfulness": 3, "user": "susienew", "date": "September 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 20187773, "likes": {"liked": "— Cold air conditioner.", "disliked": "— No dislikes"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "St. John def stole the show, Trunk bay is gorgous!! There are ferries to St. John in Red Hook, about a 10 minute drive, $5.00 per person Taxi Ride. the ferry was around $8 each way to St. John if my memory serves me correct. Also in Red Hook is Duffies, this place is a ton of fun. Tuesdays is $1.25 everything.", "title": "Great Resort, Great Island... but.. (must read)", "helpfulness": 7, "user": "Blasphemystic", "date": "September 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 20185938, "likes": {"liked": "— Great Views and Great service from waiters, bus boys and bell boys.", "disliked": "— Management"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "If you go from the hotel to Sapphire Beach you can also rent jet ski's for half the price and double the time. This is a MUST do!!!", "title": "Would definately go back again!!", "helpfulness": 2, "user": "misse25", "date": "September 17, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 20157838, "likes": {"liked": "— Pools/beach", "disliked": "— Ocean Club Service"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "My husband and I just returned from a 4-night stay at the Wyndham. I was nervous because of some of the reviews but can report that we had a great stay there.", "title": "Enjoyed our stay - great property", "helpfulness": 1, "user": "steptravel", "date": "November 20, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "location": 4.0}, "id": 22034529}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled with friends", "text": "Some pros: The property is gorgeous, one of the few big resorts on the island. The beach was small but nice and was actually just about empty throughout our stay. The pool area was very nice with waterfalls, volleyball net, and also pretty empty, so it's like having it all to yourself. During our whole stay, it seemed like not very many guests were staying there. The fitness facilities were great, inc. tennis courts, and a walking/fitness trail that went around the fitness area and had many iguanas walking all over. Have to say, we didn't actually use the pool/beach and fitness center since we were busy checking out other island beaches and St. John. We did not encounter any rude staff at all. They were pleasant.", "title": "loved wyndham sugar bay resort", "helpfulness": 2, "user": "walkinginparadise", "date": "November 11, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 21749497, "likes": {"liked": "— everything", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Some cons: Our remote wasn't working for the TV, so a guy came out at night and said he would swap out the TV the next day to fix the problem. When we got back the next afternoon, it was fine, but then the TV went out that evening. We called again, the same guy came out, and said he'd replace the TV. Well, he never came back, so the next afternoon, they moved us to a different room. They were nice and handled the problem well. We had a view of the beach and pool from the first room and mostly water on the next room and preferred the view with the beach and pool. In our first room, the bathroom door was too small for the frame and so it didn't \"clasp\" shut. But with a louvered door, there's not much privacy anyway. The hotel is high on a hill, so they shuttle you back and forth to the parking lot (we had a car, which I would highly recommend unless you plan to mostly stay on the property). This turned out to be OK though and we never waited more than a couple minutes for someone to take us. You can either take the shuttle to the pool/beach or walk down some stairs, which was no big deal to us.", "title": "Worth Every Penny", "user": "huntbuck13", "date": "November 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 21511815, "likes": {"liked": "— Scenary", "disliked": "— Humidity"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "All in all, great stay and we would happily stay there again.", "title": "Stay Away!! This place ruined my family's vacaton!! Buyer BEWARE!!", "helpfulness": 7, "user": "BadNewsTn_", "date": "October 31, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 2.0, "rooms": 2.0}, "id": 21408919, "likes": {"liked": "— The day we left", "disliked": "— The day we arrived"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "My friend and I stayed at the Wyndham from 11/3-11/8/08 and had a fabulous time. Our room was overlooking the beach and it was spectacular. It wasn't too crowded at the pool. The people at the front desk esp. Dusty were very nice and accomodating.", "title": "Great all-inclusive honeymoon destination", "user": "christy598", "date": "October 27, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 21318517, "likes": {"liked": "— All-inclusive", "disliked": "— Grill by the pool had duck & large birds in the eating area. Duck poop & keeping the birds from stealing you food was a struggle. They need to work on this!"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "My wife and I spent our 4 trip to St. Thomas at Sugar Bay. We will return to the island but will never stay at the Wyndham again. They gave us a really bad room with no ocean view which we paid for 4 months in advance. The hotel management lied over and over again about our room. We love St. Thomas but have lost all faith in the Wyndham!", "title": "Going down hill, deceitful managment", "helpfulness": 4, "user": "Desmodude", "date": "March 31, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 102302184}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Just came back last nite, spent 6 days 5 nites. I had researched and then started seeing a bunch of negative reviews so I was concerned... I can tell you the service was totally gracious and upbeat. I do think that maybe they had a re-training or something because everyone I spoke to at the resort (guests) all commented how nice and helpful and available the staff was. totally accomodating.", "title": "Just what the doctor ordered", "helpfulness": 2, "user": "moiinnj", "date": "March 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102217119}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "The room was very atractive, fresh and new, private terrace overlooking the ocean. It was quite attractive.Again, maybe some rooms are not yet refurbished but ours was great. If you are used to the Ritz you will not like this. If you are used to Marriott or other nice chains you will feel comfortable here in my opinion.", "title": "Clean, pleasant, peaceful, beautiful views!", "user": "SumShine", "date": "March 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 102060185}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "The beach, while not too large, was fine and we never had a problem getting a chaise or even finding shade for a bit.The pools are really lovely - very spread out, a fair amount of activity but not overwhelming. Yes the steps to the pool/beach; there are many, but there are also long landings so its not like 100 steps straight up. i am not the most athletic and walked up and down most of the time (though they do provide shuttle/golf cart rides every few minutes no problem). We had our share of sodas, waters, alcoholic drinks all over the resort and never had to wait more than a minute or 2 maximum..and the servers were always gracious.", "title": "Very Relaxing", "helpfulness": 1, "user": "RDOldham", "date": "March 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 101617776}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "I found this to be a totally relaxing, fun, enjoyable vacation.", "title": "what we were looking for.", "user": "FishyNyc", "date": "March 24, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 101401712}, {"rating": 3.0, "title": "beach day", "text": "This review is based only on the beach and the pool area.", "user": "travelLover98708", "date": "March 23, 2011", "id": 101252316}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "My husband and I were considering staying at this resort, but then opted for a villa rental instead. While on St. Thomas we stopped by to check out the resort and take a dip on the beach. This review is based on those few hrs we spend by the beach and pool area.", "title": "Very nice", "user": "tjbal", "date": "March 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101048493}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "If you think that this resort has a long quiet tropical beach you will be mistaken. The beach is VERY small and most of the water is rocks and sea weeds. I guess this makes good for snorkeling, but not so good for swimming. I was surprised just how small the beach really is here. The day that we came for our visit there was a DJ playing very loud music in the pool area. It's great if you want to party, not so great if you're looking to relax and for some peace and quiet. Not only was the pool area so loud that we had to yell to hear each other but since the beach is attached to the pool area there was no peace on the tiny beach either. There are two pools and a waterfall joining the pools, which looks very nice, but was sooooo crowded and loud I'm not sure you can really go for a swim.. only a dip. This might not have been a typical day at the Wyndham, but from what I saw, I'd suggest go here if you enjoy the party , very social atmosphere. Don't expect there to be a lot of R&R or for this resort to resemble that which is offered in the all inclusive resorts in Mexico or Dominican.", "title": "Our first time to the USVI", "helpfulness": 1, "user": "HHICarlos", "date": "March 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 100811554}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "Thought for the money it was very nice Friendly and clean. Everyone was very helpful Stayed 6 days and nights", "title": "Wyndham Playbook to enjoying a great stay..", "helpfulness": 14, "user": "theworldisreallyflat", "date": "March 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 100715545}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "This was our first time visiting the USVI, our flight was really carefree.", "title": "Beautiful stay", "helpfulness": 4, "user": "tayl9512", "date": "March 18, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 100621365}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We just returmed from the Wyndham on Thursday 10-23 and I felt compelled to write a review as I read these weekly before our trip.", "title": "Really enjoyed the Wyndham", "user": "4ster", "date": "October 26, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 21241225, "likes": {"liked": "— The scenery, and the staff", "disliked": "— The stairs to the pool, and the beach"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "HOTEL--Many reviews were extremely poor which made my husband and I both nervous about the trip. There were a few things about the resort that we were not too keen on such as the beach and yes there were cockroaches, and even rats but not in the rooms or hotel, just on the grounds or at least as far as we saw.", "title": "A good start to our honeymoon!", "user": "moby2712", "date": "October 24, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 21183935, "likes": {"liked": "— The beach area.", "disliked": "— The huge hotel complex."}}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "HOSPITALITY--The staff was VERY friendly, \"Doc and Rometa\" in the casino bar, and Mia, Yvonne, and Larisma were all super nice in the manor house. We only ran across one \"crabby\" cook in the iguana grill.", "title": "Buyer Beware", "helpfulness": 3, "user": "JeanieK5", "date": "October 17, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "rooms": 5.0, "location": 5.0}, "id": 20959204, "likes": {"liked": "— The surroundngs.", "disliked": "— We felt we were treated unfairly. At best, the booking system is inadequate and the staff handling reservations poorly trained. We would never recommend this hotel to anyone."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "FOOD--We enjoyed the meals and were VERY happy we were all-inclusive as it would have been quite pricey if we were not. The casino bar has excellent chicken quesadilla's, the Manor house dinners were all good as well. My husband particularily liked The Caribe's Pork dinner. There were not a lot of choices but the food was good. Make sure you have Doc from the casino bar make you one of \"Doc's specials\". We drank them all week, they were tropical and a favorite for all that was there.", "title": "Great Honeymoon", "helpfulness": 2, "user": "Kristin_Nicole2008", "date": "October 14, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 20881031}, {"rating": 5.0, "title": "Perfect Choice for 30th Anniv/60th Birthday", "text": "THE ISLAND-- If you are looking for night life, this is not the place to go, we were in bed by about 11:00 every night, which wasn't all bad as we felt well rested for the days activities. The island is poor but beautiful. The water is absolutely amazing, I would strongly reccomend going to Coki beach, and taking the snorkeling tour to St. John's and going to trunk bay. We really had a lot of fun.", "helpfulness": 3, "user": "mimis5", "date": "October 13, 2008", "id": 20858120}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "I stayed at the Wyndham Sugar Bay (all inclusive) the week of the 3/5/11 with one of my friends. Overall I would definitely recommend this hotel.", "title": "I had a good time....", "helpfulness": 3, "user": "Dahlia2214", "date": "March 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 100316922}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "The hotel grounds are beautiful. They have lovely views of St. John. We had a bay view room (I would recommend that or an ocean view). The pool and beach were lovely, not too crowded.", "title": "All-Inclusive Bad Choice", "helpfulness": 1, "user": "JakeB52", "date": "March 15, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 100294810}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "The food was okay, above average, but a lot of buffets. I definitely recommend the all inclusive though because the food is pricey. Drinks were good, everything but top shelf is included.", "title": "I absolutely enjoyed myself at the Wyndham!", "helpfulness": 2, "user": "rested_11", "date": "March 14, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 100169042}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "The nightlife was pretty weak, but Red Hook is just a few minutes down the road and pretty safe.", "title": "Wonderful! Will come back!!!", "user": "ao7808", "date": "March 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 99954523}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "My wife and about 50 colleagues just came back from this resort. They went all-inclusive July of last year, and that seems to be a wild miscalculation.", "title": "What a great time!", "helpfulness": 1, "user": "OhioBlondie8", "date": "March 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 99948171}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We just returned from a trip to St Thomas and we stayed for five nights, six days. I read all of the reviews of this hotel before booking, and like others, had some reservations. It was an anniversary trip and I wanted it to be \"just right.\" Overall, I think it was an enjoyable trip.", "title": "Enjoyed our time at the Wyndham Sugar Bay and St. Thomas", "helpfulness": 1, "user": "LeeLeeGOP", "date": "April 2, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 102584371}, {"rating": 4.0, "stay_parameters": "Stayed March 2011", "text": "There are some good and not-so-good on this property. On the good side, we were able to get an upgrade after mentioning at the front desk that it was our anniversary. The view of the water and surrounding area was just amazing. On the not-so-good side, we felt that they layout, nightlife and buffet food needed improvement. We would still recommend it, but here are some tidbits:", "title": "Had the time of lives", "user": "TeeTee1224", "date": "April 2, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 102563277}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "On Food: The Manor House served great breakfast, though they could switch it up a bit more. Their dinner - when not a buffet - was outstanding. Baci is the Italian restaurant down by the pool and it was good, as well. I did not enjoy the Mangrove's daily lunch buffet at all (same stuff everyday and not appealing) but did enjoy the Pimento's burgers. I was surprised that, for an all inclusive, the rooms did not include anything stocked in the fridge for those of us going A-I. I was also surprised that they didn't have drink machines at the bars (getting a frozen drink took a bit of time). The inside bar at the pool was crowded and it took a while to get drinks. The outside pool bar was not a full bar. A good tip is to order snack food at the Casino Bar.", "title": "A Wonderful Vacation!", "helpfulness": 2, "user": "StephanieSDPB", "date": "April 2, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 102550649}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "On the property: I'm not a fan of all the feral cats running around and the Iguanas sure can come visit, so make sure you are ok with them! The layout, as others have noted, can be tiresome after a long trip. We rented a car and it was a bit of a pain to go down to the parking lot and also to get to the pool. But that said, their shuttle (when working) was timely. The pool is great but the beach can be rocky...so water shoes is a good idea. Loved their cabanas on the beach and pool!", "title": "Loved the Wyndham Sugar Bay resort! Highly recommend it!", "helpfulness": 1, "user": "ahaznett", "date": "April 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102419823}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "On bugs: I was eaten alive! So definitely bring spray and stay away from the beach after dark.", "title": "Excellent location, comfortable room, spotty service", "user": "BillBen078", "date": "March 31, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 102357468}], "location": {"country": "Caribbean"}, "stars": 3.5, "variance": {"poor": 342, "average": 405, "very good": 729, "terrible": 288, "excellent": 535}, "aka": "Wyndham Sugar Bay Hotel", "slim_ranking": 0.4, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 4.0, "rooms": 3.5, "location": 4.0}, "description": "At the Sugar Bay Resort & Spa, you can enjoy amenities including gorgeous inter-connecting pools, an award-winning spa, and private balconies! This St. Thomas resort is located just 15 minutes from the famous Mahogany Run Golf Course. Sugar Bay Resort & Spa is located on a secluded white beach with breathtaking, panoramic ocean, bay, and mountain views. The Sugar Bay Resort & Spa is the perfect destination for your next St. Thomas vacation!"}