{"user_rating": 4.0, "review_count": 68, "name": "Sugar Lodge at Sugarbush", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "We just returned from a 2-night stay at the Sugar Lodge with our 3 kids. It was Christmas week and we were there to ski at Sugarbush and really just needed a place to sleep...this was not the sort of trip in which we were looking to be pampered or to spend alot of time at our hotel. Given this, we were pleased with our stay at the Sugar Lodge. I travel extensively for business and pleasure and would definitely NOT confuse the Sugar Lodge with a St. Regis or Ritz : ) But for a relatively inexpensive room that was large enough to comfortably accommodate my family of 5, close to the ski mountain and with pleasant staff -- we would return.", "title": "Great location and King Suite worked for our family", "helpfulness": 2, "user": "blondfromBeantown", "date": "January 1, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 91339839}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We stayed in the King Suite which was very spacious (650 sq ft, says the website) with a large open living/dining/kitchen area, large bathroom and large king bedroom. There was a double pull out couch and room for us to put one of the kids on an Aerobed on the floor. We had a separate \"back door\" with steps down to the parking area which was very convenient for loading/unloading. The full kitchen was decently equipped and I was able to heat up the chili dinner that I had brought for my family and serve it easily.", "title": "We've Been Happy Twice", "user": "Elsa243", "date": "October 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 82921914}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "As others have said, the furniture is not brand new, but it was all in good shape and very clean. We thought the king mattress was very comfortable. I'm not sure I'd like staying in the first floor rooms since they have smaller windows at ground level and might have a basement-sort of feel to them. Our suite had lots of windows and nice light. My one suggestion to the owners would be to upgrade the linens just a bit. Again, while I don't expect 650 count sheets at a simply ski lodge...the sheets and towels were hospital-quality, very rough and the pillows were so very thin.", "title": "Good Value, clean and quiet.", "user": "sugulinda", "date": "August 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 75623974}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We thought the cont. breakfast was fine -- just as advertised, we were not expecting a full breakfast and everything we had was fresh and delicious. It would be cozy if they lit the fireplace in the morning too. The evening wine/beer pub room was convenient but could become much more of a gathering spot if there were a few nuts or munchies offered. Chocolate chip cookies offered in the afternoon were fantastic (would love their recipe!). We did enjoy the hot tub one evening and it didn't bother us at all that it was only allowed between 4 - 9 pm. In fact, because our room overlooked the backyard, I was glad that there was no chance of any late night partiers taking over the hot tub and keeping us awake.", "title": "We come back every year", "user": "GolfandskiNewJersey", "date": "March 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 59286352}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "The location is great -- just a 3 min drive to Sugarbush's main parking area.", "title": "Friendly, warm and cost effective", "user": "VTantlers", "date": "March 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58675017}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We stayed at Sugar Lodge at Sugarbush for a recent family reunion. We stayed in the Queen Suite. Yes, the TV is older and the furniture is an older style, but the price of this hotel is not a Four Seasons price. I feel we got good quality for a decent price. And this hotel is clean. I am not sure who the people that wrote the negative reports met with upon checking in. The young man and young lady at this hotel could not be nicer or more helpful. This suite has a full kitchen, so I am sure during ski season that is particularly useful. But if you are looking for a location near the skiing and a clean, inexpensive place to stay, this is the one.", "title": "Nice hotel. Very Clean and nice staff", "user": "LyndaLProvidence", "date": "July 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 33892741}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We stayed at the Sugar Lodge for a ski week at Sugarbush and have every intention of returning. After an exhausted search of all the area accomodations we thought this would be the best bet for the money and we were dead on. We actually spent a night in a regular room before spending the rest of our stay in the queen suite. The room itself is comfortable, but nothing special and not very big, and as other people on here have said, it could use a new tv. But everything worked and the beds were fine. The queen suite was pretty good all around. Everything was relatively clean and in great working condition. It was a good amount of room for a couple, but I would hesitate to say much more than that. The bedroom is barely big enough for a bed and there's no tv, but for a place to stay after a day on the slopes, it's just fine. We also got to peak at the king suite, and that was amazing. It's a much larger, more updated version of the queen suite, so the bed room is large and has a tv. The living/dining area is also conderably larger. Continental breakfast was fine, nothing fancy. Common area is quite nice, especially with the fire going at night. The wine/beer bar wasn't exactly hopping while we were there, but the lodge wasn't all that full, I don't think. There's also a community fridge for the people staying in the rooms, which was clean and plenty safe to leave some food or drinks in, also a community microwave. The staff was very friendly and quite helpful. Location is perfect. It's less than a minute to Sugarbush's parking lot (which came in handy since I forgot my goggles one day). And it's 3 or 4 minutes to the Mt. Ellen base. We are absolutely planning on staying here again. It's perfect for a place to rest up between days on the slopes if you're not looking to lush finishings and 5-star ameneties.", "title": "Great stay, plan on returning", "user": "snwbrdr4life", "date": "May 31, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 31242477}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Just spent a long weekend at Sugarlodge. Two couples and two rooms. Both rooms were outdated, but very clean and kept up nicely. Staff was nice and helpful. Extremely close to mountain, less than 5 minutes back and forth, we did not use the shuttle. Breakfast is nothing fancy, but they had fresh bagels/pasteries and fresh oj/coffee every morning. It was perfect for the price. They are exactly what they claim to be, a laid back ski lodge, nothing more, nothing less. For the price of the stay and the included lift tickets, you can't go wrong. While there make sure you hit up Slide Brook Lodge, half mile away, for burgers and hand cut fries, the best you will have anywhere.", "title": "Excellent Value, we will be back.", "user": "dretti22", "date": "March 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 26265660}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "Stayed at Sugar Lodge last week with wife and her friend. Place was clean and very close to skiing at Sugarbush. \"Superior\" room was tiny and furnishings well-used... a 'bit' different from website pictures. TV was from 1970's or 80's. Room suitable to sleep in but that's about all. Staff not rude but never more than disinterested... no \"welcome!\", never a fire in fireplace, did not bother to make up rooms on second day, always left coffee pot empty at breakfast, and night attendant kept staring out the window at us every couple of minutes when in the hot tub. I suppose price was ok for the area, but next time we'll try somewhere else instead.", "title": "A little effort... please?", "user": "adaiku", "date": "March 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 2.0}, "id": 25925974}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "This is the perfect spot for a great ski weekend. Its close to the hill and have the best packages in the East. Granted, its not fancy but it is \"clean, clean, clean!\". It was great to sit next to the fireplace after a hard day skiing and enjoy the company of some of the other guests. Everyone I met had stayed at the Lodge before and loved it! It's one of thos places that one you find it, you know you're coming back again. Sugarbush has the best skiing in the east and Sugar Lodge has the best deals. Some of these reviews sound like they were written by some grumpy old men looking for something to complain about. Both the rooms and the breakfast are great. Do yourself a favor, save some money and try the Lodge - I guarantee you'll be back!", "title": "Perfect Lodge, Perfect Price", "user": "JonesMan91", "date": "December 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 22761244}, {"rating": 1.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "I booked two nights in the \"Queen Suite\" at the Sugar Lodge. The \"separate\" bedroom in the suite was about the size of the bed. The place was very clean, and like other reviews have stated, the staff is not very welcoming. Never once was there a fire in the great room. The check in desk faces the great room with couches, and they even have a webcam on the fireplace beaming peoples every move to some remote location. And yes, the hot tub is only open from 4-9. There is no reason other than them being cheap that they don't let you use it all day.", "title": "Pure Hell", "helpfulness": 2, "user": "CTPSSUN", "date": "January 29, 2010", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 54642703}, {"rating": 2.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Here's where it gets good. Or should I say bad. We got in late and wanted to sleep in the 1st day. Not happening. Our \"Suite\" room was right above the breakfast area and just after 6:00 AM there were people dragging stools and chairs and stomping around. It sounded like elephants were up there because the floors are so thin. I went upstairs to see what was going on, and it was only one person. More came, resulting in no more sleep. I was on vacation and slept for 3 hours?", "title": "Be-aware Traveler", "user": "bpschwyn", "date": "December 27, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 2.0, "rooms": 1.0}, "id": 51971534}, {"rating": 1.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "I went upstairs to check out a day early, and they told me they were going to charge me, even if I didn't stay. I even spoke to the owner on the phone, and she said \"too bad\"since I pre booked the rooms.", "title": "It was like staying with the Gestapo!", "helpfulness": 2, "user": "Kasey21", "date": "December 16, 2009", "detail_rating": {"value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 51349994}, {"rating": 1.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "I honestly didn't have the cash to spend somewhere else, so i reluctantly took the offered upgrade to a different room.", "title": "Bait and Switch at the Sugar Lodge - Search Sugarbush Ski & Stay", "helpfulness": 1, "user": "KT_Travels_Trips", "date": "October 28, 2009", "detail_rating": {"location": 4.0, "service": 1.0}, "id": 47974792}, {"rating": 1.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "People who do business like this don't deserve your business or your money.", "title": "Beware paper thin walls = no sleep!", "helpfulness": 2, "user": "lovetotravelbybike", "date": "October 5, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 45864905}, {"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "• Poor quality of staff; to be frank, they were rude", "title": "poor value", "helpfulness": 1, "user": "travelvaluefamily", "date": "September 20, 2008", "detail_rating": {"front_desk": 1.0, "value": 1.0}, "id": 20230591, "likes": {"liked": "— The staff"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "• Outdated", "title": "Quiet spot", "user": "emcole", "date": "September 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 20154691, "likes": {"liked": "— The mountain setting", "disliked": "— uncomfortable bed"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled solo", "text": "• Better value for the same price found elsewhere", "title": "A Clean, Well-Lighted Place", "user": "Silkentent", "date": "September 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 19671230, "likes": {"liked": "— Quiet", "disliked": "— No half-and-half for the coffee"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "We stayed here for a few nights last month. The atmosphere is casual (as you would expect from a ski lodge, even off season). Our room was clean and was big enough that we weren't bumping into each other. The bed was not very comfortable. Only heard faint sounds from the other rooms, so it was very quiet overall. Nice lobby/great room area. Adequate breakfast - not much variety but it served its purpose. Helpful and unobtrusive staff. We appreciated the guest laundry and the communal refrigerator on the first floor. Be aware that the first floor rooms have windows that are at ground level.", "title": "not a good experience", "helpfulness": 2, "user": "LovesTrips_8", "date": "May 19, 2008", "detail_rating": {"front_desk": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 16199671, "likes": {"liked": "— Location", "disliked": "— Owner"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "I walked into the Sugar Lodge on the morning of August 26, 2008 in search of a place to stay, having fled an unsuitable B&B after only one night of a planned three-night stay. I was driving north on Rte 100 wondering how I could salvage my trip when I realized I was near the Sugar Lodge, a place I had stayed in 2002.", "title": "Great place to stay with good value", "helpfulness": 1, "user": "laritrav", "date": "March 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 14172483, "likes": {"liked": "— Hot tub", "disliked": "— Some noise in the morning"}}], "location": {"country": "United States", "city": "Warren"}, "stars": 2, "variance": {"poor": 6, "average": 4, "very good": 22, "terrible": 9, "excellent": 27}, "aka": "Sugar Lodge At Sugarbush Hotel", "slim_ranking": 0.75, "description": "Sugar Lodge is a classic mountain lodge less than 1/2 mile from the Sugarbush Ski Area and Robert Trent Jones, Sr, Golf Club in the heart of Central Vermont. The Lodge offers the amenities you would expect from a larger hotel with the ambiance and warmth of a Vermont Country Inn. With our proximity to the lifts and links with unbeatable rates, Sugar Lodge is the ideal choice for your vacation in Vermont.The Mad River Valley is also a special place in the summer. Escape the heat and humidity and head to the mountains with our cool mountain streams, breezy peaks and the pleasure of our unparalleled culinary delights.Continental Breakfast, Cable TV, Beer/Wine Bar, Free WiFi and Outdoor Heated Pool are some of the modern services that seem to blend seamlessly with the historic post and beam Lodge atmosphere."}