{"user_rating": 4.0, "review_count": 53, "name": "Suites Del Angel", "reviews": [{"rating": 4.0, "title": "Looking forward to returning to this hotel!", "text": "Me and my boyfriend stayed here for a week last month and had a really good time. I chose this hotel because it had good reviews, and lo, I made a very good decision. The room was clean, small for a suite, but having two separate rooms was great- we had a few people come over for drinks one night and not haing to subject them to our bedroom was great! The shower/bathrtub/jet tub was great, tons of hot water and clean towles. Balcony was cute, we had it open the entire time we were there! The restaurant downstairs was affordable, we typically had our breakfast there. Id love to go back to this hotel soon! Concierge was helpful, though they didnt have as much to offer in terms of information as say, a more expensive hotel. They did however, get us tickets to two separate tours, which were great and well worth the $30 USD they cost. Great experience for the cost, Id give this place two thumbs up!", "helpfulness": 1, "user": "awaters80", "date": "February 16, 2008", "id": 13606216}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "My wife and I just returned from a 5 night stay. Overall, we were very satsified with our experience. The hotel staff were friendly and responded to requests promptly. The housekeeping staff kept the runs nice and clean. This is a very nice hotel for the value, nothing fancy, but a good experience. The in hotel restaurant was decent, and there are plenty of very good restaurants near by. We were very impressed with the museums and art in Mexico city. We will definitely return and would be happy to stay at the Suites Del Angel again.", "title": "Nice Hotel, Good Staff, Great Location", "user": "kgtBoston", "date": "May 31, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 7724633}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "I stayed at the Suites Del Angel whilst attending the World AIDS conference in August. The city was busy and I had stayed in another hotel for one night which just didn't compare. Although the hotel is old and a bit dated I found it clean, certainly the rooms were a lot larger than expected and the staff exceptionally friendly and helpful. The breakfast was fair.", "title": "Highly recommended", "helpfulness": 2, "user": "LVBCapeTown", "date": "September 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 19605160, "likes": {"liked": "— Size of the rooms, the kitchenette, quiet, clean and very friendly and helpful staff. Excellent area for commuting", "disliked": "— Bit old and outdated"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "I loved the area, it was convenient for most things and if you got lost you just asked for directions to \"the angel\" and everyone knew where to send you. I would definitely stay here if I ever had the good fortune to visit Mexico again. There are some really good restaurants across the road from the hotel, give them a try you'll be pleasantly surprised. All in all a great experience, I felt very much at home at this hotel.", "title": "highly overpriced!", "helpfulness": 1, "user": "mariatraveler", "date": "August 6, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "location": 2.0, "rooms": 3.0}, "id": 18689492, "likes": {"liked": "— roomy suites", "disliked": "— not a good value"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "This old and run-down hotel is totally overpriced. The suites are nice and roomy, but again, old and run-down. We paid $215/night. We had stayed just a few days earlier at Eurostar, also in the \"zona rosa\" and their suites were the same, only newer, and we paid only $67/night! Del Angel is on a nicer street, but much farther from the metro too.", "title": "Nice place to stay and friendly", "helpfulness": 3, "user": "RoseCityTexas", "date": "July 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 18439817, "likes": {"liked": "— staff and location"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We were SO disappointed when we got there. Don't let the nice pictures of the lobby fool you. It doesn't look that nice.", "title": "Safe location and great personnel", "helpfulness": 4, "user": "shell_217", "date": "July 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17837955, "likes": {"liked": "— location and staff", "disliked": "— metro stop is far for people who don't like to walk"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "The staff was nice and helpful, but the hotel is just not worth the price.", "title": "Loved the Suites del Angel", "user": "TampaCubana", "date": "June 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 17194528, "likes": {"liked": "— Helpful front desk; separate sitting area; fridge and microwave", "disliked": "— A bit of a distance from the Metro (subway)"}}], "location": {"country": "Mexico", "region": "Central Mexico and Gulf Coast", "city": "Mexico City"}, "stars": 3, "variance": {"poor": 1, "average": 4, "very good": 23, "terrible": 6, "excellent": 19}, "aka": "Suites Del Angel Hotel", "slim_ranking": 0.460966542751, "description": "Una lujosa propuesta de hospedaje en la zona ejecutiva más importante de México y Latinoamérica, el Corredor Reforma, Hotel Suites del Ángel le espera para darle la bienvenida a la imponente Ciudad de México, Distrito Federal. Con instalaciones que mezclan toques clásicos y contemporáneos, nuestro hotel 5 estrellas en México, D.F. representa comodidad y conveniencia a cada paso, al ofrecer una serie de comodidades pensadas tanto en el ocupado huésped corporativo como en familias en plan de descanso y diversión. Las 48 Suites De Lujo que le ofrece este en México, D.F. están equipadas con todos los servicios que los viajeros en plan de trabajo pueden necesitar: desde Wi-Fi hasta mesas de trabajo, y aun así una atmósfera acogedora que las familias pueden disfrutar. Además, en Suites del Ángel nos esmeramos para ofrecerle siempre lo mejor, al contar con: Servicios de Restaurante Centro de negocios Gimnasio Wi-Fi en Suites y áreas públicas del hotel Y una increíble ubicación a sólo una cuadra del Ángel de la Independencia, muy cerca de la Embajada Norteamericana y de numerosos negocios, restaurantes y sitios de interés. No lo piense más."}