{"user_rating": 4.0, "review_count": 349, "name": "Suite Novotel Rouen Normandie", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Rouen is a v pretty city and a good stopover for that reason- this Novotel has the usual nice rooms, good breakfast, good service. Its not quite an easy experience as others as it was not that easy to find (new area so satnav hard to programme) and the parking is not great, there are a very small number of spaces in underground secure park which are likely to be full, so you are left with on street which was ok but not ideal. Again for a stopover not having a restaurant can be a hassle but there is a Macdonalds 5 mins walk away, and also a shopping centre with restaurants and a playground (Docks 67) which would be worth seeking out with an evening to kill.", "title": "nice stopover", "user": "twoplusonetravel", "date": "September 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 139684528}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Stayed here en-route south. Good sized room with a pull across screen on a track for privacy. This is great for families as kids can be in one half and you in another. There is a microwave and a mini-bar sized fridge, ut equipment is limited to two small wine glasses and mugs. Consumables i.e. tea and coffee are very basic with 1 tea bag and two coffee and one small bottle of Evian - not enough for one adult, never mind any more. Just across the park area is a Carrefore mini supermarket and that is well stocked with things to eat after microwaving and they are quite god. Reception will give you disposable plates and cutlery. The bathroom was well equipped with both bath and shower. Our £89 rate included breakfast and the quality was good even if the range is limited. They do breakfast boxes for kids, full of sugar to keep them hyper for the rest of the day! They contained coco pops, capri sun orange drink, croissant, and a fruit puree pouch. The adult breakfast was good overall and worth eating. They show traffic lights of the busiest times and we just got there at 7.45 and it was fine, no crowd and empty tables. When we left to go into town at 9.15, the place was rammed with families eating and standing, many round tables for two.", "title": "Well worth it!", "user": "Cotswolds_crew", "date": "September 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 139642847}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "The parking was ten euros and worth it as very secure and clean, but there is quite a bit on street surrounding the hotel. The walk into town is 15-20 minutes and at the top of the gardens across the road on the right is a little play park for children. There is a great fruit, veg and fish market beyond the cathedral on Saturday mornings.", "title": "Great hotel", "user": "drucetowers", "date": "September 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139557476}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Bear in mind restaurants here don't start serving until 7pm, so go prepared if you have very little ones like us.", "title": "An OK stop over", "user": "thomassuu", "date": "September 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 139514533}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Overall we would have no hesitation going back here - very quiet and good location with nice riverside area across the road. Its not easy to find initially, but it helps if you stay out of the underpasses.", "title": "nice concept", "user": "BRU23", "date": "September 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 139443979}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The Novotel Rouen is a fantastic stop-over location and we thoroughly enjoyed our time their. The receptionists are all able to communicate in excellent English (I encountered 3 different females and all could speak excellent English) and they are very helpful.", "title": "A great stop-over location, perfect for families!", "user": "112Anon", "date": "September 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 139412168}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The rooms are excellent, exactly what you pay for. The beds are comfy and our children loved the space. The bathroom is well equipped with a fabulous power shower and big bath which fills very quickly.", "title": "Nice Modern Hotel - Good for an Overnight Stay", "user": "HJS2012", "date": "August 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 138899482}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "In each room, free films are provided and there is about 40 choices, the vast majority being new DVD releases which was an incredible surprise, my 8 year old had to make a very hard decision of what to watch!! Other films are also included like Back to the Future etc. Very easy to use and a great way to unwinf once the kids are in bed as the dividers in the room allows for privacy.", "title": "Family room", "user": "Maria A", "date": "August 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 138867240}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We didn't pay for breakfast as we read previous reviews on this site. Breakfast looked busy and there is not enough seats for every one at peak times, many people were hanging around, waiting for others to finish. However, there is a Carrefour City only 3 minutes walk across the road which is like a Sainsbury's local. They have fresh bread, pastries, briocche, croissants etc. All these can then be heated in the microwave in the room if needed.", "title": "Great family room in lovely city", "user": "Alison D", "date": "August 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138765403}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "My only complaint is the lift. There is only one and it can sometimes become VERY frustrating waiting for it, sometimes up to 5 minutes. It is small and actually essential to get to the car park if you are using that facility.", "title": "Lovely stop over en route to Brittany!", "user": "Gra_legend", "date": "August 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 138700737}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We stayed at the Suite Novotel Rouen Normandie en-route to the Charente area. It was perfect for our overnight stay with our 2 grandchildren aged 4 and 7. The room was spacious and contempory. Very clean and the children enjoyed a free English film on the television after we settled back in our room after a lovely walk along the River Seine. (which our room overlooked)", "title": "en-route with grandchildren", "user": "maturecouple070", "date": "August 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138689309}, {"rating": 4.0, "title": "Family overnight en-route to Brittany", "text": "The breakfast was very enjoyable with plenty to pick from considering it was a continental breakfast. The children enjoyed the whole experience. We would certainly recommend this hotel to family and friends.", "user": "A TripAdvisor user", "date": "August 24, 2012", "id": 138244774}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Clean modern hotel more suited to business travel perhaps. A 15 minute walk from the tourist centre of Rouen with on-site parking. The service at reception was good. Free internet avialable throughout the hotel.", "title": "Family friendly hotel and a friendly hotel in general", "user": "C_Quality_Surveyor", "date": "August 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 138153516}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Suite Novotel Rouen is family friendly, our family room was equipped with microwave oven and 3 hours of free internet. We ate in the other night having bought some really tasty paella from the Carrefour hypermarket in Barentin (Barentin was recommended by the friendly hotel reception staff when asked where to go to in terms of hypermarket shopping). McDonalds is also a few minutes away.", "title": "Once found this a brilliant stop over hotel", "user": "carolevegas", "date": "August 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 138034670}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Parking wise, its 10 euros per night if you wish to use the underground parking facility. Instead we parked on whatever spaces we could find nearby the hotel at nil cost.", "title": "Rouen stop over", "user": "Jackie244", "date": "August 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 137924185}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We stayed for a night to break up the journey back to England with our baby and 6 year old.", "title": "A first-class family hotel, great for stopover", "user": "Pellepal", "date": "August 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 137881749}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We had an excellent experience - an outstanding receptionist who was very efficient and courteous, and even gave our children a present each.", "title": "Ideal Hotel For A One Night Stop Over On The Way Through France", "user": "DavidRebecca", "date": "August 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 137653982}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "You don't stay in a Novotel for the character, but the room was excellent - very neatly designed so that my daughter could go bed earlier by pulling across a partition.", "title": "Far from the city center", "helpfulness": 1, "user": "PandoraPalermo", "date": "August 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 1.0}, "id": 137623675}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The position was great: a short walk along the Seine to the centre of Rouen where we had a lovely meal. If you don't want the walk, there's a lively bar/brasserie on the river opposite the hotel.", "title": "A good all rounder", "user": "Maf2989", "date": "August 18, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 137572870}], "location": {"country": "France", "region": "Normandy", "continent": "Europe"}, "stars": 4, "variance": {"poor": 16, "average": 47, "very good": 188, "terrible": 6, "excellent": 92}, "aka": "Suite Novotel Rouen Normandie Hotel Rouen", "slim_ranking": 0.0961538461538, "description": "3 star hotel with eighty 30 sqm suites (of which 16 are specially set up for long term stays). Set in an inviting environment, the airconditioned and modular rooms allow 2 children to share with their parents. The Suite Novotel Rouen Normandie is located ten minutes walk from the centre of town, on the banks of the river Seine. You can park your vehicle in our easily accessible underground car park."}