{"user_rating": 4.0, "review_count": 284, "name": "Suite Novotel Montpellier", "reviews": [{"rating": 4.0, "title": "Our stay in Montpellier", "text": "We would like to find bigger or more towels for the shower use.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "August 3, 2011", "id": 116208540}, {"rating": 4.0, "title": "Tour De France", "text": "At this point I cannot find more issues to illustrate, why do you request two hundred characters? In my opinion fifty are more than enough to describe a one night stay", "user": "A TripAdvisor user", "date": "July 24, 2011", "id": 115721761}, {"rating": 5.0, "title": "Lovely suite, fantastic staff", "text": "We wanted to attend a stage of the tour for the first time and booked the suites novotel and what an excellant choice, the room was not what we expected with a sliging door from the bedroom to the living room which had a proper bed for our teenage daughter so we all had our own privacy the bathroom and toilet were shared bit you could get to both from the bedroom or the living room so without having to disturb any one. Excellent continental breakfast lovely pool and just across the road from the airport bus and the tram which allowed you to acess all of Montpellier, some great restaurents just 5 mins walk. Excellant choice of hotel if i say so myself and just jumped on the tram to the finsh of the tour", "user": "A TripAdvisor user", "date": "July 11, 2011", "id": 115235964}, {"rating": 4.0, "title": "Confortable hotel", "text": "We selected this hotel in order to have a separate living from sleeping space, so that we could easily stay up, watch TV etc after the baby was in bed. This worked really well, and we would definitely consider staying again on that basis.", "user": "GJobim", "date": "May 13, 2011", "id": 108138664}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "The hotel has no restaurant so we kept the baby on UK time and ate out early before her bedtime, but on some nights we got microwave meals and had dinner in the suite which worked fine, even with plastic cutlery! The kitchenette, inc microwave, also meant we could prepare the baby's food without having to worry about whether there would be something suitable at the hotel breakfast buffet.", "title": "Lovely spacious rooms, very nice hotel", "user": "Busy_Bee_12316", "date": "January 21, 2011", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 93990969}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We stayed here for 2 nights and found a reasonable price on the internet (booking.com i think) for 95euros a night. You can get cheaper accommodation in Ibis (75 euros) closer to the town centre however we wanted a little more space. The rooms are spacious with ensuite bath and kitchenette. Suitable for longer stays and there is room to make yourself at home and it is more of an apartment feel than a hotel room. They have free broadband internet and movies on demand free of charge. The bed was very comfortable with good aircon. The tram passes close to the hotel to go into town and takes about 10mins. You can walk it in 15.", "title": "Lots of space", "user": "Diane B", "date": "September 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 78372508}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "I was here for business for a long stay so having a separate lounge area and small kitchenette was ideal for me. My husband joined me for the weekend so I have also seen it then.", "title": "Good Choice for longer stay.", "user": "chatty_j", "date": "August 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 77348361}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "ADVANTAGES", "title": "Am I in the same hotel as other reviewers?", "user": "YCPL", "date": "May 16, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 64302143}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Good location for business district, and for trams to other areas (2 stops in 5 min walk), restaurants. Clean and modern, kitchen area, separate lounge modern bathroom and toilet, pool, free internet, free wifi, free films, free music stations, bar, free car hire (4 hours smart car).", "title": "Smart and comfortable but don't bother with breakfast!!", "helpfulness": 1, "user": "Firemunchkin", "date": "September 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 41240740}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "DISADVANTAGES", "title": "Don't stay there if you're looking for a good service", "user": "V0YAGEUR_averti", "date": "August 11, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 37427228}, {"rating": 2.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "we would like to spend there 2 night but we run away... We book double room with crib. they confirm the room. checking in they say there's no crib, we insist, they say our 16 month old daughter can sleep on the floor so she can't fall down from the bed. what can i say more..????.. people there are rude. However rooms have very old furniture and looks dirty. Location is good, but there are other in best places.", "title": "worst Novotel Suite", "helpfulness": 2, "user": "marco.to", "date": "February 22, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 125026457}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Although the Suite Novotel Montpellier could definitely use a make-over (the interior is starting to be a bit dated and worn and it compares unfavourably with the new generation Suites like for example the one in Perpignan), it still offers very good value for money. The Suite Novotel offers what matters: bright and very spacious rooms and bathrooms, free wifi & internet and free movies on demand. Breakfast is a tad expensive compared to the price of the room. Very friendly staff at reception.", "title": "Still good value for money", "helpfulness": 1, "user": "belgtravel", "date": "February 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 124081907}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "My husband and I were traveling on business and were scheduled to stay in a suite in this hotel and downgraded to a regular double room to save money. The room was small but clean. Perfectly adequate. Only complaint was that it's winter so the hotel was overheated. We tried to turn on the A/C to cool down our room, but it didn't work. Had to sleep with the window open and it was really noisy. Didn't get any sleep.", "title": "Clean, adequate", "user": "TwiAgtraveler", "date": "January 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 123784812}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Prime location with tram, bus nearby and just 10-15 minutes walking distance to Place de la Comedy. Suites: nice layout and very clean (except for the carpet). Staff very professional. And all kinds of nice conveniences, such as the small food market with to go microwavable lunch and dinner items, the free massage on Thursday's and the almost free car rentals! Very good deals on rooms also. I would definitely recommend this hotel. A few minuses, though: carpets in rooms should be cleaned better (walking 5 minutes with white socks would make them look black); some guests smoke in their rooms; no proper room temp. control during winter months, and the rooms on lower floors facing the intersection (front of the hotel) are noisy because of traffic (but hey, that's usually the case you pay when staying in a downtown hotel).", "title": "Just about perfect, except for some minor things", "user": "Alex L", "date": "January 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 122491984}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "I had a suite room during my stay. These rooms provide enough space to comfortably stay during a business trip where you may want to do as well some work in the evening. And if you do not feel like walking to one of the few restaurants on the river nearby or you do not want to take the tramway to the city center, you may enjoy the selection of food you get at the 24 hour shop in the lobby. The only thing to keep in mind is, that alcoholic drinks are only sold at the bar next to the reception. And that bar closes at Midnight precisly - even that the staff at the reception is still there. So you have to plan ahead for that late night drink.", "title": "A business stay in Montpellier", "user": "Dddd X", "date": "December 2, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 2.0}, "id": 121329206}, {"rating": 3.0, "stay_parameters": "Stayed October 2011", "text": "Rooms here are studio apartments. Some even have a kitchen. My room had a living room area, a bed room, and a bathroom, plus a small kitchenette. Rooms also have a large room safe. Not your typical hotel room. Free wifi too.", "title": "Apartment style living in a centrally located hotel", "user": "Ciahasher", "date": "October 29, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 119872741}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Breakfast served in the lobby is okay, nothing great. They also have a bar in the lobby. Staff is friendly and helpful.", "title": "Fantastic, spacious, close to airport - 15mins.", "user": "TwomanAberdeen", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117245326}], "location": {"country": "France", "region": "Languedoc-Roussillon", "continent": "Europe"}, "stars": 4, "variance": {"poor": 20, "average": 52, "very good": 130, "terrible": 5, "excellent": 77}, "aka": "Suite Novotel Montpellier Hotel", "slim_ranking": 0.172839506173, "description": "3 star hotel with 116 inviting 40 sqm suites. Enjoy our free unlimited Suitebox service including calls to landlines in France, video and music on demand, games, information and more. Swimming pool, parking garage, bar, Boutique Gourmande refreshments, gym, business corner, free massages on Thursday evenings. 10 minutes from the beach and the airport. 10 minutes walk from the city centre. Close to the train station."}