{"user_rating": 4.5, "review_count": 42, "name": "Suites Beranger", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "We stayed in Tours so that we could take some day trips to the Loire without having to come from Paris. I would definitely recommend Suites Beranger as it is fairly close to the train station and in the evening there is a really nice old area of town with cute medieval buildings and LOTS of restaurants - you can walk there in 10 minutes. The rooms were amazingly large - I think that you could have fit 4 of the room we stayed in Paris into the room we had in Tours. If you are looking for a base from which to explore the Loire this is it. On Sat there was a beautiful flower market on the street infront of the B&B and although I couldn't buy anything I still had a wonderful time taking in the sights and sounds of the market. If you don't have a car there are many private tours to take to the chateaus (I would recommend Acco-Dispo) and you can also get to Amboise to explore the Clos Luce (home of Leonardo DaVinci) and Amboise Castle by train (20 minutes). Have fun and enjoy this lovely B&B.", "title": "Can't go wrong.", "helpfulness": 1, "user": "Melster", "date": "June 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131869324}, {"rating": 5.0, "title": "Wonderful Stay & Beautiful Property & Friendly and Helpful Host", "text": "We had a wonderful visit of Tours and the Suites Beranger was the perfect place to stay. It is a beautiful property with a wonderful host. The attention to every detail was apparent at every point of our stay. Absolutely wonderful.", "user": "MarkWWeston", "date": "June 10, 2012", "id": 131665368}, {"rating": 3.0, "title": "Exceptional home, location......", "text": "I doubt that anyone Who stays at this B&B could complain of the location or the quality of the property. We stayed here on advice from Australian friends who had been here in winter. Our stay was for two nights, so not long. The rooms and environs are superb, excellent security and a stones throw from most of the restaurants. We arrived fairly late owing to a car breakdown, but called ahead to advise, the owner stayed back to ensure our check in was ok. Up to this point, faultless. The following is not a criticism of the property but an observation of the host. We stayed on a holiday weekend (there's a lot in France!) and our friends were staying at another location so we were organizing plans by text. We asked if it was possible for a private car to visit Chenenceaux, and we're advised that even though it was unlikely, Michelle (the proprietor) agreed to call and see what was available. This was a request for information on what COULD be done. 1.5 hours later, we had sorted plans out, as we had heard nothing and assumed that there was nothing available that Michelle could book. We were greeted at the front door by Michelle as we were leaving and told she had arranged everything. We advised her that because of the delay we had made other plans, and apologized. The response was nothing short of staggering. We have never been 'dressed down' by any host of any establishment that we are PAYING money to, and it was an affront. Im sure Michelle prides herself on her English, but her vocabulary was insulting and rude. There was no discussion of cost, not even after her tirade, no mention of the fact that we asked for information, not a booking. Her comments were to the effect that she had woken half of Tours to assist us, and that this would reflect on her personally. We were both shocked at this outburst, and seriously considered moving irrespective of cost to another property where our friends were staying. We decided to remain for the last night and check out early, which we did. As I said, the property is excellent quality in a good location, but the operators have only been doing this for a year, and would suggest need to understand that this is a service industry, and the paying customer is the priority, not the relationships with people they refer business to, or themselves. From a personal perspective, we would not stay here again, irrespective of the property. There are always other properties with hosts that accommodate their clients travel plans. I will put this down to a miscommunication, but this will not change our opinions.", "helpfulness": 3, "user": "Jandkat", "date": "May 28, 2012", "id": 130773064}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We used TripAdvisor to choose Suites Beranger. We were visiting the Loire valley with a car for 4 nights and wanted a suitable base. We agonised over which town and which accommodation to choose within our price range. Tours and Suites Beranger were highly recommended on TripAdvisor and the rooms looked good. Everything we expected has been fulfilled - from the moment of turning into the car park next to the private garden, to the position in Tours (and Tours with respect to the Loire Valley) and our room. We chose Caramel which faces on to the beautiful garden. The rooms are totally modern yet nestled into a 19thC (I think) mansion. Michelle is a very nice and helpful lady. The continental breakfast is plentiful and delicious. The place is bright, clean and tidy. We recommend it to all of our Australian friends and the world-wide TripAdvisor community.", "title": "Modern Comfort in Old City", "helpfulness": 2, "user": "Michael052", "date": "April 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 128649394}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "My fiance and I recently stayed here for three nights while visiting the Loire Valley. We found both Michelle and her husband to be very welcoming and accommodating; they really went above and beyond in making our stay as comfortable and convenient as possible. We stayed in the Earl Grey room, which was quite large and modern. The breakfast came with all the expected French fare - pastries, jams and yogurt and was served in the lovely dining room.", "title": "The perfect home-base when touring chateau country", "user": "AliGSY", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 128447364}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "This is a gem of place and reflects the style and exquisite taste of Mme. Michelle Guitton. We stayed one night in a suite that overlooked the garden and it was modern in every respect. The bathroom was very large and well-appointed. Michelle was extremely friendly and provided us with a map and recommendations about places to see in Tours. Suites Beranger is situated right on the main boulevard and all of the sites are within easy walking distance from the hotel. We enjoyed an excellent dinner at a restaurant near the Gare de Tours and our breakfast served by Michelle the next morning was as you would have expected -- perfect!", "title": "Excellent location in Tours", "helpfulness": 1, "user": "LuauLopaka", "date": "April 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128348069}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "This accommodation is seriously one of the nicest places we have stayed...world-wide. The accommodation is a large house I believe built circa 1860. It has been fully renovated and is absolutely beautiful. I believe there are 5 guest rooms all up. It is more like a five star hotel with personal warmth and exceptional service (but non-intrusive).", "title": "I would visit Tours JUST to stay here!", "helpfulness": 3, "user": "eatandrun33", "date": "October 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118956128}], "location": {"country": "France", "region": "Centre", "continent": "Europe"}, "variance": {"poor": 2, "average": 2, "very good": 3, "terrible": 0, "excellent": 35}, "slim_ranking": 0.1875}