{"user_rating": 4.0, "review_count": 726, "name": "Suite Novotel Reims Centre", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Rooms are nice spacious and clean, but unloading luggage and parking were a bit problematic -hotel parking was full and nearest parking was either garage from the rail station (required trip around the block which with Reims friday traffic takes 45 min easily) or on the street (metered at day time on workdays.", "title": "Almost very good", "user": "al3xxx", "date": "December 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 121569559}, {"rating": 4.0, "title": "Great weekend away", "text": "Another problem that it's walking distance from city center but it's pretty long walk, and you have to go there for food places too, unless you opt for the restaurant across from the hotel which is pretty good.", "user": "A TripAdvisor user", "date": "December 9, 2011", "id": 121549872}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We thoroughly enjoyed our weekend in Reims, despite terrible weather. The Novotel Suite hotel is a good concept providing more space than a standard room; we didn't make use of the day bed and I have no idea how comfortable it was. The small adjacent car park was free, which was great. Slight negatives were: the lack of cups or plates (why provide a microwave / kettle without the means to use; luckily I had read other reviews and came partially equipped) and the breakfast. I prefer a tranquil start to the morning, the hotel was busy and the serve yourself buffet was uninviting and over priced (the following morning we moved to a cafe for a more leisurely start at half the price). The final negative is the distance into town; you can cut through the station but once you repeat the journey a couple of times in a day, it does get a little tiring. However, overall, we had a really good time and slept very well (sound insulation is excellent).", "title": "Sweet suite", "user": "Stephen G", "date": "December 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 121379851}, {"rating": 3.0, "title": "ok", "text": "Spacious and friendly hotel.Excellent situation for visiting central Reims.Suite room very comfortable.Breakfast innovative and varied.Staff always smiling and helpful...no negative comments...secure free parking a useful extra.", "user": "A TripAdvisor user", "date": "November 21, 2011", "id": 120880980}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "This was a hotel with good rooms and staff were lovely but some very basic amenities. The bed was comfy and the rooms was very quiet for it's location, however at breakfast there was only paper plates and in the rooms there was only plastic and paper cups, no china. one day our room was not cleaned at all but the staff on the front desk were happy to bring up clean towels.", "title": "Great hotel, mediocre parking", "user": "FrankieC_WA", "date": "November 14, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120561275}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Following advice on this site we stopped over at this hotel en route to the Alps, with our two young children. We really loved it, and loved Reims as a stop. Its easy-ish to find, though in town. The welcome was relaxed and professional, with activity packs for the kids immediately presented. The suite rooms really work well - they have thought carefully about the design and its a move on from the traditional hotel room (which we experienced at the Novotel in Beaune the next night which was nice but not as nice) - with easily movable furniture, bath and shower \"pod\" cleverly fitted in, separate loo which is good with family in one room, and best of all two single beds cleverly built in to the design for the kids, without sacrificing living space. Tea and coffee making facilities, fridge and microwave are fab to have. We didn't use the gourmet boutique facility (posh ready meals for sale at reception to eat in your room) as Reims main shopping and eating drag is only 10 mins walk away, which has lots of very nice looking places to eat, including for families - and best still had the most wonderful huge Christmas market, including a carousel and santas grottos for the kids, outside champagne bar, lovely Christmas lights - it was a beautiful surprise three days before Christmas. All in all its hard to imagine a better stop on the way to the French Alps or the coast.", "title": "Great Alps stopover", "helpfulness": 2, "user": "twoplusonetravel", "date": "January 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 122778080}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "We stayed here, as it was midway to our final destination. We were pleasently met by reception (who spoke perfect English). Room was v comfortable & big enough for our family of 4...Most European hotels only cater for 3 persons, so this worked out cheaper than 2 rooms at a cheaper hotel!", "title": "Stop over enroute/return to/from Switzerland", "user": "Catherine D", "date": "January 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 122588861}, {"rating": 4.0, "title": "Good overnight stay", "text": "Breakfast for our children was free, so that worked out v reasonable too.", "user": "A TripAdvisor user", "date": "January 5, 2012", "id": 122576349}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "On our return, I had made an error on booking the incorrect date (we arrived a day late!) & was looked after and helped out by the receptionist, which after a long trip is the service I needed.", "title": "Good hotel near Reims city center", "helpfulness": 1, "user": "MarcMich", "date": "January 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 122570998}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "A couple friends and I had a triple room at this hotel for a visit to the champagne country. Cool lobby decor. The hotel is not a far walk from the train station (about 10 mins w/luggage). The room gave the three of us plenty of space to move around and the bathroom was nice. That shower was wonderful! Would stay here again if I returned to Reims! I didn't eat in the hotel but there was breakfast and a place to purchase snacks.", "title": "Eclectic place in Reims", "user": "TXDelta3", "date": "November 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 120507387}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Don't miss the Ante-Crise restaurant across the street from the hotel! Two of us wandered there late in the evening for a meal and were pleasantly surprised. Don't let the lime green walls scare you, we had the best creme brulee we've ever tasted in this place. Dinner was wonderful too but that dessert was amazing.", "title": "One of the best hotels we have ever stayed in", "user": "lakegirl48", "date": "November 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120440648}, {"rating": 2.0, "title": "2 Poor Nights Sleep at an Overheated Hotel", "text": "We had never visited Reims before and found that this hotel fitted the bill perfectly. It is a direct 15 minute walk from the centre, perfect for digesting a fine meal. We parked in the hotel's car park, were welcomed warmly by the receptionist and made our way to our third floor room. What a lovely, large suite. The kitchen corner was handy, as were the healthy snacks provided. We've never had such delicious herbal teas provided in a hotel, nor the fruity nibbles. The large bathroom was also perfect, and we had a lovely sleep on all three nights in the soundproofed room with blackout blinds. If we had not seen the trains we would never had known we were in the vicinity of the station. Breakfast was perfect, again with healthy options. We'd definitely return to this lovely hotel. It was our first experience of a Suite Novotel, hopefully it won't be our last.", "user": "A TripAdvisor user", "date": "November 10, 2011", "id": 120409328}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "The hotel overall was far too hot. We had to sleep with the windows open at night, letting in light and noise - 2 very poor night's sleep. Accor make a lot of their environmental credentials, but then heat rooms with windows open! I complained but was told that no other guests had complained and the whole hotel was like this. The aircon is switched off when it gets cold enough outside I was told. The fact that it is 30 degrees in the whole hotel did not seem to register with the staff. Upon leaving it was acknowledged eventually that there was a problem with the heating. So I felt I had just been ignored when I had a valid complaint before. This is a shame, as I have so far been a fan of Accor hotels", "title": "Great hotel concept", "user": "Marion_Fr", "date": "November 7, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 120302403}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We spent 3 nights with our kid (4) in that hotel. We got a good packaged price including breakfast booked through their website.", "title": "Wonderful, except for location", "user": "pojaya", "date": "November 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 2.0}, "id": 120220589}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Comfortable, well equiped room, although the bathroom and loo were a bit like my parents 1974 Sprite caravan!! Still, they were spotlessly clean and perfunctuary.", "title": "Very nice, thanks.", "user": "FifthEarl", "date": "January 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122448314}, {"rating": 4.0, "title": "Positive", "text": "Staff were very helpful and polite, and spoke very good English. Secure parking was welcomed. Good location, only a 2min walk from the main train station, about 5min from the park, and less than 10min from the main shopping / pedestrian area.", "user": "A TripAdvisor user", "date": "January 2, 2012", "id": 122433190}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We enjoyed just one night stay at this hotel after spending one day in Epernay and Reims. Location is, as many others already explained, a little bit far from the city center even taking short cut through SNCF underground passage. But feel not too far because bustle of Christmas markets around Pl. Drouet d'Erlon makes us forget how much time we spent for a walk. The room was clean and large of course. Bath has tub and shower seperately, bedroom has shades to absorb the strong lighting from the train station. Sure stay again.", "title": "Average", "helpfulness": 1, "user": "186273jamesh", "date": "January 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 122355375}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "This hotel is good for anything as it also has family suites. It features a gym, computer/tv and a snack bar.", "title": "Wow what a find", "user": "grasal001", "date": "December 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 121611059}], "location": {"country": "France", "region": "Champagne-Ardenne", "continent": "Europe"}, "stars": 4, "variance": {"poor": 9, "average": 78, "very good": 399, "terrible": 6, "excellent": 234}, "aka": "Suite Novotel Reims Centre Hotel", "slim_ranking": 0.051724137931, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.0}}