{"user_rating": 5.0, "review_count": 466, "name": "Sultan Cave Suites", "reviews": [{"rating": 5.0, "title": "Magical experience in Cappadocia", "text": "When I entered our Sultan Cave Suite, I couldn't wait to soak up in the suite. I loved the ambience and the toilet was very spacious. Only drawback was the location which was further up the slope. I guess it's a trade-off as it means that we have an excellent view of Cappadocia. The journey down the slope in the evenings (during winter) and night might be a little dark so you might want to arm yourself with a torchlight or a torch app on your BlackBerry/iPhone/etc.", "user": "Piao L", "date": "November 2, 2012", "id": 144307412}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "My traveling companion was the one who wanted to visit Cappadocia (pronounced as \"Ka-pa-dok-ya) after Istanbul. I just simply tagged along. But I was the one who made all the travel and sightseeing arrangements in Cappadocia. The travel agent in Cappadocia made the hotel reservation for us. And I clearly remembered asking for a good hotel in Cappadocia and apparently this is one of the better ones.", "title": "Great view of Cappadocia", "user": "Mulder-Sing", "date": "November 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 144270811}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "After my lousy hotel experience in Istanbul, I was expecting the worst in Cappadocia. But when I reached there, the hotel was not that bad!", "title": "Loved it!", "user": "MaureenRBM", "date": "October 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 144173112}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Check in was very informal. Handed over passports to staff, decided who is sleeping with who and we were shown to our rooms. I had one of the better rooms so it was on the top most terrace and nearest to the hotel desk and entrance of the hotel and carpark.", "title": "Magic in Goreme", "user": "Andrea A", "date": "October 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 143961931}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "And they got free wifi! Great!", "title": "Spectacular setting, great ambiance and helpful staff", "user": "Dcw66", "date": "October 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143927168}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "This place is so cool!! Mahmet has taken great care with the style decor and detail of the hotel. It is exactly what I wanted - something old, something new. something hip. The service is amazing and Mustafa, the manager, was known as Mr. Awsome - he took such great care of us I couldnt have asked for better service or accomodations. Also, do not miss the restaurant! Great ambiance and even better food. Overall, I love this place!!", "title": "Great place, Great staff", "helpfulness": 2, "user": "Don H", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128439246}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Our room was 323 with a fireplace. We had a romantic 3 night stay here, and loved everything. The staff takes care of all the details for you, the only thing you need to do is to enjoy.", "title": "Fantastic", "user": "lovesouth42", "date": "April 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128257163}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "I picked this hotel based on the review and was not disappointed. During the reservation period, many personal emails from the hotel kindly answered to my many questions with patience. You can choose your own room according to size and type. The location of the hotel is one of the best (I think the location is even better than the Kelebek next door due to the open vista view at the reception/restaurant area of Sultan Cave). Despite all these facts, we could walk to the town center in less than 10 minutes down hill with interesting view.", "title": "A cave with homy hospitality and luxurious comfort", "helpfulness": 2, "user": "PRATANA", "date": "April 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128095513}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "The service was impeccable. There were always staff at the front desk at all hours to serve your every need in a friendly and helpful way. The activities, maps, suggested routes, where to eat can be acquired from the reception easily. The wifi worked well in many areas (except for some corners deep into the cave).", "title": "Wonderful view, great decoration, helpful staff", "helpfulness": 1, "user": "Oliviaans", "date": "April 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127723713}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "The room was quiet, clean and tastefully decorated. The size is very good, with a living section and a bedding section,huge closets and many storage space, tea/coffee corner. The view from the room was good (we stayed in room 331), could see Ushisar Rock Castle. The bathroom was small but enough and with plentiful amenity.", "title": "Awesome, amazing and warm", "user": "Shahsona", "date": "April 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127596269}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "My friend and I just stayed here for 3 nights and loved it. The rooms are very spacious, warm clean and comfortable. Our 500 year-old cave room #307 had a double bed and and alcove with 2 twins. Perfect for two ladies traveling. The hotel is up the hill from the main streets of Goreme, but not a difficult walk. It affords fantastic views of the town and the balloons. Also, they will take you down in the van if you don't want to walk.. We enjoyed all the staff -very service oriented. We especially enjoyed talking with Mustapha. Great guy. I would definitely return to this hotel.", "title": "Beautiful cave hotel", "user": "M4", "date": "December 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 146633679}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The hotel is affiliated with the Kelebek hotel next door, so we enjoyed their restaurant and hamam. The hamam was fantastic and very reasonable.", "title": "Enjoyed our stay at this beautiful cave hotel", "user": "LesleyJacobs", "date": "November 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146373429}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Thanks to recommendations from the hotel staff, we booked a tour \"undiscovered Cappadoccia\" from Heritage Travel. The hotel staff booked it for us and the group size was small ---only 11 passengers. We visited the Soganli Valley and underground city. This tour turned out to be one of the highlights for us. Our guide, Ferai was outstanding.", "title": "Unique Hotel", "user": "mutiaw", "date": "November 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 146325743}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "We found Goreme a cute but touristy little town. We walked to the Open Air Museum, enjoyed the shopping here and the relaxed feel of the end of the season.", "title": "fairy towers and much more", "user": "FLOI", "date": "November 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 146232225}, {"rating": 5.0, "stay_parameters": "Stayed November 2012", "text": "I also recommend Sedef Restaurant in downtown. We enjoyed our meal at Sedef so much we went back the next day! Also, Enchantment jewelers next door was fair and had nice items.", "title": "Just fabulous!!", "user": "Sumalya007", "date": "November 23, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 146053748}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "I have been to Goreme 5 times now and I have stayed at 5 different cave hotels. I can honestly say that for the room that you get and for the level of service that you receive, you cant beat this hotel. I stayed in room 311 and the view is great. Fantastic shower, jacuzzi tub and comfy bed..Hot water 24/7 and a great view of the valley.", "title": "Best in Goreme", "user": "neckslappa", "date": "March 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125629517}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "There are other hotels that are higher up on the hill with better views, but overall, this hotel cannot be beat. I would highly recommend this spot to anyone looking for a great place to stay!", "title": "A delightful base to see the region", "helpfulness": 1, "user": "Clemente B", "date": "February 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124733953}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled solo", "text": "We really liked this place and stayed in the quirky little junior suite 306 which features the bed in a cave, even though we were offered a bigger suite.", "title": "top notch!", "user": "Alliebaillie", "date": "February 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124346328}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "Staying here off-season clearly has its benefits, and astonishingly kind personal service by the hotel staff is certainly one of them. The hotel owner released his day manager Selim to look after us for the morning, and we went on a small private tour with him to sights such as Uçhisar citadel, the extraordinary underground town of Kaymakli, and then Göreme Open-Air Museum. We seemed to pay next to nothing for all this, and see it as a mark of how kind and friendly people can be in this region. It later transpired that it was even the guy's birthday!", "title": "warm room, warm hospitality", "helpfulness": 1, "user": "Kota_Suzuki", "date": "February 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123946508}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "The sister hotel next door has the hammam and we visited this in the evening. We were the only people there and loved it. We were only charged for the massage itself which was very good, and had free use of the place.", "title": "Fantastic hotel, great room, amazing place!", "user": "Paula W", "date": "January 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123582574}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "We arrived late at 8:15pm in Goreme after a long bus ride from Safranbolu and they sent a car to pick us w/o the slightest hassle. (We just sought help from guys in the Tourist Information to make the call, as we didn't have a cell phone with us.) Our room (307) is much larger than we had expected and it's quiet, warm, and has everything one needs for a few nights' stay. Breakfast was good too. The cozy reception area with a view is very nice for reading (unless of course if there are lots of other energetic guests) and they even have a PC set up for guest's use. No worries therefore if you don't have a notebook/iPad. The first night we ate at the adjacent restaurant and was very good. The next we went downtown to Orient and that was exceptional too. Walk to and back is easy. Allow 15 minutes in leisure. Not much climbing of steps or steep slope in fact.", "title": "Recommend whole-heartedly", "user": "JJB", "date": "May 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 129632193}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Sprawling hotel with cave rooms. Nice restaurant and free and very full breakfast. The staff is very helpful. Can't say it is quiet, though. You can hear everything in the rooms next to you and construction is going on in a nearby hotel. Try the Hamam; a great experience.", "title": "Interesting and helpful staff--but not quiet", "helpfulness": 1, "user": "Devon11", "date": "May 8, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 2.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 129575253}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Traveled with my elderly aunt who needed as few steps as possible (note: Cappadocia simply does not have handicap accessability in the sense that one MUST be prepared to climb steps, navigate uneven surfaces, deal with hills, etc. due to the unique nature of the landscape). Hotel assigned her room 311 near front entrance which met her needs perfectly. Huge room with two private terraces, jet tub and separate shower in the large bathroom, tons of light. Entrancing views from all parts of the room and hotel in general, in house travel agency arranged several day-long tours, great restaurant on premises, excellent breakfast, spa/turkish bath located in sister hotel near by, personable staff who went out of their way to assist. Wished we could have stayed a week instead of only 3 nights. Couldn't recommend this hotel more highly. Located in Goreme, a picturesque town which is inside of a national park, on a hillside overlooking the town; 5-10 minutes walk up hill from the center of town. Hotel can provide a courtesy ride into town if asked, can always get a quick cab ride back.", "title": "perfect stay", "user": "aavery", "date": "April 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129099843}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Can't wait to return which I surely will some day.", "title": "Oh yes, we will return", "user": "allegrafelter", "date": "April 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129010669}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The location - sublime. The rooms - cozy. The food - both breakfast and restaurant - delish. The staff- professional and hospitable. Yet, what is truly exceptional - and why I will be back- is the convivial atmosphere of the hotel. I especially credit both Mustafa and Mehmet for making their guests- even hard-to-please new yorkers- feel right at home.", "title": "Very nice place, effeciently managed.", "helpfulness": 1, "user": "Kevin S", "date": "April 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128504989}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "The owner and staff were extremely welcoming and hospitable. As soon as I arrived, I was suggested an itinerary for the day and the next day which was extremely helpful for me in order to explore the area as much as I could in short amount of time. Goreme main market (downtown) is a very small market and is 5/10 minutes downhill walk from the hotel. Open Air Museum is about half an hour walk. Nevisher airport is about 45 minutes drive. Goreme is a very small area with extremely limited public transport options so I would recommend arranging pick and drop with the hotel. Its best to book a tour or arrange a car in order to explore rest of the area as all the tourist places are pretty scattered around.", "title": "Excellent", "user": "MWazir", "date": "November 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145124196}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The hotel booked one day tour and balloon rides (with company called Butterfly Balloons) for me. Both the companies (the tour company, and the balloon rides company) were extremely nice. The balloon ride pilot, Mustafa, took us above the clouds and we were the only ones who went above the clouds so it was definitely worth it. I got 10% discount on balloons rides as they have some sort of arrangments with the hotel. The tour guide, named Jeehad, was also a v friendly, knowlwdgable and funny guy.", "title": "Room for improvement", "user": "fedfan", "date": "November 6, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144806271}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "The hotel offers discount on cash payments but I ran out of cash at the end so I paid the rest using credit card and still got the discount for cash payment which was a very nice gesture from the owner.", "title": "Fantastic experience", "user": "bewareofkate", "date": "November 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144745237}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "For other Muslims brothers, there is a mosque in 5 minutes walking distance to offer prayers.", "title": "Cappadocia Cave dwelling", "user": "iantre", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144685495}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "There were slight negatives: 1) Though, it was not problem for me, the stairs to the room(s) were a bit hard to carry huge luggage and/or for people with mobility issues. 2) The uphill walk from Goreme downtown is a bit tough. 3)Breakfast menu could have been improved.", "title": "Room 334", "user": "AlexandreBorges", "date": "November 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144508655}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We loved absolutely everything about Sultan Caves Suites. The room was fantastic, with a great view. We had a suite, so there was a seperate area with couches to sit and enjoy the view, or watch tv or just have a wee nap. The windows opened wide for lots of fresh air. The washroom was really nice with a wall rad that made the room cozy and warm, and made drying your sink washed clothes an ease.", "title": "Absolutely FANTASTIC", "helpfulness": 2, "user": "dody_9", "date": "November 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145655973}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "The wifi worked very well in our room even though we were almost the furthest room from reception. There is a computer in reception which you are welcome to use as well.", "title": "Excellent Value", "user": "KaiWap", "date": "November 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 145607115}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We booked the balloon tour from the hotel, which was great, (with Butterfly). Also booked the whirling Dervish, - that was a real treat. Not theatrics, but the real deal! and also horse back riding, That was a trip, as you went on really thin paths through the forboading landscapes, (not for the faint of heart).", "title": "Nice hotel but service could be better", "user": "deftcap", "date": "November 17, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 145596047}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The breakfast was fantastic with lots of variety and eggs made to order if you wished. There were alot of choices on where to sit, outside or inside. The onsite restaurant served delicious meals in very quaint rooms on different levels. You always felt very intimate in any of the dining rooms, (4 to choose from), that you sat in. I believe there were only 4 or 5 tables in each area. There was a fireplace with easy chairs to sit in and lounge after your meal, sip on a coffee or have desert.", "title": "Excellent hotel, excellent people", "user": "stellajin", "date": "November 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145491856}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The location was very close to the centre of the small village of Goreme, which had nice shopping, cafes, restaurants. You could also go for a Turkish bath at the sister hotel next door. That was lovely as well.", "title": "Beautiful settings, lukewarm service", "user": "bluebird2007", "date": "November 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 145141557}, {"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "This is one beautiful cave hotel with breath-taking view at very good location. The restaurant is simply beautiful with excellent service and very good food. Almost every room has a table outside where u can just sit, relax to enjoy the stunning scenery in a beautiful romantic atmosphere. The only downside is that the room is pretty small.", "title": "One beautiful cave hotel with breath-taking view at very good location", "user": "Chiccathy", "date": "April 8, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 127467079}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "At least once in a lifetime, you need to stay in a cave hotel. The Sultan Cave Suites would be the perfect choice, as the Cappadocia location provides extraordinary views -- and no cave man ever lived in such luxury! The rooms are stunning, large, comfortable, immaculate. The breakfast is excellent - made to order eggs in addition to the typical spread of cheeses, yogurt, veggies, breads.....The on-site restaurant is elegant and delicious, offering Turkish traditional dishes with a contemporary flair, and hotel guests have a 20% discount on an already reasonably priced menu. The manager -- and all the staff -- were so helpful and friendly, mapping out suggested itineraries for our stay, suggesting other fine places to eat. They arranged our Butterfly Hot Air Balloon ride, and I would strongly suggest using that company. The pilots are very experienced and professional, they don't cram passengers in the baskets, and we flew longer than most of the other balloons in the air. They also change daily the location of take-off and landing, depending on weather conditions, which other companies do not do, making us feel even safer. There can be no better place to stay in the Cappadocia area. We will definitely return!", "title": "Once in a lifetime....", "helpfulness": 1, "user": "SWL", "date": "April 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127254171}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "My wife and I stayed in Sultan's Cave Suites (room 309) for 4 nights in March 2012.", "title": "Almost perfect", "helpfulness": 2, "user": "rabbit83", "date": "March 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 126894457}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Pros: The room and ensuite were spacious and tastefully decorated. Very clean. Management was helpful and friendly. The views from our room were wonderful.", "title": "Cozy warm rooms, great view, excellent service", "user": "Kate B", "date": "March 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126846164}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Cons:", "title": "Beautiful, spacious rooms with an unbelievable view", "helpfulness": 1, "user": "dannihirsch", "date": "March 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126393105}], "location": {"country": "Turkey", "region": "Cappadocia", "continent": "Europe", "city": "Goreme"}, "variance": {"poor": 3, "average": 9, "very good": 64, "terrible": 2, "excellent": 388}, "aka": "Sultan Cave Hotel Goreme", "slim_ranking": 0.0952380952381, "detail_rating": {"service": 5.0, "cleanliness": 4.5, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Sultan Cave Suites is a special, recently renovated small hotel located in the heart of Cappadocia, Goreme. There are 30 total units in two blocks as junior suites, suites & king suites. Most of the rooms are carved into cave."}