{"user_rating": 3.5, "review_count": 820, "name": "Summer Bay Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Summer Bay Resort was the perfect vacation spot if you wanted to renew, recharge and just relax! We have travelled to Orlando probably a dozen times over the years (our honeymoon was spent there in fact) but this was the best venue yet! The staff cleaned constantly and were very helpful. They had full time recreation people around the poolside, cabana bars and activities for all ages/ all the time. The fitness area is small but we packed in and did our thing anyway! Everyone was friendly and yes, there was timeshare presentations trying to engage you but hey, that's Orlando. No pressure was felt on our part to go and the free family portrait was a wonderful perk. We ended up buying some extra copies but it was worth it. As far as internet access, I am on vacation...buy a cheap phone card and CALL home! That is probably why we had such a relaxing time, sitting in front of a computer was out of the equation. It was all about fun and relaxation. I give this facility two thumbs up!!!", "title": "We had so much fun at this resort, we never wanted to leave!", "helpfulness": 3, "user": "tbaypaintball", "date": "October 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119323377}, {"rating": 4.0, "stay_parameters": "Stayed October 2011", "text": "We stayed a week with our family and loved the facility. The pools, yes pools, there are many, and they are divine. Enjoyed the tennis courts and employees were very nice. The only real complaint we had was no wi-fi in the rooms and when we went to use the computer in the lobby they charged 20 cents a minute and 75 cents to print a page. Which for such a nice facility it ridiculous. But for a family with small children it would be awesome because the pools and splash park are awesome.", "title": "The resort is beautiful and the grounds stunning!", "user": "9527Angie", "date": "October 8, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 119087690}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Stayed here in september for one week at beginning, and last week of our 3 week stay in Orlando.First week was in two bed unit booked throug rci, second time was in 1 bed unit booked through summer bay.", "title": "Lovely resort, watch out for the time share sell.", "helpfulness": 8, "user": "mogre", "date": "October 8, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119077734}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Afetr check in be prepared to be approached to make a time share appointment during your stay.Be firm if you dont want this, its not compulsory.They offer money or tickets to attractions for your attendance ,so its your decision.They say a 1-2 hour presentation but it will last the best part of half a day", "title": "what a joy !", "helpfulness": 2, "user": "johhil", "date": "October 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119075323}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The units were cean and had all you would need for self catering, with stove,microwave etc.Also had a washer /dryer which is very handy.The 1 bed unit was a bit small but we managed with 3 of us for a week.", "title": "It's a good place to stay, but not make a reservation by decolar.com", "user": "MauroRibero", "date": "October 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 118975978}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We stayed here Oct 23-Oct.29..Went through RCI..The grounds are beautiful,and,well maintained..We stayed in Bldg 504..it was right across the parking lot from a beautiful pool,which,we enjoyed every day..! We did not go to Disney,but,it was only 6 miles away...The accomodations are in the process of being updated,which they need. The staff is very good..This really is a very nice place to stay....They offer 3 types of accomodations,so,ask them before you book...", "title": "Super Summer Bay", "helpfulness": 1, "user": "charliejoe", "date": "November 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120202636}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We are RCI members so used a points exchange to get a week at this resort. We were delayed in our arrival by one day because Hurricane Irene and our flight from New York being cancelled. The resort staff where really nice about the whole thing and went out of ther way to make us feel welcome. We had a lovely two bedroom apartment and it was spacious, clean and had all the amenties we could want. The beds are huge and very comfy. The main bedroom was huge and had plenty of space for the toddler bed for our two year old. The water play area was loved by our son and he wanted to spend all his time there. The pools were lovely and the whole resort well maintained. Its close enough to the Magic Kingdom and Epcot that we could come home for a nap and rest half way through the day each day.", "title": "Lovely place to stay", "user": "katinafrica", "date": "October 31, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 119921059}, {"rating": 3.0, "stay_parameters": "Stayed October 2011", "text": "The only negatives I found where the man trying to badger me into going to a resort breakfast so he could try and sell us timeshare. I am South African why would I want a Time Share there when I already own time share. He was very pushy and just would not stop. This after a 19 hour nightmare drive from NYC was not apprecited. I wanted a shower and a rest. I told him that I already had Disney tickets(which we did buying online in advance is the best way by far to buy) and that if he really wanted to talk he could call me. He never did so I think he finally got the message.", "title": "Will never stay here again!", "helpfulness": 7, "user": "Mariposa2591", "date": "October 24, 2011", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 3.0}, "id": 119654598}, {"rating": 1.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "In all other international RCI resorts I have stayed in a daily service is included. The lack of service puts a bad mark on RCI.", "title": "scam artists", "helpfulness": 3, "user": "sean b", "date": "October 20, 2011", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 119535555}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "This is actually day one for me here and so far not so good. #1 my husband was in no way greeted by the front desk. The lady at the club house was already heated and when we checked in she greeted him by saying \" credit card...\" #2 I'm 7 mths pregnant and I arrive with my husband and young son to a 1 bedroom condo that is unclean and cold. We run to walmart to pick up things, come back, clean up including mop these nasty floors with hair covered all over, and we realize that this place is anything but kid friendly. We realize this because there are no security locks on the door. The one lock that is on the door is low enough for my two yr old to turn and open the door. I call the front desk and rudely these jokers say they can't help ne with this, nor can the lazy engineer, which I hear in the background spare tape so I could tape the lock to avoid my son from turning. #3 it's 5 o clock in the morning and after waking several times i now feel like I've slept on the floor. The bed is so hard and so flat, we've tried putting the comforter under the fitted sheet along with the extra sheets in the closet but still hard. I call the desk and lady says \" an engineer will bring a pad in the morning...\" this is going to b a long week. They've lost me as a customers for sure.", "title": "Great spot:)", "helpfulness": 1, "user": "canadiantraveler77", "date": "October 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119498136}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We stayed at this resort through an exchange through RCI for two weeks. The unit was a 2 bedroom, spacious, adequately stocked with dishes, glasses, linens, etc. The furnishings could use some updating but overalll the unit was clean. We did have a problem 1 day with cockroaches in the kitchen area but maintenance came out right away and sprayed and we did not have any more problems. There are a lot of families with children so it can get a bit noisey and at night some of the guests were very noisy after midnight but we did call security and they came right out and dealt with them. The staff is very responsive and try very hard to accommodate all your requests. It is very convenient to Publix and Walmart for groceries. There are a lot of very good golf courses in the area as well. The resort has a free shuttle that runs 3 times a day to and from Disney World. They should segregate areas for families and adults so that you can decide if you want to relax in a quiet atmosphere and not have screaming children around. Restaurants are about 3 miles or more away. We did find a very good Asian restaurant, Sakura. There are really no activities for adults at this resort, it is primarily geared towards children. The unit we stayed in was not close to any of the clubhouse facilities, it was about a 10 minute walk.", "title": "A Nice Resort But More For Families Than Couples", "helpfulness": 1, "user": "TwoputtandMore", "date": "October 1, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 118821411}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Stayed here in August with my boyfriend. The resort is lovely, very peaceful and we had a room with a balcony that overlooked the lake. The pool is open 24 hours and there is a great atmosphere around the Big Kahuna pool area. Only thing I would say is it is a bit further out so I would not recommend chosing this resort if you don't have your own vehicle.", "title": "Fantastic, relaxing resort", "helpfulness": 1, "user": "Kirsty G", "date": "September 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 118562906}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Will definitely be back!", "title": "oKy but dont think i will be going back", "helpfulness": 1, "user": "lati22058", "date": "September 25, 2011", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 3.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 118558948}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "i stayed here the week of hurricane irene it was ok but i dont think i will be going back. the grounds are ok the pools and arcade room my son loved. when we got to our room we were shocked. the room was very small remind you it was suppose to be a 1 bedroom which looked like a studio. lets not forget the awful smell of syrup or something else which we called and told them there was a smell in the room. they were suppose to send someone out to see what it was no one ever came. the grills were all dirty that were located in front of our room when we called to have it cleaned up they told us they will be there they came 2 hours later.the curtains the bathtub blankets all out dated they look terrible lets not forget the pull out bed it was awful the mattress was so old and flat i could not put my son to sleep on there.the people who tried to sell us time share were nice until we told them no hahah we are not intrested judging by the room i stayed in why the hell would i want to by a time share from you guys.I enjoyed my stay there by not being in my room. I had family who were over at bonnet creek omg that place is beautiful but itwell worth it thats were i will be staying next.", "title": "I would STAY here AGAIN and that says a lot!", "helpfulness": 2, "user": "jannster", "date": "September 14, 2011", "detail_rating": {"value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 118116777}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "My family and I stayed here Sept 3-10. We had a 2 bedroom condo unit in Building 404. I, like you, read other people's reviews and do a ton of research prior to making reservations anywhere. I am very skeptical about pictures being doctored and places that don't measure up to advertisements. I am happy to say that the Summer Bay Resort measured up to my expectations with only ONE irritant.", "title": "Summer vacation and Disney trip w/kids", "helpfulness": 3, "user": "Pat M", "date": "September 14, 2011", "detail_rating": {"value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 118112423}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "This is the first time my family of 4 stayed at Summer Bay and will not be the last. We spent 5 days using RCI points. We loved every minute of it. We had a 2 bedroom villa. The master bedroom had a jacuzzi tub. Everything very clean and well organized. There was a complementary shuttle which took you to the supermarket or to other sections of the resort. The pool was opened 24 hours. There was a bar adjacent to the pool which closed late also. The kids loved the activities, especially the movie night with free popcorn. The lake was also lots of fun. We fished from the pier. The place rented fishing poles and even sold bait.", "title": "One of the best resorts I have ever been to!", "helpfulness": 1, "user": "Tito76", "date": "September 12, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118025006}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The only downfall of the resort is that is a bit apart from the parks. It takes about 10 minutes to Disney and about 13 to Sea World so you need a car if you want to go to the parks. My recommendation is to have some time to use the facilities as there is lots to do and you can have a relaxing time just being at the resort.", "title": "It's nice but nothing special", "helpfulness": 2, "user": "ParksB", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "service": 3.0}, "id": 118020830}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Summer Bay is a nice clean resort in Kissimmee. There's nothing wrong with it, but there's nothing special that really makes it stand out either. They do have some amenities, such as four pools, a small lake, mini golf and bars. However, to use the lake or mini golf, you have to pay an additional charge and the pools are all quite small. Would I recommend it? If you get a good deal, sure. If not, I would think twice. Like I said, it's a nice clean resort, but we probably won't stay there again.", "title": "Nice place close to Disney", "user": "Pcolagrandma", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117999617}, {"rating": 1.0, "title": "Caution", "text": "We are actually owners and have been since 2002 at Summer Bay and really enjoy going there. They are under new management so that has helped a lot. We have taken family several times and they have enjoyed it too. There were issues but were quickly resolved so no complaints there. It's only about 15 minutes from Downtown Disney and the Disney Parks. They do have transportation to the parks but since we only live 7 hours from the resort we drive and use our car to get around. There are places to eat close by and several years ago a Walmart was built and is only a mile or two fromt the resort so if you need anything it's easy to get.", "user": "David K", "date": "September 9, 2011", "id": 117873639}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I booked a promotional package with Summer Bay Resort with 3 nights in Las Vegas and 2 nights in Orlando. There was a miscommunication and there was no reservation on the day of arrival in Las Vegas. They could not book a room for me because the LV property was sold and no longer part of Summer Bay. They did not have an alternate property arranged and said \"they are working on a contract with another property\". When I requested refund, they denied even though they could no longer honor the same terms by saying the promise was for \"an accommodation, not necessarily at Summer Bay Resort\". Even when I called within 2 weeks of arrival to book the sales tour, they never mentioned that the LV property was sold and no longer available for booking. Basically, I am out $300.", "title": "Average Accommodations with Lots of Kid Stuff", "helpfulness": 5, "user": "RBinVABeach", "date": "September 7, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 117789216}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 88, "average": 112, "very good": 243, "terrible": 150, "excellent": 227}, "aka": "Summer Bay Hotel", "slim_ranking": 0.125, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 4.0, "rooms": 3.5, "location": 4.0}, "description": "Whether you seek relaxation, exploration, or inspiration, Summer Bay Orlando Resort has something for the whole family. Experience a luxury family destination that delivers the thrill of Orlando’s world-renown attractions with the comforts of a leisure getaway. Enjoy all the highlights of our 400-acre lavishly landscaped resort and 64-acre private lake, located a mere 10 minutes from Walt Disney World Resort. Summer Bay Orlando Resort is the perfect Florida getaway for family, fun, and freedom.Luxury accommodations: Why settle for a cramped room when you can settle into a spacious sanctuary? From roomy hotel accommodations to two or three bedroom fully furnished condominiums, we’ve got you covered with home-style comfort. Enjoy a homemade dinner with the family. Step out on your balcony to watch a glorious Florida sunset. Or take the night off and watch a movie on your flat screen TV. Stress-free park hopping: hop on our complimentary shuttle to Epcot®, Magic Kingdom® Park or Universal Studios Florida®.Fun in the sun: Whether your goal is a relaxing escape or a spectacular adventure, Summer Bay Orlando Resort can fulfill your desire with a host of activities, amenities, and dining options."}