{"user_rating": 4.5, "review_count": 251, "name": "Sun Mountain Lodge", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "What a beautiful setting to come for relaxation and unwinding from the world. The drive up is worth it, in my opinion. For those needing TV, I saw a couple of flat screens in the bar. I personally enjoyed turning off my cell and not having a remote in my hand - but I did use the wi-fi (which worked well!)", "title": "Finally able to check it out and glad I did!", "user": "mcbill58", "date": "May 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161705677}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Views are incredible- same can be said for service, the room, and breakfast which was included.", "title": "not what it once was!", "helpfulness": 4, "user": "pammypoo49", "date": "May 17, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 161024583}, {"rating": 4.0, "title": "A long time favorite but a little tired...", "text": "I am not able to stay long this time, but I would LOVE to come back with my partner and a group of friends to soak in the serenity and enjoy the area. Lodge room was perfect; I would love to check out the cabins on a lake a mile or so below.", "helpfulness": 1, "user": "Malice6", "date": "May 16, 2013", "id": 160851562}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "\"God willing and the creek don't rise\", I will be back!", "title": "Go for the Views!", "helpfulness": 1, "user": "SuzanneJane", "date": "May 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160700646}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "just returned from 4 days at sun mountain lodge. things need to be perked up....especially some of the staff.....as they look tired and edgy. the lodge is still lovely but the poor bed and lack of a TV for the eve news wore a little thin. the food was below average for a hefty price. there is alot to do and see around winthrop and its a nice get-away but I hope they take a close look at some of the comfort issues.", "title": "Nice Resort, Unique City", "helpfulness": 3, "user": "Tellitlikeitis411", "date": "May 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 160415033}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Sun Mountain Lodge is a year-round resort, however it is a particularly wonderful winter destination thanks to the ski trails, snow shoe trails and other winter fun (e.g. sleigh rides) The Sun Mountain spa has a great selection of services and a calming ambiance. The food in The Dining Room is expensive so make dinner the main event of an evening, or go to the Restaurant for breakfast when the valley view can be enjoyed.", "title": "Winter wonderland", "helpfulness": 1, "user": "CathySeattle", "date": "March 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 154598264}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "I've stay at Sun Mountain lodge for many years and it is consistently excellent. comfortable accomodations, attentative and genuine staff, and a terrific location. I think it's a great value except for the food. Bar and resturant food is average to good, not outstanding as one would expect from a hotel like this. Still worth a visit", "title": "sun mountain lodge is consistently terrific", "helpfulness": 3, "user": "Mary Ellen S", "date": "March 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153570540}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Stayed there for the second time with my family. Staff was very friendly and helpful. We forgot a few items when we left and the hotel mailed them to us free of charge. Clearly superb customer service. Many types of outdoor activities are just outside the front door - cross-country skiing and showshoeing in the winter and hiking in the summer. We had breakfast in the dining room each day and occasional dinners at the bar. No complains about food. Coffee was excellent as they use local Blue Star Coffee. Definitely planning to stay there again and would recommend this property to anyone, especially families.", "title": "Great place to stay in awesome location", "helpfulness": 1, "user": "Rc2008Canada", "date": "February 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 153340703}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Staff was welcoming, helpful, more than pleasant, professional. It is a pricey place to stay but the views were stunning and the lodge rooms lovely. Great for a special occasions. I would go back and recommend.", "title": "Great special occasion place.", "helpfulness": 1, "user": "william b", "date": "February 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 153119511}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "A few minor tweeks and it would be perfect:", "title": "Perfect Birthday Celebration!", "user": "Marguerita J", "date": "February 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152814408}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We have stayed at Sun Mountain Lodge many times over the years and have never been disappointed. The setting is absolutely beautiful and the rooms and grounds are the same. The deer visit every morning and evening and you can watch them from your window or deck. The setting sun against the backdrop of snow covered mountains caps off what is usually a perfect day.", "title": "Beautiful Setting; Great Service", "helpfulness": 2, "user": "Suzymcm", "date": "May 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 160214030}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The rooms are impeccably clean and well situated. With no TV to distract you it is possible to reconnect with yourself, you spouse and nature. The quiet can feed your soul.", "title": "Relaxing Getaway, Wonderful Cuisine, Terrifying Massage Experience", "helpfulness": 2, "user": "Mitchell L", "date": "May 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159822601}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Hiking trails abound right outside your door ranging from easy to difficult. You can also go horseback riding, mountain biking or just relax by the pool soaking up the sun. We stayed in early May and the pool wasn't open (hot tubs were), but they had the loungers set up ready to use.", "title": "Beautiful Setting", "helpfulness": 1, "user": "KayakQueen1", "date": "May 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159644194}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "The front desk was very accommodating, even getting us in before regular check-in time. Don't expect that every time though...if they are full the night before, it doesn't usually happen.", "title": "Lodge is starting to lose touch...", "helpfulness": 4, "user": "K S", "date": "April 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 159090267}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "The food is wonderful, but it is expensive, so plan accordingly.", "title": "Exclusive", "helpfulness": 4, "user": "Joyce K", "date": "March 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155861847}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "My family and I very much enjoyed the too-brief stay we had at Sun Mountain Lodge in mid-June 2013. The lodge is quite remote, but the roads were well maintained and easy to drive. We found the two-bedroom Mt. Robinson Suite we needed to accommodate our party to be spacious, clean, well-appointed and -maintained, and quite comfortable (except for the sleeper sofa, which my son found uncomfortable; suggestion: use a memory foam mattress, which at The Maxwell Hotel in Seattle he declared to be the most comfortable sleeper sofa we had ever consigned him to). The views from the room and other sites about the lodge were terrific. The amenities in the lodge were very nice, and there's no shortage of nature-related activities. Did not have a chance to use the spa or the stable, but pricing seemed reasonable. No TVs in the rooms (though one of the commons rooms in the lodge had one), but WiFi service was quite good. Unsurprisingly, cellphone connectivity was borderline. At breakfast the first morning, the food (at prices you'd expect for an upscale hotel in a remote location) was decent but otherwise unmemorable, and service was pleasant but slow (not that we were in a rush); all in all, we were not impressed enough to eat dinner there (despite the four-diamond AAA rating) and instead had decent dinners one night at the Twisp River Pub in Twisp about 15 miles away and the next night at The Breadline Café in Omak, about an hour away. (The drives were beautiful, but of course there's no drive in the Cascades that's not beautiful.) The lodge very kindly accommodated our need for an early departure the following morning and had packed continental breakfasts waiting for us at the front desk. We found all of the staff to be very pleasant and helpful. At the substantially discounted price I was able to negotiate for the suite and breakfast (after finding erroneously low prices on their website), we felt the value to be reasonable, but I doubt we would have stayed there at the (correct) posted price. The night clerk told me the lodge has been owned by a German family for about 20-25 years. It was evident to me that their attention to excellence at this property is such that I would certainly consider staying at their properties in Germany and the Caribbean.", "title": "Outstanding mountain resort", "helpfulness": 1, "user": "afrinl", "date": "June 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 164851506}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Sun mountain lodge very nice the scenery was beautiful . Check in was ok person at the desk was just so so I know check in is at 4pm our room was not ready we arrived early about 1pm she made us wait for two hours before she would give our room to us. The room was fine very dusty also bathroom, no chairs to sit on just day beds sheets and pillows not high quality considering what they charge. Windows were quite dirty too , we ate in the bar ,food was just ok hamburger over cooked no seasoning. Had dinner in the dining room no seasoning and just ok considering what we spent, breakfast was fine. Also they have two prices for the rates if not busy charged the lower rate if busy they charge the higher which I do not understand. My husband would like to go back I am not sure. They need to change things for people to want to come back", "title": "nice but a little snobby", "user": "robert t", "date": "June 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 163817305}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We thoroughly enjoyed this lovely place. Our suite in Robinson literally took our breath away. It was beautifully decorated and completely peaceful and luxurious. We had great meals, fantastic views of the Methow Valley, and hike after hike through the wildflowers. Exactly what we were looking for!", "title": "Loved It!!", "user": "AllexPortland_OR", "date": "June 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163720643}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We have been going to Sun Mountain Lodge for 25 years and find it a wonderful place. When we visited in May 2013 we hiked the lovely hills, and enjoyed a local rodeo, among other things. Everything is perfectly kept up and we feel it is the perfect place for a retreat to the beautiful hills of Winthrop. Since dinner in the dining room is pricey and limited in choices, we usually end up in the bar which has an extensive menu. Children are welcome and their children's menu is great.", "title": "Sun Mountain Lodge", "helpfulness": 2, "user": "ckeWashingtonState", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162123401}, {"rating": 4.0, "title": "Sun Mountain resort for scenery and activities, but not so much for food", "text": "Sun Mountain has a wonderful location and fine rooms, with stunning views of the Cascade Mountains to the west of the lodge and other buildings. It also has a broad choice of activities and hiking in the nearby hills and mountains. I have spent several days there on two occasions over the last month (May 2013). My only reservation concerns the dining room, which served us a mediocre salmon (Atlantic farmed salmon going under the guise of \"Tasmanian\" salmon) meal. On the other hand, breakfasts were included in the room charge, and were excellent. The bar menu, plus the stunning vista from the bar, was good. It's a great place for a getaway, and you get away from TV (at last!). The staff is friendly and helpful.", "user": "Keith C", "date": "May 27, 2013", "id": 162035820}], "location": {"country": "United States", "city": "Winthrop"}, "variance": {"poor": 16, "average": 22, "very good": 56, "terrible": 10, "excellent": 147}, "aka": "Sun Mountain Hotel Winthrop", "slim_ranking": 0.2}