{"user_rating": 4.5, "review_count": 130, "name": "Sunburst Motels I & II", "reviews": [{"rating": 2.0, "title": "Not sure why the high ranking", "text": "We checked this hotel out the week after Father's day since it received relatively high ratings on trip advisor for the area. We asked the rate when we walked in and were quoted $120, then he came down to $110/night. We asked to see a room. While it was pretty typically furnished for NJ \"shore\" type motel, the terrible smoke odor hit all of us (3 families travelling together). They said all their rooms were smoking so we declined and moved on. Ended up getting a $60 rate less than a block away for essentially the same type room without an odor. Usually I can count on solid choices in the top few trip advisor ranked hotels for an area but not the case here.", "user": "ttoo", "date": "June 28, 2011", "id": 114829948}, {"rating": 4.0, "stay_parameters": "Stayed July 2010", "text": "Clean clean clean. Enjoyed it. Monica from penna", "title": "Clean. Nice. Inviting. Please try it.", "user": "Flick214", "date": "June 28, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 114825241}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "This hotel was great. The owners are extremely nice and very welcoming. I have been in many hotels in Seaside and they were all dirty looking jail cells. This was the first time I stayed at a hotel in Seaside, and I was very surprised. The rooms were very clean, very well kept, and the staff was very attentive to anything we asked for. I really loved this hotel. My friends and I plan on coming back again due to the phenomenal experience and treatment we had here. It is a major plus because it is so close to the boardwalk, stores, and waterpark. This hotel is definitely worth trying!", "title": "The Best Hotel Experience Ever!!", "user": "stella8792", "date": "May 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110636483}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "I traveled with my husband and children ages 17, 15, 13 & 7. We were stuck in the room for 3 days due to rain. If the motel was dirty there was no way I would have survived and would of had to cancel. To my surprise the room was very clean, I travelled with my own pots and pans because I was scared of what they would look like and didnt want to put my families food in them. I was totally wrong -- they were spotless. I like the fact that you can BBQ on the deck. The staff was very warm and freindly. If you have other people/children with you and you want privacy then the 1 bedrooms are not for you because they dont have doors. It's about two blocks from the Boardwalk. I would stay there again rain or shine.", "title": "CLEAN", "user": "pmurray51", "date": "September 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 77859399}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "First i want to thank the owners of this motel for making our stay OUTSTANDING. I have been staying here for 3 years now and this year i added a new addition to my room, my newborn son. The owners greeted us and asked if there was anything i needed to make my stay extra special. I have been coming to seaside for years since i was a baby myself and there is have been in many motels and this one is the ONLY motel I will be staying at from now on. its is spotless, smells clean, and roomy. Not once did i see a bug or have sand in my bed like many other Seaside Motels. The pool is clean and heated and private. I felt safe staying there and highly recommend everyone stays there at least once. Dont listen to what the negative comments are saying because the negative ones are owners from other motels. WE KNOW!!!! no guests would complain. As a Hotel Restaurant manager, take it from me .. This motel is like a Hotel... the staff is wonder and the best part is they speak english. your room is cleaned everyday and you never have to ask for more towels. They supply enough to last for the next two days. They are generous in serving continental breakfast every morning so that when you are getting ready for your day you can start by having a bagel and coffee.. once again.. try this motel before you judge it.. and thank you again to the owners and staff of the Sunburst Motel .. we will definitely see you next summer and every summer after that .. i look forward to my son having a great time and expierence every summer.... see you soon!!!! with love .... the Klett Family", "title": "THE BEST MOTEL IN SEASIDE HEIGHTS", "user": "nicki426", "date": "September 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77817035}, {"rating": 5.0, "stay_parameters": "Stayed July 2009", "text": "My entire family has been going to this hotel for years, before i was even born. The staff is amazing, they clean your rooms everyday, and do a wonderful job. I have nothing bad to say about this hotel. i would reccomend it to any age group becasue there is so much to do. the beach is a 5 minute walk away. the board walk has tons of games and rides for all ages. There are at least 10 arcades on the boardwalk that you can take kids to to earn points and trade them in at the end of the vacation for great prizes. I reccomend the casio arcade. The beach is amazing, raked everyday and kept clean. the only thing that sucks is no alcohol on the beach, and they do check your cooler before you go on. The food is great on the boardwalk, i love 3 brothers pizza, the slices are huge one fills me up. ok, back to the hotel. there are 2 sunbursts. We have stayed in sunburst 2 every year because of the deck. you walk out of your room onto a huge deck with tables, chairs and grills to cook on. The rooms have stoves and refridgerators. however, the pool is located at sunburst 1, but ist a 2 second walk to get there. The pool is a little small but workable, and who wants to be at the pool when you have an amazing beach steps away! Oh, and every thursday they have free pizza at the pool at noon, so go to the beach for a while, leave your stuff there to go get lunch at the pool and head back to the beach! This honestly is an amazing spot and hotel. I cant wait to go this year, and my advise is to book it in March because it will sell out fast!", "title": "Family has gone here 25+ years and will never change!", "user": "jshummyqb11", "date": "June 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67748532}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "We were not disappointed at all with our stay. The room was spacious and very clean. Tyler (the son) made us feel comfortable from the time we checked in until his parents returned from a little R & R themselves. (Good job teaching him the business) Even though the maid spoke little english, we were able to communicate and she gave us whatever we asked for. We had researched about 25 motels in the same area and I am glad that we chose the Sunburst II. We will definitely stay there again for Clownfest. Even though the ad said that they provided coffee & bagels during the summer only, they did extend this courtesy at that time. The restaurant suggestions were great. Thanks Butch! We will definitely recommend this motel to our fellow clowns for future Clownfests. Judy Raymond 101", "title": "Wonderful", "user": "Bumpkin64", "date": "September 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 43448954}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We've stopped to this motel for one night because we wanted to visit Seaside Heights (scouting for a future vacation there!) We had chosen this motel because it's located very close to the boardwalk and a nice section of the beach (north of the pier).", "title": "Honest and well located", "user": "Sugizai", "date": "August 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 37306759}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "The owners were very courteous and helped us finding a good restaurant in town. The room was extremely clean (including the carpet and bathroom) and smelled good. Clean, soft towels were folded in a pleasant way on the bathroom counter.", "title": "Horrible absolutely horrible never going back", "user": "Jaysam0278", "date": "August 4, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 2.0}, "id": 36720998}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "The shower worked very well, with a gentle jet, and the hot water was hot (unlike some other hotels we know where you get lukewarm water gurgling out of a half-clogged shower head). But at the Sunburst, the showers were absolutely perfect!!!", "title": "The search is Over", "user": "luv2vaca59", "date": "August 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36521019}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "I just returned from a weekend down in Seaside with my family. Once again, my family chose to stay at the Sunburst. This time we tried the Sunburst II because we wanted suites. We made a great choice. The rooms are extremely clean (you can smell the citrus cleaning products upon entering the room). They are big and the deck is useful. The pool is perfect, not too big or too small, and it is privately located. It's not Olympic size or pond-like, just perfect! I don't like pools that are in the front of a motel for all to see. Seaside Heights has many motels, but this one stands out. I would NEVER stay anywhere else. Thank you Joanne, Butch, and Chris for establishing and maintaining a polite, professional, and friendly atmosphere. It is obvious that there is a lot of competition among motels in Seaside, but if you are a true Trip Advisor fan, you could tell a true review from a false review or motel-bashing. Your motel truly is wonderful and family friendly. We'll never choose another place - even if you don't rate #1 on trip advisor. You have nothing to prove to people on the internet - you prove it when we enjoy our stay at your motel. Thanks again!", "title": "The True Number One Motel in Seaside Heights", "user": "Beasley931", "date": "August 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77594493}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "THANK GOD FOR THE WONDERFUL PEOPLE WHO OWN THE SUNBURST MOTEL!!!", "title": "WONDERFUL!! Very clean motel and the nicest most genuine people", "user": "mkviking", "date": "August 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77539494}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "Our mini vacation started out as a disaster. Like many people we booked our 1st hotel on line not seeing first hand what we were getting. We were disgusted and left immediately very upset and not knowing what to do in an area we knew nothing about..... Thankfully we quickly found the Sunburst. Upon entering they made me feel comfortable and assured me that they would do WHATEVER they could to help us out and make our trip an enjoyable experience. They did exactly that!! I am so grateful that I had the privalage of meeting such wonderful people; and not IF but WHEN we come back this is the ONLY place I would consider staying. Thank you...........Michelle", "title": "Clean Rooms + Great Location + Knowledgeable Owners = AWESOME TIME", "user": "NYerTravels", "date": "August 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 77486863}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "My friends and I traveled to Seaside Heights for a bachelorette party . We're around 30 years old, so cleanliness, a comfortable bed, and a quiet place to sleep were high on the priority list. This hotel was far from the stereotypical shore motel-- the rooms were super clean (like it put some of the chain hotels I've stayed in to shame), the location was awesome (a 3 minute walk from the Jersey Shore house, and one block from the beach) and most importantly-- it catered to families. The last thing we wanted was to come home from dinner and have to deal with drunk loud kids (been there, done that, thank you very much).", "title": "Looking forward to come back again!", "user": "cmarzigliano", "date": "August 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 76572126}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "The owners were really sweet and knew the area quite well. Their restaurant choices were spot on (if you go to Seaside Heights, On Top Of Spaghetti was amazing). If I come back to Seaside Heights, we will definitely stay here again.", "title": "So clean and friendly!!!", "user": "helloreinas", "date": "August 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75924591}, {"rating": 5.0, "title": "The sunburst motel is a great place to spend your vacation", "text": "There is something everyone will like. One of the things my family and I like is that you could walk to the beach/boardwalk. Also we love the clean environment around us. When you stay at the sunburtst motel you are sure to love it. Have a good summer!", "user": "Nikki1999", "date": "August 11, 2010", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 74762965}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "I've been staying at another motel in Seaside for years, but they couldn't accommodate us with an apartment, unfortunately, this year so we tried the Sunburst........so glad we stayed here! Friendly staff, CLEAN rooms, no musty-motel-like smell, which was a BIG plus! Excellent location; about a block from the boardwalk and beach, and everything is within walking distance. Anytime I had a question or needed something, the owners or their son, Tyler, were more than helpful. Air conditioning in the room was terrific; worked like central air in your house. Finding a clean motel in Seaside is almost like finding a needle in a haystack; well, we've found it!! I highly recommend the Sunburst!", "title": "BEST HOTEL IN SEASIDE!!", "user": "aprilshowers70", "date": "August 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 74480293}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "A bunch of our friends came down for the weekend at Seaside Heights and we were supposed to stay at another hotel. When we saw the other hotel it was a dump. We came upon Sunburst and they let us see the rooms first before we had taken it. These rooms were VERY clean and well kept..Their staff was great !!!!!! 2 THUMBS UP FOR THIS MOTEL!!!!!!!!!!!!!!!!!", "title": "Will only stay here from here on in !!!!", "user": "cinny781", "date": "August 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73666442}, {"rating": 5.0, "title": "Wonderful stay at the Sunburst - will not stay anywhere else now!!!", "text": "My husband and I just recently came back from staying two nights at the Sunburst One hotel (there are two properties Sunburst I & Sunburst II very close together). We went down for a little getaway without the kids. Well, I could not BELIEVE the cleanliness of the rooms and how nice the rooms were. It was like we were the only people to have stayed in the room that's how clean and new it looked. No musty odor like some of the other hotels in seaside. The owners and cleaning staff do an EXCEPTIONAL job with the cleanliness of this property!!! There were big, and seemed like brand new A/C units in the room. We had the room with a small kitchen area with a little fridge, stove, microwave and the cabinets also had pots, pans, glasses, and utensils. Full size, very nice & let me state again, CLEAN AND SPOTLESS bathroom. There is also a safe in the room, which is a nice feature to have to put your personal belongings. The pool is heated and the water was pleasantly warm. There is also coffee and bagels offered in the morning downstairs in the office (which is really nice if you want something quick to eat before heading out rather than a big full sized breakfast) The hotel is about two blocks from the boardwalk and two blocks from the waterpark as well. Everything is within walking distance which is great if you don't want to move your car. For years we used to stay at another hotel in Seaside Park and we just wanted a change and I'm glad we decided to look into something else. My husband and I are planning on going back in August with the kids and I can't wait. I would highly recommend this hotel to anyone planning on visiting the area!!!! Thank you to the other posters as well as their posts is what made me decide to stay at this hotel!!!", "user": "JLynch1023", "date": "July 19, 2010", "id": 71515767}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "I have been vacationing in Seaside Heights since I was a small child and have been to many, many motels over the decades. However, ever since my first stay at the Sunburst I, I have never stayed anywhere else. The staff has ALWAYS been friendly and helpful and met every request with a smile. The rooms are always clean and bug free. (I wish I could say the same for other motels there) The pool is small but that is not a big issue for us. I noticed that another traveler commented on the pool being dirty and I can say that the problem that I saw was people not showering off in the out door shower that is provided after spending time at the beach. The sand will accumulate at the bottom of the pool. However, I did see the staff keeping up with the cleaning of the pool every day. Some of the bonuses of the Sunburst are that they provide complimentary coffee and bagels in the morning during the months of July and August. And I believe they also offer free pizza poolside on Thursdays around lunch time. I really love this place and recommend it to my friends all of the time.", "title": "No other place for me", "user": "kayejade", "date": "July 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 69506424}], "location": {"country": "United States"}, "variance": {"poor": 4, "average": 8, "very good": 38, "terrible": 5, "excellent": 75}, "aka": "Sunburst Motels i & Ii Hotel", "slim_ranking": 0.0487804878049}