{"user_rating": 4.5, "review_count": 13, "name": "Sunceva Postelja", "reviews": [{"rating": 3.0, "title": "Gorgeous apartment - but given wrong rooms/problem with pick-up", "text": "Stayed for 3 nights in June 2012.", "user": "nbologne", "date": "October 20, 2012", "id": 143296323}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Location: 20-25 minute walk into town. We knew the hotel was further away when we booked and the walk is on a lovely promenade but it did get tiresome going back and forth every day since we went into town twice a day (worth it though). We also walked to Baska Voda a couple times and it was approx. 45 minutes. There is a stretch where you have to walk over pebbles going to Baska Voda so be careful what shoes you wear. We went to the little beach area just outside the hotel every day and loved it (no need to go to the crowded main beach). The hotel provides a free parasol.", "title": "great holiday", "user": "Stalbans115", "date": "August 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137271971}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Wrong rooms: we booked an expensive one bedroom apartment a few months in advance because \"no other rooms were available\" but when we got there they gave the much less expensive studio apartment (which looked great and was one the rooms I originally wanted to book) but was the wrong room. They apologized for the error and took us to a one bedroom apartment which still was not the one I had booked (we had confirmed the unit #) but it was very nice and the one featured on the website so we just stayed. But it sure seems like they were being dishonest when they made me choose between the \"last 2 rooms\" neither of which were the ones they gave us. Hmmm...", "title": "excellent", "helpfulness": 1, "user": "Tina V", "date": "November 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120372109}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The apartment itself was fantastic - clean, well-appointed, spacious. Great air-conditioning. Comfortable bed. Nice kitchen. Great bathroom/shower. And the balcony with small table and two chairs facing the sea was spectacular. We really loved this place.", "title": "Excellent choice", "helpfulness": 1, "user": "mlade", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119932648}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Major issue with pick-up: we arranged to be picked-up at a certain time and had emailed the day before and morning of confirming our arrival time. When we arrived at the bus stop and called no-one answered. Make a long story short, it took numerous calls, several wrong numbers, and 2 hours of being stranded before they picked us up. There were no taxis, and no one was able to direct us to the hotel. It was high 30s out and I had a fever so that made it even more frustrating (and so did the fact that the other couples who arrived with us were picked up within 5 minutes after calling their hotels). There are 2 stops in Brela very close to each other so make sure you get-off at the one closest to the hotel (ask the hotel since I don't remember which one is which).", "title": "Great! But double check your booking!!", "helpfulness": 1, "user": "Richard255068", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 115921253}], "location": {"country": "Croatia", "region": "Dalmatia", "continent": "Europe"}, "stars": 3.5, "variance": {"poor": 0, "average": 1, "very good": 1, "terrible": 1, "excellent": 10}, "slim_ranking": 0.384615384615, "description": "All apartments have balconies overlooking the sea, air conditioning, telephone with direct line, safe, satellite television, internet connection, fully equipped kitchen, extra-large double bed. In the living room there is a sofa placed which serves as an extra bed for two persons."}