{"user_rating": 3.0, "review_count": 477, "name": "Sunningdale Park", "reviews": [{"rating": 3.0, "title": "Very strange set up, but was ok!", "text": "This place looked more like a college than a hotel. Very bitty and bobby, with various buildings, restuarants, bars etc all very spread out around the grounds. The first room we were given already had someones luggae in it, luckily when we burst in the peopple were not in there, could have been very embarassing! The reception staff seemed to see this as a big inconvenience to them, even though it was their fault and certainly not ours. That said the room we ended up in was clean and modern.", "helpfulness": 1, "user": "pipmunch", "date": "September 27, 2010", "id": 81203097}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "The staff at breakfast though were quite the opposite, very accomdating and friendly and the breakfast buffet was very good value with lots of choice.", "title": "Deceptive website!", "helpfulness": 1, "user": "Lulu182010", "date": "August 30, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 77448955}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "A good base for exploring WIndsor and Ascot but not a place you'd want to sepnd a long time at.", "title": "Strange Set Up", "user": "Heidi2004", "date": "August 22, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 76282214}, {"rating": 3.0, "stay_parameters": "Stayed August 2010", "text": "Booked fon line for 2 nights to visit friend locally and, like a fellow reviewer, couldn't belive such a beautiful looking hotel, grounds etc was so cheap... That's not where you stay! Purpose built building, characterless, small (but perfectly clean) room, only a shower room, and a noisy night with weddding guests arriving & leaving. Views include the car park or another building. Grounds? What grounds! OK for a cheap night en route somewhere, but smaller than a Travelodge room. Oh and the pool - small & not clean in August! The grounds ARE lovely, when you find them. And there's a strange Government school complex going on around you. Breakfast was an excellent buffet. If this was a kettle, the Sale of Goods Act police would be investigating for mis-representation!!!", "title": "You get what you pay for!", "user": "Laarette", "date": "August 21, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 2.0}, "id": 76159838}, {"rating": 2.0, "title": "A cross between sheltered accommodation and halls of residence", "text": "The photo shows a beautiful, old, building but that is not where you stay! The accommodation is in a block with absolutely no personality. We actually said it was the first time we were pleased to be leaving a hotel room. Room was clean but the bed was so uncomfortably hard and it was so noisy due to guests leaving the bar very late at night. Will not be staying there again!", "helpfulness": 2, "user": "MrsW30", "date": "August 19, 2010", "id": 75938742}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The hotel was lovely set away from the main road a purpose built conference centre almost student like halls. This hotel was nicely furnished and comfortable we stayed in a standard room a large room with an even bigger bathroom. But this is in no way to be use for a romantic or luxury break... It was a saturday night and we were kept awake most of the night with noise in corridor and cars pulling up and going.", "title": "a lovely hotel but a rough night sleep!!!", "helpfulness": 1, "user": "sassylady24", "date": "August 17, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 4.0, "location": 3.0}, "id": 75683783}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The staff were friendly and it was well furnished and comfy but not restful.", "title": "Good value for money!", "helpfulness": 2, "user": "Cantylye", "date": "August 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 75428580}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Prob wont be going back in a hurry x", "title": "Disappointing", "helpfulness": 1, "user": "LK74", "date": "August 15, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 75338221}, {"rating": 1.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Only paid £89 for a room for 2 with dinner, bed & breakfast and a bottle of wine with dinner. Lovely grounds and friendly staff. Room a little small but our friends had a bigger room for the same price. The luck of the draw! Food was good. Would go again.", "title": "plush hotel? WRONG", "helpfulness": 2, "user": "sandra6688", "date": "August 15, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 1.0, "location": 2.0}, "id": 75298617}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Having stayed at DeVere Venue hotels before we were extremely disappointed with this one! The lovely manor house photograph on their website may be used for weddings but it wont be where you are staying! The accommodation can best be described as blocks of flats.", "title": "Good hotel if you get a good sale price deal", "helpfulness": 1, "user": "susangcs", "date": "August 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 74192397}, {"rating": 4.0, "title": "Great location at a great price.", "text": "We spent the weekend here as a base for a trip to Ascot races. The location of the hotel couldn't be much better with Ascot, Sunningdale, Wentworth, Windsor, Sunninghill and Virginia Water all reachable in 10 mins. The hotel grounds are fantastic and feel like you are in the middle of a country estate but the buildings do have a University Campus feel to them.", "helpfulness": 1, "user": "Dengland80", "date": "August 17, 2013", "id": 172643183}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "All of the staff that we came in to contact with were more than friendly, accomodating and helpful. The room was OK being a good size with ample storage and a very comfy bed. The room however was a little tired and probably in need of a refurb. The little signs of wear and tear were evident all over the room with nicks, dents and bumps dotted around and the bathroom ventilation not working. The bar is large with a nice garden/terrace to sit on, prices were typical hotel prices even considering this £4 for a bottle of mineral was a bit steep.", "title": "Good all round", "user": "kmadd", "date": "August 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 172553353}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The little extras you get free a very good. The wifi performed well and the free coffee machines dotted through the hotel are a fantastic idea. In the morning there was a steady stream of cabs meaning we had a very short wait to get over to the racecourse (the cab ride took no longer than 5 minutes). We didn't eat at the hotel however we did fine a lovely French restaurant in Sunninghill called La Cloche which was a very nice 20-25 minute walk away. With the wealth a number of local golf course this hotel would make a great base for a society weekend away.", "title": "Nice hotel", "user": "Ellen F", "date": "August 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 172316242}, {"rating": 4.0, "title": "Don't be put off", "text": "Our two night stay cost less than £120. If you are expecting the high quality standards of nearby Cowarth or Royal Berkshire don't stay here but if you do want a hotel in a prime location where you will be looked after well and get it at a great price this should be your choice. This isn't a 5☆ hotel however it knocks spots off the well known budget brands and at very similar rates.", "user": "Antonia423", "date": "August 14, 2013", "id": 172237658}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "In the Bridges rooms the bathroom windows are frosted, but do not have a blind. I was on the ground floor and didn't feel comfortable using the bathroom with people walking past the window every few minutes, especially at night when you put the light on. A very helpful receptionist kindly swapped me to a room on the 2nd floor where I was much more comfortable and felt very relaxed.", "title": "Don't believe all the reviews -7/10 good hotel for the money", "user": "MiaG", "date": "August 13, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 172024667}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Have stayed on business several times and I always enjoy my stay. Rooms are modern and well kept (the maid asked me if my room was 'up to standards' on several occasions).", "title": "Enjoyed my business trip away", "user": "Conor W", "date": "August 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 171560813}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "The food has a different theme every night and is well prepared - a steak I had here was one of the nicest I've tasted! The food tends to be quite Mediterranean, generally with two meats and vegetarian options available, along with a HUGE selection of cakes.", "title": "Do not be put off by narrow minded over demanding guests", "helpfulness": 1, "user": "lowena7", "date": "August 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 170564541}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "There are two large bar areas, which show sports and include pool tables. There is also a gym which is useful though is not very big.", "title": "Quite near to Ascot races, good value for money, very helpful and friendly staff", "user": "CovGez", "date": "July 30, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 169968170}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The hotel is also only a 5 minute taxi ride from Sunningdale station making transport links excellent.", "title": "Great Hotel And Very Friendly Staff", "user": "Warwick_G289", "date": "July 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169679862}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "As I said earlier I've only stayed here on business but am looking forward to going back.", "title": "Butlins/Crossroads/Barracks, you decide?", "user": "laughingmike", "date": "July 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 169634773}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Set in a very nice part of the country this complex looks very good as you drive up. On closer examination the rooms are small, but laid out more like a school than a hotel. In my room the television was set to high contrast, but the remote would not allow me to change the picture and when I tried at the set the wood surround fell off the wall. The food was very good, particularly the sweets, although the service was not fast, especially if requiring tea or coffee with breakfast. Otherwise the breakfast was very good with the sausages cooked on all sides. The staff were very friendly and very helpful in Reception. The Conference facilities were excellent with good air conditioning. The bar was clean with good service, although the prices were on the high side", "title": "Looks classy but needs some TLC", "helpfulness": 1, "user": "698davidh", "date": "July 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 169519292}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We stayed at Sunningdale Park for one night when visiting Legoland. I found a couple of small problems with the hotel but these wouldn't put me off staying again.", "title": "A positive experience overall", "helpfulness": 1, "user": "Maxileocat", "date": "July 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 169280980}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "On the positive side: the hotel was in a good location, reasonably priced, the rooms were clean and the decor was pleasant enough. The main double bed was also comfortable. We were located in the 'Bridges' building which is close to the main reception and the restaurant. The hotel is situated in beautiful grounds and the receptionist was able to recommend a local restaurant that we could visit for dinner once we made it clear that we weren't interested in using the onsite restaurant for dinner as well as breakfast. The breakfast in the morning was worth the £7.50 charge (£3.50 for children over 6) and there was a good selection on offer.", "title": "Ideal conference venue", "user": "AnnBBury", "date": "July 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 169061125}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "The only negative aspects were the fact that they tried to overcharge me on check-in by charging me for my youngest child's breakfast (he was entitled to a free breakfast due to his age) but I spotted the mistake and after a bit of discussion this was resolved. There were 2 single beds (camp beds) in the room for the children but one of these was very uncomfortable so we ended up sharing which was fine for one night but not ideal for longer stays. If it had not been for this issue with the bed I would have awarded a higher rating.", "title": "Excellent stay, will be back!", "user": "cobblersfc", "date": "July 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 168752051}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Stayed here in early July for a training seminar. Great facilities for this type of event however the rooms were fairly basic, set in barrack type blocks", "title": "Good Meeting and Conference Venue But Poor Accommodation", "user": "ChallengerSRT8", "date": "July 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 168744028}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We had a package for 3 nights at this hotel and you get what you pay for ie this is not a 3 star hotel by any means!! I agree with the other reviews in that the web site is VERY misleading and the lovely white house has no impact on your stay at all . In fact you had to really make an effort to even see it! Food was adequate but buffet style . Car park has small spaces and we had trouble parking . Sunningdale is a lovely area and our trip to Windsor was well worth it. I should not like to have stayed in the small rooms during hottish weather as they were uncomfortably warm even in cool conditions. Overall not a particularly good experience but as stated you get what you pay for.", "title": "get what you pay for!!", "helpfulness": 1, "user": "barbie_8", "date": "July 29, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 72877011}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Receptionist offhand, although other member of staff came to the rescue and was more pleasant and helpful. Room pokey and in an accommodation block, husband said like his army accommodation years ago, certainly not what I would say a hotel. You do not get to stay in the nice big white building, you see on website (that is in the grounds hidden away - you just get these 'student' accommodation type rooms. We drove past twice before realising \"this is it! A lady in car park said \"good luck\" I am here for a meeting thank goodness I am not staying here! Great start. No lift and have to climb two (small) flights of stairs with case. Very noisy (however this was guests which I guess is outwith the management's control. Was at Hoiiday Inn Express for end of stay which was cheaper and miles nicer!", "title": "Disappointed", "user": "josiecat069", "date": "July 27, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 72612290}, {"rating": 2.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "This is the Government's Centre of Management and Policy Studies (CMPS), which uses Sunningdale Park for its residential training (search it on the web) and only sidelines as a hotel letting out rooms when they are not full up with civil servants attending doing training seminars, the website for the venue is misleading, it is seperated into blocks of flats circa 1960's concrete/brick construction, it is noisy at night from the people on courses coiming back after a few drinks and the rooms are ridiculously warm (no air conditioning or controls for heating) we had o ask for a fan for the room @ 1 am. There is no mention of the government connection on their web site. please save yourself the heartache we had.", "title": "Dont stay here misleading website, Govenrment training facility.", "user": "familyguy7575", "date": "July 23, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 72029561}, {"rating": 2.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "if you are disabled or struggle to walk long distances this venue is definitely not for you", "title": "no good if you cant walk long distances", "user": "hotelguest21", "date": "July 16, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 71147872}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "the main reception is miles from so many of the facilities that you drive around to the block you are staying in", "title": "Beware! Totally misleading on website.", "user": "SSKYorkshire", "date": "July 10, 2010", "detail_rating": {"cleanliness": 3.0, "location": 4.0, "value": 3.0, "rooms": 1.0}, "id": 70417970}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We stayed here on a family trip to LEGOLAND etc, the location was good for the attractions we wanted to visit. The hotel was a reasonable price with good parking facilities, the staff were helpful, when we checked in we had a room with only a shower, as we had an infant with us and required a bath and the staff moved us to another room to accommodate straight away.", "title": "good location, average hotel", "user": "UKTravellercleveland", "date": "August 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 174456251}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "We had food in the bar which was ok but not a lot of childrens options.", "title": "superb for singles", "helpfulness": 1, "user": "steelshopman", "date": "August 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 174149343}, {"rating": 4.0, "stay_parameters": "Stayed August 2013", "text": "The hotel grounds were pleasant but the room was quite small which was ok but there is no air con and both nights we stayed we were disturbed by noise.", "title": "Beautiful setting", "user": "fflamgoch", "date": "August 25, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 173956356}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Overall it was a good base for local attractions, clean and was adequate for what we required.", "title": "Nice location but average room", "user": "rachel o", "date": "August 24, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 173859105}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "i don,t really want to say what good value this place is on the right day because for certain there will be more competition for rooms,and by the law of supply and demand,the prices are sure to rise.the staff are friendly,the rooms are excellent,but you won,t like it here, so stay away!", "title": "Disappointed", "user": "707Anon", "date": "August 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 172928173}, {"rating": 1.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "Just like a few other people have reported, on arrival at \"the venue\" I was very unsure as to where to go. I honestly walked into what turned out to be Reception to ask where the hotel was. It has a feel of the 1970's and just needs the Crossroads Motel sign outside to complete the picture.", "title": "Seriously Seriously Weird!", "user": "DarrenWickford", "date": "June 30, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 1.0}, "id": 69237583}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "To be fair, it is one of the cheapest hotel's in the area at £59 per night and the rooms, although small where clean and the bed was fairly comfortable. Unfortunately when I stayed the lack of air conditioning was a real down point as the room was very stuffy!", "title": "Amazing location and grounds", "user": "DiamondsonTour", "date": "June 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 68682534}, {"rating": 1.0, "title": "Far from a value venue!", "text": "What I found the most strange about Sunningdale Park was the adjacent building which was the National School for Government. As you walked around you would not go too far before seeing leaflets and prospectus for the school. I think that is what gives the venue such a strange feel. You are left with the feeling that you are in the wrong place and at any time you are going to be approached by a government officer asking you which course you are studying.", "user": "luhar", "date": "May 25, 2010", "id": 65311957}, {"rating": 4.0, "stay_parameters": "Stayed May 2010", "text": "All in all, I have stayed in worse places, but in fairness they didn't feel as strange!", "title": "Excellent value for money - booked online £39", "user": "NessHertfordshire", "date": "May 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 65203398}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Stayed here for 4 nights whilst doing the windsor tri and Ascot races and we could not fault it. Managed to get the £39 rate per night rate and we were delighted. The grounds are fab had a few swims in the outdoor pool and free wi fi . The room was small but clean and the location is brilliant for Windsor and Ascot. If you want luxury this isnt the hotel if you want a good clean base in a great spot pick this hotel we will be back next year", "title": "Absolutely fine and amazing value", "user": "tmwdp", "date": "May 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 65071312}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3.5, "variance": {"poor": 79, "average": 141, "very good": 141, "terrible": 63, "excellent": 53}, "aka": "Sunningdale Park Ascot", "slim_ranking": 0.6, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.0, "rooms": 3.0, "location": 3.5}}