{"user_rating": 4.0, "review_count": 133, "name": "Sunset Oceanfront Lodging", "reviews": [{"rating": 4.0, "title": "Loved the sunset view!", "text": "This was our first trip to Oregon. We stayed one night at the new \"ocean view studios\" section of the Sunset Motel in Bandon, Oregon. We loved it! The room was very clean, not fancy and it had a nice fireplace. The room was on the second floor and far enough from the beach front to not be bothered by the surf's loud noise but close enough to enjoy the view of the beach. The sunset from our studio room was awesome. We stayed June 16, 2004, their off-season, and the rate was $125.00 a night. The spectacular view was worth every penny we spent. We would definitely stay there again. As far as the older rooms, they were not impressive to me as we walked by heading to the beach. But they are probably 40 years old too.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "July 10, 2004", "id": 2288436}, {"rating": 4.0, "title": "Storm watching", "text": "For more then 10 years I've visited the Sunset. The rustic rooms", "helpfulness": 4, "user": "A TripAdvisor user", "date": "February 9, 2004", "id": 1640159}, {"rating": 5.0, "title": "home away from home", "text": "hanging off the cliff walls and the fantastic view of the Pacific ocean", "helpfulness": 3, "user": "A TripAdvisor user", "date": "October 27, 2003", "id": 1423938}, {"rating": 2.0, "title": "Middle of the road...", "text": "can't be beat. Winter storm watching is fantastic while warming by the", "helpfulness": 15, "user": "BrvNwWld", "date": "September 30, 2003", "id": 1371705}, {"rating": 5.0, "title": "Better than some apartments I've had", "text": "fire or lounging in a chair near the window.", "helpfulness": 14, "user": "Oregonlover_8", "date": "July 3, 2003", "id": 1127620}, {"rating": 5.0, "title": "Loved the Sunset Motel!", "text": "We spent two nights at the Sunset Motel (May 2003) and loved it!! The woman at the front desk was extremely helpful and let us view pictures of three rooms before selecting one. Our room was clean, well kept, and had a private balcony directly facing the ocean. What a view! We could hear the surf at night and watch the changing tides. There were steps right down to the beach to provide easy access. I'd recommend this place to anyone who wants a relaxing, reasonably priced place to stay in Bandon.", "helpfulness": 23, "user": "A TripAdvisor user", "date": "May 27, 2003", "id": 1029898}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "Spring for the ocean-front Vern Brown addition--the third floor will give the best view. It's not a five star hotel by any means, but still rates an excellent from us because of the spectacualr view, good-sized room with balcony, fireplace, table, kitchenette with dishes and pots, acceptable price in high season (about $160/night including tax) and very pleasant front desk staff. We were only there one night, but with the kitchenette, it would be great for 3-4 days. We had two queens, but I think the king rooms have a sofa too. Evening provided a stunning sunset and our lucky timing provided a morning with one of the lowest tides of the month, revealing a close-up look at thousands of starfish and anemones at the base of the basalt rocks. We had a very good dinner at the cozy and nicely-decorated High Dock in Bandon. Entrees run about $20 and, at least the fish dishes we had, were worth it.", "title": "We'd go back in a heartbeat", "helpfulness": 6, "user": "wunderwoof", "date": "May 31, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 5287554}, {"rating": 4.0, "title": "Stay in the Vern Brown Addition", "text": "We were only able to stay 1 night but would love to return. Loved the hotel and the town. This motel has rooms across the street from the ocean, as well as rooms right on the rocks above the beach. Nothing fancy, but the room was fine, the price reasonable and the view through the windows and from the balcony was spectacular.!", "helpfulness": 7, "user": "Susan4WI", "date": "May 11, 2006", "id": 5055715}, {"rating": 4.0, "title": "Loved the Rocks!", "text": "This was a great find along the coast! The view of the giant rocks in the ocean across the street was superb. The room had a nice gas fireplace in its small sitting area which made for a nice treat after a cool walk along the ocean. Everything was clean and courteous!", "helpfulness": 11, "user": "A TripAdvisor user", "date": "October 11, 2004", "id": 2696271}, {"rating": 4.0, "title": "Great location", "text": "We stayed at the Sunset Motel on Beach Loop Dr. on Sept. 21, 2004. We stayed in room 204 in the older-economy wing of the motel. The room was quite small, and the fixtures were old, but we were plenty comfortable. Although the economy rooms aren't considered \"oceanview,\" we could actually see a bit of the beach out of our window. There was also a viewing deck outside. To get to the beach all we had to do was walk across the street and down some stairs. As the name claims, we did view a beautiful sunset from the beach. For dinner we ate at Lord Bennett's right next door. It was expensive, but tasteful and convenient. We had to go into the downtown area for breakfast. The motel offers oceanview and oceanfront rooms that look new and nice, but we were content with our economy room.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "October 11, 2004", "id": 2695442}, {"rating": 5.0, "title": "My Favorite Oregon Getaway Spot", "text": "While many places on the Oregon coast can be somewhat tourist-filled, Bandon remains a pristine town where you can find yourself strolling an empty beach with some of the most amazing views in the world – and not a soul in sight. I have made the Sunset Motel my vacation destination – the ideal place to leave the city behind and stay in an oceanfront room with a private terrace.", "helpfulness": 22, "user": "A TripAdvisor user", "date": "August 23, 2004", "id": 2489198}], "location": {"country": "United States"}, "variance": {"poor": 13, "average": 20, "very good": 46, "terrible": 4, "excellent": 50}, "aka": "Sunset Oceanfront Lodging Hotel", "slim_ranking": 0.666666666667, "description": "Beautifully situated on high ground overlooking a sandy beach, majestic sea stacks and the Pacific Ocean, Sunset Oceanfront Lodging offers beach access and a variety of accommodations. Family owned and operated since 1936."}