{"user_rating": 4.0, "review_count": 429, "name": "Sunset Station Hotel and Casino", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Stayed for 3 nights starting December 23 as it's close to my son in Henderson. Very easy and friendly check-in. Room was very nice with a comfortable bed. Great view, especially at night, but who's there for the view? Nice assortment of restaurants. Good food specials and breakfast buffet was a good value. Machines in the casino were tight but that kept me from gambling as much as I like. Of course it's not near the strip but casinos all look the same inside to me. Would probably stay somewhere else if I wanted to be near the Strip action; somewhere closer. Will definitely be going back.", "title": "good value", "helpfulness": 1, "user": "Lynnie712", "date": "December 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12150025}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "We booked this hotel only to be with other family members to attend a football game at the UNLV Stadium nearby. It's highly unlikely that we would stay at Sunset Station again for other games.", "title": "Sunset Station: none of the glitz and glamour of Vegas Strip", "helpfulness": 2, "user": "redtsunami", "date": "October 27, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 1.0}, "id": 10374415, "likes": {"liked": "— Great swimming pool", "disliked": "— Everything else"}}, {"rating": 5.0, "title": "Sunset Station", "text": "The hotel location does not have a significant advantage to make it worthwhile to sacrifice the Vegas action. SS offers free shuttle service from the airport once hourly (except certain hours), but you have to haul your bags to the shuttle stop (beyond the taxi stop) then wait in the Nevada heat. We hustled through the huge airport to get there but missed the shuttle. So we opted for a taxi; the fare was roughly $30 to the hotel, not including tip.", "helpfulness": 4, "user": "TopekaDucky", "date": "October 26, 2007", "id": 10350899}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "Check-in was swift, but after the long walk to our room in very cold hallways, we discovered that there was only one bed. We had a friend joining us for one night, and I had reserved two Q beds 2-3 months in advance and paid full price. I immediately called the front desk to request a different room, but they said \"sorry\", they didn't have one. They offered to send up a rollaway and *wow* not even charge us for it! Small consolation. I was very annoyed.", "title": "Bait and Switch", "helpfulness": 5, "user": "Sacramento7", "date": "October 21, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 3.0}, "id": 10179176, "likes": {"liked": "— lots to do, casino, many restaurants on site, pool, mall across the street.", "disliked": "— check-in"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The pool, however, is great! There's a very shallow wading area for kids, and the deeper areas meander around with small inset areas where you can stay in the water while talking to friends on the lounge chairs. I'm a pool fiend, and this was one of the nicer ones I've used. There are two outdoor showers behind the lifeguard station so it's convenient for washing out the chlorine. We went early when the pool first opened and had the pool to ourselves for the first half hour.", "title": "The sunset station Henderson", "helpfulness": 8, "user": "Jonnylovestravelsson", "date": "September 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8607040, "likes": {"liked": "— the facilities", "disliked": "— too big"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We just finished spending eight nights at the Sunset Station. The employees were all very friendly and really helped if we had a question. The rooms and casino are very, very clean. Overall, a good stay.", "title": "Clean, comfortable stay", "user": "Sp0rty", "date": "May 31, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 16541721, "likes": {"liked": "— cleanliness, comfort, pool", "disliked": "— buffet food"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "Even though it is 10-15 minutes from strip, the hotel is really easy to access.", "title": "Weekend at Sunset", "helpfulness": 1, "user": "cliveasmith", "date": "May 22, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 16318709, "likes": {"liked": "— Very comfy beds and clean", "disliked": "— shower"}}, {"rating": 4.0, "title": "It is what it is.", "text": "We stayed at Sunset Station over the first weekend of May. The weather was good and the pool was open, which I was worried about as others on here have said it's usually closed. The pool area was very nice but there were more people than loungers yet from our room we could see more stacked up at the back. There was grass to lay on though. The room was good and was nicely decorated and clean. The bathroom was fine but the only complaint was the shower. It would not keep a constant temperature. We gambled a little on the tables and slots and came away with more than we started with, so thats fine! Getting to the strip is easy if you want to go there, only a short drive down the freeway, most likely taking less time than driving the strip itself. If you want to stay off strip, this hotel is a good one and good value.", "helpfulness": 1, "user": "AZ-Traveler85253", "date": "May 4, 2008", "id": 15642878}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "I have stayed in a lot of hotels in Vegas over the last 35 years, so I do have a reference. I actually lived 3 miles from Sunset Station when it was being built, but I never set foot in there.", "title": "Small Casino off the strip", "helpfulness": 2, "user": "lw63", "date": "April 23, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 15254012, "likes": {"liked": "— The room was great with great views of Henderson", "disliked": "— Could have done with some better towels"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "Last weekend was my annual golf trip and we switched from the Golden Nugget to the SS for ease of transporation to golf and good rates. I read the previous reviews, so I knew this wouldn't be Ballagio...and it doesn't try to be.", "title": "Great for Non-Smokers", "helpfulness": 1, "user": "ShepherdGirl", "date": "April 14, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 15032502, "likes": {"liked": "— Everything felt clean and new.", "disliked": "— Location -- nice area, but a few miles from the strip."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "A city within a city!! If you want to avoid the mainstream Vegas strip action, this is the place to stay. This hotel has everything you could want without ever leaving the property. The rooms were GRAND for the money. Handicap friendly (my mom was in a wheelchair) and an overall excellent experience. Two thumbs up!!!", "title": "Wow", "helpfulness": 1, "user": "MikkiD", "date": "April 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14764946, "likes": {"liked": "— The room size was HUGE", "disliked": "— Not one thing"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "My wife and I stayed at Sunset Station the week of February 10 through February 16, 2008. This was not our first visit to Sunset, we normally check the rates there first when going to Las Vegas.", "title": "Cold Shower only cost $189.00 a night", "helpfulness": 1, "user": "fmrlabdude", "date": "March 31, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 14693304, "likes": {"liked": "— Location to freeways & the Strip", "disliked": "— Saffs unwillingness to work with you or contact you about issues"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Our stay was nice until the last day, Saturday the 16th, when, as we were getting ready to depart, the hot water failed. I was in the shower when the hotel lost hot water. I had to get my wife to shuttle cold water from the sink for me to rinse with since no water would come out the spigot. She called downstairs and told them of the problem. Some time later the hot water came back on and my wife attempted to get her shower when again the hot water went off and once again had to shuttle water to rinse with.", "title": "Great Stay--Will Return to Sunset Station", "helpfulness": 4, "user": "Ocysu", "date": "January 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 12936528, "likes": {"liked": "— All the activities it had to offer", "disliked": "— The cigarette smoke"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "I complained to the desk staff about this and thought I would at least get a discount for our last night stay, which didn’t happen. I did not have time to discuss it since we were now late for catching our flight. I did use the online complaint form as soon as I got home and waited two weeks and have never even been contacted. I sent a letter directly to the GM of the hotel and was also never contacted back.", "title": "Loved it, It had everything we needed all in one place.", "helpfulness": 6, "user": "Gnejs", "date": "January 20, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 12814538, "likes": {"liked": "— Conveinence, room quality, shuttle, various restaraunts", "disliked": "— Dinner buffet"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "I am disappointed that Sunset would charge full price for the one of the worst experiences I’ve ever had in a hotel and not even make contact with me about the issue.", "title": "Great for families", "helpfulness": 3, "user": "puffdotty", "date": "January 3, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 12297471, "likes": {"liked": "— clean, new, spacious, beautiful casino", "disliked": "— would be great if it was smoke-free"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Our family spent a Monday night here before flying home. We stayed at the Orleans a week earlier and overall, preferred it. This seems like an older property. Parking was much closer to the room, basically because it did not seem real busy. There was no wait to check-in. No security at the elevators checking keys. The pool was also closed for resurfacing for the week when we arrived, which did not go over well after a 4 hour drive across the desert. The bathroom had a nice large counter outside of the shower area, but the shower head was at eye-level for me and I'm no basketball player. The beds were comfortable and high off the floor with extra pillows. The cable TV lineup was much better as well. We did have to set the A/C for 68 degrees to get what seemed to be about 75 in the room. The view was nice from the 15th floor room. They do hit you up for a $4.95 Amenity fee which we did not know about until we got there - even though the room was prepaid. This supposedly covers local calls, shuttle service, $1 kid bowling, exercise room and gift shop discount, none of which we used. We we're going to bowl until we saw that shoe rental was $3.50. The kids went to the arcade instead. I enjoyed the casino and had no trouble finding a $5 blackjack seat, but could not overcome my wife's slot machine losses. We did not use the restaurants as we ate at the nice mall across the street instead.", "title": "About what we expected.", "helpfulness": 2, "user": "bcreilly", "date": "August 22, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 8472744, "likes": {"liked": "— Casino", "disliked": "— Unused Amenity Fee"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "We stayed there for three nights. The air conditioner didn't work very well. The buffet was terrible for the price. The price was $11.99 a person. The cafe food was alot better and the service was alot better also. The Casino slots are not to be played. They have to be the tightest machines I've ever seen. My wife did win $225.60 on a penny machine playing .30 cents a play. They don't have any 9-6 vido poker machines either. We also visited there other properties, like, Texas Station, Boulder Station. We won't ever visit them again either. Same type of machines and tighter than a stretched rubber band. We did better at the Venetian in only three hours of play than we did for three days at these other Casinos. The floor personnel are not friendly and not very helpful. You can do alot better than these properties. Good Luck.", "title": "Just ok", "helpfulness": 1, "user": "Diane S", "date": "June 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 7833616, "likes": {"liked": "— clean", "disliked": "— air conditioner problems"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "We were on our way to Zion from Los Angeles and wanted to find somewhere to stay in the Las Vegas area that wasn't too expensive or crowded or smokey and was kid-friendly for our 8 year old. Sunset Station fit the bill. We got a non smoking with 2 queen beds and a nice view for under $100 for a Saturday night. We arrived at check in time (3pm) and went Cosmic Bowling at their huge bowling alley. It has video and music and lots of flashing lights - our daughter really enjoyed it. They also have a very nice Kid's Club where we left her for an hour for $8 while we gambled. The kid's club was safe and clean and fun. They also have a multi plex cinema right in the casino and a very nice arcade good for younger kids and teens. The breakfast buffet was really nice and the smokiness as we walked through the lobby/casino was not too bad. They have a lot of other food choices of the food court variety as well as some nice looking restaurants. The room was very clean and a decent size and the beds were comfy.", "title": "Loved Sunset Station", "helpfulness": 3, "user": "nadler", "date": "May 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7545752, "likes": {"liked": "— the kid friendly activities"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We booked our this hotel through VEGAS.com. Which saved us some money. When we arrived at the hotel I was surprised how big it was. It took us about 15 minuets to get there from the strip (using Highway 15 to Highway 515). It was very beautiful inside. When we checked in the front staff was sooo friendly, she even upgraded us to the petite suite. We had an awesome view in our room, which was huge. When we got downstairs the first slot machine we got to, we won all of our money back from our previous plays. The Sunset restaurant was very good and decently priced ( the two of us ate breakfast for $15). The next morning we went to the Feast Buffet, it was okay, wasn't the best. My husband and I loved the off strip action, we will be staying at this hotel in the future.", "title": "Best Casino EVER!", "helpfulness": 1, "user": "blurple80", "date": "April 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 7412084, "likes": {"liked": "— Casino", "disliked": "— The buffet sucked"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "The hotel was adequate and the casino was good. My beef is that for a business traveler I found it lacking. There is a unknown $9.99 fee for using their wireless provider daily. Then the local calls are free for only 30 minutes and then there is a $.10 per minute charge over that. I would do some more searching before I would use Sunset Station again for a business stay.", "title": "Not for the business traveler", "helpfulness": 3, "user": "r6985", "date": "April 16, 2007", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 7368794, "likes": {"liked": "— Casino", "disliked": "— Having to pay for wireless internet"}}], "location": {"country": "United States", "city": "Henderson"}, "stars": 3, "variance": {"poor": 27, "average": 80, "very good": 164, "terrible": 23, "excellent": 135}, "aka": "Sunset Station Hotel Henderson", "slim_ranking": 0.62962962963, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Located on more than 98 acres and 457 rooms in the heart of Henderson, Nevada, Sunset Station Hotel and Casino is conveniently located near Lake Mead, Lake Las Vegas, Galleria Mall, Sam Boyd Stadium, golf courses, recreation areas, and other renowned restaurants and shops. We offer panoramic views of the glittering Las Vegas Valley and high desert mountains. From Sonoma Cellar, one of Las Vegas’ finest steakhouses. To Grand Cafe with gourmet tastes at café prices. To Cabo, one of the best Mexican restaurants in town. To Feast Buffet, voted Las Vegas Best Buffet numerous times by the Las Vegas Review-Journal. To a huge food court with some great options for quick eats. Nobody does dining better than Sunset Station. The Las Vegas Review Journal gave Sunset Station the nod as “Best Slots” and “Best Video Poker”. And that’s just one indication of how fabulous the Las Vegas gaming is here. We have the latest and greatest games in the Valley including thousands of Jumbo Penny and Jumbo Dollar slots, the most 100% payback video poker games, table games, bingo, keno, live poker and a thrilling race and sports book. No place offers you greater gaming value for your dollar or more chances to hit the jackpot. The nights really heat up at Sunset Station. We have some of the best live music and concerts in Las Vegas. Plus some great, intimate lounges and bars. And the most family attractions you’ll find in town. With more than 13,000 square feet of event space, Sunset Station turns any corporate meeting or event, wedding, birthday or special occasion into the most unforgettable experience."}