{"user_rating": 4.0, "review_count": 3737, "name": "Sunset Beach Resort, Spa & Water Park", "reviews": [{"rating": 5.0, "title": "Couldn't have been better!!!", "text": "My boyfriend and I went to Sunset Beach Resort with another couple and stayed through may 12 thru the 18th. We had an absoulutly WONDERFUL stay. The staff was nice, the bar tenders were friendly...(especialy Raymond!! HE ROCKS!!) and the food was always good and the drinks were always cold. We stayed in room 1005 in tower B wich is the \"sun-set\" tower. We had a perfact view of the bay the mountians and the ocean. Our room was always clean... however we did find that the maid always did a better job when we left a tip. The beaches are always clean (the are raked daily) there are pleanty of chairs for everyone, there is no need to bring towels, you get a towel voucher when you arive. We played in Volley-ball tournements, we went snorkeling everyday almost... if u go you have to go around to the other side of the wave breaker rocks, we saw some magnificent fish, but watch out for sea urchins and baracudas because we saw quite a few of those. There is Nightly entertainment, which was always fun. On mondays if you are a guest at the resort they will give you a wrist band that gives you free transportaion to and from Marguritaville, free entry and free shots all night, which was alot of fun.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "July 29, 2005", "id": 3721731}, {"rating": 1.0, "title": "Not worth the money", "text": "Don't listen to the bad reviews this place gets, you cant please everyone, from our experiance we had a wonderful time and enjoyed every minute of it, we had fun no matter if we were snorkeling, relaxing at the pool bar, browsing through the gift shop or visiting the spa for a massage... which may i add was GREAT! This place is paradise... but remeber to bring your sun-screen and wear it too, my boyfriend got 2nd degree burns on his feet!! but other then the burt feet there was nothing else wrong with our trip, i would defintatly go back!!!!!!!!!!!!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "July 29, 2005", "id": 3720771}, {"rating": 3.0, "title": "Not Bad At All", "text": "feel free to contact me via e-mail with any questions i would love to answer them for you.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "July 28, 2005", "id": 3717587}, {"rating": 3.0, "title": "Some good and some not so good.", "text": "Sunset Beach is not worth the money at all. The people were RUDE not helpful and did not know anything when you asked them a question. Me and my boyfriend were just there when Hurricane Emily hit you would think in a situation like that the Hotel would be helpul and accomidate their guests. Boy where we wrong. They could care less about the fact that people were stuck there and couldnt get home we didnt get free night stay all we go was ONE complimentary phone call to make to try and get home when we were stuck. The people at that resort have big attitudes. They are supposed to treat you like a guest and the whole time we were there we felt very unwelcome. The only thing good about the place was the sun and and the beach and the fact that I got a Tan! I would NEVER go back there again. People dont waste your time or your money it's not worth it. I mean HELLO I see a red flag when a resort that was supposed to have there new water park and renovations done last JANUARY and its is now July and it is not even near done I see that as a problem I am telling you it is not worth the money at all! Stay at a Sandals!!!", "helpfulness": 12, "user": "A TripAdvisor user", "date": "July 27, 2005", "id": 3704608}, {"rating": 4.0, "title": "Great resort for familys!!", "text": "We visited this resort in early June, and everyone was relatively nice and friendly. The resort was right on the beach--very convenient. However, the sand was extremely hard--feet could not sink in the sand and actually hurt the bottom of your foot when walking bare foot. It was nice to have paddle boats and snorkeling equipment, tennis, and mini golf readily available.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "July 27, 2005", "id": 3703424}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "This location surpassed our expectations on all levels.", "title": "We're already planning our return trip!", "helpfulness": 4, "user": "NairobiGirlOH", "date": "January 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 93985416}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "The service was great. We needed extra towels and they were put in the room by the time we came back a couple hours later.", "title": "rough start but great ending", "user": "sawyeko", "date": "January 21, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 93974086}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "The resort had something to do for all ages. We are planning to go back because we didn't do it all in the 6 days we were there.", "title": "Another great trip to Jamaica!!", "helpfulness": 3, "user": "martyfSaskatchewan", "date": "January 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 93659760}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled solo", "text": "Our 2 small kids were at home in the open surrounds (massive lobby) and all the activities could accomodate them.", "title": "not bad for the money", "helpfulness": 5, "user": "frozeninkw", "date": "January 17, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 93401564}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "I can't say enough about the place. It was clean. Food was good (better than most all inclusives) and the staff was very friendly!", "title": "wonderful cant wait 2 go back", "user": "mariemcnally", "date": "January 17, 2011", "detail_rating": {"value": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 93390934}, {"rating": 4.0, "title": "Trip was Great!!", "text": "My new wife and I (married Aug. 27th) :-) Went to this resort also the week of the 31st for our honeymoon. The service was great and since this was our first all inclusive, we can only say good thigns about the resort. The staff was friendly and attentive, the food and drinks were great (and free!) There is a casino there, as well as two higher-end restaurants (Chinese and Italian) which you must dress up for (no t-shirts or sneakers allowed!) There was also live entertainment every night. There was really no need to go into the city of Montego Bay except to ship or to enyjoy their night life. Don't like the beach? There are severaly large swimming pools just yards away where you can get all the sun and water you want without the mess of the beaches (my wife is not a beach/sand person.) The view from our room ws breathtaking as we had an ocean view room. The rooms were a little dated but it didn't matter as we spent most of our time outdoors anyway. We definitely look forward to going back here in a couple of years when our pockets permit! ;-)", "helpfulness": 1, "user": "A TripAdvisor user", "date": "September 17, 2004", "id": 2581605}, {"rating": 4.0, "title": "Family Friendly", "text": "Well,", "helpfulness": 4, "user": "A TripAdvisor user", "date": "September 17, 2004", "id": 2581453}, {"rating": 4.0, "title": "Returning Again", "text": "As you will notice, most of the ratings on this site for Sunset Beach are actually above average or higher. And the truth is, this is an accurate assessment.", "user": "A TripAdvisor user", "date": "September 14, 2004", "id": 2571212}, {"rating": 3.0, "title": "have fun", "text": "We've experience 3 to 5 star hotels/resorts around the world to include western Europe. This place is soo accomodating and relaxing, it's unbelievable. We took our 5 1/2 year old son and he enjoyed himself, especially at kids club, he looks forward to returning. Sunset Beach is about making you feel at home in Montego Bay. Generally speaking, you are forced to relax and not expect the \"starched\" services as you would at an American-ran resort. There is nothing starchy about true Jamaican culture. There's a spa that includes a hair salon, there's miles and miles of beach to enjoy and believe it or not, the beach is never crowded. That's how much property there is. The food is a mixture of American and authentic Jamaican cuisine (that's good for the children). The room service is excellent.", "helpfulness": 1, "user": "Tatiami", "date": "September 14, 2004", "id": 2571209}, {"rating": 5.0, "title": "great holiday!!!", "text": "One piece of advice, bring your pre-paid calling cards if you plan to stay in touch with love-ones at home. Another, do market surveys before purchasing. Lastly, make friends at the resort. Could be worth saving the $$$$.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "September 13, 2004", "id": 2528300}, {"rating": 4.0, "title": "Reasonable deal", "text": "We agree with the many positive comments in TripAdvisor as provided by fellow travellers in relation to the services by the Sunset Beach Resort. The hotel management tries hard to give you value for your money. There is the intent to assure a Jamaica experience by live music every night, the presentation of Jamaican foods for those who are interested and, the friendly service provided by the employees.", "helpfulness": 13, "user": "dkona", "date": "January 23, 2007", "id": 6650525}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "Rather than repeat comments of other reviewers, I add the following comments:", "title": "Loved it...AGAIN!", "helpfulness": 13, "user": "Mary R", "date": "January 23, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 6648343, "likes": {"liked": "— EVERYTHING!", "disliked": "— No coffee pots in the room."}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled with friends", "text": "-I don't understand the many comments about the \"small cups\" for liquor and the suggestions to \"bring your own cup\". The hotel provides regular glass sized drinks. Are people expecting one litre sized containers for beer and 7/11 slurpee super-sized containers for mixed drinks?", "title": "great time", "helpfulness": 16, "user": "HH#4", "date": "January 22, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 6641158, "likes": {"liked": "— close to airport, food, activities, relaxing atmosphere", "disliked": "— size of beach"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "-The hotel is about 7 km from the town of Montego Bay. A trip to a store is a $30 US taxi ride. A hotel shuttle service occurs twice a day for a $6 return fare. It is a fair price, but be aware that the shuttle bus goes only to 3 T-shirt stores and one duty free store. The driver appears irritated if you go to other stores during the trip. The hotel should have a regular shuttle (e.g. every 2 hours during day time hours with one or two drop-off and pick-up points.", "title": "Feeling All Right at Sunset Beach Resort", "helpfulness": 15, "user": "Jamaica4u", "date": "January 22, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6640885, "likes": {"liked": "— Friendly Staff", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled with friends", "text": "Overall we enjoyed our experience at the Sunset Beach Resort!", "title": "So glad we ended up here!", "helpfulness": 13, "user": "Llewysknot", "date": "January 21, 2007", "detail_rating": {"front_desk": 2.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 6634669, "likes": {"liked": "— Location, beaches", "disliked": "— You can't get American dollars at currency exchange - only Jamaican."}}, {"rating": 3.0, "title": "I will go back if I could see that woman again!", "text": "It was my 1st time in Jamaica or Mobay, but I must admit I am more impressed with the island as a whole than the resort itself. I stayed12/1/05 TO 12/4/05 Views were beautiful, and the people were the friendliest i've encountered on vacation. The price attracts a wide audience, but this resort is a 3 star.......just, so don't expect to much, and you will be fine. The food was ok nothing to write about, honestly. I fell in like/love at first site, but unfortunately my X-girlfriend bought the ticket to try to reconsile, so I was stuck with her, and she wanted to rehash every aurguement, but there was enough sun and fun to keep me from slashing my wrist and going swimming with the sharks. Anyway I think the eye candy (The resort is loaded with hotties) and friendly people made up for the issues, but if anyone knows the tall, athletic, woman that I couldn't keep my eyes off of may have just been my soulmate. PLEASE RELAY THAT I WILL MEET HER IN JAMAICA, ANYTIME, and I wish I could of made her aquaintance, but out of respect, and due to the fact everytime she came around, my x would give me a earful, I just couldn't. But the Island and that woman had to the most beautiful objects I may have ever seen. SSB thanks for the memories.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "December 5, 2005", "id": 4161594}, {"rating": 4.0, "title": "What a relaxing vacation!", "text": "My family and I just returned from Jamaica. We were there from Nov.22-29th. The Sunset beach resort was just wonderful. They have a beautiful water park just finished. They are doing many other improvements to the property. We had a garden view room which worked out great. We were away from all the hustle of the main part of the hotel. The food was yummy and my kids tried all kinds of foods they normally would not try. My kids are 9 and 10 yrs. old so we were able to give them walkie talkies. The beach was very private. No one bothered you to buy anything. We took a trip to Negril where the beaches were beautiful but the locals tried selling you things constantly. At Sunset Beach, the beach is totally private. There are no other resorts nearby. The employees are sooo nice and helpful. If you want an affordable vacation, were you and your family can travel and visit a beautiful island,this is the place for you.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "December 3, 2005", "id": 4159639}, {"rating": 4.0, "stay_parameters": "Stayed November 2005", "text": "After reading some reviews, I was apprehensive about our stay for Thanksgiving week. My sons (7 and 9), my husband and I had a great time. They are still doing renovations to the Inn pool and the Inn, but not too much disruption. The waterpark was a lot of fun. The food was very good in the buffet and the Italian restaurant and excellent in the Chinese restaurant. All of the staff - from the spa to the rec staff to the kids' staff - were great and very friendly.", "title": "Great Family Vacation", "helpfulness": 14, "user": "taco22", "date": "December 3, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 4159338}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "I had my hair braided and a massage in the salon - which was wonderful. The kids club is in a brand new facility and my kids had a blast. There is an arcade with \"free play\" so the kids could play in there after dark and during the rain.", "title": "Great Place to Relax with the Family!", "helpfulness": 17, "user": "beachgirl1011", "date": "December 3, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 4159306}, {"rating": 4.0, "title": "Loving Every Minute of It", "text": "We took the Marthe Rae River Rafting tour, which was nice - but pretty low key for the kids. We also went on the tour to the Croydon Plantation - a coffee and pineapple plantation where you have lunch and sample lots of fruits and learn a little about Jamaica culture and history. This was a great excursion and good so that the kids can learn a little something and can tell their teachers something about Jamaica besides how many times they went down the waterslides!", "helpfulness": 9, "user": "A TripAdvisor user", "date": "November 30, 2005", "id": 4154229}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "I used a Groupon for 66% discount, but the website is offering the same now.", "title": "Excellent for the price", "user": "Vicky S", "date": "July 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 166154653}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "My family of 4 went for 6 days for less than $1,000 US.!!!", "title": "Hated my stay..but the food was awesome", "helpfulness": 2, "user": "LilLadii71", "date": "July 2, 2013", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 166109422}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "The food on the buffet is average, but the beach BBQ is great and the italian restuarant outstanding.", "title": "about our stay", "helpfulness": 1, "user": "carol o", "date": "July 2, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 166089976}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "My kids had the best time! We snorkled and they spent many hours playing with friends in the waterpark.", "title": "Seawinds as was ....", "helpfulness": 1, "user": "Geoff H", "date": "July 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 166060250}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "Everyone was hlepful and friendly except the woman who cheked us in and told us nothign about the resort and the woman who took reservations for guest services.", "title": "Will definitely return", "helpfulness": 1, "user": "suncatcher1983", "date": "July 2, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 166023048}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "We stayed there from Dec.28, 2010 - January 3, 2011. The New Year's eve celebration was \"off the charts\"! The food was ok. Beaches were fantastic and the spa services were very good. The hotel could stand some renovations, but overall it was a fantastic trip!", "title": "Good time to be had.", "helpfulness": 1, "user": "rodesta", "date": "January 5, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 91877530}, {"rating": 1.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "After a week vacation at the Rui Palace in Negril we stayed at Sunset Beach due to an Air Jamaica flight cancellation. All I can say is this place is horrible. Lobby was pretty but that was it. Rooms were old and the service was terrible. Buffett was just horrible.", "title": "Sunset Beach Resort and Spa", "user": "charlie729", "date": "January 5, 2011", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 91834125}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "I would not recommend this resort, opps did I say resort, place to anyone. I cannot believe how bad the service was. Actually, now that I think about it there was no service.", "title": "worth a trip", "helpfulness": 1, "user": "kazz4662", "date": "January 3, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 91593217}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "The Rui Palace in Negril......now thats a resort. I highly recommend the Rui.", "title": "The BEST value resort in Montego Bay, Jamaica", "user": "RUBRONC", "date": "December 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 91039403}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "After a long trip (damm snow and ice !) we were pleased with the hotel, The staff were polite and helpful, and mostly friendly ! The hotel was not full which made for a more plesent stay, less noisey, The food and drink were great with lots of variety to choose from and plenty to go round. The hotel was clean and well presented, The activities were limited as they seemed geared to sport or for the younger clients. There were plenty of trips which of course cost more if not slightly expensive for what you got. If you do manage to go the weather was wonderful with the odd dull day and ocassional rain but again on the odd ocassion. I am glad i was able to go to this beautiful part of the world where there's never a problem only the odd situation! Remember if you go that most things revolve around the jamacian time which is at a slower pace then most sre used to and that what ever you do will require s tip somewhere along the line !!!!!!!!!!!!", "title": "Ok resort for the price", "helpfulness": 1, "user": "wmarti31", "date": "December 28, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 90953992}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "First of all, we planned the trip to attend a funeral in MoBay; however, when we called to add an additional person, we found out that the hotel was overbooked and planning to send us to their sister property in Ocho Rios. On any other occasion, this would not have been a big problem; but, it just wouldn't have made sense to have to drive so far when there were events to attend related to the homegoing service each day in Montego Bay. We then were on pins & needles wondering where we would stay until the last minute when the hotel advised they had a cancellation and would be able to accommodate us. Upon arrival, it took over an hour to get checked in! The room was ok; but, the food menu needs to be updated as it was also just ok. I was under the impression that the hotel had been renovated as it is listed as a 3 star; but it indeed could use a good sprucing up.", "title": "Did not meet expectations...", "helpfulness": 1, "user": "stcpat", "date": "July 5, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 166353214}, {"rating": 1.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "I always use Jamaica grande to spend my vacation but trust me this will be my last.i just got married on the 29th of june so me and my husband decieded to stick to the hotel that we are use to only difference is to go to montegobay branch this time.i live to regret it. worst this was my honeymoon.am Jamaican and my husband is America .I don't live there no more but I realize that if people aren't from foreign country they don't recognize Jamaican,and to me everyone is equal as long as your spending your money.the entertainment is bad because I remember one night,they were bigging up all foreign country and the entertainer ask is America in the house and people started to scream and Canadian ,but as this guy reached Jamaica in the house and a few started to scream he then said Jamaican go back to work I was so damn mad for that because he was an fool putting down is own country .am so offended even my husband was offended and he is American.this also happenen in sunset Jamaica grande in ochio but I let it slide but not this time,worst we had delay and we were suppose to reach to this hotel the Saturday afternoon but we came in the sunday morning so we missed out couple hours well 12 hours infact.and the day that we were to check out our flight was is the afternoon and we ask for a few hours 4hours ,the damn people told use no way because they have people waiting on our room,just imagine that we came here 12 hours because of delay and we were begging just a few hours back and they told us no,so we had to wait in the lobby for 4 hours until we were ready.i can tell sunset beach and sunset Jamaica grande this that they will never get a chance with us again.this hotel can go to hell.", "title": "a tirrible honeymoon ever", "helpfulness": 3, "user": "camille p", "date": "July 4, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 1.0}, "id": 166302839}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "If all you are looking for is tasty food, immaculate beach, and great views, then this is definitely the resort for you. But if you are looking for peace and quiet, a comfortable bed, or the full resort feel, you should probably look someplace else.", "title": "Great Food, Lovely Beach, Super Noisy", "helpfulness": 2, "user": "DestiniTheGreat", "date": "July 4, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 166288913}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Here is what we noticed on our stay. There are three restaurants, a \"beach grill\", and the Banana Walk buffet. You will be probably eat most of your meals at the Banana Walk, as you are only allowed to eat at the restaurants once a week, so within three days you have run out of restaurants. This is not the worse fate because the lunch and dinner menu are changed daily, while leaving some staples readily available. The food here is often quite delicious. It has some of the fare of your typical buffet while always providing you with something surprisingly good, if you have an open mind. The service here is pretty good with create-your-own-pasta bars during dinner and a very good omelet bar in the morning. The tomatoes and cucumbers at the salad bar are excellent. But the fruit often leaves something to be desired. The wait-staff here is very helpful coming quickly with coffee mugs or water or juice as you need it. While the food is delicious and the views are spectacular, don't expect to have a quiet meal here. There is always a child in some stage of breakdown and generally more than one. Also, there is generally a cacophany coming from the entertainment area which is adjacent, during lunchtime, it is whatever is happening at the pool, and in the evening, the \"entertainment\" is an absolute din. If you get to experience the restaurants, which are generally much quieter, the \"Asian\" food is completely forgettable, but the Caribbean and Italian restaurants are delicious with an excellent staff. You won't be able to completely skip the Beach Grill, so have the jerk chicken. It was delicious and tender with a great, spicy sauce. The french fries are very good there, but everything else is at best... odd.", "title": "not to great", "helpfulness": 1, "user": "Trianne Y", "date": "July 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 166284400}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "The beaches are actually wonderful. During our stay, there was always a beach chair available in varying states of shade. The beaches on either end were quiet. With the quietest, by far, being the \"au naturale\" beach at the furthest end. Of course, to be there, you have to be au naturale, but it might be worth it to you to buy a little bit of respite from the noise. There is snorkeling with not too much of a wait. Even the free version was pretty great. My teens had fun with the paddleboats and kayaks which were always pretty well available. They tout a \"waterpark\" but what they mean is a very, large shallow pool, two waterslides that close at 6pm, and a lazy river. To bear this, you have to be in the areas most highly concentrated with children, but that is to be expected.", "title": "Disappointed...", "helpfulness": 3, "user": "Tanya N", "date": "July 3, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 166198944}, {"rating": 4.0, "title": "Brilliant holiday cannot wait to go jammin again !", "text": "Read the reviews about the Sunset Beach before we went and was a bit put off ! We are a group of english who stayed at the hotel from the 26th Dec 06 to 09th Jan 07 and it was brilliant !!", "helpfulness": 9, "user": "dona1667", "date": "January 19, 2007", "id": 6622118}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "Our group ranged from fifteen year olds, twenty year olds and up to nearly seventy year olds and we all had a good time.", "title": "Great Place to Relax", "helpfulness": 16, "user": "FloridaMember", "date": "January 17, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 6612037, "likes": {"liked": "— all inclusive resort", "disliked": "— don't expect a 5 star resort and you won't be disappointed"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "Food was fine no problems what so ever always some where open to eat, the two restaurants where you have to book, Chinese and Italian where very nice but would advice to book asap as a bit hard to get into.Drinks were fine - yes in a small tumbler but never no queues at bar so hey mon no problem !", "title": "The best place ever", "helpfulness": 6, "user": "wayna413", "date": "January 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6598660, "likes": {"liked": "— The friendly atmosphere", "disliked": "— Nothing, it was all wonderful"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "Entertainment could have been better i have been use to more lively entertainment in the evenings but it was still ok - the Elvis impersonator was brilliant.", "title": "Great time, great place, bland food", "helpfulness": 14, "user": "AngelsWatchOverMe", "date": "January 14, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 6596371, "likes": {"liked": "— The Water Park and pools", "disliked": "— The food was edible, but not much more"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "New Years Eve was really really good the best New Year party i had ever been to.", "title": "Had a wonderful experience...", "helpfulness": 14, "user": "melody2007", "date": "January 11, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 6575090, "likes": {"liked": "— the ocean front views", "disliked": "— faucets are old its hard to get correct water temp."}}, {"rating": 5.0, "title": "Yah Mon, it's all about Sunset!", "text": "Wow! This is THE place to live in Jamaica. Note, that I wrote Live not Stay, because you can really set-up camp and feel at home at Sunset!", "helpfulness": 31, "user": "A TripAdvisor user", "date": "July 21, 2005", "id": 3690881}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "This is a pretty long review but be patient with me......", "title": "Good Value for your money", "helpfulness": 11, "user": "Schaeb1320", "date": "July 17, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 3675872}, {"rating": 2.0, "title": "Good not Great...needs some work", "text": "We arrived at Sangster Airport after dark, and our lovely driver Craig gave us a quick run-down in the 15 minute journey on what's hot and what's not in Mo'Bay. And top of his list was Sunset Beach Resort, as HOT! Driving through the 'Hip-Strip', home to Mo'Bays bars, we passed through the Bay. Cruising past other resorts packed on top of one another, ones with corporate names best left unwritten, we headed towards some lonely looking tower blocks which was Sunset Resort.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "July 13, 2005", "id": 3662881}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "After verifying out details with security, we passed into the Resort, checked in and within 5 minutes we were in our rooms. I pulled back my balcony door and couldn't see a single light on out in the dark. I thought this was strange and assumed it was because I was facing a big blank wall.", "title": "Great for those on a Budget!!!", "helpfulness": 20, "user": "NMurphy", "date": "July 13, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3662753}, {"rating": 4.0, "title": "Get what you pay for at Sunset Beach Resort & Spa", "text": "Instead we ran down to the buffet restaurant to grab a quick bite to eat, and chug-down the first of many Jamaican rum specials! And as that was ongoing, a live band started up right on the beach! In my four day stay at Sunset, nightly entertainment included steel bands, dj dance contests, the live band with an amazingly talented singer who had us all singing along and my highlight, a Marley tribute band. These events were held on the beach or underneath the main canopy area, which was an outdoor patio type area surrounding two pools, that were decked out in really comfortable sofa loungers. There was also a nightclub, and more areas to kick-back and continue drinking after all the family-orientated entertainment was over (usually by 11pm).", "helpfulness": 32, "user": "A TripAdvisor user", "date": "July 12, 2005", "id": 3661793}, {"rating": 4.0, "title": "Loved Sunset, great vacation - will return. Snorkeling was breathtaking", "text": "I just returned from a fabulous trip to Sunset the week before Christmas. As many others have mentioned, ignore the negative reviews! The scenery is absolutely gorgeous and the staff and activities are great. The hotel is actually just next to MoBay, in Freeport. The resort is situated on its own little peninsula that sticks out into the ocean and is surrounded by great views. The beach is absolutely great and very well groomed every morning.", "helpfulness": 45, "user": "A TripAdvisor user", "date": "December 29, 2005", "id": 4309719}, {"rating": 4.0, "title": "Experienced traveller's opinion", "text": "My fiance and I absolutely LOVED the snorkeling. The friendly watersports people will give you snorkels and flippers and there are two HUGE reefs only about 300 ft off the beach. I snorkeled almost every day and you are literally inches from the corral. Unbelievable fish, lots of colors, and even a few conch shells. The shell I dove for had a critter in it so I left him there :)", "helpfulness": 33, "user": "wilmapais", "date": "December 15, 2005", "id": 4244788}, {"rating": 5.0, "title": "Most Relaxing, Exciting Time Of Our Life!!!!!", "text": "Overall Sunset Beach is a GREAT deal for your money and I FULLY intend to go back to Montego Bay and stay there again. The location was much better than some of the more expensive resorts located in \"Montego Bay proper\".", "helpfulness": 34, "user": "A TripAdvisor user", "date": "December 14, 2005", "id": 4243078}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "There was some construction going on while we were there (mostly cememnet work), but it did not detract from our experience, and everything was open the last couple days of our stay. This may not really be a problem for future visitors as it seemed to be wrapping up.", "title": "Wedding at SSB Dec 3-10/05", "helpfulness": 19, "user": "KathyJ", "date": "December 12, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 4234275}, {"rating": 3.0, "title": "Great value and tons of sun", "text": "If you have kids (which I don't) - they will love the waterpark. This is a very family-friendly resort. even though we are 24 and 25, we went down the slides a number of times and floated along the lazy river with our pina coladas.... Some reviews do mention the au natural beach, which is at the far end of the resort and not widely used. Do not worry if you have kids, they are kept far from that area and guards stand on duty to ensure that the kids don't wander that way.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "December 5, 2005", "id": 4163052}, {"rating": 4.0, "title": "My favorite in montego bay was sunset beach all inclusive", "text": "The rooms were nice and the staff friendly . The food was exceptional because you were able to have jamaician food which reflected one of the delights of the island, although they offered a wide aray of other menu's. My son enjoyed the teen club because he was able to do activaites with with other children his age. He developed friendships from this club which also added to the holiday. We will visit sunset beach again as we found it was good value for money.", "helpfulness": 9, "user": "rogerjohnson", "date": "December 30, 2006", "id": 6519866}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "The grounds were actually pretty nice but if you're looking for the singles crowd, do NOT come here. The waterpark should give it away. Hotel rooms were adequate, food was adequate, drinks were OK and service was adequate. At no point was I wowed by anything but if you can get a good price, it is an ok place to stay I guess. The activities were a bit kitchsy and Sesame Streetish. Probably great for young children.", "title": "Definition of 3-star", "helpfulness": 4, "user": "Deedubz", "date": "December 28, 2006", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 6509738, "likes": {"liked": "— Lot of space on the resort", "disliked": "— Too familyish"}}, {"rating": 5.0, "title": "We were really on vacation Mon!!", "text": "If you have kids, this is the place to stay!! We were travelling with a 1yr girl and a 11yr old boy, and they absolutely loved it. Our son couldn't beleive all he had to do from morning till night and it was all free!!. We would have breakfast together and he was off to the water slides, snorkeling and meeting other kids!., we would see him for super and then off again to the arcade at night!! Our daughter decided she liked puting her food on the ground that week and we were worried about the mess she was making on the floors and as I started picking up the food she tossed around, I was quickly stopped and told that I was on vacation and no problem, we will take care of it for you!! Always with a smile, no worries Mon, this is your time...WOW!. A special hello to Nidia in the buffet (sorry, hope it's spelled ok!), she is great and very helpful as well as Troy. Everyone is great really. We had fun with Carlos at the grill bar and Kenroy and Richard at the discotheque are sure to make you laugh. We had to go back another night just because they were so likeable and funny!!! Thanks for that!!", "helpfulness": 19, "user": "jean.stpierre027", "date": "December 27, 2006", "id": 6503633}, {"rating": 3.0, "stay_parameters": "Stayed November 2006", "text": "I was very worried about the milk for our daughter and called the hotel prior to arrival and spoke to Ray at the concierge desk, he actually went to ask the chef and called me back in Montreal to avoid the long distance phone call to assure me, no worries and everything will be alright. And made sure our room was in the more quiet area of the hotel... What great service!!! Thank you again Ray!!", "title": "A nice trip", "helpfulness": 8, "user": "am7cpa", "date": "December 25, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6495829, "likes": {"liked": "— hospitality", "disliked": "— unheated pools"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We also sent our baby to the babysitting services and they are wonderful with infants, contrary to what I read, they will watch carefully over them with a 5$ an hour fee, but it's really worth it. She loved it, gave her a break from the sun and the big kids were able to bask in the sun and just take time out for a couple of hours...everyone is content!!", "title": "Wonderful!", "helpfulness": 7, "user": "smilesboro", "date": "December 24, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6491004}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "My husband and I vacation every year for our anniversary. I read reviews of this hotel before booking and was a little concerned. However this was the best trip yet. The hotel was clean and easy to get around. The grounds were well kept and beautiful. They originally put us into the towers. However the first night we found this to be a little noisy due to the band playing just outside at night. We requested to be moved away from the activities for a little more peace and quiet. At first it was like pulling teeth, but after getting them to understand that this was our anniversary and I'm sure the fact that I was a travel agent didnt hurt either. They gave us a garden room in the west wing. This room was great. The food was always fresh and delicious. The drinks were plentiful. The staff at the customer service desk were the best. The beach was very rocky though. So here are my tips: 1. If you want quiet-request the gardens 2. Bring cash-the atm charges US $6.00 fee, 3. Only one restaurant is walk-in - The other two take reservations- Book well in advance.- perhaps even before arriving. / When shopping in town- hangle hangle hangle-- they will lower the prices. Have fun.", "title": "Great Anniversary Vacation", "helpfulness": 15, "user": "ReaV", "date": "January 10, 2007", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 6572828, "likes": {"liked": "— Great Food and Drinks", "disliked": "— Front desk staff not to friendly"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007", "text": "Sunset Beach in Montego Bay is an excellent hotel. The waterpark was mega fun! The free arcade, the food, the people, the spa, the bar...EVERYTHING!!", "title": "WONDERFUL HOME AWAY FROM HOME", "helpfulness": 16, "user": "klee0915", "date": "January 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6560072, "likes": {"liked": "— Location - only 10 mins from airport", "disliked": "— Late night band under my window"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "I travel to JA 2x year and Sunset Beach is always my first choice. The have a returning guests reception where they have a special display of food and drinks to include free champagne. Very special.", "title": "Great Place To Stay", "helpfulness": 20, "user": "Tinkgerbil", "date": "January 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6546406, "likes": {"liked": "— Waterpark", "disliked": "— n/a"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "Kid friendly!!", "title": "Excellent Family Choice; Something For Everyone", "helpfulness": 29, "user": "ColleenieWeenie", "date": "January 1, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 6533303, "likes": {"liked": "— Lots to do, beautiful scenery, nice beaches, good food", "disliked": "— Bring your own insulated mug, diving mask and snorkel and watershoes!"}}, {"rating": 1.0, "title": "Alcohol for Children", "text": "Very nice relaxing wicker beds in the lobby, an excellent place to nap if it rains. The cross breeze is magnificent!", "helpfulness": 4, "user": "double_d24", "date": "December 31, 2006", "id": 6527166}, {"rating": 3.0, "stay_parameters": "Stayed December 2005", "text": "Ok, Sunset Beach has its pros and cons. So, for the pros:", "title": "It Depends on What is Important to you....", "helpfulness": 14, "user": "NicoleandKyle", "date": "January 5, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4326875}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "*Very nice pool system and waterpark. Pools are clean with plenty of lounge chairs and ready for the lounger or active volleyball player.", "title": "Another positive experience", "helpfulness": 24, "user": "bluezdoc", "date": "January 2, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4317170}, {"rating": 4.0, "title": "Nice place for relaxation and fun", "text": "*Amazing kids club--I don't have kids but made friends with a couple that brought along their 10 year old and she LOVED it. Couldn't wait to go back every day.", "helpfulness": 28, "user": "A TripAdvisor user", "date": "January 1, 2006", "id": 4316037}, {"rating": 3.0, "title": "Enjoyed the trip but would stay at another resort next time", "text": "*Lots of stuff to do--not that we took advantage of it because we were having a lazy vacation, but there is shuffleboard, multiple tennis courts, mini golf, plenty of games and books to check out, etc", "helpfulness": 12, "user": "A TripAdvisor user", "date": "December 31, 2005", "id": 4313792}, {"rating": 5.0, "title": "lots of run great place for adults and kids", "text": "*The entertainment was actually awesome. I've been to a bunch of all-inclusive resorts where the entertainment was cheezy and boring. Amazing singers, fun with karaoke, and great bands. Absolutely so much fun for dancing or just listening to great music", "helpfulness": 19, "user": "A TripAdvisor user", "date": "December 30, 2005", "id": 4312110}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "I had a girls trip for my 30th birthday and could not have been more impressed with this resort. It is extremely secure for those who may be worried about such details.", "title": "Will definitely return", "helpfulness": 1, "user": "suncatcher1983", "date": "July 1, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 165958690}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "From the time I checked in to the time I checked out the staff could not have been more proffessional and kind. I has a wonderful experience with Marlene and Carlene. I believe Carlene is one of the managers. She went out of her way to contact a restaraunt in town for me to see if they had a specific dish I wanted.", "title": "Has 4 Star Potential", "helpfulness": 3, "user": "alfaspiderman", "date": "July 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 165907630}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "At the excursion desk I had a wonderful experience with Arnese.", "title": "Made a lot of new friends stay for 13 days & would go back", "user": "Mary S", "date": "June 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 165815795}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "I was there for pleasure but also to check out the scenery for my brother and sisyer in law who are travel agents. They are actually booking someones vacation to jamaica as i type and i highly recommeded they have the client stay at this resort.", "title": "fun with family", "user": "lcsjj0915", "date": "June 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 165769911}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "A great thing also about ataying here is they have ahuttles to the hot spots wh i ch save alot of money aince the local cabs do kind of extort tourists. One cab driver was telling another local they got 90USD from a group of four just to take them from margaritaville to their resort. I feel that the free shuttles the hotel provides are an excellent perk.", "title": "Would definitely go back!", "helpfulness": 1, "user": "cjc207", "date": "June 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 165685118}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "We spent a week in heaven! Great food, nice rooms, good entertainment all week long. The staff was more than efficient and was plentiful if there ever was a need to ask anything. They were all polite and friendly. The ammenities were good and the multiple types of beaches were great for activities from snorkelling to sand castles and family fun water park to clothing optional and nude beaches. I would recommend this resort to anyone, especially those with a family. The value and experience is outstanding for the cost. Nestled between Ocho Rios and Negril, all tours and outside excursions are nearby and deep sea fishing is a 2 minute ride to the marina. We will be back.", "title": "Absolutely Wonderful!!!", "user": "TrueLeaffan", "date": "January 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 93109694}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "Jamaica, NO PROBLEM!", "title": "Good bang for your buck.", "helpfulness": 2, "user": "Red3071", "date": "January 14, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 92958931}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "This all inclusive property is a great value for your dollar.", "title": "Very nice resort", "helpfulness": 2, "user": "wvuengr12", "date": "January 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 92576121}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Just stayed 5 nights with a bunch of friends. We had a great time, the resort was very well maintained and clean. The food was very good and they had a nice selection. The bar tenders made the drinks well although they wouldn't make many drinks such as a long island, hurricane, or dirty martini. They would just say no when we would try and order these. I rated service a 3 but this is mainly b/c of the bartenders giving our group attitude. Everyone else at the resort was very friendly and helpful. The bartenders seemed to hate life. So we stuck to very very simple drinks.", "title": "wow", "helpfulness": 3, "user": "blazinbrownsugar", "date": "January 11, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92573928}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "We stayed in the beach wing that is two stories. The rooms were old and in need of updates. Our A/C worked but made noise that would wake us up at night, another one of our rooms the A/C couldn't get the room below 70°F. The hot water for showers was vertially non existent between the hours of 4:00-7:00pm, my guess is everyone was showering for dinner and their tanks couldn't supply enough water. The rooms were old but they were at least clean. The beds were not comfortable and might be the worst beds I've ever slept on. But we all still got plenty of sleep, so not a big deal.", "title": "A real 'family show'", "helpfulness": 4, "user": "FamilyfromTO", "date": "January 10, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 92471221}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "hotel rooms need serious upgrades, the night activities and daytime poolside activities were amazing. the activity crew, kenijah and friends were first class bunch. they made our stay enjoyable. the sushi chef in the asian restaurant was outstanding. kevin campbell in the buffet, maurice at the tour desk and mr webb went out of their way to make sure we had a great time. the rooms need to be upgraded. they were small and old. swiimming pools were cold. beach waqs very nice. once again the staff from the waiters,bartenders and chefs were the best. need to accomodate more food for children since this resort caters for families. need a better gym", "title": "the staff and service at this hotel were outstanding", "helpfulness": 2, "user": "andysingh", "date": "January 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 1.0, "location": 5.0}, "id": 92349991}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "This being our first Carribean vacation with our children (7yr & 5yr old girls) my wife and I hoped it would be a positive experience for them. Sunset Beach Resort was a fantastic destination for my family. We all had a great time and were sad to leave. The customer service our family received was what we would expect from a tourist resort. All the staff that we had interaction with were very friendly and made a point to acknowledge the kids with great big smiles and \"how are you today my beautiful lady friends\", \"Are you having a good time\", \"Is there anything I can get you\". Craig (pool & main bar) & Damain (the \"cat man\" from the buffet) come to mind as the kids favorite personalities. There were many activities for us all to participate in.", "title": "Great family Vacation at reasonable expense", "helpfulness": 4, "user": "daka155012", "date": "January 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 92117137}, {"rating": 3.0, "stay_parameters": "Stayed January 2011", "text": "The food at the buffet was excellent with a variety that any appetite would enjoy. The restaurants (Carribean, Indonesian & Italian) were excellent as well with the Italian being the family favorite.", "title": "I'm staying here now and getting married here next week and so far have not received the guaranteed room we were promised", "helpfulness": 1, "user": "Brigid79", "date": "January 6, 2011", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 1.0}, "id": 92029530}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Lot's of water at this resort...many pools, waterpark slides, hot tub and lets not forget the ocean. The main beach was a great place to spend the day in the sun. It was clean, the ocean was clear, the sand was soft and the kids met many friends to swim with and build sand castles. The girls had their complete hair braided at the spa (at a reasonable cost) and after 4 weeks still looking good.", "title": "Relaxing Stay at Sunset", "helpfulness": 3, "user": "funinthesun5", "date": "January 6, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 91996415}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "The evening entertainment was very good (obviously some shows better than others). I would say my favorite was the band that played in the main lobby area on the Friday night. Good tunes! The Disco Bar was a nice place to have a couple of drinks and catch up on sports scores. The manager and his staff (embarrassing that they remember your name all week but you can not remember theirs) were fun to talk with.", "title": "Loved it", "helpfulness": 1, "user": "lvanor", "date": "January 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 91976957}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "This resort is 15 minutes from the airport with a great view of the cruise ships coming and going as the cruise port is not far away. The Sunset allows you to go online and prebook your amenities, online checkin and this is your opportunity to let everyone know your dietary needs, special requests such as mobility issues and more. This is a great feature. There are 430 rooms with two towers(6 levels each) with an elevator and an east and west buildings that are two level walkups.", "title": "Sunset Beach is great value.", "helpfulness": 8, "user": "wnethercott", "date": "July 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 166592773}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "I stayed in a king room in sunset A tower and wow. Room was clean, bathroom was huge, bed was comfortable and I had a great view of the ocean and the beach area of the resort. The only oops is that the safe in the room is still a key lock that you have to get from the front desk and it is not very deep so it will not hold a laptop. This needs to be addressed soon, as we all travel with laptops to keep in contact with home or office. Also the convenience of a computer lock means no lost keys or locks...I also suggest to clients that travel to put their prescription drugs in the safe for their piece of mind. There is also no fridge in the room or even a bottle of water. There are fridges on request if there is a need for medicines or baby in the room.", "title": "Good price on a budget", "helpfulness": 1, "user": "Ms P", "date": "July 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 166563201}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "There are 4 pools on the property. One is a waterpark with a zero entry area for the little ones to get in, waterslides, lazy river, etc. for the young and young at heart. One of the pools is a swimup .The main pool which is also where you get your towels is the main activity area zone. The beach is long and narrow, with the sandiest with the least amount of seaweed being the far end from the towers. There is a bar at that end as well so made getting beverages easy. Lots of lounge chairs and shade if you wanted it. The resort was full when I was there so that speaks highly for the resort. The resort has snorkelling gear available for use, along with kayaks and more. enjoy the water", "title": "Nice resort,but food was not so nice.", "user": "lucinda t", "date": "July 5, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 166454362}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Kids Club is called Club Mongoose for ages 4 to 12 and is open from 9 to 5 and 7pm to 9pm. One of the few that has an evening program. There is babysitting available for younger children for $5/hour thru day and $10/hour after midnight. this needs to be prebooked. There are 6 staff at all times and standby staff on call when numbers require it. All staff are certified and can meet most needs. There is also a Teen club that is open from 10am to 10pm. Staff is at teen club as well.", "title": "Great Food, Beach and Staff", "helpfulness": 2, "user": "Lokey_41", "date": "July 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 166403766}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Wifi is available to all guests in the lobby. Guest relations is here as well to book your a la cartes, off site excursions and more. There is a notice board just as you enter the buffet area from the lobby that lists the activities for the day. They have a theme night every nights. Bonfire Beach Party every Tuesday night. The sports bar is also the location for their slot machines and is their disco after 10pm. There are designated smoking areas thruout the resort. Watch for the signs. No smoking in the rooms please.", "title": "Pictures available of Resort. Very dirty and not Maintained", "helpfulness": 4, "user": "Tammy H", "date": "July 5, 2013", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 166389360}, {"rating": 4.0, "title": "o.k. for a quick,reasonably priced get-away", "text": "I've been to Sunset Beach two times and am going again in November. Have been to Sandals and have also rented private villas on several occaisions and while Sunset Beach is not as fancy as some of the high-end resorts, you can still have a great time there. The rooms are definately a little dated but who spends time in the room anyway. The food is o.k. By the end of the week you'll be getting tired of it, but you'll never get tired of the beautiful water and weather. The beach is not as nice as 7mile beach in negril, but that's almost a 2hour ride from the airport. If you're going for just a few days it's not worth the ride back and forth.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "September 26, 2004", "id": 2602082}, {"rating": 4.0, "title": "Great experience in Jamaica!", "text": "My girlfriend and I visited this resort in March of this year. After reading tons of great reviews, we decided to go for it.", "helpfulness": 2, "user": "drew4392", "date": "September 24, 2004", "id": 2597138}, {"rating": 4.0, "title": "I enjoyed my stay", "text": "Property: Pretty nice. Clean. Well maintained. Nothing seemed to be neglected. I mean its not a 5-star amazing, oh-my-gosh property, but it is nice.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "September 22, 2004", "id": 2592183}, {"rating": 5.0, "title": "Sunset Beach was awesome!", "text": "Rooms: Clean. Larger than I anticipated. View was incredible. We had the oceanfront. Balcony. Bed was comfy.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "September 22, 2004", "id": 2591832}, {"rating": 5.0, "title": "Absolultely unbelievable!!!!", "text": "Food: The restaurants were AMAZINGGGG!!! Great food. Excellent service. The breakfast and lunch buffets were decent. I mean, I was fine, but my girlfriend didnt like it much. Oh, and I loved the fact that I could go down at 1:30AM and order a grilled cheese sandwich and fries at the snack bar.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "September 20, 2004", "id": 2587628}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "Like everyone you really look forward to your vacation..I wanted to think that some reviews were just way too harsh yet after going there I found most to be true. The food is pretty bad there. The best meal is breakfast... Lunch and dinner are always the same. As for the restaurants they are not that great either... and you need reservations.Also, bring your own snacks as there are none to be found there...Swim up bar was cool but only open till6. pool itself open till 12 Yes you have the beach grill but there are only so many hamburgers hotdogs and grilled cheese you can eat... The jerk chicken though is very good, but again, how much can you eat... The ocean is rather difficult to swim in some spots of coral come up very high. I highly recommend Doctors Cave you pay 5 bucks to get on beach but it is very beautiful there and you can swim in ocean. they even have trampolines you can swim out to.. There are no refrigerators in rooms making it difficult to have something cold to drink in your room... We stayed on 10th floor in tower B which had a great view. Felt sorry for people in other buildings as lots of banging going on to finish water park. (supposta be done in 4 weeks) the airline was not very careful with luggage either... luggage ripped and contents missing.. I may go to Jamaica again, but doubt I would stay at SSB.", "title": "fair at best", "helpfulness": 2, "user": "debbie1Delaware", "date": "August 20, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 3793201}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "We went to Sunset Beach from 6/25/05 thru 7/2/05. We loved this resort and had a wonderful time. Overall for the value it is definitely worth it. I loved the location. It was away from the center of town and all the hubbub. Some hotels were right in the center of all that. Bottom line on these resorts.....it's what you make of it. You can find something wrong with every resort if you really want to. The only down side at all to me, was the Resort/rooms could use some updating & the water park wasn't finished even though it was supposed to be when I planned the trip. Oh well, I'll have to go back once it's complete:):)And how much time do you really spend in your room?? I was glad that I chose an Oceanfront room. The view of the Sunsets, Ocean, etc was fabulous. Worth the extra money. We took the horseback riding excursion (thru the blue mountains & the Ocean) & the Catamaran/snorkeling trip. We enjoyed both immensely but also enjoyed just hanging out at the resort & relaxing. I'm glad we only planned 2 excursions so we could enjoy the resort also. I loved the Open Air lobby. They have a bar & entertainment going on most of the time in there. A lot of people complained about the food but we thought it was pretty good. I'm not sure what people expect. I guess you can't please everyone. The Italian restaurant was absolutely wonderful. Our food was outstanding, from Appetizer to dessert. We didn't try the Asian restaurant because we really don't care for the style of food. This was my 1st all-inclusive trip so I don't have anything to compare it to. I'm going to Punta Cana next year so I can compare:) I think the all-inclusive idea is wonderful & wish all trips could be all-inclusive. All in all we loved Jamaica & look forward to going back someday. Hopefully soon!", "title": "Great Vacation", "helpfulness": 7, "user": "Phillykathy", "date": "August 18, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 3786644}, {"rating": 5.0, "title": "Absolutely loved this resort!!!!!", "text": "I had the pleasure of going to Sunset Beach in July for days. This has been the best trip that I have been on. I have been to Germany, Mexico, Canada, and Bermuda. Jamaica tops them all. My experience in Jamaica is one that I will never forget. I will start from the beginning so bear with me.", "helpfulness": 18, "user": "A TripAdvisor user", "date": "August 13, 2005", "id": 3759282}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "AIR JAMAICA!!!!!!", "title": "Great place to spend the day", "helpfulness": 13, "user": "Cruise,J.D.", "date": "August 12, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "service": 5.0}, "id": 3757157}, {"rating": 1.0, "stay_parameters": "Stayed August 2005", "text": "Never again will I fly Jamaica. Air jamaica is the worst air line to book a trip with. It all started when I received a call from an Air Jamaica rep at 1:41 am. I was being informed that our flight was going to be delayed for 4 1/2 hours. We were originally supposed to depart Baltimore, MD at 8:30 am. Instead, we were now going to be leaving at 12:50 pm. I thought, \" No Biggie!!! Thinga happen.\" Well, once we got to the airport, things went smoothly. We boarded the plane and took off at 12: 50pm. However, we were in the air for 7 minutes, when the pilot announced that he was returning to Baltimore due to a malfunction with the plane. I thought, \" OK!! It is best that we return to Baltimore, than to be caught over the Atlantic Ocean with no cabin pressur.\" We landed, and sat on the plane for 3 hours. I could not believe Air Jamaica. They would not let us off the plane. They served us food and we were allowed to watch televsion. That was it. Once they figured out that they could not fix the plane, they put the entire plane up in a hotel at the airport. We were then told that our flight would be departing at 11:00pm. At this point, I was LIVID!!!!! I could not believe that I would be missing an entire day because of a plane malfuntion. To make matters worst, once we get to the hotel, we were then informed that our flight would not be departing Baltimore until 1am. I did not get mad, I just went to the bar like everyone else, and had a couple of drink! lol! 1am rolls around and we were told that our flight would not be taking off until 3am. Yes!!!!!! 3am. A whole day gone, and Air Jamaica was making this a vacation from hell!!!!!", "title": "Never Again", "helpfulness": 8, "user": "TaJye15", "date": "August 10, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 2.0}, "id": 3751872}, {"rating": 4.0, "title": "Good Deal for the Price", "text": "I have been to Sunset Beach twice and the experiences were a little different (once in July 04 and once in Juky 05). The first time, my room was nicer because it was in a renovated area. The second time the room wasn't quite as nice, but it was reasonable for the price. The staff was great each time and was always friendly and accommodating (you MUST check out the spa!) The food was good, especially the grill which stayed open until 1 AM. The portions in the restaurants seemed small for our American huge portion tastes, but were fine; everything else is buffet.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "November 29, 2005", "id": 4152618}, {"rating": 3.0, "title": "2nd time for couple in early 30's", "text": "The water sport staff can vary. Some of them are great, and then there are the others...Take some time and scope out the one you want so you're not disappointed. Also, if you want to purchase souvenirs go into town. You can get more items for less. If you've come for nightlife, you'll need to go into town. If you've come to relax, again---Check out the spa. I had a massage, body scrub, and pedicure. They were all wonderful and well worth what I paid.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "November 26, 2005", "id": 4145251}, {"rating": 4.0, "stay_parameters": "Stayed November 2005", "text": "As for the bugs...during my second visit there, my friends and I were 'attacked' by a swarm of gnats. From speaking with someone who visits regularly he said that some days you will see more bugs than others if the exterminator (for lack of a better term) has not sprayed. That made sense because I only experienced that one time.", "title": "Decent Place", "helpfulness": 15, "user": "Sunsurfsand", "date": "November 26, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 5.0}, "id": 4144434}, {"rating": 4.0, "stay_parameters": "Stayed November 2005", "text": "I have stayed in all types of hotels and I would have to say that this one is very reasonable for the money because I've stayed in some 5 stars that were about the same.", "title": "Good value for money", "helpfulness": 8, "user": "HelenBygrave", "date": "November 25, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4142763}, {"rating": 4.0, "stay_parameters": "Stayed November 2005", "text": "this was our 2nd time to ssb in 13mo. the first time we were very pleased.we stayed in the garden view rooms wich were nice enough and very quiet. we basically hung out on the beach and at the pool and just totally relaxed. we took one shopping tour that was ok but nothing special. the shop keepers were just down right annoying and too aggressive. litterally pulling you into their store. we bought a few doo-dads but didnt find any great deals or anything super special.(except blue mnt coffee) maybe because we live so close to NYC's diamond district the jewlery didnt phase us a bit.the food at the resort was o-k. again nothing over the top but you can always find something and walk away too full!!if you get a chance try the boat house grill down the street awsome food!(free taxi)!so! the second time.. we did lots of research and found most reviews were the same for different resorts around jamaica, ssb had pretty consistant ones though. we opted to go back because you cannot beat the price and we really did have a great time last year.we stayed in tower A with a bay view.. not bad.. not ocean but not bad. but we were hoping to do a little more touring this time. we were dissapointed to find that it was really hard to get to the major attractions of jamaica like y.s falls and dunns river because they are about 2hrs away and you had to have at leaste 6 ppl to get a trip going. the geust relations desk was not good at keeping sign up sheets at all... i mean they were supposedly in the busy season so surely we could not have been the only 2 ppl there who wanted to do trips... we did get to go horse back riding and that was fun..i just happend to get a lazy horse with lots of GAS!!!ugh! poor ziggy!dont get rooked into buying water shoes or $10 bug spray.. you wont need any of it. i was taken back that we were basically robbed of about 35$ for supplies\". anyway the next time we visit jamaica we will stay closer to the things we want to visit. because even a 5 min .(no exageration) cab ride down the street will cost you 20 there and 20 back so you really cant venture off by your self. as far as the construction... we really were not annoyed by it... and it's better that they rennovate.. and there really isnt any \"good \" time for them to do so... just close your eyes to it and it's not like they work all night long... the rooms were clean enough as i said.. and i have stayed at really nice 5 star hotels... you can always find something wrong there too.. it's a hotel..you are not there to hang out in your room all day anyway!! and for those of you who complain about the furniture being old bla bla bla...would YOU have made sure you didnt lay your greasy lotion bottle down or let your frosty drink melt all over if there were really nice furniture? probably not.. lighten up you should have had a few more! the beds were clean the bath was clean the towles were hard yeah but they sure use bleach wich is good enough for me!over all i recommend ssb if you are looking for a relaxing get away for relativly cheap.we will definatley go back again after we check out other parts of the island and we'll bring our little guy too.. the water park was nice for little ones and grown ups too. bring some singles because the staff does appreciate tips. ya gotta check out the au natural beach!you can byob if ya want.. drinks are not top shelf. oh and dont fly american... air jamaica rocks!", "title": "Wonderful Resort", "helpfulness": 5, "user": "FLSydney", "date": "November 22, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 4138323}, {"rating": 4.0, "title": "Great trip!!!!!", "text": "We visited Sunset Beach from 9/27-10/01/04. I would have loved to stay another week! I have to admit I was skeptical after reading a few poor reviews. We had an oceanfront room with the most spectacular view, the sunsets are truly magical to watch. My husband and I felt the food was fine, and we both enjoyed the specialty restraunts. I recommend water shoes for the beach, but the pools are lovely. The entertainment was a real treat, the entire staff here goes the complete extra mile to do whatever they can to make your vacation memorable. We met alot of very nice guests, including a terrific Irish couple from New York. We had to wait a few hours at check in. The desk help could benifit from some customer service inservices, I truly believe the effort would not be wasted here. The spa staff is quite professional. I got the best massage of my life (Denise), very skilled! We went on several excursions, I liked horse back riding the best, Dunns River Falls is nice, but the two and a half hour drive is too exhausting and takes up an entire precious vacation day. Overall, this trip was the best travel value ever, it is not the Royal Towers at Atlantis, but it also cost a third less. We can't wait to return.", "helpfulness": 2, "user": "nurseadjenn", "date": "October 9, 2004", "id": 2663541}, {"rating": 3.0, "stay_parameters": "Stayed September 2004", "text": "Well what can I say about this resort, we arrived after a 9.5 hour flight the reception staff was as cold as the weather we left behind in England no smiles, no greeting 'nothing' we found the that most of the women staff was unfriendly, cold and rude they would never say goodmorning to you unless you spoke to them first and even then they would look at you like something they picked up on the bottom of their shoes, I have been to so many countries and never yet have I seen such an unfriendly set of staff, having said that the male staff was much better. The rooms! well pretty basic, the food ok, the resort very nice, the worst thing about this hotel is its female staff what a let down they are in urgent need of a 'customer service course' the sooner the better", "title": "RUDE, RUDE, FEMALE STAFF!!!!!", "helpfulness": 2, "user": "Elessia", "date": "October 8, 2004", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 1.0}, "id": 2649799}, {"rating": 4.0, "title": "Awesome!", "text": "Awesome! I had a wonderful time. From the ride from the airport and everything in between. The service, the food, the people, the hospitality was wonderful. Lots of activities throughout the day and night. Most unusual was the crab race...like betting on the horses. Favorite part of my trip...jet skiing. For a person that doesn't swim I had a blast and would recommend it. Sunset Beach Resort & Spa will definitely see me in the future.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "October 6, 2004", "id": 2622912}, {"rating": 4.0, "title": "Awesome", "text": "Spent the weekend there Oct 1-3. Food gets a little getting use too but they can cook fish in many different ways! If you like trying diffeent food it is great! Pools are great especially the swim up bars. Entertainment was great. Drinks were great. Rooms were a little outdated but there is too much to do and the weather was great, who wants to spend their va-ca in the room. Service was OK except for the bartenders who had nothing but smiles and kept the drinks coming. For the money you can not beat this place for a nice relaxing vacation!", "helpfulness": 1, "user": "Joseph S", "date": "October 6, 2004", "id": 2622801}, {"rating": 4.0, "title": "Fun Vacation!!!", "text": "The first impression of Suset beach was that it was a little sketchy. Check in was a bit of a hassle. I traveled with a friend of mine and we requested two double beds, but were stuck with king bed.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "September 29, 2004", "id": 2608190}, {"rating": 5.0, "title": "Everyting was Irie mon!!", "text": "What a trip!! I went to Jamaica 8/16-23 and had an amazing time. I'm a 20 yr old girl and went with two friends. The staff was amazing..helpful and courteous. Everyone went out of their way to make sure we were happy. Drinks were delicious..and very strong... :) Im definitely going to go back and this is the only place I'd stay bc i heard lots of bad things about other resorts.", "helpfulness": 4, "user": "smurfet04", "date": "September 13, 2004", "id": 2526593}, {"rating": 3.0, "title": "It was nice, but wouldn't go back", "text": "The rooms are what you pay for..clean..not too roomy but u shouldn't be in there that much anyways. the food was ok..the beach grille was amazing..they have diff't types of buffet everynite which was interesting. the italian was okay..i thought the chinese rest. was great. we did some excurions which added to the trip. Horse back riding was great and so was swimming with the dolphins and dunns river falls. I wouldn't do the booze cruise again..but we made the best of it. There isn't much of a nightlife in the hotel but the bars are open pretty late so what else do u need? There are also shuttle buses to Margaritaville every night which is a bar/nightclub type place. If you have any questions feel free to email me and i will be more then willing to help you out if possible.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "September 9, 2004", "id": 2520092}, {"rating": 3.0, "title": "Beautiful Views/Terrible Food", "text": "PS- make sure to make dinner reservations as soon as you check in to the hotel!!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "September 9, 2004", "id": 2519902}, {"rating": 2.0, "stay_parameters": "Stayed September 2004", "text": "The sunsets down there were amazing! The male staff was GREAT! The women...they're another story! The food and drinks were plentiful! I loved the strawberry banana daquiris with extra rum...ha ha! The beaches weren't too great, I wasn't aware they were man-made beaches. A lot of rocks and stones and pretty small. Unfortunately, the storms around us brought in warm waters...which brought in JELLYFISH GALORE! So I never got to snorkel or jet ski in fear of getting stung all over. We did paddle boat though almost everyday which was cool. The coral reef was beautiful but there were thousands of jellyfish out there. A lot washed up along the shore too which made it hard to swim. The entertainment was good. Bands, talent nights, theme nights, Local Jamaica Fare taste testing nights, etc. The guests were really nice too. We met a really nice couple on their honeymoon from Canada and hung with them a lot. The casinos were cool. That was the only place I got to hear some music that I like since Jamaica tunes were on all the time. I was totally missing my music!! They had an Italian restaurant we went to twice. AWESOME! The Chinese Restaurant was okay. We went into town to shop and it was sad. Very poor country! But the vendors are like white on rice once they see you. Grabbing you telling you to come see their shops and asking for tips for doing absolutely nothing. I hated it in town! Vendors do come to the resort and set up a couple times a week but they're pushy too. We witnessed a wedding in the gazebo which was nice. They have an open air lobby which is really nice. The winds blow through there all the time and make for a nice, peaceful atmosphere. The swim up bars were cool. The rooms were gross. I know I am an anal freak, but those rooms would be gross to anybody. The jerk chicken is very tasty!! It did rain from like 1-2 everyday in the afternoon which I found to be weird. But laying on the beach and under the palms set up all over the beach for shade was very nice. Montego Bay's airport was TERRIBLE!", "title": "The good and the bad", "helpfulness": 2, "user": "DivaDivinaNYC", "date": "September 8, 2004", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 2518713}, {"rating": 5.0, "title": "Honeymoon in heaven", "text": "So overall, we had a good time. Wouldn't go back though. We'll try somewhere nicer next time. But for what we paid, we got what it was worth.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "September 7, 2004", "id": 2517097}, {"rating": 4.0, "stay_parameters": "Stayed August 2003", "text": "The resort was great, as far as the beach and other scenery. The staff was excellent professional at all times. Lots to do @ the resort itself and as far as night life if that's what you want. Then it's just a HOP & SKIP away. The only negetive thing I withness was someones' BAY bay kids in the Jacuzzi. The was using it as a pool but unlike my beautiful wife I will not give the resort bad ratings because of one or two idiot parents.", "title": "Life is a Beach", "helpfulness": 8, "user": "babyleg", "date": "August 9, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3749940}, {"rating": 4.0, "title": "Excellent Holiday", "text": "Stayed at this hotel for 2 weeks from 12th July 05. Had read some of the reviews which did put me off a little. Disregard these!! My boyfriend and I loved it (24, 25 years old). The hotel is value for money. The beach is beautiful, the hotel is very clean and the italian and chinese restaurants were so so good. The buffet was the only fault with this hotel, breakfast was great, lunch and dinner not so good. Selection not very good. There is a beach grill serving lovely burgers, jerk chicken etc.. which was good.", "helpfulness": 11, "user": "Tinkerbell24", "date": "August 5, 2005", "id": 3738812}, {"rating": 5.0, "title": "Honest facts- mostly good", "text": "Having been to Cuba, Mexico and Barbados, I can say that Jamaica is top of my list.", "helpfulness": 18, "user": "A TripAdvisor user", "date": "August 4, 2005", "id": 3737822}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "Montego Bay is a short drive from the hotel. We did go to another restaurant Margarites, lovely setting, 2 course meal with bottle wine $160 which was a bit pricey. Although Margaritaville beside it is a much better option and cheaper!! There is McDOnalds and KFC if you want a taste from home.", "title": "Fun In The Sun", "helpfulness": 5, "user": "ddemato", "date": "August 2, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3730099}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "Went to Dunns River Fall..excellent, defintely go. Also went on Nile Mile Tour, to Bob Marleys birth place..also worth while. Had a sunset cruise, very romantic, beers good too!", "title": "Excellent staff at Sunset Beach", "helpfulness": 7, "user": "cath102", "date": "August 1, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 3727651}], "location": {"country": "Caribbean"}, "stars": 3.5, "variance": {"poor": 320, "average": 638, "very good": 1533, "terrible": 217, "excellent": 1029}, "aka": "Sunset Beach Hotel", "slim_ranking": 0.274193548387, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.0}, "description": "Consists of a Beach Wing and two 10-story Sunrise and Sunset Towers."}