{"user_rating": 5.0, "review_count": 36, "name": "Sunset Inn", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed September 2013", "text": "Good points ..The room was very clean fresh towels everyday and the fried breakfast was lovely and the view was nice...", "title": "Please read this carefully before booking.", "helpfulness": 3, "user": "Karonconroy", "date": "September 15, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 177306825}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Bad points too remember but they don't tell you..", "title": "Room with a view.", "helpfulness": 6, "user": "Theresa B", "date": "September 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176166691}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "One not disabled friendly no where for a wheel chair to get into the building.", "title": "Ali and Malc", "helpfulness": 5, "user": "Malc H", "date": "September 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175748866}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Two not child friendly no children.", "title": "Comfortable stay in a friendly guesthouse", "helpfulness": 6, "user": "BrownEyedLady", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175574605}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Three no food or drink to be taken eaten or made in the room at anytime if your diabetic your stuffed.", "title": "Wonderful location with sea view", "helpfulness": 6, "user": "RoverMidlands", "date": "August 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174949745}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "Wonderful inn, the accommodation was spotlessly clean and well designed. Holger and Michele are friendly and helpful. We cannot recommend it highly enough - excellent. The breakfast was delicious and we presented and rooms are of a high standard.", "title": "Excellent completely faultless stay", "helpfulness": 5, "user": "TJCrowe", "date": "August 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 174442135}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "My husband and i stayed the bank holiday weekend for 2 nights.The purple room was beautiful with a fantastic sea veiw.The owners couldn't do enough for us check in was swift breakfast was lovely didn't need much more for the rest of the day we will definitely stay here again and we would recommend it to friends aswell", "title": "beautiful bed and beakfast", "helpfulness": 5, "user": "julie_siddons", "date": "August 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174425561}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "A great place to stay, very friendly, very clean and an excellent Breakfast. A good location close to the front, with an Indian restraunt close by and a short walk to three excellent bars.", "title": "Enjoyable", "helpfulness": 6, "user": "A8KOR", "date": "August 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173170393}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Many thanks", "title": "Weekend break", "helpfulness": 5, "user": "Chris C", "date": "August 19, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 173008984}, {"rating": 4.0, "stay_parameters": "Stayed August 2013", "text": "Lovely place to stay, owners were very friendly and accommodating. We messed them about when asking for a ground floor room for our friends after booking at quite short notice, no problem at all. Clean towels every day, and not your regular boring white ones either. Breakfast was a positive feast of local sausages and bacon, eggs anyway you liked, mushrooms, tomatoes and beans plus a mound of toast. didnt need to eat for the rest of the day. Arrived home to a phone call that I'd left my phone charger, in the post the next day!!", "title": "Beautiful, clean and perfect home from home", "helpfulness": 5, "user": "Ralphiedog", "date": "August 5, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 170939812}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "My boyfriend and I recently stayed here with his sister and her boyfriend for one night for a couple’s getaway. Upon arrival we were warmly welcomed and shown to the Pine and Green Room on the first floor. Both rooms were immaculate. They were extremely clean and very spacious with tea making facilities, fresh towels, a TV and free WiFi. The recent refurbishment was abundantly clear with all the furniture looking brand new. The bed was very comfortable and we all had a fantastic night’s sleep after a long day sightseeing, playing in the arcades and swimming in the sea. The Inn is prefect walking distance from the town centre and it’s quite literally a stone’s throw to the beach.", "title": "A very lovely stay =)", "helpfulness": 3, "user": "Keri M", "date": "August 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170827220}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "All the staff were very friendly and certainly gave the impression that nothing was too much hassle. The full English breakfast was delicious and beautifully presented. There was ample parking at the front the property and we had the option to leave the car the next day despite the fact that we had already checked out. Would definitely recommend and most certainly will be visiting again.", "title": "Excellent quiet clean comfortable", "user": "Peter M", "date": "July 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169919456}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We stayed here in the middle of July for four nights on our first trip to Norfolk, to escape the heat wave in Hertfordshire where we live. On arrival we were shown to the room which has French doors onto a first floor balcony. The French doors were open, as were the internal doors, and the room was beautifully cool. Everything was spotless and it was obvious that the room had been recently refurbished using good quality furniture and fittings. The bed was very comfortable, and the location, although only a few minutes walk from the centre of Hunstanton, was so quiet that we were able to sleep through the night, with the French doors wide open. Only the seagulls briefly woke us at dawn. Good full English breakfast, although we would have welcomed the addition of muesli to the starters selection. The staff were friendly. Try the Steak and Stilton restaurant for an evening meal. Best walks are along the beach to old Hunstanton and beyond. Also along the beach in either direction at Holkham (30 mins by car). Peter and Fay, Herts.", "title": "A Lovely Friendly Hotel", "user": "DenJam512", "date": "July 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 169129981}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "My Husband and i stayed here in July. The owners were wonderful our room was lovely right at the front at the view of the sunset was fantastic. The breakfast was the best we have ever had i would recommend this hotel to all my friends and family.", "title": "Friendly and comfortable", "helpfulness": 1, "user": "JeanneLeicester", "date": "July 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 168446973}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "We had the \"red room\" which was spacious and comfy and everything was very clean. Lovely bed linen and towels. Nice breakfast, we had the full English. All staff were very friendly and helpful. Would go back again when we visit Hunstanton.", "title": "Excellant", "user": "doonr", "date": "July 19, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 168224942}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Stayed at the Sunset for a couple of nights at the beginning of a motoring tour (yes, they do still exist) of East Anglia. Had the Red Room which was excellent in most respects: spectacular sunsets over the Wash both nights and the fresh gladioli was a nice touch. The en-suite, while spotlessly clean, was looking a little tired but we were told it was next on the list for refurbishment. No tv for both nights. We were told about this but still feel something needs to be done about it. Broadband only worked when I went and sat on the middle landing! Excellent breakfast but would suggest that there was some element of 'help yourself' provided. Agree with other reviewers as regards food and drink in the rooms but if that's the rule, that's the rule, it's no real problem. Host could be a little over-attentive but we'd rather have someone who was there and who took an interest in his guests. Nothing was too much trouble. All in all, an excellent B&B which we were glad we had found and would definitely stay at again.", "title": "Excellent B&B", "helpfulness": 2, "user": "bigfozbelper_England", "date": "October 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179427167}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We recently stayed in this lovely B&B for a weekend away. The rooms were spotless. It was very quiet and we had a lovely sea view. The beds (Kingsize) - which are very new - were extremely comfortable & the management was friendly and accommodating. The breakfast the next day was also delicious. I would not hesitate to stay here again - and will do when we are next in Norfolk.", "title": "Lovely Seaside B&B", "user": "Naomi M", "date": "September 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178533030}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Just a one night stay but the owner and his family made us so very welcome and it was clear every care had been taken to see guests were comfortable overnight and set off with a very good breakfast inside. Bonus was the stunning sunset over the Wash. Thanks for having us!", "title": "Every care taken", "helpfulness": 1, "user": "BertWales", "date": "September 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178127075}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "This guest house has been tastefully decorated, and is very clean and comfortable. It is close to the shops and restaurants, but is also lovely and quiet. Across the road is a sensory park, and at the other side of the park is the seafront, which you can see from the rooms. Excellent for a view of the sunset. Quality ingredients are used for breakfast which is cooked to order and is well presented. Staff are friendly and keen to ensure that your stay is enjoyable. The establishment does not have facilities for children or pets, which is a bonus as far as we were concerned. Also take-aways and booze are not allowed in the rooms - again a good feature, as who wants to have the stale smell and residue of other peoples food in their bedrooms? There is some parking at the front of the property, and plenty of space in the road by the park, where you can still see your car. We would certainly recommend Sunset Inn and would be happy to come here if we visit Hunstanton again.", "title": "Tasteful decor, great view, good food", "helpfulness": 2, "user": "Roseananne", "date": "September 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177689980}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Came across the Sunset Inn on a booking site by chance, as the hotel has only opened earlier this year. We were only staying in Hunstanton for one night as we were attending a concert at the theatre there so thought we'd give the Sunset a try and so glad we did. While only being a small hotel, 4 or 5 bedrooms I think, we received a warm welcome from the proprietor, who allowed us to park our car on the drive (parking for 4 vehicles, but parking on the surrounding roads, free between 6 in the evening and 9 in the morning) before check in time while we had a stroll into the town itself, which is only a few minutes walk away. On finding that my husband is not very mobile, the proprietor instantly prepared a different, more accessible room for us with just a few stairs and carried our bags up. The room was lovely, obviously furnished with care and taste, spotlessly clean, great shower and a seaview, couldn't fault it. We were very comfortable and after having a good nights sleep (even though we were on the front of the hotel by the road it was unbelievably quiet,didn't hear any traffic at all) we were treated to a great breakfast (hope you've got a good appetite!) which set us up for the day. All in all, if you're looking for a reasonably priced small hotel (adults only !) which is very well appointed for the town, just a few minutes stroll takes you onto the seafront and to the town facilities and theatre, so you can't go wrong.", "title": "Little gem", "helpfulness": 1, "user": "Jollypensioner", "date": "September 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 177483641}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 0, "average": 1, "very good": 5, "terrible": 0, "excellent": 30}, "aka": "Sunset Inn Hunstanton, Norfolk", "slim_ranking": 0.458333333333, "description": "Sunset Inn was taken under new ownership on 1st May 2013 and all the front 5 sea facing en-suite double rooms have been extensively upgraded. Each room now has beautiful furniture and decorations with en suite showers, TV/Dvds, hairdryers, tea/coffee trays, handmade crafted chairs made in Wales, new King size beds in most rooms, free WiFi and much more. All prices now include a superbly cooked and presented breakfast in the newly refurbished breakfast room or on the secluded terrace....weather permitting of course! There is some on site parking and is on a 'first come first served' basis and cannot be booked in advance but there is ample free 24 hour parking nearby. Please note: Sunset Inn has at present no facilities for pets or children and has no wheelchair access. Our Apologies for this."}