{"user_rating": 4.5, "review_count": 265, "name": "Sunset Bungalows Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We had a great time at Sunset Bungalows, very nice rooms and friendly staff.", "title": "Quiet, Romantic Getaway", "user": "samboynewcastle", "date": "September 23, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 20294591, "likes": {"liked": "— Location - being in a bungalow over the water", "disliked": "— Limited menu - some problems with getting items"}}, {"rating": 3.0, "title": "Sunset Experience Okay", "text": "We enjoyed the relaxed lifestyle at the resort and the fact that it was so quiet. Would recomend it to any couple that wants to relax and unwind and does not mind being a 5 minute bus trip from Port Vila.", "helpfulness": 2, "user": "HK-IH", "date": "September 11, 2008", "id": 19973723}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Not so good if you want the choice of a few restaurants and bars at your front door but a lovely, quiet place to stay.", "title": "Over Promise - Under Deliver", "helpfulness": 1, "user": "newg8", "date": "September 10, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 19947575, "likes": {"liked": "— Nice surroundings", "disliked": "— Service from Management"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We've just come back from 1 week in Vanuatu. We stayed on the island Efate at Sunset Bungalows Resort on Second Lagoon, just outside Port Vila", "title": "first time", "user": "old55", "date": "September 7, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 19864819, "likes": {"liked": "— small numbers of guests"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Prior to booking we spent ages researching and at that time, Sunset Bungalows was ranked the number 1 favourite hotel in Vanuatu by reviews on TripAdvisor.", "title": "Over rated, suspicious reviews", "helpfulness": 1, "user": "dazau", "date": "August 23, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 4.0}, "id": 19258286, "likes": {"liked": "— nice rooms", "disliked": "— pool out of order, grounds poorly kept"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Fabulous potential and nice staff...... Effective airconditioning and some unique appointments. Pretty aspect from stand alone bungalowsoverlooking lagoon but ask questions from someone who has stayed there, not your travel agent, before you book. Rooms need maintenance.Tidy grounds. Limited menu choices. We stayed for 14 days,- regularly, everyday menu choices were unable to be fulfilled due to various items not being available, eg bacon, fruit juice etc. Overall this property may not be suitable for stays more than 7 days. Be aware that often you are unable to get what you have already paid for or have an appropriate alternative.", "title": "not like the brochure", "user": "wendigirl", "date": "January 20, 2009", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 23738185, "likes": {"liked": "— pretty aspect and great lagoon views from bungalow", "disliked": "— failed to deliver what it promses and poor maintenance"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "It is about 5 k from Port Vila and regular bus should only cost 150 vatu /person . To Mele Cove it will cost by bus 300 vatu / person each way and NO MORE.", "title": "Perfect resort, most relaxing holiday ever!!", "user": "kathmd", "date": "November 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22307826, "likes": {"liked": "— spacious", "disliked": "— needs new linen"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008", "text": "When cruise liners come into Port Vila, prices are doubled immediately at all shops and tourist locations and also by some bus and taxi operators. This is a regular practice. You must also pay to go onto beaches from 500 to 1500 vatu /person.", "title": "Loved our stay at Sunset", "user": "Wendy_Martin", "date": "November 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21963554, "likes": {"liked": "— Beautiful views and peaceful", "disliked": "— Bedding"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with friends", "text": "My husband and I have just returned from the best holiday we have ever had (& we travel a lot!!) thanks to Sunset Bungalows. If you want 5 stars with starched linen napkins in a sterile environment where no one knows your name - stay elsewhere. However, If you want a small resort in a beautiful setting that is very very clean with the most friendly staff where nothing is a hassle please go to Sunset Bungalows. You will not regret it. The managers, Roland and Jenny are lovely and all the staff are fabulous including Ruben the security man who will walk you across the road at night to hail the bus as there is no street lighting. Ruben even chased a bus as I left my glasses on the seat and even managed to stop it and retrieve my glasses. Gee he can run!! Thanks Ruben. Thanks to Annie and Madeline and Roy everyone was great. Being a smaller resort you will meet and become friends with other guests to share your experiences and gather knowledge to make your stay even more enjoyable. There is nothing like meeting new friends by the pool for drinks before heading off to dinner in a group. I read reviews that were not very pleasing and now I know how picky people can be!! What busy road? Mozzies?? if there were mozzies, and we all get them in Australia, use Rid like you do over here!! The resort does have it on hand - just ask. If you do have a complaint, (over what I'll never know) just see Roland or Jenny or the staff and they will take care of it - don't come back and complain. We had an upstairs room which was fantastic, however I have a knee problem and was moved after a few days to a bungalow which was equally fantastic. For those of you who want to know, the difference in the rooms was that we had a very large corner bath and a separate toilet in the bungalow. However bungalows do vary as some do not have the corner bath others have a little kitchenette. The food at the resort is well priced compared to the Waterfront and the Moorings (Moo's) in Port Vila in fact we ended up staying at Sunset for most of our dinners. However both of these eateries were very good, I personally favoured the Moorings over Waterfront as I loved the bar at the Moorings. The seafood basket and burgers at Sunset are great and you can order them for dinner as well if you wish. Everything on the dinner menu seemed great especially the steaks, fish and curry. Breakfast was a good selection from sausages - just ask for them as they are not on the menu, bacon and eggs, omelette which was huge, bircher muesli, and heaps more - the servings were large. Ask for the late its really good and of course you get juice.", "title": "Wonderful!", "user": "rosie1990", "date": "November 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21962834, "likes": {"liked": "— The Staff and the rooms.", "disliked": "— nothing comes to mind. prehaps not so many young people around."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Our son and fiance (who stayed elsewhere) decided to have their wedding in Vanuatu at Sunset Bungalows and what a fantastic day it was for all. Jenny did a great job and organised everything. We highly recommend Jenny take care of all the arrangements as you will not be disappointed. The bouquet, floral decorations, local band, lovely cake and wine and dinner and all the little things she did was faultless. Sunset was the most romantic place to marry and for photos. It was totally stress free. I have since told our other 2 sons, when the time arrives, they are also marrying at Sunset! Snorkeling was great in Vanuatu - just like in Nemo the movie. Take bread to feed the fish. The day trip on the Congoola (may have spelt that wrong) is well worth it - approx $110 each including a very good steak and salad BBQ lunch. Great snorkeling. The snorkeling trips by the dive shop at the far end of the water front (next to helicopter flights) was also a great half day tour departing at 1pm. I think it was the best coral reef and fish we experienced - it blew me away and I have snorkeled the at the Great Barrier Reef. It was a quick speed boat trip out to the reef, a guide stayed with you at all times in the water and also pointed out many interesting things that you would never see without being shown by a local. Cost approx $35 and worth every cent. The masks and snorkel are high quality. If you are not confident in the water they supply a floatation to hold on to. I'm not sure of the name of the company, but I think it was Blue ...?? something. Book everything via Annie at the resort. Other guests raved about the half day cultural tour. We went to the Le Meridian for the traditional meal and show which was also very good - held every Thursday night approx $50 each including the show and a cocktail in a coconut which was good value. Vanuatu is not cheap, about the same as Aussie for meals so be prepared. Small items can be quite expensive. You can buy local and imported beers and cold meat etc at the supermarket if you wish. Go the to fruit market on the waterfront as the pineapple, mango and bananas are very sweet and tasty.", "title": "I'm sorry but...", "helpfulness": 6, "user": "xscarletx", "date": "November 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21687614, "likes": {"liked": "— Everything", "disliked": "— Nothing.."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "Intimate, seculded boutique bungalows. Set over the second lagoon with views across the water to a distant undeveloped shore line. Smoke occasionally rises from tribal villages deeper in the jungle. Wild yellow hibiscus flowers float by signaling wind strength and direction.", "title": "Boutique happiness on the water", "user": "worldtravellor47", "date": "August 9, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18786711, "likes": {"liked": "— Small intimate genuinely Vanuatu.", "disliked": "— Nowhere to go for an after dinner stroll."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Organic tropical fruit skewed on coconut leaf spine for breakfast, organic beef carpaccio followed by T'bone for dinner make this one of the best restaurants in Vila. Make sure you go French too. Try Les Alizers, they will pick you up and take you home.", "title": "Great place & people!", "user": "tmayhew11", "date": "August 7, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 18701938, "likes": {"liked": "— the staff, rooms and restaurant", "disliked": "— nothing, it was all wonderful!"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "Genuinely warm staff are interested, helpful and obviously happy with their jobs, their lives. Their local knowledge made our trip.", "title": "Peaceful and Lovely Setting", "user": "David079", "date": "July 21, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 18119630, "likes": {"liked": "— Clean, spacious, friendly service, great food, great location", "disliked": "— squeaky bed :-)"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2005, traveled as a couple", "text": "Use the local bus system to take in all the sights and sounds of Port Vila. Each trip costs about $A1, the city is about 5 minutes away and you will encounter real life in Vanuatu.", "title": "Couples paradise - Amazing!", "helpfulness": 1, "user": "Auzski", "date": "July 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 18028740, "likes": {"liked": "— The rooms and particularly the bifold doors opening up over the water", "disliked": "— Lights in the bathroom were too dim"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "I felt lucky each time we went on a tour and picked up visitors staying in larger 'generic' 4 & 5 star accommodation. At Sunset you feel like you are in Vanuatu, the happiest place on earth.", "title": "Fantasy Island luxury", "helpfulness": 1, "user": "Sevenof9", "date": "July 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17549108, "likes": {"liked": "— my doors in room that fully opened up to my over water balcony", "disliked": "— Slight noise from traffic, but hardly noticed it"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Absolutely loved our bungalow - nice and open, clean and tidy - and loved how the water was RIGHT THERE, so nice to wake up to the sound of water trickling outside.", "title": "Loved it!", "user": "melarie", "date": "October 25, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 21208285, "likes": {"liked": "— Our bungalow, right on water, pool", "disliked": "— Not in walking distance to anywhere else"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The pool was gorgeous, but waterfall feature wasnt working - no biggy.", "title": "Our favourite place in Vanuatu", "user": "MandyMelb", "date": "October 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 20921003, "likes": {"liked": "— Personalised, romantic holiday", "disliked": "— Nothing. It was lovely."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "Made good use of kayaks, but the pedal boat looked broken? Also overheard conversation of other guests using a pedalboat, then finding that the stearing didnt work and got stuck up stream! Again, no biggy (for us!..)", "title": "Birthday Bliss at Beautiful Bungalow", "user": "hanch", "date": "October 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 20578858, "likes": {"liked": "— Quiet - it was really quiet and slept really well", "disliked": "— Solar heating hot water was having difficulty and was being worked on while we were there"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "Everytime we went out, our room was tidied up again, with fresh towels, flowers etc - so nice!", "title": "Quite battery recharge", "helpfulness": 1, "user": "Maxydog", "date": "September 27, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 20432026, "likes": {"liked": "— It was quite and away from it all.", "disliked": "— Fridge in the room was not big enough."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Staff were really helpful, restaurant was yummy.", "title": "Our wonderful Anniversary", "user": "SP124", "date": "September 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20389220, "likes": {"liked": "— Friendly staff and the relaxing atmosphere", "disliked": "— Only that our stay wasnt long enough"}}], "location": {"country": "Vanuatu", "continent": "South Pacific", "city": "Port Vila"}, "stars": 3.5, "variance": {"poor": 7, "average": 21, "very good": 72, "terrible": 0, "excellent": 165}, "aka": "Sunset Bungalows Hotel", "slim_ranking": 0.224489795918, "description": "Nestled quietly on the waters edge within a tropical setting and fantastic views across Emten Lagoon. Luxurious surrounds includes a swimming pool with waterfall, over-water restaurant and bar. Sunset Bungalows Resort is a peaceful tropical escape with its relaxing adults only status, ideal for honeymooners."}