{"user_rating": 3.5, "review_count": 294, "name": "Super 8 Moncton - Dieppe", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2006", "text": "This is a very new hotel. Only a couple of months old.", "title": "Excellent stay", "helpfulness": 2, "user": "nealf", "date": "September 19, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5817168}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "My wife and I, along with our 3-year-old child, stayed at the Super 8 Dieppe at the end of July 2010. There was little question on where we were going to stay since the primary amenity for this hotel is their indoor swimming pool and waterslide. Leading up to our weekend away, my son anxiously waited for our arrival at the hotel so that he could go down the waterslide. Let us put that story aside for a moment to review the hotel. Check was quick and serviced by a polite and informative front desk staff. The lobby area is nice though not very spacious. I am not sure if this is a great place to cozy up and catch up on your work but there is a small fireplace in the lobby. Located off the lobby is the breakfast area. In addition, I noticed the breakfast area was serving cold refreshments in the evening (juice). Our room was very clean and fresh. Typical of most economy hotels, the décor was simple and plain though not worn. There was a small fridge and microwave unit in the room, directly under the late model television. We were assigned one the handicap/accessibility units which offered a single double bed and accessible shower unit. The bathroom was clean and bright. With respect to some hotel features: there are three small-medium size conference rooms on the main level. There is small yet accommodating exercise room near the pool entrance. Only a few units on each level offer a Jacuzzi in the unit. There is an even mixture of units with a king size, two queen beds or handicap/accessibility units. The hotel is 100% non-smoking and pets are allowed. If you are not interested in the breakfast offered at the hotel, there is a great breakfast venue, across the hotel parking lot, called Cora’s. Now back to the pool... shortly after check-in we headed for the pool only to learn that the pool was “temporally closed for maintenance” though there was no sign on the door, we were simply denied access when we attempted to open the pool door with our room key. After questioning the front desk on when the pool would be ready, we were informed that it would be open at 2:00pm. We decided to leave for 45 minutes to find lunch and return later. Upon returning, the sign on the pool door now stated that the pool would be open at “3:00pm”. We waited in our room for 45 minutes. At some time after 3:00pm, we were dressed for swimming and heading down the hall only to find the pool still closed. The front desk informed us that it would be another 30 minutes as they were completing test on the water. We went back to our room. Shortly before 4:00pm, we went down the hall to the pool area. The pool was still closed. The front desk said it would be closed for a while longer. They could not say when or if it would open. Once again, we headed back to our room. With a crying child, I was, to say the least “ok” with the situation. I was strongly debating on leaving the hotel since the pool was the principal reason for us reserving this hotel. However, I cannot say that the front desk was not understanding of our situation because they were. They did apologize many times. They offered to give us a discount on our rate and even called a local hotel to gain us permission to us their pool. Without their efforts and empathy, this stay could have easily been a disastrous weekend. Facing the hard reality of the situation, we elected to take our son to Crystal Palace, a nearby indoor theme park. Before we checked out on Sunday, we managed to get into the pool and at check out, our room rate was discounted without any question or prompting. It is because of the efforts of the staff that I would recommend staying at the Super 8 Dieppe (not to mention a good rate for the area and hotel amenities).", "title": "Pool/Waterslide Temporally Closed However…", "helpfulness": 3, "user": "StandingRoom", "date": "July 25, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 72309921}, {"rating": 1.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "I stayed with them Feb 28th. I checked in at 2:00 am and told them I would not be staying with them on March 5th. Two weeks later I got a bill for a March 5 stay. They told me i needed to provide them a cancelation number. Nobody gave me one and I wouldn't have written it down and remembered at that time in the morning.", "title": "Rascals charged me for two nights - only stayed one.", "user": "h691416", "date": "March 11, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 58335231}, {"rating": 1.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "this is second time them screwed me.", "title": "Terrible!!! Awful Service and FAR FROM HELPFUL STAFF", "helpfulness": 1, "user": "audiohaze", "date": "March 9, 2010", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 58162925}, {"rating": 5.0, "title": "Perfect Week For Us and Our Kittens", "text": "I made a reservation at this hotel and after talking with my boyfriend we decided we couldn't afford the trip. I made sure to check what their cancellation policy was prior to booking. Shortly after booking I cancelled my reservation - now 2 weeks later a $158 charge shows up on my credit card. I called to confirm that they would be returning my money, after a nearly 4 hour run around (I lost my cancellation code - and they are the only hotel in canada that doesn't automatically email this stuff to you!!) they requested my phone bill to prove I called to cancel. After another run around I was told that they would not be refunding my money even though I spent an entire day tracking down information for them -", "helpfulness": 1, "user": "BaseVinyl", "date": "February 11, 2010", "id": 55745245}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "I was informed if you call one number they will automatically send the information via email. But if you call the other - you have to request that. How is a person suppose to know if they do not keep it consistent - so since I called the wrong number and their employee's were not considerate enough to email my information to me I am out $158.", "title": "Another awesome stay at Super 8 Dieppe.", "user": "kas05", "date": "October 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 46574614}, {"rating": 1.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "Beware.... no wireless internet.... cleaning staff do 2 very quick knocks and walk RIGHT IN (scared me half to death) said she wanted to know how many beds in the room...ummm HELLOOOO just ask the front desk maybe????? VERY large airplanes going over in the night... no sleep.... too many hockey kids and not enough hockey PARENTS.... playing hockey in the halls. Hello people, we are not ALL there to enjoy your kids... keep them in the room you paid to sleep in not out in the halls to wake up others that are trying to sleep. Worst time ever in a hotel. Never go back again.", "title": "Never again", "helpfulness": 1, "user": "Relaxing13", "date": "March 22, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 1.0, "service": 2.0, "rooms": 3.0}, "id": 26616657}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Talks everywhere to save environment... but plastic cups everywhere instead of glasses.", "title": "where to start", "helpfulness": 2, "user": "trev71", "date": "August 17, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 5.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 19057109, "likes": {"liked": "— They had Fridge and Microwave in the rooms", "disliked": "— Beds, Handi Cap Shower Stalls, Check in waiting times"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "what a joke", "title": "Best Hotel Ever!!!", "user": "RLTTS", "date": "July 10, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 17771196, "likes": {"liked": "— Pool, Waterslide, very comfortable.", "disliked": "— Ice Maker was broken (they only had one)."}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "i decided to take my girlfriend on a mini getaway weekend in Moncton for summer Vacation.. To Start it off our room was not ready (of course) and only had to wait about 30 mins, they kept coming back and saying just a few more.. once we got to our room i looked in the bathroom and there was no TUB, They gave us the handi cap room.So i went to the front desk and she laughed and said someone else just came down and asked the same thing..I went cause i took a shower and alot of water got on the floor and the drain was not draining.. . the beds seemed to be lower and just didnt feel right the bed was probably one of the most uncomfortable beds that i have slept on.. Plus the toilet paper holder was in the oddest stop ive seen you literally had to turn to get to it... The breakfast was horrible stale cinn buns... the bagels where ok, though..", "title": "Good Hotel", "user": "CanadianHouseWife", "date": "June 24, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 17187898, "likes": {"liked": "— The room", "disliked": "— Breakfast Bar"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Location wise it was good... I think this is more of a family hotel, so if you want to have a nice getaway with the girlfriend... I wouldnt suggest it... If you have a family then i would take them in a second...", "title": "Excellent Value", "helpfulness": 1, "user": "Spudislander", "date": "December 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 11675094, "likes": {"liked": "— Cleanliness, service, value and proximity to airport.", "disliked": "— No dislikes"}}, {"rating": 1.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "My husband and I decided we would take our 4 sons aged 17 - 23 on one last family trip before the family broke apart to live elsewhere and to go away to university. Because of job obligations all we could commonly come up with was one short weekend. We decided we would go only as far as Moncton because of the time restraints and chose that hotel because of the waterslide. I called the hotel directly and reserved the rooms. I explained that we were one family but needed 2 rooms. I asked about adjoining rooms. The girl was very helpful and said they had one set of adjoining rooms and she would be sure that we were not moved out of those rooms. Based on that I made the reservations. When we arrived we were told we couldn't have those rooms and it was not the hotel's policy to assign certain rooms. I told them as a customer I am unaware of what the hotel's policies are, I just know that I was promised those rooms and that was why I booked there. We asked if those rooms were allotted to someone else and were told no. Then when asked why we couldn't have them then, we were told we could have one but the other wasn't cleaned yet. We told him that would not be a problem, we will all go up to the one room and wait for it to be cleaned. He went in and checked with the manager and came back in agreement. He processed our credit card for 2 nights for two rooms gave us one \"key\" and we went off to wait. We waited about an hour and half and then we decided we would go out. The desk was swamped with folks waiting to check in and we waited to inform him we were going out for a bit. He said the room would be ready when we returned. We were gone about an hour and quarter and when we came back I stopped at the desk to get the other room \"key\". A different desk clerk was on and I told her what I wanted. She said she couldn't give it to me the room was already rented. (Yes, of course it was rented - to us) - Nope she had rented it out to someone else! Eventually, we were finally able to get another room across the hall from us and that is another huge story by itself with lots of waiting for the same reason and again they wouldn't assign the room to us until it was actually cleaned. We originally booked in around 1:30 and did not have a 2nd room until 6:45. Then we had to work out of the same suitcases carry toothpaste and clothes back and forth across the hall. We had asked to speak to the manager 4 times and never did we ever hear from him. We finally did get the adjoining room for the 2nd night but only by watching over it like a mother hen and going to the front desk as soon as housekeeping closed the door from cleaning it. The gal when I booked on the phone was very nice but in person the staff couldn't have cared less and obviously neither could the manager as we were there when they called him. There was no concern to the inconveniences we were put through or the way our last family weekend was ruined, no adjustments to the bill or any perks thrown our way. We dealt with the same 2 desk clerks while we were there and they were aware of what they had both contributed to. We couldn't afford the time to hang around the hotel waiting for a room, we had such a short amount of time to be away. Had they been concerned or apologetic I would have written it off as a mistake and forgotten about it. This trip was taken a few months ago at the end of April and it still makes me angry to think of the wasted time and their \"don't give a rip attitude\". There are no warm fuzzies with this place. My husband will not use any Super 8 now!", "title": "No warm fuzzies - staff doesn't care", "helpfulness": 3, "user": "smilz20", "date": "August 12, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 3.0, "location": 3.0}, "id": 8400151, "likes": {"liked": "— They were clean", "disliked": "— Customer service was not good and staff unfriendly"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "My 6-year-old and I only stayed there a night, but it was a good motel. Check-in was fast, the room was clean, new, and no smells. We got an adjoining room for my cousin, and shared a door. We all slept late since the room was quiet and dark. Breakfast was very simple, but free and quick. Nothing to complain about at all. Not a romantic spot or vacation destination, but great for business. Also very good when Continental lands 2 hours late at 11pm and loses your luggage (toothbrush and toothpaste at the front desk) and you need a place to relax and telephone the lost baggage number (grumble grumble).", "title": "Fine Motel", "user": "PeterBSanFrancisco", "date": "July 23, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 8219013}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "The kids loved the pool and waterslide. The staff were friendly. The rooms were clean. We were going to travell on to Halifax but we stayed an extra night because we enjoyed it so much.", "title": "Loved the hotel, pool and people. Will be back in the summer", "user": "kksmithth", "date": "April 26, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7440042, "likes": {"liked": "— Pool"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "it was horrible, never waited so long to be checked in in my life.......not enough staff ...waited from 3pm to 6pm and still didn't have a room ready for us....along with about 30 other people ...when questioned when we would get our rooms as children wanted to eat and go to the pool they answered (WE DON\"T KNOW)...Manager would not come out and talk to us after asking to speak to him......horrible we left and stayed at the Holiday in express (GREAT HOTEL) but we will never return to Super 8 again........", "title": "Terrible experience with kids", "helpfulness": 2, "user": "jenmc4914", "date": "March 9, 2007", "detail_rating": {"value": 1.0}, "id": 7007978, "likes": {"liked": "— nothing", "disliked": "— the whole experience (they are not organized, short staff, unfriendly, slow)"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Great new hotel in New Brunswick. Good value for the size of rooms, the cleanliness and they have an amazing pool with big water slide for the kids (and husbands who think they are kids!). Super 8 has definately changed their reputation in my mind after staying in 2 different Super 8s in NB, Canada.", "title": "Great value!", "helpfulness": 2, "user": "belle975", "date": "November 14, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 6130738, "likes": {"liked": "— Water slide", "disliked": "— Internet was difficult to connect to"}}], "location": {"country": "Canada", "city": "Dieppe"}, "stars": 2, "variance": {"poor": 36, "average": 51, "very good": 113, "terrible": 15, "excellent": 79}, "aka": "Super 8 Moncton - Dieppe Hotel", "slim_ranking": 0.75}