{"user_rating": 3.0, "review_count": 169, "name": "Super 8 Hurricane", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "No complaints of any kind. Room was nice and clean. Staff was very helpful.", "title": "Nice cheap motel", "user": "Tomcod", "date": "August 19, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 116953771}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The desk was attended by a young man who looked to be 14 or younger, however he was very efficient and made a good recommendation for dinner. The rooms are very basic and the pillows are quite thin. However, it was clean and adequate and we slept quite well there!", "title": "A good night's sleep at a bargain price", "user": "manshacktx", "date": "July 14, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 4.0, "service": 3.0}, "id": 115370018}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Were not Super during an emergency. Got a flat tire on night of check in and had to stay in another hotel but had reservations at this Super 8 Hurricane location for two nights. After getting flat repaired, tried to check in for second night but instead they cancelled my reservations, billed me for 1 night as a NO-Show and wanted to upcharge me $15 for the Second Night which was previously reserved. Ended up at the Rodeway Inn across the street, better service and price. Terrible customer service and never staying at Super8 ever again!", "title": "Were not Super at all...", "helpfulness": 2, "user": "Brageal", "date": "June 25, 2011", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 114735549}, {"rating": 3.0, "stay_parameters": "Stayed June 2011", "text": "Was upset that the website says large rv/truck parking and when I arrived there was not a designated large vehicle parking, it was wherever you could get away with it. Guest laundry consists of 1 washer 1 dryer. The room needed a good cleaning carpet, walls, doors and the bed spreads were full of burn holes. The lighting is to low (3 40 watt bulbs) makes you feel like you are in a cave. Plug in next to the mirror didn't work. If you are looking for a value room, read reviews of other area hotels. You will probably get a better room at a cheaper price.", "title": "Needs a good cleaning", "helpfulness": 1, "user": "TravelingOddcouple", "date": "June 18, 2011", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 114268285}, {"rating": 2.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "I'm sorry to say that we received bed bug bites in April 2010 at the Super 8 in Hurricane, UT and brought them home with us. We are still battling them, Jan 2011. What a disaster! From now on, after staying in ANY hotel, we will leave our luggage in a hot car for a day and cook the little beasties before we bring our luggage in the house. I hate to single out this hotel, because bed bugs are epidemic everywhere. Just be careful staying in any hotel.", "title": "Bed bug bites!", "helpfulness": 3, "user": "gardenerwild", "date": "January 27, 2011", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 94622022}, {"rating": 2.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The whole experience was just bizarre. We arrived a bit late at night (past 9pm, before 10pm) only to find nobody available to check us in. We waited a good 15 minutes, calling on the courtesy phone 3 or 4 times. It was obvious the first time we called the number the phone was ringing in the lobby and nobody was around (other than us). A few other people staying at the hotel came in during this time to speak with someone about their room. It was not until I called the Super 8 in St. George (actually, believing I was calling the national toll free number) that we were able to get someone to show up and check us in. Whew, once we got through that, things couldn't get worse, could they?", "title": "What is going on here?", "helpfulness": 1, "user": "FerrisFan76", "date": "September 20, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 43124571}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "As we made our way from the car to the room with our bags, a person claiming to be the owner of the motel stopped us and (in an accusatory manner) asked us if we were the people who had contacted St. George about the lack of ANY service in the lobby. Needless to say, an odd conversation ensued.", "title": "Great Value but you get what you pay for", "user": "countryy", "date": "August 5, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 36798917}, {"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The room wasn't horrible for what we paid, but it did take sometime for us to get comfortable after the earlier events. You should be able to find a better value elsewhere in Hurricane. Based on ownership, I wouldn't expect any improvements in accomodations or service anytime soon.", "title": "Somewhat Expected", "user": "Mulvaney", "date": "July 11, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 34469222}, {"rating": 1.0, "stay_parameters": "Stayed June 2009, traveled solo", "text": "We stayed at this hotel for 2 days as we were traveling thru the area exploring the parks.", "title": "Needed Ambien to kill the smell and actually sleep", "user": "vballtheorist", "date": "June 26, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 33263537}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "1st room we were given was real bad as it reeked of paint or some kind of chemical. When I complained they gave me another room which was fine. Stay was good, breakfast was ok with the usual.,waffles ,cereal .etc. For the rate charged it was well worth the price. A dip in the outside pool was a nice way to finish off a hot day in the area. Even though the hotel advertised free wireless in the rooms, I could not get a signal in my room and had to go to the lobby to connect. I noticed other travelers had the same problem. There was never anyone at the front desk and you had to ring a bell to get someone to help you. Phone calls in were also a problem. When my daughter called she says they were rude to her when she asked to be connected to our room.", "title": "It is What it is A Cheap Place to Stay", "user": "Will2travel", "date": "June 8, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 31820296}, {"rating": 1.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We found the location convenient. However, the motel was booked solid and the room we were issued wasn't up to minimal standards. First off the smell was terrible. The cleaning person had used way too much deoderizer on the carpet.....ugh. Ok, after about an hour you can get used to the smell. However, the door had been forcibly busted in and the door jamb was broken at the lock area. Also, there was no strick plate mechanism in the door jamb so the deadbolt was simply in an empty large hole. Absolutely no security with the door locked. Fit so loose that you could see day light around all sides of the door. A 3 year old could have kicked the door open. The clerk was sheepish when we complained about the broken door but no other rooms available. I complained to the manager the next day but he just laughed and said he would send someone to fix the next day. I let them know I didn't believe him, because the door had been broken for many weeks, if not months. Also, the wireless internet didn't work. I complained to the manager, who was apparently lying when he responded that he had never had any complaints about the non working internet. I stayed at several other super 8 motels on this vacaton which t were all acceptable for short stays. This motel should loose it's franchise....a nasty place to stay", "title": "Busted door jam without any strick plate causes door to barely close.", "helpfulness": 1, "user": "telder4", "date": "September 25, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 80920705}, {"rating": 1.0, "title": "Filth !!!!", "text": "I am yet to contact local Heath department on this issue of filthy room. In addition to the filth shown on the photos the man at the dirty, stained, broken front desk was not-shaven for several days and wore dirty looking t-shirt. Stay in this rotten hole at your own risk. We left this stinking, over-perfumed room quickly. Refund issue is pending-be aware of this trap also.", "helpfulness": 1, "user": "travelerSLC_Utah", "date": "February 27, 2010", "id": 57275356}, {"rating": 2.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "First of all we ended up in a handicapped room at the end. The desk clerk does not speak English very good, my son asked for extra sheets/blanket and had a hard time understanding him. Also the walls are very very thin, could hear people bringing in their children when I was just about asleep above. Then in the middle of the night around 2 am I could smell cigarette smoke and we were to be in a non-smoking room.", "title": "I would not stay there again", "helpfulness": 1, "user": "jro123", "date": "February 24, 2010", "detail_rating": {"value": 2.0, "sleep": 1.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 57002265}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Spend a little more to get a better room in Hurricane or in St George.", "title": "Good enough for 1 night", "helpfulness": 1, "user": "Sparky6654", "date": "November 27, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 50161241}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The wife of the manager was real nice and helpful. He was useless. WiFi works sporadically on the end away from the office. Wife said she would have it looked into though. Rooms were clean, AC worked good so it was good enough but nothing special.", "title": "good value with good rates", "user": "mikes5", "date": "November 5, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 48583901}, {"rating": 1.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "Several friends and I reserved rooms for two nights. One for a week day and one for the weekend inbetween a trip to the Grand Canyon on our motorcycles. The rooms smelled so strongly of pinesol cleaner it made us ill the first night. The owners told us when we made the reservations that could leave our trailers there while we traveled on our bikes. When we arrived we were told differently. So, we went to the police department across the street to find out what the street parking laws were. We were told we could leave our bike trailers in the street for six days. When we informed the owner our intentions he became rude and told us this was his parking. He actually thinks he owns the streets! We left the vehicles and trailers there for two nights because the police went and spoke to the owners and told us they would keep an eye on our vehicles and trailers. Upon our return our \"confirmed\" reservations had been cancelled by the owners because one of the women we were with had an accident in the bed due to her monthy visitor. The owners had actually called the police and said we were leaving them a sign of sorts, so they took the liberty to cancel our rooms. FYI: The Hurricane Police department actually has a special task force to deal with the motels and hotels there because of the customers being harrassed. I will never stay there again. The rooms do not look like the pictures listed. The harrassment ruined our vacation and the owners never contacted us even though the corporate office said they would within 7 days. Do yourself a favor and stay in another city close by.", "title": "I'll never stay here again!", "user": "Harleybabe28", "date": "May 22, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 30563739}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We paid $59.00 rate for this room and were surprised to find our room had a large jacuzzi tub, king size bed, and a separate room with 2 couches. I'm not sure if all the rooms are like this but if they are it's an incredible value for the money. The room was very clean. The breakfast was very basic and I would pass on it next time. We enjoyed our stay.", "title": "Great deal for the price", "user": "lis89", "date": "May 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 30044627}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "I have mixed-up my reservations and eventually we did walk-in check-in at night. The rate was pretty good.", "title": "Good motel, right value, would stay again.", "user": "--Roman_PA--", "date": "May 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 29259238}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "The staff (owner?) cancelled the reservation with other Super 8 motel in St. George.", "title": "Great for the price", "user": "Sticidy", "date": "April 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 27714840}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "The room was quite spacious and looked clean. I could not get internet connection working. I can't remember exactly, but I think there was a fridge and microwave in the room.", "title": "Would like to stay here again", "user": "vidhisheru", "date": "January 12, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 12552654, "likes": {"liked": "— friendliness,cleaniness,honesty", "disliked": "— pillows"}}], "location": {"country": "United States", "city": "Hurricane"}, "stars": 2, "variance": {"poor": 34, "average": 50, "very good": 54, "terrible": 25, "excellent": 6}, "aka": "Super 8 Hurricane Hotel Hurricane", "slim_ranking": 0.8}