{"user_rating": 4.0, "review_count": 394, "name": "Surfside Hotel & Suites", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "This pleasant motel, just outside of the downtown madness of in-season Provincetown, offers a comfortable and congenial place to relax. The rooms are newly and tastefully decorated, the staff helpful and accommodating, and the breakfast buffet both generous and tasty. Special mention should be made of Dave, the energetic Navy veteran who makes sure that everything is ship shape at all times. An extra plus: it's dog-friendly.", "title": "Getting Better All the Time", "user": "Thomas J", "date": "May 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 162416650}, {"rating": 5.0, "title": "As ever, great customer service!", "text": "We visited with our dog for the second time in three years. The beachfront rooms had been significantly upgraded in the interim, with new curtains, and flat screen TV. As ever, the customer service was impeccable, especially Elaine on the front desk, and Dave looking after breakfast, which was varied and great value. The rooms are cleaned thoroughly each day, and a missing bath plug was replaced within five minutes of the request being made. Certainly if you are looking for a pet friendly hotel which welcomes gay or straight families you'll be hard pressed to find better.", "user": "Alastair C", "date": "May 29, 2013", "id": 162302174}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Just a couple of peeves. The wifi, while excellent in the main building, is temperamental in the beachfront rooms. And we felt that, while the no smoking policy is explained to people, some guests seemed to think that smoking on the terraces was allowed, thus filling the air conditioning units with second hand smoke. Notices on the terraces, please!!!", "title": "Clean and Beachfront", "user": "Amanda M", "date": "May 28, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 162120659}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Wanted a car-free Cape excursion and this hotel \"fit the bill.\" It is an easy 10 minute walk from the ferry to the hotel. (We took the 90 minute high-speed ferry from Downtown Boston; roundtrip $85) Downtown P'town can be a bit noisy and congested and I appreciated that this hotel was outside the hub but right on the bay. Breakfast was included and it had a nice variety of offerings. Our room was clean with two double beds. Our sliding glass door leaked during a rainstorm and left our carpet wet. The reason I am giving this hotel a lower rating is because the back verandas that look out on to the bay are not private and they are loud. If the management could address this I would give this place 5 stars (and if you fellow Traveller don't care, then this is a 5-star spot with great prices and amenities. Did I mention clean pool?) On our stay people came up and down from the beach via the back verandas. Because there are no locks on the screens, we had to keep our door to the ocean closed at night because of guests coming and going. We loved the chairs on the veranda and sat out with a glass of wine, but again, with people coming and going it felt less private", "title": "Excellent Accomodation!", "user": "jacobsfamily29", "date": "May 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161987081}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "We stayed at Surfside Inn twice already and we always made sure we get the waterfront view. As always, no complaint. Staff are friendly, breakfast was yummy and it is a pet friendly atmosphere so we feel right at home. Our pets really loved the stay and we would come again....hopefully soon:) Oh yes, it is not that far of a walk to get to down center.", "title": "Excellent beach front hotel in Ptown!", "user": "Cherie1962", "date": "May 27, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 161969370}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We decided on this place because we were looking to save money and also only required a single night in Provincetown. The B&B's on Cape Cod have a tendency to be pricey and most require a two night stay on weekends. The reviews on Tripadvisor were what sold us on the Surfside Inn so we thought that our stay would be pleasant. Unfortunately, the place is little more than a standard motel, with a less than interested staff and honestly feels like a beachside property in Daytona with immature college kids partying in their rooms.", "title": "Careful what you sign up for", "helpfulness": 2, "user": "LoveTravels", "date": "June 17, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 164317192}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "From the pictures we expected the place to be quaint, not luxurious but cozy and comfortable. Whatever efforts were made to update our king bed room did not succeed in making the space feel like a nice place to spend the night. Everything seemed cheap, low-grade and questionably clean (bunch of long hairs in various places in the bathroom).", "title": "Incredibly Clean, Lovely Accommodations, Terrific View and Excellent Customer Service.", "user": "Lucepooch", "date": "June 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163663618}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "As mentioned before the young, drunk guests, kept us up not by simply staying up late in their rooms with a bit of noise but worse, by slamming doors, screaming/swearing outside of the rooms and setting off the fire alarm twice. After a long day on Nantucket and difficult drive to Provincetown in a torrential downpour this place did not meet our expectations. Also the breakfast that was included in our room rate was laughable, which ended up not being a problem because Provincetown has many delicious brunch places but still.", "title": "Excellent place to stay", "helpfulness": 1, "user": "Tacovelli", "date": "June 9, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 163506864}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Lastly, the room left a terrible stale/mildewy scent on everything that was taken out of our luggage only adding to the overall less than pleasant experience.", "title": "Great Get Away Weekend", "helpfulness": 1, "user": "Danielle H", "date": "June 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163184230}, {"rating": 4.0, "stay_parameters": "Stayed May 2013", "text": "If the new/remodeled rooms in the pictures actually exist at the Surfside than we were kept FAR away from where they are.", "title": "Mis-informed", "user": "andyjennings", "date": "June 5, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 163108637}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "Elaine and the staff are always welcoming. I got married on that beach 5 years ago, and family and friends stayed there and loved it. Fanizzi s threw us a wonderful party. It's the perfect set up for happiness, great rooms, great restaurant, and amazing Provincetown!", "title": "Return return!", "user": "Chris M", "date": "May 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161875101}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "short walk to town but on quite side with private beach, great views the king room was only a few steps to beach .there was a great restaurant right next door for lunch and dinner . the room comes with a great breakfast of waffles and bagels and eggs and fruit would stay here again.", "title": "great location", "helpfulness": 1, "user": "j z", "date": "May 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161535670}, {"rating": 4.0, "stay_parameters": "Stayed May 2013", "text": "I would definitely stay at the surf side again. The room was clean and the view in the water front room was beautiful! We didn't get to enjoy a fire at the fire pit due to the wind but it looked like a nice place to sit and relax. Breakfast was really good with a lot of choices. There was something for everyone. The staff in the lobby were helpful and very friendly.", "title": "Room had an awesome view!", "helpfulness": 1, "user": "ktrishf102", "date": "May 20, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 161336899}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "I've been going to the Surfside for a number of years. We generally come to town two times a year, and have been pleased with each stay. The prices are affordable, the staff are friendly, and the accommodations are perfect for a comfortable stay close to town and right on the water. They offer a great outdoor space, perfect location and are next to great restaurants. The rooms are clean and comfortable and the waterside views leave little need for much else. Enjoy!", "title": "Consistent Quality!", "user": "Crystal C", "date": "May 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 161268268}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Stayed for a weekend in a waterfront king and the view was beautiful! The waterfront stepped out onto a balcony which accessed the private beach. They offered a free breakfast of bagels and fruits,eggs,hash as well as coffee. It's conveniently located on the road that leads to the center where the shopping and food and pier is a must!!! The rooms were clean and spacious. I would definitely return.", "title": "Great View!", "user": "BostonMaDiner", "date": "May 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 161251667}, {"rating": 5.0, "title": "A great place in a fab location....", "text": "This is a a fab motel in a perfect location....beautiful stroll along Commercial St, overlooking the ocean, with great bars and restaurants close by. The beds were sooooooo comfortable and the shower was excellent. We had two dogs who were made to feel very welcome and a 12 yr old who loved the pool area. All the staff were fab, especially Timothy .Will be returning to Provincetown soon and wouldn't stay anywhere else.Thank you for a memorable weekend Surfside!!", "helpfulness": 2, "user": "Carole G", "date": "June 4, 2013", "id": 163025106}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Surfside was recommended to us by a friend. The rooms were fabulous - modern and fresh. They were well sized and comfortable. The oceanside view is worth every penny.", "title": "Fabulous", "user": "Diane R", "date": "June 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162997081}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The staff was efficient, friendly and eager to help.", "title": "Wonderful", "user": "Jim S", "date": "June 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162987250}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "The free breakfast buffet was delightful - continental with a twist ( french toast, waffles, sausage etc).", "title": "Adorable!", "user": "Df1029", "date": "June 3, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 162849580}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Although it was cold when we were visiting the firepit was very inviting. Everyone just gathered around and chatted. Very friendly atmosphere.", "title": "This one is a gem", "user": "ColdRumble", "date": "May 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 162559216}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 25, "average": 53, "very good": 102, "terrible": 15, "excellent": 199}, "aka": "Surfside Hotel And Suites", "slim_ranking": 0.272727272727, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Overlooking Cape Cod Bay and Provincetown Harbor. Private beach, outdoor heated saline pool, complimentary breakfast, free WIFI, free parking. Courtyard with fire pit, bar service from our Lighthouse Bar. Easy walk to town, 3/4 of a mile through the art district. Pets welcome, pet treats, pet station and pet shower."}