{"user_rating": 4.5, "review_count": 291, "name": "Surf Motel and Gardens", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "Really enjoyed our stay. Could not hear the neighbors which is always a worry with a cheaper hotel. The gardens are gorgeous, staff firendly ad courteous, room clean and nice size..", "title": "Great place for price", "user": "cavemanfortbragg", "date": "September 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 78500569}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We love to come to Fort Bragg with the family and stay at the Surf Motel and Gardens. You can't beat the value, it has a great location, and the service is great. I would recommend the Surf Motel and Gardens to all my family and friends.", "title": "Great room, great value, great location.", "user": "Shannonbuck", "date": "September 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78415034}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "Stacy and Shannon Buck", "title": "Surrounded by flower gardens, this very clean, comfortable place is worth the money.", "helpfulness": 1, "user": "kbettyo", "date": "September 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 78385307}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "For an overnight vacation up the coast, was pleasantly surprised to find this place on a one page website. It has brightly flowering gardens in the middle of the parking area and in every corner, as well as in the large picnic area behind the motel. The room was standard sized but had been newly renovated so it was very clean, quiet and comfortable. The free breakfast is an adequate coffee, juice, fruit and packaged pastry. It is a few minutes from downtown Ft. Bragg's restaurants and activity, but even better, is only a 10 minute ride to the town of Mendocino. I saw a few dog owners with their dogs there so i'll be keeping that in mind for the future. Another plus is that the useful Harvest Market is right behind the motel where you can get just about anything you need.", "title": "Great stay", "user": "eeg47", "date": "August 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 77541087}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "From the time I called to inquire about reservations until the time we checked out, all employees at the motel were helpful, friendly and cheerful. The rooms (one single with a king bed and one double with two queens) were good sized, totally clean and well made up in the two nights we stayed there. The gardens and gazebo in the center of the parking lot made this gardener envious at the planning, planting and beauty of area. It gave me plenty of ideas and I took loads of pictures to take to the nursery. We were in", "title": "Comfortable place to stay", "helpfulness": 2, "user": "RobinC21", "date": "July 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 71636149}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "Just the right price for a clean and nice room. We really liked the gardens outside. It's also conveniently located. There are a lot of restaurants nearby and it's not far from Mendocino.", "title": "Cozy and very convenient", "user": "mdegty2007", "date": "September 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 79568492}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "My son and I have stayed at this hotel previously. We had a new puppy, so we enjoy that they accept pets. Beautiful gardens and always a good time. We do a craft show in town over the Labor Day weekend and always have a great stay with this hotel.", "title": "Excellent place to stay", "user": "rgemdesigns", "date": "September 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79519548}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Cathy Nielsen", "title": "a night spend in fort bragg, ca", "user": "cabeachLodi_ca", "date": "September 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78856794}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "R Gem Designs", "title": "Great Place To Stay", "user": "preteach", "date": "September 8, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 78717243}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "we had driven from home on spending the night in fort bragg. we went with out reservations, we arrived at fort bragg at about five pm.we drove around looking for a motel to spend the night at,we went to acouple of places , their rates were to high. we drove down south main street,we arrived at 1220 surf motel and gardens,my wife went in to check the motel rates.the rates were within our buget. the people in the motel were some of the nices people mi have meant in my life. the motel was very clean and well kepted. he next morening i went to eat breakfast,the food they had was good. when we left i turned our keys and told the people that we would be back, they nsaid hope to see you again.", "title": "Pleasant", "user": "michele51", "date": "September 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 78555244}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Great, or I should say spectacular gardens on the motel grounds. Great price for an impeccable room. Three cheers for the owner of this motel.", "title": "Stunning stop", "user": "tony838", "date": "October 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 84367019}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Nothing fancy, but nothing wrong either. Rooms were big and clean if simple. This is a motel in the classic sense so don't get too excited. The only complaint I could make was that the windows were unlocked when we arrived and I almost didn't notice.", "title": "Simple, but Solid Choice", "user": "fbeaven", "date": "October 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 82901481}, {"rating": 5.0, "title": "Beautiful place, nice people", "text": "Very beautiful grounds with tables, flowers and dog area. Good location with stores nearby but not too close", "user": "Sayegh", "date": "October 1, 2010", "id": 81726388}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "P Sayegh", "title": "Great Motel in Fort Bragg, CA - Surf Motel & Gardens", "user": "ripkens8", "date": "September 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80526622}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "We stayed one night at the Surf Motel & Gardens in Fort Bragg, CA. The motel is one story and the rooms have comfortable beds, small refrigerators & microwaves, plus powerful little built in hair dryers!. Plus all channel cable tv and free internet access in the lobby. A small continental breakfast of pastry, fresh fruit, orange drink and coffee is served. If you are still hungry, Macdonald's is a one minute walk on the same side of the street. It was quiet at night, even though a tour bus had come in, we didn't hear a sound. We watched the Giants baseball game in the comfort of our spacious room which also had a table and two chairs. The staff was warm and friendly. Amanda & Karen are so nice! I high recommend this motel. It is also a 5 minute drive from the Skunk train and they have a free Skunk Train shuttle at the motel too. One other plus is a shopping center on the same side of the street in the other direction. The Harvest Market is a beautiful market. It is like a department store and the most beautful one I've seen since Whole Foods. All in all the Surf Motel & Gardens is a real winner!. Rates were reasonable. Our room with Queen bed cost around $87 which included the AAA discount! They even have a built in wonderful dog run for man's best friend!", "title": "Really beautiful setting", "user": "kathyYubaCity", "date": "September 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 79706864}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "On of the best places we stayed in on a 33 day cross country trip. Clean rooms and property,lovely gardens and a great staff. We would stay there anytime we would be in that area.", "title": "Great place to stay", "helpfulness": 2, "user": "lousueCocoaBeachFl", "date": "July 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70149108}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "I have enjoyed my stay very much at Surf Motel, the room was very nice and bedding very clean and comfortable. Very well maintain garden which makes it unique from other hotels. The staff was very helpfull and accomodating specially Karen at the front desk. Will definitely stay here again next time in the area.", "title": "VERY NICE ROOM & BEDDING VERY CLEAN AND COMFORTABLE", "helpfulness": 1, "user": "Ronaldraju", "date": "June 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68600014}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "Nice and clean motel, friendly staff, nice flowers around. Quite close to beach. Simple breakfast.", "title": "Nice and clean, beautiful flowers around", "helpfulness": 1, "user": "harmonyrunner", "date": "June 23, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 68384374}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We happened upon the hotel by mistake but it is so nice.! It may not be on the ocean but it has an ocean of beautiful flowers, I have never seen anything like it. The room was spotlessly clean down to the blinds(no dust). The owner and his wife were so hospitable and even took us on a tour of his garden. I would definitely stay at this motel again. I try not to be to picky of a person but the owners of this motel go above and beyond at keeping it clean.", "title": "spotlessly Clean and the gardens are a must see", "helpfulness": 1, "user": "lindanana5", "date": "June 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67272439}, {"rating": 5.0, "title": "Another great stay at our favorite Ft.Bragg (Dog-Friendly) Motel and Beautiful Gardens....", "text": "Well, we used to camp when we stayed in Ft. Bragg.....but, we have become quite spoiled staying here with Mr.Reddy and his family and staff. Everything is so well cared for here....gardens are amazing.......your own little Botanical Gardens right outside your door!", "helpfulness": 1, "user": "Judy D", "date": "June 8, 2010", "id": 66915044}], "location": {"country": "United States"}, "variance": {"poor": 7, "average": 29, "very good": 99, "terrible": 5, "excellent": 151}, "aka": "Surf Motel And Gardens Hotel Fort Bragg", "slim_ranking": 0.181818181818, "description": "Comfortable rooms with some ocean views, in room coffee, refrigerators, microwaves and hairdryers. Continental breakfast, beautiful gardens, and pet-friendly. We also have a free shuttle service available. Close to Noyo Harbor and Skunk Train. Packages available for local attractions."}