{"user_rating": 4.0, "review_count": 69, "name": "Swan Inn", "reviews": [{"rating": 5.0, "title": "Lovely - will definitely visit again.", "text": "The guest room we stayed in had been recently refurbished and the attention to detail was excellent. Very comfy bed, gorgeous bathroom and really nice finishing touches to the room. Beautiful surroundings; Moreton is so pretty. We would definitely recommend staying at the Swann Inn. I also gathered that the establishment had changed hands in the last few months and that more refurbishment works are planned.", "user": "ZedHull", "date": "May 24, 2010", "id": 65134956}, {"rating": 4.0, "title": "The real inn feeling", "text": "We were attracted by the cozy outside at first. And the room was even better. Great stay, too short, we'll be back!", "user": "Cleanstream", "date": "September 1, 2010", "id": 77774452}, {"rating": 2.0, "title": "very poor room and much overpriced", "text": "Apparently the inn is undergoing improvements but the room given to us was the worst room we've ever stayed in.There was no bed head, no lamp shade,the state of the decor and finish of the room and bathroom was horrible. Paid £220 for two nights and in our oppinion not worth half that amount. The breakfast wasn't great the ingredients were poor quality accompanied by the annoying sound of the hoover in the other part of the bar. If you had to let yourselves in after 22.45 you had to make your way through a scruffy kitchen area. Our stay was a very dissapointing experience especially after we seeing all the lovely places we could have stayed for the same money.", "user": "adenhewitt84", "date": "August 23, 2010", "id": 76501067}, {"rating": 4.0, "title": "value for money, also served a good pint in the bar", "text": "We were geting anxious about being able to find accommodation on Saturday night but the welcome we recieved was genuine and made our stay all the more relaxing and value for money.", "user": "brewerboy", "date": "July 4, 2010", "id": 69662360}, {"rating": 5.0, "title": "Great accommodation, Great food, Great value!!!!!", "text": "Was a little apprehensive when booking as this Inn has no official classification and therefore was a little wary, but absolutely no need to worry! The standard of the accommodation was 1st class and pretty luxurious for the money. The room we stayed in had recently been refurbished and was more than comfortable. The little things really made a difference such as slippers, ipod docking station and LCD television. The bathroom was stunning with great attention to detail such as movement sensitive lighting.", "user": "Jut1974", "date": "June 28, 2010", "id": 68900052}, {"rating": 5.0, "title": "Swan inn should be first choice for the Cotswolds", "text": "The service was very friendly and efficient and the breakfast in the morning was lovely. We also ate in the restaurant in the evening which was pretty good value and again extremely good.", "user": "ray_harmer", "date": "May 24, 2010", "id": 65183477}, {"rating": 4.0, "title": "Hidden gem, don't let first impressions put you off.", "text": "Lovely little hotel. Great rooms, fantastic service, ideal location and really nice food. My only criticism is the furnishing of the bar area which lets the hotel down. Other than that a perfect hotel and one in which we would stay at again.", "user": "CLM78", "date": "September 28, 2010", "id": 81393332}, {"rating": 5.0, "title": "Beautiful Inn in the beautiful Cotswolds", "text": "This is a lovely old pub right on the main street in Moreton-in-Marsh, and close to everything. Train station and bus stop are a short walk away, and there are wonderful shops the whole length of the street. The room we had upstairs was very small, but was impeccably clean and beautifully decorated. Every amenity was provided, and with taste and style. Sarah, the gracious and hard-working owner, and her family have done a fantastic job. We ate in the pub one night, and the food was great! The second night, for variety, we ate at a good Indian restuarant at the end of the street. Only itty bitty drawback was that our room faced the back garden where patrons of the pub would gather at night, so it was a bit noisy, although it didn't last into the late night. Beds were very comfortable, so slept soundly. I would most definitely stay here again!", "user": "peachycoco", "date": "September 28, 2010", "id": 81373917}, {"rating": 5.0, "title": "First Class Accommodation & First Class Service", "text": "We stayed at the Swan Inn for 3 nights and had a great stay as part of a cycling weekend. I cannot disagree more with an earlier less-than-favourable and if I may say so unfair review of the Swan Inn whose author might have forgotten that it was a family-run Inn they were staying in not a chain hotel with round the clock reception. So what if you have to let yourself in late at night! You're given a key, you use it, and you get in! Yes you go through a (clean) kitchen area, and for me it was part of the charm of staying at this Inn; and actually it made me feel more at home and more welcome.", "user": "Londonmammoth2", "date": "September 14, 2010", "id": 79493360}, {"rating": 5.0, "title": "There's more to The Swan than you might imagine!", "text": "Apart from a little bit of night-time noise from a Friday night disco in the pub below (which ended before midnight) we had no problems on our stay here. The owners were very accommodating, helpful, friendly and welcoming. They always seemed to have time for us when we needed advice and even kindly let us use their computer/printer facilities when we were desperate to print out some maps. The breakfasts were generous and good quality, and apart from the usual English cooked breakfast, there were a variety of cereals, fruit, juices and yoghurts on offer. We once had dinner at the restaurant and that was delicious and good value too. There is a pool table and a dart-board on the pub side of the Inn also.", "user": "Carolesusan56", "date": "September 13, 2010", "id": 79427242}, {"rating": 4.0, "title": "A lovely homely place to stay", "text": "What impressed me most was the quality of the accommodation: clean, generous, modern, comfortable bed with quality bedding, LCD TV, spacious en-suite bathroom with essential toiletries and even a pair of disposable slippers ... and such good value for money. It was a bonus to have free access to the Internet too through a Wifi connection.", "user": "rikrus", "date": "September 7, 2010", "id": 78570191}], "location": {}, "variance": {"poor": 9, "average": 13, "very good": 17, "terrible": 3, "excellent": 27}, "aka": "Swan Hotel Moreton-In-Marsh", "slim_ranking": 0.526315789474, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.5, "location": 4.5}, "description": "The Swan Inn is family run, we are open all day for food, our food is homemade and as far as possible locally sourced.We have undertaken a refurbishment program and all our 8 rooms are en suite with showers. We are located within the heart of the town at the junction of the Stow on the Wold (A429) and the Bourton road (A44)."}