{"user_rating": 4.0, "review_count": 40, "name": "Swartberg Country Manor", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "My wife and I stayed here for a nite, as part of our drive from Cape Town to PE in June 07.", "title": "Amazing location, but chilly in winter", "user": "RoryMc", "date": "July 17, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 8132054, "likes": {"liked": "— The location", "disliked": "— The cold!"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The location of this guesthouse is breathtaking, with the Swartberg mountains all around, and it feels very remote, a real African experience, and very cheap.", "title": "Nice Getaway for 1-2 night", "user": "Jossu", "date": "April 26, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 7471882, "likes": {"liked": "— Cosy feeling", "disliked": "— quite far from the city"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007", "text": "The staff were pleasant, especially Rudy, who gave some great advice on where to travel to locally. The rooms were OK, but without a TV. We felt it would be absolutely lovely in the height of summer, but it was very cold when we arrived at 6 pm, and there was no heating on in the house or our room. There was a small radiator in our room, but it took several hours to warm up.", "title": "Fantastic location", "user": "Gadriye", "date": "March 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7229042, "likes": {"liked": "— Everything", "disliked": "— No dislikes"}}, {"rating": 4.0, "title": "great room", "text": "We were served a lovely dinner in the dining room, beside a lovely log fire, that would have been delightful if it had been lit!, and the breakfast the next morning was perfect to send us on our way.", "user": "spark48", "date": "March 8, 2007", "id": 6935647}], "location": {"country": "South Africa", "continent": "Africa", "city": "Oudtshoorn"}, "stars": 4, "variance": {"poor": 2, "average": 5, "very good": 11, "terrible": 2, "excellent": 20}, "aka": "Swartberg Country Manor Oudtshoorn", "slim_ranking": 0.555555555556, "description": "Swartberg Country Manor is nestled on the farm \"Voorbedacht\" situated in the Cango Valley at the foot of the world-renowned Swartberg Pass. The picturesque panoramic view of the Swartberg Mountains will bring comfort to anyone that wants to \"get away from it all\" and simply soak up the peace of its tranquil surroundings.The farm was purchased in 2003 and welcomed its first guests in February 2005. The extraordinary views of the Swartberg Mountain from the veranda of the original farmhouse compelled us to create a venue where more people could share in the tranquillity and serenity of this beautiful valley.\"Voorbedacht\" farm is a working farm, which offers our guests the unique opportunity to explore and experience the true essence of subsistence farming in the Little Karoo. Among the various agricultural products farmed, we also farm livestock such as, cattle, sheep and ostriches. Daily walks on the farm allow guests to experience the peace and serenity of this beautiful valley, while for the more \"wild at heart\"; mountain bikes are available to explore the more rugged terrain."}