{"user_rating": 4.0, "review_count": 55, "name": "Sweet Dreams Bed & Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "My wife and I stayed one night and found the hotel to be very helpful in finding our way around, the room was very nice one of the best we found during our travels and breakfast was of a good quality.", "title": "Very good Location", "helpfulness": 1, "user": "RobertAustralia", "date": "November 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120357188}, {"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "They kindly let us keep our luggage there for until the afternoon and let us use the facilitys when we returned for it.", "title": "Good value and location, but be aware of a few problems", "helpfulness": 3, "user": "Danka N", "date": "November 4, 2011", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120174644}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Would definatley stay there again and worth the other good reviews.", "title": "Great place - very much recommended", "user": "Debica2808", "date": "September 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117654975}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "Sweet Dreams has an excellent location a few meters from the Vatican. The accommodation is comfortable and clean. However I give this accommodation a one star rating because of the following:", "title": "This place is fabulous!", "user": "FairsWestSussex", "date": "August 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116577470}, {"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled solo", "text": "1. Owner will add ‘tax’ to the final bill", "title": "Seek alternative accomodation", "user": "kenaldouk", "date": "August 24, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 2.0, "rooms": 1.0}, "id": 38658828}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled with friends", "text": "me and a friend of mine slept in this b &b for 4 nights and I found it perfect. it is 50 metres far from San Pietro, the b & b is very very quiet.", "title": "perfetto!", "user": "phibi", "date": "December 14, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 22719212, "likes": {"liked": "— the position, quality/price", "disliked": "— there is not an elevator but there are a lot of stairs and the rooms are not big"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007", "text": "the personal is not there all day and night long therefore they provide you with the keys and you can come and go like you want. breakfast is from 8 am to 10 am and the rooms are cleaned daily. just, the b &b is at the third floor of a building withour elevator so it is not the right place if you have problems with stairs or if you are on a wheelchair. also the rooms are not big. I spent very little money for the stay considering the location and the service we had. i'd advice this B & b to anybody, it is very quiet, clean and cheap.", "title": "Loved Sweet Dreams", "user": "DMKP", "date": "January 16, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 12699093, "likes": {"liked": "— Proximity to sites of interest, friendly housekeeper, cleanliness", "disliked": "— No outgoing telephone"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Having seen the pictures of the Sweet Dreams b&b I wasn't disappointed. We were welcomed by Gerry the housekeeper who was most polite and did what he could to make our stay comfortable. He was present every morning to serve us the breakfast and kept our room very clean.He even went out of his way to get us a wine bottle opener :) The kitchen is accessible which proves useful after a long day of sightseeing if one doesn't fancy sitting in a restaurant.", "title": "Close to everything near the vatican", "helpfulness": 2, "user": "wish403", "date": "November 7, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 10661642, "likes": {"liked": "— The close proximity to Vatican Square,St peter's basilica,Sistene Chapel. and transport to other destinations", "disliked": "— The stairs,61 of them but apparently this is not unusual in Europe and bedrooms are small but quaint."}}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "variance": {"poor": 1, "average": 8, "very good": 21, "terrible": 2, "excellent": 23}, "aka": "Sweet Dreams Bed And Breakfast", "slim_ranking": 0.245650372825, "description": "Sweet dreams is situated into the luxurious street Via Cola di Rienzo, full of shops and boutiques and just 150 meters from the the Vatican City and a few minutes walking from the Vatican Museums.The rooms are furnished in modern style and decorated with refined combinations of black and white. The rooms are quiet and feature a private bathroom with shower or bath, cable tv, air conditioning, minibar, secure box, heating, hair dreyer, frette’s linen and towels. In the large and bright breakfast room you can enjoy a typical italian breakfast which consist of coffee, cappuccino and croissant. From 12.00 the kitchen and breakfast room are at guests' disposal.Located on the second floor of an elegant building SweetDreams has free wi-fi. It is located in a strategic position, just 100 meters from the metro Ottaviano-San pietro and a few meters away from the Vatican Museums, Castel Sant’Angelo, Piazza di Spagna, Piazza Navona and The Pantheon. Thanks to its strategic position, just 100 meters from the metro Ottaviano-San pietro, Sweetdreams allows to reach in 5 minutes walk the most important monuments: the Vatican Museums, Castel Sant’Angelo, Piazza di Spagna, Piazza Navona and The Pantheon."}