{"user_rating": 5.0, "review_count": 519, "name": "Swinton Park", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "We decided to haveChampagne Afternoon Tea here for my daughters early Birthday present seeing as she was due to be away for her Birthday", "title": "Afternoon Tea", "user": "Terryhird", "date": "August 14, 2013", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 4.0}, "id": 172244605}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The staff were nice and friendly", "title": "A house in the Country", "user": "car_trekker", "date": "August 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 172043568}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The tea was lovely, we were completely full afterwards", "title": "You haven't failed to impress yet again!", "user": "Celine C", "date": "August 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171910873}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "We had a walk around the grounds and toll loads of photo's", "title": "Simply flawless.", "user": "TripLoner", "date": "August 11, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 171772584}, {"rating": 5.0, "title": "Food on a par with the best", "text": "Would love to go back again at a later date", "user": "LindfieldHedonist", "date": "August 9, 2013", "id": 171523390}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "This is a great hotel venue if you want old-world charm and elegance. If you prefer modern hotels run by 'the brands' this hotel isn't for you. It's an old building with big windows, ceilings and corridors. You can sense the history of the place as you walk round. The staff and service are excellent. The food impeccable and wine list is both extensive and good value. The grounds are lovely and there's some great walks. Go there. I'll be returning again that's for sure.", "title": "One of the best", "helpfulness": 1, "user": "Tickandbash", "date": "August 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 174375815}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Had a one night stay here on the way back from a roadtrip around Scotland. It's a beautiful hotel, the service is great and the meal in the restaurant was delicious. There's a very relaxing atmosphere, the only thing that slightly marred our experience was other guests watching videos (with sound) on their mobiles in the restaurant - but I would hope this is a one off!", "title": "Lovely", "user": "jojom999", "date": "August 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 174347985}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We got married at Swinton Park and had exclusive use the weekend of Saturday 15th to Monday 17th June 2013, and we found it to be the perfect venue for a residential weekend wedding with around 60 guests (and one dog, who was equally well looked after!).", "title": "Fantastic Romantic Wedding Venue", "helpfulness": 1, "user": "NigYorkshire", "date": "August 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174195515}, {"rating": 3.0, "stay_parameters": "Stayed August 2013", "text": "Somehow, they managed to give us the illusion that this lovely magical place was ours for the time we were there, and staff carried out perfectly the delicate balancing act of being on hand to meet the guests’ every need, yet somehow also semi-invisible, working away in the background rather than taking over and being constantly in people’s faces with offers to serve.", "title": "Don't stay in Pickering", "helpfulness": 4, "user": "Ifzitzigc", "date": "August 16, 2013", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 1.0}, "id": 172505055}, {"rating": 5.0, "title": "A beautiful place", "text": "From the moment we arrived on Saturday to leaving after breakfast on Monday, everything was brilliantly executed.", "helpfulness": 1, "user": "sui106", "date": "August 15, 2013", "id": 172396782}, {"rating": 5.0, "title": "Lovely Posh Afternoon Tea!", "text": "We called here just for afternoon tea. It was absolutely lovely. The gates and driveway with deer and swans on the lake made us feel very special followed by seeing the lovely castle in which the hotel is located, with a turret covered in Virginia Creeper in autumn colours. There was a shooting party with landrovers in the driveway which fitted into the scene. We had a choice of proper lose tea leaves and the cakes were \"to die for\"! Lovely little home-made delicacies. After tea we had a walk round the very extensive grounds.", "user": "PFNottingham", "date": "September 21, 2013", "id": 178007677}, {"rating": 5.0, "title": "Stunning Venue", "text": "The room where we were served tea was so lovely with lots of beautiful old pictures, a big, real fire and beautiful flower arrangements. The sofas were quality and comfortable!", "user": "Suzii1984", "date": "September 19, 2013", "id": 177752288}, {"rating": 5.0, "title": "Great place to relax. Highly recommended.", "text": "Overall, our short visit made us feel very special.", "user": "ChrisB369", "date": "September 16, 2013", "id": 177390126}, {"rating": 5.0, "title": "Amazing Wedding Venue and Hotel", "text": "We would like to come and stay here. The only reservation we would have would be if they had a wedding on and there was noise at night. I got the impression they do lots of weddings. The noise at night may not happen - I'm not sure - but I would check it out and may ask if they have a wedding on and stay another time. I would love to do a course at the Cookery School. There seemed to be so much available to do at this place and the grounds are so lovely it would be possible to stay for a few days and never leave the hotel at all! A very special place.", "user": "TheTolsons", "date": "September 15, 2013", "id": 177244263}, {"rating": 5.0, "title": "Amazing stay. Only wish we could stay longer.", "text": "I came here for Sunday lunch last week with my husband and family.This place is very special to us as we held our wedding reception here in 2011.This was our first time returning since our special day. I am pleased to say that Swinton Park has not lost its magic.Such a beautiful place that gives you the feeling that you have stepped straight into a fairy-tale. Prior to lunch we relaxed in the grand surroundings of the drawing room until we were ushered through to Samuels’s restaurant for our three course Sunday lunch. We had our wedding breakfast in this stunning room and it fetched back lots of lovely memories. Just like we remembered, the food was exceptional and the service from the staff at Swinton Park has to be one of the best we have ever come across. After our lunch we went for a walk around the beautiful grounds. We borrowed some boots and a raincoat that are kept in the cloakroom for guests. If you want to feel like royalty for a day/weekend then this is the place to come. Having taken the castle exclusively for our wedding back in 2011, I can also vouch for the quality of the rooms - AMAZING. If you are after a bit of something special then stay in the Turret Suite which is across three floors.A three course Sunday lunch costs £28 per person and in my opinion is definitely worth the money as the food is of the highest quality.We will definitely be returning on a more regular basis.", "user": "Wilson689", "date": "September 14, 2013", "id": 177152123}, {"rating": 5.0, "title": "A fairytale retreat", "text": "This was our first night away since having our son in May and was a special treat for our 6th wedding anniversary. I had always wanted to try this hotel since seeing it on The Syndicate last year and it didn't disappoint. From the moment you drive through the gates and see the red-ivory clad tower you know you are in a very special place. We loved every minute of our (too-brief) overnight stay here. With 31 bedrooms this is a reasonably sizeable hotel but you wouldn't know it as you are treated as though you are a VIP - when we arrived in our room there was a hand-written card and box of chocolates on the bed to say Happy Anniversary. It is small touches like this that really make you want to return - the service really is superlative. The room we had was beautifully decorated with views over the parkland...we could see swans gliding down the river. Again lovely little touches like homemade shortbread and complimentary gin and whiskey just make the place extra-special. The food in the restaurant is gorgeous and the atmosphere whilst formal is not stuffy. Drinks before and after in the drawing room are the icing on the cake. A walk in the extensive grounds around the lakes is the perfect cure to blow away the cobwebs from dinner the night before. Given the extent of the grounds, the Molton Brown toiletries in the bathroom and the ginormous, comfy beds, there is little need to watch TV but if you were planning on a TV session this is the only time you may be disappointed as the choice of channels is limited and reception not brilliant. This truly is a wonderful place to stay - we loved every minute and felt more like invited guests at a country house rather than paying guests in a commercial hotel. We will definitely be back and couldn't recommend it more highly.", "user": "CLM78", "date": "October 11, 2013", "id": 180608000}, {"rating": 5.0, "title": "A dream", "text": "The Swinton Park is a gorgeous property with a superb staff, lovely dining room and nice touches everywhere. Overall, staying there was a wonderful experience - like a dream. (PS We had one of the less expensive rooms and it was still lovely.)", "user": "Explorer224", "date": "October 9, 2013", "id": 180347406}, {"rating": 5.0, "title": "Excellent as standard", "text": "5 years since our last visit and very happy to see that Swinton Park has retained the level of excellence since our last experience.", "user": "jonforeigner", "date": "October 8, 2013", "id": 180176235}, {"rating": 5.0, "title": "Splendour in the Park", "text": "Friendly professional staff with a superb menu and set in beautiful peaceful surroundings.", "user": "greenfield31", "date": "October 7, 2013", "id": 180088334}, {"rating": 5.0, "title": "beautiful place", "text": "Recommend a walk around the lakes in the grounds.", "user": "Tina marie S", "date": "October 7, 2013", "id": 180085004}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Superb setting excellent service and food. Staff and mangement very helpfull and friendly.", "title": "Excellent quality castle hotel and grounds", "helpfulness": 1, "user": "Chezlard", "date": "August 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172379146}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Superb decor stately but not stuffy. Veried clientelle.", "title": "Wonderful in Every Way", "helpfulness": 1, "user": "kategod", "date": "August 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172343673}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Wonderfull to relax and be pampered.", "title": "Excellent service", "user": "Rammina", "date": "August 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172274639}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Wonderfull walks around grounds and gardens - birds of prey centre and lovely deer", "title": "Relaxing break", "user": "simpsonmitchell", "date": "August 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172270118}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "From the moment you arrive and see the magnificent castle-like structure of the hotel in front of you, you can be sure that Swinton Park is going to provide one of the most memorable hotel stays you have ever had. It's grand and homely at the same time - beautifully stylish, but never pretentious. The grounds are magnificent and frankly I would have been happy never to leave them - although with the splendour of the Yorkshire Dales all around, that would have been a shame. It's possible to walk for hours, whether it's around the lakes - the one nearest to the hotel is truly idyllic, and inhabited by a number of ducks, moorhens and a pair of swans with four cygnets - and the deer park, or in the marvellously wild and magical walled garden - or just find a sunny spot and read a book whilst contemplating the superb views. We enjoyed a fantastic owl experience with the resident falconry expert Sophie, and our children were able to go pony trekking round the Swinton estate. The bedrooms were without doubt some of the best we have ever enjoyed in an hotel - real five-star luxury, with no detail overlooked. The Semerwater family suite is beautiful and appears to have been newly refurbished - the bathroom was exceptional, especially the bath for two which was more like a plunge pool! I tried hard to think if anything had been forgotten but everything is here - even an iron and ironing board, and cafetieres to make proper coffee. Even the teabags were Yorkshire Tea! Housekeeping standards are excellent. Our children even received super (and very high quality) age-appropriate activity packs on their arrival - this is one luxury hotel which genuinely welcomes children. The food: well, it's equally wonderful. A great choice of items at breakfast - a good selection of dishes at lunchtime, should you choose to lunch there - and in the evening both the Classic menu and the signature Tasting menu are proof of the chef's delicious creative skills. Perhaps the bar is the only slight disappointment; although it's in a handsome room it is somehow a little lacking in atmosphere and when my husband turned up one evening just before six it was unstaffed. Unusually for an hotel of this calibre there isn't a comprehensive cocktail list, just a rather sparse and slightly dull list of 'pre-dinner' aperitifs and 'after-dinner' drinks. The barman did make me a great mojito when asked and I'm sure they would be more than capable of rustling up a wide variety of interesting cocktails - I do wonder if the apparent lack of choice puts some residents off using the bar, as most people seemed to prefer to use the drawing room for drinks both before and after dinner. I feel there is potential there which isn't being explored. Anyway: that is a very, very minor quibble; overall this is an amazing hotel, relaxed and friendly yet offering the highest standard of service. It's one of those places you can't bear to leave - but we will be back!", "title": "Fabulous from start to finish", "user": "Ellenanddavid", "date": "August 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172268855}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "In a word- fantastic. The restaurant dinners were superb. The chef is truly serving unique and incredible food. I had a dessert with wood sorrel sorbet. Flavors were put together in absolutely amazing combinations. The presentation was artistic. The food is locally sourced. It is on par with other 5 star restaurant food I have eaten. Add on the fact that you are staying in a castle in Yorkshire and the grounds/ambiance of a working estate, and you really cannot beat it. Also highly recommend the falconry. It certainly isn't cheap, but it is worth the price paid without a doubt. I will not forget my stay here.", "title": "Fantastic", "user": "Zebrafish2006", "date": "August 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171092509}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We stayed at Swinton Park a few weeks ago. Everything from the impressive driveway and scenery to the politeness of staff and fresh food was amazing. The room was fantastic and the view over the cricket pitch and surrounding countryside was just fabulous. Personally, a truly luxurious hotel is about great service, superb surroundings and beautiful food all without being stuffy or pretentious. This hotel ticks all the boxes! The staff are a credit to the hotel. Everyone from the cleaners to restaurant manager and staff made us feel truly welcome and at home. They always had a smile on their faces. The only small gripe would be, when we tried ordering something to eat late at night we were informed by the night porter the food had been \"locked away\". We asked if he could at least make us some cold sandwiches. Seems strange to advertise 24hr room service but then be unable to get anything advertised on the food menu because it's been \"locked away\". But that is the ONLY small gripe of an otherwise great stay. Would we go back? We're already booked in for 3 nights in a couple of weeks and can't wait! Well done Swinton Park. Keep up the good work!", "title": "A stay at Swinton Park is a MUST!", "user": "bails b", "date": "August 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171036126}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "My friend and I treated our husbands and ourselves, to a weekend Clay pigeon shooting and relaxing in the spa. We all had a fabulous time, and looking forward to going back.", "title": "Bought as Xmas gift to husband", "user": "lovelylynn2013", "date": "August 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171034070}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The grounds were beautiful, and the food, out of this world, all fruit and veg home grown, bread home made, as were jams and lemonade, and even complimentary gin and whisky in room.", "title": "Fantastic Food, Lovely Rooms, Indifferent Service", "user": "ANDY K", "date": "August 6, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 170983354}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "If I could find fault at all, it would be (after seeing the wonderful bathroom) the shower was just a trickle, no force behind it, so it was a disapointment. otherwise, a great place.", "title": "Simply Outstanding", "helpfulness": 1, "user": "Andrew J", "date": "July 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169758835}, {"rating": 5.0, "title": "Stunning location, beautiful castle", "text": "Pure indulgence in this luxury castle hotel. Set in parkland, the home of deer. Lakes inhabited with swans and ducks. Beautiful walks, wheelchair friendly.", "user": "Ann C", "date": "September 27, 2013", "id": 178846203}, {"rating": 5.0, "title": "Fabulous!", "text": "Only 30 large double rooms, each individually named and decorated, all needs catered for.", "user": "feelymerl", "date": "September 27, 2013", "id": 178801467}, {"rating": 5.0, "title": "Amazing!!!", "text": "The restaurant very ornate and food second to none.", "user": "Mandy S", "date": "September 23, 2013", "id": 178329674}, {"rating": 5.0, "title": "Fantastic restful break", "text": "As you can tell, I was very impressed.", "user": "Lisa O", "date": "September 23, 2013", "id": 178293975}, {"rating": 5.0, "title": "Fantastic! You won't be disappointed!", "text": "If there was a fault it was the size of the t.v in our room and the lack of choice of stations.", "user": "INTREPID357", "date": "September 21, 2013", "id": 178046280}, {"rating": 5.0, "title": "A wonderfully relaxing and welcoming hotel, where everyone is made to feel special", "text": "We spent two nights in this beautiful, old but comfortable and very beautiful hotel. Every member of staff was so friendly and extremely welcoming and couldn't do enough for us to ensure our stay was special. Our room was large and spacious, the adjoining bathroom was the same. The views from our windows were so picturesque, especially in the early autumn sun, and everything was so quiet, with deer grazing by one of the lakes just a few metres away. The menus offered on both nights were seasonal, encompassing every possible taste and all beautifully presented, and the breakfast menu again offered options to suit everyone. We experienced a massage treatment, which was a wonderful, relaxing start to our stay and again, we were both made to feel very special. The spacious grounds offered gentle walks, the hotel providing maps of the different routes which could be followed. The compacted footpaths made walking very easy and in the main, mud free! We had such a lovely time at Swinton Park and can highly recommend staying there -we look forward to returning as soon as we can", "user": "AJJ2013", "date": "October 4, 2013", "id": 179719993}, {"rating": 5.0, "title": "Fast becoming our second home! Fabulous!", "text": "Everything about this place is amazing and I cannot imagine why anyone could disagree! Tom the general manager keep up the good work and Simon the Chef you are a genius! Can't wait for next visit to spend a wonderful new year again!", "user": "Lamby177", "date": "October 1, 2013", "id": 179323479}, {"rating": 5.0, "title": "VERY SPECIAL PLACE", "text": "We went here for my birthday..fabulous welcome. food was exceptional in grand old room.. coffee and peite flours in lounge whole deal was class..nice attentive staff ,, lovely grounds to walk around near Masham and West Tanfield Tower free visit ..", "user": "king2008", "date": "October 1, 2013", "id": 179290735}, {"rating": 5.0, "title": "Simply Superb", "text": "My wife and I stayed in the Haworth room as part of her 30th Birthday celebrations and I have to say it was one of the best weekends away we've ever had.", "user": "Nathan C", "date": "September 30, 2013", "id": 179189077}, {"rating": 5.0, "title": "A stately experience.", "text": "We had a \"Hawk Walk\" upon our arrival at the hotel with the Hotels bird handler which was a fantastic experience. The birds were beautiful and the handler and her mother assisting her (The Game Keepers family) were great. Really friendly and informative.", "user": "Gerald L", "date": "September 28, 2013", "id": 178912857}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 3, "average": 13, "very good": 53, "terrible": 5, "excellent": 445}, "aka": "Swinton Park Hotel", "slim_ranking": 0.166666666667, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "description": "A luxury castle hotel set in 200 acres of landscaped parkland in the Yorkshire Dales that is the home of the Cunliffe-Lister family and the ancestral seat of the Earl of Swinton. Traditional warmth and hospitality, contemporary comforts and award winning cuisine, with a menu inspired by the produce sourced from the surrounding estate and 4 acre walled garden. Cookery School with day and residential courses running throughout the year. Exclusive use Spa (with Jacuzzi and sauna) and treatment rooms. Conference facilities and licensed for civil ceremonies. Families welcome."}