{"user_rating": 4.0, "review_count": 122, "name": "Swiss Diamond Hotel Lugano", "reviews": [{"rating": 3.0, "title": "Not really 5-star quality", "text": "This hotel was overall, very nice. The mountain view room was a joke- there was no reason to open the curtains. The pool and lake area were very nice. The downside to this hotel was the staff. A few staff members were very nice, but a few were down right rude and snobbish. The restaurant at the lake is a gorgeous setting, but very expensive. My partner and I were not terribly hungry on the night that we arrived, so we just ordered pasta. The waiter seemed to disapprove. We also were not given the table that we were promised when we made the reservation. The head waiter rudely abandoned us and then we were served by a young man, who was much nicer. This other man could not have made us feel less welcomed. My major complaint about this hotel is that if you did not speak Italian, it was very difficult to communicate with the staff. Even knowing German did not help much. In a five-star hotel, I expect the staff to be more multi-lingual. My other major criticism was the breakfast. Not at all appropriate for a 5-star hotel. The breakfast room was too hot (why not serve it down by the pretty lake?). Instead you have no view, or a view of the parking lot and street. The offerings were slim and average or below average quality. Free shuttle service to the town of Lugano was nice. But if you don't speak Italian, you won't be able to communicate with your driver.", "helpfulness": 1, "user": "AmericaninBasel", "date": "August 26, 2009", "id": 38917350}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We went to the Olivella for a weekend getaway and we were not disappointed. The hotel is located approximately 7 km from Lugano. It is a charming little hotel right on the lake with beautiful views.", "title": "Great location and wonderful staff", "user": "leisurebunny", "date": "July 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 34806761}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The service all around was wonderful. My favorite of course was the restaurant Panorama. The meals there are quite lovely and the service outstanding. We had a lake view room and found the room spacious and pleasant.", "title": "A 4 star + hotel", "helpfulness": 1, "user": "jr_hummel", "date": "May 13, 2008", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 15994910, "likes": {"liked": "— the decoration", "disliked": "— the service"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007", "text": "My wife and I just spent 4 days at the hotel in a garden view room: forget the garden view and keep the curtains closed. The hillside view is of no interest however the room is small but lovely (see picture) - a typical large city 4* room. From what we saw the rooms facing the lake are quite larger and have a fantastic view but seem to be not as nicely decorated. The bar off the lobby is exotically decorated and they serve food from the restaurant. There was also entertainment (singer + piano). We really enjoyed the atmosphere. The restaurant on the lake is across the street but can also be reached via an underground tunnel which is marvelously decorated and well lit. Off the restaurant is the pool and terrace. We were fortunate to have an undecent amount of sun and heat for the season and besides the sighseeing we did use the sun chairs and picked up a tan!", "title": "Good hotel with several restaurants", "user": "quattromonti", "date": "March 27, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 14583146}, {"rating": 4.0, "title": "Professional and Friendly", "text": "The negatives: the night we chose to go to the restaurant they had a large party reservation leaving only 2 or 3 tables which had been reserved. That it how we discovered the Bar and didn't regret it. The food is above average but not worth a detour. The real negative is the service: the good efficient personnel were outnumbered by a number of unskilled and unmotivated personnel costing them in my view a 5 star rating.", "helpfulness": 1, "user": "NickBB", "date": "August 27, 2007", "id": 8513471}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "This is a fabulous place and fully lived up to our expectations. Superb location though there is a road between the hotel and the lake, but thanks to air-conditioning in all the rooms you can sleep with the balcony doors closed and there is a beautifully decorated tunnel to the pool area, the restaurant \"Lago\" and the lake. Staff are friendly and helpful and contrary to what a recent guest wrote, the shuttle service to Lugano is absolutely free of charge and the welcome drink can be an alcoholic drink if you ask for it (we had a gin-and-tonic). The view is fabulous, the pool area quite large but at the lake itself, there could be a few more deckchairs. The rooms are large and very well appointed - if you do not like the rather heavy duvet, ask for a \"letto italiano\" and you get sheets and blanket. Breakfast very good. Our only complaint was that the restaurants are rather expensive and even when you ask for \"the little menu\", the prices are quite steep. This can be overcome by taking the shuttle to Lugano, it only takes about 20 minutes. We did have dinner one evening at the hotel's \"Lago\" restaurant - the food was excellent as was the service. We also used the indoor wellness facilities with pool, sauna etc. plus the healthcare unit where we had an excellent massage resp. facial treatment.", "title": "We had a great time", "user": "blacklab", "date": "September 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 79519081}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We loved the place and would definitely like to return to it one day. The Swiss tourist office had a special promotion and this made our stay very reasonably priced.", "title": "Absolutely SUPERB!!", "helpfulness": 1, "user": "G_J_L_London", "date": "August 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76106564}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We had an absolutely wonderful stay in this hotel.", "title": "Loved it!", "helpfulness": 1, "user": "blonaygirl", "date": "August 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74450675}, {"rating": 5.0, "title": "Best hotel I've visited till now", "text": "We travelled with our 3 year old daughter. We booked a room with mountain/garden view, but were upgraded to a room with Lakeview. Beautiful!!", "user": "GresolinaR", "date": "July 19, 2010", "id": 71478725}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "This room was very spacious, with airconditiong, and really everything you need.", "title": "Great location, wonderful facilities, superb staff", "helpfulness": 1, "user": "Geographyrocks", "date": "July 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70052340}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "All around great property and people - one of the best in the world (and I did win a business award for doing business in most of the countries in the world:-). I stayed at Swiss Dimond several times over the past few years for business and pleasure. Food is great and spa is world class. Try to get a lake view room. I could only speak a few Italian words, but had no problem communicating with hotel employees - they are very friendly (although after staying there several times they know who I am by now). The hotel is not in Lugano, but there is a shuttle service to the city. Vico Marcote is only about 15-20 minute walk from the hotel and is very charming.", "title": "One of the best in the world", "user": "yurvlad", "date": "April 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62781257}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "This is a very old Hotel yet a very unique and will preserved Hotel", "title": "Great Hotel", "user": "Aboaziz", "date": "March 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58361184}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "The Service of the Hotel is one of the best around and the view from the room is a breath taking", "title": "great location for all needs", "user": "kateschka", "date": "February 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56447314}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "Swimming pool and Massage is a must in Swiss Diamond especially after a very long drive from Geneva (Divvone)", "title": "Very Good", "user": "SeaShellsManila", "date": "January 3, 2010", "detail_rating": {"cleanliness": 5.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 52420044}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Food with no any doubt is fantastic here along with un outstanding services with a very big smile", "title": "Nice and family friendly", "user": "melachocolat", "date": "December 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 52075839}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "My family stayed at the Swiss Diamond on a recent trip to Italy and Switzerland. Rooms are reasonable size and have a lovely view of the lake. Prices are extremely high and the service was at best unfriendly and at some points down out rude.(We were told quite rudely that our \"drinks at the bar voucher\" in the package was only for a soft drink not a mixed drink. Complimentary shuttle service to Lagano was in reality a 50 Franc charge.", "title": "Avoid the Swiss Diamond", "helpfulness": 6, "user": "campbe58", "date": "July 28, 2006", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "rooms": 3.0, "location": 3.0}, "id": 5522637}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "The hotel does not come close to the Park Hotel Vitznau that we visited next. Excellent service, caring staff and terrific dinners and breakfest buffet. Both hotels are simiarly prices but the Park Hotel was miles above this place.", "title": "Wonderful, Wonderful", "helpfulness": 1, "user": "Americannj", "date": "July 25, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 5509774, "likes": {"liked": "— Luxury, class and charm. Really a high quality, perfect five star hotel experience", "disliked": "— Drinks and Food were too expensive"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "Skip the Swiss Diamond and head for another location. The hotel tries to be a five star property but does not come close.", "title": "Very swish", "helpfulness": 2, "user": "Howser1", "date": "June 29, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5408759}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "This hotel is highly UNDER rated in Trip Advisor. It should be ranked in the Top 2 or 3. Just as a comparison, we stayed in this hotel just before staying in the Hotel Du Lac (in Lugano). We paid nearly the same price at each hotel. The Swiss Diamond was much MUCH better and yet the ranking here is lower? Strange.", "title": "An Unusually Fine Hotel", "helpfulness": 14, "user": "hcajones", "date": "September 30, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3980208}], "location": {"country": "Switzerland", "region": "Swiss Alps", "continent": "Europe"}, "stars": 5, "variance": {"poor": 5, "average": 19, "very good": 37, "terrible": 5, "excellent": 56}, "aka": "Swiss Diamond Resort Olivella", "slim_ranking": 0.25, "description": "Nestled on the enchanting shores of Lake Lugano, this luxurious property offers elegance and charm in a breathtaking location. Behind the impressive façade, the Swiss Diamond Hotel Lugano boasts dining and leisure facilities that rank among the finest in Switzerland. Only 7 km away from the centre of Lugano, the hotel features 3 restaurants serving typical regional, Mediterranean and international cuisine with a wide range of international wines."}