{"user_rating": 4.5, "review_count": 356, "name": "Swissotel Kolkata", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "Stayed here for a night of 27 June 2013 while on a business visit to Kolkata.", "title": "PROS & CONS but Good Overall", "helpfulness": 2, "user": "Parag J", "date": "June 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 165625769}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "It's the best location for those who need to remain as close to airport as possible and not enter city. Just about 3-4 kms from airport and if you have an airport view in the room, new airport terminal building is within the eyesight.", "title": "Modern Luxury near the Airport", "user": "KarthickBirdie", "date": "June 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 165315097}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "I was booked for a standard room but requested an upgrade to next category as that room comes with a Lavazza Espresso maker that I am always fond of having in a hotel room. My request was granted so a biddy here.", "title": "Value for money", "user": "Kartik_83", "date": "June 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 165267967}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "I checked-in late at night and was to check-out early next morning after breakfast so did not get much of an opportunity to explore the hotel. Hence this review covers only the room and breakfast.", "title": "Great service", "user": "VikeDes", "date": "June 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 164857025}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "PROS:", "title": "Very Good Hotel slipping in Service and VFM", "user": "Rajiv B", "date": "June 22, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 164805421}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "I travel to Kolkata maybe twice a year and this time decided to stay again at the best Hotel I have experienced at Kolkata! This was my second stay here and was well worth it. The Hotel is uber-luxurious and attached to a big Mall with a Multiplex! I loved the car-ramp and the entrance lobby and the atrium of this differently designed beautiful property. The staff is so polite and the check-in was smooth once again. The rooms are excellent with soft comfortable beds and pillows. The bathroom area is nicely designed with good shower temperature and pressure. all the accessories are modern and stylish. The best part about the Hotel is the Scandinavian Style Wooden Bar on the first level. The bartenders are well trained and the F & B is above average. Swissotel really looks after small details in making their guests comfortable and I was impressed. The Taj Bengal better refurbish quickly before the regular Kolkata travellers discover this gem!", "title": "Swiss Hospitality At Its Best!", "user": "drallah", "date": "June 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 164597382}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The hotel is not far from Kolkata Airport. Easy to reach with taxi.Good and big rooms, clean , good Air condition. Very good Restaurant for dinner and breakfast. Friendy people in the whole hotel. WiFi in hotel.", "title": "Nice Hotel in Kolkata", "user": "Ingrid_2010_10", "date": "June 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 164090325}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Close to the airport, good security in hotel,good service, excellent rooms and facilities, free wifi, a few restaurants around with good choice of food, clean. if you need to buy something or eat outside, just a step is shopping mall with everything that you need.", "title": "excellent choice for short business stay", "user": "mikeprodanovic", "date": "June 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164074322}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "you don't need to go outside if you have business meeting or something that is possible to finish inside hotel.", "title": "Recommended in Kolkata", "user": "Ronny6708", "date": "June 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 163385174}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "Very good hotel, excellent restaurant with continental and Indian food. The rooms are cean and large with good bathroom. All services available andcreliable.", "title": "excellent hotel", "user": "Amit A", "date": "June 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 163345115}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Great hotel located near the airport. Upgrade to executive class was definitely worthwhile with the attentive service of the staff managing the Executive Lounge. Very comfortable and clean-impeccably kept. Our friend highly recommended this hotel to us and they were not wrong. One word of advice is that it is not near the city centre so book according to your plans.", "title": "Great bang for buck", "user": "ViviDee", "date": "June 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 163041534}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "I stayed in Swissotel Rajarhat for a night on a quick busines trip to Kolkata in early May ....q.just from a proximity to the airport standpoint, this property wins it hands down..5 min ride to the airport and that's a luxury in Kolkata and if you have an early morning flight the extra forty winks in the morning make all the difference for the rest of the day...the room was large and comfortable and very modern.....they have some sandwiches, tea coffee spread near the checkout counter and you can grab these on the go while checkin-out early morning...very thoughtful and commonsensical....these small things tell you that these guys are thinking on their feet....cant comment on the food and restaurant as couldnt manage a meal in the short stay...but they have done enough to get me back for the next stay....", "title": "A comfortable short stay.....", "user": "vicks76", "date": "May 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 162397155}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "I recently completed a six month stay in Kolkata on business and the Swissotel Kolkata and its staff made my stay very pleasant. The hotel itself is very crisp and clean and the lobby is large with a friendly reception desk, the guest services team are incredibly efficient and always greet you with a smile. Expect a complementary iced tea or masala chai if your check in is delayed for any reason, a very welcome introduction to the whole establishment.", "title": "A home from home", "user": "Anthony M", "date": "May 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 161948800}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The rooms are very appropriately sized with large beds and marble bathrooms, no bath in my particular room but these are available I understand. Having been given a tour of the hotel including the suites, if you can afford it, go for the suites. Some even come with a personal jacuzzi! The executive business rooms were perfect for my stay though, comfortable and quiet with views over the outskirts of Kolkata.", "title": "Warm hospitality, awesome place!!!", "helpfulness": 1, "user": "MasterShifu", "date": "May 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 161864348}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "The hotel is directly connected to the City Centre Two mall complex which has a food store on the groud floor and various clothing outlets. Expect to be able to get all the toiletries and neccesities you would get in any international city. There are additional large malls half an hour to 1 hour away and the hotel offers chauffeur services although these can be quite expensive dependant on your travel distance. The hotel itself has two restaurants, Durbari and Cafe Swiss. Durbari serves traditional and nouveau indian cuisine and is of a very high quality more accustom to fine dining. Cafe Swiss is staffed with incredibly pleasant and warm people who are quick to provide an attentive service, they really value your feedback and are not happy unless you are happy. The food is varied and of very high quality with the nightly changing international buffets proving hard to resist!", "title": "the best property in town.", "user": "Bijoychandra S", "date": "May 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161498409}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "Best service I have ever had anywhere in any hotel. Not cheap but well worth it. Only 5 mins from Kolkata airport. Only on one floor of building so nice and cosy. Shopping mall next door. Wonderful massage deals and a gym. Everyone very attentive and helpful. Complimentary fruit platter if you ring up for it. Only about 3 years old, lovely and modern and clean.", "title": "small swanky hotel close to airport", "user": "Susan S", "date": "May 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161467454}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Excelent service and really clean and modern interior. Easy and free internet access. Close to airport. Great food! Next to pretty good shopping center. I got even private yoga lession in the morning at the pool site.", "title": "Great place to relax during hectic schedule!", "user": "Elina E", "date": "May 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161464313}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "I really loved this property...... One of best Hotels........ I was impressed with every area right from Service, Value, cleanliness etc......... If at all, one has to have a issue, it would be the proximity..... Personally, I didn't face that issue as my office was very close by.... I strongly recommend this place..... Great Business Hotel..", "title": "Excellent !!!!!!!!!!!!", "user": "Karthikkumar", "date": "May 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 161240673}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Since this hotel was opened I stay always there when I am in Kolkata. Personell and service is excellent. Food is very good and you were welcomed by your name.", "title": "Best Hotel in Kolkata", "user": "Wolfgang E", "date": "May 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160784167}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Rooms are clean and personal respects your privacy in any way", "title": "Smiles everywhere", "user": "Mansur M", "date": "May 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160095165}], "location": {"country": "India", "continent": "Asia", "city": "Kolkata (Calcutta)"}, "stars": 4.5, "variance": {"poor": 9, "average": 20, "very good": 133, "terrible": 9, "excellent": 185}, "aka": "Swissotel Kolkata Hotel Kolkata (Calcutta)", "slim_ranking": 0.032967032967, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "Swissotel Kolkata is Kolkata’s newest five-star luxury hotel near the airport and is attached to a mall featuring shops, restaurants and a multiplex cinema. Located in Rajarhat beside the IT hub, the hotel offers a distinct mix of leisure and business facilities, and is noted for its unique offering of Swiss hospitality and attention to detail.Choose from 147 elegantly appointed guest rooms, including 59 suites with large open-air terraces, each with its own spectacularly exclusive outdoor Jacuzzi. Executive rooms and the Swiss Executive Club lounge provide additional luxury and exclusivity. The award-winning rooftop Sky Lounge is the jewel of the hotel’s three restaurants and bar, offering views over the city. An in-house nightclub with resident DJ attracts hip locals and guests alike. The sumptuous breakfast buffet offers a wide range of choices to energise your day.The business centre and two meeting rooms more than cover all your business needs. Over 1000 guests can be accommodated in cocktail/reception style in Bern, the largest pillar-free banqueting facility – and a team of event planners is on hand to help you hold the perfect wedding at Swissotel Kolkata.Swissotel Kolkata’s alpine-inspired Purovel Sport offers you an exclusive ambiance in which to continue your exercise routine, with a fully equipped gym and a breathtaking infinity swimming pool on the roof.The hotel has separate smoking and non-smoking floors, there is free internet throughout except in the banquet areas, and secure parking is also available for your vehicle during your stay."}