{"user_rating": 4.5, "review_count": 1479, "name": "Swissotel Berlin", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "I have visited Berlin in March for the firt time and stayed in Swissotel. The hotel is very clean and comfortable and the staff proffesional and welcoming. I really enjoyed the good quality and variety of breakfast!", "title": "Stylish & Comfortable hotel", "user": "annadam70", "date": "May 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 106933071}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Very centrally located, all the shops are on your doorstep and the u-bahn is a stroll away. We booked a classic room originally which we thought was tiny so we upgraded to a junior suite at a negotiated 60euros per night.", "title": "Good location", "helpfulness": 1, "user": "heranaway", "date": "May 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 106527814}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "I would suggest an Insider famous walking tour, its for about 4 hours and very informative. You can pick up the leaflet from the lobby.", "title": "Highly recommended hotel.", "user": "tomersi", "date": "April 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 105584868}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Me and my friend stayed at the hotel for five days (from the18/05 until the 23/05)", "title": "Excellent hotel but expensive wifi!", "helpfulness": 1, "user": "LD73", "date": "April 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 105482918}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Excellent hotel.", "title": "Best sleep ever in a hotel", "user": "UK_Baldrick", "date": "April 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 105472723}, {"rating": 4.0, "title": "It almost starts to get boring", "text": "I always stay at the Interconti but after reading all these reviews, I could not help myself to try this hotel.", "user": "ynguy", "date": "April 3, 2007", "id": 7278284}, {"rating": 5.0, "title": "wunderbar!", "text": "When I entered the downstairs area I was not met by a porter to assist me with my luggage ( Hey not everything is perfect in this hotel. ) Once I had ascended to the reception lobby area I was greeted by a charming and friendly male receptionist who efficiently checked me in and escorted me to my room which was a nice touch.", "user": "wilburhertfordshire", "date": "April 3, 2007", "id": 7275932}, {"rating": 5.0, "title": "Great Hotel", "text": "The room was smallish ( Interconti's rooms are more spacious ) but very well maintained , with a sort of view of the Gedachnis kirche and everything was there. An esppresso machine, ironing board, slippers and bathrobe for example.", "user": "Sharsco", "date": "March 29, 2007", "id": 7246210}, {"rating": 5.0, "title": "Swissotel the best hotel in Berlin", "text": "The bathroom was somewhat claustrophobic but they managed to squeeze in a walk in shower which I so much prefer than a standing in the bath one.", "user": "EssexGriff", "date": "March 27, 2007", "id": 7229766}, {"rating": 5.0, "title": "the Swissotel is superb", "text": "I was impressed by turndown service as they did everything right. From restocking the coffee supplies to refreshing towels. Well done HK.", "user": "C3B", "date": "March 26, 2007", "id": 7225877}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "We just returned from our first visit to Berlin. The hotel had many good qualities: the location was very good close to many attractions and means of communication. We did not eat breakfast here and did not enjoy sauna gym and other amneties (no time) so I cannot talk about those.", "title": "good hotel", "helpfulness": 7, "user": "screenname060309", "date": "June 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7975782, "likes": {"liked": "— location", "disliked": "— no English speaking channels except BBC and CNN"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Our rooms were OK, the best parts were the shower in addition to the bath, the ironing facilities and the coffee making machines. My girlfriend loves tea so when we asked for help they immediately sent us water bolier. We did not have slippers in our room which my girlfriend had counted on. I see from another review that they had slippers. The beds were very good.", "title": "Loved it! Would surely stay again", "helpfulness": 7, "user": "gooner_cb21rf", "date": "June 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7952266}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "There were only two problems:", "title": "Great hotel, great city", "helpfulness": 6, "user": "rymat", "date": "June 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7924289}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "One was the TV. It did not have any English channels except BBC and CNN, and by day three we were tired of listening to the news all the time. But they did have speakers in the bathroom so you did not have to miss the news even there. The airconditioning was perfect.", "title": "Swissotel - a fantastic hotel with great service", "helpfulness": 7, "user": "tagr30", "date": "June 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 7872397, "likes": {"liked": "— The service and cleanliness", "disliked": "— Would prefer to be a bit nearer Mitte"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Another problem were the lamps near beds. They have a special confugartion so that if you come into contact with the frame around the light you may burn your hands.", "title": "excellent hotel - couldn't recommend highly enough", "helpfulness": 6, "user": "coffeepot11", "date": "June 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7847809, "likes": {"liked": "— location", "disliked": "— nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Stayed here 31st May - 4th June. Good location and comfortable hotel.", "title": "Great Hotel, only one disapointment....", "helpfulness": 7, "user": "AB1", "date": "June 6, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 7789945}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "Only disapointment was with the Restaurant, 1 month before we stayed i booked a table for two for 1st June in Restaurant 44, a birthday treat, i received e-mail confirmation from the Restaurant Manager. On arrival at the hotel i again asked for confirmation of the reservation to be told i couldn't have a booking as there was a private function place that night and the restaurant was closed. The receptionist tried to get me a table for the Saturday night but the restaurant was full. Greatly disappointed about this as i had heard only good reviews.", "title": "Great Hotel, great location", "helpfulness": 6, "user": "Gazing", "date": "June 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7762802, "likes": {"liked": "— All round very good", "disliked": "— Nothing really"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "On the whole a comfortable, clean hotel, would stay again.", "title": "Excellent hotel", "helpfulness": 8, "user": "smoothtalk", "date": "May 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 7719873, "likes": {"liked": "— Friendly and attentive service", "disliked": "— Too many elevators!"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We had a thoroughly enjoyable stay at the Swisssotel in early June 2007, great location and very helpful staff. I couldn't fault anything about it.", "title": "Efficient and well run", "helpfulness": 6, "user": "marcdocklands", "date": "April 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7484064, "likes": {"liked": "— Nice beds", "disliked": "— the only way to reception is via lift from street level"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "This is a comfortable, well-equipped hotel with superb staff and a nice, civilised atmosphere. Our room was the most modest the hotel offers, but was quiet and pleasantly appointed with a good bath/shower room and quality furnishings. The hotel bar was a good place to have a few drinks at the end of a long day, and Restaurant 44 (run by chef Tim Raue) was expensive yet worth the money, offering a superb menu of modern European cuisine. The sole drawback of the hotel is that it is in a fairly charmless corner of Charlottenburg - conveniently near Zoo Station, but also near some rather tawdry shops and bars including a tacky museum of erotica. The atmosphere locally certainly wasn't threatening, but this is a much less appealing part of Berlin than, say, Mitte, and those going as tourists should be aware that they will need to use the U-Bahn and S-Bahn to access the main tourist areas.", "title": "Perfect Hotel", "helpfulness": 8, "user": "IslandMaster", "date": "April 6, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7286216, "likes": {"liked": "— The location & room luxury.", "disliked": "— Riding the elevators to get out of the hotel."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "The location was good (near the tail end of the U-bahn along the Ku'damm) with lots of shops and restaurants around to choose from. The staff was very friendly and helpful. The buffet breakfast was very good and varied. The room was spacious and comfortable with a safe and Nespresso machine in every room The only thing that needs to be changed is the internet access. Free at the lobby only. You have to pay if you want to connect inside your room. Plus the free access at the lobby can be confusing. If you are not careful, you might end up paying for the internet even at the lobby so be sure to look for the free internet box at the bottom of the webpage - a bit tricky. Other than that, a good stay.", "title": "All good except for the internet access.", "user": "dissolvedgirl", "date": "November 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 144494480}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "This was our first trip away with our four month old baby and the hotel made our holiday as easy as possible. They provide us with a good cot, bath support, baby toiletries, nappies, bath thermometer etc. The best bit for us (and the other guests) was that the room was completely sound proof so we never worried about disturbing anyone. The room was spacious for us, even with all the baby equipment! The staff were unbelievably helpful and the location good for exploring the Christmas markets.", "title": "Amazing service & a super comfortable stay", "user": "frazfraz", "date": "November 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 144378454}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "A really well located hotel, handy for everything and in a good area. Rooms were clean and staff were really friendly and helpful. The hotel just lacked a few things - no conditioner in the bathroom which surprised me and a CD player but no Ipod docking station. Who takes CD on holidays?? Coffee machines in the room are lovely but I can't drink coffee and it took 24 hours for a kettle to be delivered. The rooms are spacious and clean and the hotel was certainly very peaceful but I was looking for something a little special and this wasn't it. The one good thing which I enjoyed was being able to choose your own pillows which was helpful and fun.", "title": "Average but was expecting more", "helpfulness": 1, "user": "Jackie B", "date": "November 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 144283175}, {"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "Just got back from Swissotel and had a great experience. The hotel is outstanding. Very stylish, clean and wonderful amenities. Upon arrival we were upgraded to Executive Room.Fabulous soft bed and the best pillows ever.wifi with fast and reliable connection (throughout the hotel).Stylish bathroom with a separate bathtub as well. Large electronic safe with recharging possibility inside for laptop, smartphone or iPad. The staff were very friendly!", "title": "Outstanding", "helpfulness": 1, "user": "sandyl22", "date": "October 29, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 143996715}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "That is the first word that comes to me to qualify Swissôtel Berlin.", "title": "Excellence", "helpfulness": 2, "user": "Chagoule", "date": "October 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143367512}, {"rating": 5.0, "title": "Just Perfect", "text": "Visited this hotel on a Business trip in Berlin and spent 5 perfect nights. What makes this hotel unique is the attentive staff and personal attention offered to the guest, nothing is a problem and they go out of their way to ensure the client is happy. Rooms are good sized and spacious with a great bed. Breakfast is exquisite with a variety of food. Location is brilliant since metro is only a few steps away and round the corner from one of the main shopping streets. A must if visiting Berlin", "user": "Malena70", "date": "October 21, 2012", "id": 143328013}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "I had two nights in Berlin at this hotel and enjoyed the location, the hotel facilities, the meticulous and caring staff, great food and room. The location is very convenient for shopping, getting around and to and from Tegel airport. You can walk to shops and restaurants. i had a room facing the Kurfurstendamm on the 7th floor and it was great, good view and ii heard nothing. The room was well ventilated with the fan on as we had some very warm October days.The staff does everything they could to make my stay memorable. The KURBIS creme soup was the best I ever had! thank you for a lovely stay.", "title": "Terrific Stay", "helpfulness": 1, "user": "victoria c", "date": "October 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143249556}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "As a picky American traveling abroad, I can say this hotel exceeded expectations! I stayed here because of the excellent reviews on TripAdvisor and the hotel lived up to its reputation. Very spacious rooms, modern, extremely fast Internet connectivity, beyond helpful staff.", "title": "Outstanding Hotel - Highly Recommend", "helpfulness": 3, "user": "gabrielmurphy", "date": "October 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142835939}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Stayed here for a 6 night visit to Berlin, we have absolutely nothing negative to say about the hotel, The rooms was of a high quality,, the food and room service was also very good. The location as stated before is very good, round the corner is one of the main shopping streets. U1 subway line is also round the corner, and it is only a few minutes walk to the Zoo S-Bahn & U-Bahn stops. Will definitely stay here again.", "title": "Great stay", "helpfulness": 6, "user": "Tuggster", "date": "October 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142763828}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Stayed there, during a business trip of mine in Berlin. Very convenient location. Nice, big and clean business hotel. Had a spacious room with a Nespresso Coffee Machine (complimentary), nice big opening window, fully stored mini bar (plus for a business traveler), a bit expensive but fast internet connection. Very polite and professional staff, especially the concierge one, who gave some of the best restaurant suggestions in the are and places to be tips (for my limited free time). Had booked directly and got a very reasonable deal. Bar had some of the greatest wine and whiskey brands in very competitive prices. After 4 nights there, i was not let down and i can only say that Swissotel hospitality is once more guaranteed. Having to travel to Berlin once / twice a year, would certainly consider staying at Swissotel Berlin during one of my next trips.", "title": "Very good business hotel", "helpfulness": 1, "user": "AE74", "date": "October 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 142615658}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "A perfect and convenient location just off the main street of Ku'damm. A super convenient location right in town with lots of shopping and food outlets all round. Not too far away is Kadewe, the second largest department store in Europe after Harrods of London. Great service at the hotel and room is nice and comfortable. The only negative feedback is the pillows which is flat but they make it up by providing a selection of pillows to choose from depending on your liking. The hotel provides a coffee-making machine but unfortunatedly, i am a tea-drinker.Will be perfect if hotel supplies complimentary bottled water too. Breakfast is terrific and you can also place the order of waffles or pancakes which is really delicious. Gym on the otherhand is small and pathetic (Quite a dissappointment actually). If you are sourcing around for a hotel to stay, especially for business trips, look no further. This is an excellent choice and you will not regret it.", "title": "A Pleasant Stay", "user": "WendyTan", "date": "March 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 101265409}, {"rating": 5.0, "title": "Brilliant", "text": "Top class service from arrival to departure. The staff in this hotel provide service which is second to none, friendly, helpful and efficient. The rooms are comfortable with both a walk in shower and bath. Make up mirror provided which illuminates and magnifies.", "user": "Sue59Wednesbury", "date": "March 20, 2011", "id": 100875482}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Plently of soft fluffy towels and bathrobes provided as well the usual shower gel etc. The bedroom furniture is good quality which illuminate on opening. Bed a little too firm for us but that comes down to personal choice but the pillows were like soft fluffy clouds pure heaven.", "title": "Highly recommended", "user": "esstee238", "date": "March 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 100387071}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "The breakfast which was included in our room rate was first class, varied and plentyful and some thing to suit everyones taste.", "title": "If it's location you're after, you can't go wrong with this", "user": "pauljer", "date": "March 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 99958016}, {"rating": 4.0, "stay_parameters": "Stayed February 2011", "text": "The transport links in Berlin are absolutely great. I suggest you purchase a 3, 4 or 5 day passat the airport which covers the Train, U bhan , S bhan and busses all of which arrive on time and clean.", "title": "Modern stylish hotel", "user": "Gordoncrowley", "date": "March 6, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 99163056}, {"rating": 5.0, "title": "Excellent friendly service", "text": "We actually went with a little trepidation to this hotel despite some good reviews in Tripadvisor as we had had bad experiences in Germany before with food and accomodation.", "helpfulness": 5, "user": "Scotlandhappygolucky", "date": "April 1, 2006", "id": 4826171}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "From the moment we arrived however we were made very welcome. I speak only a smattering of German, but the staff were all very fluent and willing to use English. We were personally escorted by the reception staff to our room. We were paying for the executive floor which came with an manned open bar, breakfast and inclusive snacks. The food was delicious and the host of the executive room very generous with drinks. We certainly had our money's worth", "title": "great hotel", "helpfulness": 10, "user": "Edinburghtraveller", "date": "April 1, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4825702}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "The room was averaged sized for a European city hotel, very well decorated and spotless. We ate one main meal in the hotel. It was excellent and again the service was very friendly.", "title": "Fantastic stay.....", "helpfulness": 2, "user": "theboybg", "date": "March 26, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4734214}, {"rating": 1.0, "stay_parameters": "Stayed November 2005, traveled on business", "text": "Woudl definitely return. I felt we had a bargain", "title": "Most unwelcoming hoteI I have been in for years", "helpfulness": 9, "user": "Eti", "date": "March 13, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 4603261}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "We stayed at this hotel on the executive floor. The package was excellent value. Room was small but had everything we wanted. The executive lounge was well stocked with every drink you could want and snacks, some quite substantial. We had our evening meal there once after a tiring day sightseeing. The restaurant 44 was a pleasant surprise- as good as any hotel restaurant we have ever used. Best of all all the staff were friendly and helpful and the room was spotlessly clean. Taxi from Tegel is about 12 Euros. The airport bus stops 100metres from the hotel and takes about half an hour. Ku'damm fantastic for shopping and some sights, and all sightseeing easy with the metro, right beside the hotel.", "title": "Flawless...", "helpfulness": 6, "user": "joshua-bwi", "date": "March 8, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4592136}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "Stayed here for 3 days on leisure trip to Berlin. The hotel is located right off the Kurfurstendam with the Kurfurstendam Ubahn stop across the street or around the corner and the Zooligershcer Sbahn stop about 3 blocks away. While some may argue that Potsdamer Platz is the new heart of Berlin, it's too sterile to match the elegance and \"real\" character of Kurfurstendam.", "title": "Exceptional hotel in great location", "helpfulness": 1, "user": "islington3164", "date": "May 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110431187}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Our room, on the fourth floor and with a view of the \"cows\" was wonderful. Large, exceptionally clean and comfortable. Television had a large array of channels, bathroom was spotless with both a tub and separate shower. We ordered room service twice and the food was delicious and delivered quickly. The staff at the hotel was also extremely professional and accommodating. I had an emergency at home and needed to send an urgent fax. Staff took care of it immediately and delivered the confirmation to my room so that I could enjoy time out in Berlin. They always greeted us when we entered the hotel and were not only nice, but knowledgeable and courteous.", "title": "Impeccable service", "user": "ro2010ro", "date": "May 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110370093}, {"rating": 4.0, "stay_parameters": "Stayed May 2011", "text": "I will be returning to Berlin and the Swissotel will be my hotel of choice. An excellent hotel in a great city.", "title": "Excellent hotel / very comfortable", "user": "truffymontreal", "date": "May 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 109288647}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "We were in Berlin for a wedding event and the majority of the guests were staying here and the hotel had an offer on which was great. Of course these hotels are for the rich and famous and they are beyond our means, but for once in our life we had to stay in such a top class hotel. I never thought where you stay can make such a diffrence!!!!!!!!!!! Absolutly out of this world with fabulous food and great drinks. The friends and family that tried to save money and that stayed at other cheaper hotels regreted not having paid the extra to enjoy this luxiourious hotel. Thanks to the staff there was nothing missing and this stay made a serious impact on us.", "title": "always nice to come back home", "user": "A_luxury_traveller", "date": "May 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109149643}, {"rating": 4.0, "stay_parameters": "Stayed May 2011", "text": "The staff is very efficient and provided us with great customer service. I initially found that the bed looked very sparse but it was surprisingly comfortable and we experienced an exceptional nights sleep. The breakfast options were quite expensive and when we received the meal it was very impressive but way too copious. One breakfast could have served at least 3. Overall excellent experience and I would not hesitate to recommend this hotel.", "title": "Chain...could use some updating.", "user": "Erbas", "date": "May 5, 2011", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 107032803}, {"rating": 5.0, "title": "great stay", "text": "Great weekend stay here. Location very convenient for transport links to other parts of the city and to the airports. Ubahn station outside. The hotel is in an ideal location for shopping - right on the Ku'damm and next to C&A. The hotel is extremely clean and modern. The staff were extremely polite and helpful - the receptionist even took us to our room. If you can't speak German don't worry, everyone we encountered were fluent English speakers. Pay the extra for an upgrade to the Executive floors and lounge. It's 50 Euros per day for breakfast, snacks and all types of drinks! The Exec rooms aren't huge, but are plenty big enough. Two fab showers (one cubicle and one over bath), bathrobes, slippers and even an umbrella in the room in case you get some barmy weather!", "helpfulness": 18, "user": "A TripAdvisor user", "date": "March 13, 2005", "id": 3270528}, {"rating": 5.0, "title": "great room, excellent service", "text": "Most of the interesting sights e.g the Brandenburg Gate are East of this hotel. The Ubahn and Sbahns will take you there, or ten euros in a cab will get you to Checkpoint Charlie", "helpfulness": 12, "user": "A TripAdvisor user", "date": "February 26, 2005", "id": 3231936}, {"rating": 5.0, "stay_parameters": "Stayed January 2005", "text": "Berlin is a fabulous city and the Swissotel staff will help you find your way around, from recommendations for bars or the Concierge service that will advise on restaurants, theatre bookings etc. I got a great discounted rate with Expedia. Hope you do too!", "title": "Valentine treat", "helpfulness": 25, "user": "Olderbytheday", "date": "February 18, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 3209445}, {"rating": 5.0, "stay_parameters": "Stayed January 2005", "text": "We stayed at the hotel for 4 nights in February 2005 in the executive room - great room with street view, very comfortable bed, spotless bathroom, good breakfast (you may choose btw restaurant and lounge room), access to the lounge room with great coffee, sandwiches, soup, salads, drinks etc, great location.", "title": "Fantastic Rooms", "helpfulness": 20, "user": "sunshines", "date": "February 15, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3192947}, {"rating": 5.0, "stay_parameters": "Stayed December 2004", "text": "The only turndown thing was the hotel reception that checked us in, she said that only atrium view rooms were available because the hotel was fully booked, next day we've got a street view room which made our stay very pleasant - other than that the service was excellent.", "title": "Good choice", "helpfulness": 15, "user": "Zurich", "date": "February 10, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3176317}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "I chose this hotel based on the Tripadvisor reviews and I was not disappointed. The location is superb. The rooms were lovely and clean and the hotel staff were excellent. Would prefer the internet to be included in the room price but 23 Euro for 2 days was reasonable.", "title": "Excellent", "helpfulness": 2, "user": "NatsDad", "date": "October 22, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5982885, "likes": {"liked": "— Cleanliness, staff", "disliked": "— Nothing really"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "We booked this hotel through a German website and got an excellent deal (EUR 120 not including breakfast). The location cannot be improved upon - close to Zoo station, Kudamm, subway and other public transportation.", "title": "Great option in Berlin", "helpfulness": 7, "user": "Susan66", "date": "October 12, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5945600, "likes": {"liked": "— Quietness, elegance, location and wonderful room.", "disliked": "— Nothing."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "I found the atmosphere in the hotel relaxing, calm yet stylish and sophisticated. The hotel is decorated with contemporary art by German artists. Yet I never got the impression that my presence was upsetting the decor. The standard room I was staying in was very quiet, with a very comfortable bed and a Lavazza espresso machine. One of the nicest hotel rooms I've ever stayed in.", "title": "Great Location, Excellent Service", "helpfulness": 12, "user": "MrktMgr", "date": "October 3, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5902011, "likes": {"liked": "— The staff, the location", "disliked": "— Pillows"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "Breakfast is delicious but not cheap at EUR 21. Wireless Internet is EUR 10 per two hours.", "title": "super clean, good for the road warrior", "helpfulness": 6, "user": "Happyhubby&Daddy", "date": "September 25, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5835030, "likes": {"liked": "— front desk staff", "disliked": "— small bowl of soup for 8 euros"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2005, traveled as a couple", "text": "All in all I would recommend this hotel to everybody except budget tourists. Great value for money - especially when having breakfast outside the hotel. This is now my Holy Grail hotel in Berlin.", "title": "Spectacular Hotel in a Spectacular City", "helpfulness": 7, "user": "VA_Odysseus", "date": "September 16, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5807532, "likes": {"liked": "— The Hotel. Rooms, location, and service were all superior.", "disliked": "— Nothing comes to mind."}}, {"rating": 4.0, "title": "very nice hotel", "text": "We stayed at this hotel for a long weekend from 4th august.This was a suprise birthday presant for my husband so I was very keen that we stayed in a really nice hotel.I chose it because of the reviews on tripadviser and feel that it was a very good choice.The hotel was very comfortable and the staff very friendly.Just one tip though allthough it states breakfast is untill 10.30 be warned at dead on 10.30 they completly clear the buffet away.We arrived in the early hours of the morning so we didnt get down for breakfast untill 10.15 . As our tariff did not include breakfast we payed a lot of money for very little. Having said that we would stay there again but there are lots of little cafes that serve very good breakfast for a fraction of the cost", "helpfulness": 4, "user": "hairdo", "date": "August 11, 2006", "id": 5600534}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Stayed at this fabulous hotel for 4 nights from 3rd August. I entirely agree with every review written. We could not fault this hotel, from the minute we walked in until we left we were impressed with the attention to detail. The quality of the staff throughout our stay was a credit to this hotel. The small details such as a welcome orientation, fruit and soft drinks on reception, free shooters at the bar, beautiful bath robes, coffee machine in the beautiful bedroom, huge walk in shower, piped audio from tv in bathroom, two large duvets on double bed so no fighting over one!!! made this stay special. Can't think of anything to moan about and cant praise Swissotel highly enough. By the way the italian restaurant 'Japiano' directly opposite is well worth a visit.", "title": "Faultless hotel", "helpfulness": 4, "user": "NKDEVLIN", "date": "August 8, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5578251, "likes": {"liked": "— SUPERB ATTENTION TO DETAIL", "disliked": "— NOTHING TO COMPLAIN BAOUT"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "I've rarely felt compelled to write an hotel review but the stay we've just experienced was really top class.", "title": "Top Class", "helpfulness": 1, "user": "ch9nem", "date": "August 8, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5577384, "likes": {"liked": "— Staff", "disliked": "— Leaving"}}, {"rating": 5.0, "title": "Basically perfect!", "text": "The atmosphere here is wonderful and the service is attentive without being over the top as it can be in so many other top hotels. All the staff we met were a real credit to the hotel - they couldn't do enough for us.", "helpfulness": 5, "user": "StarMonkeys", "date": "August 6, 2006", "id": 5562134}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The upgrade to the exec floor is definitely recommended, even if you don't plan on drinking and eating your money's worth!", "title": "All the reviews are accurate!", "helpfulness": 8, "user": "mlip", "date": "July 21, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5493564, "likes": {"liked": "— total ambiance", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2005, traveled on business", "text": "We stayed at the Swissotel in January for a week, based on recommendations from this site (and the Michelin guide).", "title": "Excellent Hotel", "helpfulness": 23, "user": "LindaNZ", "date": "February 4, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3161043}, {"rating": 5.0, "title": "Swissotel comes through !", "text": "The Swissotel is well located on the Ku'damm shopping street, with plenty of restaurants nearby, U-Bahn, S-Bahn and the major Zoo Garten train station only a block or so away. (So close a taxi refused to take us there on arrival in the rain, but it didn't matter!) The Story of Berlin is just up the road, the Kaiser Wilhelm church just over the road, and in the opposite direction is the famous KaDaWe department store.", "helpfulness": 5, "user": "HotelGourmand", "date": "December 24, 2004", "id": 2943413}, {"rating": 5.0, "title": "Highly Recommended!", "text": "I stayed in a normal room on the 8th floor btw Jul1-Jul4 and was very impressed by this hotel - the rooms and the facilities are great but the staff were the most impressive - just outstanding! The breakfast was sensational. The location was excellent.", "helpfulness": 11, "user": "OzBoy74", "date": "July 21, 2006", "id": 5492519}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "My girlfriend and I stayed at this hotel for her Birthday in January. We upgraded to an executive room, which is highly recommended. This gives you access to the top floor bar where drinks and snacks are free and you have an outstanding view over the city. The room was also quality, baths big enough for 2 again with views over the city, bang and olufsen sound system and all the extras you would expect from a quality hotel.", "title": "Sooooooooooo Gooooooooooo", "helpfulness": 15, "user": "SJGK_9", "date": "July 10, 2006", "detail_rating": {"cleanliness": 5.0, "rooms": 5.0, "service": 4.0}, "id": 5446313}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "The staff were so friendly, they showed us to our room on check and explained everything about the room and the city. The hotel is ideally situated in the shopping district and is only 3 stops to the former east berlin, where a lot of the better bars and restaurants are situated. If you go to Berlin, this is the place to stay, then go out around the Mitte district and you will have a wicked time in this very cool city.", "title": "Swiss : clean and neat", "helpfulness": 11, "user": "israelifamily", "date": "June 18, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5358901}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "PS the breakfast shown is what was left after we attempted to finish it, just order for 1 is my recommendation.", "title": "Fantastic", "helpfulness": 19, "user": "Parkin01", "date": "June 1, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5289799}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "We had a great stay. Staff were outgoing. the room was perfect, more than u can expect.", "title": "Fantastic Location with 1st Class Service. Impressed!", "helpfulness": 16, "user": "summers_slayer", "date": "June 1, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5289154}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "having stayed in the Swissotel in london and having a very comfortable stay the Swissotel in Berlin had a lot to live up to.", "title": "Great Service, Spotless Hotel", "helpfulness": 6, "user": "Paul_J_Anderson", "date": "September 15, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5803378, "likes": {"liked": "— quality and clenliness", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "I had read some comments from other readers about the not very friendly or helpfull staff and had this at the back of my mind.", "title": "10 out of 5!", "helpfulness": 6, "user": "mister.c.", "date": "August 27, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5713843, "likes": {"liked": "— Everything", "disliked": "— I had to go home"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "What a myth blown out into orbit. the staff were impecable from the very polite and happy checking in people to Charles the bar man.", "title": "Great Hotel", "helpfulness": 7, "user": "Himelda", "date": "August 21, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5635882, "likes": {"liked": "— Everything"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "The room was not the biggest room in the world but sufficiend for a city hotel, it was immaculately clean and I think the decoration was very nice. The expresso coffee machine was also a welcome treat fantastic coffee.", "title": "Everything I expected.", "helpfulness": 4, "user": "joan-ed", "date": "August 20, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 5627959, "likes": {"liked": "— Efficently run with friendly attitude", "disliked": "— nothing"}}, {"rating": 5.0, "title": "Service with a smile", "text": "The bathroom was fantastic lots of mnarble and good tiles, a walk in wet floor shower and a very good lit mirror. The bathroom was absolutely spotless too.", "helpfulness": 5, "user": "Chav69", "date": "August 16, 2006", "id": 5616157}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The greatest thing about this hotel is the location. If you are in Berlin to sightsee, then the Big Red Tour Bus (22 Euro per day) stops right outside the hotel. From there you can hit all the touristy attractions.", "title": "Loved the Swissotel", "helpfulness": 6, "user": "Christine O", "date": "March 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7209641, "likes": {"liked": "— Location", "disliked": "— Weather in Berlin was cold and rainy"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "As for the room, it was clean, comfortable and was pretty spacious (for Europe).", "title": "German Efficiency at Its Very Best!", "helpfulness": 7, "user": "Winner_Wannabie", "date": "March 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7148639}, {"rating": 5.0, "title": "The most wonderful experience...", "text": "If we were go to back to Berlin, we'd stay at the Swissotel again.", "helpfulness": 7, "user": "blissfultranquility", "date": "March 9, 2007", "id": 6940164}, {"rating": 5.0, "stay_parameters": "Stayed February 2007", "text": "Not much to report here except to say that this hotel is fantastic in every way. It is superbly located, modern, clean, stylish and, if like us you book it a great deal in advance using the web, exceptional value for money.", "title": "Nice place", "helpfulness": 2, "user": "teachers_on_tour", "date": "March 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 6926454, "likes": {"liked": "— Clean, safe and comfortable", "disliked": "— Nothing, but I think more stuff is happening in Mitte"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "We've stayed at a number of Swissotels in the UK (The Howard, London in particular) and can vouch for the fact that the team at Swissotel Berlin run a much tighter ship than their UK counterparts and should be commended for it. For any occasion (romantic getaway; business trip; weekend city break), I would thoroughly recommend this hotel. Stay here. Go on.", "title": "Service experts", "helpfulness": 6, "user": "John-Elaine", "date": "March 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6902789, "likes": {"liked": "— Bed and Aircon", "disliked": "— No swimming pool"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "We were given a very warm welcome when we arrived at the lobby of the Swissotel. It is a rather unusual set up whereby you have to get into a lift to go up to the reception area for check in. The lady at the reception greeted us as soon as we got out of the lift and the check in was quick, without any hassle. The room is large and comfortable. We love the bathroom, very modern and clean. If you are a espresso lover, well this is for you. There is an espresso machine in the room. It is easy to use and the quality of the espresso produce by the machine is good.", "title": "Impeccable", "helpfulness": 5, "user": "Mil4d", "date": "February 27, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4559589}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "A very thoughtful gesture on the part of the hotel, by providing a good range of stationery for the guest in the room and you can use the keyboard to send email in the room.", "title": "A nice hotel but not really as good as most here make it out to be!", "helpfulness": 11, "user": "Joizee_HD", "date": "February 27, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4540234}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "The location is great, within walking distant to the Christmas market and all the nice shops. In fact, we walked to the Tiergarten and beyond, to the Berlin wall, Check point Charlie etc. As for restaurants, there are a few very nice restaurants nearby, especially the ones referred to by the hotel.", "title": "Great Hotel", "helpfulness": 3, "user": "tschye", "date": "February 15, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4460933}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "We really enjoyed our breakfast there. The yoghurt is great. A great selection of pastries, breads, fruits, salads, cold meat (great smoked salmons), and lots more.", "title": "Just as good as we remembered", "helpfulness": 3, "user": "flinny", "date": "February 10, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4451642}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "We will gladly stay here again and if in doubtful, we will choose to stay in Swissotel in other cities.", "title": "Great hotel, great location", "helpfulness": 2, "user": "wllopez", "date": "January 21, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4367947}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "Having used this website to help make a booking and having been really pleased with the hotel I felt the need to add to the already glowing report.", "title": "warm & friendly", "helpfulness": 12, "user": "cortile", "date": "April 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3418847}, {"rating": 5.0, "title": "Top Draw!!!!", "text": "The hotel lived up to its standard and was exceptional value for money. As with many other travellers we paid extra for the executive floor and this was money well spent.", "helpfulness": 13, "user": "nickwhite26", "date": "April 8, 2005", "id": 3344731}, {"rating": 5.0, "stay_parameters": "Stayed February 2005", "text": "The staff were some of the friendliest I have met on my travels, and were always there with a warm smile and genuine regard.", "title": "Stylish & Relaxed in Berlin", "helpfulness": 22, "user": "shonagon", "date": "April 4, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3326846}, {"rating": 5.0, "stay_parameters": "Stayed February 2005", "text": "The rooms are modern in style and very functional. They had all you would expect from a swissotel, clean rooms, modern stylish bathrooms, robes, minibar etc.", "title": "5 Star City Hotel!", "helpfulness": 21, "user": "mcmdee", "date": "March 30, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3311546}, {"rating": 5.0, "title": "fantastic hotel", "text": "I am hoping to return to Berlin in the next few months and will definitely make this hotel my first choice.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "March 21, 2005", "id": 3291765}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled solo", "text": "This is a nice hotel. No complaints, the room was clean & comfortable. The Nespresso coffee maker was nice. Good security, scan your room key in the elevator to access your floor. Large windows, which opened. The restaurant across the street, Vapiano, was nice.", "title": "nice", "user": "34isit", "date": "November 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 5.0}, "id": 49597527}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "The location was not far from a U-bahn station and a little farther to a S-bahn station. The Ku’damm shopping street is a few steps away.", "title": "Beautiful, modern hotel in a great location.", "helpfulness": 2, "user": "billiejoe", "date": "November 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 49568829}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "The hotel provides a lot of extras – doorman, three room phones, robes and slippers, 110 volt outlet, separate shower and tub. Not sure how much value these represent to the typical tourist.", "title": "Helpful and friendly", "user": "pkr2000", "date": "November 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 49178586}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The hotel is designed for the business traveler, not so much for the tourist. Services, like the restaurant and wifi, are a bit expensive, meant for the expense account crowd.", "title": "Very Fine Hotel In Excellent Location", "helpfulness": 2, "user": "carrigman", "date": "November 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49061087}, {"rating": 5.0, "title": "excellent hotel", "text": "On my last visit, I stayed at the much more modest ‘Hotel-Pension Bregenz’ a few more blocks out the Ku’damm. I liked it much better. For a future visit, I’ll first look for a more interesting location, probably in the eastern sections.", "helpfulness": 1, "user": "JinaneA", "date": "November 11, 2009", "id": 48989277}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "We stayed her for three nights to celebrate a friend's stag weekend. The service was excellent and unobtrusive; the price was ridiculously good, considering the location and facilities and the price was fantastic (I still don't understand how we got a twin room for $120 per night). I would stay again.", "title": "Stag Do", "helpfulness": 2, "user": "Clerkenwell", "date": "May 8, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5041852}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "This is one of the best hotels I have stayed in, it compares with all the five star hotels.", "title": "seriously classy hotel", "helpfulness": 4, "user": "IrelandQwerty", "date": "May 4, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 5034319}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "It is modern with a friendly and unobtrusive staff. The rooms are state of the art with modern solid furniture and all business requirements. You could literally live in the room with the room service! The room service is the best i have ever experienced. The restaurant is good but a little overpriced. Everything works in this hotel and it is a surprisingly calm place to stay in busy west berlin.", "title": "Nice Hotel", "helpfulness": 2, "user": "Englanderin", "date": "May 2, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 5026639}, {"rating": 5.0, "stay_parameters": "Stayed April 2006, traveled on business", "text": "This hotel is well placed for visting the sights (or sites) with easy access to Zoo Station and the underground. Staff are pleasant and the rooms comfortable.", "title": "Another Great Easter Break", "helpfulness": 9, "user": "7DegreesOfWonderment", "date": "May 1, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5025149}, {"rating": 5.0, "title": "Great Location In Berlin", "text": "MY third time to stay at this very centrally located hotel. Destined to a business traveller the rooms are well appointed, not huge, but comfortable. The bathroom is small but so well designed that all works in a way that makes up for its lack of space. The common areas are well designed and comfortable. I have found all staff to be extremely helpful and friendly. The main restaurant have quite experimental cuisine that can be as self concious as it is expensive - though good. If you are staying as a group with a few rooms make sure to request you all stay on the same floor as your key card must be swiped in the elevator only giving you access to one floor. It is a real pity that they have removed the steam room from the health centre on the ground floor this had been a real plus in the past. A hotel of this level really misses a pool. There is a very good gym accross the street. I found the best rate on their own site. Will definately continue to stay here on my trips to Berlin.", "helpfulness": 3, "user": "SBCATraveler", "date": "April 11, 2006", "id": 4966097}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "The staff including reception, concierge and bar staff were friendly, couldn't be more helpful and were incredibly attentive.", "title": "Great hotel", "helpfulness": 13, "user": "winnie m", "date": "May 31, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5287640}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "I had upgraded our room the day before leaving to an executive room and it really was worth the extra money!", "title": "Highly recommended", "helpfulness": 13, "user": "miramol", "date": "May 30, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5235401}, {"rating": 5.0, "title": "Attentive Staff", "text": "The room was fantastic with a view out over the city. The bathroom was huge with the biggest bath I've ever seen and a seperate shower. The room also had everything you would ever want: hair-dryer, stereo, iron, safe, mini-bar and ice bucket, body lotions, ear buds, slippers and dressings gowns to name but a few! I particularly loved the turn-down service provided in the evenings, however be careful with housekeeping. They do not wait on you to answer when they knock on your door and just walk on in, so I kept the do not disturb sign on when I was in the room.", "helpfulness": 9, "user": "BuffDundee", "date": "May 24, 2006", "id": 5211907}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "The executive lounge was also great with drinks (alcohol and non) and snacks available all day. If you had an upgrade, you could have breakfast there too.", "title": "Wonderful hotel", "helpfulness": 11, "user": "natbro", "date": "May 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5064745}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled solo", "text": "The hotel has been one of the best business hotels I have ever visited. The beds are super confti, the ambience relaxing - tonnes of towles and the cleanliness absolutely perfect. Situated in one of the most knowen shopping streets, one finds loads of restaurants, bars (incl. happy end) and shops just steps away.", "title": "durable memory", "helpfulness": 2, "user": "affenzahn", "date": "November 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48409824}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled solo", "text": "The management cares about you and if you have a problem a solution will be found within minutes.", "title": "Amazing hotel!", "helpfulness": 2, "user": "Alexandra033", "date": "October 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47621450}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "Over all - I will be back!", "title": "Excellent location!", "helpfulness": 1, "user": "Reese619", "date": "October 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45780741}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "One of the greatest hotels i have stayed in my life. Nice,friendly and helpfull staff,great and modern interior. Location is excellent too.", "title": "Excellent hotel, excellent service and excellent location", "helpfulness": 2, "user": "woodie49", "date": "September 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 43897594}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "It locates centrally at the zoology garden, The shopping center is nearby as well as good neighborhoods with lots of restaurants. Had very comfortable stay at the hotel.", "title": "Central, clean, beautiful", "user": "POPIGREECE", "date": "September 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 43527237}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "Stayed here as a tourist for one night In late August 2012. Very nice, helpful front desk and concierge staff. Close to shopping, zoo, s-bahn, walking tours. Would have preferred to stay closer to the center of tourist, historical East Berlin, although public transit was easy to get to East Berlin. Luxury hotel. Nice lobby and rooms. Sumptuous buffet breakfast was included in my room price, smoking it s good deal.", "title": "Very nice, clean, modern west berlin hotel near zoo & shopping", "user": "mdgwind", "date": "October 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 141727453}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Hotel in a very convenient location. Staff at the hotel is very nice and helpful. The room was ok, spacious and nice. The only bigger issue was no free wifi - it should be standard in hotel like this. The breakfast was very good compared to other hotels. I was staying there just for one night so I can't tell more about facilities available in this hotel.", "title": "Nice hotel with a good location", "user": "settler14", "date": "September 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 141677965}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Very good business hotel. The room was nice and modern. The location is excellent. The staff is helpful, though the lobby on the 1st floor needs getting used to. As I only staid for 1 day I could not check out the facilities.", "title": "Gutes Hotel in Guter Lage", "helpfulness": 1, "user": "CKober", "date": "September 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141471035}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Overall I would recommend this hotel for the business traveller, not so much for families.", "title": "Wonderful stay, a truly 5-star hotel", "user": "prettygood86", "date": "September 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141463358}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "I stayed at this hotel back in 2008 during a conference and I recall being surprised by this hotel, although I probably got the smallest room they have (they told me it was not a big room but it had the best view from the hotel to Ku'damm, which was true).", "title": "Excellent hotel in the centre of Berlin", "helpfulness": 1, "user": "LeeontheSolentNigel", "date": "September 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141226711}, {"rating": 3.0, "title": "so so", "text": "nice hotel-not the best in berlin-adlon is the best- smal rooms-inside vieuw sucks-early incheck not poissible-good central posistion", "helpfulness": 2, "user": "A TripAdvisor user", "date": "October 24, 2004", "id": 2783008}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "I spent almost a week in Swissotel Berlin in September, I have only positive experiences. Room was really nice, I also liked very much the Nespresso coffee maker in the room. The staff was how one would expect in a hotel like this, the location is really good also, as it is very close to many public transport alternatives, and very close to Tiergarten, too, etc. The only thing that seemed a little stupid is the entrance, as the reception and lobby is on the 2nd floor, and if you enter the hotel you will only find an elevator at a relatively small place like in MIB. So if you want to go to your room or exit the hotel, you have to use two different elevators, which sometimes results in a traffic jam if too many guests are there at the same time. But it was not a big problem, the hotel is really excellent.", "title": "Excellent hotel, excellent location", "helpfulness": 1, "user": "kcsaba78", "date": "October 12, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 142615385}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Stayed on business trip for 3 nights in May 2011. We liked everything about the hotel. My room was spacious with a big and comfortable bed. Nescafe coffee maker offers delicious coffee. It's my first stay in Berlin but I will return to this city some day. I will remember Reichstag (wonderful excursion, signs of Russian soldiers on the walls), Spree boat trip though it was raining. Good shops nearby.", "title": "Brilliant Hotel", "user": "Natashik_12", "date": "October 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142613932}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Berlin being a vast city, you want to be close to amenities: trains, metros, busses, shops, etc.", "title": "What a Way to Wonder about BerliN!", "user": "RvanD", "date": "October 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142412629}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We decided to stay at the Swissotel because of all those things and because of the pictures of its rooms. We were not disappointed!", "title": "Lovely stay", "user": "ExpatNB", "date": "October 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 142268491}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "The suites are very spacious, clean, very well appointed and comfortable. Whether you come back from a busy day shopping, sightseeing, or just wish to have a whole day in you suite, you'll feel right at home. Staff is friendly, helpful, and efficient (you're in Germany after all), housekeeping is prompt and the laundry service is second to none.", "title": "Quiet, excellent bedding, nespresso machine.", "helpfulness": 1, "user": "Philippe T", "date": "October 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141803446}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "I simply can not understand some of the luke warm reviews that this hotel has had over recent weeks.The IS as good as any 5 star hotel (in fact better than most) but due to its size is available at 3 star prices.The location is second to none,the rooms superb and the service brilliant.", "title": "Stop talking rubbish!!!", "helpfulness": 13, "user": "Jaws8", "date": "August 15, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3766453}, {"rating": 3.0, "title": "Disappointing Swissotel", "text": "Some people in this world seem to feel the need to complain about the smallest details that can mislead potential viewers of this site into choosing the wrong hotel.", "helpfulness": 6, "user": "TanDublin_Ireland", "date": "August 6, 2005", "id": 3741730}, {"rating": 5.0, "stay_parameters": "Stayed December 2004", "text": "Take it from me,I have stayed in 5 star hotels all over the world,this is top notch.Coupled with what can only be described as brilliant prices for a major European capital,book it with confidence.", "title": "like home for 3 weeks", "helpfulness": 7, "user": "ladywesson", "date": "August 5, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3739486}, {"rating": 5.0, "title": "Wow", "text": "p.s Try and get a hotel like this for under $150 in Rome,Paris or London!!!!! lol.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "August 4, 2005", "id": 3737375}, {"rating": 3.0, "title": "Not a five star hotel", "text": "We just spent 4 days last weekend in the Swissotel Berlin. Like previous reviewers, this hotel doesn't deserve the 5star ranking accredited to it. Overall, the service at the reception was good, and the breakfast was sumptuous. However, there was no turn-down service, even after we have requested for it after the first night. In addition, the acclaimed fitness and wellness center was a disappointment. The gym feels so clostophobic as there were no windows at all. Also, the lavazza coffee machine in our room didn't work at all. Overall, I think it is only worth a 4* rating - thus, I would not pay anything beyond a 4* price for it.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "July 31, 2005", "id": 3724843}, {"rating": 3.0, "stay_parameters": "Stayed July 2005", "text": "Elegant lounge and breakfast area, but rooms standard corporate style. Carpet stained in both rooms. No evening turndown service. Twin bedded rooms have small beds with hard mattresses. Unexciting toileteries. Would agree that this is a good 4-star and not a 5-star hotel.", "title": "a little disappointing", "helpfulness": 7, "user": "thingummyjig", "date": "July 29, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 4.0}, "id": 3720354}, {"rating": 2.0, "stay_parameters": "Stayed July 2005", "text": "Price dropped on Expedia, 3 days before we were due to arrive so that we were unable to cancel our Swissotel booking and re-book through Expedia.", "title": "good place to stay only if price is right", "helpfulness": 8, "user": "dtoe5", "date": "July 20, 2005", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "service": 2.0}, "id": 3684695}, {"rating": 3.0, "title": "Nice and clean, but not worth their five stars", "text": "Concierge very helpful.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "July 17, 2005", "id": 3674854}, {"rating": 5.0, "stay_parameters": "Stayed June 2005, traveled on business", "text": "Exterior of the hotel spoilt by huge C & A shop at ground floor level.", "title": "The Swissotel is simply the best!", "helpfulness": 9, "user": "spacekid", "date": "July 11, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3656247}, {"rating": 5.0, "title": "Stay in style at the Swissotel!", "text": "Stayed for 8 nights in july . If you can stay at this hotel for no more than 120eu w/breakfast it is a good buy.21 eu each for breakfast is very expensive. Anything more is not worth the price. Found a dirty sock on check in. Had to beg the waiter in the morning for a second cup of coffee. Coffee machine in room did not work till someone came up to fix it. Two nights out of 8 had no turndown service. And a couple of nights the service came after we had gone to bed. This is not a 5* hotel. Was very disappointed after reading all the rave reviews about this hotel. Will try another hotel next time.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "July 8, 2005", "id": 3649806}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "Only 15 mins by cab from Tegel Airport. Near the shops and with great views. Travelled with a friend to attend a family wedding. We arrived to find that we had been booked into a double room, which the staff immediately changed to a twin upon request. The hotel were very helpful in providing google maps for directions from the hotel to the two wedding venues (this included estimated times and cost of cabs). Although the breakfast at the hotel was very good, if you are on a budget the a la carte menu in the main restuarant may not be for you as it was very pricey, especially now that pound is so week against the euro!! We found that the better option was to eat in the snack area of the hotel which serves a good selection of meals at a more reasonable price - almost a third cheaper. All in all not an inexpensive hotel but we would definitely stay there again.", "title": "Fantastically helpful staff, nothing was too much.", "user": "piccolo20", "date": "September 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 39416051}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We had a wonderful 2-night stay at the Swissotel, which is within a stone's throw of the Gedaechtniskirche (the bombed church in former W. Berlin), the Ku'damm and a metro station. The service was impeccable and the interior modern without being overly trendy. Probably most appropriate for adults, but we did see a few kids. Perfect for business, too (although, as is often the case in Europe, there is no free wireless service). A small business center offers free internet access, however. A lovely, light-filled lobby would be appropriate as a meeting place for business people.", "title": "Serene oasis in center of former West Berlin", "helpfulness": 1, "user": "Unter4Augen", "date": "August 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39144569}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Swissotel's location, in the former center of the west, is no longer the center of Berlin, which has moved back to its historic location in the east. We did end up taking some 20-minute Metro rides to go sightseeing, but public transportation is excellent. For shopping, however, the Ku'damm is still outstanding and there are numerous \"normal\" stores (like C&A and drugstores) surrounding this hotel, in case you forget to pack something. A 15-minute walk will bring you to the KaDeWe and its wonderful \"Kaffee und Kuchen\" meeting spot on the 5th floor.", "title": "Very central hotel - great breakfast!", "helpfulness": 1, "user": "worldtraveller99", "date": "August 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 38734866}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "All in all, a highly recommended hotel in Berlin.", "title": "Great value hotel", "helpfulness": 1, "user": "hipposWiltshire_UK", "date": "August 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 37637251}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Stayed here for a week - booked through DERTour in UK - recommend them highly.", "title": "Beautiful Hotel in very good location", "user": "Barney2009", "date": "August 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 37590783}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "After reading the different reviews we choosed this hotel for our three night stay, although we booked for the internet price Euros 140,- with an exelent breakfast incl. on ariving we preferred a K' dam view- room, which we obtained paying Euros 30 extra.p.n. one observation only, the top sheets were smaller then the bed.", "title": "good value swisshotel", "helpfulness": 5, "user": "fannyBarcelonaSpain", "date": "July 3, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "service": 5.0}, "id": 3632782}, {"rating": 4.0, "title": "Ok, good value if you get good offer...", "text": "All the staff was very professional and friendly, except the ober kellner, the restaurant has an acceptable quite expensive nouvelle cuisine.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "July 2, 2005", "id": 3630227}, {"rating": 5.0, "title": "Excellent Value", "text": "Situated in the comercial west center of the city a little far from the cultural center but there is a good transportation connection.", "helpfulness": 11, "user": "Readeverynight", "date": "June 20, 2005", "id": 3580551}, {"rating": 5.0, "title": "Top Hotel, great location", "text": "So we can recommend this hotel as a good value if you can get the special price.", "helpfulness": 4, "user": "Canberra_Traveller", "date": "June 18, 2005", "id": 3574696}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "This is a good hotel and is is located in the heart of Berlin. My wife and I just spend a day holiday at the Hotel, and choose to do so on the back of the many fine reviews the Hotel has recieved on this web-page.", "title": "Standard rooms are great as well", "helpfulness": 11, "user": "Holly13", "date": "June 14, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3550284}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "I think other reviews have covered everything there is to say about the location and the wonderful staff they employ. The rooms are basic, clean and comfortable for short stays. The only negative for me was the pillows which were really flimsy, I struggled to get comfortable in the end had to use the spare duvet as a pillow. Overall really nice hotel, lovely breakfast, great cocktail lounge and good room service. I was expecting a bit more from the room but in the end I was satisfied just wish they had better pillows. WiFi costs 12 euros per night which considering its a 5 star should really be free.", "title": "Wonderful staff, excellent location but hotel definitely needs better pillows", "user": "Taz7441", "date": "April 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 105363460}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We booked a basic room for 5 night from booking.com and we also a clubswisse members.", "title": "very good but something is missing.......", "user": "buiumb", "date": "April 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 105296071}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "First we got a twin room, so we asked to change it to double room but then we got a double room in the lowest floor and in the farest way to the elevator turns to back compund. also the \"queen\" bed was very small. all in all it's a 5 star hotel, situated in a very good center location with a high class front desk service but some of the room (the basic one) gives a sence that someting is missing for this 5 star hotel.", "title": "Central hotel with great service", "helpfulness": 1, "user": "OxfGuy", "date": "April 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104939481}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled solo", "text": "Just returned from a 4 night stay with partner & the in-laws, staying at the lovely Swissotel in Berlin. It was our 2nd stay at this hotel, so pretty much knew the high standard we would be exposed to.", "title": "Possibly the best hotel I've stayed in!", "user": "Samaldo007", "date": "April 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104823092}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We had an inside room, which look out into a inner quod (which has a couple of painted cows munching some astroturf in the middle). The outer rooms look out onto the Kurfurstendamm (a busy hectic main shopping street), so I would not bother paying the extra for this view! The rooms are of a good size & quite contemporary in design/layout. The bathroom had a shower & a bath (rather than a shower over the bath!). Iron & ironing board in the room & also a fantastic Nespresso machine... a great addition for coffee addicts.", "title": "Hotel Great. But Couldn't Sleep", "user": "twentyeight", "date": "April 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 103289728}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Like all Swissotels I have visited, Berlin provides high quality accommodation and service. The major benefits for Swissotel Berlin are its location and staff. The location is perfect for shopping, public transport and the zoo. The staff are all equally adept at providing the highest quality service, although a special mention must go to the reception staff who were universally terrific. The room was very spacious and had terrific floor to ceiling windows. The room was non smoking, however for the 5 days we were resident there was always a smell of cigarettes. A major drawback that remains for Swissotel, and many large hotel chains, is the lack of free wifi!", "title": "Great Location and Service", "user": "andricScotland", "date": "September 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 43485076}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Excellent service! Nice staff, great beautiful room on 10´th floor and a wonderful breakfast. No problem with lactosfree products. As good as it can be!", "title": "They made me so happy!", "helpfulness": 1, "user": "Trekkern", "date": "September 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 43377540}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Lovely modern hotel with a heart.", "title": "Loved this Hotel", "helpfulness": 1, "user": "watty77", "date": "September 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 41123746}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "Check in was smooth & easy.", "title": "5 star hotel but...", "user": "eilotas", "date": "September 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 39685460}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Room was wonderful with a great view of the Ku Dam . I liked the low floor lighting for night time trips !!", "title": "Fantastic service and comfortable rooms", "user": "CarlaBrighton", "date": "September 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 39596499}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "Another very satisfied customer. The hotel is aimed at business travellers but is perhaps an even better experience for those on holiday, who have time to enjoy the room, the hotel design, the service and the food. Honestly, it was hard to leave.", "title": "Worth every penny", "helpfulness": 10, "user": "alice87", "date": "June 3, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3527620}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "My partner and I stayed at the Swiss hotel Berlin the last weekend in May.", "title": "Long fingers hinder perfection", "helpfulness": 10, "user": "gueray", "date": "June 1, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3515963}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "Room:", "title": "Exceptional value", "helpfulness": 12, "user": "sigmund", "date": "May 18, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3483117}, {"rating": 5.0, "title": "Exceptional!! Highly recommend!!!", "text": "We stayed on the 9th floor, the executive room floor. It was well worth the extra money. Room was light and just big enough, though we did miss a bigger wardrobe and the bed was a bit on the hard side. As in other Swiss hotels, we enjoyed the espresso machine and a well stocked minibar. The room also proved to be practially sound-proof, as the VERY celebrating football teams outside were not to be heard inside. Service was very good, timely and the turn-down service was also very professional.", "helpfulness": 25, "user": "A TripAdvisor user", "date": "May 8, 2005", "id": 3449785}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "Food:", "title": "excellent cost-benefit rate", "helpfulness": 13, "user": "Orric", "date": "May 4, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3438491}], "location": {"country": "Germany", "continent": "Europe"}, "stars": 5, "variance": {"poor": 26, "average": 75, "very good": 388, "terrible": 3, "excellent": 987}, "aka": "Swissotel Berlin Hotel Berlin", "slim_ranking": 0.0375375375375, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Swissotel Berlin is located at legendary Kurfürstendamm in the heart of city center west! Upon entering the modern, light-flooded lobby you will immediately sense the tranquility. The contemporary design, as unobtrusive as the friendly service promises a pleasant and relaxing visit. Guests appreciate the convenience of wireless LAN, DSL Internet connection, as well as the Lavazza coffee maker in all of the hotel's 316 rooms."}