{"user_rating": 4.5, "review_count": 167, "name": "Sydney House", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "Just got back from a three night stay in London at the Sydney House Chelsea Hotel. Tend to agree with everything that the reviewer said on 1 April. We had a similar room - the king deluxe on the first floor with the little balconies for £165 per night (booked via the hotel's website). Haven't stayed at other London hotel's so not sure if this is good value or not. The room was not large though well arranged. About 3 feet on one side of the king bed and about 6 feet on the other side. Flat screen tv on the wall, desk area and inbuilt couch. Nicely decorated - very subtle tones of creams and browns. Both my husband and I had laptops, so we appreciated the inroom safe big enough to fit the laptops. Managed to get unsecured wireless from a neighbouring office which was good. The bathroom was lovely but the shower head was so high I could not reach it and the water only came out in torrents.", "title": "Nice hotel, pleasant spot", "helpfulness": 12, "user": "jmlparis", "date": "June 26, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 5383594}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "The area is fairly residential - definitely not in the heart of things. But, a gorgeous area to be in with some nice restaurants and shops nearby. We found we spent a lot of time on the tube getting to places we wanted to be. Overall, a very pleasant stay, but we didn't actually spend much time at the hotel other than sleeping.", "title": "Great boutique hotel - downside room noise", "helpfulness": 6, "user": "acehole007", "date": "April 20, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4990162}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "Modern boutique hotel. Perfectly presented rooms, good quality if expensive breakfast (£15 each incl. coffee, good, quiet (road noise wise) and convenient location. Friendly and helpful staff.", "title": "Subtlety, Service, Superb Location", "helpfulness": 12, "user": "joepinstripe", "date": "April 1, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4826332}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "Downside, showers that fluctuate from cold to scalding in a second and noise from rooms above (4th floor) as it seems they have wood floors and every chair movement and bed movement is amplified to rooms on the 3rd floor.", "title": "Sleek sheik modern boutique", "helpfulness": 17, "user": "DrMac", "date": "January 11, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4346370}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "I was very pleased to have stayed at Sydney House for two nights, March 28 - 30. My room was #11, a Premier Deluxe with a king bed. I paid 165 pounds per night, taxes included, which I reserved from the hotel's Web site.", "title": "Fantastic Hotel", "helpfulness": 7, "user": "Cikka", "date": "December 16, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4245152}, {"rating": 5.0, "title": "Many thanks to Tripadvisor", "text": "I spent hours reading reviews about hotels in London and discovered that the Sydney House was the perfect place for us. It is the kind of place that I could stay for several weeks. The accommodations were luxurious compared to some of the places we have stayed in London. The furnishings in the room as well as the public spaces were very tastefully done. The neighborhood is a little off the beaten path but in walking distance to the tube station. The shopping and restaurants in the area are upscale. All I can say is that I did not want to leave except that the prices in London are outrageous. We will definitely stay there again next time.", "helpfulness": 7, "user": "FLB", "date": "November 22, 2005", "id": 4136769}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 4, "variance": {"poor": 4, "average": 13, "very good": 69, "terrible": 0, "excellent": 81}, "aka": "Sydney House Hotel London", "slim_ranking": 0.153488372093, "description": "Sydney House is a contemporary townhouse hotel, only a few minutes walk from King‘s road and Knightsbridge.Sitting in a quiet Chelsea street, the capital’s most fashionable shops and restaurants are on its doorstep.Sydney House is conveniently located for Westminster and the City of London. It has direct road and rail links for London’s’ airport and Eurostar terminals.Behind the exterior of a listed Georgian building, lies a 21st Century hotel. Each of the 21 bedrooms is dedicated to comfort, air conditioned throughout, goose down quilts and sleek, glass bathrooms. Individually designed, all rooms have discreet technology. DVDs, flat screen TVs, and WIFI are provided. Sydney house has a fully equipped boardroom, available for smaller meetings/receptions. 24-hour room service and “a la carte” breakfast make Sydney House Chelsea, a “Private home in the City”."}