{"user_rating": 4.0, "review_count": 1330, "name": "Taba Heights Marriott Red Sea Resort", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Like alot of people, we ignored the less than complimentary reviews as we like to go away with an open mind, but here's our opinion on our weeks holiday.", "title": "Expected more from a Marriott", "helpfulness": 3, "user": "822018", "date": "April 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 7281017, "likes": {"liked": "— beach", "disliked": "— food quality"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We went for sun and a relaxing break away from work. We like the beach and at Taba Heights this is great and very quiet. We both chilled and read two books each. The pool area is also pleasant with plenty of sunbeds available but more noisy.", "title": "Taba was tantastic!", "helpfulness": 7, "user": "Jodsx", "date": "April 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7269332, "likes": {"liked": "— pool", "disliked": "— the eygptian night should have been included in holiday price not as extra"}}, {"rating": 2.0, "title": "Taba [--]", "text": "However contrary to other reviews the standard of cleanliness in our room was just OK (we tipped our cleaner daily) and the terrace to our ground floor room was filthy so we never used it, as we had no view anyway.", "user": "Disgustedof", "date": "April 1, 2007", "id": 7266794}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We are not fussy eaters at all, but the buffet food ,although there was plenty of choice was bland/barely warm.My husband had an upset tummy for most of our week away and I developed this towards the end of the week. We are both still suffering over a week since our return.", "title": "Gardens fantastic", "helpfulness": 1, "user": "justlovetotravel", "date": "March 31, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 7259911, "likes": {"liked": "— The gardens are truly fantastic", "disliked": "— Building noise from Soffitel next door plus food in the evening"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We took advantage of the dine around scheme and had our best meal at the El Mar ( Intercontinental). The food at the Marriott Tuscany restaurant was just the buffet food with A la Carte prices and £40 for a bottle of wine! We used room service once and this was good.", "title": "Didn't want to come home!", "helpfulness": 1, "user": "JohnandPauline", "date": "March 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7246607, "likes": {"liked": "— Very Clean and friendly staff", "disliked": "— The broken coffee flask lids at breakfast time."}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We chose this holiday for a quick week away from work in the sunshine. We are very relaxed about our holidays and, having travelled to some very out-of-the way places around the world, we enjoy experiencing the local and cultural differences of a destination and feel that this adds to the holiday experience.", "title": "Great Holiday, but expected better service from a Marriott.", "helpfulness": 1, "user": "susmis", "date": "April 19, 2007", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 7392849, "likes": {"liked": "— On a lovely beach with beautiful views to Jordan, Saudi Arabia and Israel.", "disliked": "— Poor restaurant service, pool-boys laying out towels on sun loungers at 6am for guests who pay the biggest tip!"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "HOWEVER, this Marriott really lets the brand down.", "title": "Fantastic, relaxing experience for all ages", "helpfulness": 2, "user": "seicofamily", "date": "April 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 7350742, "likes": {"liked": "— Size of room, cleanliness, value for money", "disliked": "— starkness of bedroom, lack of imagination in the buffet"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "I am a Platinum Marriott Rewards member and have used this hotel brand a lot in the past - they are well recognised as providing exceptional service. Unfortunately the service we received in this hotel was poor. We were on half board and each night when we went to dinner, we didn't receive our drinks order until after we had finished our meal. We ate at about 9pm most nights and the restaurant was not busy and yet they found it impossible to bring a bottle of water to our table in less than 15/20 minutes.", "title": "We would go back ! not immediately though ...", "helpfulness": 2, "user": "TheGeez", "date": "April 11, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 7330004, "likes": {"liked": "— laclk of food choice for lunch"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Breakfast was not much better. Although breakfast is advertised as starting at 6.30am, we couldn't get any tea or coffee until the staff arrived which was usually closer to 7am. We chose to eat on the terrace outside and for every meal had to chase the staff for several items missing from our table - knives, forks, napkins, drinks etc etc.", "title": "Nice beach, Nice rooms, shame about the food!", "user": "The_Sims", "date": "April 11, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "rooms": 5.0, "location": 3.0}, "id": 7329007, "likes": {"liked": "— The room and the quiet Beach", "disliked": "— The food and kitchen hygiene"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled solo", "text": "When I brought up these issues with management, they indicated that the slowness of service was due to cultural differences. We stayed in the Sofitel next door to the Marriott 2 years ago and had great service (and we have experienced better service from a tea-house in a remote region of the Himalayas!). I believe that if company ,such as the Marriott, wants to charge £UK and $US for a stay in this (apparently 5*)hotel they should be providing an appropriate level of service. Had I been spending Egyptian Pounds to stay in a locally run Egyptian Hotel I would have expected to receive (and would have been happy with) Egyptian-style service! This Marriott is probably a 4*, but I would have to give the food and service a 3*.", "title": "Great to just sit back & relaz", "helpfulness": 3, "user": "angwri", "date": "April 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 7294269, "likes": {"liked": "— Staff, location, food, pool", "disliked": "— No tea & coffee making facilities in bedrooms"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "My partner and I have just returned from a week at the Taba Heights Marriott Beach Resort and we have to say that this was not the five star experience that we had expected having read the previous reviews on this hotel. We arrived at the airport that is basically an ex-military base - one building, one landing strip. Once you get through the passport check (only one man in a cubicle for the whole plane) you wait for your luggage that is taken off the conveyor and left on floor for you to search through. Its cold when you arrive as Taba is much higher above sea level than the resort so make sure you have something warm if arriving at night as most flights seem to arrive at ungodly hours! Flew with XL airways - another word of warning you have to pay for everything on board - £5 just to get a blanket and pillow or as they call it a \"care pack\"! Once on board the coach its about 40 mins to the resort and the guide is friendly and interesting. Hotel looks wonderful from outside and reception the same. When we arrived we were told no sea view rooms come back in the morning! We did go back in the morning but were told there were no sea view (despite the fact that half the hotel was empty - but they eventually showed us one room that had not been cleaned and the whole balconly area was covered in bird droppings and we could just make out the sea through the grounds). Before going to our room that night we were given a box of cold food - sandwiches apple and a juice as too late for dinner - this was probably the best meal we had the whole time there! On arrival at our room they had not activated our room keys so after a trip back and forth to reception we eventually got in. The next day the same happened again so had to go back to get new room keys. They say mobile phones wipe them apparently!! Room was spacious and clean but nothing to get excited over. No tea and coffee making facilities and we were told we had to upgrade to a suite if we wanted that but could order hot water from room service - make sure you take lots of dollar bills for tipping each time. Bathroom and room was ok but it all needs updating to get anywhere near a 5 star rating. Had a small patio area leading onto a grassy area you share with adjoining rooms. Two words of warning on the patio area - firstly they don't tell you they have sprinkler systems in the grass. Left some beach stuff out on patio one evening and the sprinklers sprayed right up to the doors everything was soaking. Also no chance of sitting out on some evenings on the patio as they turn them on while you're sitting out! Secondly don't close the patio door behind you if you want to stop the flies getting in - it actually locks from the inside leaving you with another trip back to reception with no shoes to try to get someone to get you back into the room! They told us any problems use the phone along the corridor and someone will come down. We found a man in the grounds who managed to prise the door open with a leaflet stuffed in the door! Room mini bar was empty and stuff needed to be left in overnight to get anywhere near cool. 3 days into the holiday they turned up to stock the mini bar and we refused as was a bit late by then so they just left all the drinks in a bag on the floor in the room! We found the room really noisy - you can hear everything in the other rooms and outside - we could even hear a man using his electric shaver and people in the toilet!! Onto the pools etc. Lovely pool and beach area. One pool is heated but still not particularly warm. They provide pool towels at least. No one went in the other it was far too cold. Food and restaurant: truly awful. Buffet for breakfast and dinner and its the same over and over. Themed nights but you have to be really cautious. Desserts are always the same - lots and lots of horrible pastries and cakes that taste the same. We tried a whole plate of different ones and couldn't tell the difference from one to the other. Salads etc are all very salty and oily. For breakfast they put hot water and coffee on the tables none of which are hot enough and had probably been sitting all morning so you need to request a fresh lot. Only saving grace is a man cooking eggs to order or omlettes. Although the main dining area is indoor there are birds flying over the tables and sitting above and on the tables when you leave to get drinks etc as they search for crumbs - not very hygenic. Wine is extremely expensive. I also would not recommend this hotel for anyone with children as there are no choices for them at all in the buffet really - only from room service or if you wish to pay extra. There is another restaurant and the other bars do food but all pretty much the same and costs extra. The Italian restaurant is basically in the same place as the buffet just in an adjoining area but you have to pay extra also. Bottled water is provided - you have to pay for it and they do a \"deal\" for 12 bottles for price of 8! The tap water is ok for brushing teeth only. The Grotto restaurant for lunch is also extremely bad. Sandwich wraps etc. They offer themed nights in the Grotto for dinner but I wasn't prepared to give that a go after seeing them going round throwing plates onto cushions on the floor for your \"Bedouin\" evening. Hardly hygenic plates left on cushions all afternoon that have been laying around and that people have been sitting on all day! I dread to think what was stuck to the cushions!", "title": "This hotel should not be rated 5 Star!", "helpfulness": 6, "user": "Borisko", "date": "March 29, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 4.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 7244742, "likes": {"liked": "— The pool and beach", "disliked": "— The food and restaurants"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Despite being extremely careful and sticking to toast in mornings and the odd omlette I was really ill the last day after eating there and had to pay an extra £26 to keep the room for late check out and that is supposed to be \"discounted\"! That said I ended up with salmonella poisoning for which i'm still on antibiotics. Despite paying the room extension fee because of illness the hotel staff knocked 4 times and phoned once to ask when we were going to leave the room! The staff cannot be faulted for their friendliness and willingness to help but sadly this does not compensate for the lack of facilities and decent food which is down to the hotel at the end of the day! 3 out of the 7 days were overcast and cold which ok cannot be helped but the problem is there is absolutely nothing to do on these days in the hotel. We went to the 3 corners area up the road where you can buy stuff in the supermarket - none of which is priced so beware. Although we are not golfers the golf course is not as stated - only 9 of the 18 holes are open and they keep saying \"opening soon\" and apparently have been saying this since October 2 years ago. Evening entertainment is practically non-existent. We ended up just going for drinks and back to the room again! Internet access is £100 a week so don't bother with that thought! If you want an iron you have to request it from room service again and it is a rusty old ironing board. We were glad we took some of our own snacks and stuff from home as you cannot buy anything on the hotel complex from their shops at all unless you want tacky souvenirs. The airport is basic as you would expect. You are hoarded into a small waiting area of plastic seats and a man standing outside the toilet spraying air freshener constantly as it smells so bad. One small shop there selling drinks/chocolate etc and some bad souvenir shops. We stayed in Sharm last year and have to say it was so much better than this although Taba is a beautiful area for scenery and beach. Taba seems to be just starting out on the tourist route although some of these hotels have been here a while and you would have thought the large hotel chains would have begun to make their hotels the 5 star ratings they seem to think they deserve! We do realise that you are in Egypt after all and the way of living is very different but that doesn't mean that these large hotels should be advertising themselves as 5 star when then clearly are not. That said it is a very dramatic setting with the surrounding mountains etc and great for peace and quiet but peace and quiet is great as long as you have some great facilities to go with it to make the peaceful holiday you went for enjoyable!", "title": "Tranquility and pampering", "helpfulness": 3, "user": "LazydaysNottingham", "date": "March 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7217998, "likes": {"liked": "— Clean, Spacious & friendly", "disliked": "— lack of evening entertainment"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We have just returned from the Marriott at Taba Heights and cannot wait to go again.", "title": "Egyptian Treasure!", "helpfulness": 9, "user": "SteveLeicestershire", "date": "March 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7185144, "likes": {"liked": "— Location, staff, value for money, quality of rooms", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "Man-made Paradise and served with a smile!", "text": "The staff at the hotel could not do enough to make us comfortable, but at the same time were not invasive.", "helpfulness": 9, "user": "French-Franc", "date": "March 12, 2007", "id": 7122362}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The area is very quiet, the main entertainment being the fantastic snorkelling around the many reefs. The Marriott as with the other hotels has a 'private' beach but visitors can walk all along the sands/footpaths to the amazing jettys where the most incredible fish can be seen and you can join them in the water if you wish.", "title": "Taba", "helpfulness": 5, "user": "Jetsetter-bonvivant", "date": "March 7, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 6926406, "likes": {"liked": "— friendly staff", "disliked": "— nothing particularly"}}, {"rating": 1.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "I have to say this was the holiday from hell I have stayed in 5* hotels world wide as well as many Marriotts and generally they are very high standards.", "title": "Holiday from hell with e-coli", "helpfulness": 5, "user": "leeabbey", "date": "May 3, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 2.0}, "id": 7541720}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "When I booked the holiday I looked at the website at the standard rooms to see what I was getting so was very aware of what I should have had.", "title": "Superb hotel but not much to do in Taba", "helpfulness": 4, "user": "turnertactics", "date": "May 1, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7487241, "likes": {"liked": "— Layout, landscaping, location, quality, food, ambience, staff.", "disliked": "— The reefs off the beach were no good for snorkelling"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "When I arrived to check in to the hotel I was shown to the room to find that the bath was cracked the furniture was in bad conditioned the paint chipped which was a shock. I then went to reception be shown other rooms which were all a very low standard don’t forget this is meant to be a 5* hotel. I then went to discuss this with numerous people at reception to be told by the staff that I should accept it. I finally managed to speak to the manager who listened to my complaints and offered me an upgrade at a cost to the executive suite or the presidential suite.", "title": "Wonderful location, must go back.", "helpfulness": 5, "user": "Brian_Borrou", "date": "April 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 7486119, "likes": {"liked": "— Clean and airy", "disliked": "— Lack of condiments (coffee, sugar, tea)"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007", "text": "We decided to upgrade to the presidential suite due to the special occasion. We went to the room expecting our luggage to be sent up which turned up 2 hours later. We then decided to use the Jacuzzi on the balcony this had algae and was yellow so we could not touch it so we thought that we would use the bath turned on the tap and there was no water coming out the last try was the shower and brown mud came out. The staffs attitude was not 5 stars either everything was too much of a problem whether we were asking for a drink, help with reception or anything there was permanent attitude from all and I was disappointed by this.Things then decidedly got worst on day 3 I was taken to my bed as I became very sick and ill. I was told by the hotel doctor that it was sun stroke. I was quite sure that it was food poisoning as I have had it before but he said that it should be gone in 24 hours. The illness lasted in to day 7 I then reacted to the medication I was given and my tongue had swollen I could not breathe properly due to the fact that the hotel doctor had injected me with something that I told him I was allergic to. We were half board so were only ate at the hotel.", "title": "A fantastic week", "helpfulness": 5, "user": "Ducati916", "date": "April 26, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7438170, "likes": {"liked": "— The view over the Red sea", "disliked": "— Small bath"}}, {"rating": 1.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "There was an ambulance waiting on Gatwick runway when I returned and I was taken straight to hospital. I was given tests to find out that I had E-coli food poisoning. I have since been of work for 3 weeks as this is a serious illness that I contracted while on vacation with the Marriott.", "title": "Fasting, suddenly became much more appealing!! Awful!", "helpfulness": 5, "user": "skinnyhips72", "date": "April 20, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 1.0}, "id": 7404165, "likes": {"liked": "— going home", "disliked": "— not much"}}], "location": {"country": "Egypt", "region": "Red Sea and Sinai", "continent": "Africa", "city": "Taba"}, "stars": 5, "variance": {"poor": 88, "average": 157, "very good": 428, "terrible": 46, "excellent": 611}, "aka": "Taba Heights Marriott Beach Hotel Taba", "slim_ranking": 0.384615384615, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Cradled by the mountains and the beautiful Red Sea coast, Taba Heights Marriott Red Sea Resort lies nestled in the heart of paradise. Lush gardens and waterfalls cascading down onto swimming pools are the background to this majestic resort. Enjoy a variety of cuisines and distinctly unique restaurants. Experience the diversity from romantic candle lit dining at the Italian Tuscany to the enchanting atmosphere of the Grotto and the Mexican taste at El Fuego Café & Mexican Bar.Room types range from Standard Garden View to Beach front two-story Deluxe Suites, to the Presidential Suite with its own whirlpool on the huge balcony.Free WiFi Internet access available in all public areas of the hotel."}