{"user_rating": 3.0, "review_count": 128, "name": "Tahoe Beach Club", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "My husband, 2 children and myself ended up there last weekend b/c it was basically the only place with a room available since it was the holiday weekend. We paid $200 for one night and it was overall a terrible experience. Had I looked closer at the room when we first got there, I would have left. The place was infested with bugs, the room was not clean at all....I had to dust everything myself. The towels and wash cloths were more like stained rags you would use in your garage. There was a large group staying there with a bunch of small kids and they ALL stayed up and partied until after 1am. Even the little 2yr olds were running around screaming. I called the front desk 3 times to complain and was snapped at, and basically told \"tough\" and this is the way it is. The \"staff\" at this hotel would have been better suited working at the local McDonalds though I'm not sure I would want them handling food in any way. This hotel should be shut down. Why someone hasn't inspected it is beyond me! The hallways smelled and the carpets were so gross, it just made you shudder. I'm still upset that I didn't check out of there and that I wasted even a dime here! The trip for the kids was not very much fun unfortunately. All they wanted was the pool and that was jam packed with people. I hope anyone reading this decides to check their room FIRST and then if they like it fine, but look closely! The smaller \"motels\" along the lake there looked much nicer than this hideous dump.", "title": "Absolutely the most disgusting hotel ever...", "user": "erika2075", "date": "July 7, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 70083390}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "Great Location on the lake, close to downtown Lake George. Heated Pool was perfect. Small swimming area on the lake, but you can swim past the ropes if you want some space. Good Dock, paddle boats. Rooms were big, and clean. Tile floors throughout the room were great to wipe up the water tracked in by the kids. Nice and pleasant front desk staff. Would stay there again.", "title": "Great Location, Great Hotel for the Price", "user": "castleton20", "date": "July 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 69502070}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "On Lake George", "title": "Nice Location", "user": "rmsons", "date": "June 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67479201}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "nice Private beach", "title": "Great deal at off season rates", "user": "cocodog85", "date": "June 1, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 66086936}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "enjoy", "title": "not desireable", "user": "patti14", "date": "January 22, 2010", "detail_rating": {"cleanliness": 1.0, "location": 3.0, "value": 1.0, "rooms": 1.0}, "id": 54087188}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "I am from CT, and a friend and I decided to go away for a girls weekend and we ended up here! I am always one to plan and have a hotel booked though for once I listened to my friend about seeing the hotel before hand, what a fabolous idea! The staff was so outstanding and helpful by allowing us to check the room before booking, great customer service. This hotel was extremely clean and I felt comfortable there. Overall very very impressed!", "title": "Tahoe Resort Was Worth The Trip!", "user": "beckwiha7", "date": "October 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46885246}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "This hotel has a good location - close to the village, but not in traffic. The office was helpful, the beds were comfortable and a great view. Parking might be tight in high peak season, but I would stay here again.", "title": "Great Place", "user": "kareybarey", "date": "September 25, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 44535322}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "My husband, myself, in-laws and friends go to the Warrensburg Flea Market every year. We've even stayed there a few times in July for mini vacations. We have stayed at the Tahoe Resort in Lake George for the past 5 years. We love the view of the Lake. The rooms are clean and I've never had one that smelled musty. We found the staff, especially Debbie, to be very nice. She's always willing to accomadate whatever we need, and has been very helpful when we're looking for a place to eat or something to do in the area. She's never given us a bad recommendation. We love our stays there and will continue to stay there for years to come.", "title": "View and Accomodations were awesome", "user": "callyjean", "date": "September 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 43055404}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "I booked this room last minute for one night during Labor Day weekend. The Inn was right on the lake with a small private beach. The rooms were what you expect from a normal non-luxury hotel room. The beds, bathroom and room were overall very clean. I was actually impressed after being skeptical upon reading previous reviews and seeing that it was a 2 star establishment. The faculty was very nice and friendly. They did not hesitate in offering advice as to where to go for breakfast as well as activities.", "title": "No Complaints!!! Right on the Water!!", "user": "Jemlnlx", "date": "September 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 41188404}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Air conditioners filled with dust, musty, insects, marshmallows in bath from previous occupants, dock is in poor shape with dangerous large wood splinters.", "title": "Poor condition, poor response", "user": "copper68", "date": "August 7, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 1.0}, "id": 36970963}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled solo", "text": "This hotel was extremely dirty with hairs in the beds and in the bathroom. The room was not clean at all. When the front desk manager was notified about this, she questioned why 6 hours later was she notified (as if we were making it up). They switched rooms which wasn't much better. Then the following day, the a/c broke and the maintenance guy tried to fix it and said that it needs a new compressor, the room was hot all night long. The hotel wouldn't make restitution and basically said, \"can't help you\". Do yourself a favor and don't believe the positive reviews, its obviously by people who work for the company.", "title": "Pass on this hotel", "user": "Sandman565", "date": "July 29, 2009", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 36174101}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We stayed two nights and will return. Our room was on the courtyard, we had two comfortable beds, microwave, fridge, large bathroom, large picture window, two exit doors, free wireless internet, tv with HBO and a table and two chairs. The staff was courteous and helpful. We could walk to the lake and sit in the chairs the hotel provided. The entire time was relaxing and we felt very comfortable there. The hotel is about 1/2 mile from the main strip which we liked. It was quiet. There is a great restaurant within walking distance, which we ate at 3 times.", "title": "Great time - will return", "user": "helga2522", "date": "July 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36128496}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "It is an older hotel that is clearly being updated seasonally. The rooms reflect exactly that. We had an ugly old air conditioner that worked well, that kind of thing doesn't bother me, some people it may. The beds were clean and quite comfortable. The staff was very nice. One of the girls in the office appeared a little overwhelmed at times training others, but always met our needs. The pool was very clean, heated, I liked it. The beach is cute, kids around, I dont' mind that either. Pretty view of the lake. Nice location, shuttle to downtown across the street. It's not a honeymoon kind of place. There were families with kids, and some younger people with lots of beer, but no problems. Great place if you don't want to spend tons of money. I would stay there again. They were sealing the patios, works goes on while you are there. We had to step around the patios for a bit, of course the sealant smelled, but again, I'm an easy going person. If this sort of thing bothers you, don't go. IF you don't mind, then stay there.", "title": "nice place, relaxing.", "user": "loribaileyrn", "date": "July 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 35930430}, {"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "My husband and I wanted to get away from the day to day stress. My husband saw the beautiful lake pictures and originally booked for 3 days then changed the reservation for a week (6 nites). The day we arrived, the room was unclean and the the rugs not vacuumed. The following morning we were awaken at 8:00 a.m. with hammering sounds coming from beneath us. When we checked out the resort we realized the room beneath us was being renovated. The next day we were awaken again at 8:00 a.m. with powerwashing and yelling back and forth by the workers. This time we realized that not only was the room underneath us being renovated but the two rooms besides it was also under construction. We tried taking in some sun in the pool area but quickly returned to our room because one of the workers was grinding the walls by the pool area and the dust was blowing in our direction. All this to say the description on the internet never mentioned the resort was under construction. If this was the case, it should be stated so guest can choose wisely when planning a relaxation vacation.", "title": "Not a place for couples!!", "user": "seekingvacati0n", "date": "July 22, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 35429599}, {"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Rhode Island", "title": "never again!", "user": "lisacan98", "date": "July 20, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 35207712}, {"rating": 1.0, "title": "Tahoe Wouldn't Honor \"Room Saver\" Coupon", "text": "I just returned from a 3-night stay in Lake George this week (7/26 thru 29). My trip planning included checking reviews on Trip Advisor and using the discount coupons in the \"Room Saver\" publication. I called the Tahoe on 7/24 and told them I would be using the \"Room Saver\" coupon and asked what their availability looked like for the week of 7/25, and the representative told me they had availability on 7/25, 7/26....", "user": "A TripAdvisor user", "date": "July 30, 2010", "id": 72988586}, {"rating": 1.0, "stay_parameters": "Stayed July 2010", "text": "I decided not to go on 7/25 because it was Sunday, even though the Tahoe told me they had availability on Sunday, I figured I would have a better chance of getting a room during the week, so I made the 4 hour drive very early Monday morning. When I arrived at the Tahoe on Monday (7/26) at 9:30 a.m. I was told they were sold out (even though the parking lot looked only half full) and the only room they had available was by the pool at the rate of $169.00, almost double the coupon rate of $89.00! When I told her I called ahead of time and told the rep I was using the \"Room Saver\" coupon and she assured me there would be availability, the desk clerk told me that availability always changes.", "title": "If having a sewage truck and dirty...", "user": "eac2479", "date": "July 17, 2010", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 71243116}, {"rating": 1.0, "title": "dont go there", "text": "I was traveling with my elderly Mom and my 14 year old niece and 9 year old nephew. We walked around the property before I stopped in the office, and the kids were disappointed that the pool was so small, and my Mom was exhausted walking", "user": "slyy1965", "date": "July 13, 2010", "id": 70835671}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "up from the five levels of stairs from the lake, so I guess it was just as well that we didn't stay here. We ended up staying at the Howard Johnson's Tiki Resort and had a nice time, but to be fair, Howard Johnson's didn't want to honor the \"Room Saver\" coupon either, even though I called them on Saturday and was told there were 18 rooms available with double beds and I would get the coupon rate of $89.00. Upon arrival, I was told that there were no rooms available at the coupon rate and I would have to pay $119.00, but I was offered immediate early check-in, and I was allowed to use my AARP discount to get the rate down to $113.00, so we stayed there instead.", "title": "Better than the Reviews", "user": "005Mustang", "date": "July 12, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 70668532}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Read my review of the Howard Johnson's Tiki Resort on their Trip Advisor link.", "title": "Keep looking", "user": "myopionionisnotfact", "date": "July 12, 2010", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 70638071}], "location": {"country": "United States"}, "stars": 2, "variance": {"poor": 13, "average": 17, "very good": 38, "terrible": 40, "excellent": 20}, "aka": "Tahoe Beach Club Hotel", "slim_ranking": 0.69512195122}