{"user_rating": 4.0, "review_count": 285, "name": "Tahoe Lakeshore Lodge and Spa", "reviews": [{"rating": 4.0, "title": "PERFECT FOR A SKI TRIP", "text": "I had the pleasure of staying at this very cozy lodge during a ski trip to Heavenly a few years ago. The place is exactly what most people want when skiing, and at a very affordable price. The rooms are rustic, with that log cabin type feel, but also luxurious with all the ammeneties.. My room had a balcony with an incredible view of lake tahoe. The room was about 400 square feet .. it had a large bathroom, a fireplace and a comfortable king bed. The only negative thing I can say about the room was the shower pressure was awful. The lodge had a outdoor hottub which was surrounded like an igloo with snow... very romantic. The spa was very basic, but had most services that a skiier mike want,with prices far less that what you might pay for a large resort spa. If i remember right, I payed about 130 a night for my room..I recently stayed in a similar lodge in vermont and payed 300 a night...so value at lake tahoe lodge and spa was excellent. No restaurant or bar in the lodge( that i can remember) but many in the area.", "helpfulness": 2, "user": "icem2829", "date": "February 4, 2005", "id": 3161359}, {"rating": 4.0, "title": "“The name says it all”", "text": "Stayed for 2 nights in September. Very concerned when driving up to the front of the hotel as it is dark brown and frankly looks very low standard. But once checked in - WOW! Amazing location – 1 metre from a balcony and 1 more to the beach. It doesn’t get closer than this! Good, clean room. Staff were very pleasant and helpful. The breakfast was severely lacking though – very little to choose from. Beware - thin walls but don’t let this put you off. Take those earplugs!", "helpfulness": 2, "user": "avevers", "date": "November 4, 2004", "id": 2806369}, {"rating": 5.0, "stay_parameters": "Stayed September 2004", "text": "This hotel is very clean and the view of the lake from the room was excellent. Registration and check-out efficiency was flawless. The staff was professional and cordial. They gave us all the information that was asked. I wish that I had an extra day to spend in Lake Tahoe. And I will stay with them again. Great value and easy to access.", "title": "Lakeshore is a Winner!", "helpfulness": 1, "user": "TONEYTUNES", "date": "September 29, 2004", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 2607771}, {"rating": 5.0, "title": "I CAN'T WAIT TO STAY HERE AGAIN!!!", "text": "I've just had the most relaxing, comfortable vacation I've ever had!! The Lakeshore Lodge is not luxurious by any means -- but it is VERY nice and it sure is comfortable! I didn't get a room with any kitchen facilities - didn't need it. The Lodge serves a continental breakfast:coffee,juice,fruit, muffins and danish pastries. There are two places that serve breakfast and lunch and also a pizza/ice cream place between the Lodge and the street. Also, across the street is a good italian restaurant. There is bus service that only charges a dollar a ride, and it will take you to the casinos, shopping, dining, anywhere you want to go along the lake in south lake tahoe. The beach is great, although the previous writer is right about the goose poop -- you have to watch! The beach is private but you're not limited to it for long walks. I walked at least a mile along the shore. There is a marina next door where you can rent boats, kayaks, water toys for kids, jet skiis, and arrange to go parasailing. I just sat on the beach (chairs and loungers are provided) and watched the boats, people parasailing, a hot air balloon that takes off and lands on a boat on the lake, the ducks,geese,and seagulls fly and swim around, and of course the beautiful views!! The lake with the mountains in the background is a wonderful sight! The sunsets are fantastic!!!", "helpfulness": 5, "user": "A TripAdvisor user", "date": "September 21, 2004", "id": 2590615}, {"rating": 4.0, "title": "Nice view/room, some small issues...", "text": "The rooms are really very nice. They all have a fireplace - mine was gas. I did use it when I got up early in the morning. There is a coffee pot in all the rooms. And of course a tv. The front desk has safety deposit boxes available. Each room has a patio or balcony. My room didn't have a tub - just a walk in shower but that was okay with me. If someone really wants a tub, they should ask about it when they book the room. I'm hoping to visit Lake Tahoe again in the next couple of years and I'm definitely going to stay here again. The place itself is more than nice enough, the location is great -- casinos and shopping are a very short bus ride or drive away, and being right on the lake is, to me, a real LUXORY!", "helpfulness": 4, "user": "lisaq42", "date": "August 30, 2004", "id": 2502339}, {"rating": 1.0, "title": "Don't waste your money", "text": "Please don't waste your hard earned money at this glorified motel that does not live up to the description on their web site. They have \"terrible\" customer service, outdated rooms, and a pool that was not heated. My family and I used to stay at this hotel in the 1970s. At the time it was really nice and the customer service was great. Owner has changed. I made reservations for 5 rooms for one week stay with the supervisor 5 months ago and requested for only one of the rooms to be a specific room which my mom really wanted to stay in. At the time they told me my chances was good but they can't guarantee it. I called the supervisor 2 days before departing to make sure everything was in place and she tells me the specific room we wanted was taken and that she can't do anything about it. I asked for my mom to be moved when the guests depart which was 2 days after we arrive and she said she can't guarantee it. When I argued she cancelled my reservations. When I got mad the manger called me and told me not to step foot on the hotel grounds or else she will call the police. I had to have my cousin call and get all the rooms back under her name because every place else was sold out unfortunatly and we really wanted to visit tahoe. Do yourself a favor and stay somewhere else where people will appreciate your business. There are alot of nice hotels on the south and north side of the lake for the same price.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "August 2, 2004", "id": 2362202}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 16, "average": 33, "very good": 86, "terrible": 11, "excellent": 139}, "aka": "Tahoe Lakeshore Hotel South Lake Tahoe", "slim_ranking": 0.159420289855, "description": "Tahoe Lakeshore Lodge & Spa, South Shore’s only all lakefront property, offering hotel and condominium lodging all with an incredible lake view and cozy fireplace. Pamper yourself in our full service day spa or relax by our heated pool and hot tub. Centrally located to area activities, restaurants, casinos and sitting on 500 feet of private beach, you’ll receive a true Tahoe experience."}