{"user_rating": 3.5, "review_count": 396, "name": "Taino Beach Resort & Clubs", "reviews": [{"rating": 5.0, "title": "awsome", "text": "i just want to let all you people out there know that of all the places i have ever been this was by far the best hotel i have ever been to. i have been there a coulpe of times and i wouldnt stay anywhere else except there. the staff is so friendly and they are like family to me when i am there. if you ever get the chance to go make sure you ask for tamica she is such a big help and also when you take the ferry ask for derek he will give you a good ride. i feel like i left all my friends behind but i know i will be back to see all of them again and to stay at the beautiful ritz coral 2 hotel. there's no need to go anywhere else once you have been here", "user": "A TripAdvisor user", "date": "March 9, 2005", "id": 3262280}, {"rating": 4.0, "title": "The Ritz was great!", "text": "Where can I start....May vaction was in May 2004. I read many negative reviews about the Ritz/ Taino after my travel arrangements had been finalized. I need not tell you I was \"Very Nervous\" regarding our stay...to my suprise it was much better than anticipated. I also received information from a young lady who had already stayed at the Ritz/Taino which eased my nerves! :-) The room was much better than the negative reviews stated. We had a 2br/2bth which was nice and clean. We did our own sanitizing/cleaning \"touch-up\" upon arrival as well. The staff was VERY nice to us....couldn't understand the guests who claimed to be mistreated at the resort. They were so hospitable that in fact we made a few friends while on vacation. However, we did meet a few \"outside of the resort\" that weren't nice, but hey, you get that in your home town so it was nothing new you just have to overlook people that give you tude and go on with life! :-) Overall the locals were nice to us. :)) We had our room cleaned on a daily basis along with an over abundance of towels. We were very appreciative of the tips on bringing food/snacks/soda from home due to the costs of these items being triple what we'd pay and they were! We had a great time at the Ritz/Taino. The resort is nice in itself. The pool is nice, the atmosphere is as well. There is a deck at the entrance of the beach where you could eat, play cards/games, socialize or just gaze at the stars in they evening hours if not in your room. If you want time for relaxing and do not require 5 star amenities this is the place for you. The beach was reaaly nice. Not crowded at all..it's more like a private beach... beautiful warm water! In the evening this would be a good place for meditation....it's sooooooooo peaceful! If you want action in would be best to stay on the Lucaya side of the Island where all of the action is!! A bit of both... I guess you can figure this would be the place to stay that is if you don't require 5 star accommodations. I usually vacation in Hawaii yearly, I found a great deal on Cheap Caribbean, so, I decided why not take a chance on the Bahamas! I didn't get a chance to fully tour the Island in May...this means I MUST return! I am looking foraward to visiting the Grand Bahama Island soon and will stay at the Ritz/Taino Resort!! :-)))", "user": "A TripAdvisor user", "date": "February 22, 2005", "id": 3220245}, {"rating": 5.0, "title": "8-22 Jan05 Fabulous Holiday", "text": "8-22 Jan05 Fabulous Holiday", "user": "Ibbo312", "date": "January 25, 2005", "id": 3085096}, {"rating": 1.0, "title": "Fraud charges and still awaiting reimbursement for $3,198.00….", "text": "Enough has been said about the unique style of the rooms at this resort. All I can add was that the place is newly decorated following the storms and was clean and tidy (not a roach in sight). The staff were exceptionally friendly. Towels, soap, shampoo, conditioner etc were provided every day. Washing up liquid and dishwasher powder available if you ask. Pool was clean. 2 for 1 ($7ish) priced frozen cocktail drinks during happy hour 3-5pm pool bar and 6-8pm main bar. Activities arranged if you wish to join in.", "user": "A TripAdvisor user", "date": "October 14, 2004", "id": 2703452}, {"rating": 4.0, "title": "Not bad", "text": "Work was ongoing on renovation although we were never troubled by noise. On our second week however, people used the adjoining room and we could hear them when they were talking loudly.", "user": "part_time_beach_bum", "date": "September 10, 2004", "id": 2522216}, {"rating": 4.0, "title": "Just back from the Ritz", "text": "Hi", "user": "A TripAdvisor user", "date": "July 19, 2004", "id": 2307857}, {"rating": 4.0, "title": "Worked for us!!", "text": "My husband and I just returned from the Ritz and had a great time. We were there from July 10, 2004- July 17, 2004 and would go back again. I was very worried after reading the reviews, but our stay was marvelous. We rented a car ( air conditioned) from Brad's rentals and would do it again in a heartbeat. Rental car is the way to go. We brought an additional suitcase with food staples and washing detergent and bought the rest of the perishables at the Winn Dixie. Food is high, so bring snacks, dishwashing detergent ( yes there is a dishwasher in the unit)and other necessities. Not a problem with toilet paper-but towels leave in the morning and return clean later in the day. Most of the time, we went to housekeeping for ours, easier and we got to hoard a set for nights when we went into the pool. The people at the Ritz were great and being nice to everyone at the beginning got us a great room. The key to getting good service is being nice.", "user": "vicdreyer", "date": "July 19, 2004", "id": 2307394}, {"rating": 4.0, "title": "Wonderful Destination", "text": "Some things to be aware of:", "user": "A TripAdvisor user", "date": "July 8, 2004", "id": 2283011}, {"rating": 1.0, "title": "Travelers Beware of the Ritz", "text": "There is no sign telling you where the Ritz is, so look to the left of the Bell Channel condos and follow the road nearest the fence. They are starting again to construct the new reception center, but they never start too early.", "user": "joeymick", "date": "June 30, 2004", "id": 2231074}, {"rating": 4.0, "title": "Never Sadder!", "text": "Snorkeling at Paradise Cove costs $3.00 per person for beach access and extra for rental of snorkeling equipment. We brought our own and snorkeled for four days out of our six there. Best snorkeling is at high tide. Great people everywhere and once when we were accosted by a panhandler at the International Bazaar, a local couple driving by told him to leave us alone.", "user": "A TripAdvisor user", "date": "June 20, 2004", "id": 2207674}, {"rating": 4.0, "title": "Good News for the Optimistic", "text": "After reading all of the reviews, I too was a little doubtful about our upcoming trip. We were there from July 24th -July 29th. The best thing is that our costs were minimal. Our friends who own with RCI gifted us a week. That meant that our room including utility fees was approximately $60/night. Not bad at all for a Resort with a spa tub, kitchenette, and beautiful marble tile. We were on the 4th floor (penthouse) with a nice view. I came prepared with all of my RCI paperwork for the staff and it seemed to make them happy that at least we tried to follow instructions. We were nice to the staff and they were nice to us.", "user": "A TripAdvisor user", "date": "September 2, 2004", "id": 2508454}, {"rating": 3.0, "title": "Not the Honeymoon of my dreams.....", "text": "Our room was extremely clean. The kitchenette was well stocked with appliances, dishes, pots, glasses, and silverware. Everything worked including the telephone, air conditioning, tv/vcr, jacuzzi tub, etc.", "user": "A TripAdvisor user", "date": "August 22, 2004", "id": 2482390}, {"rating": 3.0, "title": "Resort is hanging in there...", "text": "Housekeeping was very timely. We received towels daily. The first 2 days...I had to request towels. After that, the towels came regularly. Since, we did quite a bit of cooking, housekeeping washed our dishes daily. : ) I loved that. We tried to be extremely nice by expressing our appreciation each time they came. We left a nice tip on our last night at the resort.", "user": "A TripAdvisor user", "date": "August 9, 2004", "id": 2432313}, {"rating": 2.0, "title": "Read posts carefully before going", "text": "Things I didn't know: pre-paid calling cards are not allowed. Don't even bring one. Calling rates back to the states are ridiculous.", "user": "A TripAdvisor user", "date": "August 7, 2004", "id": 2428232}, {"rating": 2.0, "title": "The Good The Bad And The Ugly", "text": "Don't expect a 5 star hotel. It's not one. The beach is beautiful. The pool was gorgeous. The ferry for $25/per person per week was excellent.", "user": "Kathi F", "date": "July 19, 2004", "id": 2308827}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "We went from April 23-30 (5 of us) booked via CheapCarribean for $4999 this included air & hotel! That was my mantra Hey for $499 it sure beats Central Pennsylvania!", "title": "Good Times for The Money", "helpfulness": 34, "user": "Lizzay", "date": "May 6, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 3.0}, "id": 3446025}, {"rating": 4.0, "title": "its a beach resort not the Trump Towers", "text": "I too read all the reviews and was a bit nervous about the property! Don't Be it was actually very nice and I'm a bit of a hotel snob. Keep in mind this is the islands and nobody moves really fast and it can be frustrating at times.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "April 11, 2005", "id": 3349673}, {"rating": 3.0, "title": "Enjoyed our time", "text": "The Resort - When you first arrive your going to think its sketchy. Check-in wasn't until four but they gave us discount coupons for the restaraunt and drinks were free. We only got hit once for timeshare sales, if you tell them your not interested they will leave you alone. The grounds are well kept and very nice. There is a large covered deck thats nice to sit on at night or during the day for some share. Remember they got hit hard during those hurricanes and are still fixing things up.", "helpfulness": 30, "user": "A TripAdvisor user", "date": "April 5, 2005", "id": 3334946}, {"rating": 1.0, "title": "This place sucks!", "text": "Beach - As stated the beach is darn near private (there is no shade and no place to rent an umbrella). There are water activities right there to rent. Endless chairs so no getting up at 7am to get a spot needed. Also water very calm so kids won't get beat by the waves.", "helpfulness": 19, "user": "A TripAdvisor user", "date": "March 28, 2005", "id": 3307480}, {"rating": 4.0, "title": "What Can I Say? Read My Review.", "text": "Pool - Big Huge Circular pool with a large shallow section for kids and a more private side for the big kids. Innner tubes and floaties to use and a fun slide. Pool bar bit expensive but its the islands what do you expect. Buy your own bottle and sippy cup and your set!", "helpfulness": 68, "user": "A TripAdvisor user", "date": "March 22, 2005", "id": 3294406}], "location": {}, "stars": 3.5, "variance": {"poor": 53, "average": 77, "very good": 140, "terrible": 55, "excellent": 71}, "aka": "Taino Beach Resort & Clubs Hotel Freeport", "slim_ranking": 0.0833333333333, "detail_rating": {"service": 3.0, "cleanliness": 3.5, "value": 3.0, "sleep": 3.0, "rooms": 3.5, "location": 4.0}, "description": "Our exclusive Taino Beach Resort & Club offers owners all the comforts of home, but far, far away from any worries of home. With full kitchens, master bedrooms, and spacious patios, the whole family can enjoy their vacation. Views of the beach and pool. Ferry service to Port Lucaya."}