{"user_rating": 4.5, "review_count": 211, "name": "Taj Falaknuma Palace", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "We've visited this palace for a group dinner - truly spectacular palace with a great view over the city, magnificent garden and British interior (guided tours). Both the environment and food were of the top quality. Downsides:", "title": "Spectacular fine dining, restaurant separated by cuisine though", "user": "janpopovic", "date": "January 18, 2013", "detail_rating": {"value": 3.0, "service": 4.0}, "id": 149962633}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "- The italian and indian restaurants--despite located literally next to each other and run by the same personnel--operate separately and it is not possible to get an italian menu in the indian part of the restaurant. This wasn't communicated to us and caused a very unpleasant outcome of having to separate the team into two based on the menu individuals have ordered prior to the visit (luckily we had an almost even split).", "title": "simply out of the world", "user": "Arnav20052004", "date": "January 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 149960014}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "- No mobile credit card terminals, I had to walk to the back-office as I paid with a chip-and-pin card.", "title": "Stunning breathtaking experience", "user": "Garbanzobean", "date": "January 18, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 149940482}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We spent a couple of days recently at Taj Falaknuma. Perched on top of a hill, the hotel provides for a great view of the historic city of hyderabad. The welcom carriage ride gives you a sense of royalty. staff is super courteous, food is awesome and the evening qawealli performance is a true gem. The hotel is tad expensive but is worth every penny...the rooms are not too spacious but the large bathrooms and bath tubs make up for it. so close your eyes and make it to this palace asap. this is one trip that you will not regret....this is easily the top 5 hotels in this part of the world.", "title": "One of those places...You will never forget.", "user": "JPMcCusker10011", "date": "January 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149838882}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "anand", "title": "Beautiful hotel - spoiled by bad checking out experience", "user": "Marsha123", "date": "January 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149078311}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "This hotel/palace experience is just amazing. From the time one steps on to property at the entrance of the Castle, one is treated like royalty. We stayed in the palace for 4 nights in early December 2012 and totally enjoyed every minute. The staff were discreet but always available to every whim of ours and as one would expect for this class of hotel, they went the extra steps to find out about our tastes and demands.", "title": "Amazing experience", "user": "asibia", "date": "January 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150280217}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Lots of honeymoon couples come to spend just a night in the hotel and hardly get the full joy of staying in this place. Hence, the jazz bar with it's live singer is hardly appreciated.", "title": "A Historic vacation", "user": "mdeshmuk", "date": "January 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150269842}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "We stayed at the Falakmuma Palace in early January, 2013 and had a spectactular two night-three day visit. As a historian by profession, I was enchanted with the palace's history (there were daily tours), and as we left, the staff regaled us with stories of the Nizams' family history and showed us the coronation room, now under restoration. The grounds, the rooms the facilities were excellent. One has a 360 view of Hyderabad from the palace's mountainous perch and lights sparkle at night. The food was fabulous--the bakery deserves special mention.. The service could not be better. All in all (and we have stayed at most Taj heritage hotels over the years), we had a wonderul, memorable time and would, despite its steep tab, highly recommend it. Plus, there is much to see and experience in Hyderabad, which does not receive the number of tourists (especially from abroad) that more popular venues, such as Rajastan or Kerala do.", "title": "Live like royalty with the entire Hyderabad at your feet..", "user": "NikhilMohta", "date": "January 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 150233845}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "The Palace is very grand and has been maintained impeccably. That a lot of the original construction has been preserved as-is, was quite a revelation. The place shows the rich taste of the Nizam for whom the Palace was built.", "title": "Five stars not enough", "user": "Josi S", "date": "January 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150143372}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "One gets a taste of royalty right from the start. Outside vehicles are not allowed inside the walls of the Palace and one needs to board a horse-chariot to get to the main Palace. The Palace tour gives you a good perspective of the history.", "title": "Something's Missing", "user": "Hhandker", "date": "January 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 150022912}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We stayed there 3 nights. We have been living in India and travelling lots in India, staying lots at Taj. This hotel breakfast was one of the best breakfast I had in Taj. I loved pastry, croissant etc. It was really good standard. The room and the hotel was beautiful and love surrunding.", "title": "Great Hotel", "user": "churachura", "date": "February 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 151152042}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Only the negative was staff. They were quite slow and not very efficient, but it did not bother me too much, as the hotel was really great.", "title": "Amazing hotel with a view to kill in the heart of Hyderabad yet far away from the crowd", "helpfulness": 1, "user": "golujain", "date": "January 31, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 151067604}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "This TAJ property - the former residence of the Nizam of Hyderabad, is one of the finest luxurious hotels in India, with the ambiance, decor, location, heritage and a view to kill. It is 2000 feet above Hyderabad. The grand chandeliers, rare furniture, grand marble staircases, fountains, gardens, priceless statues and stained-glass windows are worth seeing. The Palace Library, a replica of the one at Windsor Castle. They have 2 restaurants one serving sumptuous Indian cuisines and the other Mediterranean.", "title": "A New Year's to remember", "user": "Edward068", "date": "January 28, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150851710}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "We decided to spend 3 days, including New Year’s eve, at the Falaknuma Palace when in Hyderabad to visit friends. Overall we were very pleased with our stay. The carriage ride from the security stop to the hotel was very nice. The hotel staff greeting was warm and check-in was painless. Our room, a Suite on the second floor was spacious, impeccably decorated and well equipped. A warm bath with rose petals was waiting for us when we arrived. Little touches like both terry and cotton bathrobes were a very nice touch. The property is beautiful and grounds are perfectly maintained. The spa is exceptional. The gift shop is very, very nice. The big disappointment was service and food quality. Having staying in several of the Taj Palace properties (Taj Mahal Mumbai, Lake Palace, Rambaugh) we had an expectation of the quality of facilities and service we would find at Falaknuma – sadly, we were disappointed. The food quality, while very nice, was not the exceptional standard of other properties. The table service was very friendly but not efficient for example, from when we ordered it took 10 – 15 mins for morning coffee to arrive at breakfast; one night our cocktail order took 20 mins. the next night 30 mins. this was accompanied with apologies and explanations that the delay was because the type of vodka we had requested was located in a different bar. I should note that in each case it was not sufficiently busy to account for the service. In every case the staff was very pleasant but it left us wondering whether it would be better to strike a balance between courteous/helpful staff and efficient service. Finally, the communications for the New Year’s Eve festivities (which were great fun) was very poor. No one we spoke to was clear about what time it would start and whether seating was reserved or not and therefore what time we should plan to arrive to ensure a nice table. As it turned our tables had been reserved in advance, ours was lovely and the evening was great fun. The next evening, a price fixe dinner was being served on the outside dining area – we could not find out any information about it in advance. Finally, unlike every other Taj property, we were not asked to provide feedback on our experience – very odd.", "title": "Wonderful royal stay at Nizam's palace 'taj falaknuma'", "helpfulness": 1, "user": "puneet_Sharnameye", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150320129}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "i stayed with a friend on 17th jan 2013 ..It was an amazing place to be...the welcome was unique and interesting you are taken to the palace on a horse carriage and the shower of rose petals on arrival is very special...you are treated like royalty. Rooms are very nice ,food and service is extraordinary...A must for every tourist who come to hyderabad ...", "title": "Perfect Anniversary stay!", "user": "archmv", "date": "January 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150306355}, {"rating": 4.0, "title": "Lovely experience at the palace", "text": "We stay for two nights after arriving late from mumbai , we were enchanted with the wellcoming at the palace , the staff very courteus and friendly , the food at the Indian rest very well presented and very good , they could improved more we ordered some wine and they did not have all the selection they offered, but they day of our departured our flight was canceled until late afternoon and they let us stay until 4 oclock in the rooms , when you traveled to the south you need to be patience not everything is like Rajasthan but they tried they best to make you feel confortable and happy", "user": "Bellis60", "date": "January 7, 2013", "id": 149040665}, {"rating": 3.0, "stay_parameters": "Stayed December 2012", "text": "I went to enjoy this hotel for an evening out to see the palace, enjoy the tour and drinks on the terrace followed by dinner.", "title": "Disappointing service for stunning surroundings.", "user": "OO1HK", "date": "January 4, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 148850189}, {"rating": 2.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "The palace is spectacular. The tour hopeless. The guide's voice didn't project well hence we couldn't hear her plus her information was thin. We walked away having learnt very little.", "title": "Deeply Disappointing", "helpfulness": 3, "user": "M R", "date": "January 3, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 148699430}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We then went to the beautiful terrace for a drink. I had to find a member of staff to give us wine menus. Not a good start! The order took forever. Not the level of service I would expect from such a hotel.", "title": "Great Setting ! Memorable place ! but...", "user": "Srikanth_B1201", "date": "December 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 148368506}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Once we were seated in the restaurant we were fortunately looked after by a very competent waitress. The food was ok but I have eaten better Italian food at other restaurants in Hyderabad.", "title": "Magical place that words are not enough to describe it", "user": "Prncss03", "date": "December 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148126835}], "location": {"country": "India", "continent": "Asia", "city": "Hyderabad"}, "stars": 5, "variance": {"poor": 3, "average": 11, "very good": 21, "terrible": 1, "excellent": 175}, "aka": "Taj Falaknuma Palace Hotel", "slim_ranking": 0.00377358490566}