{"user_rating": 5.0, "review_count": 1138, "name": "Taj Lake Palace Udaipur", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Everyone we spoke to said that you must stay at the Lake Palace on a first trip to Udaipur. The setting of the hotel in the middle of Lake Pichola is quite dramatic even though the water level is lower than the norm. We were upgraded to a very attractive suite but I must point out that the upgrade occurred only after an emphatic protest over the size of the standard room. In fact, I would not recommend staying here unless you are guaranteed a suite. The staff was extremely friendly and helpful and we very much enjoyed dining at the rooftop restaurant (although some variation in the menu from day-to-day would have been desirable). Breakfast was a very elaborate spread and the waffles were especially delicious. The pool was a bit small but quite attractive and very well-staffed. Udaipur is certainly a must-stop on a first trip to Northern India.", "title": "Unique Experience", "user": "DCRE", "date": "April 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 60098050}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We decided to splurge on this hotel as the grand finale of our trip to India. And what a grand finale it was ! From the moment they welcome you to the moment you leave, the white-glove service at the Taj Lake Palace is a rare treat in this day and age.", "title": "Unforgettable Experience", "helpfulness": 1, "user": "neimanmarxist", "date": "April 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 60091673}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The scenery from the lake palace is beautiful but the palace itself is quite a sight; beautiful marble inlay decorates every inch of the lobby and the pool area, bowls of flowers and fragrant candles scent the air, and (as mentioned before) whether you're ordering drinks by the pool, breakfast in the morning, or a fresh robe , the service is impeccable. Every detail is looked after- premium toiletries, soft bedding, careful turn-down service, expedient laundry ,check-in to your flight. The bathroom scale had a doily on it. That's how much care is taken to make everything beautiful. Impressive indeed.", "title": "It brings you back in history", "user": "Lialis", "date": "March 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 59820150}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "A nice thing to do while there is to book the pontoon boat dinner, which is also an extraordinary experience. There are a number of activities you can pursue in addition- there's a dance performance each night which I found surprisingly good, a boat ride around the palace at sunset, and (for a fee) a \"heritage tour\" of the palace that ends with a glass of sparkling wine.", "title": "Fairytale Palace on a Lake", "user": "AucklandGetaway", "date": "March 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59454779}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled solo", "text": "I highly recommend this, especially as a romantic weekend indulgence with a spouse/partner.", "title": "where Maharaja walked....", "user": "adrian37", "date": "March 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59213290}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "actually i stayed there in 2004 but the date of stay did not have that criteria.", "title": "the most amazing hotel what a relief", "user": "opmy", "date": "February 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55053345}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "it was a haven in an amazing country. the service was gorgeous the rooms were amazing. i was roughing it with friends till i put my foot down (and my money) it was so worth it. The staff of the hotel were friendly and when they found out that i had roughed it they changed my room to ultra luxury without a charge. it was a big birthday and they made sure i never forgot it. The food was great. the people were great and i plan to have my wedding there if i ever get married, if not i will just come whenever I can. if you want heaven on earth this is it. Although ultra luxurious it was not snobby not one false move. loved loved it and all the people there. So Thank you.", "title": "The best service we've ever experienced.", "user": "Wandering_Tine", "date": "February 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 54973851}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "We arrived in Udaipur from Delhi after a 12 hour delay at Delhi International Airport -- tired, frustrated, and overall a bit worse for the wear. I think we had to email the hotel staff about four times during the day to inform them of the status of our flight, so that they could arrange pickup from the airport (40 minutes away) when (if) we finally arrived. Due the delays, we missed one entire day of the two we had scheduled in Udaipur.", "title": "love the whole enviorment", "user": "mayanklovesu", "date": "January 31, 2010", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 4.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 54803784, "likes": {"liked": "— the whole interrior of the hotel", "disliked": "— river view"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "The reception process was wrinkle-free, from refreshing towels at the boat landing, to whisking off our luggage, to getting us into our room immediately and handling all the check-in formalities there. Ok, so we could have done without the shower of rose petals and red smudges on our foreheads (we were TIRED!), but the concierge had heard of our airport delays and treated us to an upgrade to the Virkha Suite -- a very welcome surprise.", "title": "Perfection!", "user": "SuefromSA", "date": "January 29, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54643001}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We headed for the bar almost immediately (believe me, we needed a drink!). Sat outside on the terrace, which we had all to ourselves. At some points during the stay it seemed as if we had the entire palace to ourselves, it was so quiet and spacious. I asked for a glass of bubbles and was given two to try (both Indian -- Marquise de Pompadour and Sula -- and both good, although I liked the former slightly better). The general practice when one orders wine is for the staff to bring out a bottle of what was ordered plus two others (in the same general category) and offer a taste of all of them. At first we thought it rather unnecessary, knowing what we like and what we don't like, and of course we assumed they were trying to sell us a higher priced glass, but in fact that wasn't the case. So nearly every time we ordered a glass of wine, the two of us got to taste six. Very nice touch.", "title": "Good ambience ,Cool atmosphere and great interiors", "user": "jay_katari", "date": "January 25, 2010", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 54336377, "likes": {"liked": "— Clealiness"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "Udaipur is the city of lakes and one of the most romantic places in the world. The Taj Lake Palace is pure romanticism. After a short crossing of the lake by boat is greeted like a Maharajah, under a cascade of rose petals.", "title": "Pure romanticism", "user": "Tigrotto70", "date": "March 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59138243}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "The room, treated in detail, with a magnificent view over the City Palace. Excellent cleanliness and customer care in different spaces: garden, swimming pool, library, bar and restaurants.", "title": "A Royal Living Experience", "user": "RABINDERMumbai", "date": "March 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 58879872}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Excellent breakfast, with Western and Indian specialties, and service to restaurants every wish is fulfilled.", "title": "Perfect Honeymoon Splurge", "user": "2Bobs", "date": "March 4, 2010", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "location": 5.0, "rooms": 5.0}, "id": 57753824, "likes": {"liked": "— Hotel itself, location, service"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The hotel has a SPA with various possibilities in the treatment, staff very polite.", "title": "Magical experience", "helpfulness": 1, "user": "MumbaikerMike", "date": "March 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57689913}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "At dusk you can take a boat trip to admire the sunset.", "title": "Where else might you find a swing in your room?", "user": "David N", "date": "March 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57650067}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "We spent 3 days at the Lake Palace and what can I say? It was really one of the most amazing experiences ever. From the moment we arrived we were treated like the Maharanas of Mewar. Everything from the airport transfer to the puppet dancing whilst waiting at the dock for the boat to take us to the hotel to being showered with rose petals upon arrival were amazing. The check in was swift and the staff were excellent. I would def recommend going on the sunset boat ride that takes you to the Jag Mandir Palace and around the lake.", "title": "Utterly utterly divine!", "user": "Mini_Meena", "date": "March 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57618109}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Also dinner on the roof top restaurant Bhiro was a lovely experience. It was quite chilly and we were warmed by charcoal fires at each table. Food was delicious and service good. Breakfast was ok- not that huge a choice at the buffet but a nice a la carte selection and the omlette with feta and peppers and olives was divine.", "title": "A thing of beauty is a joy forever !!", "helpfulness": 1, "user": "RishiKhanna", "date": "February 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56760385}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The rooms are very comfortable and the pool area nice unfortunately didn't get to try the spa. It was nice to spend our time wondering around the hotel appreciating the beautiful palace and decorations and everywhere there are little touches to make your stay even more memorable from the flute player in the morning, the shadow dancer in the courtyard in the evening to the wonderful flower arrangements. The staff went out of their way to make us feel comfortable and like nothing was too much trouble for them.", "title": "Treated like royalty, not just as guests.", "helpfulness": 1, "user": "TravelGnome2010", "date": "February 19, 2010", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 56543871, "likes": {"liked": "— Everything from the unforgettable views to attention to detail!", "disliked": "— Having to leave :("}}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We actually felt quite sad to leave when our stay was over. The whole experience is magical and I think the Lake Palace Hotel is outstanding and one of the best ways to get a little taste of the Maharaja lifestyle if only for a few wonderful days!", "title": "Perfect and expensive hotel", "user": "esbenthorup", "date": "February 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55377139}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The verdict is out. Lake palace (taj) has my vote over udaivilas !! It was a close contest. We just spent 2 nights at the lake palace and enjoyed it thoroughly. Divya and I were there with our dear friends Dhruv and Shagun, as it was shagun's birthday. A few years ago we stayed at udaivilas and loved it. When there, we saw the lake palace from a distance, floating in the lake. Somehow it never appeared that attractive to me. Probably because I hate run down rajasthani palaces and from a distance I assumed that this was another one. Far from it. Its a hotel with tremendous character. Beautifully maintained. The old world charm is retained while the present day luxuries have been seamlessly integrated. A perfect blend. The palace grows on you. The arrival at the palace was nothing very special. The \"barge\" where the boat docks is ordinary. The reception area also ordinary. But somehow the place grows on you. For me it started with the welcome drink – a delicious mocktail of orange juice, cardamom and crushed almonds !! Understated, yet palacial. Hard to describe but magical. Of course it is endowed with an unbeatable location which others could never and will never be able to emulate. Because of the 360 degree water vistas that one gets to glance at every now and then, one feels sometimes as though this is a large luxury cruiseliner. The food is fantastic. Unlike udaivilas which has just one restaurant serving decent food, here there are 3 , all excellent. We didn't eat at the indian one, but had breakfast and a few other meals at the Jharokha coffee shop which were excellent. Loved the \"palace burger\" and “chicken ceasar”. The \"bhairo\" - fine dining restaurant is just amazing. it was shagun's birthday eve that we spent at \"bhairo\". It was like \"orient express\" at the taj palace in delhi. Only out doors, and overlooking the lake and the beautifully lit city palace. Undescribably beautiful view. Very romantic. Food was excellent too. I started with foie gras and had an excellent lamb shank with a risotto on the side. We also spent a lot of time at the bar which is really nice and open all day.(nice whiskey selection and great great mocha frappe) The spa was \"so so\" but the treatment was good.", "title": "Heavenly Honeymoon", "user": "Vermas", "date": "February 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55220253}], "location": {"country": "India", "region": "Rajasthan", "continent": "Asia", "city": "Udaipur"}, "stars": 5, "variance": {"poor": 13, "average": 18, "very good": 72, "terrible": 8, "excellent": 1027}, "aka": "Taj Lake Palace Udaipur Hotel Udaipur", "slim_ranking": 0.00917431192661, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.5, "location": 5.0}, "description": "The ethereal Taj Lake Palace affords guests the pleasures of India’s bygone princely era. Over the centuries, it has played host to royalty, poets and writers and the Maharaja’s guests. Trappings like a welcoming vintage car ride into the city, a spa boat, royal butlers, royal Marwari cuisine and more turn this former pleasure palace into a luxury hotel that gives guests the chance to live like a Maharaja."}