{"user_rating": 4.0, "review_count": 821, "name": "Taj Boston", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "I have stayed here a few times in the past 5 years. It has only gotten better. This is a first rate hotel by any standard. The staff is perhaps, the best hotel staff you will find anywhere. Very professional, courteous, friendly and helpful. I love this hotel!", "title": "Wonderful hotel, perfect location, superb staff...simply one of the best!", "user": "justwarren", "date": "March 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101058484}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "This last stay, I had a slight problem, I misplaced a shoe bag in my hotel room. It was a very silly thing. It may have very well been my fault. I just couldn't find it and neither could housekeeping. Initially, they thought they might have thrown it away by mistake, they were quite apologetic. When I left, I called security at the hotel. The shoe bag, while having almost no commercial value was a very well made, old cloth felt bag passed down to me from my father. The security person treated this as if it was an heirloom diamond ring. After an exhaustive search of the room and \"key records\" to make sure it wasn't stolen, they found my shoe bag after they re-searched the room for the um-teenth time. This only happens at a hotel where the staff really take pride in their jobs. I travel a lot for business. By and large, I find it's not much fun. But This is one of my favorite all time hotels. You can relax here, and it's a perfect jumping off point to see and enjoy Boston. Whoever runs this place should give lessons on how to run a hotel right!", "title": "Loved the fireplace", "user": "Cliff0rd", "date": "March 10, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99675889}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "Took advantage of a weekend special featuring the fireplace suites, supposedly the only wood-burning ones in a Boston hotel. The suite was great, although the furniture was rather oddly arranged (which we corrected). Service was outstanding; the fireplace butler arrived quickly with our choice of wood when summoned. When we had trouble connecting the DVD player to the TV, we requested help and a very capable maintenance person arrived within 10 minutes to take care of it. Although the place is not cheap, the bar offered some pretty decent food values.", "title": "International Old World Flavor with More Comforts than Home!", "user": "pdhmaine", "date": "March 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99170672}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "Only complaint was that the room charge on the bill was higher than what was on the check-in card, and it took the desk clerk several tries to fix it upon checkout.", "title": "Great Hotel", "helpfulness": 1, "user": "ruchiekaur", "date": "March 4, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 98908724}, {"rating": 5.0, "title": "The Taj is amazing", "text": "My husband is attending a conference, but we didn't call for reservations in time, so I looked around for accommodations nearby. After reading lots of reviews online, I decided the Taj would best meet our needs. In reality, our expectations have been far exceeded.", "user": "spudsr", "date": "January 25, 2011", "id": 94389761}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "This is a top end city hotel. Well located and furnished, it's respectable, comfortable, and classy. So with high expectations come pickiness... but don't let the list of negatives put you off - it's a good hotel. The location is great if you need to be at that end of town, and it's a classic and well renovated building.", "title": "Very good city hotel, some minor niggles", "helpfulness": 1, "user": "hoboesque", "date": "January 19, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 93788371}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "I checked in just before midnight. There was nobody at the door, in the reception area, or at the reception desk. I had to call the house phone to find a receptionist. They came immediately and were polite and pleasant, but it was the first time I've walked into a five star hotel to an absent welcome. Ever.", "title": "Good as gold.", "user": "04phuqsake", "date": "January 9, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 92260113}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled solo", "text": "The room was large and comfortable. It looked over an interior courtyard, but having booked a cheap rate I had no complaint. The room was all you'd expect - good bed, long bath, good toiletries, sufficient working space. I'd have liked an ipod plug-in (there was a CD player), and bath salts for the bath would have been a nice touch. Nevertheless this was a classic five-star room. I slept well (overslept, in fact, which I hardly ever do!).", "title": "Be careful with the telephone charges", "user": "MC98000", "date": "December 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90592873}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "Internet, which was fast and easy to connect to, was predictably expensive (and annoyingly your login works only for one device - you pay double if you want to use your smartphone, which is egregious).", "title": "fantastic location, service excellent, if not a bit pricey", "user": "betDublin", "date": "December 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89998897}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled solo", "text": "The workout room was clearly a converted accommodation suite. It had a good range of aerobic machines, good free weights, some resistance machines... all ok. The floor was carpeted, which always feels inappropriate in a gym (I'm sure the bacterial guest population would disagree).", "title": "another Grand Dame fallen on hard times", "user": "lionelpoitrine", "date": "December 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 88985805}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "We stayed here in august 2009 and loved it. The taj had restored the old elegance, opulence and service of the original ritz. What happened in a little more than a year?the hotel is undeerstaffed, run down and the cost cutting is so obvious it's ludicrous there's cheap, rough toilet paper. In the bathrooms, a bare minimum of toiletries, we remembered some splendid art in the halls now replaced with prints, torn seat cushions, the piano in the grill gone, two waiters in the grill, curtains that are dirty, wilting under scale flowers in the lobby. But it is the ritz. The walls are plaster. The rooms are quiet and the memories of the past give it a shabby elegance. We suspect the taj is in a holding operation, offering some of the best room deals in Boston, until a condo developer gives them their price and they pull out counting their money and. Boston loses another great landmark", "title": "A real estate deal waiting to happen", "helpfulness": 2, "user": "Nycmelanie", "date": "November 26, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 88304001}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "During my last business trip to Boston I stayed at the Taj hotel. The room was very big for one person. The bed was even bigger, I feld like a princes. Overall the room was very nice and clean. I think that you can expect this for the price you have to pay. The location of the hotel is fine, entrance to the public garden at the other side of the street and the begin of Newburry street where shopping is great.", "title": "Nice hotel", "helpfulness": 1, "user": "Elver_8", "date": "November 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87683371}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "Everything about this hotel was just lovely. It was a surprisingly elegant, but under-stated experience. The chandeliers, rooms, everything is beautiful and stunning. I felt like a visiting dignitary. Only issue was when the concierge recommended a restaurant, she didn't really understand my specific food issues. No major harm done. After breakfast was delivered, they called to see if everything was satisfactory. It was, indeed!", "title": "Luxurious experience", "helpfulness": 1, "user": "tennisbird", "date": "November 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87631261}, {"rating": 2.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "In spite of its prime location and formerly being Ritz Carlton, Taj Boston was in a sorry state of affairs.", "title": "Pathetic", "helpfulness": 1, "user": "SJB24_10", "date": "November 17, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 87378136}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "The room and bathroom were spacious but not well kept.", "title": "Location, Charm, Class..... Oh, and a View to DIE FOR", "helpfulness": 2, "user": "SayafK", "date": "November 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87279619}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "This is absolutely one of the finest hotels we have ever visited. The location at the Park with access to the \"T\", sight-seeing trollies, Beacon Street Homes and other amenities was just perfect for our vacation. The bar waiter, Carlos, from Chile, is the best. We hope when he retires he moves to San Antonio.", "title": "Location, Location, Location", "helpfulness": 1, "user": "LRBSEB", "date": "May 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108300134}, {"rating": 1.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Don't stay here when you come to Boston. There are many. many more better hotels in the city. I have stayed at the Marndarin, Westin, and W. They are all far better hotels. The Taj staff is rude, the rooms are small and nothing special and the service is terrible. I had to wait, wait and wait for everything. They promote themselves as luxury, but you can get better amenities at Holiday Inn. Would never stay there again.", "title": "Wannabe luxury hotel...Horrible", "user": "kaykayleigh", "date": "April 30, 2011", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 106229644}, {"rating": 2.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Where do I start? I booked this 2 night stay through Amex's Fine Hotels & Resorts (FHR) program for myself, wife and 18-month old daughter and this stay was pure disappointment.", "title": "Extremely disappointed", "helpfulness": 3, "user": "fireman4", "date": "April 24, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 105317678}, {"rating": 2.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "First, the \"good\": the front desk staff upon check-in was friendly, the lobby was clean, the bell staff was friendly, and the views from the room were very nice (room 530 overlooks the Commons).", "title": "NOT WORTH THE MONEY", "helpfulness": 2, "user": "earthkarma", "date": "April 19, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 104691512}, {"rating": 3.0, "stay_parameters": "Stayed March 2011", "text": "Now, the \"not so good\": As part of the FHR Program, we received an \"upgraded\" room, however the \"upgraded\" room was small, only large enough for a king bed & crib (room size has been mentioned in other reviews as well). While the room is furnished, the furnishings don't have any drawers where you can actually store clothing. The tables don't have drawers and there is an armoire, but the cabinet contains a large fridge and the 3 small drawers next to the fridge contain snacks, so there is NO place to unpack any clothing.", "title": "Mixed experience at Taj", "helpfulness": 1, "user": "Nicholsfamilytravel", "date": "March 27, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 101785058}], "location": {"country": "United States", "city": "Boston"}, "stars": 4.5, "variance": {"poor": 72, "average": 114, "very good": 264, "terrible": 31, "excellent": 340}, "aka": "Taj Boston Hotel Boston", "slim_ranking": 0.584415584416, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "Taj Boston, the Crown Jewel of Boston Hotels, occupies the city's most prestigious address at Arlington and Newbury Streets. Renowned for its classic style and award-winning service, this 1927 landmark hotel overlooks the picturesque Public Garden with swan boat rides and the Boston Common's ice-skating at Frog Pond. Surrounded by art galleries, boutiques and restaurants, the hotel is ideally located near the Theatre District, historic sites, shopping at Copley Place and the Hynes Convention Center."}