{"user_rating": 4.0, "review_count": 621, "name": "Talbot Hotel Carlow", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled solo", "text": "Staff all very friendly and helpful. Large room extremely clean and very quiet. Good gym and pool with treatment rooms. Located outside of Carlow town so car or taxi will be required for shopping trips.", "title": "Very good staff", "user": "Murphy33", "date": "February 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 151552819}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Myself and my boyfriend stayed here for a weekend during the Summer and would love to go back. Everything about the hotel was wonderful. The rooms were really big, clean and tidy. Food was so amazing that we're still talking about it 5 months on. The pool was big enough but the jacuzzi was even better. Staff were very helpful, I rang up reception asking for another hair dryer because the one in our room was broke and within 5mins he knocked on the door with a new one. would love to stay here again.", "title": "Great hotel and great food", "user": "DublinGirl91", "date": "February 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151427234}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "Overall our stay was pleasant and relaxed, the hotel itself is lovely an the rooms are spacious. On arrival and departure staff at reception were very nice and friendly. It was booked late enough so perhaps that was the reason for the high price would have expected bit cheaper for Carlow but was worth it.", "title": "Very nice hotel with friendly staff", "helpfulness": 1, "user": "Claire-The-Bear-87", "date": "February 4, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 151366960}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Stayed here for one night last weekend, the rooms are lovely and big, very quiet. We got a taxi to Carlow town which just takes a couple of minutes. We had breakfast in bed (€9 extra) the following morning which arrived right on time and was very nice. Before we left had food in Corries Bar which was also very nice and staff very efficient. Would definitely stay here again, this hotel seems to be very busy as is booked out on other dates I was looking for.", "title": "Good Stay", "user": "SineadD3", "date": "February 4, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 151358006}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Hi All. I have never used this site before or even logged onto it. After my stay in the Talbot Hotel in Carlow last week, I was so impressed with the experience that said i would log on and let you know of my experience. I have stayed in many hotels but for value for money this beats all. The staff, food, swimming pool and bedroom were all excellent. Great atmosphere about the hotel. The bowling alley right beside it past the Monday evening and was a bit of craic. We stayed in at suite and it you can afford the extra few euros than its well worth it. Great stay and will be going back.", "title": "Weekend stay at the Talbot", "user": "barry m", "date": "February 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 151333261}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Rooms are as good as any Radisson or Clarion etc. Solid floors, no noise between rooms.Spotlessly clean. Best value for money in Ireland. Lovely friendly staff.", "title": "Lovely no-nonsense hotel, friendly staff", "user": "jeancan", "date": "February 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 152323507}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Main Bar too overcrowded for my liking with a wedding going on and other groups there and quite a few small children running round at 9pm Friday night - does not suit me but its great to see the Talbot is doing great business. They deserve it as they are offering such great value. We stayed in this hotel in November and the bar was quiet at night. I will be back!", "title": "Fantastic value and great service", "user": "HMarie38", "date": "February 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 152283941}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "We stayed at the Talbot in Carlow on the three night offer. From the moment we arrived, we felt at home - the staff were very friendly, the food was delicious, the pool is a great amenity and its proximity to The Dome playzone meant the children were well satisfied. I would highly recommend this hotel, but you do need a car. Looking forward to their next 3 night B&B and dinner offer...", "title": "excellent", "user": "unastack", "date": "February 16, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 152243117}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "the staff were very helpful and friendly. Food was excellent. Its warm, comfortable and friendly. good leisure facilities. Also suitable for families and children are well catered for families I would definitely recommend it.", "title": "Dublin", "user": "Lisa C", "date": "February 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 152061241}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The Talbot Carlow we Just had a 3 night stay in the Talbot in Carlow", "title": "Beautiful Hotel and the most friendly staff ever", "helpfulness": 2, "user": "deniseh1971", "date": "February 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 151703360}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "Stayed for one night but wished I could have stayed for longer!! Beds were very comfy, rooms clean. Staff were extremely helpful and mannerly :) over all lovely stay. Very near Carlow town on the portlaoise road. Easy to find and situated right beside the dome!!", "title": "Great value", "user": "neverlandsue", "date": "February 3, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 151284928}, {"rating": 4.0, "stay_parameters": "Stayed February 2013", "text": "Booked a 2 night break away at the Talbot in Carlow. Very nice hotel but a bit far outside the town. The staff are a credit to the hotel, they were extremely friendly and made the stay enjoyable. The food in the restaurant was excellent. Overall we had a great time & the hotel was good value.", "title": "Lovely stay", "user": "Liamyos", "date": "February 2, 2013", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 2.0, "service": 5.0, "rooms": 4.0}, "id": 151242690}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "the hotel rooms are very clean and nice but the stay in the hotel was not great for the price paid.", "title": "Not worth the money, looks good - service crap", "user": "Karl H", "date": "January 28, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 3.0}, "id": 150819972}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "the shower pressure in the room is terrible, really bad. bathroom again nice and clean and looks well just like the rooms and hotel overall.", "title": "Overnight stay in The Talbot Hotel Carlow", "user": "Richard K", "date": "January 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150748642}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "the restaurant (Liberty Tree) was a very poor experience, we waited 15 minutes to be seated while tables were left empty despite booking the time for 8 PM. Id never have a problem with waiting just it seemed pointless in this case as the table was sitting empty. The menu was as basic as can be (steak, chicken or lamb) and the staff were poor and left us waiting for everything no matter how small menus, drinks, wine, proper cutlery wasnt received).", "title": "My Favourite hotel", "user": "Gill H", "date": "January 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150734614}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "Stayed here as part of a hen party and I would highly recommend it. The rooms are spotless and our group got to stay together which was great for us and no doubt other guests who wouldn't have to listen to us! The bar staff were especially fantastic, creating random cocktails for us to try as well as making sure we were able to have tables together. Its on the ouskirts of town but you could easily walk to town. Would definitely stay again if in Carlow!", "title": "Fantastic staff", "user": "AnnMarie M", "date": "January 26, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 150673461}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "I would like to thank all the staff at the Talbot for a lovely stay. From the minute we walked in the door until we left, everyone was very helpful. The room was spacious and clean, just what you want :-) The food was in the restaurant was tasty and the bar was lively. Thank you again for a lovely stay. If in Carlow again, will defo stay.", "title": "Enjoyable Stay", "helpfulness": 1, "user": "kerry1_13", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 150421205}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "I had a wonderful time in Talbot Hotel in Carlow. The staff were so friendly and helpful with anything you want. The food was gorgeous. The enterainment was great. The rooms were clean and gorgeous and spacious. Everything a person would want. It great for kids when the DOME is next door. Spa and Swimming pool was relaxing. Me and my boyfriend will go again. My Boyfriend said it was brilliant, the best hotel he's being to.", "title": "This is a brilliant hotel-enjoyable, relaxing.", "helpfulness": 1, "user": "gillian277", "date": "January 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150257189}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "We had my \"Girlie Night Out\" (aka Hen night) on Saturday/Sunday. From the minute I arrived at the Carlow Talbot I felt like I was staying at a friends home with all the perks of a hotel!", "title": "Felt like V.I.Ps", "user": "Sinead H", "date": "January 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150209380}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "All of the staff especially Liz, Laura,Lorraine, on reception and Kevin,Sarah and Rob at our meal and in the bar looked after all of us so well. Not one of us had any complaint and all of us agreed that we had picked the perfect venue. Considering we were a party of 20 women this was amazing!! All our rooms were on the same corridor, we had our own room for our meal (and our Dirty Dancing lesson!!) and had our own area in the bar after the meal. The staff in the bar had put enough tables together so that we could all sit around them. There was even enough space for us to have a dance to the live music. As there was a glass partion between us and the rest of the bar we felt that we weren't bothering any of the other guests. As one of the girls put in we felt like we were in the V.I.P area.", "title": "excellent staff", "user": "Hepburn24", "date": "January 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150085000}], "location": {"country": "Ireland", "continent": "Europe"}, "stars": 4, "variance": {"poor": 37, "average": 82, "very good": 156, "terrible": 31, "excellent": 315}, "aka": "Carlow Talbot Hotel", "slim_ranking": 0.4, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.0}, "description": "The Talbot Hotel Carlow is a leading four star hotel located just 2km from Carlow Town. All 84 guest rooms along with two spectacular suites and well appointed interconnecting family rooms are designed, furnished and decorated with the ultimate of guests comfort and convenience in mind. Range of dining options await you at Corries Bar & Bistro which serves delicious food throughout the day and the 4th floor Liberty Restaurant for Breakfast & Dinner. The award wining Inspirit Health & Leisure Club boasts a 20m deck level pool, kiddies pool, sauna, jacuzzi, steam room & state of the Art Gym. Classic Beauty Salon provides a range of pampering treatments. Weekend Kiddies Programme available at the Talbot Hotel Carlow."}