{"user_rating": 5.0, "review_count": 763, "name": "Tambo del Inka, a Luxury Collection Resort & Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We stayed here for 2 nights on the way to Machu Picchu. This hotel represents the epitome in understated luxury and service. The setting is truly splendid alongside the river in the Sacred Valley and the property, although large, never seemed crowded. With our Starwood Gold status, we were automatically upgraded to a suite, even though we were using \"cash and points.\" The room was beautifully appointed and our personal butler, Roger, could not have been nicer or more helpful, anticipating our every need and then some and bringing us complimentary gourmet chocolates. The other staff members were equally friendly and helpful. We thought the food in the restaurant was delicious--the \"surubi\" fish was especially memorable. The indoor/outdoor swimming pool was sublime. Roger escorted us (and carried our bags) to the on-site train station for our trip to Machu Picchu. (Unfortunately, the train broke down enroute and we were delayed one hour while awaiting a replacement). We only wished that we were returning to this hotel after visiting Machu Picchu instead of staying at the vastly inferior (and significantly more expensive) Inkaterra hotel there. Inkaterra should take a few lessons on service and the meaning of \"luxury\" from Tambo del Inka.", "title": "Inka-Terrific", "helpfulness": 2, "user": "DCRE", "date": "May 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130105499}, {"rating": 5.0, "title": "Wonderful hotel", "text": "We spent two nights at Tambo del Inka as part of a quick trip to Peru. It was a wonderful hotel and I am very glad that I chose to stay here. It is a great base for visiting the Sacred Valley. The hotel staff were very helpful and gracious. We did not eat in the main restaurant, but had a couple meals in the bar. The food and drink there were excellent and the waitress was very friendly.", "user": "C3Baker", "date": "May 16, 2012", "id": 130068026}, {"rating": 1.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "The rooms (we had junior suites) were very spacious and in great shape. The beds were very comfortable. The bathroom was very modern and well laid out. The grounds were well maintained and very beautiful. Overall, we really enjoyed our stay here and would highly recommend the property. We got a pre-paid in advance rate that made the rooms a very good value.", "title": "Lock your belongings at all times", "helpfulness": 9, "user": "Leonard A", "date": "May 14, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 129954792}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "I spent 4 days at Tambo del Inka, and was mostly impressed by it. My opinion, however, changed when my iphone was stolen from my bag, while at the care of the hotel, in the day I checked out. Although intended to be a place of relaxation, one cannot be completely unguarded in this hotel spa.", "title": "Best way to treat yourself after a long Inca trek ;-)", "user": "cgunny", "date": "May 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129842656}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We stayed in this awesome place in the month of April after our 4 day Inca trek. It is part of the starwood properties and I've used my points to get this hotel. The location and the ambiance are great. The architecture of this place and how the swimming pool is designed is impressive. The rooms are big and spacious. I will stay here anytime just to chillout. If you don't want to eat in this hotel and you can just step out to walk to some of the local places. (We didn't go out to eat but ate in the hotel...pricey but wanted to enjoy after staying in the hostels and camp sites).", "title": "In A Class Of Its Own", "user": "curiousrover", "date": "May 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129589961}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "I just returned from a visit to Machu Picchu. We stayed at Tambo del Inka and took a tour booked through Tikariy to Machu Picchu.", "title": "A wonderful place to stay in Urubamba", "helpfulness": 1, "user": "Pattie1931", "date": "April 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128623941}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Tambo del Inka was fabulous, the food was delicious. I ate and drank the water there and delicious food and did not get sick. It was very romantic to sit outside in the bar area looking at birds flying through the trees, hearing the river flow by.", "title": "Brilliant Hotel in beautiful setting!", "helpfulness": 1, "user": "Jim255350", "date": "April 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128561797}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Our guide on the trip to Machu Picchu was Ernesto. He was charming very knowledgeable.", "title": "Beautiful hotel between Cusco and Machu Picchu", "user": "AliBali1010", "date": "April 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 128225922}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "Hotel is apparently less than 2 years old and is a magnificent facility. Set in beautifully landscaped and manicured grounds surrounded by tall eucalypt trees. The view from the front door up the valley to snow covered peaks was a real bonus. Huge well-appointed rooms with beautiful views from large floor to ceiling windows. Restaurant was a work of architecture in itself with huge tree-like column supporting the timber ceiling some three floors above. Peruvian hospitality staff at all hotels we stayed at were as good as you can get anywhere in the world, all were so very polite, helpful and very professional. It is the ideal base for exploring Sacred Valley and then moving on to Machu Picchu. Highly recommended.", "title": "Relaxing, away from it all", "helpfulness": 3, "user": "zoecatva", "date": "April 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 128147425}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "We stayed at this hotel for one night on the way back to Cusco from Machu Picchu and only wish it would have been longer. The beds are among the best I have ever slept in, and the rest of the amenities were wonderful. Food at the restaurant was superb -- I can particularly recommend the Lomo Saltado, which was the best of the 6 I had in Peru that week! The spa treatment was also excellent. Worth the stop!", "title": "Exceptional", "user": "SgFm", "date": "April 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127736261}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Unique hotel, amazing atmosphere. Nice rooms. Urubamba is a very small town, and it is pretty far from Cusco, around an hour drive. Staff very helpful, and breakfast and other meals also very good. My wife and I tried the spa and it was pleasant, though it was too cold to hit the pool. Hot tub only on the women's side!", "title": "Luxury, though a bit out of the way", "helpfulness": 2, "user": "pongo1390", "date": "April 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 127390225}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "The hotel has its own train station, very convenient, and you avoid the crowds at the other stops. Tour group from the hotel was good, but very expensive. Probably a cheaper way to do this.", "title": "They deserve their reputation", "helpfulness": 1, "user": "lgreenb", "date": "April 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127364607}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Overall great experience, though I wouldn't want to stay for more than a few days.", "title": "Paradise in the Sacred Valley", "helpfulness": 3, "user": "bondocrob", "date": "April 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 127215063}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "Beautiful setting in the SV. Very Peruvian Zen feel in trhe lobby. Service is the best I've had anywhere !! Entire staff ( reception, houskeeping, dining room, bellman & our butler) always had a smile, and knew our name.", "title": "Amazing Service & Relaxation", "helpfulness": 2, "user": "Eric F", "date": "April 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 127214576}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "We were there on Earth day. The hotel supported the initiative by turning out the lights for one hour in the evening. We ended up with a beautiful candellit lobby & free Pisco Sours in the bar. Not exactly a hardship.", "title": "INCREDIBLE SACRED VALLEY!", "user": "TangoBee", "date": "April 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127133629}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Simply fantastic.from check in to check out. great location great service great food and great concierge.World class resort.", "title": "#1", "user": "NunavutBlondi", "date": "May 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129579563}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Thanks for the great stay.", "title": "Very, very nice...", "helpfulness": 2, "user": "jykll", "date": "May 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 129426153}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Beautiful grounds and facilities, rooms overlooking the Urubamba river, very clean and tasteful. Staff very helpful and pleasant. Fantastic indoor/outdoor pool. Affordable luxury in an unexpected location. I'd recommend the bar for dinner or lunch, though. The main dining restaurant was a bit stuffy and overpriced without being that great. Bar food and drinks were really good and you can sit out on the great patio.", "title": "Wonderful!!", "user": "Maria M", "date": "May 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129265391}, {"rating": 5.0, "title": "Luxury, excellent access to Machu Picchu", "text": "We stayed at the hotel 2 nights after a long transatlantic flight to Lima and then to Cusco.", "helpfulness": 1, "user": "Charles G", "date": "April 29, 2012", "id": 129010366}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "It was the perfect place to relax and be ready for the great vacations we had in Peru!", "title": "Pricey but worth it", "user": "ckhgen", "date": "April 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128947717}], "location": {"country": "Peru", "region": "Cusco Region", "continent": "South America"}, "stars": 5, "variance": {"poor": 7, "average": 7, "very good": 63, "terrible": 3, "excellent": 683}, "aka": "Tambo Del Inka, a Luxury Collection Resort And Spa", "slim_ranking": 0.047619047619, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.5}, "description": "Situated between the ever present voice of the Vilcanota Riverand the stoic silence of the mountains of Cusco’s Sacred Valley,Tambo del Inka, a Luxury Collection Resort & Spa, is located in theSacred Valley of Urubamba.The hotel is located 60 minutes away from Cusco airport and hasits own train station from where guests can start their tour toMachu Picchu."}