{"user_rating": 4.0, "review_count": 772, "name": "Tampa Marriott Waterside Hotel and Marina", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "I'm not sure that we could have found any place better in our price range. A few friends and I traveled into Tamp for a \"guys football\" weekend and found the prices here to be perfect. Upon arrival we were not disappointed. Friendly staff, amazing views, clean rooms and just a great place to hang out.", "title": "Great Place for whatever you need", "user": "Puttz", "date": "September 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 140014330}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The added bonus of the trolly stop across the street (2.50 one way - 5$ all day) made it easy for us to get out and party to the places we wanted to be.", "title": "First Class Hotel in Tampa!", "helpfulness": 2, "user": "Milkmess", "date": "September 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139482140}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled solo", "text": "The staff was extremely friendly, couterous and fun. A lot of \"upscale\" places tend to frown upon four guys walking in with cases of beer in hand and just to conclusions that there will be trouble. The staff here just laughed and had fun with us. No one gave us a hard time for sitting out back and watching the boats for hours with our own beer.", "title": "Breathtaking", "helpfulness": 2, "user": "Jamie M", "date": "August 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138941661}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Staff was nice enough to give us tips on where to find the best nightlife for us, the best parking for the football game, and answer many other questions we had about the area.", "title": "Upclass Hotel!", "user": "PackPride", "date": "August 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138894276}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "I would recommend this hotel to anyone coming to Tampa from top to bottom.", "title": "Great experience in downtown Tampa", "user": "Larryope", "date": "August 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 138563128}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "We were fortunate to be booked at the Marriott Waterside in Tampa for a national business convention early this month. Never having traveled to Tampa left us at the mercy of the fine people at the Marriott Waterside, turns out we were in excellent hands! The location of the hotel was perfect for attending events at the Tampa Convention Center and for exploring the harbor area. The hotel did an excellent job of managing the hundreds of people attending our meeting and they provided some of the best customer service we have ever experienced. Every department from the restaurant, pool area, fitness center, housekeeping and front desk staff demonstrated great training they received and above-average efforts each of the 4 days we stayed there!", "title": "Our First Time Was a Great Time!", "user": "GOmaha", "date": "October 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142650519}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "I just wrapped up a week long conference at this hotel. We had numerous receptions and hospitality events on site. Without fail the staff were very professional and courteous. Nice job Marriott! I would recommend this hotel in a second for your next event.", "title": "Great service, great conference hotel!", "user": "Jski529", "date": "October 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 3.0}, "id": 142511706}, {"rating": 3.0, "stay_parameters": "Stayed October 2012", "text": "I rarely write a poor review and am so critical of others that do. This will appear to be too detailed and is written primarily for other platinum elite members who will understand. There is a service level you learn to expect and when it fails to deliver it is definitely noteworthy. The GOOD: location, location, location. Walking distance to beautiful riverfront area. Live music within earshot of your balcony nightly. The POOL with self service ice by the bar and plentiful pool towels and chairs. Conscientious and pleasant staff who follow up on requests even when not fulfilled. Their heart is in the place so an A for effort. The BAD: one bath towel per person in room even when asking for extra towels. NO weekend coffee options other than make it your own in the room. When we called for coffee through room service they simply brought us more packets and empty plastic cups so we could make it ourselves. No concierge club on weekends. Thunderous Loud noise of cigarette boats in harbor. When our wine and cheese-crackers welcome amenity was brought up they brought just ONE wine glass for the two of us. Turn down was an abrupt knock at the door and a hand extended with a greasy cookie in a paper wrapper. (Hence the lack of towels issue). Valet service is Painfully slow and inefficient. Call with plenty of notice to retrieve your car. Again. The location makes this a great place to stay. Just understand what to expect and you will be fine.", "title": "Lower your expectations and stay here anyway for the location. So much potential wasted on poor service and systems with a frien", "helpfulness": 2, "user": "suntrine", "date": "October 8, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 142323020}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Looked like it was primarily a conference hotel. Room was a bit pricey - basic but adequate . Breakfast was good. Staff very friendly. Just across the street from Tampa Times Forum and Convention Center. Trolley in front of hotel will get you to Aquarium and some shopping nearby.", "title": "Good location", "user": "MBee J", "date": "October 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 142073082}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "Great location next to Tampa Times Forum and across the street from the convention center.", "title": "Great Location..", "user": "Pipesofstl", "date": "October 4, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 141994394}, {"rating": 2.0, "title": "Disappointing", "text": "Stayed here for 3 nights over Labor Day weekend. Our bad experience began at checkin with the rudeness of the man at the front desk. The Marriott brand nickels & dimes there patrons to death. $14.95 for Internet service, really even if you are a silver elite member! The only hotel chain I have stayed in lately that still charges for Internet. Then there was the $5.00 bottles of water in our room, ha ha it was only $2.00 in the vending machine across the hall. No safes in your rooms, very inconvenient. Found used soap in the box at the sink. The best part was requesting the duvet cover be removed & replaced with sheets & a blanket. 1. Duvet removed, stuffed in closet & bare quilt left on bed, 2. Returning at 11 pm, no one to make bed as originally requested. Sent someone with set of sheets & another quilt. Finally received a thread bare blanket queen size for a king bed. At midnight we were making our own bed. 3. Next day bed was made another set of sheets was left after we requested a king size blanket. After 3 nights we had a duvet cover, 2 quilts & 3 sets of sheets. This is not the service I expect when paying over $300 per night!", "helpfulness": 2, "user": "Blanche K", "date": "September 23, 2012", "id": 141012806}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Marriott, you have lost our loyalty and business. Whenever possible we will stay at your competitor, that want our business and treat us with respect and appreciation.", "title": "Beautiful Hotel, amazing area", "user": "rostockd", "date": "September 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140777783}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "This is a beautiful and amazing facility. It is within walking distance of a trolly that takes you to Ybor city. The staff at this hotel are really nice and are very helpful. I was very impressed with the cleanliness of the hotel and the city of Tampa. The food served in the cafe is really good and each dish was fabulous. The fresh fruit was so wonderful and the raspberries were the biggest I have ever seen. The seating areas in the lobby are conversation friendly, in a beautiful setting and I just cannot begin to tell you how beautiful the setting is. You must stay here to appreciate all of the ammenities!", "title": "BEAUTIFUL!!", "user": "LaIslaBonitaNC", "date": "September 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140603141}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "This is an absolutely amazing hotel! It overlooks the waterway, is across the street from the trolley and is convenient to most things downtown. It is also near an upscale mixed development area and gated community.", "title": "Best personnel in the hotel business (consistently)", "user": "Linda W", "date": "September 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 140500105}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "There is a fantastic nightclub: Jackson's. We danced the night away there and had a great time! The demographics were a melting pot of diversity, age and gender.", "title": "Wedding weekend in Tampa", "user": "Crawfish Boil", "date": "September 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140366885}, {"rating": 1.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Came here this past July to take my Bar exam (very important test for my career). But here is why my I rate themn as horrible:", "title": "Tampa Marriot Waterside Hotel and Marina", "helpfulness": 2, "user": "StephanieJD", "date": "October 3, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 141924209}, {"rating": 3.0, "title": "Still charges for Internet", "text": "1. I was lied to about valet parking prices. I was told a cheaper price via phone and paid double when I showed up.", "helpfulness": 1, "user": "cfmac", "date": "September 28, 2012", "id": 141471996}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "2. I had spiders in my room and on my bed. I also incurred a spider bite. I was told that there was only 1 house keeping staff person working that night so I went a long time before my sheets were changed.", "title": "Excellent experience", "user": "931ek", "date": "September 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141425946}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "3. Breakfast Room service order came in late on the day of my test, even with my order put in the night before", "title": "USA Canada Lions Leadership Forum", "user": "leRosewood", "date": "September 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141409684}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "4. Ate lunch at the hotel and was not warned via sign or message that there were nuts in the dishes. I am highly allergic to pine nuts and inurred a severe allergic reaction to the dishes I ate", "title": "Very good", "user": "Royalprincess50", "date": "September 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141283405}], "location": {"country": "United States", "city": "Tampa"}, "stars": 3.5, "variance": {"poor": 38, "average": 90, "very good": 280, "terrible": 26, "excellent": 338}, "aka": "Marriott Tampa", "slim_ranking": 0.113924050633, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "A striking silhouette along the Channel Riverwalk, the Tampa Marriott Waterside Hotel and Marina in Ybor City overlooks Tampa Bay in the heart of Downtown, located adjacent to the Tampa Convention Center. This world-class Downtown Tampa hotel's 50,000 square feet of newly renovated meeting space, full-service spa, and several delicious restaurants such as Café Waterside and Champions, make it the perfect destination for work and play. Part of the Channelside District, the Tampa Marriott is among the most luxurious of hotels in Tampa, Florida, with newly renovated rooms and suites offering private bay or city view balconies. After a busy day, unwind in one of this Tampa, Florida hotel's lounges or enjoy culinary excellence at Il Terrazzo. For ultimate relaxation, try our spa, jacuzzi, or rooftop pool! Boaters can dock and stay using the 32-slip, full-service Marina at the exclusive Tampa Marriott Waterside Hotel and Marina near Ybor City."}