{"user_rating": 5.0, "review_count": 96, "name": "Tan-yr-Onnen", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "My sister and I stayed here for 2 nights. Patrick and Sara are very friendly, and we were served with tea and cakes on our arrival. Our room on the greound floor was excellent and very clean, and had french doors out to a patio with tables and chairs. Breakfast was super! Highly recommend.", "title": "excellent!", "user": "pdvlondon", "date": "August 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116886694}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We arrived to a very warm welcome and the warmth lasted throughout the stay. Our suite was the \"FORGET ME NOT\" and we will not forget our stay. Tastefully decorated and furnished, everywhere was spotlessy clean and full of the nice little touches, going that bit extra to ensure your happiness. We will definately return for a longer stay next time, as you drive away you know you will.", "title": "YOU MUST STAY HERE", "user": "david_evans973", "date": "August 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116221211}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "I stayed here last week and was delighted to stay in this charming, warm B&B. I really couldn't find fault with anything. It really was the best B&B I have ever stayed in!!!", "title": "Great place!", "helpfulness": 1, "user": "beck81014", "date": "July 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115477195}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "I couldn't find fault with anything here. If you like good quality, then you will like it here. We enjoyed everything, from our evening meal, to the good advice on how best to spend our day in Wales.", "title": "Lovely people and lovely place.", "helpfulness": 1, "user": "chrispick", "date": "June 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 112901122}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "See you again soon! :)", "title": "More like a small hotel than a B & B", "helpfulness": 1, "user": "Lancashire_7", "date": "May 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110269256}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "I have to agree with the other review on here - this is truely a lovely place to stay. I stayed here on business and must admit to driving past the place a couple of times but im putting that down to the fog!! I arrived late and the owner had stayed up to wait for me arriving to make sure i found my way which i think is great! I got a lovely welcome and made a change from staying in the chain hotels. Room was very comfortable and i loved the fact you have fresh milk for your hot drinks :) it really is a great place and i am now looking for a reason to rebook!!", "title": "Fantastic place to stay", "user": "midnightdav", "date": "April 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128042166}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We came upon this delightful Guest House by chance whilst visiting relatives in the area; if only all chances had such a wonderful outcome.", "title": "A Great Place To Stay", "user": "shrekHastings", "date": "April 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127595504}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Patrick and Sarah made us very welcome and provided excellent accomodation and breakfasts of the highest quality; their friendly and unassuming manner does credit to both themselves and to the quality of their establishment.", "title": "Another hidden gem", "user": "Funicats", "date": "April 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 127553416}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "The difference between a good place and a great place is the people who run it. Just like the great little guest houses/Inns in Palm Springs (Alpine Gardens) and Hyannis, Cape Cod (SeaCoast Inn), Tan-yr-onnen in North Wales is truly a hidden gem. Whilst it doesn't have the size and facilities of a larger hotel, it makes up for it in the warm welcome, the attention to detail, the luxurious room and the feeling that you get when staying with close friends, even though you have only just met them.", "title": "Great again", "helpfulness": 1, "user": "sharon3001", "date": "April 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 127378439}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Patrick and Sarah were fabulous hosts, making sure that we had everything we needed without being too familir. As an added bonus both their teenage daughters were there at the weekend to help them with the chores and you got a great feeling that the whole family were pulling together to make sure we had a great stay.", "title": "This b&b has the WOW factor!!", "user": "Amanda T", "date": "February 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124164252}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "I don’t think you can improve on Tan-yr-Onnen as a B&B. Sarah and Philip are the perfect hosts; not only interesting but interested in what you have to say. The rooms are large, well-equipped and scrupulously clean; there is a wide range of dvds if you don’t fancy what’s on the telly; and the breakfasts are what you dream about…well, the sort of thing I dream about anyway! It is out in the middle of nowhere and, if you’re there on a Monday or Tuesday, the local pub isn’t open, but it’s not too far away from places to eat and drink. We went to St. Asaph and The Bridge on ‘Pie Night’…good food but don’t expect too many chips nor to be served particularly quickly. We arrived about 6 hours early but that proved to be no problem, that’s how accommodating they are and putting the world to rights with Sarah and talking aircraft with Philip was an absolute delight. If you’re thinking of stopping anywhere near here, stop here!", "title": "Perfect B&B", "helpfulness": 1, "user": "bigfozbelper_England", "date": "June 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131615608}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Really nice homely experiance. Really impresive what they have done in such a small amount of time with good idea's on what they want to do in the future to futher improve on perfection. A*", "title": "Lovely", "user": "Keith B", "date": "May 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130796056}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "A lovely gem of a B&B tucked away near St. Asaph. Fantastic hospitality and oh what a breakfast!! We had a great time and will surely be back again :-)", "title": "Excellent!", "user": "F N", "date": "May 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 129846961}, {"rating": 5.0, "title": "Highly recommended", "text": "One of the two best guest houses we stayed in on our road trip around Wales (the other one was Ty Rhosyn Guest House in Pembrookshire). Would absolutely recommend!", "user": "flaghunter", "date": "April 30, 2012", "id": 129122438}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "This place is just excellent. The hosts are the best in the business. Super breakfast. Rooms are really comfortable and well appointed. This was one of the bets stops on our euro vacation.", "title": "Great stay", "user": "Andrew M", "date": "April 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128545348}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Stayed just two nights in this fantastic establishment and wished it could have been two weeks! Perfectly sited for the A5 yet really peaceful and rural, the rooms were super, one of the biggest and most comfortable beds we've slept in and Sara's breakfast really set us up for the day! Well deserving of the Gold award just received! We cannot recommend too highly.", "title": "A little gem of a b&b", "user": "elinsnan", "date": "December 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121806712}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Stayed at Tan-yr-Onnen for one night only but are hoping to stay again. Patrick and Sara are perfect hosts. Beautiful house and surroundings. Definitely five star accomodation - superb. We also enjoyed a late evening meal at the nearby Farmers Arms pub - thoroughly recommended for a very tasty meal. After a very comfortable nights sleep we had breakfast. Choice of homemade muesli, homemade fruit salad, cereals, toast, breads etc, together with a cooked Welsh breakfast - fantastic!", "title": "Excellent experience all round", "user": "Ibanezblue", "date": "December 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121543145}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We struggled to find this place on our way back to West Wales from Manchester Airport, but on being guided in by mobile, we were truly delighted.", "title": "I want to go back now", "user": "sandpwms", "date": "September 18, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118260490}, {"rating": 5.0, "title": "If all B&B's were like this", "text": "This is really 5-star accommodation. So very clean and well appointed. Patrick and Sara told us, before we left, that they have slept in every room, which is what I always say should be done. The attention to detail is great and all makes for a pleasant stay. Probably our only grouse was in the bathroom, as we do not like fixed head showers and there was no grab rail. But we could have had the latter if we had asked, and there is a non-fixed shower in the wet room attached to Daisy.", "user": "moscovy", "date": "September 13, 2011", "id": 118052149}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "Oh, and the other grouse was (only joking really) that one daughter was celebrating her 18th birthday and we could not eat there. Just listening to Sara discussing the evening's menu with other guests after breakfast made our mouth's water. She obviously puts a lot of thought into it. The breakfast was excellent, too. They are such a friendly couple we chatted to them for far too long and delayed their own breakfast.", "title": "You have to experience this place!", "user": "sarahandcraig", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 117975916}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 5, "variance": {"poor": 0, "average": 0, "very good": 1, "terrible": 0, "excellent": 95}, "aka": "Tan-Yr-Onnen St. Asaph, North Wales", "slim_ranking": 0.5}