{"user_rating": 4.5, "review_count": 60, "name": "Tango Bed and Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "My wife and I just returned from staying 7 nights at Tango B&B and we couldn't have been more pleased. Valeria went above and beyond to help us out and make us feel welcome. Right from the start, she was fantastic at keeping in touch via e-mail, answering all of our questions and confirming dates. She also arranged for a car to pick us up from the airport at 1:00 am when our flight arrived. Yes, we were greeted and shown to our room at 1:30 am when we finally arrived at the house. It was a horrible flight and there could not have been a better way to end it. Everybody was very understanding and we even got breakfast the next day, though we didn't wake up until 11:30am.", "title": "Like staying with extended family", "helpfulness": 1, "user": "varmav", "date": "March 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 25897685}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We stayed in the family suite, even though there were only two of us, so we had plenty of room. The room was extremely comfortable, with private clean bath, comfortable bed, and a TV sporting a large number of English language entertainment. It also had its own access to the rooftop terrace, though the terrace is shared by everyone. It is a great place to eat a pizza or have some empanadas that you brought back for dinner. The AC unit really cools the room down well, which is a lifesaver in February. The room is also adorned with Jorge's paintings, as is the entire house. If you can spare the extra charge, I would recommend getting the family suite, simply for the amount of space you get and how comfortable the entire layout is. There is also WiFi available throughout the B&B and a communal computer that can be used by all of the guests.", "title": "Awesome Awesome Awesome", "user": "RoughneckFan", "date": "March 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25715826}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with friends", "text": "The breakfast was a pretty good spread, certainly larger than other breakfasts we had during our travels. It features breads, croissants, coffee/tea, yogurt, dulce de leche, ham, cheese, and homemade bread pudding. The amount of food is easily enough to fill you up and tastes great (everything is good with dulce de leche smeared on it!).", "title": "Amazingly helpful and friendly hosts!", "helpfulness": 1, "user": "oddraisin", "date": "February 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 25201362}, {"rating": 5.0, "stay_parameters": "Stayed December 2008", "text": "As for noise, keep in mind that Buenos Aires is a big city and, as such, there will always be noise. The street is actually far quieter than you would expect it to be, but there is still some noise from traffic, pedestrians, dogs, etc. However, we never had any trouble sleeping at night and the house itself is kept quiet and unruly. This was no different than what you would find in downtown San Francisco or Chicago.", "title": "We love the place", "user": "gato55", "date": "February 2, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 24097302, "likes": {"liked": "— The owners", "disliked": "— We liked everything"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "The location is fantastic, as you are very close to the metro, restaurants, and the major commercial street where you can find banks, drug stores, shops, etc. You can also walk to China Town, as well as some parks and plazas. For everything else, there is the metro, which we used almost daily. There is also a fantastic restaurant right around the corner on Mendoza street called 1810 Cocina Regional that serves the best empanadas you will ever have; this was a tip from Valeria and it really paid off. The Belgrano neighborhood itself is wonderful and it is very refreshing to not be in a tourist hotspot, but to experience the city the same way the locals do. As a warning, outside of the B&B, don't expect a whole lot of English to be spoken.", "title": "Disappointed", "helpfulness": 1, "user": "Vino33", "date": "January 30, 2009", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 24032481, "likes": {"liked": "— Affordability", "disliked": "— Noise"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled solo", "text": "I will never forget the week I spent in Buenos Aires. Not only due to the natural beauty of the city, excellent food and sights, but also for the great time I had at the Tango bed and breakfast.", "title": "A special and fantastic B&B in a special and fantastic city", "user": "timtim1305", "date": "December 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22654130, "likes": {"liked": "— great service, special owners, interesting guests, unique experiences", "disliked": "— I liked everything"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled solo", "text": "I arrived to Buenos Aires for a friend’s wedding, and decided to stay in Buenos Aires for three weeks in total. My friend has booked the Tango B&B for me.", "title": "You'll feel right at home!", "user": "badger20", "date": "December 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 22545712}, {"rating": 5.0, "title": "Love the Place", "text": "The room I got was simple, clean and nicely arranged. The bathroom and bath are outside the room, and were always kept very clean. The breakfast was excellent and generous, to the point where I sometimes had to skip lunch. The B&B as a whole is a special house, with newer and older parts and diverse room designs.", "user": "riverplate_traveler", "date": "December 8, 2008", "id": 22542049}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "I guess that the above description may apply to other B&Bs in Buenos Aires. However, I wish to emphasize next a few non-standard elements, which I believe distinguish Tango B&B from all the other places.", "title": "not recommended", "user": "franny26", "date": "November 27, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 2.0}, "id": 22253756, "likes": {"disliked": "— musty smell in the room, bathroom, noise"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled solo", "text": "The most significant factor is the owners – Valeria and Jorge. They are truly amazing people. Valeria is an energetic and very intelligent woman, who taught gymnastics for many years. Jorge is an amazing artist – he holds a painting studio within the B&B itself. Since I always liked painting, I took a couple of lessons with Jorge, and must admit that I learned a lot from him, inspired by his kind and patient way of teaching. Jorge has also prepared to all guests the most amazing asado I have ever had in my life!! They are both professional wine tasters – don’t forget to ask their recommendation regarding local wines.", "title": "Pictures Can be Deceiving", "user": "ElPelar", "date": "November 23, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "location": 2.0, "rooms": 1.0}, "id": 22117944, "likes": {"liked": "— Cheap", "disliked": "— Not clean, in the end was not cheap because had to pay to wire money."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled solo", "text": "My stay at the Tango Bed and Breakfast was excellent. As a solo traveler, I knew that I needed special attention to navigate Buenos Aires. I decided to stay here because of the reviews on TripAdvisor.", "title": "Wonderful hospitality.", "helpfulness": 1, "user": "Kathleen1819", "date": "August 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39316976}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Valeria took very good care of me. She explained the subway system to me, told me what to ask for when I purchased my tickets and directed me to the proper subway stops to get off to see the various sights. Valeria also pointed out the best restaurants in the Belgrano neighborhood.", "title": "Excellent B and B, great location and accomodations", "user": "msgraneight", "date": "August 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38491482}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled solo", "text": "I stayed in the studio apartment just a few steps down from the bed and breakfast. At breakfast you will be eating with the other guests. This is a great opportunity to exchange ideas and suggestions. You can check your e-mail at the bed and breakfast.", "title": "Feeling at home", "user": "Julisoco29", "date": "August 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 36408842}, {"rating": 4.0, "stay_parameters": "Stayed May 2008", "text": "Staying in the Belgrano neighborhood was good because you were in a neighborhood where people lived rather than an area that was full of hotels. There is an excellent shopping district just a block away from the bed and breakfast.", "title": "Traditional Belgrano", "user": "ParisianMushroom", "date": "July 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 3.0, "service": 5.0, "rooms": 3.0}, "id": 34375803}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "I absolutely loved Buenos Aires. The people were so kind and accommodating to a solo traveler. The city is noisy, boisterous and full of life (think New York City). Prices were extremely good. Eating out in restaurants was at least 1/2, and sometimes 1/3, of what it costs to eat in the United. Every meal I had was great. Once you eat Argentinian beef, you will never be satisfied with beef from the US. The leather goods that are made in Argentina are of a very high quality and the prices were excellent.", "title": "A very enjoyable stay: couldn't ask for more", "user": "Kitbugha", "date": "March 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26505509}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "I recently came back from a trip to Argentina and we used Tango B&B/Buenos Aires as a base for our travels so we were flying in out.", "title": "a fantastic stay", "helpfulness": 1, "user": "m_l123", "date": "January 12, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 23487076}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled solo", "text": "I think all of the prevous reviewers have already mentioned how wonderful our hosts Valeria and Jorge are and i would have to concur but also mention that i don't think i've stayed in a place where the staff/owners go that much further to be helpful and welcoming. I and my friends throughly enjoyed our stay.", "title": "Home away from home", "helpfulness": 2, "user": "Luk_Lu", "date": "January 9, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 23398596, "likes": {"liked": "— Customer service and cleanliness of room and bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled on business", "text": "I'd just like to add a couple of things which i think would be useful for anyone thinking of staying here.. the subway station is a 5-10min walk away which takes you to most of the main tourist attractions and costs 0.9cents. There is a supermarket, a citibank, hsbc and banca santader a couple of blocks away.", "title": "Perfect combination of Home and Hotel", "user": "BrittanyNC", "date": "January 4, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23259071, "likes": {"liked": "— The personal touch. The paintings everywhere.", "disliked": "— Realization at night of close proximity to other guests' rooms due to small sounds."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008", "text": "Travelling to Argentina as a single female, I was looking for accommodation that provided me with: proximity to public transportation, an affordable rate, a comfortable room but mostly, a place where I felt safe and could interact with others.", "title": "Good, well-run B&B in B.A.", "user": "JulZ9000", "date": "December 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 22730367}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "Tango B&B provided me with all that and more. From the very first contact, I was put at ease by Valeria's prompt and professional replies to my queries.", "title": "An Artistic feel", "user": "Tsahih", "date": "December 12, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 22669838}], "location": {"country": "Argentina", "continent": "South America", "city": "Buenos Aires"}, "variance": {"poor": 4, "average": 1, "very good": 6, "terrible": 2, "excellent": 47}, "slim_ranking": 0.285106382979, "description": "Belgrano is a very traditional and special neighborhood of Buenos Aires. It combines last century houses with new buildings and modern facilities. \"Tango B&B\" is situated in this neighborhood. It's an Art Deco old house with modern comfort. Shops of all kinds surround it. Shopping malls, cinemas, restaurants, food deliveries, pizza places, pubs, discos, museums, showrooms and concert halls. We offer a warm and familiar staying in an authentic B&B."}