{"user_rating": 4.5, "review_count": 806, "name": "Tanjung Rhu Resort", "reviews": [{"rating": 5.0, "title": "Most amazing hotel ever!!", "text": "We decided on the Tanjung Rhu after much deliberation over our honeymoon destination. It was everything we wanted and more! The hotel is beautiful. Our room was amazing. The food was delicious. The beach was to die for! We also felt that it was not too busy. We had the pefect honeymoon!", "helpfulness": 16, "user": "Chrisam", "date": "July 19, 2006", "id": 5486772}, {"rating": 5.0, "title": "Glorious Place !!", "text": "I would advise those thinking of going to take the AI option as it worked out really cost effective.", "helpfulness": 19, "user": "A TripAdvisor user", "date": "July 17, 2006", "id": 5474714}, {"rating": 5.0, "title": "Just what the brochure said", "text": "You must visit this hotel, it is a hidden treasure!!", "helpfulness": 14, "user": "A TripAdvisor user", "date": "July 10, 2006", "id": 5448002}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "My wife and I stayed for 10 nights during the first 2 weeks of July at this wonderful place --- peace and quiet, glorious food and the most friendly staff. I gather that the low season is from Apr to Aug. So if you want to unwind, walk the 2.5 km sandy beach, swim in any of the 3 pools and eat lovely food -- this is the place for you. We booked a Std room", "title": "Peaceful, superb quality service", "helpfulness": 15, "user": "Bezzyt", "date": "July 6, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5431516}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "and it was plenty big enough. To really enjoy your stay you must take the all inclusive packge. It is definitely worth it. There are 3 restaurants, the Sands for Asian food, the Saffron for Mediterranean and the Rhu for fine dining. With the all inclusive package you can have lunch in either the Sands or Saffron and dinner in any of the 3 restaurants. Breakfast is served only in the Sands -- amazing choice of food and fruits.", "title": "Paradise!", "helpfulness": 15, "user": "cre13", "date": "July 4, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5423016}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Return visit to Tanjung Rhu was just as good as the first. Stayed in Damai room - lovely and spacious and clean - lovely big bath. Toiletries in the room are fabulous. Loved the oil burner that housekeeping set every day. Always loved the little chocolates delivered every night to the room - nice touch.", "title": "Perfect Yet Again", "user": "kelliejane02", "date": "August 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76757790}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Restaurants are just fabulous - The Rhu is my favourite , service is just top notch and the food is just amazing. And the setting/view is amazing..", "title": "relaxing paradise", "user": "jdbphoto", "date": "August 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 73227208}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Staff are so friendly and remembered our names which was just lovely. Pool area was nice and clean and service was great.", "title": "Staff were an asset to the hotel", "user": "honeymoonersJuly2010", "date": "July 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 72070584}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "Had a massage this time which was so nice and relaxing - the spa setting is great.", "title": "Pure Pleasure !", "user": "KLtraveller2010", "date": "July 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70574666}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "It was nice to be invited to meet management and other staff for drinks one night - thank you this was a nice touch.", "title": "An unexpected delight", "helpfulness": 1, "user": "ConstrucvtiveCritic", "date": "June 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 68405277}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "I can only echo all of the good points raised earlier. Stayed here for 1 week after a short stop in KL and absolutely loved it.", "title": "My favourite Place", "user": "marbielover", "date": "October 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82582921}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "The food, ambience, surroundings and staff (particularly Leni - hi x) made it my favourite place to date.", "title": "Unpretentious utopia- just like coming home!", "helpfulness": 1, "user": "MRTISLEE", "date": "September 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 79508293}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Our recent visit to Tanjung Rhu was our third and it really felt like we were coming home! The friendly resort driver met us at the airport after our effortless one hour flight from KL and whisked us into the serenity and tranquility of the Rhu that we have learnt to call home. Our Bayu Suria room was ready, and it even had a beach view and we were greeted by names, including the three children. Even though some staff were new, they made us feel very much welcome and at home. The front office manager, Az was very obliging when I asked if they was a possibility of an upgrade and he said he would try his best indeed. Although a seaview room was available just next door, we opted for the special complete beach view one even though it was smaller, but it was the special GM room. We chose to move in there only after two nights and stayed our remaining two nights sleeping on a bed that looked straight out into the aquamarine Andaman Sea. Sheer bliss!", "title": "Very Enjoyable!", "user": "Jane F", "date": "September 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 78061096}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "As we were on the all-inclusive package, it made everything so easy, especially with children. The food was scrumptious, with a choice of 6 eateries to choose from. Their mocktails are very interestingly-themed and all very delicious. Our kids ate very well! We ate at The Rhu restaurant twice, and the staff were all lovely. Leni remembered all our children. On our last day, being our little boy's birthday, they delivered a cheesecake with his name on it! How sweet was that?", "title": "Perfect relaxing oasis", "user": "Cateyed78", "date": "September 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 77804795}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "With over 110 acres, the resort didn't feel too big, but had just the right feel with around 100 rooms, which looked into the excellently well-tended verdant gardens or the beach. I didn't try the spa even though I am a massage fiend as just being there at the resort was relaxing and calming in itself. The gym has stunning views. All three pools are superb. Though the family Sunset pool was closed for a few days, the GM(a good man named Omar) personally ensured all guests that it would be repaired soonest and the adults' Sands pool was made available to all families until then, and it was huge enough that the honeymooners didn't mind at all. It's just such a friendly resort, without having to resort being a Club Meddy kind of place, no pun intended! The kids were occupied morning and evening without having to do set 'activities'- catching hermit crabs and collecting seashells, and walking on the sandbar were far more interesting,", "title": "My favourite tropical getaway", "user": "UK-OZ-SGP", "date": "August 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 76941029}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We stayed in the second week of Spetmeber for 6 nights, the hotel was quiet and we occasionally had the pools all to ourselves. I really don't know where to start to write this review other than to sum it up, when we were due to leave I literally had tears in my eyes, I could have cried a river I really did not want to leave. As everyone has said the staff are AMAZING!! I really didnt expect them to have such a huge impact on the enjoyment of our stay, we loved seeing Akil in the evening for dinner and the Azahari at reception was always so bubbly, the food and drinks were AWESOME!!! every meal we ate over the course of our stay was divine! We couldn't get enough of the mocktails and tried every one and some 3 or 4 times over :) The chocolates on the pillow at night were always nice to come back to, the sunsets are gorgeous!, the pools are beautiful, did I mention the food, OMG the food!!!!! Try the sweet chilli, mango and prawn/shrimp salad, or the mudcake...or well everything!!! Akil's banana flambe is delicious as well. We spent our evenings in the \"reading room\" relaxing, surfing the net a little to boast to friends how much we were enjoying ourselves, the spa and massages are fantastic as well.....just watch the sun even when you are in the shade, living in QLD Aus I am very careful to use sunscreen but was unaware that you can even get burnt in the shade in Langkawi, we were lucky to have great weather also. One thing you must do is go \"all inclusive\" if you had to pay for meals and drinks you really couldnt enjoy the full experience without having to constantly think about how much you were spending, the food and beverage prices are on par with expensive hotels. The good thing was when you did buy an alcoholic drink (which are reasonable) they don't skimp on the alcohol! I could go on and on about Tanjung Rhu but I think I have covered the basics....now all you need to do is book!!!!! (oh and feel free to pay for me to go again to while you're at it ;)", "title": "Heaven is a place on earth", "user": "GoingOS", "date": "November 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 87027886}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "This has to be one of the most beautiful hotels in the world,the setting is just gorgeous,the staff are incredible,the food is amazing...go all inclusive it is great value...what a place!", "title": "Paradise", "user": "pinkits", "date": "November 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85754388}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We (the wife and me) deliberately booked this stay so we could completely relax between visits to Singapore and Hong Kong. Tanjung Rhu fully met all our expectations.", "title": "Totally Relaxing.", "user": "ALFRED99", "date": "October 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 84724788}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "This is a \"get away from it all\" place so is quite isolated well away from any hustle and bustle and busy night life. Located on a northern tip of Langkawi at the edge of jungle and next to a beautiful long white curved beach with views looking out to the Andaman sea.", "title": "Relaxing beach resort", "user": "Peroket", "date": "October 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82948087}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "The resort is set in splendid gardens with a choice of restaurants, reading room/library, gym and spa, huge swimming pools, beach activities and access to internet if needed. Local town of Kuah is about forty minutes away by taxi.", "title": "A welcome chance to reconnect with beauty.", "user": "Rayna_Jhaveri", "date": "October 9, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 82697917}, {"rating": 5.0, "title": "Excellent", "text": "Excellent hotel with very high standard and good food. My husband and I went for All Inclusive but we struggled to eat enough to get our moneys worth since the food wasn't that expensive. We had dessert all the time, afternoon tea and appetisers etc but still hardly reached the amount per day that we had prepaid for all inclusive. Very good food. Service on the beach was excellent. Rooms were fine. Beach was great and it must've been the quiet season when we were there because you were never bothered by other guests or felt crowded. Not much around the hotel and not much happening in the evening, which was ok with us who just wanted to relax. One disappointment was the sea, there is a river who joins the sea not far from the hotel and the water wasn't crystal clear like we've hoped for. Stayed in many nice resorts around the world but we definetley liked this one but might not go back because we do like snorkelling etc and the sea wasn't clear enough for that but everything else was great.", "helpfulness": 6, "user": "Sunny123456789", "date": "September 17, 2006", "id": 5810316, "likes": {"liked": "— beach and food", "disliked": "— sea"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "The guy from Dublin below said it all... What a destination, for everything you want out of a holiday...!", "title": "Friendly, super food...pure relax!", "helpfulness": 10, "user": "SwedenRed", "date": "September 5, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 5771871}, {"rating": 3.0, "title": "Good but flawed", "text": "We went there for 2 weeks from 11thJuly to 25th July for a honeymoon from our home in Sweden, with our two 4year old children. Was a little apprehensive at first... with two little kids in a quiet paradise! No problems at all. Welcomed in by all the staff wherever we went, seemed like they all knew my kids names after one day... smiles, greetings, fantastic Staff! There was a very small number of other children, and my kids mixed well...", "helpfulness": 15, "user": "Carlwilliams", "date": "August 11, 2006", "id": 5598094}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Was worried about the weather, but rained about 5 times (sudden bursts of heavy showers)...then within an hour the sun was back out. One day the clouds coverred...but still ended up getting crisped.", "title": "Paradise for a Special Occasion", "helpfulness": 21, "user": "HolidayAid", "date": "August 8, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5577449, "likes": {"liked": "— That staff really did go out of their way to make your stay special"}}, {"rating": 5.0, "title": "Beyond your expectation", "text": "Food was excellent, as many on here have already mentioned. Out of the three, we preferred the asian restaurant. Also the in-room dining menu was excellent, and my 4 year olds loved nearly everything they were given. Also all three pools had there own menus,... ranged from snacks to a large plates. Breakfast was great also... Lots of variety and food was always fresh.", "helpfulness": 15, "user": "M-CC-Wong", "date": "July 26, 2006", "id": 5514327}, {"rating": 5.0, "stay_parameters": "Stayed March 2006, traveled as a couple", "text": "We booked this as a last minute getaway for some winter sunshine and were not disappointed. We had a dreadful trip to Malaysia and missed our connections in KL, but the driver from the Tanjung Rhu had waited 6 hours at the airport to collect us and soon whisked us away in air conditioned comfort to the resort.", "title": "Fabulous and relaxing beach vacation", "helpfulness": 15, "user": "Ghostie", "date": "October 18, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5966860, "likes": {"liked": "— The friendliness of the staff", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "Our room was very large and had a nice balcony overlooking the gardens. The staff were very friendly and helpful and took us on a tour of the resort, showing us everything that we needed to know.", "title": "Fantastic stay at the Tanjung Rhu", "helpfulness": 8, "user": "alicejt", "date": "October 17, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5963564, "likes": {"liked": "— Food, Service, room, EVERYTHING!", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We had opted for bed and breakfast for our stay, and I would recommend that for other travellers. Due to the heat, we would normally have breakfast and then not eat until the evening, starting with some pre-dinner cocktails. Over the course of our 8 day stay, dinner plus drinks, plus a couple of light lunches came to about £25 per person per day, which I think is a lot less than you would pay to upgrade to full board or half board.", "title": "Honeymoon paradise", "helpfulness": 16, "user": "CardiffManc", "date": "October 8, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5927774, "likes": {"liked": "— Everything!", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We stayed around the resort most of the time we were there. We did a cycle trip with one of the staff which took us up to the waterfall. It's a recommended trip, but due to the heat and the humidity, you need to be fit to do this. We also visited one of the staff member's homes for supper one evening, which was great.", "title": "Excellent", "helpfulness": 9, "user": "Mitsl200", "date": "September 22, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 5822164}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The staff are very friendly and welcoming. We had a magical time at the Tanjung Rhu. I would also recommend the reflexology treatment at the spa if you want to be totally blissed out!", "title": "Wonderful!", "helpfulness": 14, "user": "AusJez", "date": "September 21, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 5824014, "likes": {"liked": "— Friendliness of staff, all inclusive package, pools, food", "disliked": "— Make sure you do the mangrove adventure, bargain hard for rental cars at airport!"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "After a week at Pangkor Laut, we travelled to Tanjung Rhu. It is unfair to compare as they were two different experiences, and Pangkor Laut is very unique and special, but obviously comes at a price. It took us a few days to get used to the layout, (slightly odd), but nether the less, we got used to it. The food was great, a real selection, and we never had a bad meal. The people were so so friendly, I was adressed by both christian and surname by some! They all wanted to chat and everyone greeted you. By the pool, we were offered cool mint towels and fresh fruit daily. The beach was nice to walk, but very littered at the ends that were not attended to by the hotel. The rooms were very tired, the decor and furniture needs updating. We went on the Mangrove Adventure (which I really recommend) and Zoher was amazing! That guy is so knowlegable and really made the trip, spotting wildlife way in advance, a great trip.The only downer on the week was our visit to the Rhu Restaurant. On arrival we were refused entry because although I had a long dress on, I was wearing 'dressy' flip flops and my husband although wearing long trousers and shirt had leather sandals. So we went back and he changed into leather shoes and me heels, no problem, rules is rules. However, a couple were granted entry with beach flip flops and sandals. So it must be one rule for all. We did highlight this to the staff, and he agreed and was apologetic. I think the literature needs to be clearer, because on reading it, it says no slippers, and that means something different in my vocabulary. This aside it was a very enjoyable relaxing week and we were very sad to leave, Thankyou to all the lovely staff", "title": "So, So Friendly....................", "user": "Tracy156", "date": "June 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 68147325}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Amazing Resort...the staff as polite and very helpful...we have just got back from our Honeymoon. The resort was quite during are stay so it was a dream...they met are special dietary requirements and very help through out our Stay..would recommend to anyone...liking to visit again ourselves...The room service manager even came to", "title": "Paradise...", "user": "Chopperchand", "date": "June 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 66723392}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We stayed here the last week in May 2010. We had gorgeous weather all week and hardly left the sunlounger. Brief thunderstorm on last day but the rain comes and goes very quickly. We sat it out in the swimming pool!", "title": "Gorgeous setting (but prepare for mosquitos!)", "helpfulness": 1, "user": "EnglishJo", "date": "June 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 66503199}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "The hotel is set on a gorgeous sweeping beach. Lovely to stroll along in the late afternoon and evening. At certain times of the month a sandbank appears off the shore and you can walk all the way out to the rocks/island in the pictures. Really nice natural twist - we were lucky to have this during our week.", "title": "Total Paradise", "user": "LauraC82", "date": "June 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 66325690}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "3 restaurants (The Sands = asian, Saffron = mediterranean, The Rhu = fine dining). Saffron is lovely, out on the deck by the beach, no strict dress code (men can get away with shorts which is rare in 5* hotels). Slightly strange menu - all in pictures!", "title": "Best hotel we've ever stayed in.", "user": "cdd101", "date": "May 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65754417}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "My husband and I have just returned from a 8 night stay and I can say without a doubt that it was the best holiday we've ever had. From being collected at the airport, to the in-room checkin, amazing food and comfortable rooms. We loved every second and will definately be returning. We stayed in the Bayu Suria room which overlooked the lagoon pool on one side and gardens, Sunset pool on the other. We were all inclusive and I would recommend this as we enjoyed the food so much we ate constantly. (I can highly recommend the bruschetta at The Saffron, I had it three times. )", "title": "Paradise", "helpfulness": 17, "user": "Diro", "date": "November 25, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6175146, "likes": {"liked": "— The food and beach.", "disliked": "— Having to leave."}}, {"rating": 5.0, "title": "Loved every aspect - staff, location, facilities and value for money", "text": "The staff are very friendly and can't do enough to help you. One of the things we loved was that they quietly slipped the acitivity schedule onto your bed with chocolates and an orchid and there was no pressure to join in on any activities.", "helpfulness": 5, "user": "WorkNPlayHomenAway", "date": "November 19, 2006", "id": 6153336}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "My husband's only complaint was that there wasn't in room internet access (although there are two computers for access near recption) but as I kept reminding him, he was supposed to be getting away from it all.", "title": "A fantastic honeymoon at the Tanjung Rhu", "helpfulness": 8, "user": "Upwaltham", "date": "November 5, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6059020, "likes": {"liked": "— the room and the choice of 3 pools", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "We will definately be returning to the Tanjung Rhu. They make you so comfortable that although I normally get bored on beach holidays when my eight days of bliss was up, I didn't want to leave. We met a couple whilst we were there who were on their eigth visit and said it perfectly \"Once you find paradise, why keep searching.\"", "title": "Fantastic honeymoon", "helpfulness": 5, "user": "Indi-Sanj", "date": "November 2, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6045181, "likes": {"liked": "— The comfort of the rooms", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2006, traveled as a couple", "text": "This was a last minute booking for Xmas 2004 as we were not able to get many of our first choice desitinations. Wow, what a great choice as all the others at many SE Asia destinations we picked were hit by the Tsunami.", "title": "Pretty Good - excellent facilities", "helpfulness": 5, "user": "Shlapa", "date": "October 24, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6008244}], "location": {"country": "Malaysia", "continent": "Asia"}, "stars": 4.5, "variance": {"poor": 23, "average": 30, "very good": 159, "terrible": 19, "excellent": 575}, "aka": "Tanjung Rhu Hotel Langkawi", "slim_ranking": 0.0729166666667, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Tanjung Rhu Resort, nestled in the shade of casuarinas over 2.5km white sandy beach, is one of Asia’s finest boutique resort renowned for its scenic views, impeccable service and gourmet fine dining. This is a place for romance, privacy and tranquility. The 136 luxurious suites Tanjung Rhu lies at the northern tip of the Langkawi island of Malaysia."}