{"user_rating": 4.5, "review_count": 168, "name": "Te Waonui Forest Retreat", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "This is one place that is really out of the box. I cannot think of one bad or slightly bad point. The rooms leave nothing to desire and we were welcomed with a bottle of wine in a cooler in the room. The beds are turned down with a treat on the pillow. The restaurant while slightly on the expensive side is 5 star without even trying. Staff are most helpful and friendly in a polite way.", "title": "Superb", "helpfulness": 1, "user": "Roger542", "date": "February 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124745286}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "I have stayed 5 star in Amsterdam, St Petersburg and Oslo (to name just three locations) and this Retreat is up there with them, or even past them.", "title": "Excellent- 5*", "user": "GordandSteph", "date": "February 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124575579}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "It is a credit to the management and staff.", "title": "Absolutely Perfect - 5 Star", "user": "Rahul_36_Sarawgi", "date": "February 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 124512831}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Unfortunately only stayed here 1 night. Everything was perfect- staff, rooms food and location. The toy 'speaking' kiwi are the best value here and the sale helps their cause.", "title": "Share a weekend here with someone you love", "user": "Peter J", "date": "February 12, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 124491123}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Stayed here for a night during my honeymoon trip and i still regret of not staying here for long. This hotel is absolutely perfect. Rooms are gorgeous and staff is helpful and friendly. The hot pools and booking centers for glacier flights and glacier walks.. everything is at a walking distance. The private sit out area of the room was nice and an excellent place to have the morning tea. The bathroom has a bath tub and shower cubicle both with heated floor and towel rod. In the morning breakfast we could not find anything good for ourselves as we are vegetarians so the chef prepared something specially for us and the taste of which was just unforgettable.", "title": "Superb, 5 star service", "user": "Sarah C", "date": "February 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124327691}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "This hotel is OK until you think what it could have been. A fairly new property, the Forest Retreat nestles into a rain forest with, potentially, great views of the nearby mountain peaks. Unfortunately it has been built so that the bedrooms and most of the public rooms are dark and gloomy with not much of a view of anything.", "title": "Opportunity Missed", "helpfulness": 1, "user": "Rover10", "date": "February 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 125330081}, {"rating": 5.0, "title": "Just too good", "text": "We used this hotel as a stopover on a long west coast drive which exposed the other problem with this hotel - the restaurant. Not feeling like searching for a restaurant we had dinner in the hotel and were presented with a \"5 course taster menu\" with no alternative. The chef is clearly on an ego trip and designed elaborate nouvelle cuisine dishes totally inappropriate to the setting or, I suspect, to the taste of most of the clientele.", "helpfulness": 1, "user": "Colint50", "date": "February 27, 2012", "id": 125265194}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Saving graces: 1. It's a 5 minute stroll to pleasant hot tub facilities; 2. A very quiet location affords a good night's sleep.", "title": "Wonderful service!", "helpfulness": 1, "user": "FAW473", "date": "February 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125120751}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled solo", "text": "One more thing - I really worry when hotels actively seek Trip Advisor recommendations (which this one does at check out) and use T A for marketing.", "title": "Kick a__!", "helpfulness": 1, "user": "smallbirdNewYork", "date": "February 23, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 125061804}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "This resort room was fantastic", "title": "Great Hotel & Location", "user": "brannri", "date": "February 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124838811}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We were on a three week tour around New Zealand and were lucky to stay one night (unfortunately not more) at Te Waonui Forest Retreat in Franz Josef, Westland NZ. A warm welcome by the very friendly and highly professional staff, a luxury room with a great view on the rain forest and last but not least an outstanding 5-course-menu in the excellent restaurant \"The Canopy\" made our stay a memorable event. We will be back on our next trip to New Zealand. Keep on your way folks at Te Waonui, you are our no 1, thanks a lot!", "title": "Don't dream about the perfect hotel, come here!", "user": "ZPS", "date": "January 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123287413}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Met on arrival with hot towel and iced tea, after a long day's drive: staff could not do enough to look after us. The premises are well located and next to the Hot Bath Spa.", "title": "Attentive service, delightful retreat, wonderful bed", "user": "AlbertSolihull", "date": "January 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122801846}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Overall, this was a wonderful experience and a revival after a long journey. Our two day stay was not long enough.", "title": "A Special kind of luxury", "user": "Southdown_Man", "date": "January 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122797045}, {"rating": 4.0, "stay_parameters": "Stayed January 2012", "text": "The premises are located in tropic like gardens, which our room, a deluxe one with balcony, overlooked. The bed was amazingly comfortable, with a quilt topper, making it very relaxing.", "title": "Not quite what we were expecting!", "user": "RHONDA48", "date": "January 5, 2012", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 122635325}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Dinner was included in our package, which was a five course degustation. However, you need to take time for it: our dinner took two hours. There were some very interesting dishes.", "title": "Best hotel experience in NZ", "user": "cc_traveller_2012", "date": "January 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 122488453}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Great staff, good food, and very comfortable rooms, right on the doorstep of the Franz Joseph Glacier.", "title": "Out of the ordinary, top draw.", "user": "ynotcracker", "date": "February 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124143550}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We arrived to a warm welcome and a cool iced tea at Te Waonui. It is right in town but feels a world away. It is a fairly large property but has been carefully designed to fit well into the environment. Our room was at the back of the hotel facing the rain forest. I think most of the rooms are designed to look into rain forest and thus privacy, but ours certainly filled that bill. The room was very nice, but it is just a room with a nice bath, bar area, desk area, and lanai with table and chairs (privacy screen from the neighbors). There was a welcoming split of champagne, brownies, cookies, and kiwis - nice welcome, indeed!", "title": "welcoming retreat in the rain forest", "user": "divegirlelaine", "date": "February 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 124125317}, {"rating": 3.0, "title": "Service was disappointing for \"luxury boutique hotel\"", "text": "We had the 5-course degustation dinner and ate early and did not encounter crowds. The food was very good and the service attentive. There was a huge buffet breakfast the next day, with lots of good choices: eggs, potato cakes, bacon/sausage, salmon, fruit, pastries, cereals, juices, blood pudding sausage!", "user": "A TripAdvisor user", "date": "January 30, 2012", "id": 123816884}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Hotel was nice enough to allow us a late check-out after we returned from a help-hike (reviewed separately).", "title": "pleasant enough hotel but very disappointed with what we got for the priced. Save your money for some trips", "user": "jumbobelle", "date": "January 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 1.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 123697814}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled solo", "text": "We were quite pleased with our stay at Te Waonui", "title": "Absolutely Amazing!", "user": "barbrajay", "date": "January 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123373225}], "location": {"country": "New Zealand", "region": "South Island", "continent": "South Pacific"}, "stars": 5, "variance": {"poor": 4, "average": 18, "very good": 37, "terrible": 2, "excellent": 107}, "aka": "Te Waonui Forest Retreat Hotel Franz Josef", "slim_ranking": 0.125, "description": "Luxury Hotels in New Zealand don't get any better than this! Nestled amongst native West Coast rainforest at Franz Josef is a very special five-star Qualmark rated retreat. Designed with utmost care of its precious environment, guests at Te Waonui Forest Retreat will find themselves encircled by rainforest and accommodated in natural and sustainable luxury. Te Waonui Forest Retreat promises all its guests a truly unique and memorable experience. At one with nature, the five-star Qualmark rated Te Waonui Forest Retreat is the ultimate coming together of luxury escape and environmental awareness. Great care has been taken to ensure this exceptional forest retreat steps lightly upon the earth, from the organic cotton bedspreads to its recycled local building materials. Discerning travellers will appreciate the hotel’s attention to detail, which starts with attentive personal service upon arrival, and continues throughout all the hotel facilities and every aspect of your stay.As our guest you will enjoy exceptional quality and service, including: Luxuriously appointed guest rooms, generously proportioned and featuring the highest standard of room amenities, such as your personal pillow menu, natural wool mattress underlay, and high speed Internet access. Dining among the tres in ‘The Canopy’ restaurant, and savouring quality local cuisine, including an indulgent five-course degustation dinner. Innovative, environmentally sustainable architecture and building materials that create a healthy, warm and quiet haven for you to enjoy. Easy access to many excellent local attractions, including the Fox and Franz Josef Glaciers, just minutes away."}