{"user_rating": 4.0, "review_count": 3116, "name": "Temptation Resort Spa Cancun", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "this place has been remodled since i was ther 2 years ago i think a storm hit it and it was called blue bay getaway then. it was a blast you didn't have to get all dressed up to party at night. it was really for adults only i liked not having kids around on a vacation. so i'm going to go back ther this summer. this will be my 4th time in this resort. lots of fun.you are not that far from the shopping district. just hop on a bus. also you can take walks down the beach for quite a way. we went to down town cancun in about 5 minutes by taxi.", "title": "wild crazy people but fun", "helpfulness": 1, "user": "toyterrier", "date": "February 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 57013323}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "I had the best time at this resort. It is small enough that u dont spend half ur day walking around the resort. I have nothing bad to say about this resort. All different types of people, couples, singles and swingers. Young and old. Everyone was there to have a good time. The motto. \"No one knows u and no one gives a [--]!! I met so many people and danced around the pool like no one was watching.. It was a crazy party during the day that continued on into the night.. The nightly entertainment ended early but they did provide transportation to clubs. Coco Bongo I highly recommend. Amazing show, and they take care of u.. The buffet was awesome, Always something different to eat, drinks were not watered down, it was all round great time. Get to know ur bartenders. Money always talks! I cant wait to return next year and hope the vibe is still alive. The beach has a marina right next to it so u see boats coming and going. There is also a quiet pool to relax at and soak up the sun..", "title": "BEST VACATION EVER", "user": "rebelicious", "date": "February 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57001510}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The room was good, no tub just a shower, I think they have some time share thing they try to get u to sign up for and the members only get those rooms. If u want to go party this resort is for you! Its all about the people that u meet there. Staff was always friendly and helpful. Keep an open mind and u will have the time of your life!", "title": "Outstanding", "helpfulness": 2, "user": "Ga24Fun", "date": "February 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 57000111}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Arrived before check in time, to be greated and treated to a room upgrade to an Ocean side suite, which was a pleasent surprise. The room was great, had a nice view of the ocean, and was situated well enough away from the activities that it offered some privacy when needed. The room was immaculanty cleaned every day.", "title": "Top notch service, food and beverage, atmosphere", "helpfulness": 2, "user": "TNTBuffalo_NY", "date": "February 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 56986943}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "The resteraunts on the resort offered enough to satisfy the taste of anyone, and the food quality and service we found to be outstanding also.", "title": "We have had a timeshare here for 25 years.", "helpfulness": 2, "user": "hiinthesky", "date": "February 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 56889216}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Let me just start out and say that this resort is not for single guys. I think what happens is they see the name Temptation and it is for adults only and they get excited. There were groups of single guys and maybe one group of single females. There is topless women at the pool and most of them are with husbands or boyfriends, the single guys see the women and the games during the day and it like seeing a brand new corvette on a car lot and not being able to take the car for a test drive. I was single at one time and would not want to have to go thru the pain that the single guys go thru at this resort. Great resort for couples that want to have a great time and have adult college like parties. This place is not for the prudes and the people that go to this resort are the ones that make it fun along with the entertainment staff. If you enjoy having fun and meeting fun people then this is the resort for you. I'm just warning the single guys that if they like 35 single guys to one single girl odds then book a trip. WE love this place and will be back again.", "title": "Not for single guys!", "helpfulness": 5, "user": "topknob27", "date": "February 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 57386837}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "I've been going to this resort for 4 years and it's only improved over the years. If you're looking for a great atmosphere, laid-back and just plain fun, I highly recommend this resort. Not only is the beach and pool nice, the food is excellent, drinks are always good and the resort is well maintained and staff are awesome. They offer tons of different entertainment, an open atmosphere, so everyone feels comfortable and not pressured. The poolside games at the sexy pool are hilarious if you dare to participate and now they have a Miss Temptation Contest which is organized like a Victoria's Secret show! I am Miss Janaury 2009 and won a free trip back for two and got treated like V.I.P. while we were there. I can't stress how fun this place is....", "title": "Awesome Fun!", "helpfulness": 2, "user": "MissJanuary09", "date": "February 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57343421}, {"rating": 1.0, "stay_parameters": "Stayed January 2010", "text": "Arrived around 1:00 p m Feb 21, 2010 and was told they were 30% overbooked and told we had to stay at Blue Bay Resort (20 minutes away in the slum area) the first 2 nights of our 5 day stay. Manager was too much of a coward to deal with us and let a desk clerk break the bad news. Met several people at Blue Bay that were sent there by Temptations staff.", "title": "Reservation made in August 2009 but forced to another resort 1st night!!", "helpfulness": 2, "user": "Mikey1007", "date": "February 28, 2010", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 4.0}, "id": 57342004}, {"rating": 2.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Absolutely horrible!! Ruined our entire vacation.", "title": "BEWARE!!!!", "helpfulness": 5, "user": "MEDWAY23", "date": "February 26, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 2.0}, "id": 57198272}, {"rating": 5.0, "title": "Excellent Honeymoon!!!", "text": "<my husband and <i are at the temptation resort on our 30th anniversary. Went to check in and were told our room was NOT available. <hotel overbooked by 25 rooms. <We are told this is a common practice to select certain customers that booked at Temptation Resort and are sent to their sister hotel, Blue Bay Resort, which is not in a good area, 25 minutes away through the ghetto. We are forced to stay in this other hotel for 2 nights.<<<<<<<our 5 day get away has now been turned into 3 days due to their poor business management. <if you want more details about our vacation, feel free to call my cell at [--] Bob", "user": "gidget2410", "date": "February 25, 2010", "id": 57048023}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "We travelled with a group of 6 randing in age from 33 to 47, we all like to have fun enjoy a few drinks this place was fun, never seen any swingers if you are a prude stay home, yes there is toppless women and you take the good with the bad same everywhere.", "title": "FUN FUN FUN", "helpfulness": 1, "user": "chgra", "date": "February 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 56856843}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "The food was always good. Never turned anything away, the reservation set up isn't the best,", "title": "The BEST hotel. Ever!", "helpfulness": 1, "user": "lcsaar", "date": "February 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56713447}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The rooms were nice, one couple we were with was in a different building then us and there room wasn't as nice at all there was a window from the bedroom looking into the toliet they asked to be moved and with no problem they were moved with us and had a really nice room,", "title": "think twice about this resort", "helpfulness": 2, "user": "nkparie", "date": "February 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 56675699}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "The bars were always good, had lots of drinks and always a waitress around the pool side and yes if you tip you get better service, They same at any place you go to in Canada, don't be so cheap bring some ones with you.", "title": "Lots Of Fun", "helpfulness": 2, "user": "GiantsfanVancouver", "date": "February 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 56532440}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Always lots of activities going on around the pool, no one makes you join in always fun to watch. We never left the resort to go bar hopping, we always had to MUCH FUN in the afternoons usually in bed by 11 and already to do it again the next day.", "title": "Awesome resort!", "user": "cdawg28", "date": "February 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 56315099}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "We were a little unsure of what to expect at this \"risque\" resort, but it wasn't anything too ridiculous! Everything was done in good fun, and you definately laughed all week if by the Sexy pool. If the entertainment is too much for you, there is plenty else to do (Quiet pool, beach..) The food was fantastic, both buffet and A la Cartes. Rooms were clean and modern. Our only problem was our room was above the disco, so from 9pm on it was a little loud, but most of the week we were out! Plenty to do on the resort, or excursions. Felt safe to take cab right from resort door to Market 29 ($10 US).. Lots of merchants and good deals for souveniors. Lots of night life, close by for same cab rate. Cabs are always out waiting to take you back to resort. Coco Bongos was a great show! There was always something going on at the resort at night too, so if you don't want you don't have to leave. Definately plan to go back!", "title": "Great resort for the young and young at heart!", "helpfulness": 1, "user": "TRVLVR1", "date": "February 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 56313821}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "Canadian Girls", "title": "Amazing", "user": "ChrisCollins", "date": "February 16, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56169170}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "The trip was amazing ... the rooms where done just right ... The food amazing and u could do all the ala carts no problem.. Every one was great ..except one server at the", "title": "A Great Time, Will Go Again", "user": "Happydog3", "date": "February 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 55997835}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "O 'paddys bar..he would not serve me at anytime ..not sure what his problem was..and do not really care ...we did use the quiet bar and the service was amazing and the best drinks ever..and fun ..not so quiet if u love having fun and meeting people. One major", "title": "Great Time - Can't wait to go back", "helpfulness": 1, "user": "nugget1", "date": "February 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55896729}, {"rating": 2.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "problem i did have was they took my patio set near the end of the week..I am a smoker and like to sit out on the patio at night ..they did not return it nor did they even apologize I found that to be very rude and not good service .. to sneak in and take it upset me alot..", "title": "Poor service and not as advertised...", "helpfulness": 4, "user": "201DB", "date": "February 13, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 2.0}, "id": 55875336}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 3.5, "variance": {"poor": 228, "average": 345, "very good": 1002, "terrible": 201, "excellent": 1340}, "aka": "Temptation Hotel Cancun", "slim_ranking": 0.0666666666667, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "The 384-room Temptation Resort Spa welcomes singles and couples to a hip and sexy take on the all-inclusive holiday. The topless optional, over-21 atmosphere gets you invigorated and refreshed. Amenities include three swimming pools each with a different theme (action packed, relaxation and sports), Jacuzzis, beach, five restaurants, six bars, fitness center, spa, beauty salon, nightly entertainment, room service, 24-hour meal service and daily activity programs."}