{"user_rating": 4.0, "review_count": 508, "name": "Terrass Hotel", "reviews": [{"rating": 5.0, "title": "Terrific Terrass", "text": "My wife and I had an excellent two nights at this hotel for our wedding anniversary.", "user": "Blackstone", "date": "September 19, 2006", "id": 5815427}, {"rating": 4.0, "title": "Nice but expensive", "text": "We had a basic room, but it was tastefully decorated, had a large, comfortable bed and great roomy bathroom. There was no view as it faced onto an inner courtyard, but this made it very quiet.", "user": "Graceloves", "date": "September 14, 2006", "id": 5799742}, {"rating": 3.0, "title": "Sour taste - Nice, but overpriced", "text": "The whole of the hotel was spotless and very well maintained. We decided not to eat or drink in the hotel, preferring the atmosphere of the bars and restaurants in adjoining Montmartre.", "user": "jclayton9", "date": "August 31, 2006", "id": 5731385}, {"rating": 5.0, "title": "Great hotel with Character", "text": "The location of the hotel is terrific and, although quite expensive, we would thoroughly recommend it for a short break.", "user": "2Adults2Kids", "date": "August 28, 2006", "id": 5716773}, {"rating": 5.0, "title": "Marvellous Montmartre", "text": "We booked a double room at this hotel with airmiles and our friends booked a junior suite. Our room was on the fifth floor and had a wonderful view of Paris and the Eiffel Tower. However, I was a bit disappointed with it, the decor was predominately red and could have been any airport hotel and the bathroom was very small and you had to stand in the bath to turn the taps on. The hotel is on a busy corner and I did think it might be noisy but I didn't hear traffic noise at night only the noise of the TV in the next bedroom. Our friends had a much nicer room but they had paid a lot more for it. Our deal included breakfast which was nice. We ate on the top floor terrace one night and it was quite good and a fantastic view but again very expensive for simple French food which you could get for half the price down the road at any local restaurant.", "user": "viczam", "date": "August 21, 2006", "id": 5631233}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Very nice room, not huge but we have stayed in smaller 4* hotel rooms in London.", "title": "Don't assume that you will be able to have dinner here.", "helpfulness": 1, "user": "LaurieEngland", "date": "July 11, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 2.0, "rooms": 4.0}, "id": 8100606, "likes": {"liked": "— Nice room", "disliked": "— Not being able to eat in the hotel restaurant for three of the four evenings we stayed there"}}, {"rating": 4.0, "title": "Very Pleasant Stay", "text": "We had dinner in the hotel restaurant on the first night of our 4 night stay. The food was fabulous if a little expensive. We decided that we would economise on our lunches out and eat in the hotel restaurant every evening. We attempted to book for the next evening and were told that they were full for the next two evenings and closed on Sundays. This was not actually true. they closed for three evenings. So we were staying in a 4* hotel but unable to eat there in the evenings.", "user": "isladuffy", "date": "June 25, 2007", "id": 7986535}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We had booked for breakfast, and, after reading reviews here I was interested to see if we would be offered a cooked breakfast. The earlier comments were correct. It seems to be a closely guarded secret that a cooked meal is available. We were told 'it's a buffet'. I said \"actually we would prefer a cooked breakfast\". This was immediately agreed to. I asked for bacon scrambled eggs and tomatoes. They had run out of bacon (9.15 a.m.) but offered sausages instead. The food was beautifully cooked and presented. The weekend morning staff were very obliging but again no offer of cooked food was made, but quickly provided when we asked for it.They ran out of bacon on Monday too. How strange to do that twice in four days, but the sausages were an excellent replacement.", "title": "Amazing junior suite", "helpfulness": 3, "user": "1884", "date": "June 19, 2007", "detail_rating": {"front_desk": 2.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7935625, "likes": {"liked": "— The junior suite with steam shower, air conditioning, mood lighting made for a very romantic experience", "disliked": "— The extra charges on check-out"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Food was very disappointing in the other places nearby.", "title": "Glad we chose the Terrass Hotel!", "helpfulness": 7, "user": "NorwichJackal", "date": "June 11, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7833561, "likes": {"liked": "— Location and hotel cleanliness", "disliked": "— size of the bath and no shower hook!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "We were not told that the hotel restaurant sometimes opens for lunch. If we had known we could have had a leisurely lunch after checking out while we waited for the time for our eurostar journey back. Instead we sat at a pavement cafe in a torrential thunderstorm eating Italian food. There is no way of walking into the restaurant at the moment without leaving the building and coming back in a door further down the road because work is being done to the passageway through.", "title": "Superb Service", "helpfulness": 1, "user": "audies", "date": "May 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7683568}, {"rating": 5.0, "title": "great weekend break", "text": "We had a brilliant weekend at the Terrass Hotel, stayed in a lovely traditional suite, room 605, with excellent views over Paris. The king size bed was great, and we slept well, thanks to double glazing and the shutters.", "user": "Regular_site_user", "date": "July 26, 2008", "id": 18267166}, {"rating": 5.0, "title": "Great Place, good location", "text": "The hotel is in a brilliant location in the middle of Montmartre with lots of great bars, restaurants, and small shops. We were disappointed by breakfast there though.", "user": "Dovaroma", "date": "July 20, 2008", "id": 18060004}, {"rating": 5.0, "title": "Lovely Montmartre hotel", "text": "The Hotel Terrass was perfect for our one night stay, - my daughter and I arrived late afternoon after booking online - the Receptionist was very friendly and we were soon in the lift on the way to our room, (416). As soon as we opened the door the room looked very luxurious, decorated in blue and yellow with a large glass table & chairs, kettle & hospitality basket. The en-suite bathroom was lovely, with two sinks, corner bath / shower & separate toilet. Ample towels and lovely complimentary toiletries. Electric shutters and air conditioning (although this was a bit noisy so we turned it off!) - our accommodation was very spacious and comfortable.", "user": "Fluffychuffy", "date": "July 16, 2008", "id": 17942411}, {"rating": 5.0, "title": "Definitely worth the upgrade to a suite", "text": "Breakfast the following morning was in the restaurant downstairs, you can choose where you sit, and tea or coffee is served to your table. We took from the buffet - bread, coissants, pain au chocolates, ham, cheese, yoghurts, fresh fruit & orange juice - a hot breakfast was also available if you prefer something cooked.", "user": "Pleasure2holiday", "date": "June 21, 2008", "id": 17098747}, {"rating": 5.0, "title": "Lovely hotel, terrific location", "text": "The Terrass is within easy walking distance of The Moulin Rouge, and the Sacre Coeur / Monmatre. There are many cafes and bars within a 5 minute walk - however our room was very quite and we were not disturbed at all during the night.", "user": "clobella", "date": "May 29, 2008", "id": 16494570}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled solo", "text": "Generally, I don't write online hotel reviews, but my stay in the Terrass Hotel moved me to provide my positive feelings about it. The Terrass is located nicely near two metro stations, various restaurants and other ammenities. The room that I stayed in was furnished just as they show in the pictures but was a tad warm (not too sure why). The bathroom and its steam bath was great and could have been the highlight of my stay in Paris had I not traveled to see the various sights of the city!", "title": "Great time in the Terrass Hotel", "helpfulness": 1, "user": "romalovainzambia", "date": "May 11, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7587270, "likes": {"liked": "— The size and decor of the hotel rooms.", "disliked": "— The hotel food was expensive."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "Nonetheless, perhaps what made my stay all the more enjoyable was the fact that the staff was so knowledgeable and helpful in assisting me. Whether it dealt with re-arranging flights or helping me to buy flowers, the staff was great and went out of their way to help.", "title": "Highly Recommended", "helpfulness": 2, "user": "AndrewDavis", "date": "May 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 7565755, "likes": {"liked": "— Excellent service", "disliked": "— Small stuffy bedroom but we opened the window and it was fine - and the bed was really comfy"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "I would definitely stay at the Terrass Hotel when I return to Paris and would recommend it to others, as well.", "title": "Very good service", "helpfulness": 3, "user": "michaelj2", "date": "April 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7394160}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We have just returned from a weekend stay at the Terrass and thought it was really excellent. We had two interconnecting rooms as we went with our 3 children - the kids' room was enormous, our room not very big but still very comfortable. The bathrooms were also both well appointed and equipped. The concierge was extremely helpful as indeed were all the reception staff. I had the misfortune to break a piece of furniture by accident which was all very embarrassing, but they could not have been more helpful. As we were so exhausted at the end of the first day, we did not want to go out for a meal and just wanted to collapse into bed. We ordered room service, and found the standard to be superb, if a little pricey. One other thing we found useful was the kettle, with tea and coffee sachets which I thought were only provided in English hotels. They were extremely welcome.", "title": "Great location, great hotel, great price!!!", "helpfulness": 6, "user": "MutleyDog", "date": "April 8, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7292488, "likes": {"liked": "— Cant believe it cost so little to stay there!! 5* at 3* prices!!", "disliked": "— Nothing bad at all!!"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The location is very good for exploring Montmartre and is very close to Place de Clichy station on the Metro. All in all we had a fantastic if completely exhausting weekend, would definitely stay in the Terrass again and would recommend it to anyone.", "title": "Quaint, charming and absolutely PERFECT", "helpfulness": 5, "user": "BBowden", "date": "March 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "business": 4.0, "cleanliness": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7239341, "likes": {"liked": "— The view!", "disliked": "— Bed was not the most comfortable, but not terrible."}}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "After reading reviews of the Hotel Terrass on trip adviser i decided to try it out for my girlfriends christmas present and our stay was absolutely fantastic.", "title": "Fantastic Hotel", "helpfulness": 10, "user": "bullitpromotions", "date": "January 27, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4392002}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "We stayed in one of the Deluxe Superior rooms and it was brilliant, the bathroom had a steam shower which was great after a days site seeing and then a long night of alcohol.", "title": "Well located and welcoming", "helpfulness": 15, "user": "NJ_Voyageur", "date": "January 2, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4317958}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "We definitely felt well looked after, Danielle on reception sorted us Moulin Rouge tickets for that night with only 5 hours noticed and we were given great recomendations on what to do.", "title": "Great hotel in a great location", "helpfulness": 16, "user": "Gryphon_abroad", "date": "October 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4056053}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "The restaurant attached to the hotel was really great as well.", "title": "Fantastic service, fantastic room.", "helpfulness": 8, "user": "Zarafa73", "date": "October 25, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4051223}, {"rating": 4.0, "title": "Nice little 4 star in Paris", "text": "This little hotel deserves its 4 stars: great location in walking distance (albeit up steep hill!) from Montmartre in one direction and place de l opera via the Pigalle in the other. Clean and comfortable, roms on the small side but adequate; great views from some but not others so be sure to ask when you book. Fabulous views from the little terrace restaurant on the roof, although the food was very arty and left us all hungry! Cosy bar area on ground floor and good service from both bar and concierge staff. They like it if you speak french but are all happy to speak english if necessary.", "user": "KJHlincs", "date": "May 24, 2008", "id": 16359539}, {"rating": 5.0, "title": "the wonderful Terrass Hotel", "text": "My mother and I have just returned from a glorious week in Paris. We stayed in Montmartre, at the Terrass Hotel, known for its stunning rooftop view of Paris. The hotel was lovely and very clean. The staff, including the Concierge Madame Daniele, Nicolas, Guy and Yves were all kind and helpful. The location was terrific. We felt like we were on top of the world (and we were, overlooking the incredible 'City of Light\"). I wholeheartedly recommend the Terrass Hotel, and a visit to Paris, to anyone interested in the finer things in life: beauty, good food, art, music and the sublime world of France.", "user": "madamew", "date": "May 11, 2008", "id": 15935490}, {"rating": 2.0, "title": "Once was enough.", "text": "We made our decision to stay here after seeing their website. Totally misleading. This hotel is a 3 star, not a 4 star. Hotel reception not very friendly. Some staff members were friendly, but it wasn't their regular attitude.", "user": "luvfortravelling", "date": "May 1, 2008", "id": 15524335}, {"rating": 5.0, "title": "A lovely well run hotel with warm friendly and welcomng staff", "text": "At 2 am, a group of drunk guests started singing along to Karaoke really loudly. We called the reception 3 times to complain. They kept saying 'We will see to it, sir' every time, but nothing really happened.", "user": "lugsy", "date": "April 24, 2008", "id": 15297489}, {"rating": 4.0, "title": "nice retreat and excellent location", "text": "It really ruins the good vibe you picked up from touring beautiful places during the day.", "user": "Guido1974", "date": "April 21, 2008", "id": 15180802}, {"rating": 4.0, "title": "Good hotel all round", "text": "This is a very attractive hotel. It scores on all fronts (we didn't try the restaurant). Staff are friendly and speak good English and also put up with my dubious French. Housekeeping is very good with spotless, pleasantly decorated rooms. Our classic room was beautifully quiet and had a very good sized bathroom although it did not have a view. All rooms have metal shutters. Location is good if you like the Montmartre area. Suggest a trawl for web rates as the walk in rate is quite expensive.", "helpfulness": 5, "user": "KERW1", "date": "March 15, 2007", "id": 7165261}, {"rating": 4.0, "title": "Wonderful little find!", "text": "The OH and I stayed at the Hotel Terrass for four nights in March and it was wonderful. The hotel was very clean and the standard room was of a good size with a very large and firm bed. The bedroom had a seperate toilet and shower area with two sinks for his and hers! The shower was nice and powerful.", "helpfulness": 10, "user": "Ratbags", "date": "March 12, 2007", "id": 7014683}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "There was plenty of storage space and as usual with a desk and comfy chairs. Our room overlooked the courtyard and was lovely and quiet. Each room had metal electric shutters. It was very quiet at night.", "title": "Alright", "helpfulness": 6, "user": "jenen", "date": "March 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 6940759}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "We decided not to have breakfast at the hotel, and we found a lovely patisserie 100metres up the road from the hotel on the corner which was lovely! Great coffee and pastries!", "title": "Fantastic", "helpfulness": 7, "user": "sarahjanelowe", "date": "February 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6891605, "likes": {"liked": "— Fantastic staff", "disliked": "— No 24hr room service"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "We also decided not to eat at the hotel in the evening and went exploring instead. There are so many lovely little places to sit outside, have a plate of meat of cheese and just watch the world go by! We did have a lovely meal at Soleil Gourmand and found a lovely wine Cave with a little hidden cafe at the back!", "title": "Excellent Hotel", "helpfulness": 7, "user": "markyd72", "date": "February 19, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 4.0, "value": 4.0, "rooms": 4.0}, "id": 6811640, "likes": {"liked": "— Shower", "disliked": "— No restarant on a sunday night"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We stayed at this hotel for 3 nights from 11 September, and booked via Eurostar. A taxi from Gare de Nord cost around 7 euros, which was very reasonable.", "title": "Nice but Dim!!", "helpfulness": 3, "user": "FIRESTONE", "date": "September 22, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 2.0}, "id": 5826184, "likes": {"liked": "— Good hotel in nice part of Paris", "disliked": "— Poor view from room"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The coolness of the reception staff was made up for by the various concierge staff that we met, and whom we found to be extremely helpful. On arrival we were warned that breakfast is not included but could be booked for 18 Euros each, and so we ate at a variety of small cafes a few yards down the road -average cost 8 Euros. The hotel is well appointed and in good order throughout, though the room that we were allocated (201) has no view to speak of (see photo); the window looked out onto a deep \"well\" area, with a postage stamp sized view of the sky. One of us had to nip down to the main entrance to judge what the weather was each morning so we could dress accordingly. However the room was clean, and quiet; the bathroom small but adequate. The bar was fairly pricey, but pleasant, and pianist makes an appearance on certain evenings. We never ate in the restaurant, but this looked nice - but again, quite expensive.", "title": "Absolutely Wonderful", "helpfulness": 3, "user": "djwdvm", "date": "September 21, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5823326, "likes": {"liked": "— The view", "disliked": "— having a hard time coming up with something"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "I’m a little late in writing this, ok so its well over a year, but it would be rude if I didn't mention this wonderful hotel. I stayed here with my girlfriend (who I would be proposing to on this trip)", "title": "Amazing!", "user": "Hugo-Balentine", "date": "August 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8464280, "likes": {"liked": "— Everything", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "After months of research and very careful planning, our trip was almost disrupted due to high security problems at Heathrow airport last year. We were extremely lucky to have even flown out. Due to the problems at Heathrow we did not receive our luggage and all we had were our passports and our cash cards. That was all!!", "title": "Wow!", "user": "asaspacey", "date": "August 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8292493, "likes": {"liked": "— everything - there was nothing I could fault it on.", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "The Terrass was so helpful managing to provide us with t-shirts, toothbrushes, cleaning products etc. If this wasn’t enough they even upgraded us to a junior suit (if memory serves me correctly it was room 704). The room was exactly as I imagined it to be, if not better. It was clean, neat and very spacious with a clear and uninterrupted view of Paris and the Eiffel Tower. The bathroom was very large and well kept.", "title": "We Loved the Terrass!", "user": "amydd", "date": "August 1, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8277055, "likes": {"liked": "— Location, cozy room", "disliked": "— Staff not very friendly or helpful"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "The location is perfect. Tucked away in the traditional French streets, surrounded by cafes and small shops, although busy it becomes quiet towards the evening so do not worry. By foot you could reach all the main streets leading to the main attractions this should take around 20 minutes.", "title": "Good stay in Paris", "user": "Alirog", "date": "August 1, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 8272463, "likes": {"liked": "— location", "disliked": "— no robes in bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Do not miss the Moulin Rouge. It’s an amazing show and a must on any trip to Paris. Again the Terrass helped by booking the tickets. Due to the smart dress code we needed to buy clothes at short notice. The Terrass couldn't have been kinder by drawing a detailed map to all the local shops were we could get as dressed up as possible.", "title": "The best part of Paris", "user": "sbgary1", "date": "July 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 8116316, "likes": {"liked": "— The fabulous room, great staff, great views", "disliked": "— Not close to a lot of the popular tourist spots of Paris, but close to transportation."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "My boyfriend and I stayed at Le Terrass hotel for 4 nights from the 9th until the 13th of November.", "title": "What a fantastic hotel!", "helpfulness": 4, "user": "PFandML", "date": "November 15, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6133555, "likes": {"liked": "— The room and the staff", "disliked": "— The breakfast was expensive"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled solo", "text": "The hotel was very nice and exactly like the photos...which is rare. The staff were extremely helpful and very pleasant! They followed up with our requests for dinner reservations and tour bookings quickly and efficiently.", "title": "Excellent", "helpfulness": 5, "user": "Henkybaby", "date": "October 18, 2006", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5968514, "likes": {"liked": "— The location, the room and the roof terrace (restaurant open only in the summer)", "disliked": "— The attitude of the front desk staff"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "Our room was lovely. It was a standard room but we requested a room with a view and certainly got it. Our room was on the 6th floor and had 2 small balconies that looked out to the Eiffel Tour. V.romantic!", "title": "Wonderful Hotel, not dissappointed!", "helpfulness": 4, "user": "newbieParis", "date": "October 18, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 5968289}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The area is also great with many great restaurants around the corner.", "title": "very good", "helpfulness": 1, "user": "craiggsx", "date": "October 16, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5959672}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We fell lucky that we got to stay in this hotel and can only recommend it to you.", "title": "Silver Wedding Anniversary Stay at the Terrass Hotel", "helpfulness": 5, "user": "Raillink", "date": "October 9, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 5932552, "likes": {"liked": "— Clealiness/pleasantness of room", "disliked": "— Prices in bar/restaurant"}}, {"rating": 4.0, "title": "Review of Terrass Hotel", "text": "Room very good; well laid-out. The room faced into an inner court rather than onto the main road so it was very quiet. The front desk staff were great, especially Daniele Lidon the chief concierge. However, the overall experience was down-graded by the poor service in the restaurant. Service was slow, and most of them didn't seem to know what to do. The kitchen was very slow, taking 15 minutes just to produce 2 poached eggs. This was disappointing; otherwise the rest of the hotel is very good. It's position is also good relative to transportation and the centre of Paris.", "user": "MetEngTourist", "date": "October 17, 2008", "id": 20953720}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We stayed at the Terrass for 4 nights in May for our honeymoon. As we expected the room was small but very pleasant with a great view over Paris, including the Eiffel Tower. The location is quite good with easy access to the Metro. Rue des Abbesses, which runs along the front of the hotel, is full of shops and restaurants. The breakfast at Terrass is very good, they have the usual spread but will also do eggs if you ask.", "title": "Great views and breakfast", "helpfulness": 1, "user": "hobart_traveller", "date": "October 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 20545882, "likes": {"liked": "— View of the Eiffel Tower from the rooftop terrace", "disliked": "— Size of the bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We stayed in a standard room which was small but lovely, very nicely decorated with french doors that open onto a small balcony. As we were on the second floor we didn't have the views over Paris and the hotel does face onto the graveyard - but this graveyard is a tourist attraction in itself as many famous French people are burried there. We also made use of the terrace on the 7th floor which had wonderful views - we sat up there when the restaurant was closed with a bottle of wine and enjoyed the views with the place to ourselves watching the lights on the Eiffel tower change - perfect! I have read many reviews where people have upgraded and I would say do it to get the views from your room if cost is no object. However for us it was too expensive to upgrade as we got a great deal with one night free for our standard room - we loved our stay anyway and would not stay anywhere else in Paris. We did not include breakfast in our room either as it was expensive, we did however love going out on the morning to a local cafe to enjoy cafe au lait and pain au chocolat.", "title": "Perfect hotel in beautiful Montmartre", "helpfulness": 2, "user": "Banano", "date": "August 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19431575, "likes": {"liked": "— the view and location", "disliked": "— lobby"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Montmartre is safe, beautiful and in my opinion the most characterful area of Paris within easy reach of all major attractions.", "title": "Honeymoon Hospitality", "helpfulness": 2, "user": "thediscoqueen", "date": "August 14, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18962119, "likes": {"liked": "— The service", "disliked": "— A small room that is standard for Paris"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We just returned from our honeymoon in Paris and couldn't wait to commend the staff of the Terrass Hotel. All of the concierges were extremely knowledgable and made us feel like old friends. Our room was exceptionally clean, comfortable and had a great view of the Eiffel Tower from our bed.", "title": "Lovely hotel", "helpfulness": 1, "user": "inca_8", "date": "July 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 18367854, "likes": {"liked": "— The view", "disliked": "— No curtain in the shower"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "The hotel is very well located in the centre of Montmatre, the metro is just 5 minutes walk from it. We stayed 4 nights in the hotel which is very clean, smells good, our room (405) was much bigger than expected, very clean and had a view over the cemetery of Montmatre, Paris and with the Eiffel tower at the background. Breakfast is delicious and takes place in the lovely modern restaurant of the hotel, but remember not to be later than 10am ‘cause the maitre is a bit insolent with that. The restaurant is also a good place to have dinner (nice and food is good). The staff is polite, easy and helpful. The hotel has a bar with fire place and live piano music all afternoons. The only thing I’d like to say is that curtains would make a difference while taking a shower. We will surely go back to that hotel when we go to Paris again.", "title": "Fantastic hotel with large room & views to Eiffel Tower", "helpfulness": 1, "user": "andreas_violeta", "date": "January 7, 2009", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23337504, "likes": {"liked": "— Cleanliness, service, views, food, ample room, staff", "disliked": "— the shower does not have a curtain or screen to avoid wetting the whole bathroom"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "While the staff were very nice and room comfortable the decor is a bit faded for this kind of price. The tiles where chipped around the bath and there were very few extras in the bathroom which you would expect like even a nail file. The minibar charged 4 euros for a small bottle of water or juice. While the location is great there are better prices to be had in paris. Try Le relais Gascon restaurant close by for good value food though.", "title": "overpriced", "user": "littleireland", "date": "January 5, 2009", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 23274718, "likes": {"liked": "— location in mont martre", "disliked": "— faded decor"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "We have just spent our honeymoon, a week in Paris at the Terrass Hotel in Montmartre, booked through Thomas Cook. After reading several reviews on this very site, I requested room 801 on booking, and when we arrived at the hotel on a very chilly December afternoon, the receptionist informed us that unfortunately someone was in the room, but would we like to move into it when it became available a few days later. I thought this was nice of her as she didn't need to do that. We did also notice when we arrived that there was some very loud drilling going on, and there was a notice up apologising for the inconvenience, but to be honest, we hardly heard a peep out of the builders, except when we saw the odd one on our travels, and they were very polite!", "title": "Nothing too much trouble at this great find!", "user": "HullParisGirl", "date": "December 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 23081945, "likes": {"liked": "— Service from the Concierges", "disliked": "— Prices at the restaurant and bar, trop cher"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We began in Room 305, which was traditionally furnished and had 2 slight drawbacks, a footboard on the bed, and as we're quite tall it was hard for us to stretch out, and only a bath - no shower, although there was a hose but not wall mounted, which was also a bit of a pain, although having said that, after the amount of walking we did, our bodies were glad of a soak in the bath!", "title": "Great romantic break hotel", "user": "Mise_8", "date": "October 19, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 21011710, "likes": {"liked": "— Views", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Our first evening was spent in Le Diapason, the hotel's gourmet restaurant, it was expensive and very nouvelle cuisine (tiny portions!) but very nice, and the staff were very helpful. Breakfast was generally good, typical continental style and sometimes with eggs depending on which waitress was serving you, and if they remembered!", "title": "Comfortable beds, lovely decor", "user": "saoirsemoo", "date": "October 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 20961218, "likes": {"liked": "— Views", "disliked": "— none"}}], "location": {}, "stars": 4, "variance": {"poor": 28, "average": 67, "very good": 178, "terrible": 19, "excellent": 216}, "aka": "Terrass Hotel Paris", "slim_ranking": 0.283881762409, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "The Terrass Hotel, unique hotel situated in Montmartre has been cultivating the French way of life. It offers a seamless combination of modernity and tradition since1911.Between the Sacré Coeur and the Moulin Rouge, its 98 elegant and spacious rooms and suites boast a privileged location. From the Lounge Bar “The 7th” on Paris’ rooftops,you enjoy a spectacular view in a green and grassy setting.The Terrass Hotel is also the perfect place for conferences or events."}