{"user_rating": 5.0, "review_count": 210, "name": "Teton Springs Lodge and Spa", "reviews": [{"rating": 4.0, "title": "Comfortably upscale", "text": "The Teton Springs Lodge and Spa is located in Victor, Idaho just over the pass from Jackson, Wyoming. It's not too bad a drive as long as you don't want to hang out in the town of Jackson. We thought (wrongly) that June would be warm enough to be able to expect to cross the pass without any weather concerns. Nope - snowed multiple times and the pass was closed once when we tried to cross for about 45 minutes.", "helpfulness": 2, "user": "otsthedog", "date": "July 17, 2011", "id": 115453420}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Nonetheless, the Idaho side of the Grand Tetons is quite lovely. The trails are not accessible as early as the Wyoming side -- it's the shady side, so many of the trails still had 3-4 feet of snow covering them.", "title": "We will DEFINITELY be back!!!", "user": "kktinsley", "date": "July 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115298884}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "The lodge itself has a main building and several rental cabins surrounding the Headwaters golf course. The course is available to lodgers for play. There is also a large pool - shared with the community - with lots of kids, a nice spa, and a fitness room.", "title": "A beautiful and relaxing place!", "user": "pauline60545", "date": "July 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 2.0, "service": 4.0}, "id": 115028146}, {"rating": 5.0, "title": "We loved \"everything\" about our visit!", "text": "We got a lodge room which was somewhat cramped but had all the amenities. Two queen beds and a balcony, a fridge, coffeemaker, flat screen and DVD player. The lodge offers movies to play -- but, don't expect them to be free -- there was no indication of the price and we mistakenly thought they were. Not that it's a big deal, but given the selection - nothing current! - it was a surprise.", "user": "A TripAdvisor user", "date": "July 3, 2011", "id": 114998834}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "The staff was helpful with suggestions of local trails to hike and places to stock up on food and places to eat. The food in the area is surprisingly good as are two breweries within walking distance. The food at the lodge is somewhat pricey and there was some confusion as to whether breakfast was included, but, luckily even though the hotel thought expedia had made a mistake, they honored the free breakfast. Breakfast is served at the Headwaters Grill. It was always good and service was excellent.", "title": "Our family of 15 were together in a 5-bedroom cabin property for 7 days.", "helpfulness": 1, "user": "ellie1126", "date": "June 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 111103721}, {"rating": 5.0, "stay_parameters": "Stayed August 2010", "text": "The hotel is certainly brilliant. Excellent service and very polite staff. The rooms are beautiful and superbly equipped. We enjoyed using the pool facilities although there were too many spoilt teenage brats, being disruptive.", "title": "Excellent, but...", "user": "PhillipP", "date": "March 26, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 101655661}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The hotel is perfect for those coming for a relaxing resort stay. We were only driving through for a day on our way to Denver from Yellowstone and other than Victor itself, it was not worth going out to Jackson due to the hotel's location.", "title": "Nothing but the best!!!", "user": "MandM6638", "date": "March 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101525937}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "My husband and I stayed here 11 days and did a golf package. We found the staff at the front desk, Headwaters Grille, Pro Shop and Stillwaters Spa totally top notch. Our one bedroom suite was extremely comfortable, well stocked and the decor was warm and cozy. The location was ideal on non-golf days for a trip into Yellowstone, Jackson Hole or local hiking. We would absolutely recommend this resort to anyone and look forward to returning someday.", "title": "Wonderful", "user": "TravelCouple86", "date": "March 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 98552615}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We enjoyed our stay. The 1 bdrm unit was perfect and very nicely finished with comfortable chairs, couch and bed. Kitchen was adequately furnished. Room was quiet and fireplace was a nice touch. Definitely would return should we go back to the area.", "title": "Luxury in a beautiful setting", "user": "Idaho_Skier_11", "date": "March 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98535268}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "The hotel room was perfect and very well appointed, every need taken care of, seeming more like a condo than anything in the relam of \"hotel room\". The service was exellent and very supportive and helpful. Even the location is unsurpassed as we skied at Targhee one day and enjoyed Jackson the next. Teton Springs would make an excellent place for a romantic getaway, a ski vacation or a business trip. It's really very comfortable in every way from the beautiful view to the comfortable bed. I highly recommend Teton Springs.", "title": "Pristine hotel with lots of ammenities", "helpfulness": 1, "user": "katiemarin79", "date": "February 8, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 95849924}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "The staff at Teton Springs Lodge and Spa get it. A staff that is genuinely attentive to their guests' every need: Arrange for ski lessons for our three kids? Yep. Dinner recommendations and reservations for you? Yep. Pull car to front door and warm up for you for your 4:30 am departure? Yep. Fresh baked cookies to your room? Yep. We were made to feel welcome and appreciated.", "title": "The Definition of Great Service and Facilities", "user": "TJinMD", "date": "January 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 93474123}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Our stay was in a two bedroom suite that is gorgeous. The beds and furniture are very comfortable. The gas fireplace is a nice touch. There is a full kitchenette with granite counter tops, three bathrooms, flat screens in each room. The rooms were warm and western. Instant relaxation.", "title": "Awesome place to stay", "user": "TBellew", "date": "January 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91762265}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "The Headwaters Restaurant is outstanding and the staff, service, and food is first class. The atmosphere is so relaxing that you don't want to leave. The staff was great with the kids. It can't be more than 50 steps from the lodge to the restaurant.", "title": "Fantastic place to stay!", "user": "Knight52", "date": "January 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91708815}, {"rating": 5.0, "stay_parameters": "Stayed January 2011", "text": "The spa is located in the Lodge and my wife claims the hot stone massage at the Spa was the best ever. There is a really nice exercise facility adjacent to the lodge too.", "title": "New Year's Eve 2010! Above excellent in every area above.", "user": "ctree70", "date": "January 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91627780}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Proximity to Grand Targhee is about 30 mins. There are a lot of charming little Bistros in Victor and Driggs such as Sundog, Spoon, the Bunkhouse (for the best Huevos Rancheros ever!) and of course the Knotty Pine. There are plenty more, but we were only there 3 days.", "title": "Great staff and a quiet location made our staff wonderful", "user": "colejust", "date": "December 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91163373}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "Won this overnight from a local newspaper. Though I live in the valley, I'd never visited. For non-locals, I think Teton Springs is a wonderful location for branching out and exploring Teton Valley and Jackson Hole. Very quiet; luxurious without being ostentatious. Service was outstanding. Relaxed, friendly staff. Our suite was nicely organized and decorated.", "title": "quiet and relaxing in a great spot", "user": "JudyAllen", "date": "February 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95685247}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "We drove in late and called for a SPA treatment. Great experience and then skiing the next day at Grand Targhee. Great experience and we'll be back!", "title": "Fantastic", "user": "ThomasW1957", "date": "February 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95276946}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled solo", "text": "The room was beautifully appointed and spacious, but still felt very cozy. The staff was friendly, helpful, and very knowledgeable about the surrounding areas. I felt as though they went above and beyond to make me feel welcome and at ease. The spa area is gorgeous with many amenities that I hope to use again. Heli-skiing was a real treat!!! (you don't often find that right in your hotel!)", "title": "Teton Springs Lodge has the most beautiful, cozy suite i have ever stayed in!", "user": "kookarooch", "date": "January 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 95109912}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Teton Springs Lodge is one of the nicest hotels I've ever stayed in, and I've probably stayed at more than my share. The staff are down home friendly and go above the call for service. The rooms and lodge itself are top notch - decor that I'd love to have in my own home and that says a lot. The ambiance is kind of 'fancy rustic' and very warm tones and quality art seem to be in every room. I was really impressed. A wonderful place for a getaway. A note on the sleep quality - the rooms bedding and such were top notch, but there were some mechanical sounds which were a bit louder than some throughout the night. Just a note for folks who might be really light sleepers.", "title": "Luxury Accomodations - Putting on the Ritz", "user": "AltaDave", "date": "January 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 95069619}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "I had a short one day business trip and arrived late afternoon. I was greeted by very friendly folks at the front desk who went out of their way explaining the available services. When I said I was looking for a massage even though the Spa was near closing time, the front desk quickly lined up a massage...and the massage therapist was outstanding and helped me recover from days of traveling. Dinner at the Grille was enjoyable and the food very good...especially the Point Judith calamari which provided a whole new delicious approach to calamari. The room was very comfortable, views wonderful...and now I want to come back for a summer time stay and enjoy the tennis courts, golf courses, and swimming pool along with some hiking.", "title": "Very enjoyable stay; friendliness/service outstanding", "user": "Meade5307", "date": "January 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 94072653}], "location": {"country": "United States", "city": "Victor"}, "stars": 4, "variance": {"poor": 2, "average": 2, "very good": 27, "terrible": 0, "excellent": 179}, "aka": "Teton Springs Hotel Victor", "slim_ranking": 1.0, "description": "Teton Springs Lodge & Spa provides unprecedented luxury and activity for all ages. This all-season resort is situated 20 miles west of Jackson Hole and Grand Targhee Resort, and conveniently close to Yellowstone and Grand Teton National Parks. It lives up to this location in every conceivable way, with a private health club and Headwaters Golf Club on site. You’ll discover a 20m outdoor heated pool, tennis courts and a state-of-the-art fitness center, Stillwaters Spa."}