{"user_rating": 5.0, "review_count": 62, "name": "Texas White House", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "We were in Ft. Worth for a family wedding, and stayed at the B&B for two nights. We had three rooms: Longhorn Suite (great for those who cannot climb stairs); the Tejas Room and the Lone Star Room. Each room is beautifully appointed in period furniture and accessories. We found the rooms and bathrooms to be larger than we had expected. Although it is on a busy street, near a hospital, we never heard any outside noises. We agree with other reviewers, the breakfasts were amazing. The \"guest refrigerator\" stocked with cold drinks was a welcomed amenity. We highly recommend staying in this lovely home whenever you have the opportunity.", "title": "Gracious Accommodations", "user": "barrycher", "date": "June 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 17373287, "likes": {"liked": "— Breakfast", "disliked": "— Rooms in the main house were a bit warm."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The location is excellent for Forth Worth cultural district and downtown. It's a direct road straight in and out but is still really quiet. The bedroom was beautifully furnished with antiques and the bathroom finished off with a good selection of toiletries. You are given a key so that you may come and go as you please and there is a fridge in the kitchen for guests with complimentary drinks and snacks. Grover was really helpful and welcoming and can help with planning trips out and things to see and is a really interesting guy to chat to as well. The breakfasts were amazing. Forget eggs and grits this was cordon-bleu US style. If we visit Fort Worth again we will definitely return to the Texas White House in preference to any hotel. Thank you for making our stay so good. Karen and Terry Oki, UK.", "title": "Old Texas in the heart of the city", "user": "Kazntel", "date": "May 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 16482404, "likes": {"liked": "— Old American ambience"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We're just back from our second stay at the Texas White House--we love it and will probably never stay anywhere else in FW as long as Grover and Jamie keep doing what they do! We have previously stayed in one of the \"family suites\" in the addition and this time we had the Lone Star room (supposedly haunted! but if the ghost was bouncing up and down on the bed, we slept right through it). I grew up in this area and I really feel the McMains offer the best of Texas hospitality at the TWH.", "title": "The TWH is the best!", "helpfulness": 1, "user": "BKT48", "date": "January 28, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13081468, "likes": {"liked": "— The breakfasts are fabulous!", "disliked": "— Our room was a little too warm, but we just opened the window a bit..."}}, {"rating": 5.0, "title": "Nostalgic of the early 1900's", "text": "The minute you enter this early 1900's establishment, you step back into time. The dimly lit sconces, antique furniture and warm welcome by Grover brings a sigh of relief from the fast pace of life.", "helpfulness": 1, "user": "texasfargo", "date": "January 21, 2008", "id": 12862063}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The breakfasts are scheduled from 9-10;30; let's you sleep in or just lounge with a carafe of coffee, you can request.", "title": "Great New Year's Night Stay", "helpfulness": 1, "user": "Agent_Jarrod", "date": "January 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12278042, "likes": {"liked": "— Clean, spacious rooms with great attention to personal needs.", "disliked": "— We had no complaints."}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "We have just returned to Scotland after a week long stay at The Texas White House and you would be very hard pushed to find a better place to stay while in Fort Worth. The house is beautiful and all the little antiques keep you amused for hours. We stayed in The Lone Star Room and it was fantastic. Really comfortable bed and nice furnishings. The whole house is kept spotlessly clean.", "title": "The Real Star Of Texas ", "helpfulness": 1, "user": "shona&terry", "date": "February 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6842441, "likes": {"liked": "— Every thing", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "Jamie and Grover ( the owners ) are 2 of the nicest people you could meet. Nothing is too much trouble for them, they will go out of their way to help you. Breakfast is truly fit for a king and the fridge with complimentary drinks and snacks is a nice touch.", "title": "Fantastic place with Southern hospitality", "helpfulness": 1, "user": "Sincerelyput", "date": "December 20, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6474208, "likes": {"liked": "— The rooms and hospitality", "disliked": "— no shower in my bathroom but there was a lovely whirlpool tub"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "If we ever return to Fort Worth we would not even consider staying any where else, this place is true texas hospitality at it's best and we left with heavy hearts. Thank you Jamie and Grover, hope to see you again one day.", "title": "Great little B&B!", "helpfulness": 1, "user": "jcjackson", "date": "July 2, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5418219}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "This B & B is a delightful place to stay and is just perfect in all respects. The owners are friendly, accommodating, and truly go above board in making guests feel welcomed. The rooms are lovely and very clean. We rented all five rooms, and all of our guests were very pleased, especially with the great mattresses. The breakfasts are excellent, with innovative offerings and excellent coffee. Having stayed at many hotels, including many five star hotels, I would put The Texas White House as one of my favorite all time places.", "title": "Texas White House - Immaculate, Beautiful, Romantic and Relaxing", "helpfulness": 1, "user": "miraclechild3", "date": "June 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5316068}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "From a Connecticut guest", "title": "lovely", "helpfulness": 1, "user": "jte", "date": "April 24, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 5006988}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "We stayed here for one night (a Sunday night [they had a Play While Others Work special rate for Sunday through Thurs. nights]). The room was beautiful and very clean. We didn't take advantage of the sauna because we were enjoying the hot tub which was enormous. We were put in a room in a house detached from the main house so we really loved the maximum privacy. I loved the toiletries. The bed was large and comfy. My only complaints were that the TV was not facing the bed but beside it and there were VHS tapes to watch and not DVDs. So the owners need to update things a little. Also the breakfast the next morning was dainty. We loved that it was brought to our room but we were still hungry after we ate it. We splurged when we booked this room because it was our wedding night. Had I known about the TV facing the wrong way and the tiny breakfast, I might not have booked the room. For these reasons, I would not recommend the hotel. For the extravagant price, guests should have nothing of which to complain.", "title": "stayed here on our wedding night", "user": "Beachmama79", "date": "December 28, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "value": 2.0, "rooms": 5.0, "service": 5.0}, "id": 12022418, "likes": {"liked": "— the privacy", "disliked": "— the small breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled solo", "text": "I wanted a nice place to stay between a business trip to Dallas and a visit to family living east of DFW. I was going to take a day or two for myself and visit the world-class FW museums I had never taken the time to visit.", "title": "Perfect respite during a couple days of museum trips", "helpfulness": 1, "user": "---nwdeb", "date": "December 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 11671801, "likes": {"liked": "— Comfortable bed & nice linens", "disliked": "— Room was a little warm for me"}}, {"rating": 5.0, "title": "The best of the famous Texas hospitality", "text": "The White House was perfect. I felt safe traveling alone and found the room as nice as I had hoped for. It was much cheaper than a local boutique hotel (my usual preference when traveling on business) and the breakfast was delicious.", "helpfulness": 4, "user": "agnes_susanna", "date": "April 24, 2007", "id": 7428649}, {"rating": 5.0, "stay_parameters": "Stayed June 2004, traveled on business", "text": "My room was close to the busy street, but earplugs made it very easy to sleep.", "title": "We're going back for the 4th time.....", "helpfulness": 4, "user": "markinnewyork", "date": "April 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7332142, "likes": {"liked": "— You name it!", "disliked": "— No negatives at all."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007", "text": "Business travelers or folks needing to access the nearby hospitals would be well served staying here.", "title": "Weekend Getaway", "helpfulness": 2, "user": "daytravellerz", "date": "March 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 7220175, "likes": {"liked": "— The owners are great- very accomodating and nice hosts", "disliked": "— Location was close to downtown- but a bit loud with traffic"}}, {"rating": 5.0, "title": "Excellent Service and Attention to Detail", "text": "It is hard to put into words how unbelievably great our stay was at The Texas White House. In a society where service and detail have fallen to the wayside of cutting corners and enhancing profits, the owners Grover and Jamie have provided a paradise. Very obvious that they work hard to provide a pampered stay for their guests. The suite was white glove clean, breakfast was delicious and the owners are highly hospitable and genuinely friendly! It is obviously not \"just about the money\".", "helpfulness": 1, "user": "A TripAdvisor user", "date": "April 24, 2006", "id": 5004254}, {"rating": 5.0, "title": "Home Away From Home", "text": "I have stayed in several BNB's and they all need to come stay at TWH and see how a BNB should be operated.", "helpfulness": 1, "user": "TAC007", "date": "April 17, 2006", "id": 4983378}, {"rating": 5.0, "title": "Perfect in Every Way!!", "text": "When my business duties started taking me to Ft Worth in the Spring of 2005 my wife did a search and found this gem of a place to stay. I have been back four or five times since the first visit and will continue to make the Texas White House my \"home away from home\". Grover and Jamie are perfect hosts in every way. They aim to please and never miss the mark. You won't go wrong staying here, that's for sure.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "September 25, 2005", "id": 3937423}, {"rating": 5.0, "title": "The 'Always Perfect' B&B", "text": "Perfect does not every begin to cover what a fabulous place the Texas White house is. The owners Grover and Jamie really go the extra mile to make sure your stay is enjoyable. The Longhorn Suite is spectacular...especially the large whirlpool tub. Our stay began with champage and chocolate covered strawberries in our room (which Grover or Jamie can set up for you). We went to our favorite Italian Restaurant just down the road called Ruffinos!! It is must if you like Italian food. The Texas White house will always be a special place for us because about 2 and a half years ago my husband proposed to me there. The owners are great at helping with special occasions such as proposals!! When we came back from dinner there was classical music playing, crystal champagne flutes, champagne on ice and a beautiful silver box with the ring in it...that the owners set up for my husband while we were at dinner!! We are looking forward to our next trip!!!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "August 13, 2005", "id": 3760174}, {"rating": 5.0, "title": "What a little gem!", "text": "Living in a nearby suburb, we have stayed in almost every room of the Texas White House. Ft. Worth is a favorite spot for getting away and no place measures up to Grover and Jamie's hospitality. Our adult daughter and I chose the delightful Land of Contrast for a stormy Ft. Worth night. My husband and I have enjoyed both the Tejas Room and the Mustang Suite. All of the rooms go beyond impeccable and the breakfasts match that same quality level. Morning conversations are often as enjoyable as the breakfast.", "helpfulness": 2, "user": "HoveCowgirl", "date": "April 10, 2005", "id": 3347696}], "location": {"country": "United States", "city": "Fort Worth"}, "stars": 2.5, "variance": {"poor": 0, "average": 3, "very good": 4, "terrible": 0, "excellent": 55}, "aka": "Texas White House Hotel Fort Worth", "slim_ranking": 0.1875, "description": "Historically designated, award winning, country-style home has been restored to its original 1910 grandeur of simple, yet elegant decor. It is centrally located, within five minutes of downtown and Sundance Square, the Bass Performance Hall, the Fort Worth Zoo, the Kimbell and Amon Carter Art Museums, Omni Theater, Botanic Gardens, Water Gardens and TCU. Three guest rooms in the main house all have a luxurious king or queen-sized bed with your choice of pillows, relaxing sitting-areas and private baths with claw-footed tubs for showers or baths. The carriage house has two suites; the first floor has a living room with cable TV, DVD, VCR, small refrigerator and microwave; bedroom has a queen-sized bed and sitting area; bathroom has a two-person jacuzzi tub. The second floor has a large sitting area, cable TV, DVD, VCR and small refrigerator; bedroom has a queen bed; bathroom has a two-person jacuzzi; off of the bedroom is a two-person, dry heat sauna. This suite also has its own, small balcony porch. Guests are afforded complete privacy; however, if desired, they may enjoy the main house parlor, living room with fireplace, dining room, large wrap-around porch and gazebo. Breakfast, described by one of the guests as, \"fit for visiting royalty\", may be served in either the dining room or to your room and will be a gourmet treat with fresh fruit or baked fruit in compote (seasonal), baked egg casseroles and homemade breads and muffins, juices, coffee or tea served on antique china with sterling silver and crystal. Other amenities include desks, private line telephone and free local calls, wireless internet, early morning coffee service, upon request, snacks and beverages and off-street parking."}