{"user_rating": 4.0, "review_count": 197, "name": "Thanet Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "Bloomsbury is a great central location to visit London. Plenty of buses, tube and walking distance of the theatres, British Museum etc. Also lots of eateries and little shops for bits and pieces, as well as a bigger grocery store near Holborn tube. Russell Sq and Bloomsbury Sq are nearby and very pleasant to sit in. I stayed 7 nights at the Thanet starting on 19 August 2005. it was great. Staff very helpful, especially Richard, Albert and George. The room was not big (London rooms are never big) but it had everything I needed including a recently renovated ensuite shower, washbasin and WC (also not big but perfectly adequate). The cooked breakfast (with cereal, yogurt, fruit for starters, if you can fit it in!) is excellent. Really sets you up for a days sightseeing. My room overlooked the garden and was very quiet. I can recommend this hotel and will stay there again.", "title": "Great location, delightful staff at the Thanet", "helpfulness": 7, "user": "qaatalia", "date": "August 31, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3832012}, {"rating": 5.0, "title": "Thanet Worked Great for Family of 5", "text": "The Thanet Hotel in London has a perfect room for a family of 4 or 5. Its location on Bedford Place is very close to the British Museum and other popular tourist attractions, and is close to family-priced restaurants and a grocery store near the Holborn tube station. We stayed downstairs in room 16, which had a double bed and 3 twin-size beds. It also had two ensuite bathrooms, one with a toilet and sink, the other with a shower and sink. The room was comfortable and very clean. Nice and quiet. No noticable street noise, even with the windows open. Nothing glitzy or fancy, but all the basic necessities were there. The full English breakfast included was very good. The staff is friendly and quite helpful. We will definitely recommend the Thanet to our friends, and will stay there again if we return to London.", "helpfulness": 8, "user": "Corvallis_OregonMom", "date": "August 18, 2005", "id": 3788249}, {"rating": 5.0, "title": "A great stay", "text": "My family and I were lucky enough to spend 8 days in this beautiful hotel. Our rooms were lovely, modern and clean. They had everything you needed and serviced by the staff who were also magnificent. The concierge were very knowledgeable and were always at hand to point us in the right direction. Right in the centre of town we couldnt have asked for more, we walked pretty much everywhere which is the best way to explore this beautiful city and strolling distance to the restaurants and pubs of Convent Garden, and beleive me, we did a lot of strolling. We had atmosphere, great service and a remarkable British-style breakfast, this is a jewel for the price and we cant wait to get back accross the pond and do it all again.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "August 3, 2005", "id": 3734945}, {"rating": 4.0, "title": "Friendly,clean & central", "text": "We stayed at the Thanet in July just after the bombings and although the road was closed, the staff went out of their way to make sure our short break in London was an enjoyable experience.Albert & George the receptionists were both charming.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "August 3, 2005", "id": 3733877}, {"rating": 2.0, "stay_parameters": "Stayed June 2005", "text": "The hotel is in a grade 2 listed building and we loved the original features particulaly the fireplaces.Our room was clean and a reasonable size and serviced everyday.", "title": "very disappointed", "helpfulness": 4, "user": "Chirk", "date": "July 26, 2005", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 3701022}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "This hotel was great for my family. The breakfast was good and if you have not traveled to Europe do not complain about the bathrooms and such. Yes, they are small but the are very accomodating. The beds aren't lumpy either. The staff was very helpful and it was in a great location.", "title": "Good Hotel for families", "user": "thefreddys", "date": "December 12, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 6433145, "likes": {"liked": "— The location", "disliked": "— The quality of the rooms"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "I was a guest in this hotel on the night of December 9. My wife and I checked in late on Saturday evening. We detected a foul smell in the bathroom, but were too tired to investigate or request another room. In the morning I found that the toilet had been broken from the floor, as evidenced by broken tiles around the toilet, and that the connection to the waste pipe was improperly secured -- with a 1/2 inch gap which allowed sewer gas into the room. The smell was quite vile, and presented an obvious health concern. I reported the incident to the desk clerk, who seemed quite unconcerned.", "title": "Serious Safety Problem", "helpfulness": 3, "user": "sjmcgarr", "date": "December 11, 2006", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 6362957, "likes": {"liked": "— nothing", "disliked": "— dangerous"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "Thanet Hotel should be lovely, but what a disappointment. The room was small and dirty, the beds were lumpy, the ensuite shower had little pressure, and the staff was unresponsive. Find someplace else to stay!", "title": "very disappointing", "user": "betsyknits", "date": "November 29, 2006", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 6233241, "likes": {"liked": "— nothing", "disliked": "— small, dark room -- high cost"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "I stayed at the Thanet for 4 nights at the start of November! Fantastic location, only 15 minutes walk from Euston mainline, mins from Russell Sq/Holborn tube. A great little hotel, one of very few B&Bs of this type to offer family room. R16 in the basement had a large window and separate WC and shower, very useful having 3 women in the family. The owners and staff really went out of their way to make us feel welcome and they seemed really keen tol go that extra mile. Breakfast was great and some great options in the area for dinner", "title": "Fantastic service, perfect location.", "user": "maruia", "date": "November 11, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6106263, "likes": {"liked": "— staff", "disliked": "— too much choice at breakfast"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "I booked 3 nights at the Thanet based upon the other reviews on Trip Advisor, plus other information about the hotel. I have traveled extensively in London and the UK (being from the US), and I am familiar with and prefer the smaller hotels similar to how the Thanet sounded from the review. I was very disappointed and will never stay there again. Our main problem was with the staff. They were never very accommodating with any of our requests, especially for such a small thing as extra toilet paper. I was actually told by the staff that I would need to purchase more at the Tesco Express around the corner! Never in all of my travels in the UK or elsewhere have I heard this from hotel staff. I also agree with the comments that the hotel is very \"tired\" and run down. Such things as carpet, bedspreads, etc., need a major change. The location is great, as others have noted, but for the price, especially given the exchange rate with the US dollar these days, there are better values in the area.", "title": "A Big Disappointment", "helpfulness": 4, "user": "JTJones", "date": "November 2, 2006", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 2.0}, "id": 6046798, "likes": {"liked": "— Location", "disliked": "— Staff"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Can't help but respond to the previous occupants of room 9, where we stayed last weekend. Yes, the property is a grade 2 listed building so no lift, but we were asked if we wanted help with luggage. The location is brilliant for us - round the corner from the British Museum (and the wonderful Blade Rubber...) a short walk from Euston, and easy walking distance to Covent Garden, & theatre land (with stacks of restaurants en route), and Oxford Street, as well as an easy bus ride to the museums in South Ken, or Royal Academy in Piccadilly, or the National Gallery in Traf. Sq (from Tottenham Court Rd round the corner ).", "title": "Great location", "helpfulness": 1, "user": "Ex-golfers", "date": "October 28, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "business": 4.0, "cleanliness": 5.0, "rooms": 3.0, "location": 4.0}, "id": 6022313, "likes": {"liked": "— Very convenient location, friendly staff", "disliked": "— Big city noise! We come from a v quiet rural retreat"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Room 9 is spacious, the bed (a standard UK double) is fine, (we are comparing here with other hotels we stay in in London & UK) and overlooks Bedford. Sq gardens (& its squirrels). We really liked the room. Not sure about the \"formica and tarnished chrome\" referred to in previous post, but confess we were too busy out and about enjoying all London has to offer, to fret over formica. There was a kettle etc , v welcome (& not always offered in the 'best hotels' who prefer you to order room service) & reading room/nightcap, so relax, enjoy. Breakfast is v good, efficient. I am not someone who would want to sack everyone who doesn't smile in the morning. I really don't do mornings. Leave me to my toast, scrambled egg and smoked salmon in peace.", "title": "Tired But Great Location", "helpfulness": 3, "user": "rgilinsky", "date": "October 21, 2006", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 5981965, "likes": {"liked": "— Location, quiet", "disliked": "— Shabby furnishings, tiny bathroom, unpleasant service in breakfast room"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We spent 3 nights at The Thanet. The good news is that the location is wonderful. We walked everwhere from there: Covent Garden, Picadilly, Green Park, Hyde Park, Harrod's, St. Paul's, Tate Modern. Also good bus service to the South Bank (10 min. ride). It's also a wonderfully quiet street. Our room (#9) is on the 2nd floor (2 flights up) overlooking the back garden. Lovely tree facing our window. When we arrived (6 Oct), someone had left the heat on. It was stifling. We turned it off and went for a walk. No more heat problems. Weather in London was perfect during our visit. Now for the bad news. This hotel is very tired. We were looking forward to a charming B&B. Not this place. Don't confuse shabby with charming. It's inconsistent, actually. The carpet on the twisty, winding, steep staircase is newish and decent. The desk staff is helpful and nice. The room was small. The bed (a double) was small, the mattress thin, the box springs soiled and worn. The bedspread had seen better days. The tiny wardrobe doors were warped and hard to close. The hair dryer was from 1956, and the air stream on its highest setting wouldn't have harmed small insects. The dressing table was Formica and tarnished chrome. Tacky. The bathroom was definitely from Fawlty Towers: a step up took you into a room about 30\"x30\" including the toilet and a sink the size of a large saucer. The shower was pretty comical, maybe 21\" square tops. Don't drop the soap; the only way you'll retrieve it is to get out of the stall !! My wife and I are not large people, but for those who are, be warned to soap up well before you get in, so in case you get firmly wedged, there’s some hope of exiting without help from the fire brigade. The door to the bathroom was on a spring-loaded hinge, and there was no way to keep it open, which one very much wanted to do to air it out after even a brief shower turned it into a Turkish bath. This is London from 50 years ago is all I can say. The breakfast was tasty: scrambled eggs with either smoked salmon or a mix of grilled breakfast meats. Of course the toast comes on that most wonderful of English inventions: the toast rack, designed, it would seem, to maximize the speed with which the contents are cooled. (Can the same race that designed this also have given us Radar and Shakespeare? It is one of the great mysteries of our western civilization.) The breakfast room is nice, even if the floor is pretty tippy on one side. The service staff, however, is also from Fawlty Towers: the lady in charge is sour and charmless, and don't dare ask for anything extra if want to avoid her icy glare and ill-concealed contempt. My wife and I couldn't wait to finish breakfast and leave. It is a very inhospitable environment, and made worse by the fact that the small crowded kitchen is open and in full view of the guests. It needs to be somewhere else. This isn't a lovely trendy sushi bar in the Ginza; it's an old stove and crowded counter with three unhappy people working in it and spreading their gloom throughout the premises. The owners are lovely; they should fire the kitchen staff lock, stock, and 2 smoking barrels. Their sour dispositions are reason enough to avoid The Thanet, or at the very least, breakfast there. I'm afraid I would not return. They need to spend a few thousand pounds on updating the furnishings and bathrooms, providing help with luggage on those miserable stairs, and hiring a kitchen staff that don’t make the guests feel like inmates. They could spend it wisely, making visitors feel like it mattered to the owners that their guests were cozy and comfortable. (Basil, where are you when we need you?) My wife and I would gladly pay £20 or £30 more per night for an improved model. (Our room was £100.) That would still be a London lodging bargain. There are several hotels in Bedford Place. My guess is at least one of them is an improvement over The Thanet. You can do worse, but you can probably do better for not much more. We’re going to try next time we go.", "title": "Don't arrive late", "helpfulness": 2, "user": "Ted_Fez", "date": "October 14, 2006", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 5956127, "likes": {"liked": "— Breakfast", "disliked": "— Room"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "My wife and I stayed at the Thanet because of its relatively good review in Trip Advisor, and close proximity to the British Museum. We arrived at 8:00 PM on a Friday night from Croatia (which we loved and we thought was an excellent value). It turned out that there were only two rooms left and both were in the basement. We first were put into a creepy room with a non-functioning toilet. When I complained, I was told that it was a European-style toilet. It may have been European style, but it was broken nevertheless. We were moved to another room which was tiny but had a functioning bathroom. The staff were friendly and helpful and the breakfast was good. I could not help thinking that we had just spent two weeks in five European countries and this hotel in London was the most expensive and worst of all we had stayed at. London is a wonderful city, but extremely expensive. My recommendation is to study a foreign language and go to continental Europe instead.", "title": "Charming in great location", "helpfulness": 1, "user": "brianheyes1", "date": "September 3, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 5765429, "likes": {"liked": "— Location"}}, {"rating": 4.0, "title": "Exceptionally good value and very nice for the price", "text": "Stayed for 3nights in August and my only complaint was the weather. The hotel is in a really great area to visit London.The street outside is quiet but yet you are only minutes from Oxford street and the centre of London. If you stay around the hotel there are quite a few restaurants and bars in the Russell Sq area.", "helpfulness": 2, "user": "brendaangela", "date": "August 10, 2006", "id": 5594486}, {"rating": 1.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "We booked a quad room at this hotel through Laterooms(--) based on the positive reviews on this website and the pictures and descriptions on the hotel's own website. We were looking forward to a cozy and welcoming B&B. We should have paid more attention to the review entitled \"Avoid the 3rd floor at all costs\". When we arrived at the hotel, they insisted that we sign in before showing us our room (we should have seen the red flag right there), but we were tired after a 15 hour train trip and checked in first.", "title": "Fawlty Towers!", "helpfulness": 8, "user": "Momuv2", "date": "July 29, 2006", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 5525682, "likes": {"liked": "— The location", "disliked": "— The room"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "We were shown to room 15 on the 3rd floor. Albert did help with the luggage, but the stairs to the 3rd floor were so steep as to make me worry about my children's and my own safety. Once in the room, things did not get any better. While it was clean and had a fireplace, there is nothing else positive I can say about it.", "title": "Not as it used to be", "helpfulness": 4, "user": "mench", "date": "July 27, 2006", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 5518397, "likes": {"liked": "— the location", "disliked": "— the lack of friendliness among the people working there. One man at the desk was pleasant."}}, {"rating": 2.0, "stay_parameters": "Stayed June 2006", "text": "The floor was tilted so badly that the head was lower than the foot of the beds, the bathroom was so tiny that you needed a shoehorn to get in and out of it, and the floor creaked so badly when you walked on it that anyone getting up in the middle of the night would certainly wake everyone else up. The worst thing, though, was the heat. Room 15 used to be the attic, and it is directly under the roof. We arrived during a heat wave (a rare event to be sure), but the room was sweltering. There was only 1 tiny window. Albert suggested that we keep the curtains closed and stay out during the day, returning to the room only at night when it might be cooler, which to me was not a solution. What is the point of having a hotel room if you can't go there except to sleep? We sometimes like to rest a bit before going out in the evening, for example. We asked about getting a fan, but there was none to be had. After 15 minutes in the room, we decided we couldn't take it anymore, and called our 2nd choice hotel, which had a room available.", "title": "Stairs to 3rd Floor a killer", "helpfulness": 7, "user": "Gblyn", "date": "June 22, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 5373688}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "When we came downstairs with our luggage, we told them we were leaving, and when it became clear that there was no way we would stay without being given a different room, they offered to call us a cab. We accepted their offer, but they instead called a private car hire service (no doubt getting a little kickback in the process), which turned out to be more expensive than a city cab would have been.", "title": "nice hotel", "helpfulness": 5, "user": "mevangelisti", "date": "April 24, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 4998742}, {"rating": 4.0, "title": "Nice little hotel", "text": "When I contacted the manager (who was out of town when this happened) to request that he waive the cancellation fee of one night's stay since we had not been offered a satisfactory room in the first place, he instead told us that because we had booked through Laterooms, he was obligated to charge us for all 3 days of our planned stay. It was only after I contacted Laterooms and my credit card company that he agreed to refund us 2 of the 3 nights. Needless to say, we won't be back.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "February 4, 2006", "id": 4412890}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "variance": {"poor": 14, "average": 28, "very good": 87, "terrible": 8, "excellent": 60}, "aka": "Thanet Hotel London", "slim_ranking": 0.335813953488}