{"user_rating": 4.5, "review_count": 168, "name": "The Bridge Inn at Ratho", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The Bridge Inn is a little gem.", "title": "New look Bistro hits the sweet spot", "user": "Surprising", "date": "July 14, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "service": 5.0}, "id": 115348451}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "For many years it trundled along as a second rate boozer but a local husband/wife team took it on recently and not before time. Plenty of love (and cash...) has been flung at the place and it shows.", "title": "Great stay", "user": "BadPacker09", "date": "July 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115333757}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We nipped in to for lunch the other day, following the recent refurb, and it was superb. The new decor is mighty swish, service was on the money and importantly the food got the taste buds zinging. Sure, it's not haute cuisine but the innovative menu is rammed full of exciting local produce. Someone with a keen eye has also transformed the wine list.", "title": "Avoid restaurant with a barge pole", "helpfulness": 4, "user": "McTrojan", "date": "June 24, 2011", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "service": 2.0}, "id": 114708282}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 8, "average": 8, "very good": 33, "terrible": 6, "excellent": 113}, "aka": "The Bridge Inn At Ratho Hotel", "slim_ranking": 0.36, "description": "Situated in a stunning and picturesque setting on the banks of the Union Canal, the Bridge Inn is a unique pub and restaurant. The Bridge Inn is a wonderful place to visit, to taste some of our freshly cooked food, try some cask ales or sample from our expanding wine list, and enjoy a warm and friendly atmosphere and welcome. Wherever possible we use seasonal, Scottish, fresh, local produce, and everything is freshly prepared. We grow our own herbs and vegetables in a walled garden slightly along the canal from the pub. We have a small herd of saddleback pigs, and our menus often feature delicious home-produced pork on the menu. We use locally-shot game when it is in season. We always have a range of cask ales from breweries which we know throughout Scotland. We have had lots of fun selecting our wine list, which we have tried to make one of the best value wine lists in Scotland. And we currently have on a selection of over 20 single malts from around this beautiful country. We have now finished an ambitious renovation project that has transformed the Bridge Inn. We have created an atmospheric country pub in the 18th century part of the building with open fires and comfortable seating. We have altered the upstairs to create 4 beautiful and unique en-suite bedrooms. They each have a different feel, but each has its own view of the canal and surrounding countryside. The Bridge Inn won Best B & B by Visit Scotland's Thistle Awards for the East of Scotland. Finally our bistro alongside the canal has been upgraded and we have added a terrace alongside the building to make the most of our unique setting."}