{"user_rating": 5.0, "review_count": 383, "name": "The Ulin Villas & Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Great staff, would do anything to help. Awesome pool. In room BBQ was a feast. Nice location. would come back in a heart beat", "title": "great pool and people", "user": "LJ54", "date": "March 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101845618}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "My husband & I travel frequently [2 - 3 times per year] throughout Asia / Pacific region. This was our first visit to Bali however and we would like to thank fellow Trip Advisor reviewers who recommended Ulin Villas & Spa as an ideal accomodation option. I now know why Ulin Villas is rated #1 out of 115 specialty lodging in Seminyak:", "title": "Thank You Ulin for memorable experience!", "helpfulness": 1, "user": "rachel_n_paul", "date": "March 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 101149425}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "Customer Service:", "title": "Beautifully appointed and excellent service from all levels", "helpfulness": 1, "user": "Suziq94", "date": "March 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100486150}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Booking - We booked a one bedroom villa with Ms Wira who was very helpful in sourcing an available villa for us [1 days notice!]. I called Ms Wira to enquire about availability [after seeing in TripAdvisor that this property was highly recommended] & within 1 hr via brief contact through emails with Ms Wira, all was booked in for us ready to arrive the next day. During Stay - Overall all staff at Ulin maintained high level of professionalism. Reception, Chefs, Concierge, Security, Spa staff - Thank You for looking after us at all times, anything we needed assistance with, you were always willing to help with a smile.", "title": "A most wonderful holiday made perfect by the staff and lodgings", "user": "SChowsg", "date": "March 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 100330687}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Last Day - As our flights were leaving very late, reception staff extended a late check-out till 6pm free of charge which was very handy. They also offered a spa room after 6pm where we could use the showers before heading to airport for midnight flight.", "title": "Wonderful Stay", "user": "justine_littlefield", "date": "February 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 98311507}, {"rating": 5.0, "stay_parameters": "Stayed June 2010", "text": "We didn't expect such beautiful villas when we approached Seminyak town but gosh... were we pleasantly surprised! Nestled on a busy street full of restaurants and shops, the villas transported us to a world of serenity and beauty. While the architecture of the villas looked traditional, the large private swimming pools and nicely manicured gardens added a sense of luxury to the place. Staff were very helpful and assisted us in arranging a driver to take us around. They also privately cooked breakfast in our villa every morning - how unique!", "title": "Beautiful villas in the heart of Seminyak", "user": "Vinolio", "date": "May 1, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 106349966}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "I booked a 6 night stay in Ulin Villas one bedroom pool villa based on previous Tripadvisor reviews. After my stay at The Ulin I knew it was amazing and deserved 5 stars, however, after continuing my travels through Bali and in other Villas I wish I could give The Ulin 7 stars. This is truly the most amazing place I have ever stayed! I recommend booking directly through the hotel, they were so patient and helpful and were able to give me the best price possible.", "title": "WOW!", "helpfulness": 1, "user": "Rachel85rc", "date": "April 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 105712550}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "To start the check in was great and the Villa was amazing, it was bigger than I thought it would be, so spacious and comfortable you feel like your in a home! The property is walking distance from all the great shops and restaurants but is still off its own quiet, private street. The kitchen is perfect, it has everything you need to make a quick snack or a huge fridge for leftovers. The fridge is stocked daily with snacks, soda, and beer, which was great to use on our daily outings! One of my favorite parts of the kitchen is a small water station. Bali is a hot, humid country. I brought my water bottle and was able to refill there at the hotel and not waste money and plastic on buying water bottles all day long. Very thoughtful and green of The Ulin! The space was great, comfortable and not cramped like other Villas we stayed in. The bathroom, outdoor shower was great, huge and very private. They even made us a flower bath when we asked for one. The bed was beautiful! Not the most comfortable... but great compared to other Villas we stayed in.", "title": "In heart of Eat Street, great service and beautiful villas", "user": "SydneyEmma", "date": "April 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 105112472}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "One of the best parts... breakfast! The breakfast situation is amazing, there are so many options and the food is amazing! Probably some of the best we ate in Bali! And it is so great the cook it for you in your own villa! We also ordered room service one night, the food was just as delicious, fresh and not at all overpriced like other Villas we stayed in.", "title": "Wonderful holiday, even when this is the 2nd stay in Ulin", "user": "JustinandCat", "date": "April 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104864767}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "The spa was okay, nothing fancy, standard Balinese massage with a standard foot bath. followed by tea. Two things I did not like about the spa were the beds and after each service they have you fill out a customer satisfaction card. I appreciate the company wanting to know your opinions but right after a massage you just want to chill and we were staying there and could have done it any other time. Also, the bed. I am a smaller person, 5'2\" and my face kept slipping through the face hole, it made the entire face down part very uncomfortable, and I think did more harm to my neck then the massage did good. The idea of getting a massage in your villa was terrific, however the face rest in the beds were even more uncomfortable than the actual spa, even my boyfriend found it uncomfortable. Also, we finished so relaxed we would have loved to have just laid there and relaxed or just chilled. The ladies had us get up and fill out another customer satisfaction card! Then my boyfriend took a shower and they made us tea and waited till he came out to finish the client card before they left. Making me feel a little uncomfortable hollering at my boyfriend to hurry so they would leave.", "title": "Couldn't possibly be better", "user": "DMeg74", "date": "April 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103246402}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Our 4 nights' stay at Ulin Villa was the second half of our Balinese holiday, and what a Villa this was! The Villa management and staff does full justice to its #1 rating by Tripadvisor and I am sure the past visitors's tastes and standards are perfect and accurate.", "title": "Absolutely Divine", "user": "Parag J", "date": "June 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111526325}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "As we shifted villas, we reached Ulin Villa ealier. Though they had a nice waiting lounge near the front office, they provided an empty villa for my parents to feel that they are not being made to wait. Within 40 minutes, we were taken to our villa and it was a pleasant surprise that we were upgraded to a 3 Bedroom Villa. We never needed the 3rd Bedroom so it was kept locked but at that instance, I wished I had my Mom-In-Law with us, in which case we could have done full justice to the upgrade.", "title": "Gorgeous property with impeccable service", "user": "goajames", "date": "May 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109743519}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The villa area was huge, with independent cottage each for the 3 bedrooms and a larger one for open-type living and dining. The living room was equipped with home theatre system, iPod docking station etc.", "title": "A villa oasis close to great restaurants and lovely helpful staff", "helpfulness": 1, "user": "Deltasmelta", "date": "May 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109160743}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Kitchen was well equipped for elaborate cooking but who wants to cook when you have an array of restaurants just 100 steps from your villa?", "title": "Ulin at its Best!", "user": "SgpTravellator", "date": "May 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 108934250}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The Bedrooms were nicely designed with fairly comfortable beds (would have preferred them springless though), a sitting bench near the window, a wash area and an open-air bathroom separated by a door. I was worried that mosquitoes would be troublesome in open bath area during longer visit but that never happened. A large spa tub in the open meant for spa bath with rose petals and aromatic oils. Looked absolutely inviting but never used it as the rain shower provided a short-cut.", "title": "oasis of calm", "helpfulness": 1, "user": "armstroe", "date": "May 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108435816}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "From the moment we stepped inside our villa, we were in heaven. Could not fault a thing. Amazing staff, beautiful villa, spotless rooms, breakfast cooked for us in our outdoor kitchen overlooking our own pool each morning, sparkling clean pool, afternoon tea each day, and less than a 5 minute stroll to the hub of seminyak. Nice and romantic for us, however the bigger villas would be perfect for families or friends. We had a couples massage in our villa, which was amazing. The only thing we regret is not having the seafood bbq one night, other guests absolutely raved about it. We will definitely back. Thank you ulin staff, for four beautiful nights!", "title": "paradise!", "user": "lydia737", "date": "May 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 108269687}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Upon our arrival, my husband realized he left his Kindle on the airplane, and the manager called and personally went back to the airport to get it. I knew then that the service at Ulin Villas was going to be beyond my expectations. Not only the service, but the villa itself was beautiful, private and comfortable. The pool was so refreshing and everything in the garden, pool and villa area felt in harmony. The breakfasts were great, and the afternoon tea in our villas were a really nice touch. The staff was helpful always. I can't say enough about how wonderful our experience was. Highly recommended!!", "title": "Beauty, quality and great service in paradise", "user": "bongomoppet", "date": "May 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 107184629}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We checked into Ulin for 3 nights but wished we could stay more. It was the highlight of our holiday in Bali. The staff were exceptional nothing was a problem for them. One night we went out for dinner and their car was nt available to drive us to a restaurant so they called a taxi and paid for it. The villa was spacious,clean and had fantastic air con. We loved the little touches like lighting candles at night and folding the bed down for us. It was so romantic and private and the pool was amazing . The gardens were spotless and always kept clean.The position of the villas is close to the shops and restaurants ( just a walk) and once inside the villa it was extremely quiet no traffic noise at all.I loved the day spa and had a great 3 hour pampering which was very reasonable.", "title": "Pure indulgence . We did not want to leave!", "user": "nicole9369", "date": "May 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106947300}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Our breakfast was amazing and having a chef cook for us when we wanted was fantastic. We could not fault anything about Ulin and would reccommend it to everyone!", "title": "Great villa's, exceptional staff and stone throw away from restaurants, bars & shops (Seminyak).", "user": "APPYOZ", "date": "May 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106916111}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "This was our 2nd visit to Seminyak and it has changed quite a lot in the last few years. There are many villa's to choose from in the Seminyak area but I would definitely recommend staying at Ulin Villas & Spa.", "title": "Loved it!", "user": "WelshBarryOz", "date": "May 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 106621553}], "location": {"country": "Indonesia", "continent": "Asia", "city": "Seminyak"}, "variance": {"poor": 2, "average": 6, "very good": 42, "terrible": 1, "excellent": 332}, "aka": "The Ulin Villas Hotel Seminyak", "slim_ranking": 0.0526315789474, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 5.0, "location": 5.0}, "description": "Discover an intimate award-winning boutique villa experience in the heart of Seminyak, Bali’s most fashionable destination to dine, drink and dance. The Ulin Villas and Spa is steps away to an array of most sought-after restaurants, chic boutiques, funky shops and within walking distance from the white sand beach for which the island of Bali is famed. It’s a tropical retreat that invites seasoned travelers to experience each day as it slowly evolves. Offering luxury living space, cutting-edge Balinese design and modern comforts, all villas feature private swimming pool, designer kitchen, en-suite bathroom, pool-side dining area, your very own tropical garden and most everything you would possibly expect. The Ulin Villas and Spa is created for you to stay in, chill out and relax. Experience an impeccable sincere service that everybody have been talking about. Create your own love story and make the most of this magical island has to offer. From the soft whisper of morning breeze, to the tropical noonday sun and topping it off with a romantic rendezvous beneath a star studded night sky – at The Ulin Villas and Spa, you would never fail to fall in love.We actively involve and proudly support “Bali Caring Community” a Bali based non-profit organization initiated by a group of hoteliers to bolster the Balinese unfortunates.The Ulin Villas and Spa has also been a proud sponsor of the “Comedy for Cancer Fundraiser” since 2007. “Comedy for Cancer” is a charity initiative to support the work of ANZGOG (The Australia and New Zealand Gynecological Oncology Group) for ovarian cancer research."}