{"user_rating": 4.0, "review_count": 940, "name": "The Sebel Pier One Sydney", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "This hotel is in a gorgous location, down by the refurbished piers underneath the harbour bridge. Rooms have recently been refurbished in a seaside, whitewashed theme. Basic rooms are cramped and dark, it is worth upgrading to the much larger rooms on the harbour side. Check in was a poor experience, with long lines and unfriendly staff. I waited a long time for my car to be delivered from valet, even though I had phoned ahead and given 15 minutes notice the concierge did not leave to get the car until after I had checked out. He then found it was parked in by other cars so more waiting. Breakfast coffee (from a self serve machine) wa sterrible.", "title": "World class location!", "helpfulness": 1, "user": "tripellen", "date": "March 14, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 154578199}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Great hotel for business and or leisurely weekend", "title": "Very nice hotel in a great location", "user": "keentotravelsydney", "date": "March 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154569867}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Staff very helpful particularly in conferencing area", "title": "Weekend break in Sydney", "user": "Wilksy73", "date": "March 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 154466949}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "5 min walk from city but in a very quiet and tranquil location", "title": "First Impressions Count", "user": "Traveller100Qld", "date": "March 13, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154466633}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Great bathroom in room 137. I would definitely recommend this hotel and will use again for business meetings", "title": "Top location", "helpfulness": 1, "user": "LengraMelbourne", "date": "March 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 154372907}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Decided on Sebel Pier One as we were meeting family arriving home from a cruise.", "title": "Great Place to Relax", "user": "Julie Y", "date": "March 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126061420}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We drove right to the front door, the car was whisked away to parking and luggage carried to reception. One of the most prompt check-in's we've ever experienced. We chose a heritage room which was superb, snug, cosy with a view of the harbour bridge and harbour. Spent the evening wining and dining on the wharf overlooking Walsh Bay. Our stay was one of the most relaxing overnight stays in Sydney for a long time. Thanks to Sebel Pier One.", "title": "Great value for being on the Harbour", "user": "TazzyPerth", "date": "March 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 126028177}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "This is the first time we had stayed here and we would definitely stay again. It is in a great locations in the shadows of the Harbor Bridge jutting out into the water and only a short walk to Circular Quay. The rooms are of good size with a beautiful view of the harbor. The staff are friendly and helpful as well. I recommend staying here.", "title": "Location and Service", "helpfulness": 1, "user": "barnowl54", "date": "March 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126027415}, {"rating": 2.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The location is great but it takes more to make a hotel experience. This was our second stay at the Sebel Pier One but it was just as good as our first. The service and friendliness of the staff is the highlight of this hotel but they have a lot more to offer, The rooms are so very clean and have all the amenities we require. The bed is comfy and the breakfast ample with some menu changes each day. Who needs a huge room when the surrounding pier is where we want to spend our time? However, it is lovely to pull up an armchair and take in the view from our room. From the time we pull up at the front of the hotel until the concierge delivers our car back to us, it is 5 star service all the way. I love how the staff can detect when I might be having a problem - they appear out of nowhere and ask if they can help. So what are the drawbacks? The rooms on the bridge side of the hotel are not as good as the harbourview rooms and these will be the rooms that are quoted on many hotel search websites and have the lowest rates. Rooms on the 3rd floor have the harbour view partially obscured by the heritage features of the original pier building which would have had to have been preserved. The toilets are loud, but I applaud the hotel's efforts to save water by using these devices. I didn;t find the noise of other toilets invasive although I was aware of them when we stayed on the second floor but not on the 3rd floor. The hotel room rates are quite high. All I can say is that my husband and I love this hotel and it is where we go to relax and feel pampered. We'll be back there the next time we want to spoil ourselves.", "title": "Never Again", "user": "Akshunjase", "date": "March 13, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 126024960}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Sebel Pier One was my place of choice to celebrate my 40th birthday. It was a complete disappointment.", "title": "Always nice to return", "user": "GuitarmanBowral", "date": "March 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125780174}, {"rating": 3.0, "stay_parameters": "Stayed February 2012", "text": "Nice hotel, position excellent but service rather poor, we had to wait at bar to get a drink and considering this is supposedly a five star what a joke. We just felt the staff need some training in customer service.", "title": "Lovely location but only 3 star service", "user": "Gables28", "date": "March 5, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 125632844}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We booked this hotel based on its location, being a few steps from our reception venue. It also looked nice from the outside, and had the feature of being heritage listed. We even 'splurged' and got the honeymoon package, which basically gave us a later check-out time, 4 truffles and some bulgari soaps boxed up, a bottle of Chandon sparkling, and a breakfast (which they later tried to charge us for).", "title": "Despite its best efforts, it could not ruin our first night of marriage", "helpfulness": 5, "user": "Nadia_Alex_Latti", "date": "February 23, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 125106772}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "The toilet noise issue that has been mentioned in other reviews was not that big of a deal for us, and became something we joked about instead.", "title": "location location location", "user": "WyeRiver", "date": "February 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 124833171}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "The problem with this hotel was that there was absolutely no warmth about the place - from the staff or the services provided. We paid a lot of money but felt we did not get much for it. The room itself was small, the bathroom felt flimsy, dark and cheap. There was no recognition that it was our wedding night (despite turning up in our wedding clothes!) aside from the assorted extras which had been dumped in our room hours earlier (the ice around the bottle had long turned into room-temperature water in an ice bucket).", "title": "A hotel with personality (and a view!)", "user": "Frog_Singap", "date": "February 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 124739263}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We live in Sydney, so we don't know how much that kind of money usually buys in Sydney hotels, but even so, we felt we were staying at an anonymous business hotel - and we were not expecting to stay at a business hotel on our first night of marriage.", "title": "One night stay", "user": "Milly B", "date": "February 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 124499787}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "I booked the Sebel for my mother & 90 year old grandmother as a weekend stay. The room was brilliant, with high ceilings making it feel much larger than it was. Even though on the first floor it still had views of the water (though the windows were high) and it was lovely and light. The only complaint they had was the light in the bathroom was not very strong (but they are also old :-))", "title": "Fantastic City Stay", "user": "Trav_elle_Sydney", "date": "February 26, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 153172344}, {"rating": 2.0, "title": "Poor customer service", "text": "I did ask if they could provide something 'special' for my grandmother, but as it is a hotel with many wedding guests I expect everyone is looking for something special.", "user": "HongKongMember", "date": "February 25, 2013", "id": 153059118}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "The restaurant service was OK at lunch but breakfast was dismal and I wouldn't recommend including it in your room - better to go across to Pier two which is cheaper and really fantastic.", "title": "A brilliant stay", "user": "Andre031", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153040886}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Booked to stay here on our final night after a 2 week trip around Australia. On arrival, a bit like the Marie Celeste, not a soul around. No bell staff, no concierge and nobody on the front desk. We hauled our cases into the lobby and after over 5 minutes a rather bored gentleman arrived to check us in. No offer of help with the cases, which I guess was hardly surprising as still nobody else around.", "title": "Still a good place to stay", "user": "geordie9Kent", "date": "February 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 153025210}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "As polar opposite the Room Service staff were lovely. They were happy, friendly and very prompt with our in room dining. Why aren't these people at reception?! I think the reception and concierge staff could take a lesson.", "title": "Impersonal and average presentation for the price", "user": "Melinda T", "date": "March 8, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "location": 5.0, "service": 3.0}, "id": 125778775}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "The location and view were just gorgeous, however, it certainly wasn't enough to make us want to go back. Next time the Park Hyatt, which is just a few doors away, will recieve our custom and they have a much better view of the harbourside and opera house.", "title": "It's okay", "user": "Brenda C", "date": "March 7, 2012", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 125732812}, {"rating": 2.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "The hotel is a very modern renovation of what I presume was an old warehouse or something similar, but somehow the hotel just didn't seem to have a 'personality'. The rooms were straight forward and functional, but the one aspect that really put me off was the loo which flushes with a sonic boom just like an aircraft toilet! Having flown 23hrs in a plane to get to Sydney, the last thing I needed reminding off was the flight...The noise is unpleasantly loud and is easily heard from other rooms.", "title": "Mixed bag", "helpfulness": 2, "user": "Ninkasi", "date": "February 12, 2012", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 124485813}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Location is OK...nice view over the harbour, and a reasonable walk to Circular Quay and the Rocks - Darling Harbour is probably a bit far away to walk. On the service side, we had a lot of issues:", "title": "Was a good time and good location", "user": "Fran I", "date": "February 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 124457423}, {"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "- Breakfasts: the staff cannot key up, and frequently food / coffee etc would run out and not be replenished promptly. Similarly, tables would not be cleared and seating became problematic. In addition, the seating is cramped and one has to navigate between tables just to get to the buffet.", "title": "Terrible, terrible service all around...", "helpfulness": 3, "user": "ditdit6", "date": "February 11, 2012", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 1.0}, "id": 124431317}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "- Lunch: we had a business meeting and pre-ordered our lunch in the morning to be served at 12:30. The food eventually arrived at 1:15 and we gave the dessert a miss as we had run out of time. Complaints were ignored.", "title": "Great Location", "user": "AgentBear", "date": "February 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 124271433}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "- Business meeting room - generally OK, but we found getting anything done for us was a major chore by the staff.", "title": "Great Rocks location", "user": "Wanderingjen", "date": "February 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124227371}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "This is a great hotel just under the bridge on the west side. This means it is away from the main city traffic and so is a very quiet location. It is easy to walk to The Rocks, Circular Quay, The Opera House and on into the city or catch public transport. The rooms are distinctively decorated and very comfortable. It is situated right on the Harbour so breakfast views are great. The staff were very friendly and helpful. The only criticism is the breakfast buffet was fairly ordinary - no fresh squeezed juice, or food such as omelettes, pancakes etc. prepared on the spot. The breakfast manager also forgot to put our coffee order in. However one of the other staff rectified this by not charging us when the order finally came. We would stay here again based on the location, great views and well appointed rooms.", "title": "Distinctive comfortable hotel in a beautiful and quiet location", "helpfulness": 1, "user": "sueand", "date": "March 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153653291}, {"rating": 3.0, "title": "Last stop", "text": "My last stop on my 5 weeks vacation in New Zealand and Australia, was 4 nights at Sebel Pier One. It was nit the best to end my wonderfull vacation. The aircondition in the room was diffecult to regulate, it was either too cold or too warm.", "helpfulness": 1, "user": "Bearsfoot", "date": "March 2, 2013", "id": 153527142}, {"rating": 1.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The wifi was out of function in my room, so I had to go to the reception area if I wanted to connect.", "title": "A pack of lazy no hopers - stay away", "helpfulness": 3, "user": "Doc R", "date": "March 1, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 153430265}, {"rating": 4.0, "title": "Great location", "text": "Dinner was okay but the service was very slow. It took them 40 min to serve a creme brûle.", "helpfulness": 1, "user": "Becwoo", "date": "March 1, 2013", "id": 153422414}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "What an excellent hotel to stay at if you want a relaxing time in the city. From the moment you arrive at the front entry your car door is opened for you with a smile. The staff at the reception are courteous, professional and go out of their way to please. The rooms are pleasant & maintained clean with a great view. The whole experience is so relaxing and memorable.", "title": "Fantastic & Relaxing", "user": "Leonarda P", "date": "April 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 127105919}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The location of the hotel is terrific as you are so close to everything but a million miles away in an absolute heaven. The buffet breakfast is great and again found the staff attentive and friendly. Would definitely consider returning again and commend again the staff for their fantastic service in making our stay more enjoyable.", "title": "Nice location but not peaceful", "user": "lovetobrowse", "date": "April 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 127090922}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "Staff were good, I think any issues experienced by previous travellers has been sorted out now and they were all helpful. It was a nice area, in the Rocks, walking distance to Circular Quay and slap bang next to the Harbour Bridge. There are some issues, yes the toilet is a concern, the noise didn't bother me but flushing doesn't flush everything well (not nice). The only real bug-bear I had was the wedding receptions going on across at the other pier. Although the room has thick glass doors even they couldn't handle the live band noise, so despite being super tired, we couldn't get to sleep till that was all over and done with. would I stay here again? Maybe mid week. But not that sure it is the best value for money and at the price of the breakfast, I really expected more", "title": "A pleasant surprise", "user": "SueKSydney_Australia", "date": "March 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126824865}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Born and bred in Sydney, we planned to catch up with friends in our lovely harbour city for a holiday weekend. The views over the harbour were stunning as a expected. The elements that surpised us were the relaxing feel of the hotel and the great food at the restaurant. The hotel is located in the city and very close to the Rocks area, Sydney Opera House, The Botanical Gardens and Circular Quay from where you can catch a ferry to other attractions such as Manly and Taronga Park Zoo. So you would expect the area to be busy. However, it was very quiet and relaxing and a great place to spend a few days with friends. We would happily stay there again.", "title": "Wedding night bliss", "user": "ReneeAbroad", "date": "March 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 126725287}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "I stayed in a Walsh Bay Suite the night before and of my wedding. The room was beautiful- the furnishings and overall style of the room are very current and perfect for pre wedding photos as they are so simple and soft. The suite was also well sized which enabled a number of us to get ready without feeling too cramped and restricted. The lighting for the room was also great- there are so many city based hotels that can be very dim and drab feeling- the Sebel definitely isn't one!", "title": "Great location with friendly staff", "user": "PNas", "date": "March 26, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 126663612}, {"rating": 3.0, "stay_parameters": "Stayed January 2006", "text": "We stayed here over the New Year for 6 days. It is a fairly good location as you are literally right under the Harbour Bridge in The Rocks, however slightly away from the centre of things. There are some lovely restaurants & bars all around, but you have search for them. It is best to set out for dinner early ie 6-7pm, as most restaurants close their doors at 9-10pm. Reservations are recommended. The area along the other piers is being developed into an up & coming place to be.", "title": "New Year's Eve in Sydney", "helpfulness": 4, "user": "KullyA", "date": "February 4, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 2.0}, "id": 4412907}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "Here we were in the heart of throbbing Sydney and we sat almost under the Harbour Bridge looking out over the water. Wonderful views. No noise. No traffic (none of us recall hearing any Bridge traffic noise either). Sitting on the Pier sipping a wine was not only peaceful and calming but also nourishment for the soul.", "title": "Serene Sebel", "user": "Nellie119", "date": "March 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126426122}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Service was attentive and friendly when approached. The hotel is very close to all that is interesting and just a pretty stroll away. But there are some difficulties if you are oldish and ricketty: To get to the Rocks area in 5 mins, one has to climb what seems like a hundred steps. To get to the Circular Quay area in 10 mins, one has a gentle walk around under the Bridge with stunning views - but don't do it in high heat and towing luggage. Darling Harbour is about 35 mins away and all on level ground. However, if you've expended your energy for the day, a taxi is the only way to arrive and depart. There is no shuttle service, which is a bit of a pity for us oldies. But there is the tourist Hop On/Hop Off bus which stops at the front door quite regularly at a cost of about $35 per 24 hours.", "title": "Great Location and Amazing Views", "user": "BrownHaskell", "date": "March 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126396201}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "There are some lovely restaurants (especially Ventuno Italian restaurant) nearby but to spot them you must walk the pier side and not the road side of Hickson St.", "title": "Fantastic Location", "helpfulness": 1, "user": "mum06", "date": "March 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 126212720}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "If I could choose a hotel to stay anywhere in Sydney the Sebel Pier One would be my recommendation. What a beautiful place. Overlooking the water. Looking across to Luna Park. Views to the Harbour bridge. Cruise ships passing by our verandah. We could have fished from the balcony. TV coming out the base of the bed. This would have to be the most exquisite hotel that I have ever stayed in. Complimentary wine, excellent service and a beautiful suite that covered all requirements. I have stayed in hundreds of hotels all over the world. This would have to be the best of the lot. My compliments to management in particular Patrick O'Malley. Ron and Bron Peters", "title": "Incredible", "user": "Maverick309", "date": "March 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154321418}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We have stayed at this hotel a few times, the most recent being in January 2013. I have to say we really like this hotel. The location is not too far from all of Sydney's attractions, situated just west of circular quay beyond Dawes Point. From the hotel it is a short walk to the Museum of Contemporary Art, the Overseas Passenger Terminal, the historic Rocks district and the Opera House. The restaurant and bar offer good, reasonably priced food, and being away from all the commotion of Sydney you can sit and enjoy your meal or drinks in peace. The rooms are well equipped, spacious and have a nice decor. Street parking is fairly easy, but there is a fee. I have not used the valet parking, but I believe it is available. The room charge is very reasonable compared to other Sydney hotels. We would definitely stay again.", "title": "Great Hotel", "user": "m00dle255060", "date": "March 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154243525}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Stayed on Saturday night, when the hotel and the surrounding reception venues were buzzing with weddings--so lots of happy people enjoying themselves, but straining the reception area of the hotel to its capacity. Rooms are nice, with a very comfortable bed and everything else you need. The only issues of any significance arose next morning--firstly, our sleep was interrupted by what we think was the banging of weights & other gear in the gym (we were in room 11--suggest you avoid that); and secondly, the wait staff could in no way cope with the breakfast crowd. Many basic items on the buffet ran out for periods (orange juice, water in the coffee maker, eggs & bacon), and tables remained uncleared for long periods--it seemed the restaurant was badly understaffed. We also noticed food trays delivered to rooms remained uncollected outside doors for 12 hours plus. This contrasted with the reception desk & concierge, which were both efficient & friendly.", "title": "Great position, but service needs work", "helpfulness": 1, "user": "Frans_12255060", "date": "March 10, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 154196254}, {"rating": 2.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We were booked to stay at the Sebel, Pier One, Sydney and arrived there around 13:00. As there was no concierge on duty we lugged our baggage up to reception and were cheerfully greeted, advised that our “Heritage King Room” was ready, given our key and was left to make our way to our room. After four nights at the Langham in Melbourne and paying slightly more, arriving at our room was quite a culture shock. The room had a small window facing one of the walls that supported the Sydney Harbour Bridge. We complained and offered to pay more for a better room. The receptionist told us that the hotel was fully booked but they could put us in a ground floor sea facing room and we were slightly uplifted. We later told by one of the assistant managers that the situation was our fault and that of Travel agent for booking us into the cheapest room.", "title": "The biggest mistake ever!", "helpfulness": 2, "user": "colin d", "date": "March 10, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 154161019}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The room we took was indeed on the ground floor, actually on the pier which meant that every time a boat went by the water swept under the room and hit the sea wall making a loud bang. On opening the door onto the pier we found a pair of old socks and 10 half inflated balloons. Never mind we thought let’s just settle down and enjoy as best we can but later more problems became evident:", "title": "Great hotel, great location", "user": "J J", "date": "March 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 153948272}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "the service was excellent. all staff were friendly. concierge were great, esp matt. good central location. try the great coffee shop next to the city cycle hire (pier \"4\" Hickson Rd). gotta do the bridge climb. dinner at aria very nice.", "title": "enjoyable stay", "user": "lisahart15", "date": "March 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126657012}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "From the moment I walked in the front door I felt relaxed. Staff were friendly and it really was service with a smile. Our room was a waterside king which was perfectly adequate and comfortable. Didn't find the high tech toilet a bother like some other reviewers. Loved the comfortable bathroom flooring though! The weather was miserable so I did spend most of my stay reading near the window and watching the amazing amount of boats and ferries pass by! I did not investigate the gym - thought about it but not this weekend!", "title": "On a wet weekend in Sydney......", "user": "poloka", "date": "March 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 126599722}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Very good hotel perfectly located in the opera area.", "title": "Excellent location & original", "user": "Virg17", "date": "April 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 127541382}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "10 minutes walking from the Sydney opera & very close from \"the rocks\".", "title": "Location Only Real Draw Card", "user": "maryags", "date": "April 7, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 127434591}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Sydney centre accessible walking.", "title": "Sebel Hotel", "helpfulness": 1, "user": "johnsimons", "date": "April 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 127431281}, {"rating": 2.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The view is also very nice ! You can have your breakfeast / lunch / dinner with the bay view.", "title": "The Sebel Sucks", "helpfulness": 2, "user": "snod54", "date": "April 5, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 127290125}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Just one thing : the rooms are a little bit noisy.", "title": "Fantastic Central Location", "user": "BeckyD885", "date": "April 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127232063}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 4.5, "variance": {"poor": 51, "average": 121, "very good": 350, "terrible": 31, "excellent": 387}, "aka": "Sebel Pier One Sydney Hotel", "slim_ranking": 0.178378378378, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "The iconic Sebel Pier One Sydney is Sydney's first over-water hotel. It is a spectacular mix of the latest contemporary design and heritage charm, right beside the Harbour Bridge in an old shipping wharf.Its emphasis on design creates a hotel like no other, from a glass-floored lobby that enables guests to gaze down into the waters of Sydney Harbour, to fully refurbished guest rooms with original wooden beams, steel trusses and contemporary lifestyle furnishings. Our 7 new suites (4 with huge balconies)have recently been written up by Forbes Magazing as among the top 5 suites in Sydney. Alfresco dining is at its finest in our signature restaurant \"FRONT\". The restaurant revels in spectacular harbour views over Walsh Bay. Enjoy modern global cuisine by the spectacular backdrop of Sydney Harbour. Accommodation choices at The Sebel Pier One Sydney include 189 rooms and suites, some on the Harbour Bridge side of the hotel and others overlooking the serenity of Walsh Bay. All accommodation rooms at the Sebel Pier One are non-smoking.The Sebel Pier One has its very own harbourside pontoon, where Guests can arrive in style by water taxi or private yacht, or travel by water to their favourite harbourside destination. For an unforgettable getaway, on the most famous and mosdt beautiful harbour in the world, you need look no further than The Sebel Pier One Sydney."}