{"user_rating": 3.5, "review_count": 253, "name": "The Big Sleep Hotel", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "My son had booked for two nights at cost of £100. He left after only one night due to endless noise from uncontrolled foreign students running a mock in the hotel having room parties. Tried to get assistance from reception no one responded. My son checked out after the first night hotel refused to reimburse the payment for the second night. Basically paid £100 for a night of screaming , doors banging and unprofessional staff.", "title": "Big Joke", "helpfulness": 4, "user": "Itunesjamie", "date": "August 7, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 116399508}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The manager did follow up on the complaint offered a night in a suite with a bottle of wine.", "title": "Nice Room", "user": "debidozi", "date": "July 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0}, "id": 115729163}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "Responded to the offer by email to the manager, who has never responded to my email??? Strange approach to customer service. DONT BOTHER WASTE OF MONEY.", "title": "Welcoming, clean and comfortable hotel that is a compliment to a relaxing break !!", "user": "Reboereebes", "date": "July 24, 2011", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 115726108}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The Room was Big and Light, room 113. Nice bathroom/wet room, paid £99 for the night, not really worth the money though. Breakfast is continental, prefer Full English, not much selection!! Pros: nice big bed/t.v nice bathroom, decor lovely retro design. Cons: Boring Breakfast, dodgy faux fur curtains (looked very cheap), bit pricey for what it is (Eastbourne).", "title": "Pleasant stay, good location and helpful staff", "user": "Chilledoutlady", "date": "July 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115547360}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We booked our first ever stay at The Big Sleep hotel, Eastbourne July 2011 through Late rooms .com and was offered an offer of a suite which we snapped up and oh my how pleased we were that we did decide on. We have stayed at many hotels across the globe from Riu, Sheraton and Lewis group but we were so surprised at the ambiance and the whole package that Big Sleep offers and would recommend a suite stay to anyone that wishes a restful and comfortable stay at reasonable cost. The staff were the Ace cars, Evira is so professional on reception helped by Sharaz ( hope spelling correct?) nothing is too much trouble with a warm smile. We were also impressed by the Manageress and her hands on approach so as to ensure every guest enjoys their stay, again helpful and runs a very fine tuned hotel in great staff, cleanliness and nothing a problem!!!", "title": "terrible", "helpfulness": 1, "user": "Hatters11", "date": "July 11, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 2.0, "value": 1.0, "service": 3.0}, "id": 115259922}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "The Big Sleep is a great option in Eastbourne - the location is fantastic (right on the seafront), the prices are good and the overall vibe is fun. It kind of advertises as a 'boutique' hotel, but that might be pushing it a bit. In reality, it's a big, old seafront hotel that's been refurbished and made young and funky instead of old and frilly. I booked a 'suite' (which is actually more like a big room) and it was great - a huge room with corner windows, a big TV at the foot of the bed and a freestanding rolltop bath in the room - all with views over the sea. Don't expect too much - there was no sofa, no internet in the rooms and basic (but fun) decor - blue furry curtains, nice. There's no restaurant or bar to speak of (but they don't mind you eating your own food in the lounge area) and breakfast was a basic (but very acceptable) buffet. Don't expect high-end designer, but for a seafront option that's clean, well-priced and considerably more fun than the more common 'old' hotels in Eastbourne, go for it.", "title": "Just the ticket...", "user": "plusfour", "date": "August 24, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 3.0}, "id": 117191372}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "We booked the Big Sleep for 2 nights whilst attending a friends wedding in Sussex. From the website and the £75 per room per night (double) price tag I naively assumed this would offer me a similar level of comfort and decor that would have Lenny Henry grinning from ear to ear.", "title": "Not that Big, not much Sleep", "helpfulness": 2, "user": "SJB123Cambridge", "date": "August 23, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 2.0, "service": 3.0}, "id": 117149556}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The reality was somewhat different. For a kick off the website states on-street parking available, they didn't mention this being an additional £2.50 per day, having to keep going out and changing the ticket each morning and driving up and down for 20 minutes looking for a space. In fairness, this is somewhat out of their control.", "title": "Good Value and Great Location", "user": "clairebear74_11", "date": "August 22, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117080306}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "After shoe-horning the hatchback into a parking space we made our approach. The first thing I saw was a hastily assembled chalkboard advertising nightly rates of around £30 less than I had paid. I thought initially that maybe some local schoolboys were playing a prank on us. This turned out to not be the case.", "title": "The Big Sleep ROCKS!!!", "user": "kenny c", "date": "August 16, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 116801304}, {"rating": 3.0, "stay_parameters": "Stayed August 2011", "text": "Onto the hotel itself: if you squinted your eyes you could see the effect they were going for - trendy, kitch and contemporary. Sadly, although 80's prints, block colours and (rather inexplicably) shagpile curtains are bang in fashion, it's less effective if it looks like it has been there for nearly 3 decades. Having said that, it was very clean and the bed comfortable.", "title": "Pleasant enough for a cheap, cheerful hotel.", "user": "holidayrichie", "date": "August 13, 2011", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 116649142}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We stayed here from the 20-23 August 2011. We book a disabled room for my mother who has no mobility at all, and we were very pleased with the room layout and bathroom. There is also a lift for access to the reception area which holds the weight of a mobility scooter. The lift is a little small, loung area very pleasent and styled well. Breakfast was basic, not cooked food and the staff were a little slow clearing the tables for other dinners to use. Would defintely stay here again, only a a short walk from the beach, shopping area and there are plenty of resturants to eat.", "title": "Good disabled room - pleasent stay!", "user": "nordmia", "date": "October 1, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 118816199}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "just returned from staying in big sleep hotel eastbourne we had a suite which was actually a very large room but it did have seaview, large bathroom with rain shower & bath with shower over it walk in wardrobe( but why is there never enough hangers 7 between 2 people) strangest curtains I have ever seen ( 15ft blue faux fur!!!!!!!!!!!!) bed comfy but only 2 pillows per person ( again why), the hospitality tray hidden in the cupboard when it could have been position in a shelf on the wall & do not like wooden disposable stirrers! was the continental breakfast was adequate nothing outstanding on the whole it quite nice place plus it caters for a younger clientel. The staff although young are very pleasant & do their job well.Would I stay there again no but only because there are lots of other places cheaper thar include a cooked english breakfast. Would I reccomend it yes if only for the curtains!!!!!!!!!!!!!!!!", "title": "Hotel stay", "user": "fergus220809", "date": "September 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 118412941}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "hotel was close to the seafront which was nice,friendly staff,great if you have a dog as i did,cost only £5.00 compared to £20.00 in a travel lodge.room was clean and tidy,needed more pillows.the continental breakfast was a let down,very crowded dining area with no space to move.ideal for a night stay.", "title": "great for a night stay", "user": "bourneagain", "date": "September 21, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 118412775}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Be sure to have your eyes peeled for this hotel if you book as the signage is in pale blue which makes seeing it as you drive past pretty hit and miss instead if you are driving towards the pier then look out for the block of flats with a block of purple colour going from top to bottom down the side this is on a corner and across the road torwards you should be the hotel.", "title": "Not as Chic as expected", "helpfulness": 1, "user": "kebab69", "date": "September 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 118365039}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "On entering you are faced with your first flight of Stairs there is a platfrom lift for wheelchairs. The staff are very friendly and happy and this maybe the hotels best feature, we were upgraded to a sea veiw which was lovelt though this meant I couldn't have a pink room (but the sea view won over the colour). It seems there are only two colours of room pink and blue which was a little disappointing I had expected each room to be different and not whole floors to be one colour as they seemed to be.", "title": "Good value, friendly staff, unfussy.", "user": "LondonM_and_l", "date": "August 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 5.0, "service": 4.0}, "id": 117389538}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Me and my boyfriend have just returned from a weekend away at The Big Sleep Hotel in Eastbourne. The pictures online of the hotel are clean, bright and modern, and it does not disappoint, and it is great value to boot! I stuipdly forgot my sponge bag and the general manager could not have been more helpful in ensuring that I got all the things I needed with as little stress to me (and my boyfriend!) as possible. If we go back to Eastbourne we will definately look to get our sleep at The Big Sleep.", "title": "Could not have been more helpful", "user": "weekendtraveller72", "date": "July 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115234648}, {"rating": 4.0, "title": "an easy saty", "text": "we loved this hotel, super clean and good value, all the staff from receptionist to the general manager were professional, friendly and super helpfull. we came to eastbourne for a relaxing and easy weekend break and the big sleep hotel was perfect.", "user": "millionairefee", "date": "July 9, 2011", "id": 115194574}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Having read some of the other reviews, I am surprised. We stayed there due to a friends wedding in the area. We were early for check in, but the staff did everything to help us out before getting to the wedding.", "title": "Unique hotel, friendly atmosphere and comfortable rooms", "user": "JGHants", "date": "July 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115154556}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "The rooms are very clean, well decorated and a good size.", "title": "Refreshing modern vibe with friendly atmosphere", "user": "brightmoon", "date": "June 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 114916930}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "Although there is a charge for Wifi in the rooms, there was free internet access in the lounge area.", "title": "foul language", "user": "chesathome", "date": "June 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 3.0, "service": 2.0}, "id": 114849121}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 33, "average": 54, "very good": 87, "terrible": 17, "excellent": 62}, "aka": "Big Sleep Hotel", "slim_ranking": 0.682926829268, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 3.5, "rooms": 3.5, "location": 4.5}}