{"user_rating": 4.5, "review_count": 103, "name": "The Moorings Village and Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "I've lived in South Florida for years, and this - by far - is the best place to stay in The Keys! The grounds are lush and beautiful; the beach gorgeous and palm-shaded, and - best of all - we had all the privacy we wanted. I'd describe the place as looking like a mix of resorts that you'd find either in the Bahamas or Hawaii.", "title": "best in the keys!", "helpfulness": 7, "user": "Gatoresq", "date": "August 24, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 4.0, "cleanliness": 5.0, "rooms": 4.0, "location": 5.0}, "id": 5705115, "likes": {"liked": "— private", "disliked": "— next time we'll rent a house directly on the beach"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2004", "text": "We stayed in a 2 story, 2 bedroom house which was very nice, clean, comfortable, light and bright. Excellent central AC, and comfortable beds. French doors in most rooms which led to shaded balconies. All requests were dealt with immediately by the staff - all of whom were very nice and welcoming.", "title": "Shhhh...for the love of god...Shhhhh!!!!!", "helpfulness": 5, "user": "CMBMA_via_NBNY", "date": "January 16, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4356248}, {"rating": 5.0, "stay_parameters": "Stayed August 2001", "text": "We generally had the swimming pool to ourselves, but really loved the beach. They have a wooden massage hut which wasn't being used, so my wife sat in the shade with ocean breezes blowing and 2 ceiling fans cooling her from above, while I generally opted for one of the hammocks hung betweem palms. We saw no one else on the beach for most of the day.", "title": "Peaceful, hidden, relaxing", "helpfulness": 5, "user": "My_name_is_Paesan", "date": "March 16, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 3277649}, {"rating": 5.0, "title": "Private Retreat", "text": "Although our 7 year old daughter loved the place and never got bored, all of the touristy \"Keys\" activities were a short drive away.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "December 23, 2004", "id": 2922447}, {"rating": 4.0, "stay_parameters": "Stayed September 2004", "text": "Only negative was the mucky entry into the ocean water - which is throughout The Keys. Bring water shoes, walk out a bit, and then you will find abundant clear sand and water for soaking. Or take a kayak out on the very calm waters and float around for a few hours, which is incredibly relaxing.", "title": "Private Island", "helpfulness": 7, "user": "Rebelclancy", "date": "December 1, 2004", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 2858236}, {"rating": 5.0, "title": "and let there be....... 'Peace on Earth'!..... there is here!", "text": "I have stayed twice at this amazing place. So private, so secluded. Always clean and trendy. If you want privacy and romance, this is the place. The honeymoon suite, small but more than exceptable. The bathroom doors lack the privacy one might want, but it's worth it for the pleasure of borrowing this space for a short time. My favorite hide-away from the world. Hammock; a beer on my right; my love on my left, what more could I want........heaven on earth", "helpfulness": 6, "user": "A TripAdvisor user", "date": "July 20, 2004", "id": 2311054}, {"rating": 4.0, "title": "Private, Pricey and Pristine: No Kids", "text": "The Moorings is a lovingly kept series of bungalows on the man-made beach of Islamorada. The houses are set up as informal but grand and comfortable. The feel is private.....meaning guests do not interact nor do they wish to be distrubed with most children or noisy individuals. This is a special place for those who want to pay up to 5K a day for a home on the beach. Mind you-the beach is small, and unswimable for the most part. However-there is a lovely little pool and tennis court and there is no room service or restaurant. YOu would never know that this place existed...really-it is meant to stay that way. So if you want to hide...go here.", "helpfulness": 17, "user": "A TripAdvisor user", "date": "June 28, 2004", "id": 2226024}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 1, "average": 4, "very good": 11, "terrible": 1, "excellent": 86}, "aka": "The Moorings Village Hotel Islamorada", "slim_ranking": 0.157894736842, "description": "Once a coconut plantation, The Moorings Village Resort offers one, two and three bedroom villas, cottages and plantation houses with wraparound verandas, colorful Bahamian-style shutters and cypress interiors, each uniquely decorated. Hidden in delightful seclusion under coconut palms are the resort’s magnificent natural white sand beach, heated pool, tennis court and Island Body and Sol Spa, which offers beachfront massage treatments. The Moorings Village offers guests absolute privacy and tranquility with all the comforts of home, including well-equipped kitchens and laundry in most houses, individual dining rooms and living room areas, air conditioning and ceiling fans. Luxury amenities include large screen televisions, elegant hand-painted tiles, oversized soaking tubs and shower stalls, as well as plantation-style porches overlooking the ocean or views of the lushly landscaped grounds. Guests may enjoy dining at the resort's two Zagat-rated restaurants, Pierre's Restaurant and Morada Bay Beach Cafe, located just across the road. The restaurants share a private beach and are the site of the monthly Full Moon Party."}