{"user_rating": 4.5, "review_count": 151, "name": "The Mustard Seed at Echo Lodge", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "My husband and I recently spent a night at the incredible Mustard Seed. I really cannot say enough about the wonderful hospitality here. Dan, John and all the team are so friendly, pleasant and thoroughly professional. We had a beautiful room in the main house, all blues and creams, full to character, dinner that evening was first class and we then enjoyed drinks afterwards in the main reception area which had a cosy, welcoming fire and big comfortable sofas. We had a stroll around the gardens, where they grow all their own veggies, herbs and fruit and just never wanted to leave. We cannot wait to go back.", "title": "Just fabulous!", "user": "ingrid45", "date": "August 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136710631}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Just a few minutes drive south west of the charming village of Adare is this wonderful country inn. Once a convent, it has been converted into a beautiful inn, that also features amazing dinners and great breakfasts featuring fresh flavors picked from the kitchen gardens out behind the house. I hesitate to describe this place as a B&B, in case that conjures up images of someone renting out the spare bedroom down the hall. Not only is this a beautiful country estate home filled with interesting art and surrounded by spectacular grounds, gardens and paths, it also features great personal service in a relaxed (not stuffy) but very attentive style. As for the food, well there is good reason that folks come from miles around to dine here. The 4 course dinner was excellent, and featured a surprising number of choices to pick from. It was delicious, and served with that same great service that has you feeling at home despite the gracious surroundings.", "title": "Treat yourself to this place, your worth it!", "user": "CalgaryCdnCouple", "date": "August 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136678341}, {"rating": 5.0, "title": "Fantastic!", "text": "An absolutely superb place to go for a treat. Nothing was too much trouble, great old house. But the best bit is the dinner..... Exceptional food, and impeccable but relaxed, friendly service. Dan and John obviously take huge pride and care in what they do.", "helpfulness": 2, "user": "R B", "date": "August 5, 2012", "id": 136311073}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "There are not enough superlatives to describe our recent two day stay. From the heartfelt greeting to the warm goodbye everything was first rate. The dinner was so delightful that we cancelled our plans to dine elsewhere the second night so that we could enjoy the Mustard Seed again. John and Dan clearly love this place and it shows in the attention to details and desire to please their guests.", "title": "A Gem", "helpfulness": 1, "user": "hwstein", "date": "July 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135506413}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "We were there on Sat night to celebrate a birthday. We had a great night, the food , service were outstanding.", "title": "Great night", "user": "CurlyWurlyIreland", "date": "July 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135480151}, {"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "Had a really wonderful night here. Food was delicious. Service was top notch. I will definitely return for more", "title": "Superb", "user": "paultoptooth", "date": "July 7, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 133714680}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Best gourmet dinner in all of Ireland! Fixe 4 course dinner for 60 Euro. Service was exceptionally good. The rooms were very large. Our children's room was as large as many apartments in the US.", "title": "Best B & B we visited", "helpfulness": 1, "user": "CamelaA", "date": "July 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 133234366}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Thank you for making us feel at home right away. We loved the personal attention to details and how much you care for each of your guests. The food was exceptional, but your service was even better. We loved every minute and will definitely return. Special thanks to John and Dan.", "title": "Everything was perfect.", "helpfulness": 2, "user": "Karen K", "date": "June 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132715138}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "My daughter recently took my husband and me here for my birthday and from the moment we arrived until we left in the morning everything was first class (but they didn't have Marmite). Dinner was delicious, the wine was excellent and the room delightful. A treasured memory. Thank you to all the staff.", "title": "We were so well looked after", "user": "Betty N", "date": "June 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132214354}, {"rating": 5.0, "title": "Exceptional cuisine, Tranquil location, Heavenly ambiance!", "text": "Our absolutely favourite place to go for special and family occasions. In a nutshell, perfection and attention to detail comes as standard. The perfect place to bring visitors you really want to treat. Always a warm greeting on arrival......even when it's very busy. If you are visiting the Limerick area, don't miss a meal or stay in the Mustard Seed.", "user": "MeerwaldBaker", "date": "May 19, 2012", "id": 130212805}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "Stayed here for a last minute night away in October 2011. Got a decent price on DBB.", "title": "The food makes the place!", "user": "RoryMc", "date": "September 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 139874797}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The house itself is on beautiful grounds not far from the lovely town of Adare.", "title": "Just What We Needed!", "user": "Rsrl09", "date": "September 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 139402438}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Lovely old style house with a wonderful feel of history about the place.", "title": "The Mustard Seed an exellent escape", "user": "John M", "date": "August 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 138995718}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "Rooms were equally pretty, if a little on the smaller side,with small little tv, but all in all very good and totally clean.", "title": "Lovely stay", "user": "Jdwyer1986", "date": "August 18, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 137532522}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "In fairness it's the evening meal in the lovely dining room that makes the stay memorable. it's pricey at €50-€60 a head, but it's one of those occassions where the food is of such high quality that it's worth and..flavours, preparation and taste, a lot of which comes from their own garden.", "title": "Excellent as usual.", "user": "LBJDublin", "date": "August 14, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 137184072}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Our first visit and stayed for one night over St Patrick's weekend . Our room was fabulous and the attention and service we received was so welcoming. The food was excellent . enjoyed both dinner and breakfast. Lovely walks around the property and the weather was beautiful for March . Really enjoyed it and well worth a visit. We chose from the ' Blue book' selection which can be recommended.", "title": "A really lovely place", "helpfulness": 1, "user": "santaDublin", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128395060}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Popped down for a short stay really on the spur of the moment, my partner having recently had had an operation a bit of peace and quiet and pampering was called for . What an excellent choice the welcoming could not have been more friendly and even though we were quite early were shown to our room. We also met Miss Tanzi (not sure of spelling here) the 18 year old cat fast asleep on the couch, we found her to be lovely and was not shy in getting stroked and purring away. Apparently she is now mainly confined to the outside of the house, which is a shame given her age, but being a good cat she finds a way in.", "title": "Really lovely spot, excellent food & service", "user": "DonNenagh", "date": "April 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127660866}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "Food was excellent, really really good. Presentation was great for both dinner and breakfast there was not a pick left on the plate (the porridge with cream and whiskey is just yummy by the way).", "title": "The Special Place for those Special times", "helpfulness": 1, "user": "SileGorman", "date": "March 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126179670}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The room had a slightly odd collection of furniture but was spotless, as dark as coal at night and as quiet as the grave - perfect for a good nights sleep in my book. We will most certainly be back and I cant wait.", "title": "Great Food", "user": "SparkleandDusty", "date": "February 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 125119327}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "I first visited for my 25th wedding anniversay and fell in love with The Mustard Seed at Echo Lodge, the welcome, the comfort, the wonderful food, the great wine list, the ambience , the garden - everything!", "title": "Really lovely, almost perfect except for cat!", "user": "tynifk", "date": "February 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 124713281}], "location": {"country": "Ireland", "continent": "Europe"}, "stars": 4, "variance": {"poor": 3, "average": 11, "very good": 13, "terrible": 1, "excellent": 123}, "aka": "The Mustard Seed At Echo Hotel", "slim_ranking": 1.0, "description": "Nestled in the heart of the Co. Limerick countryside is The Mustard Seed at Echo Lodge, a converted 19th century convent. The celebrated and comfortable Echo Lodge is set amid mature trees, herbaceous borders, orchard and kitchen garden. Home to The Mustard Seed restaurant, the busy, buzzy dining room has long been highly acclaimed, attracting lovers of good food and fine wine from around the globe. The Mustard Seed is an oasis of understated luxury."}