{"user_rating": 3.5, "review_count": 1901, "name": "The Anabella", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Very beautiful hotel. We loved our suite. The Bell staff was AMAZING. Hotel is about a 10 min leisure walk to Disney Grand California hotel which you go thru to get into the park or about a 15-20 min walk to maingate. ART bus stops just outside the hotel property. Tiffy's next door is a great place to eat and get ice cream. Pool area was very nice and property was well kept. We did have one minor housekeeping issue but that was fixed within 30mins of me talking to front desk. Our package included parking but if your package doesn't include it the cost is $14 a night. During our stay our TV was upgraded. We asked and discovered that all the rooms got new TV, Awesome. Very nice hotel, with great staff. Close to park.", "title": "Casita Suite", "helpfulness": 3, "user": "Lori M", "date": "September 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 140969998}, {"rating": 2.0, "title": "Not what I expected", "text": "I booked this room on the recommendation of a family friend who travels to Anaheim frequently with family. They really pumped this place up. I had some pretty high expectations despite some of the reviews I read. Well, I'm sad to say I was disappointed. We called to see if we could check in a little early and was told by Tatiana that it would be a $50 charge. Because we had driven through the night and were exhausted, we were willing to pay. After some time on hold she informed us that there were no rooms open. Checkin is at 4pm. We showed up 2 hours before check in ayways and they let us check in with no issues. Interesting. We get the keys to our room and when we arrived in our room, we quickly noticed it was not the room we reserved and prepaid for. We reserved a room with a king bed and daybed. What we got was a crusty sofa bed. When I called the front desk Tatiana answered again. I informed her of the mixup up and she let me know that we were in the right room. I asked her what her definition of daybed was because clearly it was a pull out sofabed! We were so tired that we were just going to stay in the room. However when we tried to pull out the SOFABED it banged against the wall! It was too big. Not only would it not open all the way, but it completely blocked the pathway the bathroom. You couldnt get to the bathroom without climbing on the bed and crawling over. Not good. I was forced to walk over to the front desk and inform them of the situation. Thankfully, Matt was there and quickly resolved the situation. He \"upgraded\" us to a small suite in another part of the property. It came with a queen bed and guess what? A real daybed... The one we paid for! So there were daybeds in this place! Unfortunately I had to sacrifice a king bed to get it. We arrived and there was either a chocolate stain or blood stain on the duvet. I'm telling myself it was chocolate because the latter is just plain disgusting! We had to call the front desk for the 3rd time in 10 minutes! The maid quickly came and apologized, replaced the duvet and left.", "helpfulness": 3, "user": "Marylouise R", "date": "September 23, 2012", "id": 140963764}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "The room itself was in decent condition. Low water pressure in the toilet. The AC unit was super loud and not positioned well. The other reviewers were right. It's important that you get a room on the 2nd floor. It sounded like we had a small team of bulls running around in the room above us.", "title": "Great Place To Stay!!", "helpfulness": 2, "user": "778Ann", "date": "September 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 140887517}, {"rating": 3.0, "stay_parameters": "Stayed September 2012", "text": "Overall, I'm disappointed in this stay. I had higher expectations. Forthe record sofabed does NOT mean daybed. There is a differece. Google some photos. Next time I'm in Anaheim I'm going to stay at the Homewood suites. May be further away but the rooms are great and you can't beat the free breakfast every morning! They also hook up chocolate chip cookies at night so after a long day at Disneyland or ca adventureland you can have warm fresh cookies and milk!", "title": "Nice but nbeds up keep!", "user": "harf61", "date": "September 21, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 140875016}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "The 3 of us stayed there for 4 nights and had a great experience. It is walkable but it will take you 15 mins and with little ones in tow 20 mins. Too much walking for our 6 year old daughter and for us so we purchased ART tickets from the lobby and the bus leaves just outside the motel to get you to Disney Land Resorts. The food is very good! We ate there every morning as we had food vouchers and had dinner there twice and it was great! The mahi mahi dish and ribs were yummmmy. The pool and hot tub was a great way to end the day and soak the very tired feet! Would definitely stay there again.", "title": "Great stay near Disneyland", "helpfulness": 1, "user": "Robin E", "date": "September 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140859958}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled solo", "text": "The first room i was put in was horrid. The curtains were pinned to the wall by push pins, some of the panel on the blinds were broken off, so people can actually see me sleeping, or try to that is, next door to me was the housekeeprs breakroom and next to that was the laundry room, I could not sleep - I could hear the washers going all night long, the squeaky door was irritating, There were about 7 channels to chose from if u wanted to watch TV, Walls and floors were so thin, you could hear every word that was said next doors and upstairs. When the housekeepers car pool arrived- you were waken up by the car horns. So after three complaints i made, they moved me to a difft room. This room was better in ways of room size, however the noise was persistant, The guy next door to me was yelling to the housekeepers at 10PM telling them to be quite- because he could not sleep, so I could not sleep again. I would not stay here again. And I had to pay to use the business center at $6 for every 24 hours and they close it at nights, what a rip off. The only thing great about this hotel were the bellmen and concierge (however he didnt know alot about transportations). If you like to rest and be comfy at night this is not the place for you.", "title": "would not stay here again", "helpfulness": 9, "user": "happytrailsColorado", "date": "November 27, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 11102404, "likes": {"liked": "— bellmen were nice", "disliked": "— rooms, thin walls, noise"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "I've read the bad reviews and do not understand. Our experience was very good. The rooms are reasonably spacious and accomodating - and very clean. Yes, there may be incidental noise. If you want concrete walls, ceilings and floors you'll probably have to pay more. We did 3 rooms for 3 nights for under $100 each night / per room.", "title": "Clean, pleasant, enjoyable", "helpfulness": 4, "user": "Travelersss", "date": "November 26, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 11062484, "likes": {"liked": "— See my review", "disliked": "— See my review"}}, {"rating": 5.0, "title": "Response to Expedia Issues", "text": "The staff was effiecient and always friendly. Even the Maintenance manager guy seemed really concerned about a clunking noise I had heard during one of the evenings.", "helpfulness": 5, "user": "millettesinbend", "date": "November 25, 2007", "id": 11054838}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Parking was free due to our AAA affliation.", "title": "Hotel Uses Bait and Switch Tatics and Lies", "helpfulness": 3, "user": "lklien", "date": "November 24, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0, "rooms": 1.0}, "id": 11025781, "likes": {"liked": "— Nothing, I hated this Hotel more than any I have stayed at. I hate lying Managers on power trips.", "disliked": "— Parking fee, Internet useage fee, no microwave or free breakfasts."}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "I don't expect to walk across the street and walk through the front gate of Disneyland. The city shuttle ran OK.", "title": "The second room was a life-saver!", "helpfulness": 3, "user": "BayAreaSoccermom", "date": "November 22, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 10991792, "likes": {"liked": "— Having two bedrooms", "disliked": "— The lighting system"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We arrived late Sunday after flying in from vancouver....with my grandson (10) and sister and bro. in law....upon arriving, we had a long wait while my sister talked and talked with the front desk people....our rooms were not available, and they made it sound like travel agents offer the moon and then these guys have to fix everything...I was not impressed with that. I thought travel agents were a boon to the hotel business and deals were made and done.", "title": "nice resort, minor disappointments", "user": "valerie m", "date": "September 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 141240090}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "Bathtub backed up for a few days, but when I called the desk, they sent a nice maintenance guy to fix it, and he did, no more water problems.", "title": "glad we changed our reservations to stay here at the last minute!", "helpfulness": 1, "user": "Kirstie O", "date": "September 25, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 141200523}, {"rating": 4.0, "stay_parameters": "Stayed September 2012", "text": "I didn't like the water being there (yes it had a $3 price tag on it, and of course I didn't notice that for 4 days)....I actually thought it was free...I paid, but I'm more aware now.", "title": "Awsome service and great room", "user": "brandonclayton", "date": "September 25, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 141198999}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Beds were wonderful and comfy. My grandson and I enjoyed the room and the pool...we spent the last 3 days relaxing, swimming and tv in our airconditioned room...it was great.", "title": "Nice Hotel - Beware of Add on Costs", "helpfulness": 1, "user": "anansi", "date": "September 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 141196677}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Our breakfast tickets were great...we ate healthy and delicious food....just had some trouble with getting hot eggs and potatoes...had to send back two mornings (I try not to be a complainer, but I like hot abreakfasts), they were gracious and good about it. We found out those breakfast cards already have a 75cent tip included at the end of the trip.", "title": "Best Hotel bed ever", "helpfulness": 3, "user": "mrjunter", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141101540}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "I celebrated my 40th birthday weekend with my friends at Disneyland. We spent the night at the Anabella Hotel. What a unique and beautiful hotel. Unique in that each set of hotels are named with beautiful latin cities. The latin motif was a nice touch and the rooms were spacious and clean, including the bathroom. The hotel was conveniently located across the street from Disneyland. They were able to accommodate my large party and their families. They were very helpful and courteous. I appreciated their kindness and patience. I will definitely stay their again and often.", "title": "Very Nice", "helpfulness": 1, "user": "Hula324", "date": "December 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 11703956, "likes": {"liked": "— The location", "disliked": "— nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "We just returned from a five night stay at the Anabella. Our experience was just ok. It sounds like from other reviews that some rooms have been renovated and some have not, I don't think we were in a renovated room. I will say that the staff was all wonderful - no complaints there. Check in was a breeze and went really quick. The first room we were in was a Casitas suite. It was spacious - king bed, tv, desk and pull out couch in one room and a queen bed and tv in the other. There was only one bathroom which made it awkward for our neice who was sleeping in the room without the bathroom - she had to walk through our room to use it in the night. Not a huge deal. There were stains on the carpet and stains on the couch wich kind of grossed me out but was willing to put up with it for what we paid. One of us went to take a shower that night and the bathtub leaked so the whole bathroom flooded. There also was no exhaust fan in the bathroom. I will say that the bathroom was beautiful, that looked newly remodled. After the bathroom flooded we had them switch us to a kid's suite which we were happy with for the most part. It looked newer than the other room we were in. It had hard wood floors, one room with bunk beds, one room with a day bed and tv, and the main room had a queen bed, tv and desk. Again only one bathroom. The bed was horribly uncomfortable. We have yet to sleep on a hotel bed we like though. The floors and walls are paper thin. One night we called the front dest three times to complain that the people above us were jumping or something and making alot of noise around midnight but realized the next day that the floors are just so thin that you can hear everything. That kept us up for alot of the night and we weren't very happy about that. Our neice could hear every word the neighbors were saying from her room with the day bed - that kept her up alot of the night as well. The top bunk of the bunk beds does not have a rail even though they told us it did. We had to create our own rail using the ironing board.", "title": "You get what you pay for", "helpfulness": 3, "user": "misty0809", "date": "December 8, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 11328324, "likes": {"liked": "— Felt clean", "disliked": "— Noise, bed"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "if you are going to stay here I would suggest a top floor room and a kid's suite if you have kids. This is a budget hotel and you get what you pay for. The walk isn't bad despite what others say. Ten minutes max. We found a couple short cuts. You can go through downtown disney or you can catch the bus at the Timoon and Pumba parking lot which is across the stree from the hotel. We have realized our standards are too high for a budget hotel so we won't be staying here in the future but if you don't have high standards this hotel is just fine.", "title": "Nice hotel close to Disneyland", "helpfulness": 6, "user": "LAStravel", "date": "December 6, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 11286335, "likes": {"liked": "— higher quality and nicer rooms than the surrounding hotels/motels", "disliked": "— nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We had seen deals for this hotel every once in a while, but people had made it sound too far from Disneyland. This last trip we got a great price and gave it try. The walk was nothing! Some people took the ART bus which stops right out in front, but it is an easy walk to go down Disney way and cut through the Grand Californian out to Downtown Disney. It was only about a ten minute walk.", "title": "Caveat Emptor or Caveat Empty? (AKA Empty Promises)", "helpfulness": 8, "user": "mzjuniebug", "date": "December 4, 2007", "detail_rating": {"front_desk": 2.0, "service": 1.0, "business": 1.0, "value": 1.0, "rooms": 2.0, "location": 2.0}, "id": 11254274, "likes": {"liked": "— Poor customer service"}}, {"rating": 5.0, "title": "Terrific property and an exceptional value", "text": "The hotel was perfectly clean and nice. It was a lot nicer than most hotels near Disneyland that we have stayed in. They bumped us up to a king bed deluxe room (I think since we were there mid week and they weren't booked up), but it was nice to do and the room was great. We had a huge flat screen TV and a great bed. The front desk attendants were very nice, the pool was great, the restaurant looked good, but we didn't eat there. It was nice to have two coffee shops right next door to save money on breakfast or dinner or to get a dessert cheaper than in the theme parks.", "helpfulness": 4, "user": "familytraveler37", "date": "December 1, 2007", "id": 11194496}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "My 16 year old son and I stayed at the Anabella this last July during our 12 day trip to Disneyland. We stay there everytime we make a trip to DL which is normally 2-3 times per year. However this trip we split the time between the Anabella and Paradise Pier (on DL property). The Anabella is like being at home, the staff has always taken immediate, excellent care of us, the rooms are clean, comfy and safe, those are very important items to us. We stayed at the Anabella for 7 nights then moved over to PP for the last 5 nights. Now don't get me wrong it was great to stay on DL property (first time for us) but the room was nothing spectacular especially for the price! The other problem was there is no shuttle from PP (we took ART from the Anabella) to the park and the walking distance is just about the same as walking from the Anabella. From now on the Anabella is the only place we will stay!!! We are members of the frequent stay program and I think it's a great rewards program for return guests! We'll be back in December to our home away from home and we can't wait!", "title": "Awesome...as usual", "user": "nettfrankie", "date": "October 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20937202, "likes": {"liked": "— Everything but mostly the 'at home' feeling", "disliked": "— Once when we stayed last year the room was very noisy"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "We stayed at the Annabelle Hotel for 6 nights in September. I will admit to being quite concerned about our accommodation after reading some of the reviews.", "title": "Loved the Annabella Hotel", "user": "Jenni50", "date": "October 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 20842513, "likes": {"liked": "— Our Very Comfortable Room", "disliked": "— lack of teabags in the room"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "We were there for a Safety Convention held at the Convention Centre and our friends made the booking. We arrived a few days early to enjoy Disneyland.", "title": "Just Peachy", "user": "kikrox", "date": "October 12, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 20833199}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "We found the Annabella to be perfect! We loved its close proximity to Disneyland and the Convention centre. It is also very close to many restaurants with the Wonderful Cheesecake Factory and Tiffany’s close by. We had a two-bedroom on the first floor close to the street which was quiet,clean, roomy and nicely decorated with a shower over the bath and we used the extra room for our luggage and souvenirs. The staff were warm and friendly.", "title": "Great Casitas", "user": "ebs1115", "date": "October 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 20625729}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We would highly recommend this hotel and will certainly consider staying there again!", "title": "Loved it!", "user": "vanessaperez125", "date": "September 30, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 20509685, "likes": {"liked": "— The locaation, the great rooms, and the garden area outside our room!", "disliked": "— some food that the staff forgot to clean up on a patio table outside"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "I had a room with 2 double beds. The carpet had a plastic price tag in the middle of the floor, which made me wonder when the carpet was last swept. The corners of the carpet seemed a little dusty. Everything else seemed very clean. The door to the bathroom had been repaired and needed painted so that the paint was the same over all of the door. I did not think the bed was comfortable. However, I requested extra soap and they were very quick in bringing it to me. Everyone was very nice. They had a grab and go breakfast at the Tangerine Restaurant that was convenient.", "title": "Okay.", "helpfulness": 1, "user": "Kim13333", "date": "September 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 141289014}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Our family stayed here for 4 nights in Sept 2012. When we checked in they could only allocate two rooms on same floor and the other in another block near the exit. Check in staff - so-so - not very interested. The king room was wonderful as it was a suite - although dark and the cleaners room was above. The other queen/queen rooms were bright and sunny - althogh would prefer carpeted room over mock wood flooring they are now installing. You end up with filthy feet and thats not ideal with white bedding. The kids pool was pretty much taken over so preferred the adult pool - lovely but right on the noisy highway. The location was great with a ten minute walk to Disney land. The parking fee is 14.00 per day and the Wifi fee is 3.00 if you use the media room..which is always full or you pay 10.00 per day for use in your room...bad reception so dont bother. Watch for hidden fees in your rate. Would rate this 3.5 stars.", "title": "Anabella Hotel - Sept visit", "helpfulness": 2, "user": "Freebirds3930", "date": "September 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 141287742}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "The Anabella Hotel is truly a \"breath of fresh air\" with its cozy rooms, close proximity to Disneyland (literally a 10 minute walk to Downtown Disney), and so affordable given the great location and plush accomodations! They have several room layouts to choose from including spacious suites to get some privacy from the kiddos :) The staff were super-friendly and very accomodating! LOVED the entire experience...makes me want to go to Disneyland more often!", "title": "The Anabella Hotel is AMAZING...and surprisingly affordable!", "helpfulness": 2, "user": "Erin D", "date": "September 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 141282483}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We have stayed at this property several times. The rooms are reasonably clean and the property is walking distance to Downtown Disney and the Disney parks. Also, the grounds are generall nice and well landscaped. However, the family suites which have enough space to accomodate our family (6 of us) are all near the exit and next to the custodial facilities and offices. The noise of the street, the laundry room, together with the room cleaning carts and the staff all congregating in this area make it feel like you are in the service zone, not the guest zone, of the hotel. Our suite had a large room with a king and a sofa bed, then a private room with a double. There were a walk-in closet and a small bath off the bedroom. Unfortunately 6 people in one bath was not convenient. Also, we saw a cockroach scramble away when we first entered and turned on the lights. Other comparable properties in the area (and a closer walk to the parks) have suites with 2 bathrooms priced slightly less and including breakfast. We would have opted for one of these properties this visit, but we did not cancel our reservation in time. We were told we could cancel with no charge three days before check-in. We called to cancel on Monday morning for a Wednesday afternoon check-in. I counted 3 days (Monday, Tuesday and Wednesday), but they disagreed. I spoke to 2 managers, but to no avail. According to them, the cancellation had to occur on Sunday.", "title": "Average", "user": "William S", "date": "September 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 141258684}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "I had originally made reservations to stay at a hotel right across the street from Disneyland on Harbor Blvd., but i was starting to get worried about some of the reviews I was reading. The Anabella was just perfect. We checked in late Friday night. Derek , who was at the front desk, was extremely helpful, courteous and friendly. He gave great customer service. Our room was immaculate. The beds were all super comfy, we slept wonderful all four nights we were there. Just a short walk to Disney. We'll definitely come back!!", "title": "glad we changed our reservations to stay here at the last minute!", "user": "Kirstie O", "date": "September 25, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 141255464}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We only stayed here one night after checking out of a Disney Hotel. The hotel is more Motel style and you can park your car near your room. The beds were comfortable and the rooms were clean. We were 'upgraded' to a suite but the second room was sort of like a broom cupboard with a sofa in it. I would have preferred the standard twin. It is in a great location for Disney and for the money I don't think you can go wrong. If we lived in the USA and Disney wasn't such a big 'treat' for us i would use the Anabella again.", "title": "Looks great for the cost", "helpfulness": 2, "user": "robmigrates", "date": "September 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 141632295}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "The Devine pillow top beds and linens are so comfortable. The staff was very friendly and helpful. The rooms are spacious and clean. Landscape is awesome. We watched the fireworks every night from our balcony. There is a laundry on the grounds for the guest. The location is perfect for disney and the beach. Pools were clean. Food was great! Appearance of everything is beautiful and real. Great wi-fi and iron and ironing board. Safe works in the room. I stayed a 8 days and would do it again if I have the chance.", "title": "Best Week Ever", "helpfulness": 1, "user": "RebeccaHarrell", "date": "September 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141617349}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "A Louisiana nurse :)", "title": "GREAT AS ALWAYS", "helpfulness": 2, "user": "Richard K", "date": "September 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141559755}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "My wife and I have stayed here in the past and always the staff was great. The room was clean and very pleasant. We love the location and will stay again. We visit Disneyland about 5 or 6 times a year and always stay at the Anabella. The pool is great and very clean always. We also like the fact that the room has wood floors. We have friends that stay here all the time and have always enjoyed there stay.", "title": "RECENT STAY", "helpfulness": 1, "user": "r k", "date": "September 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 141499244}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We recently stayed at this hotel for a family vacation and booked one of the family suites. It would have been nice to have 2 bathrooms with the 2 room suite instead of one and the tub never drained properly. We always had plenty of towels and the room was clean. The wood floors were a little funny feeling on your feet in front of the air conditioner where they were getting moisture but otherwise a nice hotel.", "title": "Great for Disneyland visit!!", "helpfulness": 1, "user": "Belizefans", "date": "September 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 141458590}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Our stay at the Anabella more than met our expectations! We arrived around noon and were able to check in immediately and 'hassle free'. We enjoyed a wonderful lunch outdoors on the patio. It was very quiet at night and the bed was very comfortable and appreciated the wonderful duvet.", "title": "The Anabella was Great!", "helpfulness": 1, "user": "djstdenis", "date": "December 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22656445, "likes": {"liked": "— Everything was great!", "disliked": "— Nothing at all was negative."}}, {"rating": 1.0, "stay_parameters": "Stayed March 2006, traveled with family", "text": "Staff were all great. We also enjoyed wonderful transportation with VIP transportation, which was always on time, courteous and went the extra mile for us. The room was always clean when we returned in the evenings and well stocked with soap, shampoo and clean towels.", "title": "It sucked!", "helpfulness": 1, "user": "Craigjw", "date": "December 8, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "location": 4.0, "rooms": 2.0}, "id": 22564627, "likes": {"liked": "— nothing", "disliked": "— everything"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008", "text": "It was a great holiday experience and we would definitely stay there again and will highly recommend it to our friends. We will also contact our travel agency friends to let them know that this was a wonderful place to stay.", "title": "Pretty good for the price", "helpfulness": 1, "user": "pbnj4eva", "date": "December 3, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 22419015, "likes": {"liked": "— The unique layout of the concierge room", "disliked": "— Housekeeping not attentive"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "I, my wife and daughter stayed at the Anabella in 2006 during our tour of the USA. The Anabella was simply horrible in terms of food, accommodation and service. It was more like an upgraded version of a family camp than a hotel. Breakfasts were cooked outside by chiefs who did not know what a ‘poached’ egg was! Everything was cooked in butter or fat and was totally unacceptable to Australian and New Zealand guests who they claimed to cater for. It was an effort to get ‘toast’ as opposed to waffles. The Restaurant was second-rate food and my bet is that they were using low-waged labour and unqualified chefs from across the border… We stayed on the ground floor and could hear the people above walking around. We asked for a top floor but were denied. We were accused of not paying one of our meal bills in front of the whole restaurant – which of course, was not the case. The staff were rude, particularly the women who ran the restaurant! I told my Australian travel agent to take it off their list...", "title": "Decent. Not scary like I had thought", "user": "chempenn", "date": "November 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 22041401, "likes": {"liked": "— close proximity to disneyland and the bed linen", "disliked": "— no ventilation fan inthe bathroom and pillows like small linen covered boulders"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "We stayed in one of the concierge rooms, and with the Entertainment card discount, paid 1/2 the price listed on the website. The first room we had smelled a bit musty and was a little dark. They moved us to the second floor, which was bright and clean. The location to Disneyland was pretty good, although you have to time it right to get the bus to the park, which can take up to 20-30 minutes wait time. My only complaint is about the timeliness of housekeeping. Each morning we left by 7:30 am and came back at 1-1:30pm for lunch and a nap. The room never got cleaned/serviced until we actually put the sign out on the door. All other grounds staff were very friendly and helpful. The manager of the Tangerine was wonderful and did everything she could to make our meals there enjoyable, which they were!", "title": "Great... except for the first night", "user": "mark94086", "date": "November 12, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 21763471, "likes": {"liked": "— Location, room size", "disliked": "— Front desk"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "My husband and I stayed at this hotel for our Honeymoon and found it to be a lovely place to stay. The location was great with only a 5 to 10 minute walk to Disneyland. We booked a concierge room and found the little extras to be great. The room itself was very clean and comfortable. The pools were good, although the adult only pool was small and noisy as it was next to the road. Our continental breakfast was very good with fresh fruit and muffins. We were unhappy, however with the check-in time of 4p.m., no exceptions even after speaking with the manager. We were also upset that the restaraunt and desk staff denied us use of a microwave to warm up some soup we had. My husband actually walked to the hotel next door to use their microwave! Overall, the room and location were perfect....cleaning and serving staff exceptional, desk and managerial staff disappointing.", "title": "Lovely Hotel to stay at", "helpfulness": 1, "user": "LauraVancouver", "date": "October 31, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 21433358, "likes": {"liked": "— The location and room", "disliked": "— The desk staff and managerial staff"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled solo", "text": "I read the reviews of the Annabella Hotel, and was a little hesitant to book there. My son and daughter-in-law were at a convention, and I traveled to Anaheim to babysit the grandkids. Did not want to pay the Hilton or Marriott prices, but wanted to stay within walking distance to the convention center. I must say that my room at the Annabella was almost as nice as my son's room at the Hilton, and they paid around $250/night. The staff at Annabella was really nice and helpful. My room was large, had a separate area for the sink (unlike one reviewer's complaint), and was clean. I had read that it was noisy, so I wore my earplugs while sleeping and had no problems! I liked the fact that the hotel is energy-conscious: you have to put your room key in a slot as you enter, in order to turn on the electricity. When you leave, you simply take it out of the slot. Also liked the fact that the eggs at breakfast are from free-range chickens. Beware, the $5.00 breakfast special of eggs and hash browns doesn't come with toast, and by the time you add juice and tax to the meal, it comes to over $9.00, plus tip. I felt safe as a woman alone, and would recommend the Annabella.", "title": "Annabella was a Pleasant Surprise", "helpfulness": 1, "user": "vln", "date": "October 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 21320525, "likes": {"liked": "— location"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We returned to the Anabella after a lovely stay during our last Disneyland visit, and were not disappointed. The room was ready early -- lovely, neat and clean. Staff was friendly throughout the property and we enjoyed drinks and appetizers at the pretty patio Tangerine Bar & Grill this time around. I find the stroll up to the parks and Downtown Disney really enjoyable (why would you want to wait for the crowded shuttle?). If you've got the bucks, yes the Disneyland Hotel is wonderful. But if you'd like to spend less but stay in close proximity, enjoy lovely grounds, comfy beds and spotless rooms, try the Anabella. The pool areas are really nice too. We'll be back!", "title": "Second Stay at Anabella", "user": "DJMadruga", "date": "October 26, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 21251243}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "I read a bunch of reviews before booking this hotel so I wasn't sure what to expect. I went in with an open mind and so here is my experience with them. First of all, they offered me a military rate, something Disney also does but it was still about $100 cheaper per night at the Anabella. I traveled with my wife and my three teenagers so we booked a Hacienda suite which gave us four sleeping areas. We arrived early (check-in time is 3pm) so they could not let us have the suite but did store our bags so we could sight see without the loot in the SUV. They were supposed to call me when the room was ready but never did. When we arrived, they had trouble finding one bag but eventually did. We got our keys but when we entered the room discovered that they gave me a kid's suite. (one queen, one day bed, one bunk bed) Like I said my kids are all grown and I specifically arranged the bigger suite with the front desk 2 months before we came. We had to stay in this suite for one night and then were given the proper suite for the next 6 nights. We were never given an explanation or apology or anything from management. I guess they figured that since I got the military I should be happy. I will say that the rest of the staff throughout the hotel (motel) were very nice and attentive. The proper room was adequate but nothing to write home about. ( you get what you pay for) The breakfast in the Tangerine Grill was good but the wait staff was just so-so. Here are some of the cons; it’s a good 3/4 mile hike to the park even though it's just across Katella Blvd from DCA. We knew this but it is still rough for tired feet and legs. It cost 4 bucks a day per person to ride the shuttle. It would be nice if the hotel would pick up that tab. They also charge 10 bucks a day to park your car. We knew this also and most fine hotels charge for parking, but this is an economy hotel. The showers must have been installed by a midget plumber. The water hit me between my chest and stomach. I'm tall but these are still way too low. Also there is no vent fan in the bathroom which makes a steamy mess with each shower. It would be nice if the sink was out side the bathroom. With five of us getting ready each day it took a long time. Wireless connection costs $10/day which is a bit steep. They will not change out your towels unless you ask. I did and they complied each day. It was a bit noisy like other people have already written about. There are only wood slat blinds on the front window which makes privacy kind of iffy. So we saved some coin by staying here and we survived. If you are not too worried about being comfortable this is not a bad place to stay. If you are used to 3 star and above you will not like the Anabella. It's way cheaper than the Disney rip-off but not as convenient", "title": "Not Too bad", "helpfulness": 1, "user": "alg77", "date": "October 22, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 3.0}, "id": 21115587}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "Most comfortable beds I have slept in at a hotel. Very quiet. Nice having a separate room for my son with his own T.V. I want to thank Eric at the front desk for upgrading us to a deluxe room without any hassle or extra cost. The room was very clean, liked the hardwood floors, nice shower. No hotel shuttle service, public transit was a pain, the buses did not run early or late so we found we had to always walk to and from Disneyland. It was a 15 minute walk to Disneyland but the kids found it far in the heat. The pool closed at 10:00 each night. We found that early after a long day at Disneyland, it would have been nice to soak our sore feet in the hot tub longer. But for the price a great hotel.", "title": "Loved the Pillow top beds", "user": "melOkanangan", "date": "October 21, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 3.0}, "id": 21083019, "likes": {"liked": "— Comfortable beds", "disliked": "— Distance to Disneyland"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "Overall I was satisfied with my stay at the Anabella over Christmas 2008. We were visiting the Disneyland Resort parks and while we were keeping an early schedule, someone who likes to sleep in might have an issue with this hotel. It obviously caters to families, and that's who checks in. The walls are thin so the sound of small children running, jumping, yelling, etc will wake you as early as 6:30 am. The laundry facilities were adequate, although I'm sure its a madhouse in the summer with only four washer/dryers. The photos on their website are slightly misleading, the carpets were dirty and the tiles cracked. Good rates at the Disney Good Neighbor hotels often outweigh the problems you may encounter as long as you know what you're getting into.", "title": "Family Hotel for young families", "user": "isis715", "date": "December 31, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 23146249, "likes": {"liked": "— Location, good rates", "disliked": "— cleanliness"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "My wife, my daughter and I stayed at the Anabella 25-28 December, and had an absolutely wonderful time. I was a admittedly a little apprehensive after reading the recent reviews, but we didn't encounter any problems in our three day stay, and had a wonderful time.", "title": "Wonderful Hotel", "user": "tjones2007", "date": "December 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 23077522, "likes": {"liked": "— Location, Rooms, Service", "disliked": "— Not much"}}, {"rating": 1.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Check in was smooth, no lost reservations, no incorrect room categories, everything was just as we hoped it would be.", "title": "Appalling, Horrible experience at the Annabella", "helpfulness": 3, "user": "TisiphoneHawaii", "date": "December 17, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 2.0, "location": 3.0}, "id": 22813329, "likes": {"liked": "— Absolutely nothing", "disliked": "— Just about everything"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "About 10 minutes after we arrived the font desk called to make sure everything was ok, which of course it was. We booked a Casita suite, which had a separate bedroom with a tv for my daughter. Having a separate bedroom for her was invaluable for the night time, especially before a day at Disneyland. The main room included a comfortable bed, TV stand with multiple drawers and a mini fridge (plenty of storage for snacks and drinks), a couch, a chair, and a desk.", "title": "Disappointed with the Anabella in and Suites", "helpfulness": 3, "user": "WimmerVictoria", "date": "December 13, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 22698421, "likes": {"liked": "— Treated well by some of the staff.", "disliked": "— Poor attitude of the Management. Pool in disrepair. Loud party in the Restaurant."}}, {"rating": 1.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "The bathroom itself was beautiful with marble (or at least marble look) tiles and floor. The only negatives really were that the shower head was a little low (around 5 ft) and the towels weren't the softest in the world, but these are really nit picky complaints.", "title": "Awful place, cheap --old--13th century place", "helpfulness": 2, "user": "disneywonder", "date": "December 13, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 1.0, "rooms": 2.0}, "id": 22694041, "likes": {"liked": "— 13th century look", "disliked": "— everything"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "I travelled to Anaheim for a conference, but waited too long to book one of the cheaper conference hotels. The Annabella looked promising, but some of the reviews had me worried. Fortunately, I was pleasantly surprised. The rate was fantastic and the room was fine. It is important, however, to ask for one of the newly refurbished suites or king rooms. I had a king room and a colleague was upgraded to a Concierge Suite and both of these were good rooms. They aren't luxury rooms, but they were clean and nicely decorated. My main complaint with the king room was the dark, cavernous shower--it had lovely granite, but I would have appreciated a light in there! My colleague loved the Concierge Suite with the wood floors! Another colleague had an unrenovated Casita Suite and was not happy with it at all--it was dinghy and dated.", "title": "a pleasant surprise!", "helpfulness": 2, "user": "H2Opia", "date": "January 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 12741330, "likes": {"liked": "— The proximity to Disney and convention center", "disliked": "— the dark shower!"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2007", "text": "I was also concerned with the reviews that mentioned the loudness of the rooms. However, I asked for a quiet room and was given an end room on the top floor in a building in the middle of the property and it was sufficiently quiet.", "title": "Incompetant Management, Noisy Hotel Rooms", "helpfulness": 3, "user": "dj702", "date": "January 5, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0, "rooms": 3.0}, "id": 12344242}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Overall, the Annabella was a great value with a nice room and staff that accommodated my requests.", "title": "Great family rooms!", "helpfulness": 2, "user": "budiahqueen", "date": "December 31, 2007", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12138927, "likes": {"liked": "— close proximity to parks, separate bedrooms for kids", "disliked": "— no breakfast or cooking options in family rooms"}}, {"rating": 4.0, "title": "We liked the Annabella", "text": "Don't let the online picture of The Anabella fool you - this is an old motel that was refurbished with a poor facelift with poorly trained 'management'", "helpfulness": 2, "user": "bearsmama99", "date": "December 30, 2007", "id": 12067148}, {"rating": 1.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "I called two hours prior to arriving which would have placed us approx an hour and a half before check-in at 4pm - I wanted to ensure that both our rooms would be ready... apparently that was too much ask of 5 clerks running the front desk that could not otherwise communicate with the Housekeeping Staff - Unfortunately after having to make some noise we were given out rooms - both of which were directly below the two loudest rooms in the building...Early checkin is not uncommon in this bsuiness, but the teenage staff working the checkin desk didn't quite know how to handle such a request...a lot of blank confused stares... these teens ruuning the place are were just not cut out to work with the public...", "title": "Annabella - terrible management, poor customer service", "helpfulness": 9, "user": "CanadianTraveler07", "date": "December 21, 2007", "detail_rating": {"front_desk": 4.0, "value": 1.0, "location": 4.0, "service": 2.0}, "id": 11883200, "likes": {"liked": "— Nothing", "disliked": "— The room"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We booked the Anabella for two nights in mid-Nov...got a great deal through Hotels.com (paid $77/night for standard room plus free parking). Keep in mind the hotel does charge an additional $11/day for parking, so print your itinerary and take it with you if you're getting a deal that includes free parking. We did so and the hotel gave us no hassle about it and promptly gave us a free parking pass.", "title": "Great value, cute, and clean hotel!", "helpfulness": 4, "user": "TravelAdvice101", "date": "November 21, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 10953189, "likes": {"liked": "— Cleanliness, landscaping and appearance", "disliked": "— Small shower, business center access fee and daily Internet access charge"}}, {"rating": 1.0, "title": "Being adventurous does not always pay off!", "text": "We also confirmed our reservation and requested early check-in and also put a \"rush\" on our room the morning of arriving, to hopefully get a room in advance of the 4pm check-in time. We arrived around 10:30am and our room was available around 2pm.", "helpfulness": 7, "user": "muffettjlm", "date": "November 8, 2007", "id": 10691628}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "We had a standard room with one queen bed on the 2nd floor. The room was nice and clean -- we had no issues with that. The bed was stocked with tons of pillows, and very comfortable. I remembered to request a room on the 2nd floor for extra quiet, so if you're big on that, I suggest you do so. The walls are somewhat thin, because as people walked by our windows, you could hear their voices. Overall, we didn't have many sound issues since we were on the 2nd floor.", "title": "Awful, intended to stay three nights, I paid early departure fee to flee early", "helpfulness": 3, "user": "GreatBlueFish", "date": "November 6, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 10632145, "likes": {"liked": "— The early departure fee was only $75.", "disliked": "— The noise and dirty furnishings."}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The only disappointment in the room was the bathroom. The bathroom was large, but the shower area was TINY, with barely any room to move and no lighting fixture on top nor any soap dish/rack anywhere. Basically when you closed the shower curtain, you were taking a shower in the dark (the dark colored tiles didn't help either) and holding your soap in your hand the entire time. Not the best. There were a good stock of towels available and soap, shampoo, etc...but no soap dish on the sink either? Weird.", "title": "Great Staff - nice place", "helpfulness": 3, "user": "Steviegirl", "date": "October 29, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 10424158, "likes": {"liked": "— Staff and grounds", "disliked": "— Room location"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We used room service twice. The drinks are fairly good. Dessert from the Tangerine Restaurant was good as well. The Happy Hour menu looked great, but we didn't have a chance to sample that...no time.", "title": "Great place to stay, close to Disney!", "helpfulness": 2, "user": "fireman205", "date": "October 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10409290, "likes": {"liked": "— Bed!", "disliked": "— Restaurant"}}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 210, "average": 308, "very good": 605, "terrible": 207, "excellent": 571}, "aka": "Anabella Hotel", "slim_ranking": 0.378378378378, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Bella Queen/Queen Enjoy comfortable accommodations and the warm decor of our Bella Queen/Queen - the perfect retreat for a party of four. Its upscale interiors feature two queen size Divine TM pillow top beds, a sleep experience by the Anabella Hotel, crisp white bedding and elegant granite bathrooms. Its well appointed location is just minutes away from our Awarding Winning Tangerine Grill and Patio well known for its eclectic California Cuisine."}