{"user_rating": 4.5, "review_count": 1578, "name": "The Royal Hawaiian, a Luxury Collection Resort", "reviews": [{"rating": 5.0, "title": "This is undoubtably one of the finest...", "text": "This is undoubtably one of the finest hotels in the world. In every detail it is top notch. The staff are extremely helpful and friendly; the rooms are spacious, well-appointed, clean and comfortable. The location is unparalleled. The Monday night luau is absolutely worth every cent.", "helpfulness": 3, "user": "Pub_with_no_Beer", "date": "August 20, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 76021030}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Let's face it; you pay for the privilege of staying here, but having stayed in 5 and 6 star hotels all over the world, I can honestly say that the Royal Hawaiian is one of the few I'd be genuinely excited to return to.", "title": "Nice hotel, but very overrated", "helpfulness": 5, "user": "MaximusOliver", "date": "August 19, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 75994709}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "I have Gold Status with SPG and Hilton, and spend 50+ nights a year in hotels for both work and pleasure. My wife and I were really looked forward to spending three nights at this hotel, after all this hotel has a long reputation. It is very nice when you drive up, and the bell staff greets you with lays. Checkin was nice, they offer you a glass of juice. Room was remodeled and nice. Front of the house did a great job, but the pool area and beach need some work. The pool is very small, and the ocean is packed. I woke early each morning to surf, and by 6am each day half of the beach sun chairs and pool chairs are reserved by people placing a towl down. The remainder are gone by 7:30 The funny thing is, most people do not use these!! Each time my wife and I wanted to use a chair, we found 4-6 in a row that were empty, and moved the towels. We would sit for 2-3 hours, and nobody ever came. The beach boys are suposed to clear these every 90 minutes, but they are way understaffed and rarely did until mid afternoon. Seems like a big waste!! Mai Tai Bar is a great place to watch the surfers and people watch any time of day.", "title": "Great Hotel!!! Would go back.", "user": "bunkiss", "date": "August 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 75610641}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "I would recommend this hotel due to its history and location, but it is way overpriced and the service is fair. They say they have 500 rooms, but it felt like each room had 4-6 people in.", "title": "Paradise", "user": "girlfromca", "date": "August 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75235575}, {"rating": 5.0, "title": "Beautiful property, Excelent Service", "text": "Our trip to Oahu was pleasure, followed by business. For pleaseure we stayed at the Kahala. Then we were moving onto Waikiki to be closer to my office in downtown Honolulu. I had booked the Westin and checked in and was extremly disappointed with the room ( lobby was lovely). Room was very dark and dreary, smelled and the carpet was dirty. My husband and i set out on foot to look for another hotel. We went to the Sheraton as it is a Starwood hotel as well. Sheraton was too busy and big for me. Then I saw the Royal Hawaiian - also a Starwood member. IT is beautiful - I asked to see a room - loved it. Told the staff my story and they matched the price on the Westin!!!! Highly recommend the RH. Classy !", "user": "alohatravler", "date": "August 14, 2010", "id": 75205370}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "We stayed at The Royal Hawaiian at the end of October, and were there past Halloween. One thing I found amazing, is how incredibly QUIET it was! We had a garden view room, which actually had a view of the entrance/round-a-bout/valet area. No biggie...the real view was outside the hotel, and it forced us onto the beach. (I hardly went kicking and screaming, though!) The nice part about it being so quiet was evident on Halloween. There was SO much activity on Kalakaua Street, it was obnoxiously loud...yet once we returned to the hotel, it was like it was in another city...so peaceful! I'm guessing any other reviews of there being noise can be attributed to them possibly staying in the newer \"tower\" portion of the hotel. Although the views from their rooms were probably fantastic, I'll take the silence any day!", "title": "Fantastic and QUIET! PERFECT if you have no kids!", "helpfulness": 2, "user": "Karen F", "date": "November 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 184519573}, {"rating": 4.0, "stay_parameters": "Stayed November 2013", "text": "I personally love an older hotel when it's been updated. It feels like an antique, yet the furnishings and decor was very up to date. The bed was comfortable, and the bathroom was really lovely! The grounds of this hotel are so well kept...just immaculate!", "title": "Amazing staff, suite in older section tired and noisy", "helpfulness": 1, "user": "junebugwhite", "date": "November 11, 2013", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 184389949}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The main pool was small, but just enough. One nice feature is that by staying at the hotel, we were able to share the pool at the Sheraton Hotel next door, which had all the bells and whistles you would want if you have kids. This was perfect for us, because at the small pool, there were no loud games of Marco/Polo going on...ever. SO nice and relaxing! On our last day, we spent the money to rent a beach umbrella and chairs to sit on Waikiki Beach...this was by far, the smartest money we spent on our entire trip. Bliss...so fun to people watch, and ocean wave watch!", "title": "Honeymoon Stay", "helpfulness": 2, "user": "Natasha5683", "date": "November 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 184311216}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "We did not have any meals in the restaurants, but we did order drinks at the pool, which were rather pricey...", "title": "First stop on honeymoon", "user": "Bmich81", "date": "November 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 184028009}, {"rating": 5.0, "stay_parameters": "Stayed October 2013", "text": "My only complaint was that one day, after housekeeping had left our room; we came back and pushed our door open without any use of our key. Fortunately, we had our valuables in the locked safe, but this certainly was not a comfortable feeling. We were (luckily) at the end of a long hallway, so the chances of anyone really breaking into our room was probably pretty slim, it still wasn't enough to put our minds at ease. We decided to not use the housekeeping services for the last two days because of this. I know it was an accident...nevertheless, it was unsettling.", "title": "Stay in Paradise", "user": "Tammybleu", "date": "November 7, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 184000712}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "The Royal Hawaiian is a classic, and having seen it before the renovation, I was very impressed with the changes. I opted for a tower ocean-front room in order to have a lanai and view of the fireworks on New Year’s Eve, and my room on the 17th floor did not disappoint. However, the historic wing looks beautiful and I might opt for that if I find myself lucky enough to stay there again.", "title": "Loved The Pink Lady", "user": "ao23", "date": "January 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150350559}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "I remember getting up a 6am on past rips to get a free set of chairs and umbrella on the beach, so even though there is now a fee, I liked being able to go online prior to my stay and choosing the exact placement for my umbrella on the beach at http://www.royalhawaiianbeach.com. What is omitted from the chair map is an additional 4-5 rows of chairs and brown umbrellas in front of the umbrellas numbered 1-12, so pick something farther east or rent ocean front chairs from Aloha Beach Services if that matters.", "title": "Simply the best", "user": "Aaron808", "date": "January 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150204501}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "My biggest pet peeve is the $25 resort fee...I don’t really have a need for most of the services and I wish they would make it optional or incorporate it into the room charge.", "title": "Great Place to Ring in the New Year", "helpfulness": 3, "user": "TorG", "date": "January 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 149907907}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Damn I love this place. From the first moment you set foot inside, they treat you like royalty. Some of the best service I ever had. I highly recommend staying in the \"old\" section, the original hotel. Each room is different, and smaller, but has a lot of character.", "title": "Sad Service Experience", "helpfulness": 7, "user": "PsiWyFun", "date": "January 16, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 149799291}, {"rating": 1.0, "stay_parameters": "Stayed January 2013", "text": "Upon arrival our room was stocked with some amazing banana bread, a bottle of champagne on ice, and some chocolates. Beds were great.", "title": "Disappointed. Always wanted to stay at The Royal Hawaiian and found out that you can't tell a book by its cover. Exterior charm", "helpfulness": 6, "user": "lynnieee", "date": "January 15, 2013", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 5.0, "service": 2.0, "rooms": 1.0}, "id": 149745681}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "This is one of the best spots on Waikiki, no question. Because the area is so built up with shopping, you can't even see it from the main shopping drag--but it's right on the beach and sandwiched between some of the best spots in town.", "title": "Great location, sense of history", "user": "mommythek", "date": "September 4, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 78253840}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The rooms in the historic part, while beautiful, are pretty small. The doors are very impressive, dark-grained, engraved wood, but the rest of the room is kind of a disappointment (bed, two chairs, small bathroom, closet), especially after some of the other SPG \"Luxury Collection\" hotels we've seen. Perhaps other parts of the hotel are more spacious, but being there only one night, we didn't really care about switching.", "title": "Beautiful, Historic and NICE!!", "user": "MattKSanDiego", "date": "August 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 77672373}, {"rating": 5.0, "title": "beautiful hotel", "text": "The service was confusing--the new staff didn't seem to know much about the hotel's amenities. There was a lot of confusion about arranging for a late check out, as well--we were quoted two different prices, and given a bit of a hassle.", "user": "Aprilmaymarsh", "date": "August 31, 2010", "id": 77660204}, {"rating": 5.0, "title": "The hotel was truly \"old Hawaii\"", "text": "We enjoyed every moment at the Royal Hawaiian. But you have to know that it is located in the heart of Wakiki Beach. There are people everywhere once you step off the Royal Hawaiian property.", "user": "A TripAdvisor user", "date": "August 30, 2010", "id": 77594950}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "There are 2 pools, a very small quite pool for the just the Royal Hawaiian and then on the other side of the property is a shared pool with the Sheraton next door. We have to younger kids that wanted to play, so we went to the shared pool. It is very fun, water slide and busy. Be ready for it, not your quite relaxing pool, a fun jump in the water and look up at Diamond Head while overlooking beach. Don't get me wrong, I had fun, I was just tired after hanging out at the pool.", "title": "Waited all year for this?", "helpfulness": 1, "user": "aniba84", "date": "August 25, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 76822396}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We really enjoyed our stay at the Royal Hawaiian. The staff was kind and helpful and welcoming. We were given cold towels upon arriving, which was extremely refreshing. The check in went smoothly and before we knew it we were exploring Hawaii. We went to the famous Monday night Luau. It was amazing, and very expensive. We weren't told when we bought our tickets to the Luau that it was all you can drink, I wish we had known that earlier. All the food was so delicious, although I wish we were offered more appetizers. Especially since they were traditional Hawaiian fare (lomi lomi salmon, poi, kuala pig). And the show was spectacular.", "title": "Perfectly Pink", "helpfulness": 2, "user": "JB0", "date": "September 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 79153611}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "Down at the beach there are chairs and umbrella for the guests to use. We had a hard time getting spots b/c people come and put their things on the chairs very early then take off for the day. The hotel does say they remove items left unattended for more than 90 minutes, but it would be very hard to keep track of that, so I bet it's not done. You are able to take as many towels as you would like (to sit on in the sand when all the chairs are taken) which is good. And they also offer cold water to drink while enjoying the beach. I think the Royal Hawaiian is one of the only hotels that has their own private beach area for its guests, that was a bonus.", "title": "Beautiful and family friendly", "helpfulness": 1, "user": "lvelez250", "date": "September 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78926294}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The rooms were large and comfortable. The bathrooms were clean and well stocked. We made use of the mini fridge and coffee maker in the mornings. We used the concierge to make reservations and for directions to Diamond Head. They were helpful and were always ready to provide us with walking maps. They even called ahead for us to the Halekulani's House Without A Key restaurant and reserved a table!", "title": "Everything one would expect...and more", "helpfulness": 1, "user": "wasklywabit", "date": "September 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78709889}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The hotel offers free coffee and tea close to the check in area in the mornings but things get used up very quickly and they remove it around 9am or so. The hotel is beautiful and right on the beach, they also offer free internet access.", "title": "Great Location, slow service...busy but Pretty Beach, comfy..\"", "user": "NINA_GLAM", "date": "September 5, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 78377005}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Stayed July 2010 - i heard that this hotel was one of the best in Honolulu and was a little nervous traveling with a 6 year old that the hotel would not be family friendly. Everything was absolutely amazing and she had a blast. Everyone was super friendly, even the housekeepers who would talk with her in the hallway out side our room EVERY evening and call her over to their cart so they could give her chocolate EVERY evening. She loved it, loved the attention and while i would rather her not have chocolate every night it was really cute and I appreciated the nice touch.", "title": "Lovely Hotel in a Great Location", "user": "LUV2VISIT", "date": "September 4, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 78273224}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Just perfection. Great location. Beautiful property right on the beach. Great place for a honeymoon or a business convention. Also so close to everything beautiful. A bit pricey like all places and things in Hawaii so venture out a bit to save some food money.", "title": "A wonderful property", "helpfulness": 1, "user": "Robert C", "date": "January 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148541368}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We have just returned from a short two week rest at the Royal Hawaiian and as usual had a great stay.Thank you to all the staff .....Kelly,Monica,Wendy,Gerrard,John, and a special thanks to the Waikiki beach beach services for a great time on the beach.", "title": "This is a great property to stay at", "user": "letitride", "date": "January 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 148520493}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Ted Bush the owner of Waikiki beach services and Chuck the beach manager took us out on the outrigger canoe. We had the time of our lives riding the surf.This is a must do if you go to Hawaii.", "title": "Wonderful resort - old world charm", "helpfulness": 1, "user": "dms666", "date": "January 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148513616}, {"rating": 4.0, "stay_parameters": "Stayed June 2012", "text": "Also ,Chuck who is Ted's right hand man couldn't have been more helpful in looking after our beach chairs and making this a relaxing vacation.", "title": "Lovely, once we got the room we paid for!", "helpfulness": 1, "user": "Sally_Sutherland", "date": "January 1, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 148479469}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "All the staff we saw during our stay were truly full of the ALOHA spirit and we will be back for more fun in 2013", "title": "The Pink Palace", "helpfulness": 2, "user": "JR R", "date": "December 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148241460}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "First let me say that my husband earned this trip from his company - so we did not have to pay for our room. We went out a few days earlier and stayed at the Hilton Resort nearby. The Royal Hawaiin is a beautiful property. And we enjoyed our stay. However, there was nothing about the hotel or service that pushed it from 'nice' to 'fabulous'. If we go to Honolulu again I would not spend the extra money to stay at this property.", "title": "Nice Property - Not As Luxurious As We Hoped", "helpfulness": 1, "user": "VirginiaBamagirl", "date": "November 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 183940233}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Stayed here last week for the final 6 nights of my honeymoon and loved it. We were upgraded and given a bottle of (pink!) sparkling champagne. The room (historic oceanview) was gorgeous (as the whole hotel is) but could do with some upgrades - perhaps a smaller closet to make room for a bigger bathroom. There was nowhere in the bathroom to hang all the towels once we used them so they ended up all over the floor. The bed was very comfortable and everything was clean. My only other gripe is the lack of a kettle (using the coffee machine took a lot longer than a kettle) and the paper coffee cups rather than mugs.", "title": "Last stop of honeymoon", "user": "awful_in_aqua86", "date": "November 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 183856208}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Breakfast was included in our deal and there was a lot of choice and it was delicious. The pool is small but who cares when Waikiki beach is right next to you and so perfect for swimming in - and yes, the beach chairs cost money, but the ones at the pool do not. Would have appreciated some of the extra care that Four Seasons Hawaii went to for honeymooners (inviting us to free lei-making lessons etc) but it's not a deal-breaker. Some of the service could be improved, for eg. I did want to get a mani at the spa and it was on the menu, but when I asked I was told they don't have a 'nail artist'. Also don't appreciate being asked for ID when I order a drink at the pool and only have a book and a bikini, clearly no ID on me (I'm nearing 30, don't think I look younger than 21, also what -21yr old is on a honeymoon in a foreign country staying somewhere as expensive as the RH?)", "title": "Best second honeymoon.", "user": "Kim W", "date": "November 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183464796}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "So, there were many small annoyances that you wouldn't expect for a hotel this price, but it was a lovely old hotel and we had a blast - and you just can't beat the location. I've stayed in 2 other hotels in Waikiki and hated them so this was better for the location alone.", "title": "A wonderful experience, great service", "helpfulness": 1, "user": "Pat M", "date": "October 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 183089488}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "We stayed at the royal in April 2013, and as soon as we arrived (quite early I may add about 8am) the service was amazing, we were greeted like old friends, we asked to leave our bags until check in (2pm) to which we were told our room was ready and waiting for us. The cold refreshing drinks on arrival were perfect. We had an amazing room overlooking the beach and even though it is so close to the strip, as soon as you walked onto the grounds it was quiet and relaxing. Our room service were amazing, couldn't recommend this hotel highly enough! I want to go back asap.", "title": "Paradise!", "helpfulness": 1, "user": "Gregoogle", "date": "October 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 182973415}, {"rating": 2.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We arrived Tuesday evening around 11:30 PM, 20 minutes waiting to make the Check ‘Inn, only one person available and he was occupied with another guest.", "title": "Bad experience for this amount", "helpfulness": 8, "user": "Claude-Annette", "date": "January 14, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 149629059}, {"rating": 2.0, "title": "Can you be \"Luxury\" if you don't do the Basics?", "text": "We booked the Luxury Romance package who should include the following: Flowers and Champagne upon arrival ( 1 bottle of champagne per person/per Night, was written in the confirmation). We received only 1 bootle the last night around 6:00 PM, also only at this time the flower arrived. We made 2 times a request one these thinks, but the manager got never the time to spek to us.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "January 12, 2013", "id": 149471525}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Concerning the breakfast, the choice was good, but after ordering we asked to get a little more bread. Answer: this is only possible if you pay, because it’s not included in the pack. For the 2 pieces of toast's we paid around 9$.", "title": "Lots of character", "helpfulness": 1, "user": "FredHayek", "date": "January 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149460695}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "Beach-Pool, arrived at the pool around 2PM we tried to find 2 places (chaise longue), around 90% was empty (nobody was there) but towels or other things was laying on it. We asked if something is available and we got as answer that we should go to the beach but there will be a charge of 50$ per chaise-longue.", "title": "Best location for a hotel in HNL", "helpfulness": 2, "user": "jeepsgone", "date": "January 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 149459951}, {"rating": 4.0, "stay_parameters": "Stayed January 2013", "text": "After 30 minutes we found a chaise-langue and we gave several times a sign to the waiter, but no reaction, so we decided to go our self to the bar to order drinks. The waiter saw us coming back and we got the following comment: I have only to hands and I can not handle all the guests together. I think 40 minutes is enough to find 1 minute to take an order and also there was less as 20 guests around the pool.", "title": "Great service, disappointing room", "helpfulness": 1, "user": "CNC-expert", "date": "January 10, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 149392258}, {"rating": 2.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "This hotel which used to be the place in Waikiki is not anywhere's near what it once was. The ambience of the surrounding area is totally gone. It is as if this resort was on Fifth Av in NY, or Rodeo Drive in Beverley Hills or Michigan Av in Chicago. It is surrounded by and dwarfed by shopping malls, high end boutiques, and parking garages. The chunk of beach it abuts is tiny. The restaurants grossly over priced for the quality received (six tiny meatballs $18 as bar snack food). The room was smallish and crowded. The \"bather's elevator\" stunk of mold and mildew. In a few words: cramped, pricey and grossly over rated.", "title": "IT AINT WHAT IT USED TO BE", "helpfulness": 1, "user": "Caleb42", "date": "October 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 1.0}, "id": 182463219}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "You can stay cheaper in Waikiki - and be sure you want what Waikiki offers before you stay there at all - but the Royal Hawaiian is a special place. I managed to use a combination of airline points and cash to make the price reasonable.", "title": "Pricey, well-located, superb service", "user": "paulvee", "date": "October 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 182407620}, {"rating": 3.0, "title": "Milking the history books?", "text": "I might have stayed at the Moana Surfrider, where I have stayed before, but my girlfriend smokes and the Royal Hawaiian has smoking rooms in the historic wing. This is a rarity in Hawaii.", "user": "acdc09", "date": "October 25, 2013", "id": 182391567}, {"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "The historic wing is fabulous. Squint your eyes and you can be in Honolulu in 1933. The rooms were great, well maintained, and the service was great. I got a great deal, but I did not do room service or any of the other amenities, where they tend to really get you. They are catering to luxury tourists, after all, many from Japan, who seem capable of paying exorbitant prices for food and services.", "title": "Really... No so.", "helpfulness": 4, "user": "MKC24", "date": "October 25, 2013", "detail_rating": {"cleanliness": 2.0, "sleep": 1.0, "rooms": 2.0, "service": 5.0}, "id": 182368806}, {"rating": 1.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "What you DO get, though, is a great location on the strip, PLUS access to one of the great stretches of Waikiki beach, unparalleled, really. You can stay in the tower rooms, as well, for a better view, but I like old school rooms, even if they are a bit smaller.", "title": "the only bad memory of a fantastic honeymoon", "user": "Matteo451", "date": "October 24, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 182297080}, {"rating": 5.0, "title": "Favorite hotel in Waikiki", "text": "- great hotel restaurant and bar... food is delicious and drinks are to die for", "helpfulness": 1, "user": "Jem_Hologram", "date": "October 29, 2013", "id": 182877195}, {"rating": 4.0, "title": "Lovely beach front location", "text": "- rooms are fabulous - super elegant", "user": "sbeerling", "date": "October 29, 2013", "id": 182875335}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "- location is ideal - beach front and in city center", "title": "Historic Honolulu", "user": "gnomeranger", "date": "October 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 182856934}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "- easy to rent a car and see pearl harbor or the dole plantation", "title": "Iconic ambience", "helpfulness": 1, "user": "HermesParis", "date": "October 29, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 182815180}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled solo", "text": "The pink grows on you. I would recommend the tower rooms versus the garden suites which lack a balcony or any outdoor space. The rocking chairs is a nice touch. Convenience to beach and water sport rentals make this a hassle free resort.", "title": "The Traveling Hilliblly Relaxes & Recharges @ the Royal Hawaiin", "helpfulness": 1, "user": "travelinghillbilly1", "date": "October 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 182776517}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "My husband and I returned to Waikiki 4 weeks after staying at the Halekulani in order to watch the finals of our son's collegiate baseball league. We were able to get into the Royal Hawaiian this time and got a great internet rate by pre-paying for the room so it worked out to be much less expensive than the Halekulani. We had really enjoyed the Halekulani (which I have also reviewed) but wanted to try the more casual and more Hawaiian atmosphere of the Royal Hawaiian. We were not disappointed. This is a lovely, grand old hotel with lots of character and aloha. We had a 15th floor ocean view room in the tower (if you want a balcony, you have to stay in the tower) and although the room itself was nothing special (but the bed was extremely comfortable!), the view was stunning and we could sleep with the sliding glass door open and the breeze blowing in and listening to the waves. We enjoyed sitting out on our balcony which had a table and 2 chairs and could see all the way to Diamond Head down the beach. The tower is very close to the water there was always so much to watch out there. We couldn't believe the crowds on the beach and in the water but the beach is really nice.", "title": "Really nice atmosphere and location", "helpfulness": 2, "user": "h0lym0ly", "date": "August 10, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 74680825}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled solo", "text": "The rest of the hotel is beautiful and very enjoyable to walk around. The staff were very friendly and helpful and the concierges were terrific in finding us good tables at the restaurants that we chose. We had good dinners at Sensei (a few blocks away and has the most amazing sushi) and Ocean House in the Outrigger Reef. We valet parked our car (only a few dollars more than self-parking and very convenient). We could use the facilities next door at the other Sheraton Hotel and we walked over there several times. But what a crazy busy place that is. We were glad to not be staying there - too many people. We planned on swimming in their infinity pool but it was too full each time. It looks really nice as it's right against the ocean and there are lawn chairs placed in the shallow water of the pool. We enjoyed drinks at the Royal Hawaiian outdoor bar and we sat on the beach on the hotel chaise lounges each day. It's a bit irritating that people run down at 6am and save beach chairs that sit empty for hours until they come back. We soon learned that that is the only way to get a chair so we put stuff on our chairs early in the morning and went to the fitness centre (which was pretty good) to work out and then hit the beach after. You can take surfing lessons right there in front of the hotel and the waves were perfect for learning. The swimming is good at the beach but very crowded. The hotel is very convenient to all the shopping and restaurants of Waikiki. We found it to be a nice sanctuary to get away from the hustle and bustle of Waikiki as it has such beautiful gardens and gorgeous architecture and open spaces.", "title": "Excellent service, friendly staff, right on the beach", "helpfulness": 1, "user": "TravelingDiver399", "date": "August 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 74445616}, {"rating": 4.0, "stay_parameters": "Stayed August 2010", "text": "All in all, the Halekulani had nicer rooms and seemed to have more staff to cater to your every need and a more formal atmosphere. But I preferred the Royal Hawaiian for it's better beach, more casual atmosphere, better view from the room, better pools, a more fun bar on the beach, and being more Hawaiian. We'll probably never go back to Honolulu because it's far too busy for us (we are Maui people) but if we do, we will try and get into the Royal Hawaiian. I would recommend it to anyone.", "title": "Extremely Pleasant Hotel", "user": "View-Master", "date": "August 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74428575}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Came up to this hotel after walking out of another place, that I had booked for 2 nights but wasn't happy with. Read a lot of good reviews from the Frommer's guidebook, on tripadvisor, and on yelp, and decided to check out the Royal Hawaiian.", "title": "Great hotel and a great location", "user": "Wieslanders", "date": "August 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 74197865}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "When I walked into the hotel, the front desk staff immediately asked if they could help me with anything. After telling them my predicament they directed me to the desks behind me, which I guess was the reservations desk. I waited a few minutes while the man at the desk was helping a couple check in. While I was waiting a member of the staff came up to me and offered me some kind of fruit drink. I don't know what it was made of, but it was sweet and delicious. Once I got to the reservation desk, they gave me a price of $300 a night for an ocean view room, with a $50 discount. After providing me with my room key, the staff member asked if I would like my bags brought up to the room. I declined because I hate having people do things for me that I could easily do myself. Then I left to go park my car.", "title": "All In All We Love The Pink Palace: We've Tried All Other Hotels", "user": "mizuwari", "date": "August 6, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 74117433}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "I have always wanted to stay at the Pink Palace/Royal Hawaiian. I was not disappointed with my choice of this lovely hotel. There were 5 in our party: my husband, myself, our 22 and 19 year old daughters and our 14 year old son. Initially, I booked 3 rooms, however, my son wanted to be next to us. I knew trying to put all 3 rooms together might be challenging during Christmas break. When the Concierge became aware of my dilemma, they graciously found a 2 bedroom/sitting room suite with 2 bathrooms that was perfect! It enabled the girls to have their own room/bathroom while our 14 year old was perfectly content to stay in the large adjoining sitting room with its own TV. The staff went above and beyond whenever I had any requests or questions. The location of this hotel, the facilities and the staff made our trip truly memorable. My only critic of the room were the small bathrooms. The rooms were large and spacious as were the closets, however, the bathrooms were quite tiny. I often did my makeup in the room since there was little space to put my toiletries in the bathroom.", "title": "Beautiful hotel in a beautiful location", "user": "SondraTexas", "date": "January 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149195182}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The hotel might lack the mod cons but it is still the best location in Waikiki and the gardens and lobby ooze tranquility in contrast to the bustle of Waikiki.Rooms have been updated and the only negatives being small bathrooms and small windows in the historic wing make the rooms darker in the daytime.Fast internet and great service with the banana cake delivered on first night a nice surprise.", "title": "Cant beat the location", "helpfulness": 3, "user": "ald59", "date": "January 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 149047917}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Hotel now charging for its chairs on the beach a bit disappointing.", "title": "Luxurious pink palace!", "helpfulness": 2, "user": "StephNay", "date": "January 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148968279}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We stayed a few nights in one of the tower rooms with an ocean view (the newer part not the historic part of the building). In a way we regret not giving the historic part of the building a go, but on the otherhand the view from the ocean view in the tower was amazing. The room was very large with a king sized bed and everything you could ask for. My partner was fascinated with their toilet haha..But the view was spectacular looking right out over waikiki beach. Each day the room was cleaned spotlessly and they left flowers in the shape of lovehearts on the bed. The hotel was very well maintained.", "title": "Pink Palace", "helpfulness": 1, "user": "HockeyTown05", "date": "January 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148929846}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "This hotel is very luxurious and it is all the small attention to detail that sets this place apart. You do feel a bit like royalty walking around the hotel - it is stunning! From the moment we arrived it felt like a palace, the garden area is gorgeous, the lobby/entrance area is even beautiful. It is just so peaceful and relaxing in a gorgeous setting. Upon arrival they treat you wonderfully, with cold towels to freshen up while they check you in, flowers, all your bags taken care of.", "title": "Pink Palace - Oasis in the heart of Waikiki", "helpfulness": 1, "user": "Porschagirl", "date": "January 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148665762}], "location": {"country": "United States"}, "stars": 5, "variance": {"poor": 65, "average": 191, "very good": 394, "terrible": 52, "excellent": 876}, "aka": "The Royal Hawaiian, a Luxury Collection Hotel", "slim_ranking": 0.204819277108, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "The Royal Hawaiian, a Waikiki Beach Hotel, has Abhasa Spa, renowned restaurants, and a pool with a waterslide and cabanas. We have gorgeous indoor and outdoor event space for weddings and meetings."}