{"user_rating": 3.5, "review_count": 2208, "name": "The Condado Plaza Hilton", "reviews": [{"rating": 3.0, "title": "swanky expensive", "text": "The lobby area and our room had a very retro swanky feel. The pool side was great and shaded with many palm trees. However, the pool water was cold and service was very sssllloooowwww. Get your food & drink yourself. I felt with the high price of the hotel it would be more tailored to their guests. Maybe I'm spoiled I've stayed at the Ritz before.", "user": "GetawayNewJersey", "date": "February 18, 2008", "id": 13649317}, {"rating": 1.0, "stay_parameters": "Stayed February 2008", "text": "I just called to try to ask a simple question to the Front Desk and the first time they left me on hold for 13 minutes, until I obviously hang-up, the second time they transferred me to their central reservations when I did not even wanted to make a reservation (they totally ignored my question) and the third time, CAN YOU BELIEVE THAT THEY PUT ME ON HOLD AGAIN for 5 minutes, until I hang up again. This is extremely ridiculous, people.", "title": "The Worst Front Desk Service - KAIRA and the other woman", "user": "Cherol", "date": "February 14, 2008", "detail_rating": {"front_desk": 1.0, "value": 1.0}, "id": 13560622}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "I am getting married next winter in PR and I was considering this hotel to book about 50 rooms for all my guests that are coming from the US, but forget about it.", "title": "Resort staff GREAT, Italian staff not so much!!", "helpfulness": 1, "user": "elliotgang", "date": "February 11, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "business": 3.0, "cleanliness": 4.0, "rooms": 5.0, "location": 4.0}, "id": 13457752, "likes": {"liked": "— Loved the room decor and bathroom!", "disliked": "— The onsite restaurants -Gusto D'Italia, shotty service and Strip House, snooty hostess"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "I dont doubt that the facilities are wonderful, but Mr. Manager, you definitely need to work on your staff, specially that Kaira and the other girl behind the front desk tonight. I prefer for my guest to stay at a more humble place and get the treatment they deserve, after all the $ they are paying.", "title": "Great end to our Vacation", "helpfulness": 3, "user": "Thisisit1103", "date": "February 5, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 13277327, "likes": {"liked": "— Room, View & Grounds"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "I would also like to comment on the Italian restaurant-Gusto D'Italia at the Condado, which I discovered after speaking with the hotel front desk about the service we received (er, didn't receive) is independently owned/operated from the Resort, it was the absolute worst service and food I have ever had!! S-L-O-W doesn't even begin to describe it and the manager on duty actually argued with us about why we had not even received our drinks after 20 minutes and another family came right in and sat down and were served right away and that was just one of the 3 days we went there for brkfst! UNBELIEVABLE!! We resorted to finding other dining outside the resort, we HIGHLY recommend The Hacienda right down the street from the Condado for breakfast/lun/din, great seaside affordable dining experience, their coffee was awesome too! The rest of our stay was awesome, the hotel was beautifully decorated, very chic! One of the many highlights of our stay at the Condado, we had our 15 yr old son with us, was the staff at the Aqua Bar, Sterling, David and Joey (Eyes). These guys were the greatest, Sterling makes a mojito to die for, my son really made fast friends of these three, he looked fwd to each day going down to the pool and chatting with them, if you go tell them the Elliot's from Indiana say HI!. Wish the beach was bigger but still a great location for being close to a ton of things to do and see, El Yonque (caribbean rainforest) is a must see and El Morro in Old San Juan was amazing as well! WE LOVED PUERTO RICO!!!! I can't wait to go back and yes we would definitely stay at the Condado again!!", "title": "Wonderful. Stylish. New Renovated Hotel", "helpfulness": 3, "user": "NycPhoto5", "date": "January 31, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 3.0}, "id": 13146533, "likes": {"liked": "— The New Style or the Hotel", "disliked": "— That it was still under Construction."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "This was our 8th stay at the hotel. We've stayed here 1 or 2 nights in the past prior to departure of our cruise. Per usual the staff and accomodations were excellent!", "title": "Precruise stay", "helpfulness": 1, "user": "cheryl42255", "date": "March 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127014819}, {"rating": 1.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "We stayed at this property for one night after our cruise on March 19th. We had noticed the property on previous trips to San Juan. We arrived early (they always kick you off the ships by 10AM) and even though the hotel seemed empty, we couldn't check in until 4PM so we pretty much had a wasted day. Walked the \"beach\" for a few minues but it turned out to be a small strip of sand with rocks at one end and a busy bridge and traffic at the other. As well, the beach was crowded with locals with loud boom boxes and a couple guys trying to sell us drugs. The hotel lobby area looks tired and almost appears under construction. The whole property just looks \"tired\". When we finally got to our room, it was strangly configured with the toilet, shower (no tub), closets, bar fridge etc all in one room and the beds in another. So if the toilet was busy, forget about someone else getting clothes, ice or anything else. Our son jumped in the shower,only to find that the shower drain was plugged, flooding the room. We had to use all the towels to soak up the water. Called the front desk but no one seemed to care. Called again and still nothing. Finally gave up..no towels, no shower for the rest of our stay. The room faced the street and the street noise was unbelievable. Must be single pane glass which provided little noise protection. All in all, far, far below what one wouild expect from a Conrad property. Go on down the street to the Marriott, the Ritz or any one of the beautiful hotels that are \"actually on the beach\". Forget this place, its not worthy of the Conrad name or your money!", "title": "Move on down the street", "helpfulness": 4, "user": "scott0506", "date": "March 30, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 2.0}, "id": 126970755}, {"rating": 2.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Checked in last night. Room is small and not as well-appointed as I would expect for a Conrad hotel--clean but sparse. TV looks like a computer monitor, no real desk or table, no bathrobe. Tile floor makes it look very utilitarian. Bathroom is very tight--just barely enough room for 1 person. Common areas very retro looking (or just old) and not to my taste. Here on business so did not check out other amenities. Good points here--Pikayo restaurant and Starbucks near entrance. I will try someplace else next time.", "title": "Disappointing for a Conrad.", "user": "Susan7425", "date": "March 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 126937645}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Good hotel, good location. The facilities are good, with a good pool, parking is not difficult.", "title": "Good, but could be better", "user": "GabrielRFritz", "date": "March 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 126906880}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "First I stayed in a lake side room, which had a very good view of the lake and a balcony to sit and enjoy the landscape. The bad about this room is the television system that does not permit to connect any other device like a laptop or videogame. I was very frustated because I was staying there for one month with a new PS3 and I coulnd´t test it. The room also does not have microwave.", "title": "Great Hotel...the quality of the maid service is questionable.", "user": "JetSetterz2012", "date": "March 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 126871288}, {"rating": 1.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Where do I beging?", "title": "\"An Extremely Disappointing Experience\"", "helpfulness": 4, "user": "NY1PR2007", "date": "August 26, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "location": 3.0, "rooms": 3.0}, "id": 19396945}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "First let me just say that originally I had booked a reservation to stay at this hotel for 9 days instead of the two days that I lasted with my family at this hotel.The original comfirmed reservation was to have taken place from Friday August 15 to Sunday August 24,2008", "title": "A Great Vacation Spot", "helpfulness": 1, "user": "enkent", "date": "August 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19208381, "likes": {"liked": "— The price/package special was cheaper than we expected for a one week stay.", "disliked": "— Having to leave the place =("}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Back in May this year I was considering going back to Puerto Rico for a longer stay than the 6 days I stood at the San Juan Marriott Resort and Stellaris Casino in the Condado area last year in October. We had such a great time specially at the Marriott that I wrote a beautiful review about the Hotel here on Tripadvisor and in the review I had stated that if we will ever go back to Puerto Rico this will be the hotel that we will go back to.", "title": "Perfect hotel, perfect staff, perfect location!", "user": "izmarriednow", "date": "August 21, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 19202534, "likes": {"liked": "— There was a little bit of everything in one location", "disliked": "— The City Vista Room is a little smaller than expected"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "I made a decision back in May this year to at least try another hotel just to see how good other hotels may fair against the Marriott. That is why after reading so many reviews about the Condado Plaza Hotel and Casino(some good ones and some bad ones) I felt that the good ones were more than enough to make me want to stay at this Hotel. !HUGE MISTAKE!", "title": "Look Carefully at Other Condado area Hotels", "helpfulness": 2, "user": "DobbinsFamily", "date": "August 19, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 19132850, "likes": {"liked": "— Large and Reasonably Clean", "disliked": "— Bathroom doors with little privacy."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "When I made the reservation through the hotel's website and obtaining my confirmation #, right away I placed a call to the Hotel directly from NY just to make sure that everything was as schedule specially confirming my request of an Ocean Vista Room, High Floor and most of all a room with \"TWO BEDS\" since I was traveling with my lovely girlfriend and my adorable 12 year old daughter. After talking to an agent from the hotel she assured me that everything will be as scheduled. She told me that upon my arrival to the Hotel there will be an Ocean Vista Room High Floor with TWO Beds waiting for us.", "title": "AMAZING!", "helpfulness": 1, "user": "izol", "date": "August 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 19092829, "likes": {"liked": "— casino,water slide, original bars, perfect rooms", "disliked": "— i didnt like that i had to leave to miami :-("}}, {"rating": 3.0, "title": "Wyndham Condado not for Romance", "text": "The Wyndham is a great hotel with great staff, however it is probably not the best place for a romantic getaway. We were greeted at every turn during our stay this past week with a sea of 12-14year olds in the international Junior women's field hockey tournament. The location is great for getting to Old San Juan but the beach is pretty small. They also had a huge high school party across the hall from the casino on Friday night.", "helpfulness": 1, "user": "J L", "date": "March 22, 2005", "id": 3294880}, {"rating": 4.0, "title": "Bien", "text": "I can say that the room and room view were very nice! The pool area was great!!! We did not eat there. The skyway connecting the casino to the hotel was cool. The hotel and casino area needs new carpet. Needs it now. It is in a good location. The beach area was very nice. My wife and I had a very good time there.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "March 17, 2005", "id": 3279619}, {"rating": 2.0, "title": "not so good", "text": "this hotel is not so good, the location is awful, it is sandwiched on the road and there is just a tiny beach. our room faced the street and was very loud. the pool is OK but i've seen much better. the hotel has no happening spots - no disco, no lobby bar. the food was sooooo overpriced and one meal i had was so disgusting that i could not eat it.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "March 16, 2005", "id": 3277806}, {"rating": 5.0, "title": "great stay", "text": "hotels down the road in isle verde are a much better choice.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 16, 2005", "id": 3277566}, {"rating": 4.0, "title": "An honest review with helpful hints!!", "text": "we saw some negitive reviews and started to worry. to this day i can't figure out how anyone could not like this place. we got a free up grade over looking the ocean. the people where great and eager to help you. the rooms were excellent and very clean. the beach was small but very nice and the pool was wonderful. we would return in a minute.", "helpfulness": 13, "user": "Whispy3", "date": "March 13, 2005", "id": 3270542}, {"rating": 5.0, "stay_parameters": "Stayed January 2007", "text": "My husband and I took our best friend to San Juan for a long weekend to relax and get away from our corporate lives. We had a BLAST!", "title": "Spectacular View!", "helpfulness": 3, "user": "HasTheTravelBug", "date": "January 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6615909, "likes": {"liked": "— Fabulous room, friendly staff."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "Check-in was a breeze.... We arrived at 4:30pm on a Friday and waited about two minutes for the next front desk agent, David. David was super polite and helpful, and our room was ready. We were given yummy cracker/cookies with guava flavoring (a nice touch!) and headed to our room on the 8th floor.", "title": "Great Time in Puerto Rico", "helpfulness": 2, "user": "The_Skier", "date": "January 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6542430, "likes": {"liked": "— The bed was so comfortable"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2006", "text": "We stayed in room number 818 and had an EXTRAORDINARY ocean-front room. We were right on the water and absolutely loved the room. We had a remodeled two-bed room and found everything in working order (we used the safe with no problems, the telephone worked just fine, and made tea and coffee each morning).", "title": "ghetto fabulous", "helpfulness": 3, "user": "sealevel000", "date": "December 19, 2006", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 1.0, "location": 4.0, "rooms": 4.0}, "id": 6473487}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "Our room was comfortable, clean and stylish.", "title": "Beautiful Room - Fabulous Location", "helpfulness": 1, "user": "NBaker", "date": "December 17, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6452318, "likes": {"liked": "— Great Location, Beautiful Area", "disliked": "— Try to experience the local culture more in the area"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "We ate at the Italian restaurant our first night and had a beautiful table right by the window and enjoyed the sunset. Our waiter was so attentive and good to us; we felt spoiled! The food was okay..... My husband's chicken dish was better than my lasagna. The wine was very reasonably priced. It was a nice way to start our weekend!", "title": "Good and Bad", "helpfulness": 1, "user": "heltel", "date": "December 16, 2006", "detail_rating": {"front_desk": 5.0, "business": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "location": 5.0}, "id": 6448010}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We have three complaints about the room, one of which also affected the other room. First, I offered to sleep in the living room which contained two twin beds since I get up early. The sheets smelled of mildew but by that time I was just happy to have a bed. Secondly, we were told we would get some complimentary toothbrushes, etc. to clean up as American Airlines no longer provides them when your luggage is lost. The complimentary toiletries showed up over an hour later, after one o'clock in the morning. The second set (!) showed up at three with the security officer. Thirdly, the view from our room was ghastly, (photo provided) viewing the hotel entrance directly ahead and aN entirely vacant and boarded up 15 or so story hotel complete with graffiti and sans doors or windows. Quite a letdown from an \"Ocean View\" room- especially for hundreds of dollars per night!", "title": "Not what I expected,would not stay here again", "helpfulness": 4, "user": "TexasMalamute", "date": "August 17, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 19054353, "likes": {"liked": "— Location and look of the hotel represented online", "disliked": "— Service of the staff and how the property is maintained"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The Condado Plaza Hotel is very stylish and the photos on Expedia and from reviewers on this site are for the most part accurate depictions of what you get. Our room was spacious and we had a view of the bay from a corner window. The bathroom was huge and although we stayed only one night we felt that this room would be plenty comfortable for a longer stay. There are several pools and a beach area that was very nice as well as private spots available for rent.", "title": "Stylish hotel/resort but a little far from everything", "helpfulness": 3, "user": "WHERESWAUGH", "date": "September 17, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 2.0}, "id": 20141282, "likes": {"liked": "— Clean and sylish", "disliked": "— Location was too far from old San Juan and restaurants"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The only negatives are:", "title": "Beautiful hotel, service, so-so...", "user": "love2traveltogether", "date": "September 15, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 20102830, "likes": {"liked": "— Beautiful Renovations", "disliked": "— Some of the staff need to improve on their customer service skills"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Location - if you do not have your own car it is a $15 taxi ride each way into Old San Juan...a drive that took less that 10 minutes and seemed overpriced to us. There is a bus stop outside the property but since we were there on a Sunday the hotel staff told us the schedule of buses was unpredictable. We could only find 2 restaurants outside of the hotel in walking distance - a Mexican restaurant and a Cuban/Puerto Rican restaurant that was only open for dinner. Food at both were OK and generally pricey for what we got. If there were other choices available outside of the hotel in walking distance the conceirge staff was unaware of them or unwilling to give us additional information.", "title": "Great Rooms", "user": "RubenV76", "date": "September 10, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 19969601, "likes": {"liked": "— Hotel Staff", "disliked": "— Parking Fee"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Concierge/Tour Booking - very disorganized!!! Different person with different information every time we went to the desk. We were first told that the tours they book are the same price as if we were to book directly on our own, but when we booked with another person we were charged a higher price. I don't mind that the hotel makes their commission for providing a booking service, but everyone working that desk should be able to explain that to customers. We had plenty of time to try and do it on our own had we known we were going to be charged a higher fee, but by the time the tour actually got booked it was too late for us to do any arrangements of our own.", "title": "Oceanfront Favorite for San Juan", "helpfulness": 1, "user": "PhillyVoyager", "date": "September 8, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 19873247, "likes": {"liked": "— Stylish room and ocean view", "disliked": "— Weather (there while Hurricane Ike was passing through)"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled solo", "text": "My husband and I recently returned from a 2 night stay at the Condado Plaza Hotel and Casino. We stayed at the hotel prior to our cruise. I have been going to Puerto Rico all of my life (37 years) and it is my favorite place in the world. We had visited San Juan last year and stayed at the Caribe Hilton. When we were visiting last year we went by the Condado Plaza Hotel and Casino and had seen all of the renovations. We knew we were going to come back in 2008 and noted it as a place to stay.", "title": "Magnificent Property Marred by Terrible Service", "helpfulness": 1, "user": "KipNYC", "date": "September 6, 2008", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "location": 4.0}, "id": 19819242, "likes": {"liked": "— Pool scene, room design.", "disliked": "— Tour desk, staff attitude generally."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Arrived on Sat March 10, 2012. Check-in was very quick & easy. We stayed in a suite on the 10th floor, was just beautiful, great view, very nice accomodations. Pool & outdoor bar area is great. We were just an elevator ride away from the pool, bars, casino & restaurants. The property has a nice layout & everything is very easy to get to. Room service, housekeeping & everyone we encountered were very friendly & helpful. I can only say nice things about this property.", "title": "Nice property", "helpfulness": 1, "user": "Anne K", "date": "March 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126756147}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Hotel is a little out of the way if you do not have a car, but it is beautiful, well kept and has great customer service.", "title": "Lovely Puerto Rick", "user": "trisiebell", "date": "March 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 126687380}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "We had a sea view room which was spacious and we saw our cruise ship leaving San Juan.", "title": "A past gem in decline", "helpfulness": 3, "user": "JKDA", "date": "March 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 126607785}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "I would not recommend going out of the area on your own at night without car as it did not feel very safe.", "title": "Great place to stay. Will be back.", "user": "Drewindc", "date": "March 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126602058}, {"rating": 4.0, "stay_parameters": "Stayed April 2011", "text": "Lovely hotel to stay at post cruise.", "title": "Loved my room and the restaurant Pikayo", "helpfulness": 1, "user": "CanadaRockiesgirl", "date": "March 24, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 126589513}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "My boyfriend and I arrived around 12:30p.m check in was not until 4:pm....as soon as we arrived check in was fast and they also let us check in right away. We even got an upgrade to an ocean view room on the 9th floor the view was fantastic... hotel is very clean, looks just like the pictures online. The staff was very nice and accomodating and very helpful...the pool area was fantastic... the beach at the hotel is very tiny but serves a purpose...If you want more of a beach then walk up the street to the Marriott (public beach) rent chairs for $5 for the day and enjoy. The food and drinks are a bit pricey at the hotel but you can also go up the street we found alot of nice places to eat and the food was fantastic! I recommend Hacienda Don Jose right up the street.....ocean view to die for!!! great breakfast, lunch and dinner and very inexpensive. Also for dinner we went into Old San Juan and ate at a very nice place called Raices (Cuban food) (make reservations the hotel will make them for you). very good!!! Also try Cafe del Angel up the street as well and Ropa Vieja.......Tip....buy your beer, wine, etc at the package store up the street as well and buy a small cooler as you can take it on the beach becuase it;s public instead of buying a beer for $8 of a frozen drink for $10..We loved it so much that we just booked another trip for april!!!! Cab ride where ever you go is $15....you also have to go into Isla Verde go to El San Juan Hotel very good entertainment and cool place to go dancing and people watch!!! Hope this helps!! Have fun!! Thanks Again Mr. Neumann for making our vacation a trip to remember!!!", "title": "Loved it!!!", "helpfulness": 2, "user": "islandgirl3568", "date": "February 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13846033, "likes": {"liked": "— The ocean view room on the 9th floor", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We stayed at the Condado for a week in January. The room was recently renovated and especially nice, since we faced the ocean. The staff was always helpful. The hotel has three nice pools, including one with salt water. It also has a real, well equipped fitness center. Location is good with lots of restaurants within walking distance. Great place and not expensive!", "title": "Very nice resort", "helpfulness": 1, "user": "Rhodie12", "date": "February 24, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 13806310}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "Stayed one day pre-cruise and can't say enough nice things about the hotel and staff. We got in to San Juan around 1 PM and were able to check in early to a large room in the renovated main tower. My sister stayed in the part of the hotel across the street via a walkway and her room was nice, but her bathroom was about one fourth the size.", "title": "Lovely Hotel for Pre-cruise", "helpfulness": 3, "user": "lvs2cruz", "date": "February 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 13716027, "likes": {"liked": "— Cleanliness", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Our room had a city view, but we could see the cruise ship docked from our balcony.", "title": "Fantastic experience!!!", "helpfulness": 2, "user": "bal2278", "date": "February 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13680422, "likes": {"liked": "— The fantastic service, pool and fabulous location!", "disliked": "— I liked it all!"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The lobby area was gorgeous -- very clean and moderrn, and even had a huge fish tank to watch if waiting for a taxi.", "title": "Skeptical but pleasantly suprised!", "helpfulness": 3, "user": "dsmulligan", "date": "February 19, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 13675395, "likes": {"liked": "— Trendy feel, good pool area", "disliked": "— Food, casino and lack of internet"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "This was one of the best hotel experiences I've ever had. The staff was friendly. The room was clean and the service was great. The room had a very modern feel which was right up my alley.", "title": "The incredible Condado Plaza Hotel", "helpfulness": 1, "user": "kiss104dj", "date": "May 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 16420132, "likes": {"liked": "— Comfort, service and cleanliness.", "disliked": "— The food was very expensive."}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The food in the hotel was a pricey but everything I had at the grill by the pool was great and the service at the the grill was excellent.", "title": "Overpriced, room was great, overall just OK.", "helpfulness": 1, "user": "amyi", "date": "May 26, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 3.0}, "id": 16411940, "likes": {"liked": "— the room", "disliked": "— everything was ridiculously overpriced"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I stayed at this hotel because of Tripadvisor.com and I'm very happy with my decision. If you're looking for a hotel to relax with excellent amenities you should give the Condado Plaza a try.", "title": "Two thumbs up!", "user": "BluRodeofan", "date": "May 26, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16411444, "likes": {"liked": "— The room was excellent and the glass enclosed shower was sensual and unique!", "disliked": "— Restaurant service at breakfast."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The hotel decor is very pretty, and at night they usually had loud music playing. It was extremely crowded most nights and they had a bunch of various conferences and meetings there. It seems to be a big place for locals to meet.", "title": "Simply beautiful hotel....why so many complaints?!?!?", "helpfulness": 2, "user": "tokunoren", "date": "May 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16103710, "likes": {"liked": "— Gorgeous hotel, comfortable accomodations, nice casino", "disliked": "— No complaints!!"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "My biggest complaint is the cost of everything here. We aren't cheap people. But $50 for breakfast downstairs - and a very average one at that - is ridiculous. In-room PPV movies ranged from $12.99 to $24.99. $24.99 for a movie. Seriously. Also, they charged $16 per day for parking. I have never been to a hotel that charges their own guests for parking.", "title": "Condado is a great, clean, new fun hotel with nice pools!", "user": "kirstenl", "date": "May 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 15973824, "likes": {"liked": "— Clean and cool decor. Good, quiant casino too (and not smoky)", "disliked": "— the beach wasn't really a beach, but the pools made up for it!"}}, {"rating": 4.0, "title": "relaxed and unbothered", "text": "Had done research thru trip advisor and was anxious about choice. that was put to rest upon arrival. while there is some construction still taking place the staff makes up for any minor construction matters still left to handle. the cleaning staff on the fifth floor was magnificient. recommend you book ocean tower. the strip house was pricey but worth every penny (food snob that I am) the sushi was wonderful and for what you are paying the italian restaurant is adequate. the decor inside and the pool outside very soothing from the hot 84 degree sun. the food in the pool area was quite surprisingly good. I would definitely stay again and would recommend. A short walk away is Ropa Vieja(?SP) native restaurant. The food was magnificent and so was the service. Sit back have a glass of sangria and let your troubles pass you by. Vacation.", "helpfulness": 4, "user": "goodbyegirl", "date": "January 18, 2008", "id": 12770662}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We just got back from an excellent stay at the Condado Plaza! When the lady and I were trying to find a nice hotel in San Juan, I came across their website. From the pictures, it looked beautiful - which it was! I then read review upon this website and came across Henry Neumann and he ensured us that we would have a great stay - and they delivered.", "title": "Great Stay", "helpfulness": 6, "user": "hondacrvguy", "date": "January 16, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12693661, "likes": {"liked": "— Room decor, location, pools", "disliked": "— Some staff member's attitudes."}}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "The room was beautiful! We had an ocean view room. The pictures on their website really do show the actual product! Most of the staff we came across was nice, some need a lesson in hospitality.", "title": "Okay stay", "helpfulness": 3, "user": "SSSNES", "date": "January 14, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 2.0, "location": 3.0, "value": 3.0, "rooms": 4.0}, "id": 12621020, "likes": {"liked": "— The pools/hot tub.", "disliked": "— The construction noise and service at front desk."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "We ate at the italian restaurant - while the portions were great, the food was just so-so.", "title": "beautiful hotel", "helpfulness": 6, "user": "elfin44", "date": "January 5, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12343536, "likes": {"liked": "— new rooms and furniture", "disliked": "— casino"}}, {"rating": 5.0, "title": "Highly recommend - Nicely upgraded rooms", "text": "They were putting the finishing touches on the swim-up bar, which was a nice touch. The staff poolside made sure we always had a drink in hand. Beware though - Drinks are VERY, VERY expensive!", "helpfulness": 1, "user": "TravellerfromPhilly", "date": "January 2, 2008", "id": 12280824}, {"rating": 2.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "My husband and I stayed at the Condado Plaza for 3 nights pre cruise. The location couldn't have been better. It was close to Everything!! We were Very hesitant to stay here due to some of the reviews we read and with all of the remodeling taking place. I called three times before our arrival to make sure the stories were all the same; construction only took place between 9am – 6pm, and there was an empty floor left between the occupied floors and the construction floors.", "title": "Great Location; Wait until construction is over.", "helpfulness": 2, "user": "krosas", "date": "March 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 6910396, "likes": {"liked": "— The location", "disliked": "— The concierge desk"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "When we checked in, the staff was pleasant; the man who checked us in was young and didn’t have a lot of information on the sites around us, but was able to refer us to the concierge desk. We had a long day of travel and decided to call it a night and meet up with the concierge the next day. We headed across the bridge to our room. We were met with construction. It was ok though; everything was blocked off as it should be and looked relatively safe. We got to our room, it was what we expected, a room in major need of renovation, but it was clean and seemed well put together.", "title": "Staff was wonderful", "helpfulness": 2, "user": "go2bch", "date": "March 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6901510, "likes": {"liked": "— staff", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "That night, we were awoken several times to things dropping outside the hotel. At 2am I went out on our balcony only to find construction workers dropping heavy items down to the first floor to load in dumpsters. The noise continued for most of the night. So much for only doing construction between 9am and 6pm!", "title": "Wonderful", "user": "BCintron40", "date": "March 2, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6900707, "likes": {"liked": "— Everything except the beach and pool", "disliked": "— No kiddie pool available which is difficult with Toddler"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "We spoke with a lady at the front desk the next morning who told us to check in around 6pm and she would move us to the newly renovated tower; for the same government rate! We were thrilled and surprised. A lot of the reviews state how rude and not helpful the staff are; we were pleasantly surprised!", "title": "Nice Hotel, Great Location", "user": "NYCobalt", "date": "February 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 6806049, "likes": {"liked": "— Comfortable room with amazing view", "disliked": "— Too much smoking"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "The newly renovated room was outstanding. They really have done a nice remodel to the new rooms.", "title": "loved it all the way!!!", "helpfulness": 1, "user": "hottieblondie", "date": "February 13, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6786688, "likes": {"liked": "— the room (bathroom)", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "I love the hotel, the new rooms are breathtaking, excellent staff, specially front desk and concierge, pool food is good, but too expensive, excellent ocean view i really loved!!!!", "title": "I love the hotel!!!!!!!, New rooms awesome!!!", "helpfulness": 4, "user": "womanatwork", "date": "December 11, 2006", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6362490, "likes": {"liked": "— rooms, staff", "disliked": "— food price"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "This was our first time in the condado area. The hotel has been renovated and they really are doing a beautiful job. The rooms are beautiful huge balcony. The bathroom was huge with a walk in closet safe, small fridge, glass shower and powder room area. The room was big had a flat screen tv. We had a room overlooking the old san juan are just breath taking. The pools area is overlooking the lagoon and beach nice breeze. Close enought to old san juan we took a cab. The restaurants are a bit pricey especially the pool we had some drinks and sandwiches it ran us about 60 bucks. We walked nearby for breakfast and found this cute local restaurant there breakfast was 5.95 coffee and OJ includes food was good. The area in the condado which was an amazing place years ago is ubder contruction they are renovating all the the hotels in this area so they is construction going on but i did not hear anything at all. This place is really worth the stay. you are closer to old san juan than isla verde where those hotels are double the price. We are going back in January...", "title": "Beautiful View", "helpfulness": 5, "user": "RMICHELLENY", "date": "November 28, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 6185753, "likes": {"liked": "— THE POOL AREA, LOCATION AND VIEW", "disliked": "— CONSTRUCTION IN THE SURROUNDING AREA"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Just back from our trip to the Condado plaza. This was our third trip this year. The hotel has made improvements in all phases of the operation.The oceanvista rooms are very nicely decorated, the staff are very helpfull, and the casino is the best in San Juan. Keep up the good work and thanks for a wonderfull stay. We will return soon.", "title": "Better every trip", "user": "t134", "date": "October 24, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6007378}, {"rating": 2.0, "stay_parameters": "Stayed January 2006, traveled as a couple", "text": "We checked in to the Condado Plaza for an extended weekend last January. This property was probably, at one time, a great place. Unfortunately the upkeep and customer service were both lacking.", "title": "Great Location - Potential for a Great Place", "helpfulness": 4, "user": "scottandrew75", "date": "October 9, 2006", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 4.0, "location": 5.0}, "id": 5931868, "likes": {"liked": "— The location and potential to be a great place...", "disliked": "— The lack of upkeep and poor customer service."}}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "It is nice to see, with response to recent reviews, that these issues are being addressed. The location for this hotel is perfect for day and night fun. The \"beach\" at the hotel is hardly a beach... but only a 10 minute walk down the street is a nice beach to lay out and swim at.", "title": "You get what you pay for at the Condado", "helpfulness": 3, "user": "stevilboy", "date": "October 2, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 5901731, "likes": {"liked": "— The Main Swimming Pool", "disliked": "— Lack of reasonably priced breakfast and lunch food"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2005", "text": "We arrived at the Wyndham Condado for a three night stay over the weekend. I was a little nervous, after reading some of the reviews here. However, I was overall satisfied with our stay. Check in was fine. Staff were curtious and attentive. I joined Wyndham by Request, and when we arrived, our choice of wine and cheese were there. Very nice. We are not gamblers, but the casino was jumping. We played tennis in the morning, and there was no problem getting a reservation. Our room was well cleaned, sheets included, every morning. For the price we paid, I believe this is a good value. To be honest, there were a few things that caught our eye: This hotel does need a facelift. Carpets and walls were well worn. Our room was nice, but overall things could be updated. I am not usually petty; however, the condition of the carpets in the hallways really stood out, and gave this hotel a \"motel\" feel. If you prefer a beach setting this is not your place. The beach is tiny. The pool area is nice. If you have children they will love the water slide. Overall the pool/beach area was just ok. Again, hate to complain - just pointing out a few problems. We chose to take the C10- .25 cent bus to Ocean Park beach. Now there is a beach!! Beautiful. On a good note: The bed, and down comforters, and pillows were excellent. Very Very comfortable. Shower pressure, excellent (which is a definate plus in the Carribean!). We took the advice of some previous posters and headed down the block to La Hacienda for an absolute delicious breakfast next to the open windows overlooking the ocean. Our check for two was never over $15.00. (B'fast at the hotel is $18.00 per person!). Definately stay away from the hotel restaurants in general. They are so overprice, and service is usually so-so. There is a small coffee shop on the street at the bottom of the entrance of the hotel that sells great coffee and snacks all day, again, much less expensive than inside the hotel. For dinner we headed to Old San Juan every night. Can't go wrong with the many choices of restaurants on Calle Forteleza. Especially Tantra. (What A Meal!! What Service!!) Take a cab to this street and check out all the great restaurants. It is worth the $10 cab ride.", "title": "Nice hotel, needs a little updating. Good Price.", "helpfulness": 10, "user": "Janine M", "date": "May 4, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3437503}, {"rating": 2.0, "title": "Nice resort, but problems at the front desk", "text": "I stayed at the Wyndham Condado from April 16-23 (Spring Break) with 37 of my high school students. The actual resort is nice - pools, grounds, jacuzzis, rooms, lobby, etc. The beach area is TINY, but still nice. My kids snorkeled and saw brightly colored fish, squid and even barracuda. Food at the pool restaurant was good and fairly priced! ($11 for cheeseburger plate)", "helpfulness": 4, "user": "A TripAdvisor user", "date": "April 28, 2005", "id": 3422478}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "The rooms were spacious, but gently worn. This hotel is nothing like the Wyndham El Conquistador in Fajardo, but it still is nice! The oceanfront rooms are MUCH NICER than the other ones! Ask for an oceanfront room at the end of the hall. I had 344 and it was lovely!", "title": "Good for the price", "helpfulness": 6, "user": "mmc95", "date": "April 28, 2005", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "rooms": 4.0, "service": 3.0}, "id": 3421831}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "We ate dinner at Max's Grill one evening and the food was delicious. The presentation was beautiful and the salmon and scallops were to die for!", "title": "Excellent Stay", "helpfulness": 3, "user": "mws813", "date": "April 27, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 3418713}, {"rating": 4.0, "title": "Very enjoyable stay", "text": "($25) Another evening we ate next door at Ropa Vieja ($18). It was very good, too.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "April 26, 2005", "id": 3416302}, {"rating": 4.0, "title": "Very enjoyable stay!", "text": "Overall: We visited San Juan this March for 4 nights and stayed at the Wyndham Condado. Lovely experience at the Wyndham for the price, (booked on Expedia) comfortable rooms, good location, on a small beach, plenty of pools, lots of restaurants around. Good value for the price -- mid range family hotel in San Juan.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "March 26, 2005", "id": 3303456}, {"rating": 3.0, "title": "Not too shabby", "text": "Rooms - We paid for a City View, got a room in Laguna Towers (across the street from the lobby & beach), connected via casino hall, had a beautiful balcony overlooking the water. Definitely try to get a room with balcony that faces the water (also, perhaps I was upgraded through Wyndham By Request). The room was comfortable and perfectly adequate - upon close inspections some of the wood is chipped/scratched, but not a big deal. (I've stayed luxury hotels like the Mandarain/Ritz, it is NOT that, but neither are the prices.) Bathrooms were quite small and our phone did not work well, we tried to get someone to fix it, but it never really worked. However, not that important to us!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 24, 2005", "id": 3299526}, {"rating": 3.0, "stay_parameters": "Stayed March 2005", "text": "Hotel - Tennis courts were $10/hr, we NEVER had a problem reserving or using a court. The pools were gorgeous although at one pool they had a DJ that was playiing music loudly, but we just went to another pool area. Plenty of chairs, umbrellas, towels, always available. The beach is quite small, so one day we spent the day there, the next day we took a $10 cab ride to Isla Verde to a larger beach. By the water sports area it took some time trying to rent a double kayak (first time we stopped they didn't have any available, second time we got one), but it was beautiful paddling around the lagoon. To check out, the service is quite slow, we stood in a long line, but we were so relaxed on vacation, we didn't care too much! The maids were fine (a little loud clanging in the hallways in the morning), pool waitstaff was perfectly nice.", "title": "Average Hotel - Above Average Rates", "helpfulness": 7, "user": "Cheef45", "date": "March 24, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 3299346}, {"rating": 3.0, "stay_parameters": "Stayed March 2005", "text": "Food - We took the $0.25 bus ride to Old San Juan, visited El Morro and the other fort. We had lunch inside some local mall, very authentic Puertican food! Another place I would recommend for lunch (we never woke up in time for breakfast!) by the Wyndham Condado is a small Mexican place down the street, don't know name, but wonderful ocean view, terrific food (slow service) reasonable prices. We also visited Ajili Mojili for upscale PR food (average rating, expensive) and La Casita in Isla Verde (very good local food, cheap, moderate diner ambience), Tona Roma's in the hotel (good for American ribs! moderate prices), sushi in the hotel (pretty good too).", "title": "Know What You Want", "helpfulness": 9, "user": "cinnman45", "date": "March 24, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 2.0}, "id": 3298965}, {"rating": 3.0, "title": "Comfortable, though not luxury", "text": "Other - We also visited the Zen Spa near the hotel - great experience!! Very reasonable prices (at least vs. NYC) and had a lovely massage. Also, the concierge desk at the Wyndham was always swamped so I would research where you want to go before you get down there. We could not get into the DragonFly restaurant since we had not put our name on the waiting list, so I'd do that before!", "helpfulness": 9, "user": "A TripAdvisor user", "date": "March 23, 2005", "id": 3296006}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "We returned last week from a 3 day stay at the Conrad after getting a very good rate with Priceline. (Note: the hotel charges a $15.43 a day resort fee, that was not included in the Priceline rate, and I was not aware of until check-out time.) Overall hotel was nice, we got a city view room (per other reviewers tried to lagoon view--but hotel was full). We had a problem with the first room that the door would not lock, call front desk and they promplty moved us to another room without any problem. The beds were comfortable and we enjoyed the bathroom wtih the glass encased walk- in shower. The hotel property was nicely situated, I enjoyed the lagoon area, where there were loungers and hammocks to just enjoy sunshine and view of the water.", "title": "Nice hotel", "user": "56michelem", "date": "March 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 126500095}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "I was surprised of the limited activies to do at this property after hours. There is a casino , a bar area located in the lobby and 3 restaraunts . They have a lounge (Aqua Lounge), but it was not open during our stay.", "title": "Great place", "helpfulness": 2, "user": "Catherine M", "date": "March 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 126470982}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "We didnt eat at any of the restaraunts on the property, but did take advantage of the Denny's, which was just across the street. There are plenty of places to eat, within walking distance of the hotel. One that I recommmend is Casa Lola, food was good and great sangrias! All in all a good stay, with a good rate I would stay again!", "title": "Another solid visit...", "user": "gary7272", "date": "March 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 126424405}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "Very nice hotel - lots going on late at night, and many people. The room was really nice - spacious and very clean! Had a view of the lagoon to one side and the ocean out the other way. Would stay here again! (I used priceline though so I did not pay as much as their rates are published...don't think I would for that price) Only complaint is that there is only a tiny beach nearby that was very crowded - but it was great for a 1 night stay!", "title": "Awesome views of city & lagoon", "user": "Sawwhetowls2", "date": "March 19, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 126349247}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "A friend and I won the Conrad on a priceline bid. Despite the priceline bid, they honored my diamond status on Hilton and gaves us breakfast vouchers...Bravo to the Conrad San Juan Condado...As for the room, we did get a room facing the street, but it was totally satisfactory. All of the personnel at the hotel were friendly and efficient. Despite the inclement weather for part of the time, the grounds were well kept and the pool area was fine. We also appreciated the mango water in the lobby after a day of sight seeing. The casino is quite small and I did not see many people winning.. My only complaint is while there was wifi in the room, you had to pay if you wanted to use the computers and printer in the business center..Overall, a solid hotel for the Condado region, though most of the action is a few blocks away as the hotel is the last on Ashford...", "title": "Very good location", "user": "gcbctc", "date": "March 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 126327937}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "the hotel was nice, it was in various stages of renovations, although no current construction was going on, the pool area was very nice with a water slide for the kids & a swim up bar...the beach area is very small and close to a main road, the view was beautiful, the fitness room was adequately supplied with equipment, the staff was courteous, it seemed the food & drinks were very expensive but maybe it is this way anywhere in san juan?", "title": "was nice", "helpfulness": 1, "user": "beach_mom_leesburg", "date": "May 5, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 15658479, "likes": {"liked": "— rooms were spacious and clean", "disliked": "— costly drinks and food"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "I had stayed at Condado Plaza about 5 years ago, on business. We decided to return for vacation, since I heard about the renovations. All in all, I think they did a great job.", "title": "Enjoyed our stay", "helpfulness": 1, "user": "lfaust2Atlanta_GA", "date": "May 4, 2008", "detail_rating": {"front_desk": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 15633741, "likes": {"liked": "— Location"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "The only complaint I have is that it takes forever to check-in and out. It seems they should have more front desk reps on duty, especially on the weekends. Also, the showers didn't seem to be designed with much thought. The door opens right into the \"closet\" area, and ours also leaked a bit.", "title": "Nice Grounds but has Accounting Problems", "helpfulness": 1, "user": "Wyomingirl", "date": "April 30, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 15504649, "likes": {"liked": "— The pool area and surrounding grounds.", "disliked": "— Nightmare accounting problems."}}, {"rating": 5.0, "title": "condado plaza hotel &casino", "text": "In general, we enjoyed our stay. We had an ocean view king room. It was very quiet at night, since we were on one of the higher floors. Room was clean and comfortable. We only had a couple meals in the hotel (breakfast), since the prices were pretty expensive. But, the concierge was very helpful in helping us find places to eat. The location is great. Easy to walk around Condado and very close to Old San Juan. There is also an Enterprise car rental office on-site, which is very convenient if you want to explore the island.", "helpfulness": 1, "user": "jrivera", "date": "April 30, 2008", "id": 15499622}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Booked the room back in October 2007 continued to follow the rate and when it dropped called and asked for an adjustment. My credit card was then billed for the full amount again. Took two more calls to get this resolved.", "title": "very nice", "helpfulness": 2, "user": "april20", "date": "April 28, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 15444615, "likes": {"liked": "— The beach was public"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "It looks as if everyone posting before me has covered just about everything that needs to be said about this hotel.", "title": "Overall, a Pleasant Stay", "helpfulness": 1, "user": "DameKane", "date": "February 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 6783894, "likes": {"liked": "— Pool Area and Guest Room", "disliked": "— Hotel union demonstration"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled with friends", "text": "We were in the newly-renovated tower on the ocean side. The room as well as the bathroom was spacious and clean with lots of natural light during the day. Our room was cleaned most days by 10:00 a.m. (we were there six nights). Also, there were plenty of fluffy, white towels and nice toiletries every day. I can't say for sure, but I think the sheets and pillowcases were changed at least once during our stay (maybe more). They were spotless.", "title": "hope it gets better!", "helpfulness": 1, "user": "tbakas", "date": "February 5, 2007", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 4.0}, "id": 6746070}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "The pool area is attractive, spacious and well layed out. Unfortunately, the first three days landscape workers were trimming the bushes and trees and then grinding them in a truck nearby the pool area.", "title": "Great location, will be better when renovations complete", "helpfulness": 3, "user": "mcmarya", "date": "February 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6746057, "likes": {"liked": "— Location", "disliked": "— Construction noise"}}, {"rating": 4.0, "title": "Great time at the Condado", "text": "Kudos to the front desk staff, especially those working the Concierge Desk. They responded to our pesky daily inquiries with professionalism and good humor.", "helpfulness": 2, "user": "melone925", "date": "February 1, 2007", "id": 6726384}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "I have to say though that the hotel union workers demonstration at 6:00 a.m. was scary being woken out of a dead sleep. We don't speak Spanish, and had no idea what was going on in front of the hotel with police sirens and some guy going on and on with a loud bullhorn. We nicely complained to management, but we weren't as lucky as the previous poster...all we got was two complimentary breakfasts for two days = $28.00.", "title": "Looks like hotel is on its way up again.", "helpfulness": 1, "user": "MyAdvice", "date": "January 23, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "location": 4.0, "rooms": 3.0}, "id": 6650039, "likes": {"liked": "— Location", "disliked": "— How much it declined since 2000"}}, {"rating": 4.0, "title": "Loved the Wyndham Condado Plaza Hotel and Casino", "text": "My sister and I just returned from a 3 night stay at the Wyndham Condado Plaza. We found everything there to our liking. At first glance from the cab ride from the airport, we were disappointed in the view of the lagoon and wished we were staying on a resort on the ocean. However, we discovered the beautiful grassy knoll on the hotel grounds above the ocean crashing on the rocks. Plenty of comfortable chaises, chairs, tables and hammocks. Beautiful ocean breezes. We ate lunch at the pool bar every day and found the prices and service wonderful. We discovered 2 great places for breakfast and dinner within a very short walk from the hotel. We had full eggs/bacon breakfasts at the Nueva Hacienda by the open windows overlooking the ocean crashing on the rocks. Breakfasts were around $5 and wonderful, especially the coffee with steamed milk. The Waikiki next door was even more scenic as we sat outside on the terrace and again watched the ocean crashing on the rocks beneath us. Meals were under $20 for dinner. One night we went to a highly recommened restaurant, called Ajili Mojily (slightly more high end) on the lagoon side. We didn't have a table with a view, but had an enjoyable meal with a very friendly staff, and the highest price meal was around $26. The casino at the Condado Plaza was good size for Puerto Rico and we had fun there too. Even though we had a City View (cheapest) room, we had a slight view from the balcony of the lagoon and the kayak races across the street. FYI, I booked our rooms through Expedia, so the Wyndham would not accept our membership for the welcome baskets or room upgrades. They only honor membership if you book directly through the Wyndham reservation desk. I never did get to try the brownie sundae highly recommended on this site, but it was under $5 even though the ice cream parlor was in the hotel. I found the prices of meals in San Juan and even in the hotel to be quite reasonable (in comparison to Ft. Lauderdale, FL). We thoroughly enjoyed our trip and stay in Puerto Rico and will plan to go back there again.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "April 24, 2005", "id": 3401686}, {"rating": 4.0, "title": "Wyndham Condado", "text": "Just returned from 8 days in the British Virgin Islands and decided to explore Puerto Rico on the way back. We stayed 3 nights at the Wyndham Condado, April 1, 2 and 3, 2005. We'd heard some awful reviews, but our friends had booked the hotel for 1 night and we just decided to extend the stay and remain at the Wyndham Condado. We loved it and Puerto Rico both!......We registered with Wyndham by Request as suggested in advance. Check in took 5 minutes maximum. We had a room over looking the bay across the street. The room was clean and spacious. Nice view of the bay with a small patio. Room had a coffe maker and tea always kept stocked each day. Wyndham by Request left beer, fruit and cheese and water in our room on day 2. My boyfriend is a picky eater....so when he finds a restaurant he likes, it's hard to get him anywhere else....as a result we ate dinner each night in the Italian Restaurant located in the hotel. Food was great (we always had one of the specials, Mahi-mahi or medallions of beef with pasta on the side) and a glass of wine, all very good. Dinner ran about $75 per night for both of us. Breakfast at the hotel is expensive. About $30 for your basic eggs, bacon, toast breakfast. There is an extensive buffet for about $18 per person. The casino is small (of course we go to Las Vegas quite a bit, so there's no comparison), too many nickel slots. Our friend sat at one of the black-jack tables and complained about it taking 45 minutes to get a drink. ....My complaint: Most machines require a hand-pay for any jackpots over $50.00 - $100.00 and on 3 occassions I sat for more than 45 minutes each time waiting to get paid.", "helpfulness": 3, "user": "brisner2000", "date": "April 7, 2005", "id": 3342908}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "Things to do: We took a cab to see the forts and explore Old San Juan on foot the first day. Our cab driver took us to Fort (Cristobal?) and we began exploring this fort first, great veiws Old San Juan and the wall extending all the way to the 2nd fort (El Morro?). Beautiful walk along the coast connects the 2 forts with vendors selling things on the stroll from one to the next. So many kids flying kites when you arrive at El Morro - a beautiful sight!.....Then, we had \"Frommers Puerto Rico\" and it contains a map and walking tour of Old San Juan that really helps you to know what the buildings are that you're seeing, (highly recommended). One thing it doesn't mention that you must do, (told to us by our cab driver), when you stop at the Old Church, proceed directly across the street and walk down to the bottom of the hill to see the only remaining gate to the city built by the Spanish. (there were originally 6 gates). Another beautiful spot. 2nd day booked a tour right from the hotel, the Rio Muy Caves and Arecibo Observatory. Caves were amzing. Took about 1 1/2 hours from the hotel by van. You travel in a tram down to the cave entrance (it's massive!) and you go on a walking tour with a guide for a bit over an hour). Not much to see at Arecibo, but it is an amazing sight if you remember the movie \"Contact\" with Jodie Foster - it's there! - There's a room with lots of scientific interactive things to do, but we enjoyed it. Back to the hotel and we enjoyed the salsa music and watched the great dancers right in the hotel that night!....", "title": "Nice Hotel- Good location", "helpfulness": 10, "user": "TravellerFairfax", "date": "April 6, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3339819}, {"rating": 3.0, "title": "Was Pleasantly Surprised", "text": "So, people were so friendly everywhere we went, we loved it...enjoy", "helpfulness": 8, "user": "A TripAdvisor user", "date": "April 2, 2005", "id": 3322612}, {"rating": 2.0, "stay_parameters": "Stayed July 2003", "text": "We just came back from SJU Tuesday. We were there for 4 days. Check in was smooth. Took about 10 mins. They could not find the reservation", "title": "Don't expect special treatment on your honeymoon", "helpfulness": 5, "user": "CarribeanTrvler", "date": "March 30, 2005", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 3314454}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We just returned from a wonderful vacation and our first time in Puerto Rico. After initially booking at the Gran Melia in PR I read some negative reviews on tripadvisor and switched to the Condado Plaza. I can't emphasize how happy I am that I did. We arrived on Monday morning and checked right in without a wait. There was a problem with the first room we were given. The sliding door to the balcony had been left open and the bathroom was infested with mosquitos. Once we brought this to managements attention we were immdiately given another comparable room without hesitation. Every staff member we encountered throughout our stay was effiicient, friendly and polite. The head of guest relations Henry Neuman was very present and approachable. Javier was my favorite porter at the door. Any negative seeming issues we had were quickly dealt with including a leak in our room on our last night there. I also had a mishap with a dryer in the small laundry room on the premises that ate my quarters. It was so nice to be able to wash my clothes and not pack up a suitcase full of sand that a dryer that ate my quarters was a small price to pay for the convenience of not having to go off the grounds to do laundry.", "title": "Great stay despite some snafu's", "helpfulness": 1, "user": "bdbmommy", "date": "July 26, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 18287269, "likes": {"liked": "— Great service, comfortable rooms, fun pool action", "disliked": "— Thin walls, overpriced mediocre poolside food"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "I would echo other reviewers sentiments that the food by the pool was very pricey and of mediocre quality. After one lunch there (we were too tired upon arrival to go forraging outside the hotel for a meal) we did not eat at the hotel at all. Having a Starbucks on the grounds helped get the day started with ease and we ate off the grounds for the rest of the day during our stay.", "title": "Nice, clean, expensive", "helpfulness": 1, "user": "shemedic", "date": "July 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "location": 1.0, "rooms": 5.0}, "id": 18203067, "likes": {"liked": "— the room", "disliked": "— the price of everything except the room"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "During the week the action at the pool was manageable and it was not difficult to find an empty chair. Our ten year old son had a blast on the water slide and made friends while waiting on line. We had Diana as our server for poolside drinks and she was lovely and available without being overbearing. Like other reviewers I observed that there were people at the pool who did not seem to be guests of the hotel. When entire families show up at a resort pool in street clothing it does seem a bit suspect and I saw that more than once during the week. However once the weekend hit and the hotel was at what seemed to be capacity they began issuing wrist bands with the towels. The lagoon beach is small but had some fun snorkeling. We saw squid, octopus, puffer fish, trumpet fish and numerous other colorful tropical fish.I would suggest if you like to snorkel bring your own gear. This is a resort and they charge resort prices for gear rental.", "title": "ok stay", "user": "TALLEYS", "date": "July 12, 2008", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 17818498, "likes": {"liked": "— very clean nice view", "disliked": "— front desk people"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Yes, as mentioned in other reviews the elevators are slow. It seems as though there just aren't enough elevators for the amount of people the hotel can hold. During the week it really wasn't a problem but when the hotel filled up on the weekend with conventions and weddings it became more noticeable. Most people just took it in stride. The rooms were kept very clean. I would call the decor tropical West Elm. My one complaint about the rooms would be that the walls were a bit on the thin side.", "title": "Absolutely Fantastic!!!", "helpfulness": 1, "user": "ladyj415", "date": "July 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17657968, "likes": {"liked": "— Everything!! The food, service, views, and so on...", "disliked": "— NOT ONE THING! Didn't want to leave!"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We got around mostly by cab after one attempt to go local and take the bus that resulted in a wait that was over an hour. If you like surfer communities go to Ocean Park beach and go to Pinky's or Top Hamburger for lunch. Everywhere we went in Puerto Rico the service was friendly and a refreshing change of pace.", "title": "great stay with a few minor details", "helpfulness": 1, "user": "caicaiflutterby", "date": "July 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 17647060, "likes": {"liked": "— the room", "disliked": "— pool setup -- have separate one for children."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Just returned from a 3 night stay at the Condado Plaza Hotel and Casino. Check-in was quick. Our first room was worn (peeling paint, damaged door to balcony, etc.) and the room had a major problem with the climate control. It felt as if you were outside - extreme humidity. We called for repair and were told it would take 15 minutes, after 40 we called again and they switched our room. This is where the potential disaster ended. We were upgraded to Ocean Front (in another tower - THIS IS A MUST, if you are booking; only stay in the Ocean Front tower, the other tower is NOT GOOD.) The rest of our Hotel experience was great. The room was very nice and clean, bed and sheets were nice/comfy. Loved the contemporary feel. The view great! The grounds at the hotel also were very nice. The main pool was well kept. The pool bar made strong drinks but wow $12 for one drink, laughable. Take your own. Must try out the slide, too fun. Cold towels were provided as well as umbrella, etc. Good time. We only ate at the Italian restaurant for breakfast one day and it was normal priced, just fine with good service. This hotel made the trip to PR much better than it could have been.", "title": "Could have been a disaster, but...", "user": "2scompany3sacrowd", "date": "August 16, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 19016886}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Were there from 7/31 to 8/9 , 2008 with two boyz, 5&8. Loved it. Have been to San Juan several times and stay at the Marriott Resort but didn't miss it this time.", "title": "Excellent", "user": "riding_rockets", "date": "August 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18936399, "likes": {"liked": "— Easy to get around, polite and helpful staff, clean, reasonable.", "disliked": "— internet connectivity."}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "There are two buildings, one facing a lagoon, has one pool, gym, the other is ocean front, a pool with a slide, a salt water pool and the beach. Very calm beach which is public as are most in Puerto Rico.", "title": "Weird smell, weird door-Not what I expected", "helpfulness": 2, "user": "kmiloMd", "date": "August 11, 2008", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 18863754, "likes": {"liked": "— pool area and friendly staff", "disliked": "— the smell in my room"}}, {"rating": 5.0, "title": "Loved it !!!", "text": "Italian restaurant overlooking ocean great for breakfast, try there 2 by 2 brkfst and you'll never need lunch.", "user": "Wolette", "date": "August 7, 2008", "id": 18717714}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Staff is extremely nice, especially Bernice who is a hostess at the Italian place. Great steak at the Strip restauraunt.", "title": "Lovely hotel", "helpfulness": 1, "user": "Mamagata", "date": "August 3, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 4.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 18581302, "likes": {"liked": "— View of the ocean.", "disliked": "— Small closet in bathroom."}}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "I was not at the hotel unless I was sleeping so I cannot comment on a lot of the aspects of the hotel. Here is what I experienced while I was there then you will realize why I was not at the hotel at all.", "title": "Not for me...could be for you...", "helpfulness": 1, "user": "IHeartTraveling_TEYN", "date": "March 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 126870405}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "My room - standard lagoon view 5th floor", "title": "Not bad/not great. When a resort fee is charged...", "helpfulness": 1, "user": "FamilyOfFour08", "date": "March 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 126844151}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "- Nothing special about the room, but it was nice and clean", "title": "good stay", "helpfulness": 1, "user": "thinkn333", "date": "March 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 126795166}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "- Bathroom was very small. The door to the walk-in shower was 5 inches away from the sink when fully open. Definitely could not fit two people in there at once. Otherwise it was decorated nicely and it was clean which is the important part.", "title": "A breath of luxury and relaxation!", "helpfulness": 1, "user": "Amanda S", "date": "March 27, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 126779715}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "- The bedroom itself was nice. Comfortable bed and nice TV. Had a lounge chair in the room which we used as a table for a couple of our bags. Again, decorated nicely and was clean.", "title": "Nice place to stay", "helpfulness": 1, "user": "mackpav", "date": "March 27, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 126759514}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The Condado Plaza is a high rise motel with upscale prices. We stayed for a week from Christmas to New Year's Eve and were very disappointed. Staff were friendly and responsive. We should know because we had to ask for so many problems to be corrected such as: banging air conditioner, flickering lights, coffee and shampoo in room not replaced, room never vacuumed, etc. We gave up on asking for the filthy windows to be cleaned. The Italian restaurant had the slowest service, waiters with attitude and several meals were sent back because they were inedible (mealy pancakes and a cold, dried out hamburger). The $10 hot dog at the pool was a joke and the extra $5 for a few french fries was and insult. By the way, a note to the poolside cook, fish and chips does not mean fish and potato chips! This place just does not get it. Try the Marriott or La Concha just down the street. They are both hip, beautiful and even a few dollars less expensive.", "title": "Very Disappointed", "helpfulness": 1, "user": "SPARNewYork", "date": "January 2, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 12264062, "likes": {"liked": "— Location", "disliked": "— Everything else"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2005, traveled with family", "text": "We stayed here after a 6 night cruise, it looked lovely in the brochure. It was a bit dissapointing, the rooms are a nice size but a little grubby. The staff were ok some were nice but we found the check in staff a little rude and snappy.", "title": "A little disapointing", "user": "MissyGalway", "date": "December 28, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 2.0}, "id": 12018367, "likes": {"liked": "— Location", "disliked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "They had a selection of restaurants but they were quiet expensive. It is in a nice location but away from the old town and you need a taxi to access most areas.", "title": "Fantastic family vacation!!!!", "helpfulness": 1, "user": "nina517", "date": "December 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 11717970, "likes": {"liked": "— Beautiful rooms with ocean view and balconies where I could sit and stare at the sea for hours!!", "disliked": "— Ummm...I really didn't dislike anything about the accomodations!"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "For the price its an average hotel.", "title": "Perhaps When They Are Finally Finished . . .", "helpfulness": 2, "user": "TSUalum93", "date": "December 12, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 11503097, "likes": {"liked": "— Kind and helpful staff", "disliked": "— Property not yet finished. Not prepared to handle a group of this size. Major check in problems."}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "Our title summarizes it all--we had a fantastic time at the Condado Plaza. Henry Neumann was the only person who could guarantee us adjoining rooms. We called a couple of other hotels in the general area who said they could have 2 rooms, but couldn't guarantee adjoining. Traveling with 3 small children, it was de rigueur for us to have this. Henry was great, and set us up in two fabulous rooms. Everything was new, shiny, clean, perfect!!", "title": "The Condado is So-So", "helpfulness": 2, "user": "Peepsluv", "date": "November 30, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 3.0}, "id": 11174130, "likes": {"liked": "— The small local beach and the 24hr pool", "disliked": "— The distance from our hotel room to the pool area"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2004, traveled with family", "text": "The room and hotel was very nice, when I first walked in the room I loved the ocean view with balcony, although there was a butter knife and fork on one of the beds. Front desk personnel had the \"I don't care will no t help you attitude\" it was very dissapointing and fustrating disputing erroneous room charge that took half and hour to resolve upon check out finally left the hotel in tears. The pool was mostly empty no water in it for the most part of the 4 days I stayed there. And the only day there was water in the pool the pool personnel was not friendly at all they did not offer any towels while they were standing at the towel booth just staring at you, It felt very unwelcoming went to the room to get towels. The parking is too expensive and seems to be overcrowded with cars from people who don't even stay at the hotel just there fot the casino. For the price you pay to stay at the hotel and the bad customer service parking should be free. Loved the room and hotel itself , . Coffee maker did not work in room took a day or 2 to replace after several calls. Maids were nice. Would stay there again if they had friendlier competent people working there, staff that deal with concerns/complaints seemed disorganized or not properly trained. Had a hold on my credit card for days after checking out, which was told was to come off within hours, I made reservation with credit card paid cash upon check out.", "title": "Terrible Front desk service, left in tears", "helpfulness": 3, "user": "M2685", "date": "September 22, 2006", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 5826277, "likes": {"liked": "— Room", "disliked": "— Front Desk"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Staffs are not friendly and there's a poop in the bathroom when we checked in the room. Great location as there's a bus stop right outside", "title": "Ok, but the staff are not friendly", "user": "n0clule", "date": "September 7, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 5777213, "likes": {"liked": "— Location", "disliked": "— Staff"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Okay...1st....We were guaranteed an early check-in because our flight arrived at 10:30 am...That didn't happen until about 3: 30 pm.....Then they put us on a side where all construction was going on.....The bellman advised us that we might hear some noise...I am an early riser especially when I am vacationing, but if I wanted to sleep 1 morning, I didn't want to hear construction going on....(That was for room # 1)...(Room # 2)....At about 4:15 pm, they switched us to the other side of the hotel which was fine...needless to say the room had an aroma of good provolone cheese(the taste is good but smells rotten...lol)..Housekeeping said they would spray the room, but that wouldn't work being that I had a 9 yr old with bad allergies and asthma with us....(Room # 3)....Roughly Roughly 4:45 pm....We were exhausted from being at the airport from 4:30 am...a nap would have been nice...That didn't happen either....We were told to wait in the room until they found another...(Room # 4).......Finally, after I was complaining and very irate...They gave me an upgrade free of charge...The room was very nice, no smell, and there was room to walk around...So bottom line is that they did do the right thing, but over all I wouldn't recommend the hotel....Eating is off the wall...A breakfast buffet is $21 pp, beer by poolside is between $5 & $7 per beer, frozen drinks are about $8 with barely a taste of rum...I haven't been in PR in about 10-11 years and now I figured out the reason...I don't see myself going back anytime soon.", "title": "A Bad Start to a Good Ending", "helpfulness": 1, "user": "TwistedInNYC", "date": "August 31, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "rooms": 5.0, "location": 3.0}, "id": 5731556, "likes": {"liked": "— Our room turned out to be nice finally", "disliked": "— the pool was a mess...not very clean...always leaves"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Regards,", "title": "Reformed Opinion!", "user": "Isis10", "date": "August 28, 2006", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5715465, "likes": {"liked": "— my view!", "disliked": "— cost of parking, the food"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Twisted IN NYC", "title": "Fantastic Experience-don't let these bad reviews ruin your vacation!", "helpfulness": 1, "user": "shlee10", "date": "August 25, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5709860, "likes": {"liked": "— location, pools, grounds", "disliked": "— needs updating"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "As the title states, it was an overall good stay. I stayed in the Condado Plaza on Memorial Day Weekend. Just to state the facts, I am a very well travelled individual and rarely complain to management (I just don't go the place anymore), I was also most of the time out and about. Also, Hillary Clinton was staying in this hotel on that weekend, so there was a lot of security around. Stayed a(group of 5) on the main ocean tower on a (2) city view room.", "title": "Overall good with minor cosmetic flaws", "helpfulness": 1, "user": "DavidMiami_FL", "date": "June 26, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 4.0, "location": 5.0, "value": 4.0, "rooms": 2.0}, "id": 17259929, "likes": {"liked": "— Location and View", "disliked": "— Room issues"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Pros:", "title": "Good Hotel and Good Location", "user": "PBLiving", "date": "June 26, 2008", "detail_rating": {"front_desk": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 17255745, "likes": {"liked": "— Location and Modern Rooms", "disliked": "— Check In and Drink Prices"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "1. Beautiful Hotel, newly remodeled rooms with all the amenities.", "title": "Luxurious and Beautiful Hotel", "user": "BonitaRebel", "date": "June 11, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 16850614, "likes": {"liked": "— The sea water pool.", "disliked": "— The elevators were slow."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "2. Lobby very contemporary, and grounds impeccable. No complaints, except elevators were too tiny for such big buildings (2 towers), therefore were slow or were packed and had to wait two or three times for it (if there's space go in, even if it's going up).", "title": "This hotel definitely exceeded my expectations", "user": "USFGIRL", "date": "June 10, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16830558, "likes": {"liked": "— the room", "disliked": "— bathroom sink"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "3. Great big bathrooms, although there were no doors to close (sideways, gap between door and wall). So, technically anyone could see through the double door. No problem in our case.", "title": "Great Hotel", "user": "ryuenau", "date": "May 28, 2008", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 16451544, "likes": {"liked": "— Great Food and Pool Area, trendy and great atmosphere", "disliked": "— Long check in line"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The rooms were great with a great view. They were very stylish and clean. Stupid, but the shampoo and conditioner were actually something I liked using. The staff was helpful and pleasant. The bars, pools, restaurants were good. Be warned the prices were off the chart... I recommend going into Old San Juan to eat or drink anything. The Condado is right on the buss line to Old San Juan. The casino was not crowded and you could always get a machine or a table. The bar was was hip and had a young and beautiful crowd. There were always chairs and space around the pool. The price for our stay was very reasonable; we paid about $111 a night after getting the 4th night free I plan to return.", "title": "Beautiful and Convenient", "user": "coethiel", "date": "September 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 19624234, "likes": {"liked": "— Location and", "disliked": "— Price of food and drinks"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Let me start by saying it is a beautiful resort on a wonderous island. However, when we got there we noticed quite a few things. The check in was obscenely long. When we finally got to the room which as supposed to be the family suite we were literally on top of eachother it was so small. This was reluctantly remedied by Henry, the manger on duty the next day. I was then given a key to a room that was not programed to my new room. There were insufficient supplies in the room for it being a family suite and all. The hotel employees, with the exception of Sammy at the AquaGrill lack customer service skills something terrible. My rental car was damaged in the underground hotel parking lot where there are no security cameras. My thought was that someone had to have been inebriated and backed in to it without a care in the world. There are hidden costs for everything. Although you pay a resort tax this doesn't include use of the tennis court without an additional fee nor does it include the $5 pp/per night, regardless of age, room fee to name few. We never mind spending the money. After all, we are on vacation. It's when it is by surprise and with an attitude that even us NY'ers wouldn't dream of excercising that it becomes discouraging.", "title": "Not all it's cracked up to be", "helpfulness": 1, "user": "kathymtiru", "date": "August 29, 2008", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 19503339, "likes": {"liked": "— The terrace", "disliked": "— Customer service and all that implies"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Rooms, lobby and hotel were attractive, but we had several problems, such as our room not being ready for an hour and a half past check-in time. Also, our balcony had a huge electric cable swinging free across one corner of it which didn't exactly make for a pristine ocean view. Both of the bathroom's electrical outlets did not work, so I had to dry my hair in the bedroom, plus the shower exuded a strong septic smell every time it was used. The final straw, though, was the horribly leaky shower that released a stream of water across the bathroom floor each time one of us showered. This leak caused my husband to fall, which then led to us changing rooms. Good points: the pool, overall cleanliness, and the pool bar.", "title": "A Bit Overrated.", "user": "Mmerose", "date": "August 27, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 19444067}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Ok so i booked using the hotel website and my plane tix by jetblue.....the decor of the hotel is very nice and modern which i loved. Carol at the front desk was a complete ditz! she didnt help at all. Henry at concierge desk was the best!!! so was yaritza!!! the beach is very small but it was ok for me. very clean considering the locals can use the same beach. PR in general is clean. we went out to Old San Juan and rite down the street in a ocean view small restraunt and ate as the hotel was expensive. we did use our 50 credit promotion and ate at the strip house. the food is VERY expensive but soooooooooooo good....we had steak and it was fabulous and so was the desert!! at night the lobby lounge was fun. my only complaint was that PR has lots of mosquitos so bring off!!!!!!!! i left PR and im home and i still feel itchy!!!!!!!!! this is a reason why i may not go back to PR in general.....we rented a car for 50.00 with tax and insurance a day and drove to El Yunque ourselves which the hotel provided charlies rental car and provided great directions!!! so dont do the rainforest excursion when u ccan do it urself for cheaper!!! overall it was a relaxing, great experience and i do recommend el condado!!!! go to isla verde and see how nice the beach is!!!", "title": "Pretty Good", "user": "babiexoxo", "date": "August 27, 2008", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 19430559, "likes": {"liked": "— our room", "disliked": "— the mosquitos"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "The Italian restaurant, Gusto di Italia, was very reasonable & good for a hotel restaurant. They serve breakfast, lunch, and dinner. The service is friendly and the view of the ocean makes dining there very pleasant. The other restaurant, Strips, is VERY over-priced. Around $37 for just a steak and $10 for a baked potato. You'd have to be crazy to eat there!", "title": "Very Accomadating", "user": "nycvegas", "date": "August 3, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 18574452, "likes": {"liked": "— location", "disliked": "— nothing"}}, {"rating": 5.0, "title": "Fantastic Stay!!", "text": "Down the block are other dining options. La Hacienda is OK for breakfast. Ropa Vieja was very good 2 1/2 years ago, but we didn't enjoy our dinner this time. The prices have gone up, the portions are very small and the service is indifferent. Surprisingly, it's a very popular place. Forget Chili's across the street. It's very noisy, crowded, and pedestrian, Ajili Mojili is good if you like Puerto Rican food.", "user": "travelbug323", "date": "July 30, 2008", "id": 18421186}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Spent 4 days from 7/25-29 and had a great time. Beach and pool area are very clean. There's a chinese restaurants on first floor that serves great food. The restaurants around the area are good, theres a Chili's down the block. But beware that there are many taxes that inflate your bill. There was an issue with the on site laundry room. Several washers and dryer were off line. When front desk staff (Yaritza) was informed they resolved issues by having my wet clothes dryed,pressed and boxed free of charge. Thank you. I had an awesome time and would return with out hesitation.", "title": "Wonderful stay, wonderful staff", "helpfulness": 1, "user": "sparky5715", "date": "July 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18420804, "likes": {"liked": "— Interior design", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We had an excellent experience at the Condado Plaza. Our room was in the Ocean Tower. The roop was very well decorated, modern art deco. The bathroom was very large and spacious. Casino was lots of fun. Staff was great! Had breakfast once in the hotel; it was decent. The pool and small beach area was a lot of fun. I especially enjoyed the bar/lounge in the evening. IT was a nice atmosphere with DJ playing music. Had a fantastic experience and will definitely return.", "title": "ALWAYS AWESOME", "user": "VirginIslander", "date": "July 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 18394025}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Nicely renovated hotel, three great pools to choose from. My tip would be to check the hotel sites specials, we were American Express cardholders so we got a free upgrade, 75$ resort credit, & complimentary bottle of wine. I would recommend a little restaurant right down the street called Hacienda, we got breakfast there almost every morning for like 7 bucks a person & it was really good food with an excellent view!", "title": "Definately Recommend", "helpfulness": 2, "user": "ATC08", "date": "May 9, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 15864508}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "I was a little hesitant about the hotel after reading several reviews but decided it was only 1 night pre-cruise. I'm happy to report that I found this hotel to be a first class establishment. We checked in the middle of the afternoon and so my request for an upgrade was no problem. Instead of a city view we were oceanfront. The staff at the front desk were always very nice and helpful. Our room was spacious, very modern with a huge bathroom all recently renovated. The pool area was beautiful and large enough that it didn't feel crowded..This was a great way to begin our vacation.", "title": "Condado Plaza is fabulous", "helpfulness": 1, "user": "Cruisecrazy_8", "date": "May 9, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 15827292, "likes": {"liked": "— The overall atmosphere."}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "Just came back from this vacation wishing that the service of this hotel would've been as nice at the grounds. I have to say that i was impressed with the change of this hotel. It is absolutely beautiful. The problems start when you do your check in. We had booked a room for 5 days, when we got there they had it for 3. When my husband asked to get the 2 extra days he mentioned the special that they had, stay 4 nights and the 5th one is free, the girl said that we cannot have it because our reservation was for 3 days. My husband explained to her again that we wanted to stay 5 days not 3 and that we like to get the special but the girl at front desk didn't even tried to get the special she just said no that we can't have it.", "title": "Goos looking place, terrible service!", "helpfulness": 1, "user": "AivinM", "date": "May 7, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 15778691}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Got to the room and it was comfortable and well decorated. We had what they called a family suite. Two twin beds for the kids, separated from our side of the bed room. Also we had the coffee machine and the microwave. Everything was nice and clean.", "title": "Very nice hotel, but unattractive room", "user": "izabela_77", "date": "May 6, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 2.0}, "id": 15734601, "likes": {"liked": "— Pool", "disliked": "— Room"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "The pool on the Ocean tower is really nice and has a cool slide that kids and adults enjoy.", "title": "Joey, Another Teq-ini Please", "user": "megalicious22", "date": "May 6, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15731998, "likes": {"liked": "— Pool", "disliked": "— Roof top view"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The best thing that could have happened to us was that our originally booked hotel, At Wind Chimes Inn, lost our reservation and so we ended up at this wonderful hotel. Yes, it was much more expensive and we spent way more than we had planned on, but it was worth every penny. This place is amazing and the service was fantastic. We were upgraded to an ocean view room, which was just beautiful and had an awesome view. The bathroom was enormous, and yes, contained the closet, the minibar, and the coffee maker. However, it’s laid out in such a way that it does not seem odd. The room, as well as the hotel itself is very minimalist and modern with a definite South Beach feel. If you’re looking for that tropical, Caribbean look this is not it.", "title": "Unexpected but Terrific Stay", "helpfulness": 2, "user": "travelerNewYork", "date": "February 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13673224, "likes": {"liked": "— service, room, pool scene, convenient location to everything", "disliked": "— the hefty resort fee and resort tax (over 75 dollars a day)"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The pools are terrific with great service from the pool bar/restaurant, the Aqua Grill. The drinks are good, albeit expensive, and the food is perfect for lunch with sandwiches and salads. The shrimp brochettes with avocado were to die for. The pool bar is also a nice place to have a couple of drinks at night before heading out to dinner, or for a more trendy feel, try the lobby bar or the bar at the Strip House. All have wonderful service.", "title": "Great Hotel, Nice Location, Good Food, Fabulous Pool", "helpfulness": 1, "user": "danielleinqueens", "date": "February 18, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "location": 4.0}, "id": 13664152, "likes": {"liked": "— our room and the pool", "disliked": "— nothing really,except they shld play some cool music at the pool. I was advised to turn off my ipod stereo"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "My fiancé and I visited the Conrad San Juan on Feb 12-14 for Valentine’s day weekend and we could not have been more pleased with the facility and the service, especially in light of the lower then stellar Trip Advisor rating of #7 (although it appears the vast majority of the negative reviews which have brought the rating down were posted prior to the renovation which is unfortunate as it clearly should be much higher). I would agree with others in that this is no higher than a 4.0 star hotel as indicated by the Trip Advisor rating. Many of the weekend guests are 1-night only cruise goers departing the next day (either Sat or Sun) so there’s no real time to fix an issue that someone might have with their room. The Conrad was booked to capacity for the weekend as were other 3 and 4 star hotels which range from $200-$350/night.", "title": "A wonderful hotel! Would gladly return again!", "helpfulness": 4, "user": "jd50005", "date": "February 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56382485}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "I am a Hilton Honors member, so generally stay at Hampton Inns and Homewood Suites on business and then use my points for either Embassy Suites or Doubletree hotels along the Florida east coast a couple times a year. We wanted to get away for a long weekend although only just planned it a week in advance and decided to travel to San Juan. The Doubletree was my first choice as it was rated #2 on Trip Advisor, although when I learned they don’t have balconies (a must for my fiancé) I looked elsewhere. The two Caribe Hilton’s and the Conrad all have balconies but were completely booked so I waited another day and the Conrad opened up. I was a little concerned by the recent negative posts, and so as he suggests, I contacted Jose Padin (Dir of Ops) and he said that any issues noted in past reviews had been resolved and that we should contact him directly on his mobile if we had any problems during our stay so I booked our weekend at the Conrad with full expectation of being satisfied with the decision, and in the end, we clearly were as I had no reason to call him, other than to say thank you!", "title": "Wish we could have stayed longer", "user": "screenname000", "date": "February 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 56366581}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "One of the “10 ways you know you’re in Puerto Rico” is that everyone claps upon the plane touching down at the airport so don’t be surprised when that happens.", "title": "hotel is lovely;service is outstanding", "user": "1037wolf", "date": "February 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 56166438}, {"rating": 2.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "As this was our first visit to Puerto Rico and I only had the Trip Advisor posts to go on, I wanted to provide a more detailed review of the hotel and area to help others and so did a little more walking around then I perhaps normally would have at a hotel.", "title": "Not up to Conrad standards", "helpfulness": 3, "user": "nikki721", "date": "February 15, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 1.0, "location": 3.0}, "id": 56087643}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "Timezone - Puerto Rico is on Atlantic Standard Time (AST) and does not employ daylight savings time so from May-Oct is on the same time as the east coast, and 1 hour ahead from Nov-April.", "title": "Modern with easy access to old San Juan", "helpfulness": 1, "user": "annberg1969", "date": "February 15, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 56068848}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We stood at the Condado 3 years ago, and decided to go back. The hotel is newly redone, and quite beautiful. We like the fact that it is in the city and we can try all the wonderful restaurants nearby. The rooms are all redone and very clean. I don't however like the fact that the refrigator and coffee maker are in the bathroom. The bathroom is very large and spotless! The bathroom doors need LOCKS, (no locks on the doors). The beach is very, very small, that is the biggest downfall for this hotel, you have no privacy at all. The lagoon is wonderful if you don't like waves, and also clean. The staff is very friendly and helpful, we would stay here again!", "title": "Very much improved from 3 years ago!", "helpfulness": 4, "user": "richmarl10", "date": "January 30, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 13130456, "likes": {"liked": "— The newly spotless rooms", "disliked": "— The tiny beach on the main road"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We arrived on New Years Day in the evening. We left our cab and walked into an empty lobby. We were told to take the elevator, walk past the casino, over a skywalk to the other building where we were told we would find the hotel's desk. The desk turned out to be a banquet table in a hall. It was not an aspicious start. Once we checked in, we were assigned a room and had to walk back over the skywalk, past the casino to the elevator, hauling our carry-ons and coats. My husband says you only have one chance to make a good impression and this hotel blew it! We had a remodeled room, one with the closet in the bathroom, which seemed unusual. Our room itself was beautiful with a great view. But putting one's clothes in the same area as the shower seems very odd. We ate at the sushi bar and at the Italian cafe and were pleased with the food and service. After the first evening we rarely saw people in the halls or cafes. It was difficult to feel that we were at a nice resort -- there was absolutley no resort feel to the place. Walking time and again into the empty first floor lobby was just not pleasant! Our major gripe was with the Concierge. We called and asked for restaurant recommendations. We were told that ____ (home of the Pina Colada) was great! We went and were served food which appeared to us to have been cooked much earlier in the day. The next day we called the Concierge again and asked for further recommendations. We were given the name of the same place. Trying to get something different we asked the Concierge for another suggestion. We were told she was busy at the moment and would call us back. She never did, although we waited. So, we went to Marmalade in Old Town San Juan and were delighted. The call back from the Concierge never came, but we didn't care. We went to Marmalade the next night too! All in all, I didn't think that this hotel gives good value for the money. And this is the first time I have ever given a hotel a less than glowing recommendation on this forum.", "title": "A Mixed Reaction", "helpfulness": 6, "user": "sleds", "date": "January 27, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 5.0, "location": 3.0}, "id": 13048696, "likes": {"liked": "— View from our room", "disliked": "— Concierge was not helpful and didn't call back when she said she would."}}, {"rating": 3.0, "title": "Relaxing vacation", "text": "Stayed at this hotel for a week in January, and although the first day wasn't great, the remainder of our stay went well. When we checked in we were given a room with a broken balcony door; when I called I was offered to have maintenance come and \"take a look\" at it. I told them to provide me with another room and then they can send a maintenace person to fix that room, as I am not on vacation to sit and wait for a door to be fixed.", "helpfulness": 4, "user": "luv2fly123", "date": "January 26, 2008", "id": 13014216}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "Wow.... what a difference a few years make. This place is outstanding. The renovation is spectacular and very chic. From the lobby, to the rooms, to the restaraunts, to the pools, and outside grounds, this place sparkles!", "title": "Awesome!!! Totally renovated, rejuvenated & ready for you!!!", "helpfulness": 1, "user": "bostonlady1961", "date": "March 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14115756, "likes": {"liked": "— Great atmosphere and helpfull staff!", "disliked": "— Having to leave to go to La Concha Resort."}}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled solo", "text": "I was traveling with my 2 teens and they were also taken back by the change in the whole atmosphere of this resort. It was cool and chic and everything was new.", "title": "Mixed Thoughts", "user": "BXTRAVELER1", "date": "March 5, 2008", "detail_rating": {"front_desk": 2.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "location": 5.0}, "id": 14075134, "likes": {"liked": "— location/pool", "disliked": "— beach"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "We stayed here on 2/14/08 for one night, and then moved over to the La Concha for 5 nights, and what a mistake that was. I regret not booking my whole stay at Condado Plaza.", "title": "Perhaps things are better now...", "user": "Banks3", "date": "March 2, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 13998605, "likes": {"liked": "— The view"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2006, traveled as a couple", "text": "Checking in was a breeze we immediately changed into our bathing suits to check out the pools. We stayed in the ocean side building and there were 2 pools, one even had salt water, which is more enjoyable than chlorine. The pool area is unbelievable, the young man got our towels and our chairs ready, for a moment I almost thought I was staying at the Ritz. There is great kids water slide and a nice swim up bar in one pool. There are a few private secluded areas that looked very romantic, and there was a tent set up for massages by the sea. Although the beach is public, there was security and it was safe. One of the greatest things to do is to grab one of the many hammocks and just relax under the palm trees.", "title": "Would definitely stay there again", "helpfulness": 1, "user": "natron06", "date": "February 29, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 13947498}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "The view from the room was really breathtaking and the sounds of the crashing waves against the sea wall were so soothing. Everything was new and in working order in the room, and the bathroom was huge and had plenty of storage for clothes. The towels were thick and soft and the bathroom supplies were plentiful. Two people could easily be in there at a time with plenty of room leftover, compared to La Concha where the door almost hits your knees when sitting down.", "title": "Excellent service", "helpfulness": 1, "user": "ItalianTravelerLargo", "date": "February 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 13898568}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "I was given another room right away. Upon entering the new room, I went onto the balcony to see the view, only to find that my \"city view\" room was a view of a building next door under construction with a man hanging on a rope painting, and dirt splattered all over the balcony . In addition, there were only 3 tiny drawers to unpack clothing etc. , and they were located in the bathroom as was the mini fridge and coffee maker! Yes, you read right! The bathroom and closet and mini fridge are all in 1 room behind a sliding door. (I can't imagine why one would need to have their shower/toilet in the same vicinity as their coffee maker and clothing?)", "title": "Outstanding Service, Beautifully Renovated Hotel", "helpfulness": 3, "user": "FL_foodie", "date": "January 25, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 12979608, "likes": {"liked": "— the service", "disliked": "— noise from hallway and adjoining room"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2004, traveled as a couple", "text": "I placed another call to the front desk and was told there weren't any other rooms available . I asked to speak to the manager and the manager told me the same, she said that she would call me back later in the day if anything came up. I waited for her call and got no call.", "title": "Lively fun on the strip", "helpfulness": 1, "user": "olde_tyme_style", "date": "January 24, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 12964635, "likes": {"liked": "— The excitement surrounding the hotel itself, the entire area, how much there was to do"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "As most my reviews involve long term stays this hotel is like the other \"resorts\" in San Juan Puerto Rico: nice for a day or so which should suit the tourists escaping from colder climates and throwing money around but not the greatest for a long term stay. But Conrad does deserve some credit and I'll give it some now. The pool/beach area is nice. Multiple pools, jacuzzis, swim up bar, restaurant, hammocks, beach, all along the ocean front. Food/drink wise, like all the other nearby hotels, food and drinks are pricey. Order a few beers at a bar or restaurant with a friend and you'll have a decent tab running pretty quickly. Now lets talk food. The Conrad has three or four restaurants. One a bit upper scale but the others somewhat more reasonable with one exception. The upper scale Piyako's is nice but its too pricey for the experience. Again if you are on a roll through money vacation it wont probably bother you. Another place to mention: their asian based restaurant: called Nine. But that's in name only. As it's not much of a restaurant if atmosphere matters to you. As Nine is simply a sushi like bar and a few tables with chairs alongside the hotel's entire casino. When you sit at Nine you share the ambiance of twenty to thirty slot machines and all the noise the comes from the casino. Nine is VERY expensive and an even worse a bad value. Its extremely overpriced for the quality and menu. Unless you like burning fifty dollar bills stay away from Nine. The only pleasure you may get from it is the smile of the 4-6 Chinese waitresses with the incredible tip you're going to pay her after you see your tab. There's much better options for Japanese food. One very close to the hotel.", "title": "A business traveler's review", "helpfulness": 1, "user": "Chase71", "date": "February 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 2.0}, "id": 56605658}, {"rating": 2.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "Back to the hotel. The rooms are nice. The nightly turn up service deserves praise if you don't mind your door being knocked on between 5-7PM. The room's FREE internet service is very good. The separate bathroom with the glass enclosed shower is a nice touch. Complaints: the air conditioning always made the room feel cold whenever it came on regardless of the setting. A c ouple of times over three weeks the faucet water in the room was brown and had a bad odor. I had to run the water for like 15 minutes to get clear water. No in room microwave was disappointing.", "title": "Don't stay here!", "helpfulness": 1, "user": "ConnieLongBeach", "date": "February 20, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 1.0}, "id": 56602181}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Lastly the location. On that side of Condado there's just not a lot of dining options. There is a Chilis and another higher end place next to it. A couple of beach front bar/restaurants and one other higher end place but the other side of Condado has much better options, I do not care to drive in San Juan. So walking distance places matter a lot to me after the rental car is parked for the day.", "title": "Puerto Rico is Breathtaking, Conrad Condado is Disappointing", "helpfulness": 2, "user": "RaeRae52", "date": "February 20, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 56594328}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "In summary the San Juan Conrad is a overall nice place. It has plenty of options and distractions for a short visit. It's business model plays upon tourists that want to have fun and not worry as much about their wallets as they enjoy themselves. But if I had to stay again I'd probably stay on the other side of Condado at the Marriott.", "title": "Great view; excellent staff", "helpfulness": 1, "user": "NC-travel19", "date": "February 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 56577887}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "My husband and I stayed at the Conrad after a caribbean cruise...Celebrity Summit...wonderful cruise and ship! We had to stay here for a meeting. I had read the reviews about the beach and pool but for us, those parts were just fine. There's a lovely grassy area with plenty of loungs and th esnorkeling off shore was pretty good. For us th eproblems were the food..it was dreadful! Ajili Moliji and Rpoa Viejo both a short walk were much better! The rooms are ok but the bathrooms are very, very tiny. The rugs byt he bed were old and full of stains. We stayed for 4 nites and evryday we were told there weren't any clean towels in the afternoon because they were all in the laundry...quite surprising for a hotel of this size. Also, they tack on a porterage fee if you are part of a group even if you don't arrive as a group so you end up tipping twice. The hotel is also lovated in a rather ugly part of town and there's absolutely no where to take a walk. We will never stay here again!", "title": "Kinda cool, smokers everywhere.", "user": "scooterfly", "date": "February 19, 2010", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 56529293}, {"rating": 2.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "This hotel is pretty nice from prospect of location. Yet for a reserved in advance $300/night ocean-view room they offered me a laguna-view room, which is cheaper on their own site. Then, after a fight with a manager, they offered a 2nd floor room with ocean-view. But the room was filthy with sperm-stains on a couch and suspicious debris on the floor. (see pics). After another heated argument with administration they changed room to a \"handicapped room\" with ocean view, but wi-fi didn't working there despite their promise that it is working. I had to go to my previous sperm-stained room and get a cord to connect computer. Room was clean this time, yet there is so many signs of fatigue in the bathroom, floors etc which should not be in a 5 star hotel. I will not stay there again.", "title": "Beautiful location but need remodeling", "helpfulness": 1, "user": "Dimka7", "date": "February 8, 2010", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 55434592}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "First of all the previous reviewer was very dramatic. What do you expect them to do change out a mattress in 24 hours..they probably didn't even notice until you pointed it out. And everyone has a bad day..don't blame the concierge for everything. Yes this hotel has a vibrant lobby, but I did not hear it from my room. And it is fun and convenient, you can get dressed up and go down for a couple drinks, then to the casino adjacent. This was a very modern, CLEAN hotel and very fun! I travel once a month, I work for an airline so I'm always somewhere, and this is one of the nicest hotels I have stayed in. Nice, modern, fresh lobby, has a very miami vibe. Great DJ on the weekends. The rooms are modern and clean, comfortable bed (definetly spring for the ocean front room..it makes all the difference!) The view can't be beat, and the waves crashing onto the rocks while you sleep is sure to slip you into a great calming dream :) The staff was totally nice and so helpful. Didn't have a problem with anyone and I stayed for 5 days. The facilities are very nice, great gym, two outdoor hot tubs, and big clean pools. It has a beach on the side which is also a public beach but very safe and clean. Small but lovely, it is on a lagoon which on sunny days is perfect for snorkeling! This is a great base for exploring the island or for before or after a cruise. I had a great time! I have also stayed at the Hilton Caribe across the way and I prefer this hotel.", "title": "Fabulous time, Fabulous Hotel!", "user": "DanyLizFrequentFlyer", "date": "February 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55216475}, {"rating": 1.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "I should have read the reviews here before I booked as there is a common theme regarding the cleanliness and lack of service. We arrived late and were told on check in that our ocean front room booked 2 months before was not available. We were put in a room off in a wing that was not connected to the main part of the hotel. The room was unclean and adjoined another room which was something we specifically asked not to happen. Again we were told that there were no other rooms available until the next day. We were exhausted and just wanted our bags from the concierge. We waited 2 hours for our bags and every time we called to complain we were told they were on the way. Once we had our bags we got ready for bed. Upon pulling the covers back we discovered that they had made the bed with fresh sheets over top of a dirty mattress cover. The cover had a big puddle of mentsrual blood on it from a previous guest. DISGUSTING!", "title": "Horrifying- Blood stains in the bed.....seriously.", "user": "traveljunkie89", "date": "February 4, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 55141914}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "The more revolting part is that when we called to complain to the manager he didn't care and complained that is was 3am and what did we expect him to do at that hour.", "title": "Great hotel, certainly does not deserve the negative reviews. One of the best in Puerto Rico.", "helpfulness": 2, "user": "original_roadwarrior", "date": "January 31, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 54872613}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "The worst experience we have ever had, 3rd world countries have better hotels than this.", "title": "Great place to stay", "user": "Familyguy88", "date": "January 30, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 54757515}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "We were coming back from a cruise on Saturday and our flight was cancelled due to weather. We decided to stay another night in Puerto Rico. Much better than getting stuck in Detroit! I went to Trip Advisor and found this hotel. It wasn't cheap but it was wonderful! The lobby and room were very well decorated. There was a great balcony. The beach and resort area was great. We went snorkeling right off the beach. The water was a little cloudy because the surf was high but we still saw hundreds of colorful fish. The beds were so comfortable I felt like I was drugged when I slept.", "title": "Fabulous!", "user": "jimmadson", "date": "February 15, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "rooms": 5.0}, "id": 56020191}, {"rating": 4.0, "stay_parameters": "Stayed February 2010", "text": "we arrived 11:00a.m.- the front desk greeted us with a welcome and immediatly gave us a key to our room- though check-in was hours away. We opened the door to a room tht looked exactly as it does on the website. The bed was the most comfortable hotel bed I have EVER slept in! The staff was exceptional! ex: Carlos from housekeeping- day 1 I went to a cart outside my room to ask if I could have a few more coffee packets- he gave them to me with a smile- instead of acting like I was keeping him from doing his job- the next day I went to a cart outside my room -again it was Carlos, he smiled and said \"coffee- regular not decaf, right?\" he remembered what I wanted and that detail made me feel very welcomed and at home. another example - Michelle, our poolside server, was very accommodationg- to us, and those seated at the pool around us- we ordered breakfast poolside- one morning it must have been 11:30 by the time we ordered and instead of saying \"no\" and handing us the lunch menu in her hand- she went back to the kitchen to get us the breakfast menu and check with the kitchen to see if it was o.k. to order breakfast. It was! We were there Superbowl Sunday and the hotel went to great lengths to make it special- they set up big screens in the main lobby lounge, the poolside restaurant and one in the back of Varita restaurant- we chose the lobby - it was sponsored by Rums of Puerto Rico and there were raffle tickets if purchasing discounted rum drinks. Many peope won t-shirts, Rum, travel mugs and gift basket- it was fun and festive! I really enjoyed my stay thanks to the customer service skills of the management and staff. I own a small Boutique on the CT shore and people come in this time of year looking for resort wear- when we share Caribbean destination stories- I will recommend Condado Plaza for service and value. I plan to make this long weekend and annual event. I do have one negative about my stay which the hotel has no control over- except the impression on its visitors- we walked Ashford Avenue the first afternoon- leaving the lobby the first thing we saw was the abandoned, graffittied, crumbling building next door, it made me sick to see such a sight- so sad in fact we turned around and went right back to the hotel. A special Thanks to Carlos from housekeeping and Michelle from poolside restaurant.", "title": "customer service A+", "user": "weekendgetaway13", "date": "February 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 55833953}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "My husband and I stayed here a night after a cruise. I was not not overly impressed with this hotel. We had a bay view room, which was adequate. Just to clarify, the hotel has 2 towers on opposite sides of the street. The tower on the bayside seems to be used for conventions. The bed was comfortable and the bathroom was large. The pool area needs refurbished. There are 2 pools, the nicer of the 2 is the \"party\" pool and not very relaxing. The lobby is very modern and appears to be well kept. Marisol, at the concierge desk, was very helpful. She helped us pick the perfect restaurant for our friend's b-day (Marmalade in Old San Juan). I would stay here again if just for one night, but not an extended stay.", "title": "Just okay", "helpfulness": 1, "user": "CamiOhio", "date": "February 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 1.0}, "id": 55804320}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "When first entering the hotel its look is very modern and bright. The staff was very friendly throughout our stay. We never had any problems with our room or service at all. My fiance and I thought the shower and bed were the best amenities at the hotel. One thing I was slightly disappointed with was the size of the beach. They don't really show you how small it is online but it was never a problem. Whenever we were there it was not crowded and the water was great. The staff was very helpful and accommodating. I thought it a little rude to require hotel guests to pay $11 to rent a umbrella on the beach but there were plenty of shaded areas around.", "title": "The bed and view was fantastic!", "user": "BRWare", "date": "February 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 55579283}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "I read alot of reviews before I booked this trip and the one thing I can definitely agree on is the high price of dining at the hotel. We didnt count on was how expensive it would be to eat everywhere. Whether in Old San Juan or at the hotel, the prices were all very comparable. It just depends on what you have a taste for.", "title": "A Decent Hotel....but not the best in PR", "user": "owenluke", "date": "February 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 55470102}], "location": {"country": "Caribbean", "city": "San Juan"}, "stars": 4, "variance": {"poor": 238, "average": 443, "very good": 771, "terrible": 176, "excellent": 580}, "aka": "Conrad San Juan Condado Plaza Hotel San Juan", "slim_ranking": 0.404255319149, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "The Condado Plaza Hilton, the only luxury hotel overlooking both the Atlantic Ocean and Condado Lagoon, is an enchanting alternative to typical San Juan hotels. Our unique location boasts cool ocean breezes, breathtaking sunsets, and a shimmering, protected beach. Whether you're traveling for work or play, this sparkling hotel offers it all, superb dining options including the award-wining Pikayo restaurant, elegant event venues, three glistening pools, water slide, a 24-hour casino, waterports, 24-hour fitness center, tennis, poolside massage and a bubbling nightlife."}