{"user_rating": 4.5, "review_count": 111, "name": "The Colonies at Williamsburg", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "The Colonies is a great place to stay in Williamsburg. We had a two bedroom, two bathroom suite with full kitchen/dining room. It was modern, clean, well appointed and provided everything a family of four could need, even a washer/dryer, laundry basket and detergent. The shower in the master bedroom could have probably held five people easily. The outdoor pool with a slide and lazy river were a lot of fun for our kids, although it was a bit cold in September to really use. The indoor pool made up for that. This is a timeshare with the typical sales pitch to buy but it was low pressure. We sat through it and got a free breakfast at the Astronomical Pancake House for our whole family (the food was very good by the way) and free adult tickets to Busch Gardens (tons of fun and things to do even for toddlers), so it was worth the time spent. The Colonies' proximity to everything (Colonial Williamsburg, Jamestown, Yorktown, Busch Gardens, premium outlets, bounce house, bowling, and TONS of restaurants) made it ideal for our family. They organize group activities too, like a bus trip to Washington DC. We were busy with our own itinerary so we did not partake, but appreciated what they organized daily. By going off-season in Sept., the Colonies was not crowded nor were the attractions. They are adding more buildings so there is construction on site, but we never really heard it so it was not bothersome. We will definitely stay here again.", "title": "The place to stay in Williamsburg", "user": "Czar4", "date": "September 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 178082168}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We were given a 3 day 2 night pass as a promotion, and I have to say this place was GREAT! The staff was friendly, and the rooms were fantastic! It is set up like townhouse apartments, ours was a 2 bedroom 2 bath unit. The master bath has a great jacuzzi tub. It also has a dining area, fully stocked kitchen (down to paper towels and a water pitcher in the fridge) that even has dishwasher and disposal, living room with fireplace, and little porch in the back. There were 3 TV in the unit, one in the living room and one in each bedroom and they all had DVD players attached (with free movies for checkout in the clubhouse). Only downside was WIFI wasn't free in the rooms, you have to pay a fee for a password, however there are 3 computers and a printer available in the clubhoue for no additional charge. All in all HIGHLY recommended.", "title": "Great place to stay!", "helpfulness": 1, "user": "cdeavers2013", "date": "September 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177392160}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "My family and I spent the night at the Colonies at Williamsburg and didn't want to leave. The property was beautiful. It has two huge pools, a game room for the kids and beautiful walking/jogging trails. It's located near Premium Outlet, so that was a plus. There's so much to do in Williamsburg and this property is located near everything.", "title": "Beautiful property!", "helpfulness": 1, "user": "Mamasita317", "date": "September 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176537374}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "Just came back and sad to be home. This place was great. The rooms are very clean and spacious. The kitchen had everything you would need. Very well stocked. The outdoor pool and kids pool slide and play area was great. My 3 year old had a great time. Stores are all very close by including the supermarket. Cooking is great saves money. We went to Busch Gardens which was only 20min or less away expensive be prepared but was worth it. My stay was amazing love love this place, and will return ASAP.", "title": "Amazing", "user": "Elizabeth F", "date": "September 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 175891567}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "We LOVE the Colonies, we love it so much we have stayed here 3 times and are looking to go again very soon. The accomadations are new, so all of the furniture and ammenites are in great condition and are comfortable. We have stayed here in the Fall/Oct twice and once in the Summer. The outdoor pool was being built the very first trip so our unit (23A) faced the soon to be club house but we never were distrubed by construction. All is finished now and what an AWESOME pool. Has 2 slides, a lazy river, lap pool, kids area and out door hot tub. The indoor pool is cool as well but very high on the clorine. This resort doesn't offer much in the way of activities, but we travel here to spend time with relatives and go to Busch Gardens and the Outlets. You are 3 minutes from the outlets, groccery store, 7-11 and gas stations, plenty of dining options and the full kitchens help us save money by being able to bring grocceries for part of the week. They offer coffee and some pastries in the clubhouse every morning for free, which is nice, free wifi that is easy to use and the bathrooms are enormous. The 2nd bath is bigger than my son's bedroom at home. Plenty of room for 4 adults and a child, with a pull out sofa and the 2 bedrooms (you can rent a 4 bedroom which is really just 2 units you get both the A & B) If you want to be near the club house then request units 1-40 (have stayed in 6A, 23 A, and 38B) A's are downstars, b's are upstairs. Very clean and lovely!", "title": "The Colonies is the BEST", "helpfulness": 1, "user": "C D", "date": "September 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175442304}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We stayed in July 2013 at The Colonies at Williamsburg. The place is very clean and spacious, but we went to have a nice vacation and ended up with a big dent to our minivan. Some one hit our van while it was in the parking space in the property and left without calling about it. But there was a lady who saw the accident and went to the front disk to report it. when we saw our minivan we called the security guard who called the office and one of the manager came to the scene and told us about the lady who saw the accident, and when we went to report it to the office (front disk), they acted like they did not know anything about it. They were not cooperative in trying to find out who hit our van, there is no security cameras. They did not offer any type of compensations or accommodations. we're back with a very badly dented vehicle. Not happy at all with that, and they do not want to take care of that. Their manager said consider like it was a hit in a mall or a grocery store parking lot, can you believe that!!!!!!!!!!!!!!!!!!!!", "title": "Bad Managment", "helpfulness": 1, "user": "ydemian", "date": "August 16, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172515851}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We recently stayed that The Colonies at Williamsburg. The units were clean, nicely furnished and spacious. The resort is new and there is some construction , but we were not disturbed by it. The staff was friendly. Upon arrival we were pressured a bit to attend a free lunch with gifts to give our feedback about the resort. We declined to do so and the person at the front desk was not pleased. We were not approached at any other time which was great. Overall we really enjoyed our time there and would go back.", "title": "Great place for families", "helpfulness": 1, "user": "Nancy6049", "date": "August 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172433479}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "This was one of the nicest places I have stayed room wise. I stayed in a 2BR upstairs unit 8A. The master bathroom is amazing with a huge shower. The rooms are Clean modern and spacious. The grounds are very nice not much scenery. The outdoor pool area is really nice and great fun for the kids. The indoor pool is also really nice. They have good daily activities for the kids and a nice little game room. They also have a really nice tennis court and a few other outdoor activities. Its around the corner from RT.60 which has a ton of restaurants and pancake houses lol. Virginia is the capital of pancake houses. There are some other things to do near the resort minigolf, bowling alley etc. It is also very easy easy to get to busch gardens and water country usa from here its a 12 min. drive. I went from august 2-9 and even though the resort was booked up it was not crowded at all near the pools and activity areas. I will definetly stay here again. BTW if your an owner at another timeshare dont do the 45min survey even though they give you a free breakfast and a gift card. I really took 2 hours and there just trying to sell you a timeshare for the williamsburg plantation which is around the corner.", "title": "Awsome resort", "helpfulness": 1, "user": "sanmanreg", "date": "August 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172369711}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "Clean and updated rooms however, the porches are not screened in and I think that they should be. Beautiful grounds. Nice indoor and outdoor pools. Outdoor pool is cool as it has lots of pool games. Plenty of activities for the family. Convenient location to shopping area.", "title": "A lot of fun.", "helpfulness": 1, "user": "erickan_12", "date": "August 11, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 171718137}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "This is a beautiful property with spacious and high end furnishings. Plenty of room for everyone in the family. We stayed in a two bedroom unit and did not want to leave. The indoor and outdoor pool were well maintained and lots of fun with the slides and basketball hoops. There is even a snack bar at the pool!!! Nothing to complain about. Bonus is that the outlets are around the corner as well as many restaurants. We will return!!!", "title": "Beautiful property, spacious apartments, wonderful stay", "helpfulness": 2, "user": "krward4", "date": "August 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171276975}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "By all means the units are beautiful and very clean. Lg. space for a family of four. Kitchen was equipped with everything you may need. We actually cooked dinner one evening, just sick of going out to eat and it was very nice. Bedrooms and bathrooms were very clean and spacious.", "title": "Not Impressed...", "helpfulness": 2, "user": "RoadtripAlbany", "date": "September 2, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 175356812}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Ok, upon opening my blinds to view the outdoors from the deck we were in 125b our view was a rusty old trailer smack dab right in our back yard. That was my first turn off but ok they are doing some construction on some newer apts across the way so it was understandable. But everytime I opened my blinds I had to close them, just felt like someone could see in. Anyway, our first night was great. Second night I had to call the front desk because either another party left their teenagers to babysit the other five children in the apt because there was screaming and loud running and thumping upstairs at 1 am. I went back to sleep and our family was awakened again in the morning from the same thing.", "title": "Colonies at Williamsburg - meh", "helpfulness": 2, "user": "travelmom221", "date": "August 26, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 174206595}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "The next evening we went out for dinner and arriving home had no parking spot in the middle of a thunder storm. Personally I went to the front desk and they seemed to have their hands tied behind there backs...couldnt do anything about it just stated it was an issue and to park on the grass. Really? We are paying for our unit and every unit should have one parking spot. If there are cars with no parking permit or do not belong in that area they should be asked to move. They said they would call security but never did and we ended up parking on the grass. And the last but not least this one I will do for my daughter..there are huge spiders outside our front porch I mean huge and a lot of them. So be careful and walk in fast..yuk! They should really spray or clean up the front doors..anyway I believe this resort has some potential in success but..dont think I will stay again. The hospitality is very low..the lady at the front desk didnt even look up at me when I checked out and didnt even ask how everything was..The pools are very nice and the families seemed to be enjoying themselves..but I think there are better places in Williamsburg. :)", "title": "Amazing Stay for the Price with a large group", "helpfulness": 1, "user": "5WIRams", "date": "August 24, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 173792026}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Very spacious unit, lots of supplies for cooking and eating. Good location for outlet mall and Williamsburg. Clean, but the entry hallways to the apartments had a very strong scent of dog. Wet dog. Same odor observed in the closet of one of the bedrooms, where the vacuum cleaner was stored. Suspect a change of vacuum cleaner bag should be done. View off back deck ( we were in an upper unit) was of trees, and a broken down rusting double wide trailer observed through the trees. I would think this would be the prominent feature in the winter months. Foot high weeds growing in the gutters of the units. Workout facility sparse. There are better options in the area.", "title": "Great location for Busch Gardens/Colonial Williamsburg", "helpfulness": 1, "user": "havesuitcase", "date": "August 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173178354}, {"rating": 3.0, "stay_parameters": "Stayed July 2013", "text": "The room was amazing! With two bedrooms there was plenty of room for our party to spread out. With three TVs there was mo fighting over what to watch. The kitchen was well stocked and the money we saved by cooking was worth it. The kids loved the pool after a day of walking around. I would recommend staying here to anyone coming to Williamsberg.", "title": "Overall a nice stay", "helpfulness": 3, "user": "caribbean528", "date": "August 18, 2013", "detail_rating": {"cleanliness": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 172784800}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "We had the pleasure of joining our friends on their vacation to Williamsburg. All of the rooms at the Colonies are 2 bedrooms with 2 bathrooms. We stayed on Pennsylvania right next to the construction area. The majority of the construction was being done inside the new building so the noise was not a problem.", "title": "Loved our stay", "user": "CCCLady", "date": "October 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 180532618}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Everything in the unit seemed new. Since we were on the first floor, we had to share the washer and dryer. This was not a problem since the majority of the week no one was in the unit next to us plus we did not use the machines much. Our unit did not have a grill to use. Also, the grills for the units use charcoal. There was a large gas grill at the pool area.", "title": "Great Resort", "user": "Brenda L", "date": "October 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180265331}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Before going down, I called to get information about the resort. I spoke to Calvin who was extremely helpful and personable. Calvin advised me that the outside pool would be closed on Labor Day. We arrived the week after Labor Day and had a pleasant surprise since the outdoor pool was still open. Since the weather was in the 90s, they decided to keep the pool open for the week.", "title": "Great place to stay in Williamsburg", "helpfulness": 1, "user": "Dianne S", "date": "September 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178683926}, {"rating": 2.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "We did not join any of the scheduled events. We did see Karaoke by the pool one night. It did not seem too organized.", "title": "Poor service and only mediocre facilities", "helpfulness": 1, "user": "Jenn_on_the_coast", "date": "September 25, 2013", "detail_rating": {"value": 3.0, "service": 1.0}, "id": 178573441}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We have been to the Colonies for the last 3 years. There are 7 adults and 1 child, we get 2 rooms on the same floor. We leave our doors open accessing each others room while our floor is locked off from anyone else.The grounds are still under construction in a lot of the areas but the pool is for all ages. I enjoy being able to put my lounge chair in the pool. There is a basketball net in the pool and a great water slide for all ages. The staff is not always the friendlies but I have never been mistreated. There is a washer and dryer in every room (perfect for lighter packing). The rooms are beautiful and spacious. We absolutely love this resort. Every year we find new places to explore in the area.There is so much to do and see. If going to Busch Garden and Water Country USA they have a deal for 7 consecutive days for one low price (on line). You can hop from one park to the other on the same day and pay one price for parking. For those who like to shop the outlets are about 1mile away.", "title": "Good \"no frills\" resort", "helpfulness": 1, "user": "mcgeggy", "date": "September 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178492336}], "location": {"country": "United States", "city": "Williamsburg"}, "stars": 3, "variance": {"poor": 2, "average": 9, "very good": 28, "terrible": 1, "excellent": 71}, "slim_ranking": 0.125}