{"user_rating": 4.5, "review_count": 1171, "name": "The Greenbrier", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2012", "text": "We recently visited the Greenbriar for a second time. We had not been since it was saved from bankruptcy and many renovations were made. It remains an amazing and gorgeous setting. The rooms are plush and comfortable. The costs are crazy! A fountain coke was close to $4. Same for a bottle of soda at one of the many shops. Spa is fabulous but also very pricey. Moral of my review: go for the beauty of a truly lovely place but take your wallet because you will need it.", "title": "Step back in time but not in price", "helpfulness": 5, "user": "Robinson5366", "date": "November 9, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 144995664}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "This had to be one of the best, if not the best, experiences I'va had. The staff is top notch, personable and friendly and we were called by our names from the moment of arrival. We were treated like royalty. It was our anniversary and upon check-in, they had left us red roses, a card and a small box of delicious truffles. At dinner, they brought us a complimentary piece of chocolate cake, complete with candle), with Happy Anniversary hand written in chocolate on the plate. The tour of The Bunker is well worth the fee! Just a great experience!", "title": "First, but not last, overnight stay!", "helpfulness": 1, "user": "valerie H", "date": "November 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 144973767}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "went to the greenbrier resort on a 3 day 2 night golf package-played all three courses and they were all great-the jerry west restaurant (44 west) was terrific, although very pricey(think an upscale ruth chris')-the resort was class all the way.", "title": "what a resort", "user": "opie-bob", "date": "November 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 144966963}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "My wife and I took a long weekend for our \"babymoon\" this weekend and were blow away by The Greenbrier. It was a great southern retreat.", "title": "Top notch across the board", "user": "Andrew G", "date": "November 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144963058}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "We were greeted by a friendly and efficient valet who unloaded our bags. The check in was smooth and very quick (especially for a Friday) with an explanation of the hotel and activities. THe check out process was also quick and smooth. The bellman took us and our bags to our room and gave us some insightful advice and anecdotes along the way. We had an intermediate room (livingsocial deal) and it was VERY clean, large, had beautiful views and nice bathroom. I am very critical of room cleanliness and couldn't find anything wrong with this one. The rooms are designed to maintain their southern charm.", "title": "A Remarkable American Destination", "helpfulness": 1, "user": "John D", "date": "November 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144960606}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Went with a pal for a few days of r&r. arrived on the eve of the pres elections, and the resort -which is huge - was empty, as it was all week. no lines/no waiting anywhere. although flights were limited, it was easy to fly in/out of the nearby airport. maybe a 15 min drive to the hotel.", "title": "nice stay-fantastic service", "user": "Gatoresq", "date": "November 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145533924}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "chose this resort because it had tons of available outdoor activities. had an awesome time shooting at the beautiful gun club. did the sporting clays course. excellent instruction. challenging stations. off-road driving was cool too. horseback riding - not so much. took us for a short ride around the golf course. pretty, but we would've preferred heading back into the woods. bunker tour was cool, as was checking out the tons of historical stuff both on and surrounding the resort.", "title": "Must visit resort especially for kids", "helpfulness": 1, "user": "WTPR", "date": "November 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145187107}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "rooms were nice - large/clean/comfy beds. we stayed in the main bldg. if i go back with the fam, i'd try one of the the surrounding cottages, which looked nice.", "title": "You need to experience this resort at least once.", "helpfulness": 3, "user": "TKD26508", "date": "November 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 145103573}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "gym was ok - good enough for a decent workout. hit the spa after - also nice. good massage - awesome steam room. excellent facilities (even without a jacuzzi). indoor pool also nice. I like how they left the old tile work in the pool and even certain fixtures in the spa that obviously were from many many years ago - nice touch, and a cool reminder of how things were there years ago. the resort did show its age in several spots - inside and out - but not to the point of distraction. i actual think that it adds to some of its age-old charm.", "title": "A nice place for the right traveler", "helpfulness": 2, "user": "jb1234567", "date": "November 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 1.0}, "id": 145101960}, {"rating": 4.0, "title": "Casual but very good", "text": "decent restaurant choices - couldn't try the steak or sushi place because we didn't have or feel like putting on jackets - which they offered to provide. the night time dress code is kind of strange - especially when the place was so empty. i can see them enforcing it fri and sat nights, but 7 days seems a bit archaic and overly formal.", "user": "Andrew G", "date": "November 9, 2012", "id": 145001250}, {"rating": 4.0, "title": "Excellent service - good food. Got what we paid for", "text": "Didn't want a sit down, fancy dinner, but rather a good meal without spending 3 hours. Drapper's fit the bill. Good food, very good service, and in a reasonable amount of time.", "user": "VancouerWAtraveler", "date": "November 5, 2012", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 144567900}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "From the golf courses, to the spa, the food, and everything in between, this hotel is absolutely amazing! This is one of the best hotels we have been to (if not the best). It's like taking a trip back in time, but in the same breath, you have all the luxuries you can think of. And the views are breathtaking! Can't wait to go back next year!!!", "title": "Espectacular!", "helpfulness": 1, "user": "PRSimmondsOhio", "date": "October 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 144165794}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "We stayed at The Greenbrier for three nights. From the time we checked in to the time we left we really enjoyed our stay. First and foremost we were not paying for it- the trip was a business trip for my husband. It's expensive! All of the staff we met were very friendly, helpful, etc. We had a very quiet and comfortable room in the West Virginia wing. Some in our party complained of noise from the trains across the street but we did not experience this. There are many activities- bowling, shows, the casino, movies, golf, tennis, the spa, indoor and outdoor pools, walking/hiking trails, horseback riding, shops, restaurants, tours. Very few things are without added cost but I did the indoor tour one day and the grounds tour one day- free- and entertaining. We did several hiking trails- free- ranging in difficulty from easy to strenuous. The indoor pool (free) is very nice. We had dinner at the Sam Snead's restaurant- very good. Had one dinner in the dining room- also good. The food is very pricey. Less costly/less formal place for breakfast is the gourmet coffee shop. Beautiful grounds, lots of history, Southern Living chintz gone wild in the interior, lots of chandeliers. Loved it!", "title": "The Greenbrier", "helpfulness": 1, "user": "unctarheel74", "date": "October 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 144165402}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Food was very good- lots of choices, reasonable, good service, nice ambiance and you could go casual. This is an excellent alternative to the main dining room where you are expected to get dressed up and pay high prices!", "title": "Good Alternative to main dining room!", "user": "Rosemary G", "date": "October 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 144161032}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "This was our first trip to the Greenbrier and what a treat! We bought our trip through Jet setter so our room was really wonderful - 500 sq. feet! the decor takes you back in time- very tastefully done with gorgeous sitting rooms, beautiful drapes, furniture chandeliers, etc. The staff was very helpful and readily available. Breakfast in the main dining room was VERY expensive and breakfast food was good but did not \"knock our socks off!\" There is a very nice restaurant on the ground floor that had a good menu, good food and was reasonable in price. We played golf at the Meadows course. This was the cheapest ($175.00 a round, did I say cheapest!) of the three courses! It was very well maintained, but not very interesting or challenging. There were 4 clay tennis courts available, but it was $40.00 an hour to play! (Are you kidding me!) Needless to say there were courts available every time we went past the tennis facility. We put away our racquets mighty fast at that rate and chose to explore the grounds instead. There is a free tour of the hotel that is definitely worth it. Also, The Bunker tour is fascinating! We made reservations for dinner in the Main dining room but decided to order room service instead. Thus we cancelled the reservations. On our bill, I noticed a charge of $100.00 for the main dining room. When we asked about this charge we were told it was because we were a no show for dinner! we explained that we did indeed cancel. The desk person then removed this charge from our bill. Just a word to the wise - be sure to cancel any reservation if you decide not to go to the main dining room and be sure to review your bill carefully for such charges. We would definitely return to the Greenbrier- It's extremely well maintained, from a by gone era and a wonderful place to go to experience a step back in time. If you do decide to drive from the northeast area, go during fall foliage- the drive was magnificent and so were the grounds!", "title": "Expensive but worth the trip!", "user": "Rosemary G", "date": "October 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 144160899}, {"rating": 4.0, "title": "Fantastic Service", "text": "Prtions were fairly large, the food is good, but the quality of the products served has decreased a bit. The wait staff at Drapers are the only staff that adhere to the service that the Greenbrier is famous for. The only negative I can think of was that every time I took a drink from my glass someone replaced it as soon as I let go of the glass, which can a bit un-nerving because I never saw or heard the server coming every time they took my glass.", "user": "Steve D", "date": "November 7, 2012", "id": 144846620}, {"rating": 4.0, "title": "Cross between Average & Very Good - Some parts EXCELLENT, some parts to be desired", "text": "I am going to start with the good before I get to the not so great.", "helpfulness": 1, "user": "Emily S", "date": "November 5, 2012", "id": 144620856}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "1. If you go to the Gun Club ask for Ron. He is wonderful. I came to the Greenbrier with my husband, it was the first time for both of us. My husband is a former Marine so of course he wanted to go to the Gun Club. I was hesitant but decided there's a first time for everything. Ron walked the course with us and educated me on how to hold the gun, shoot the gun, etc. Again, I was super nervous and anyone could tell. Ron was so helpful and encouraging. At the beginning of the lesson I would have been just as happy watching my husband shoot...10 minutes in and I was hooked! I am sure the other guys there are just as great, but Ron made the entire experience unforgettable and was the pinnacle of our entire trip.", "title": "Southern Charm", "user": "Carla D", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144610161}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "2. Most of the staff was so nice. From the bell hop, doormen, housekeeping, they were all wonderful. I had my nails done in the salon and they were all super nice and welcoming. The concierge was very helpful as well.", "title": "Perfect Luncheon Cafe", "user": "Ray R", "date": "November 5, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 144592650}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "3. Our room was very nice; the view was something to be desired. We came at a time of the week when there was practically no one there (large group canceled maybe b/c of Hurricane Sandy). It was great for us, but then you would think that we could maybe have had a room with a better view.", "title": "Historical, garish decor, confusing layout, wonderful staff.", "helpfulness": 1, "user": "VancouerWAtraveler", "date": "November 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 144572072}], "location": {"country": "United States", "city": "White Sulphur Springs"}, "stars": 5, "variance": {"poor": 47, "average": 100, "very good": 255, "terrible": 26, "excellent": 743}, "aka": "The Greenbrier Hotel White Sulphur Springs", "slim_ranking": 0.5, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Located amid the breathtaking Allegheny Mountains of West Virginia, The Greenbrier is a National Historic Landmark and an award-winning resort that has been welcoming guests since 1778."}