{"user_rating": 5.0, "review_count": 221, "name": "The Victorian Town House", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We arrived in Edinburgh after a long, tiring drive and Aileen immediately made us feel very welcome. We stayed in The Colonial Room which is elegant, charming and wonderfully spacious with a lovely ensuite all decorated beautifully. This really is a fantastic place to stay and if we ever come back to Edinburgh we would certainly not consider staying anywhere else.", "title": "Charming!", "user": "Vix2509", "date": "April 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27569265}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Excellent weekend at the end of March 2009. We stayed in the Colonial Room - spacious and comfortable with the infamous decanter of whisky. Breakfast to die for - sets you up for the rest of the day. Aileen's hospitality was second to none. Felt like we had known her for years. Will definitely go back.", "title": "You wouldn't want to stay anywhere else!!", "user": "MJGJDarlington", "date": "April 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 27365956}, {"rating": 5.0, "stay_parameters": "Stayed March 2009", "text": "Our stay at the Victorian Town House was wonderful. Aileen was delightful and she cooks an amazing breakfast. The room was absolutely charming and spacious. Will definitely stay here again.", "title": "Perfect", "user": "glitrberi", "date": "April 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27295001}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with friends", "text": "We had a fantastic stay at the Victorian Townhouse in November 2008. The location in this very quiet and respectable neighborhood was so convenient –easy walk to the city center, castle, restaurants, stores, pubs and most Edinburgh sights, and just a couple blocks to Haymarket Station for day trips out of town. Convenient to take a taxi to and from the airport (or you can take the bus). B&B owner Aileen was wonderful, warm, helpful and humorous. Enjoyed our chats and the “extras” she provided. We were treated more like family than customers. Our lovely room was beautifully decorated, comfortable, roomy and had everything we needed, including cable TV and all the necessities to make tea or hot chocolate (a treat when returning each chilly night). The townhouse is elegant and skillfully decorated. Everything was spotlessly clean. Tasty breakfasts of cereals, yoghurt, fresh fruit, full Scottish or anything in between started each day. We had some event tickets mailed to Aileen ahead of our trip and she let us know when they came and had them in our room on our arrival. We broke up our week long stay with a two day trip to the Highlands and only took overnight bags with us. Aileen kept our suitcases and had them in our room ready and waiting upon our return. Highly recommend this B&B and hope to return on future trips to Edinburgh. Aileen and the Victorian Townhouse are truly the best!", "title": "Excellent Accommodations", "user": "Christine1951", "date": "March 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25666577}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "We arrived in Edinburgh after a long, tiring journey. Aileen could not have been more friendly as she welcomed us to her beautiful home. The house is in a lovely area and we were absolutely delighted with our spacious, warm and comfortable room. Everything was to the highest standard possible- spotlessly clean, a comfortable bed and even a decanter of whiskey to make us feel at home and welcome us to Scotland. The breakfast was fresh and plentiful in lovely surroundings and filled us up for the day! We stayed two nights and were sorry to have to leave so soon. Thankyou Aileen for being such a wonderful host. We will definately be back again to stay in what we consider to be the best B&B in Scotland and indeed, in our experience, the UK!!", "title": "The best B&B in the UK!", "user": "kazzy1", "date": "January 20, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 23724982, "likes": {"liked": "— Everything", "disliked": "— Nothing at all"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "We stood 4 nights in this B&B, which is perfectly located for visiting Edinburgh. The breakfast was delicious and Aileen, the owner, had always good advices to give. Service was real friendly and made us feel like home. The room was very nice, clean and quite. The beds were very comfortabel. Couldn't ask for more when looking for a place to stay in Edinburgh....", "title": "Lovely House!", "user": "mytravel92", "date": "May 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63819533}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "My family and I stayed two nights and occupied all of the three en-suite rooms which are all lovely and very spacious. It is within walking distance of the town centre in a quiet location and we slept very well in the extremely comfortable beds. The breakfasts were excellent and Aileen the owner is a nice friendly person who made us so very welcome. Thank you Aileen for a very enjoyable stay. We will definitely return.", "title": "Lovely place to stay in a quiet location but close to town centre", "user": "HappytravellerPurley", "date": "April 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62655061}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Our fourth visit and once again A our visit to Edinburgh was made all the more special by Aileen who really does know how to look after her guests!", "title": "First Class Host and Accommodation - Need I say more!", "user": "Aldergate", "date": "April 21, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 62058158}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "The accommodation is, as before, the best we have ever stayed in. It is spacious, inviting and everything is of the highest quality.", "title": "vacanza indimenticabile", "user": "silviasiracusa", "date": "April 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61918783}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The breakfast choices are plentiful, beautifully cooked and served and sets you up for the day", "title": "Friendly B&B in a great location", "user": "Matt_Lou2004", "date": "April 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 61222491}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "The Victorian Town House is an imposing building in a lovely residential area of Edinburgh, a pleasant walk from the city centre. It is owned and run by Aileen, whose welcome is warm and friendly and immediately you arrive you feel charmed and engaged by your host. The drawing room is a splendid reminder of the history of this spacious house with its original features creating an atmosphere of opulence. Each room is themed: we were welcomed to Africa, and the rooms are large and lovingly decorated with modern and well-sized ensuites. There is a story to most of the accessories which Aileen will divulge with humour and a twinkle in her eye. Chocolate biscuits and a wee dram are nice touches with which to welcome you. Breakfasts are served in a cosy setting and you will be plenty-full for the day's excursions. Aileen can answer all your queries and give advice about where to go, what to see and do.", "title": "True Scottish hospitality in gorgeous Georgian surroundings.", "user": "easyriders", "date": "June 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66498616}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We enjoyed Edinburgh very much - it was our first visit and we were busy throughout doing the main sites. We loved the royal yacht, the castle and had fun in the dungeons and the camera obscura. The underground city is very interesting and the Geogian House is worth a visit as is the writers' museum. There are a wealth of lovely eateries - The Witchery and The Cafe Royal were very good - you must try the oysters, but we loved Fisher's with a sticky toffee pudding to die for! You can spend much time wandering around Grassmarket - do find Greyfriar's Bobby and the shops are great. Have a coffee in Debenham's admiring the lovely stained glass windows.", "title": "Comfort and elegance in a beautiful historic setting", "user": "Bullengarook", "date": "June 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66153964}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "The Victorian Townhouse is in a row of elegant buildings that curves round a railed park full of beautiful trees and manicured gardens. The rooms are beautifully decorated with elegant rugs, curtains, paintings and ornaments appropriate to the style of the building.", "title": "perfect and cozy", "user": "jce031053", "date": "May 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65304650}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "The whole experience of staying in such lovely historic surroundings is enhanced by the warmth of Aileen's welcome and her dedication to making your stay as enjoyable as possible. The breakfasts were delicious, especially the fresh berries! and the pale yellow breakfast room was full of morning sunshine and pretty blue and whilte china.", "title": "Perfect", "user": "deebee76", "date": "May 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 65149357}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Our stay at this B&B was perfect, the rooms were spacious and very clean, the hostess was so kind and wonderful, I felt as if I had known her for years. We would gladly recommend this B&B to friends, and if we get a chance to go back to Scotland, we would definitely stay there again. C & J Evans", "title": "A Little Gem", "user": "AlanManchester", "date": "May 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64063527}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "We stayed here for four nights over Christmas, 2009 and it was just perfect. My husband, daughter and I stayed in the African room. Large, beautifully furnished and immaculate--with even Christmas lights and decorations on our fireplace. Aileen was terrific--she coped with our late arriving luggage while we were out, made us feel incredibly welcome, and even surprised us with a Christmas stocking on Christmas Day! Breakfast--including a full English breakfast--is in a sunny room at the back. It's located on a beautiful crescent, a short walk from the Haymarket train station, and a bit longer (but still very walkable) distance downtown. All three of us loved this place--can't recommend enough!", "title": "Terrific place for Christmas--or anytime!", "user": "Upstatetravelers7", "date": "January 23, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54171952}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "My parents, wife and I booked for two nights and had a wonderful trip. Aileen was wonderful to talk to and made every minute in the hotel warm and friendly. The breakfast was good, the bed was incredibly comfortable and the little sample of whisky was the perfect night cap. I cannot imagine staying anywhere else in Edinburgh!", "title": "Perfect", "user": "mightymoth", "date": "January 4, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 52541858}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "We visited Edinbugh to check out universities for my daughter, we had a great time, nothing was too much trouble, friendly atmosphere, great location, will definitely be visiting again.", "title": "WARM WELCOME, FANTASTIC ROOM, LOVED IT.", "user": "doriWales", "date": "December 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51618583}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Not our first trip to The Victorian Townhouse and certainly wont be the last. Everything about this place has to be experienced. From arrival to departure the special treatment you receive from Aileen the owner can only be described as excellence in customer service. The rooms are fabulous with our particular favourite being The Caledonian Room. All other aspects , breakfast , location ,hospitality etc. add to the whole wonderful experience of staying in this establishment which in my view is a must stay for your next visit to Edinburgh. Take away the risk and book this place , you wont regret it.", "title": "Fabulous Once Again", "helpfulness": 1, "user": "POLLYMART", "date": "December 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51390089}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Great stay at The victoria Town House, great location too very near to Princess street and Edinburgh castle. Aileen is a lovely person always smiling and taking great care of her guests. My wife and i were very pleased with the hospitality ,and considered ourselves fortunate to have found this wonderful guesthouse. The breakfast was excellent too, i did not feel hungry till late in the afternoon. There is a bustop very near to it, with buses running frequently to airport, which was very convenient too. We will definitely stay again.", "title": "excellent and affordable guesthouse", "user": "Smeagolgib", "date": "November 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50296392}, {"rating": 5.0, "title": "Don't worry about the cold bathroom floor!!!", "text": "We stayed with Aileen for 3 nights in early March while visiting Edinburgh for my birthday and had an absolutely wonderful stay. Aileen is a people person and her warm welcome, local knowledge, humour and attention to detail made our first visit to the city such a pleasure. I was very touched when she came into the dining room on my birthday with a card and a box of chocolates for me.", "user": "thelapwing", "date": "March 24, 2010", "id": 59446629}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "As for the \"ice cold bathroom floor\" mentioned by the person who gave this an average review... Well we had the same room and despite early March temperatures of minus 3 degrees and below at night, we were warm as toast! Yes, the tiles strike cool to the touch when you step onto them (they are tiles after all !!!) but within a couple of steps your feet don't notice and I'd rather have scrupulously clean tiles underfoot than a soggy bathroom carpet any day. The room is massive, the kingsize bed very comfortable, there are more things on the hospitality tray than I could count (plus the whiskey of course) and there is absolutely no traffic noise at all.", "title": "A Haven", "user": "JuliaBPerth", "date": "March 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59035688}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We travelled up by train to the Haymarket station and it's just 10 minutes walk around the corner from Aileen's. Don't bother driving to Edinburgh! The walking is easy and picturesque and it's a great way to get to know the city. Thank you Aileen for a wonderful stay.", "title": "Lovely and truly Outstanding", "user": "Elanor12", "date": "March 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 58086687}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "I stayed at this B&B for a week in February but after the first hour here I felt it was more a homely stay with a very good friend. For Aileen treats you like a new friend and does everything to make you comfortable and at ease.", "title": "Truly Outstanding", "user": "Hogeythebear", "date": "February 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57363280}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The twin room that my daughter and I shared was large, warm and comfortable with charming furnishings and an ensuite shower room. It was immaculately clean and we were provided with tea/coffee/hot chocolate and chocolate biscuits, as well as the dram of whisky!", "title": "Couldn't Fault It!", "user": "JimH177", "date": "February 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 56144917}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We stayed at the Victorian Town House for the few days while we visited Edinburgh during a week vacation in Great Brittan. We had a little trouble finding the entrance (the address on the door is 14a) when we arrived, but we were soon welcomed by Aileen and escorted to our room The room was spacious and comfortable. The breakfast was cooked to order with many choices and was fantastic.", "title": "Great Stay", "user": "manniac", "date": "July 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 34885132}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "The only problem we had with the room was some road noise during the night from vehicles passing by. I don't think this is normal because during our stay there the traffic was being diverted to the street in front of the building due to construction.", "title": "A beautiful B&B", "user": "AEL56", "date": "June 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33225449}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "As far as location goes, the Victorian Town House was around a 15 minute walk to New Town and a couple of blocks for the Haymarket Train Station. We would definitely stay with Aileen again if we were to go back to Edinburgh.", "title": "What a gem", "user": "FlipflopMidlands", "date": "June 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32880848}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "I only included pictures that have not already been posted previously.", "title": "Absolutely the Best!", "user": "BBBaby", "date": "June 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32388526}, {"rating": 4.0, "title": "Epitome of a \"like family\" B&B host", "text": "Myself and my boyfriend stayed here for 2 nights at the end of May. Our room was beautifully decorated and very spacious. Aileen made us feel very welcome and helped us in any way she could regarding resturants, nightlife, sightseeing etc... The breakfast was excellent and very filling. We would definately recommmend this B&B to our friends and family and hopefully we will get the chance to return some day.", "user": "A TripAdvisor user", "date": "May 7, 2009", "id": 29568547}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We really enjoyed our stay here. We had the African themed room. Very comfortable, including a sofa and coffee table. Aileen was very friendly. She served us a hot breakfast the morning we arrived, even though our room wasn't ready for check-in. Very convenient location.", "title": "Great B & B", "user": "JEC2", "date": "August 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 39022151}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Aileen is the owner and hostess of her Bed and Breakfast in Edinburgh Scottland. We were greeted at the door with warmth and energy. Were shown around and made to feel at home. Our room was huge and lovely. The bathroom was large and new. Everything was clean and beautiful. The linens were high end and ironed! The breakfast was amazing. There was all the traditional Scottish foods, as well as so much more. It was served in style and class, but comfortable, more like a family serving long lost relatives. After that is said, we has as much privacy as we wanted. I highly recommend this B & B. Karen Knight", "title": "Our stay was more than I dreamed it could be!", "user": "Knightkak", "date": "August 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37195684}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "Aileen is an amazing woman that runs an equally amazing guest house! She made us feel very welcome from the start and had us laughing (infact everyone from people at the nearby pubs to the taxi drivers were comedians!). Our room was very large - fantastic bed, wonderful shower and plenty of space. We only stayed in Edinburgh for 2 days but fortunately, the Townhouse is within walking distance to the hop on hop off bus which took us to the places we wanted to see. Edinburgh Castle was well worth the afternoon spent in it - totally breathtaking! Aileen is also a very good cook - the breakfasts were beautiful!", "title": "Truly amazing!", "user": "newbieAdelaide", "date": "August 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36783187}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We spent the last two days of a 3 week journey through Scotland at the Victorian Town House and were very lucky to appreciate Aileen's outstanding hospitality.", "title": "A real gem !", "user": "gruefli", "date": "August 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36562631}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "From the very warm and friendly welcome to the most spacious and elegant rooms and the brilliant breakfast - everything was absolutely marvellous and to our liking .", "title": "Wonderful place to stay!", "user": "Houston_Thankful", "date": "July 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35406525}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Having read other reviews of The Victorian Town House on here, I was fairly certain that we would like the place, in fact we absolutely loved it! Its in an ideal location, close to Haymarket train station, ten mins walk from the main drag of Edinburgh and it was a great base to explore the city from.", "title": "Perfect Weekend Break", "user": "BlackpoolRox", "date": "January 7, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 23339377, "likes": {"liked": "— The personal touches and the feeling that you were staying at someone's house", "disliked": "— Nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "What really sets it apart from other B&B's and hotels in particular is Aileen, the friendliest hostess I have met so far on my travels! Despite being a bit under the weather with a bug, she made sure we had everything we needed and it was like staying at a friend's house for the weekend.", "title": "Comfortable and Friendly", "helpfulness": 1, "user": "hushed_presence", "date": "January 3, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23223405, "likes": {"liked": "— Comfortableness and spaciousness of the room", "disliked": "— Dodgy on-street parking and vigilant traffic wardens who ticket you if you are six minutes over time (2 pounds an hour for a maximum four hours and then have to move your car)"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "I would definitely recommend this place to other visitors and myself and my other half will definitely stay there again if we go back to Edinburgh.", "title": "Lovely B&B", "user": "YorkshireBelly", "date": "January 2, 2009", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 23201106, "likes": {"liked": "— Location, lovely room and welcome from the owner", "disliked": "— nothing - however the accommodation is in a traditional Edinburgh basement flat so the steps may prove tricky for the disabled"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008", "text": "Although we only spent one night with Aileen, she made us feel very much at home. The Caledonian Room is a large, well-furnished, clean, and comfortable room with a well-laid out en-suite bathroom. Aileen was very helpful in providing directions and tips for travelling to downtown Edinburgh and places to see (and eat). Breakfast was substantial and well-presented. There was no shortage of coffee--none of these tiny mini-pots which seem cheap in other b & b's. She even offered to hold our luggage at the house if we were departing Edinburgh later in the afternoon, so we could enjoy explore downtown and the Castle. We would have no problem recommending The Victorian Townhouse and look forward to returning when we revisit Edinburgh.", "title": "Perfect B&B", "user": "Kirsty12", "date": "December 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22770680, "likes": {"liked": "— The amazing bedroom and the perfect hostess", "disliked": "— cannot fault it"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "stayed at this B&B for 3 nights with my husband the weekend prior to Christmas - Aileen made us very welcome, the room was large and comfortable and very clean with some lovely christmas decorations all over the place! Breakfast was lovely and Aileen couldn't do enough to accommodate my fussy eating. The West End is a lovely part of Edinburgh and very close to the centre.", "title": "Fantastic", "user": "jstanton8869", "date": "December 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22336492, "likes": {"liked": "— The attentive service", "disliked": "— Nothing"}}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 1, "average": 3, "very good": 5, "terrible": 0, "excellent": 212}, "aka": "The Victorian Town House Hotel Edinburgh", "slim_ranking": 0.0405405405405, "description": "The property is situated on two floors with the guest rooms situated in the garden flat which has its own private entrance. Guests are provided with a key to enable the flexibility to come and go as they wish. There are 3 Bedrooms all with en suite facilities, a sofa, colour T.V. (with digital Freeview box) and are decorated to the highest standard. Other featuers include; radio alarm clock, hairdryer, hospitality tray with a selection of teas, coffee and biscuits. A small decanter of whisky and crystal glasses awaits your return from a hectic day so you can unwind before retiring to your extremely comfortable bed. The en suite shower rooms are very spacious and finished to a high standard with fresh fluffy white towels."}