{"user_rating": 5.0, "review_count": 228, "name": "The Green Park Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "It's hard to add anything that hasn't already been said in praise of the Greenpark. Food, location, service is top class. We stayed there as an early Valentine's break and Alastair the owner had arranged for bubbly, chocs and personalised card for us in our room - a lovely touch!", "title": "A well deserved number 1 rating", "user": "citybreaker1428", "date": "February 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 55402540}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Yes, it obviously attracts an older clientele but if you're looking for a tradional hotel that puts the guest's needs first then you'd be hard pushed to beat it. We've stayed in many hotels at home and abroad and this has got to be one of the best and does the Scottish hospitality industry proud.", "title": "Perfect", "user": "alison52Lochgilphead", "date": "February 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 54987443}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We went for our ruby wedding anniversary, it was a perfect few days. The staff, room meals nothing could be faulted. Champagne chocolates and flowers were a lovely thought. Would not hesitate to recommend The Green Park.", "title": "Great Hotel in fantastic location", "user": "david1962MenstonUk", "date": "January 25, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54300323}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Old fashioned and proud of it. Very similar in ethos to a hotel in Stowe we stayed at a few years ago. Very good food and a very reasonable wine list.", "title": "A superb hotel for a relaxing stay", "user": "willowben", "date": "January 23, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54177950}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We have just returned from a few days away and couldn't have picked a better hotel. It is in a superb location overlooking the loch and just a short stroll away from the town and lovely walks in faskelly woods. The staff were very helpful and attentive and the food was great. Our room was clean with lovely views over the loch.", "title": "Fantastic location and great service", "helpfulness": 1, "user": "dandjmidlands", "date": "September 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 41884574}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The McNenemie family have got it right - they know exactly how to make guests feel welcome. The dining room is great as is the food. Just love the help youself to tea and cakes in the afternoon.", "title": "A special place", "helpfulness": 1, "user": "lavengro", "date": "September 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 41385329}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Fantastic to discover a brilliant hotel that is not neurotic about dogs. Great location too.", "title": "Excellent Hotel", "user": "harelawbrae", "date": "September 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 40396232}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "Staff look smart and are very professional.", "title": "Delightful Hotel, Modern with Old fashioned courtesy", "user": "Anthony-Phillips", "date": "September 9, 2009", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 40354898}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "The green park is our favourite hotel - and we've visited alot.", "title": "wonderful stay - hotel was perfect for us", "user": "Bellabanoonoo", "date": "September 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 40175343}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "This was our first stay at the Green Park and will not be our last. After being shown around the hotel we were taken to our room where there was a complimentary bottle of champagne and chocs to celebrate our wedding anniversary. What a lovely thought. We cannot say a bad word about this hotel, the staff are very attentive at all times and every need is catered for. The food in the restaurant was first class. Nothing in the hotel was over priced from the room phone calls to the extensive wine list. We would highly recommend this hotel but perhaps too quiet for youngsters.", "title": "Consistant good service and comfort", "user": "Promar", "date": "September 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 39666828}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Based on Billyboy's review, we organised our Scotland tour to have one night at this gem and we did not regret. We had asked for a room with a view. At the time of booking, our request was added on a waiting list and at the time of our arrival, we had a room in the central building with a nice view (see related picture).", "title": "Wonderful place, great service", "helpfulness": 1, "user": "Travellersfromswitzerland", "date": "April 6, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 60505390}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "While the room itself was smallish, we found plenty of living space in several rooms on the ground floor, all tastefully decorated, with papers and magazines available and serviced by the bar (see related pictures).", "title": "One of the best", "helpfulness": 1, "user": "Seniortraveler060", "date": "March 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59566946}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "We found dinner and breakfast pleasant and to our taste, with a special mention to the service.", "title": "Fantastic experience to be savoured then repeated", "user": "emmceetoo", "date": "March 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59066963}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "There is a nice green area towards the lake to stroll and relax, though the sound of the motorway on the other lake side is easily noticeable.", "title": "Can not be beaten", "user": "johnAyrshire", "date": "March 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57923132}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Overall, we would have loved to spend another night there and will return should we be in this region again.", "title": "Excellent Service and Value, very friendly and helpful staff. Great food.", "user": "dsliase", "date": "March 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 57800995}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "Fabulous hospitality, service, quality eating and wonderful location. Perfect in every way and to be highly recommended. Looking forward to the next time!", "title": "Perfect in every way!", "user": "LinlithgowDianeM", "date": "August 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 38509871}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Location: We chose the Green Park for proximitits midway location between Edinburgh (our port of entry to Scotladn) and the mountains we were planning to hike for a week. There are many walks that start from Pitlochry including Ben Vrackie and many more 15-20 minutes away by car. Landscaped gardens round the hotel lead down to a wide river, with misty mountains in the background, it is a beautiful setting. A few minutes from the main throb of the very touristy town of Pitlochry means it is more peaceful than the town centre - but you do have the noise of the traffic from the arterial road up north - A9 - just a stone's throw away.", "title": "Quaint, old fashioned", "user": "Karen R", "date": "August 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 38348754}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Service: Top marks for service - warm, helpful and courteous service from everyone. When we had to leave early on our last morning and miss the breakfast the hotel instantly offered a packed lunch in exchange and were more than happy to provide anything we wanted!", "title": "Consistently good!!", "user": "Molecatcher", "date": "August 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37213556}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Food: A very high standard of food. Although some of the dinner selections made me think of an Edwardian British kitchen - venison, duck, ox tongue - the chef paid more than lip service to modern eating trends and served some really delicious vegetarian fare as well as Scottish beef and salmon on a regular basis. Four course dinners proved too much for us night after night and depsite being warned by the hotel that the local restaurants \"weren't up to much\" I think this was self serving as we found two delightful places - both reviewed on Trip Advisor. Breaksfast was another gourmet experience - fantastic variety on the buffet tables - fresh fruit, nuts and seeds, breads, cereals, yogurts - and all beautifully displayed. Also a full cooked breakfast and although baked beans weren't on the menu, it was \"of course we can do that for you\" when we requested them. We went to celebrate a wedding anniversary and received a card and a bottle of champagne in our room. A very thoughtful gesture.", "title": "Owners, managers and staff all understand what real hospitality means", "helpfulness": 2, "user": "usaphile", "date": "June 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 32728153}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Any cons: Well, with our 50th birthdays still a few years away, we felt positively sprightly among the older clientele. The atmosphere was a wee bit staid. Despite the dress code stated as \"smart casual\" most of the men were tied and jacketed for dinner - except my husband! We felt the dining room needed some music to cover the genteel silence. Its hard to have a relaxing meal when a normal conversation seems to boom and echo through the dining room.", "title": "Guaranteed comfort & cleanliness - but a hotel for older guests!", "helpfulness": 1, "user": "cannicUk", "date": "June 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 31711264}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 1, "average": 2, "very good": 23, "terrible": 0, "excellent": 202}, "aka": "Green Park Hotel", "slim_ranking": 0.136363636364, "description": "The Green Park hotel is to be found on the western outskirts of Pitlochry, enjoying unrivaled views over Loch Faskally from its lochside position. Set in three acres, the Green Park is within strolling distance of the shops and a pleasant walk from the Pitlochry Festival Theater. The Green Park hotel is run by two generations of the McMenemie family, in a manner suitable to the character of the house and its setting."}