{"user_rating": 4.5, "review_count": 1092, "name": "The Chedi Muscat, a GHM hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "My wife and I have spent six days at the Chedi, after 3 days of visit", "title": "Chedi : the truth", "helpfulness": 10, "user": "Paulklib", "date": "April 6, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 7286804, "likes": {"liked": "— Style and cleanliness", "disliked": "— Lack of storage space"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "of this extraordinary country. We were a bit anxious after having read some negative reviews. Our experience was excellent.", "title": "Loved The Chedi", "helpfulness": 4, "user": "ScotlandKd01", "date": "March 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7260533, "likes": {"liked": "— Weaher, Service, Relaxation", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "1. The staff: very friendly and helpful; seemless registration, quite", "title": "Excellent Hotel", "helpfulness": 2, "user": "RallyDriverOxford", "date": "March 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 7193858, "likes": {"liked": "— Well appointed and very clean", "disliked": "— No balcony"}}, {"rating": 5.0, "title": "A Real Oasis", "text": "professional restaurant staff.", "helpfulness": 3, "user": "tynwald", "date": "March 15, 2007", "id": 7165460}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "2. The planes: no, this is not an aircraft carrier; there are a few planes, but nothing unbearable.", "title": "A fantastic hotel", "helpfulness": 4, "user": "Christo8", "date": "March 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 7164595, "likes": {"liked": "— Style, Service, Weather", "disliked": "— leaving"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Yes, everything that has been written is true, it’s a beautiful stylish hotel, tranquil pools, opulent restaurants, stunning architecture and inspired lighting design.", "title": "Chedi Muscat - time to get up off its laurels?", "helpfulness": 1, "user": "Intrepidtoo", "date": "April 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 1.0, "sleep": 5.0, "rooms": 4.0, "location": 1.0}, "id": 61956229}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled solo", "text": "But service is slipping, complacency is growing, pricing is inflexible and management needs to get its act together if it is to retain its position as Oman’s premier getaway destination.", "title": "I found it delightful", "user": "missbealiba", "date": "April 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 61845832}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Arriving at the hotel for a weekend, there were insufficient staff on duty to cope with three cars at one time. Whilst check in was efficiently and comfortably handled with welcome drinks and cool towels, the promised upgrade had to be asked for and the requested non-smoking room was strongly redolent of smoke. Eventually we were moved to a nearby non-smoking room which was very pleasant, the nespresso machine, ipod dock and bose radio welcome extras.", "title": "Relaxing if you can ignore the costs", "helpfulness": 1, "user": "traveller9182", "date": "April 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 60762952}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "However, the dinner reservation in the prosaically but accurately named “Restaurant” was less well handled, requiring us to wait for half an hour at the bar as the waiter had decided unilaterally to delay the booking as “they were busy”. No offer of even a glass of water whilst we were waiting, just a list of expensive cocktails. The food was delicious but finding drinks for the adjoining table added to our bill was an unnecessary irritant.", "title": "Luxury - at a price", "helpfulness": 1, "user": "Nick W", "date": "April 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 60420198}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "The pools and gardens are beautifully serene, although being handy for the airport means it’s directly under the flight path with upwards of ten aircraft an hour a few hundred metres overhead. You get use to it after a while. The beach too is spectacular, from the photos, but it’s central to Muscat’s urban sprawl which runs for some 50km, with desalination plants, fish processing and petrochemical works arrayed along the shore in both directions. The beach is not unpleasant, but don’t expect pristine white sand and shower well afterwards. The pools however are excellent, the sun beds numerous and the staff with jugs of cold minted water a welcome relief when it’s 40deg.", "title": "Very Relaxing Stay", "user": "Lulusmum", "date": "April 4, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 60316772}, {"rating": 5.0, "title": "Fantastic hotel, very relaxing", "text": "It was our first time to Oman and several friends had recommended The Chedi. Since we stayed, many of our friends have visited The Chedi after seeing our photographs and hearing our feedback.", "user": "longjohnsilverLondon", "date": "March 25, 2010", "id": 59482528}, {"rating": 3.0, "title": "Not the GHM standard", "text": "I was on crutches at the time and recovering from a severely broken leg, so after surviving the long haul flight from London, we arrived at an oasis of calm known as The Chedi and relaxed instantly.", "user": "Supertravelbee", "date": "March 23, 2010", "id": 59303632}, {"rating": 5.0, "title": "A relaxing haven ....", "text": "We had a slight issue with the room upon check-in. As my mobility was restricted, we had requested a ground floor Deluxe room, but they put us in a block towards the rear of the hotel on the top floor, overlooking the car park. We managed to resolve that and moved to a lovely Deluxe room in the garden in a central location. If you upgrade and go for a Club room, you have access to The Library - apart form books and internet access, you are treated to pre-dinner drinks and canapes and the outside courtyard is lovely and you can hear the calls to prayer from nearby mosques. The suites are also spectacular.", "user": "Lyn1Surrey", "date": "February 28, 2010", "id": 57366389}, {"rating": 4.0, "title": "Adored it but catering improvements needed", "text": "The infinity pool by the beach is lovely, although the beach itself is not that great. They have large daybeds (big enough to fit 4 people) and the waiters serve you ice cold water all day and bring cold towels. There are no screaming kids as this pool is restricted to adults. We stayed during Ramadan, so the hotel was nice and quiet and you were unable to drink alcoholic drinks during the day (apart form within your room), but this was not a problem for us. The other pool is more \"child friendly\" and it was nice to spend the afternoons there. I have heard that during peak season, there is an issue with the sunbeds and this is acknowledged by the hotel and a note in your room. Basically, guests wake up at 6am, reserve their favourite sunbeds, and then go back to bed, have a leisurely breakfast and hit their sunbeds from 11am - I hope the hotel can manage this and it spoils the vibe.", "user": "LKD80", "date": "February 28, 2010", "id": 57316772}, {"rating": 4.0, "title": "Nice hotel but a couple of drawbacks", "text": "The food is fantastic and there is a good choice with multiple open kitchen theatres. We tried most things on the menu and the selection of wine is very good, as is the service. The restaurant is a visual treat and if you have a sweet tooth, they make amazing cakes and chocolates in front of you, all presented beautifully in glass cabinets. WE typically had a large breakfast (again, a wide choice), a small lunch of cold meze and then a full 3 course dinner with wine.", "user": "OmanFeb2010", "date": "February 26, 2010", "id": 57145729}, {"rating": 4.0, "title": "Ignored requests - serious management failures", "text": "This was our second stay at The Chedi, Muscat.", "user": "Paul123Somerset_UK", "date": "February 21, 2010", "id": 56663426}, {"rating": 5.0, "title": "Chedi Muscat", "text": "We agree all the plaudits we have read: superb grounds, pool areas and pool staff; wonderful food, especially the breakfasts which are quite superb; charming and courteous staff; \"OK\" bedrooms, well equipped but badly lit and generally a bit dated - and certainly too expensive for what they are.", "user": "vanluttmer", "date": "February 19, 2010", "id": 56493362}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "BUT, requests made by our agent THREE MONTHS before our travel date for garden or sea facing rooms, reiterated by our agent a week before travelling, were totally ignored. When we remonstrated on our arrival, the response was one of disinterest and complaints to management were met with indifference. And this was not the first time! Precisely the same thing had happened to us on our first visit in 2009.", "title": "Design Dream", "helpfulness": 2, "user": "zauberfloete", "date": "February 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 56353798}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We had considered returning in 2011 but pending an early response with satisfactory explanations to a letter delivered to the General Manager several days before our departure (so far not received approx. ten days later), this now seems unlikely.", "title": "Wonderful staff in very relaxing atmosphere.", "user": "Howicks", "date": "February 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 56324347}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "A great pity because we have loved exploring Oman, its friendly, courteous people and in most respects, a very good, albeit expensive, hotel. We await to see of its management really care.", "title": "Everything about this hotel was fantastic, making for an amazing week", "user": "louielaloupe", "date": "February 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55816978}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "This place is simply amazing.", "title": "Legendary", "helpfulness": 6, "user": "VladTheReviewer", "date": "July 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8260579, "likes": {"liked": "— All of it", "disliked": "— Lack of beach"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Oman is expensive at the best of times and this place reflects that. However, amazing rooms, beautiful food, two fantastic pools (and joy, one where children are banned). The beach isn't that great but the setting, gardens are wonderful.", "title": "Out of this world!!!!", "helpfulness": 11, "user": "BuxomBelle", "date": "July 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8125859, "likes": {"liked": "— The rooms, the resturant, the pool", "disliked": "— the location"}}, {"rating": 4.0, "title": "I'll be back!", "text": "A true boutique hotel but definately one of the best that I've ever stayed in. For diving though its not ideal.", "helpfulness": 2, "user": "PederOsloNorway", "date": "June 24, 2007", "id": 7976188}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "It's worth hiring a car and heading off to Nizwah and down the coats if you're feeling more energetic too.", "title": "Wonderful place with amazing staff", "helpfulness": 5, "user": "donnawilliams", "date": "June 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7838519, "likes": {"liked": "— relaxation and quality", "disliked": "— cyclone gonu"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "I have been reading 'Trip Advisor' for some time now, in fact whenever I have booked a holiday I read what people have to say about various resorts ect. I have been following the reviews posted on here about Cuba (our summer destination) and am a bit worried about some things that have been said. After being told that British people moan constantly reguardless of standards, I decided to check out the reviews on The Chedi (our Easter holiday destination) as I know there is NOT possibly anything that anyone could complain about!!!! I can't believe that there are complaints on here about this hotel, it is absolutely amazing, totally out of this world.", "title": "The absolute best", "helpfulness": 6, "user": "happytrails101", "date": "May 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7723137, "likes": {"liked": "— Stylish and friendly in every presentation and offering", "disliked": "— Having to leave"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Firstly can I say that I travel a fair amount on business and have quite high expectations - The Chedi met them all and some.", "title": "A Great Hotel", "helpfulness": 14, "user": "OmanRob", "date": "May 19, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7643121, "likes": {"liked": "— Bath"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We live in Muscat and my wife surprised with what I thought was dinner and turned out to be a night at the Chedi. She had booked a Superior room and was lucky enough to be upgraded to a suite.", "title": "The Best Relaxing Holiday Ever, What do you think?!", "helpfulness": 4, "user": "Davidcg", "date": "April 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 7481597, "likes": {"liked": "— The atmsophere, staff, pools and spa", "disliked": "— Not enough storage space and not enough Coathangers"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The room - probably the nicest I have stayed at where the Emirates Towers in Dubai was my previous bechmark. Ours was a single story suite so also benefitted from a stunning dome above the bed. The decor is minimalist but done using quality materials like limestone, black marble and cherry wood. The bathroom again was probably the finest I have seen with a walk down into huge black marble bath that took ages to fill but was worth it. Bed was comfortable although the pillows were a bit strange and not very supportive. The room also had an iPod and big TV in the living room and an excellent free mini-bar with pre-filled ice bucked - a nice touch. When we arrived there were also candles lit beside the bed and also the bath, again another nice touch.", "title": "Oman and the Chedi More Than Met Expectations", "helpfulness": 1, "user": "GrahamC926", "date": "April 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 2.0, "rooms": 4.0}, "id": 7403074, "likes": {"liked": "— Design of the whole environment", "disliked": "— Immediate surroundings. Nowhere to walk"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Restaurant was as good as always with a varied and iteresting menu that is perhaps in need of a change as its been the same for some time. The waiting staff are a little less vigilant than in past visits but that is a comment rather than a criticism.", "title": "Chedi, good overall experience but some warnings", "helpfulness": 10, "user": "miss_saigonlondon", "date": "April 11, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 7331275, "likes": {"liked": "— the place is cool", "disliked": "— the rooms - nothing special and poor value for money"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The pool is truly excellent with cool towels and lemon water a-plenty and loads of loungers at this time of year.", "title": "Anniversary Heaven", "helpfulness": 5, "user": "Londona", "date": "April 10, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 7303956, "likes": {"liked": "— The serene luxury", "disliked": "— There was nothing we didn't like"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "One of the best hotel's I have ever stayed in. Décor is amazing, in fact breath taking. It takes a day or so to fall into the pace of life. Try to book a club room as you have fabulous extras such as daily laundry service and cocktails in the library.", "title": "Not to be missed - a gem that is still relatively undiscovered...", "helpfulness": 8, "user": "MooHunter", "date": "September 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10003846}, {"rating": 1.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The staff were sincere, kind and considerate - always willing to go that bit extra to help. And the spa was paradise. Amazing to have a Balinese massage by a therapist from Bali!!", "title": "The Chedi contrick", "helpfulness": 8, "user": "yelrah", "date": "September 11, 2007", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 8692108, "likes": {"liked": "— N/A", "disliked": "— The trying to extort extra mony out of guests arriving before 9.00 am"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The real difference between Oman and Dubai is that a good proportion of the Omani nationals work, so there is a healthy mix of immigrants and locals all working together. This, in turn, creates an equilibrium which is visible - unlike Dubai, which every time I go, I find more and more difficult to ignore the exploitation of immigrants from India, Pakistan and other such countries. But back to the Chedi - it is expensive, but 100% worth it. This is not a hotel for those who want games, activities and party party - this is totally about a calm and relaxed stay. I cannot say enough good things about this place. Just go! You won’t regret it.", "title": "Amazing!", "helpfulness": 7, "user": "bruisyard", "date": "September 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8687180, "likes": {"liked": "— The service, the pools, the food and the architecture/decoration of the hotel", "disliked": "— The beach and the fact that to get anywhere you had to get a taxi, but this is the case with all hotels in Muscat"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We didn't actuall get to book the Chedi as they wanted us to pay for an extra nights accomodation because we were due to arrive at the airport (not the hotel) before 9.00 am. We even said we would wait at the airport until nearer the check-in time at the hotel of 2.00 pm but they said this could not be done. Apparrently they are the only hotel to impose such an outragous charge on its intebded guests and we have therefore decided to take our custom elsewhere. If this is the customer service offered before a booking is actually made I am surprised there are so many satisfied customers. They will be telling you what airline to use next and what clothes to wear if you want to stay there. THEY CAN STUFF IT and it is their loss as we will no doubt find a more customer orientated hotel elsewhere.", "title": "Absolutely perfect!!", "helpfulness": 7, "user": "travelDIY", "date": "September 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8676096, "likes": {"liked": "— interior design and service", "disliked": "— the beach"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We stayed here for 2 nights over our wedding anniversary weekend. The Chedi had only reopened the week before following damage sustained during the cyclone, so it was all pristine!", "title": "Fantastic Hotel", "helpfulness": 11, "user": "ITALIANMAGIC", "date": "September 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8614824, "likes": {"liked": "— Food, Service & Surroundings", "disliked": "— Leaving"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "For the third time in as many years we have celebrated our wedding anniversary at the Chedi and once more are well pleased by the attention to our needs provided by the polite, friendly and professional staff at this oasis of calm in a busy world. It is not commonplace to be greeted with a smile and a cheery greeting in todays sometimes frantic life but at this hotel we found it to be the norm and all the more welcome because of it. Our room was immaculately clean and kept that way throughout our stay, the service in the restaurants was attentive but never obtrusive and all the staff with whom we came into contact were pleasant polite and helpful, we shall return next year.", "title": "Serene and seriously restful", "helpfulness": 1, "user": "platelayer", "date": "April 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 60241578}, {"rating": 5.0, "title": "quiet and luxurious", "text": "epitome of middle eastern tranquility,courteous staffs,uber modern w/ elegant oriental mood", "user": "rose08California", "date": "March 31, 2010", "id": 60025156}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "I had very high expectations of The Chedi having read so many positive reviews - unfortunately I hadn't read the ones which mention the location which is very disappointing. The beach itself is poor (for 2 days it was covered in green slimy seaweed) and the view over the white fence of the hotel perimeter to the left is very average and to the right positively ugly. The hotel grounds themselves are very attractive however and the pools beautiful so as long as you don't look sideways you will be fine!", "title": "Emperor's Clothes?", "helpfulness": 3, "user": "SarahB222", "date": "March 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 2.0, "location": 2.0}, "id": 59938256}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The hotel itself is very stylish but our room was small with hardly any storage space and poor lighting. The staff were very friendly and quick to respond to any requests - the pool service was particularly good. We were again disappointed however that when we asked to use the library (as my husband had forgotten to bring his book) we weren't allowed as we weren't in a superior enough room - we felt this was particulary mean and let's remember the price we were paying!", "title": "Beautiful Hotel built in completely the wrong location !!!", "helpfulness": 2, "user": "Gingercat_2010", "date": "March 29, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 2.0}, "id": 59850937}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Breakfast was a triumph - absolutely everything you could wish for (but not for the very haughty guest who complained in a loud voice that it wasn't authentic enough) (there were quite a few of \"those guests\"). In the evening we ate outside in the traditional Arabic restaurant which was very good. The seafood restaurant really didn't live up to expectations and I would really recommend that you avoid the set \"taster menu\" which is over priced and offers a thimble full of wine with each course.", "title": "Heaven!", "user": "samanthalian87", "date": "March 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 59565171}], "location": {"country": "Oman", "region": "Muscat Governorate", "continent": "Middle East", "city": "Muscat"}, "stars": 5, "variance": {"poor": 30, "average": 95, "very good": 222, "terrible": 24, "excellent": 721}, "aka": "The Chedi Muscat Hotel", "slim_ranking": 0.0909090909091, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "Occupying a prime beachfront location, this exclusive 21-acres 5 star beach resort is located 20 minutes north of old Muscat, the capital of The Sultanate of Oman, at Al Ghubra. The Chedi Muscat is ideally located for business and leisure travelers alike as the main tourist attractions, the financial centre and Muscat International Airport are only a 15 minutes drive away.The Chedi Muscat, a member of “The Leading Hotels of The World” and Oman’s first contemporary hotel, opened its doors in 2003. The resort offers understated elegance and a perfect mix of Omani architecture and a profound Asian Zen-style. The minimalist lines of the low-rise buildings are accentuated by gardens of symmetrical simplicity, with lines of manicured hedges and ordered pools of water, creating an implacable Zen calm. All 158 rooms have breathtaking views across the gardens and ponds, mountains and the Gulf of Oman. As well as a 370m private beach, The Chedi Muscat offers guests a choice of three pools: the adults-only infinity Chedi Pool, surrounded by cabanas and with a superb seafront location and the recently opened 103-metre outdoor pool The Long Pool, and the family friendly Serai Pool, with its black mosaics and elegant canopy plus 2 flood lit tennis courts."}