{"user_rating": 4.0, "review_count": 475, "name": "The Inn at Longwood Medical", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "We stayed one night at the Inn at Longwood due to its close proximately to Brigham and Women’s Hospital. The hotel had a very convenient parking garage attached for $18 a night. You need to get your parking ticket validated by the hotel before leaving. The check in process was quick and we got to our room within 5 minutes. Overall the room and bathroom were clean and updated. However, the AC/Heat element-vent was dirty and old, was from the 1970s complete with dust and grime. (This grosses me out at any place) The room was very tight for 2 Queen beds – so one bed was pushed up against the dirty AC thing. Less then desirable but oh well…standard for most older hotels. We had dinner at the hotel’s restaurant. The menu was diverse and all price ranges. The bartender made some good drinks for us. The waitress was EXTREMELY slow…but the food was good. There was a small food court with fast food and coffee shops and CVS. The hotel was quiet for a few hours sleep. The checkout process was quick and we were at the hospital within 10 minutes. I’d recommend this place if you are traveling from out of town or local and have an early morning appointment at one of the hospitals.", "title": "Good Location to Local Hospitals", "user": "Daphne418", "date": "October 12, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 20829415, "likes": {"liked": "— Location to hospital/parking/restaurant", "disliked": "— dated AC/heat unit, small room with bad view"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "This Best Western is nicer and cleaner than most Best Westerns. Initially, we had some trouble finding the lobby to check in, but only because we went in through the food court/CVS entrance. At the front desk, check in was hassle free, but the desk staff wasn't friendly at all. He mumbled something about our room having been given away, so we had gotten a free upgrade to an apartment suite. We were a little confused, but hey, it was a free upgrade. The apartments are in a separate part of the building from the hotel, and aren't bad really. The hallway once you exit the elevator is a little small and cheap looking, and there was a bag of linens (clean or dirty, I'm not sure) sitting in the hallway for the entire duration of our stay (granted, we did only stay one night). But, once you enter the apartment, it is cozy and simply decorated, and the kitchen is even outfitted with dishes and paper towels, etc. There were a few things I noticed which might bother some people, but didn't really bother me. One is that there were some noticeable holes in one of the walls which just need a little spackle. Another is that there was a teeny bit of mold/mildew in between the shower tiles, and the shower curtain could have been a little cleaner. Other than those small things, the apartment was nice, and clean enough. The hotel itself is only a 6 block walk from Fenway, and in the same building as a food court/CVS. Also, the Longwood restaurant on premises is actually pretty good, and not expensive. I would stay here again if I needed to be in the vicinity of Fenway or the hospitals.", "title": "Decent place - would recommend!", "user": "CMeredith80", "date": "September 30, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 2.0, "location": 4.0, "value": 3.0, "rooms": 4.0}, "id": 20504973, "likes": {"liked": "— location, convenience, food choices", "disliked": "— front desk staff"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "The Best Western at Longwood was clean and convenient. It's location is close to public transportation which made getting around this great city quite simple. The hotel is located in the Gallery which had a wonderful food court. This made grabbing a quick bite for breakfast or a convenient lunch/dinner wonderful. Overall our stay at the Best Western at Longwood was excellent! I'd stay there again.", "title": "How Convenient and Clean", "user": "snjsportsguy", "date": "September 14, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 20056467, "likes": {"liked": "— The convenience of the location", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Gotta say that I read these reviews after I made our reservation and I was a little concerned. However, I found the negative comments totally unfounded. Our room was clean and comfortable, the staff was friendly and very helpful, the parking was hassle free and very reasonable for overnight city parking, and it was an easy 15 minute walk to Fenway. The only down side that I could see is there is no nightlife in the immediate area. The onsite restaurant and bar are both good and the adjacent food court provide a quick and cheap meal option.", "title": "No problems here", "user": "msa176", "date": "August 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18676083, "likes": {"liked": "— Clean comfortable room", "disliked": "— Bar closed too early (mid-nite)"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled solo", "text": "Recently I had the pleasure of Staying at the Bestwestern Inn at Longwood for an extended stay due to an illness, I needed to be near the hospitals. The hotel went above and beyond to make sure that my stay was comfortable considering the circumstances of my illness. I have never met a more accommodating staff in all of my years of travel. I will forever be grateful for the wonderful service I recieved ~ it made a tough time pleasureable!! Thank you to Brian Stiglets the GM and his staff for everything!!!", "title": "Thank you to Brian Stiglets and the staff at the Bestwestern!!!", "user": "jkarchner", "date": "August 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18508739, "likes": {"liked": "— convenience ~ restaurant"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "My husband and I stayed at the Inn at Longwood Medical because of it's proximity to Dana Farber Cancer Center and Brighams and Woman's Hospital. I was somewhat hesitant because of the reviews here, but it is the closest hotel to the medical facilities so we booked.", "title": "Giives new meaning to the word \"filthy\"", "helpfulness": 1, "user": "blondie859111", "date": "July 24, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 5.0}, "id": 18198418, "likes": {"liked": "— Location", "disliked": "— Filth and dirt in room"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "I was completely unprepared to the actual filth and dirt in the room. I wiped down the remote, the light switch, one doorknob and the heating/air conditioning dial, and the antibacterial wipe I was using was dark gray and black. Astounding.", "title": "Great Hotel!", "user": "pattersor3", "date": "July 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18186810, "likes": {"liked": "— Service and location", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "Our child is having 5 different surgeries at the Childrens Hospital next door to this hotel this year.", "title": "This place is a Keeper on my list", "user": "jujunurse", "date": "April 3, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 14777486, "likes": {"liked": "— next door to childrens hospital", "disliked": "— sounds of sirens"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "My husband and I think this hotel is great!!!!!!!!! :)", "title": "medical discounts, parking tips", "helpfulness": 1, "user": "joycandoit", "date": "March 17, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 14336124, "likes": {"liked": "— Longwood Medical Area convenience, place to hang your hat in a Boston medical emergency", "disliked": "— Only reason to stay here is a medical emergency in Boston Longwood Medical area"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008", "text": "Everyone there is courteous and so helpful.", "title": "Best Western Again", "user": "bigshotbob", "date": "March 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 14150858, "likes": {"liked": "— price", "disliked": "— noise"}}, {"rating": 1.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "We enjoyed the variety of restaurants in the food court that is connected to the hotel especially when it was wet and cold outside.", "title": "Marginal hotel, poor value", "helpfulness": 1, "user": "Blueyes1119", "date": "February 24, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 13815840, "likes": {"liked": "— near the Longwood area hospitals", "disliked": "— worn out hotel with cramped room"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "Also having a CVS inside the building was handy.", "title": "Return trip to Boston", "user": "LSUno1", "date": "February 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13428990, "likes": {"liked": "— The convenience", "disliked": "— Nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Then, we pulled down the sheets and found long black hair between the sheets. i lifted up the sheets to check the mattress pad, because of an earlier review I read involving bedbugs, and was so dismayed to see dirt and very short, very curly hair embedded in the mattress pad.", "title": "Good, Bad, and the Ugly", "user": "belyndaw", "date": "July 18, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 18015434, "likes": {"liked": "— Area was great for evening walks.", "disliked": "— Poor up-keep of room."}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Overall, the state of the room was disgusting.", "title": "Not fancy ,but good", "user": "ggleeson", "date": "May 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 16003119, "likes": {"liked": "— Price and staff"}}, {"rating": 5.0, "title": "Awesome Time", "text": "Staff was fine. Check-in/out was fine. Complimentary breakfast was fine. I just wish there was another hotel close by to have another option for overnight stays.", "user": "janaeamherst", "date": "May 8, 2008", "id": 15803695}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "The ugly? Unfortunately there was an ugly. The toilet was unstable and filled inconsistently. The shower never stopped dripping and had a slow (extremely slow) drain. My ten minute shower practically turned into a bath. The bathroom sink had a problem with uneven water pressure. The lighting in the room was inadequate - four lamps with dim bulbs did not provide enough light, and opening the curtains was not much help since the hotel is in the shadows of tall hospital buildings. The door was challenging to close and latch, and I found the single chain lock (no deadbolt) to be insufficient.", "title": "Loved the Inn at Longwood Medical", "helpfulness": 1, "user": "pirate81", "date": "May 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 15715319, "likes": {"liked": "— Room size and staff"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2008", "text": "On an odd note, the hotel has framed photography on display and for sale in the lobby, yet when we inquired about purchasing a piece (which was a fundraiser for the adjacent hospital, by the way), no one knew how to sell it to us. We left without the piece. Why display prices and post information about the fundraiser, and then be unable to sell the pieces? Disappointing.", "title": "Not a great place", "helpfulness": 2, "user": "Dutch99", "date": "April 18, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 15128248, "likes": {"liked": "— Location", "disliked": "— Staff and maintenance"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008", "text": "Other than a room, this hotel offers nothing one might seek for amenities. It is dreary! It is adjacent to the Longwood Galleria which has a decent restaurant but is otherwise a small food court like you see in a mall. Unless you absolutely want to or need to be at the hospitals, avoid this hotel!", "title": "The Inn at Longwood Met Our Needs", "helpfulness": 1, "user": "GracieLakeshore", "date": "January 23, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 12927342, "likes": {"liked": "— Location"}}, {"rating": 5.0, "title": "Tremendous Service", "text": "We had an enjoyable stay at the Longwood Inn a couple of years ago, so upon returning on a business trip I stayed there again. I had no problems with the hotel at all. The room was clean and the staff made sure that all of my needs were met. Once again, my 3 day stay was a pleasant one. I feel comfortable in knowing that I will always have a place to call when I am planning another trip to Boston.", "helpfulness": 2, "user": "Malvernite", "date": "January 11, 2008", "id": 12535509}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We were here for two nights with appointments in the area hospital.The hospital reccommended the hotel to us. The room was clean ,the staff friendly and the restaurant and bar had good food.If we have to come back we will stay here again.Free internet was a plus.", "title": "Another great stay", "helpfulness": 3, "user": "Shanni97", "date": "January 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 12420767, "likes": {"liked": "— Location", "disliked": "— Still no direct connection to the hospital"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Please note before reading this review that I have stayed at this hotel at least four times in the past year, but this last time, was for sure, \"the last.\" The front desk staff, including the hotel manager, is rude; they don't give correct information at times; and they don't communicate information when changing shifts.", "title": "Ripping Off The Medical Community and its Patients - Stay Away!", "helpfulness": 7, "user": "rain_song1", "date": "November 27, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 3.0}, "id": 11097618, "likes": {"liked": "— location", "disliked": "— everything else, except the help from the hotel's engineer"}}, {"rating": 4.0, "title": "Best place to stay for access to Children's Hospital Boston", "text": "The night we arrived the hotel's entire computer system crashed. We were told, not asked, to wait in the lobby for over an hour with a 14-mo. old. The hotel manager offered that they have no emergency plan for this type of problem since it never happened before... After an hour we approached the desk and were told that the computer was up, but they still couldn't make key cards. We waited again for the engineer to come and let us into the room. For 5 mins., he tried to open our room using a long wire that he put under the door to hook the door handle on the other side. Yikes!", "helpfulness": 5, "user": "MinnesotaMOMMY19", "date": "November 9, 2007", "id": 10711066}], "location": {"country": "United States", "city": "Boston"}, "stars": 3, "variance": {"poor": 29, "average": 71, "very good": 110, "terrible": 33, "excellent": 232}, "aka": "Best Western Plus Boston - The Inn At Longwood Medical Hotel Boston", "slim_ranking": 0.636363636364, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "This full-service hotel is walking distance to key area attractions such as the Fenway Park, Museum of Fine Arts, Boston Children's Hospital, Brigham and Women's, Dana Farber, and Harvard Medical School, Boston University, Colleges of the Fenway Northeastern Univeristy and Boston College. Easy access on the Green Line of the MBTA public transportation. Concierge service for Historic Tours of Boston and tickets to major events."}