{"user_rating": 4.5, "review_count": 1781, "name": "The Muse Hotel New York", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I have stayed in a varity of larger hotels in the Times Square/Theater District over the past 6 or 7 years. I would categorize \"The Muse\" as a boutique hotel. The rooms and hallways were fresh and well cared for. Hotel staff was very courteous. The wine hour was a nice touch and my wife enjoyed it.", "title": "Good Location fo Theater and Times Square visitors", "user": "SCSTWG", "date": "May 26, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 16418975, "likes": {"liked": "— Nice decor", "disliked": "— Valet parking"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "On the negative side, the lobby is small and can get overcrowded during busy times. Likewise, it can be challenging to get in and out of the valet parking, but then again all NYC parking is difficult and expensive. The hotel is located on 46th street about 1/2 block from Times Square and the street is pretty dingy. Then again, the entire Times Square area is pretty dingy.", "title": "A great hotel", "helpfulness": 1, "user": "traveladdict10013", "date": "May 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15989434, "likes": {"liked": "— How stylish it was", "disliked": "— Having to pay for wifi"}}, {"rating": 4.0, "title": "Great Beds & Location", "text": "In the future, I will stay in Northern mid-town and be closer to the south-end of Central Park. Times Square hotels are convenient for theater goers, but I think it is not a true representation of what NYC/Manhattan has to offer.", "user": "spf0", "date": "May 2, 2008", "id": 15577894}, {"rating": 5.0, "stay_parameters": "Stayed April 2008", "text": "This hotel is well decorated, the beds are extremely comfortable, the staff are friendly and the location is perfect - right around the corner from Times Square. I highly recommend it. It's quirky enough not to be another bland hotel but also convenient and quiet.", "title": "Great Hotel", "user": "cvaughan1", "date": "April 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 15285923, "likes": {"liked": "— Beds", "disliked": "— High prices on certain aspects (mini bar , wifi)"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008", "text": "My husband and I stayed 3 nights in an Executive King on the 18th floor. I booked direct through the hotel's website and was glad to see they accommodated my preferences. Since we were higher up, nearby construction noise was not an issue. I enjoyed the seated style check-in and friendly atmosphere of this boutique style hotel.", "title": "Busy location", "user": "jansindc", "date": "April 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 15107690}, {"rating": 5.0, "stay_parameters": "Stayed February 2008", "text": "Having stayed at the argonaut in SF, We decided to try the Muse with our teenage daughter for English half term in feburary. Absolutely brilliant, yes a bit of noise from construction outside - nothing to be concerned out though,but the muse is a faultless small cosy hotel right in the Heart of New York.", "title": "Be AMused", "user": "Cactustoaster", "date": "February 26, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13865750, "likes": {"liked": "— Location and accomodation quality", "disliked": "— slight noise from constuction"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "Modernised spacious rooms and the Wine reception in the eve is a nice touch. If you shop around you can get a deal on it £150 /night and is exceptional value.", "title": "Great Service", "user": "BostonGolfer", "date": "February 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 13817912, "likes": {"liked": "— Service", "disliked": "— Small rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled solo", "text": "Just returned from a Theater mini-trip to New York. We will return to this boutique hotel, because of the service, which was terrific from check-in to check-out. Aubrey, the concierge was outstanding, and her recommendations were simply great. The rooms are a bit on the small side, but are nicely appointed and the gym, had top-of-the line Life Fitness machines, and was equally well-appointed.", "title": "Newly renovated 'It's safe to go back'", "user": "chrisd", "date": "February 22, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 13772826, "likes": {"liked": "— Bright, cheery rooms!"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "My travel companion and I had begun staying at The Muse when it opened. Over the years, the rooms and hallways had become drab and worn so we found other accomodations in NYC. After reading that they had renovated the rooms, I decided to give it another try. I was pleasantly surprised at the quality of the renovation. My guest room was bright, cheery and fairly elegant. The decor is somewhat neo-classic and modern. The only drawback for TV watchers (I am not one) was the lack of HD on the flat screen TV's. They have a note in the room that indicates they are working on getting HD into the rooms. Also, I did notice construction noise while I was dining in the restaurant in the morning but did not hear any construction noise while I was in my room. There are 2 banks of elevators in the hotel so the rooms are separated in two different areas. I stayed in one of the smaller rooms (queen bed) so you may want to check the room layouts prior to booking. There is a bar and an adjoining restaurant and the hotel is conveniently located in the Times Square area and the price seemed fair when compared to other hotels in the area.", "title": "Beautifully Renovated Rooms", "user": "amateurhistorian", "date": "February 22, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13763714, "likes": {"liked": "— The beautiful new rooms, access to Broadway", "disliked": "— Neighborhood construction noise -- a crack-of-dawn nusiance"}}, {"rating": 5.0, "title": "Muse Hotel", "text": "I have been a loyal patron of the Muse through its ups and downs, and I have to say the hotel has never looked better or been better managed. I was greeted with warmth and recognition at check-in and as a Kimpton loyalty member, upgraded at no charge to one of the beautiful, newly renovated rooms on the 16th floor.", "user": "deJ44", "date": "February 19, 2008", "id": 13681362}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The Muse is the third Kimpton hotel we have stayed in, and once again we were extremely pleased. The staff was very accommodating, friendly, and helpful. The room was perfect, from the cleanliness, to the decor, to the marble bathroom. The beds are very comfortable, just wish they were queen size instead of double as we had our two teenage kids with us. We had read some previous reviews which indicated that you can hear lots of noise from outside, so we brought our ear plugs. Good thing we did! From our room we definitely needed the ear plugs, but considering the great location of The Muse to Times Square, you definitely have to expect the noise outside. The Muse itself is a very quiet, safe, and classy hotel. We are so glad we stayed there. Can't wait to go back!", "title": "The Muse is Awesome", "helpfulness": 1, "user": "MRLAM", "date": "September 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 19677256, "likes": {"liked": "— Location, cleanliness, staff friendliness, daily wine reception", "disliked": "— Noise outside -- nothing to do with The Muse -- just be prepared"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Stayed at the Muse at the end of July for 3 nights, wow was very impress with the hotel. The room was very clean and big for New York. We were on the 14th floor, did not hear any noise . The beds are the best.", "title": "Loved the Muse", "helpfulness": 1, "user": "pcourte", "date": "September 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19668655, "likes": {"liked": "— everything"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The staff are all very nice and friendly.", "title": "Great deal and location", "helpfulness": 1, "user": "ptbooth", "date": "August 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19534007, "likes": {"liked": "— value, remodel, location", "disliked": "— no business center"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Loved the location so close to Time Square.Coffee in the morning downstairs is excellent, and bonus wine in the afternoon.", "title": "A ++ very nice, great service", "user": "tvanderhider1", "date": "August 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19446351, "likes": {"liked": "— Clean, Updated", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Will deffinitely return. Keep up the good work.", "title": "Meet the High Expectations", "user": "JosephL", "date": "August 26, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 19379022}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "There can be few better deals in Mid Town. The Muse won't be the cheapest hotel you'll find in NYC. It also won't be the biggest, nor will it have the most facilities. However, it's about ten seconds walk from Times Square making the location ideal - it's also a short walk from many major attractions. Beautifully appointed throughout, the rooms are spacious, well furnished and elegant without being overbearing. The bed was probably the most comfortable night's sleep I've ever had.", "title": "Almost Perfect", "user": "JRH482", "date": "May 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130566478}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled solo", "text": "Each day there was a free wine tasting in reception - a great start to the evening and perfect after a long day of sight seeing.", "title": "Very comfortable boutique hotel near Times Square", "user": "CarpeNox", "date": "May 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130531995}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "The team at reception were helpful, attentive and knowledgeble - making the stay a genuine pleasure.", "title": "Wonderful Staff and Experience!!!", "user": "Christina B", "date": "May 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130518495}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "I will 100% stay here again when I go back to New York.", "title": "The Muse was special", "helpfulness": 1, "user": "BellevueBetty", "date": "May 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 130306959}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The Muse in New York City is the third hotel in the Kimpton chain I have stayed at and they have all demonstrated high quality standards. The Muse is very convenient to Times Square and I stayed there for two nights while I had business there. The room was not large but made good use of its space. It was tastefully decorated and all supplies (bedding. toiletries, etc.) were of first quality. The staff were all professional without being unfriendly. It was expensive but that is what you have to pay in this location. I will definitely stay here again when visiting New York City.", "title": "small but does the job", "user": "Bet46", "date": "May 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 130280835}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "This was our second stay at the Muse and it is our favorite NYC hotel. The location in midtown is good for shopping and walking but it particularly great for going to the theater: being able to walk to and from avoids the hassle of cabs. The newly renovated restaurant, Nios, is adjacent to the lobby and is quite pricey for breakfast, but it is convenient. For a quick, take-out alternative, Times Square Bagels is just 2 blocks away and rivals H&H for quality. The room was big enough, the bed and bedding extremely comfortable, and the bathroom was also big enough (not always true in NY). We'd happily return to the Muse.", "title": "Terrific Location, Great Hotel", "user": "NCGlinda", "date": "May 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 30522654}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Very nice hotel, we were offered a complimentary glass of wine when we checked in, the room was nice and very well-decorated. Free internet in exchange for joining their rewards program, giant bathroom (some of the space could have been better used as part of the room but what can you do). Out the front door, turn left and you're in Times Square within a couple of minutes. Various pubs and restaurants all the way along the streeet. Friendly staff, great location, what more could you want? How about free parking? In New York, not likely. :-) They do offer valet parking but we parked in the lot right next door and saved $10.", "title": "Very cool, right next to Times Square", "helpfulness": 1, "user": "skud", "date": "May 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 30314712}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "My husband and I just returned from our first-ever visit to NYC. I did quite a bit of research before we left, including alot on where to STAY! We settled on Times Square for its mid-town location, and then went from there. I checked numerous hotel reviews of various chains on TA, but having been a guest of the Kimpton chain before (in DC), I checked to see what hotels they had in the area. The Muse Hotel sounded terrific. We got a terrific rate for a large suite (Room 1802) which had a door that shut off the bedroom from the \"sitting room\" area. Nice for couples like us when one or the other may retire to bed earlier than the other. The front desk staff (Cory in particular) and door staff was top notch, always offering friendly greetings and eager to help. Concierge service was good too, they helped us book a helicopter flight over Manhattan on Mother's Day (my gift idea for myself - and far more fun than brunch, haha--it was AMAZING!). Top all that off with LOCATION, LOCATION, LOCATION and this is the perfect place to stay! Just off Times Square, between 6th and 7th. We could see the lights of Times Square from our window. We will definitely return to NYC and will only stay at the Muse Hotel.", "title": "1st Trip to NYC--So Glad We Stayed at The Muse!", "user": "Andi-Rosevile", "date": "May 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29929523}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "I've been staying at The Muse on and off for several years, even prior to Kimpton's acquisition. All the rooms have been redone in the past two years, and they recently unveiled a completely renovated lobby and restaurant. My most recent stay was just last week.", "title": "Great boutique hotel - recently revamped", "user": "BobinBaltimore", "date": "May 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 29615579}, {"rating": 2.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "I am often greeted by name by front desk staff which is RARE in a city like NY. The rooms are generally spacious and well thought-out. The suites are generous and typically have two large flatscreens and a sizable bath. All hotel services I've used have been efficiently and pleasantly delivered. Food, which had been getting a bit long in the tooth, menu-wise with the old restaurant, The District, has recently been revitalized with the new restaurant, Nios. I've noticed that they even change/update the room service menu much more regularly than they used to. The have both wired and wifi internet, both are good, and are free with a Kimpton InTouch membership.", "title": "A 2 Star hotel at 4 Star Prices", "user": "liamoco43", "date": "May 7, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 29551712}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We stayed 7 nights and had a 10th floor room at the back of the hotel.", "title": "Good Muse!", "user": "NatGreen", "date": "October 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 2.0, "rooms": 5.0}, "id": 20633688, "likes": {"liked": "— Very high standards", "disliked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008", "text": "The room was of good size, with modern furnishings and art works. Bathroom facilities were good. We found the air conditioning effective but noisy.", "title": "Perfect", "user": "KateKnows", "date": "September 24, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20356196, "likes": {"liked": "— Style, location", "disliked": "— small room"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Staff were attentive and friendly and the room was serviced discreetly and efficiently.", "title": "We really liked it", "user": "MeganFlorida", "date": "September 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 20302261, "likes": {"liked": "— Location, large clean rooms", "disliked": "— Location"}}, {"rating": 1.0, "title": "Sucks", "text": "Stylish, 'theatre' themed, restaurant served good variety of breakfasts and offered a number of imaginative and well presented dishes in the evening, when a prix fixe pre-theatre menu was also offered. Restaurant prices are fairly high and portions are european rather than american.", "user": "ofiohoyo", "date": "September 19, 2008", "id": 20190522}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Principal downside - which is also,in one sense, an advantage - is its proximity to Times Square with all that that entails in terms of noise, crowds, litter and hassle; but, that's the way it is!", "title": "Another Great Kimpton Hotel", "user": "nvagirl1", "date": "September 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19923521, "likes": {"liked": "— Room size, location, staff friendliness", "disliked": "— Nothing, loved it!"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "I booked the Muse based on the reviews here and the fact that it was a Kimpton property. We've always had good luck with them in the past. Once again, the reservations process was a breeze. They bent whatever rule there is about grownups in a room and let me book adjoining rooms...a king for myself and my husband and a queen/queen for my two teenage boys. The rooms were lovely. The boys' room was enormous...particularly for a NYC room but even compared to standard rooms in other cities. I was concerned about street noise from experience with past visits and had requested rooms on a higher floor. I was dismayed to be assigned to the floor 12....right next to the elevators. You know what? No noise at all! Our adjoining rooms had an additional, lockable foyer door that blocked any and all noise from the hall and whatever street noise was completely blocked by high quality insulated windows. Very nice. Lovely linens. Comfy beds and a selection of pillows. Decent toiletries. Good lighting in the bathroom.... and so on. Our boys were disappointed with the fitness room, but if they didn't get enough exercise walking with us through the city that's not the end of the world. My only complaint was a problem with the electrical relay on our a/c system...it kept clicking as it turned on and off...even more noticible in the quiet room. I mentioned it upon checkout and I'm sure it's already been repaired. We'd rebook in a heartbeat.", "title": "Kimpton never fails", "helpfulness": 1, "user": "nrh", "date": "June 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 33015108}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "My husband and I travel to New York each summer and have tried some fine hotels. But the fact that the Muse was a Kimpton sealed the deal. They are always artistic and quirky. The Muse was elegant and gracious andwe have absolutely no complaints. We were allowed to use our room before noon, and the 9 PM happy hour was incredible.", "title": "Will Return", "user": "yachtchefKeyLargo", "date": "June 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33012940}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Everyone couldn't be nicer. Thank you, Trip Advisor and Kimpton hotels.", "title": "Great location and Price!", "user": "zeke3elevn", "date": "June 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 32615780}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "When planning our NYC trip, we were trying to find the most reasonable hotel near Times Square. This hotel is a stones throw away from the heart of Times Square! The staff was very friendly and courteous. We dropped off our luggage and had it locked up while we explored the city waiting for check in at 3 (We got there early in the morning). 4 Star hotel amenities, clean room, great view all around even if its not of Times Square and great price! The only complaint I can possibly even think of is that the rooms are small but with all things considered, I didn't mind whatsoever.", "title": "Great location...Great Hotel!", "user": "TRM1968", "date": "June 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32538298}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "Stayed at this hotel to celebrate my husband's 40th birthday and what a great choice. My husband wanted to stay near Times Square as we were seeing two shows but I didn't want to stay at any of the megahotels so I found this one on Tripadvisor. The hotel is located less than a city block off Times Square on W. 46th Street. I called a few days prior to our stay to request a room on the top floor (19) and they asked if we were coming in for a special occasion - when we got there, we were upgraded to a mini suite. The rooms are decorated in black, white, and grays - very modern. There were only 4 rooms on our floor and it was very quiet aside from the occasional police siren that you're going to hear in NYC. A small tray of cookies and bottled water were delivered to our room w/a welcome note - nice touch! We didn't take part in the wine tasting but saw people sitting in the bar/restaurant and it looked nice. Bathroom was spacious and everything was very clean. Only complaint was that we didn't find the room darkening shades for the windows until the 2nd night. Wishes someone had told us when we checked in that they are hidden in the top of the window shade. Front desk was friendly and helpful.", "title": "I almost don't want you to know about the Muse, it's that good!", "user": "j9999", "date": "June 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32485987}, {"rating": 5.0, "title": "Awesome !!!!!", "text": "I planned a night out for my wife's birthday including a play on Broadway. Originaly I booked a room on 42 St. After realizing it may be too far a walk from Hotel to play I cancelled and made a last minute reservation at the MUSE. Boy, am I glad I did. The Young lady behind the desk was very polite when I requested an early check-in. At 1:30 PM our room was ready, and not only the King room but they gave us the Executive Suite for the same price. I couldn't believe it. 2 rooms w/ 2 flat screen t.v.'s. When we arrived back from dinner, there was a bottle of champagne and cookies in our room. The only problem was our A.C. made so much noise that at 1:00 in the morning I had to get out of bed to fix the noise. If I ever stay overnight in Manhattan again, this is DEFINATELY the place to stay. Thank you for making it a great stay !!!!!!", "user": "joecool546", "date": "June 16, 2009", "id": 32451859}, {"rating": 5.0, "stay_parameters": "Stayed April 2009", "text": "I wanted a NYC hotel that wasn't too expensive, but was close to Times Square, clean, and had decent sized rooms. This hotel was it!! I found a great deal on Orbitz, and after reading other Trip Advisor reviews, I decided to go with The Muse. I was not disappointed. The room was HUGE! Huge room, huge bathroom, impeccably decorated, very clean...it was great. There were three of us in this room (me, a teenager, and an 8 year old) and we didn't feel crowded at all. Even though the building was obviously a little bit older, it had been updated and therefore it felt very plush inside. Other benefits included a nice lobby area (free wine reception every evening, but with two kids in tow we didn't partake), friendly service, robes, comfy beds, flat screen TV, and a great bell staff. The first night we noticed that something was wrong with the air conditioner in our room. The next morning I notified the front desk, and it was fixed by the time we came back from sightseeing. It was a 2-minute walk (or less) to the main bustle of Times Square, but being on a side street, we didn't notice the noise of it. It was nice to be a little bit removed from the action. There was a restaurant on site. Our first day there was free breakfast, so we ate there and it was very good. We didn't on the other days because we thought it was a little out of our budget. My only main complaint about The Muse is that it would've been handy to have a business center, or even just a computer with Internet access and a printer. We would've liked to have been able to have access to Internet and printing while we were there. Otherwise...perfect! No complaints!", "title": "Great location, top notch service!", "user": "cool_teacher590", "date": "June 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32398888}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "This hotel is right off of Times Square and is within walking distance to Central Park. Besides a GREAT location the customer service that we received was top notch. They were always asking if we needed directions/locations of places that we wanted to visit. They checked us in for our flights upon departure. They were always very courteous. The wine reception in the evening was always a treat. I left a dress in their baggage storage area that I had bought to wear on my first anniversary (which was 2 days after leaving NY to head back to NC) and they shipped it to my hotel where we were vacationing for our first anniversary! It arrived to our hotel in Savannah the morning of our anniversary! I am just so impressed by the outstanding customer service!", "title": "This Place is Awesome!", "user": "Luvmyhusband", "date": "June 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32204963}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "My husband and I spent three nights at Muse in April of 2009. The hotel was great, the staff were wonderful and friendly, and the location was wonderful. We stayed in a King room and had a front view of the street and a beautiful old church. It was very quite in our room with no noticeable street noise, the decor was awesome, and the bed was quite comfy. This hotel is fun, hip, and a perfect place to relax after a long day of sightseeing. It is also so close to Times Square which makes it easy to get almost anywhere in the city The complementary wine from 5-6 pm daily is such a welcome thing after running around the city all day. It is hard to choose a hotel in New York City, but I feel we lucked out and got one of the great ones!", "title": "Beautiful hotel, great location", "user": "robsalot", "date": "June 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32003702}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "A good hotel a 100 yards from Times Sq. Compementary coffee and tea in the lobby but its finished by 9-00am. The staff here are excellant and very helpfull. The rooms are quite spacious, but be warned if you get a room at the front of the hotel it's liable to be noisy at times in the early hours.", "title": "A very good hotel, just down the road from Times Square", "user": "colboy52", "date": "June 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 31424607}, {"rating": 4.0, "stay_parameters": "Stayed June 2005, traveled on business", "text": "Having lived in New York for a number of years we were delighted to find the Muse, a lovely intimate hotel where one does not have to compete with a never ending stream of guests, whether it be in the bar, restaurant or front desk. The rooms and common areas are comfortable, clean, modern and quiet (albeit dark). The beds and duvets are comfortable and quality soaps and music are provided. The staff is ready and able to assist. Room service is prompt, although elevators are not (allow a bit of extra time as they can be slow). Please know that we have stayed at the Muse on four separate occassions and quality remains consistently high. For those who travel for business it is near subways and it is easy enough to avoid Times Square. For those who travel to NYC for pleasure it is close to theaters and just off Times Square. The Muse provides a lovely respite after a busy day, whether professional or personal.", "title": "Lovely Intimate Hotel", "helpfulness": 6, "user": "ANGshire", "date": "July 25, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3700872}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "Just returned from 4 nights at The Muse and everything was perfect. Once you walk through the front door, it is impossible to believe you are only half a block from the noise and crowds of Times Square. Our king room (on the 14th floor) was large (more than enough space for 2 people) and quiet. There wasn't much of a view, but that wasn't why we were staying there. The room and spacious bathroom were spotlessly clean and tastefully decorated.", "title": "Spacious and Gracious", "helpfulness": 9, "user": "PaulaB", "date": "July 19, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3682923}, {"rating": 5.0, "title": "Love the Muse", "text": "Every member of the staff we met, from the front desk to housekeeping, was friendly and professional. When we returned from the theater every night, not only was the bed turned down, but the ice bucket was full and the towels were fresh.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "July 19, 2005", "id": 3681666}, {"rating": 3.0, "stay_parameters": "Stayed July 2005", "text": "If you're in NYC for the theater and museums (as we were) it is hard to imagine a better hotel. I signed up for the e-mail specials on the hotel web site and got a great rate.", "title": "Not worth the $$$...", "helpfulness": 6, "user": "spicedawg", "date": "July 18, 2005", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "service": 2.0}, "id": 3679605}, {"rating": 2.0, "title": "Livin' & Lovin' NYC", "text": "My daughter and I have stayed at the Muse three times, and I am surprised by some of the very negative comments posted by guests. Times Square is a very noisy area, so I think it is unrealistic to expect that a hotel located in the heart of the theatre district will be quiet, but I have not experienced an uncomfortable noise level during any of my stays. The location is wonderful for theatre and dining, and is convenient to the subway for other excursions. The bed is one of the most comfortable that I have slept on, the room is plenty large for two people (the last two times we also had a pull out couch in our room), and the bathroom is great...especially the Baudelaire soaps which we now use regularly at home. We did not like the bar (very pricey and unfriendly) and have not dined in the District. The staff is efficient and responsive. Since our focus when coming to New York is on seeing shows, the Muse continues to be our first choice for lodging.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "July 13, 2005", "id": 3662481}, {"rating": 2.0, "title": "How did it get ****?", "text": "We stayed at The Muse because of its proximity to Broadway Plays and from the recommendations given through this site. It is one half block from Times Square. We read all reviews and chose to remain positive about the hotel until we had actually experienced staying there. Well, now that we have spent seven nights there...here goes. Yes, it is a very small boutique hotel. The guests are extremely polite and quiet (no hall noise). The staff is polite and accommodating...housekeeping was especially helpful. Our room was located on the fourth floor fronting the street. Previous reviews complaining of excessive street noise were right on target. Luckily for us, I had packed our nifty \"sound soother\" to block out the banging of the garbage and delivery trucks so we had no tossing or turning or sleepless nights. Our room size was adequate but quite dark and dreary. Two days out of seven we had to telephone housekeeping to replace a light bulb in the same bedside lamp. Believe me, when one light goes out in the room, it makes a noticeable difference. A big negative for me was the quality of the bath towels delivered to our room. They were clean but terribly worn. In fact, one bath towel was so worn it had holes in it big enough for my hand to go through (Really!). However, once I brought this to the attention of housekeeping, they replaced the damaged towels. There is nightly bed linen turn-down service with complimentary Biscotti treats. There were two of us in the room but most nights only one Biscotti was left for the two of us to share. (NO big deal, but for $300 bucks a night you'd think each guest would receive a tiny Biscotti biscuit).", "helpfulness": 12, "user": "A TripAdvisor user", "date": "May 31, 2005", "id": 3513130}, {"rating": 5.0, "title": "Location..location..location!", "text": "Will we stay here again? No. There is a well-known four-five star hotel located directly on the corner of Broadway and 46th facing Times Square. We decided to walk over there and see what we could get for the same price we were paying at The Muse. The difference was unbelievable. The room size is twice that of The Muse (no more bruises from bumping into furnishings). All rooms at the competitor are spotlessly clean, light and airy, with no street noise (Of course, the rooms are located on higher floors). The staff was more than willing to let us do our impromptu comparison. When we return in December, we will be staying at the competing hotel.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "May 30, 2005", "id": 3511558}, {"rating": 5.0, "title": "what a pleasant surprise!!", "text": "If you're looking to be in the heart of NYC, this is the place to stay. The rooms are very clean and the hotel staff is very friendly. This botique hotel us definately a \"must stay.\" Strongly recommend! The bar is small and quaint but good for a drink. I can't wait to go back. There were three girls in the room and we had plenty of room!", "helpfulness": 9, "user": "keil38", "date": "May 29, 2005", "id": 3508428}, {"rating": 4.0, "title": "Nice hotel", "text": "My husband and I just got back from spending Memorial Weekend in NYC, staying at The Muse Hotel in Times Square. We live in upstate NY and travel to the city a lot, so I can safely say The Muse is the most comfortable, quiet hotel I have ever stayed in in NYC and has the most luxuriously large rooms (HUGE by NYC standards) I've ever experienced too. The staff was friendly and helpful, the bathrooms were gigantic (bigger then my one at home!), the bed had a pillow-top mattress and was very comfortable. We were on the \"backside\" of the bldg, off the street, and though I always travel with ear plugs, I didn't need them! It is walking distance to all the fabulous restaurants and Broadway theatres. We will definitely go there again, no question!", "helpfulness": 4, "user": "irishpipes", "date": "May 16, 2005", "id": 3477306}, {"rating": 5.0, "title": "The Muse - fantastic location", "text": "We stayed at the Muse on Times Square in April 2005. The location is good - right at Times Square. We walked to St. Pat's Cathedral, Fifth Avenue shopping, Central Park. We also walked to a Broadway show - no problem. Good casual dining across the street at Rosie O'Grady's Irish Pub. We didn't like the menu at the hotel restaurant - very swanky and pricey. The service was ok - we had to wait in line to check in but it was relatively painless. We ordered drinks from the bar one afternoon to take back to the room. $10 for the worst margarita I ever had. I couldn't even drink it. The room itself was very small but very nicely appointed. The decor is modern and very new. The bathroom was gorgeous and the soap was amazing. I know that sounds odd, but we took the unused portion of the bar of soap home with us - it was that good! It looked funky - I even joked to my husband that if we got hungry we could just eat the soap because it looked like food. It was green and looked like it had nuts or something in it. All I know is that it made my skin softer than ever. Enough about the soap. We got the NY Times everyday which was nice too. All in all I would say this is a nice hotel for couples or business travelers. Definitely not for families. We paid $250 a night for our room which I thought was high but I think by NY standards it was about right.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "May 6, 2005", "id": 3445349}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "I had booked this hotel for a girlfriend's weekend getaway and it was perfect. From being greeted at the door by name when we arrived and whenever we left and came back to the hotel (impressive!) to the friendly check in at the front desk and the room/hotel staff being accommodating with bringing us ice to chill wine, wine glasses, extra anything we needed to make our stay more comfortable - they were on top of it all. The room was more than comfortable, the beds were great, and the hotel was so quiet. This is one of my favorite hotels in NYC and I will try to stay here anytime I am back in the city.", "title": "Girls Weekend", "user": "jennifer L", "date": "May 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 130815165}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "We stayed for two nights at The Muse. We selected this hotel due to its proximity to Times Square and all theaters. We also needed two full beds, which are not that easy to find. The hotel has recently undergone a multi-million dollar upgrade. The room was large, the bathroom very large, and immaculate. Our bedding was comfortable and top shelf. We ordered room service for breakfast and the food was excellent.", "title": "Theater Weekend", "helpfulness": 1, "user": "donna m", "date": "May 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130701558}, {"rating": 5.0, "title": "Excellent hotel and location.", "text": "At the last minute we opted to buy additional theater tickets. The concierge, Sarah Rosenberg, was extremely helpful. We were able to purchase two orchestra seats for Friday evenings performance of The Best Man.", "user": "FatboyDevon", "date": "May 27, 2012", "id": 130681565}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "The location was perfect as we walked to two different theaters and restaurants with no trouble. I strongly recommend this hotel. It was a great value and extremely comfortable. They also offered free wine each evening and free coffee and tea each morning. We would definitely return.", "title": "Great Boutique Hotel and Ideal Location!", "helpfulness": 1, "user": "DrFtheTravelGuy", "date": "May 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 130602103}, {"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "We have just returned from a weeks holiday in New York, and stayed at the Muse. everything from our welcome to the location was great. Located just off Times Square it really was in an excellent position for site seeing. Our room was comfortable, if I had one gripe it would be the air conditioning unit was extremely loud - although we never mentioned this to the hotel, so it can't have bothered us that much!", "title": "Love it!", "user": "nwgirl70", "date": "May 25, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 130575010}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "stayed for business:", "title": "Good modern property, Executive suite is large", "user": "Tri N", "date": "May 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130175074}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Pros:", "title": "VERY Nice!", "user": "Benji S", "date": "May 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 130101571}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "- location, near times square, but fairly quiet rooms, (stayed on 16th)", "title": "Very nice place", "user": "Muffinhead2580", "date": "May 16, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 130032011}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "- modern fixtures, flat screens, furniture, windows, etc", "title": "Comfortable rooms, busy location", "helpfulness": 1, "user": "JackSD", "date": "May 15, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 130010618}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "- good bathroom amenities and service offerings, free shoe shines, bathroom kits, razor, toothpaste etc", "title": "1st Choice for New York", "helpfulness": 1, "user": "KeenHolidayFan", "date": "May 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129976998}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "My husband and I stayed four nights near the end of July of this year. Personally, I am not a fan of midtown Manhattan preferring the West Village or Chelsea but was very pleased by The Muse and wound up loving and appreciating its convenient midtown-west location. We booked early and got a great rate on a really lovely room. We arrived into NYC earlier than anticipated (noonish) and were permitted to check in to our room straight away without having to kill time while it was cleaned. The room decor was definitely above average and not hotelish looking, done in a sort of Hollywood Regency style. It was clean and neat. The bed was extremely comfortable. The hotel is very quiet inside and outside; no annoying loud folk in the hallways, etc that we experienced. Our room faced W 46th St (we were on 14th floor) and heard nothing from the street outside. Each evening the hotel hosts a wine tasting which was very nice. We did not eat at \"District,\" the restaurant located within, but found the Cranberry Grill located around the corner on W. 45th a great place to grab breakfast or lunch. Advise to steer clear of overpriced Europa Cafe at corner of W. 46th and 6th Ave (aka Ave of the Americas). Kept jewelry and Mac notebook in safe during stay -- all was secure. Lovely L'Occitane toiletries in room. Great. Will visit again.", "title": "Recommended Lovely Hotel Centrally Located", "helpfulness": 1, "user": "PattySoandSo", "date": "August 12, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 18880475, "likes": {"liked": "— Location of hotel; cleanliness and decor of room"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "We got a great rate through Travelocity and it was a great deal. The hotel was everything as advertised plus some. Great location, quiet, large room and bath, pleasant staff, helpful door men, free coffee, wine and newspaper each day. You can walk to most locations in Manhattan and if you are not walking, there are several subway stations close by. Very close to Times Square, Broadway plays, and restaurants. I would definitely suggest anyone that is visiting the city to give the Muse a consideration.", "title": "Great location and Hotel", "user": "Attkica", "date": "August 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 18860828, "likes": {"liked": "— Great location, the beds were also the best I ever had in a hotel", "disliked": "— No views to speak of"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Be very careful with your belongings when you stay at this hotel. There were four of us staying in this 2 bed room. We asked for a fold out bed as my two teenage sons did not want to sleep together, we were told no fold out bed. That's ok what could we do but put up wth it. Anyway we had $120 worth of goods taken from our room. I went down to the front desk told them, they said only housekeeper goes in room, they called security who informed me that he would look in to it. I said ok. Security told me only cleaner goes in room, I said ok then that person has either stolen out goods or thrown them away. Security could not find out anything. How stupid is the cleaner I ask you to ask yourself. Anyway because we could not prove we had the goods as the receipts were in the I LoVE NY bag which was taken. We were given back $80 in Australian money and not american. I said we paid for the goods on Visa but that did not make any difference. My advice DO NOT STAY AT THIS HOTEL. It was noisy as well. And they tried to charge us for goods taken out of the mini bar, which were not. It was there mistake. NEVER AGAIN", "title": "Don't stay here", "helpfulness": 1, "user": "unhappySydney", "date": "August 8, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 18733725, "likes": {"liked": "— the bed", "disliked": "— goods being stolen/taken"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "If you're looking for a sophisticated refuge from all the hurly-burly of Times Square, look no further. The Muse is a quiet (yet hardly sedate!) boutique hotel located one block from all the action. The hotel staff works overtime to ensure your unique needs are met from the moment you enter their lobby to the moment you leave.", "title": "A Great Choice In A Great Location", "user": "stevie8", "date": "August 5, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18647986, "likes": {"liked": "— Comfortable rooms, competent staff,", "disliked": "— Nothing!"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We were upgraded to a newly-renovated \"Executive King \" suite on the 16th floor, with decent views of Times Sq and dual-zoned temperature controls (a nice touch!) Other nice touches: L'Occitaine bath products, flat-screen HDTVs (one in our living area, the other in the bedroom) and an i-Home clock radio, allowing you to dock your i-pod and enjoy your own music.", "title": "Not to be Trusted", "helpfulness": 1, "user": "Debyshire", "date": "July 28, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 2.0, "location": 4.0, "service": 2.0, "rooms": 4.0}, "id": 18354708}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "I'm picky, and this hotel was fabulous. For the price, service, ameneties and location you can't go wrong. Booked this at lastminutetravel.com (formerly site 59) as a last minute romantic getaway from DC w/out our kids. For 900 bucks I got round trip shuttle service from DC on good flights and two nights at the Muse. Was a little nervous since we usually stay at Ritz Carlton, Four Seasons, Waldorf Astoria, you get the idea. Well . . . . the renovated rooms look exactly like the website and have new comfy beds, flat screen tvs, ipod docs, etc. Bathroom is typical marble similar to other high end hotels -- L'occitane toilettries. Rooms are very big for NYC -- nicer than Waldorf and others. Staff is very top notch, service oriented. Now, they have recently had some sort of liquor license problem which restricted liquor to the very back bar (instead of the lobby and restaurant -- I heard it was an issue with the distance from the church across the street). NOW, instead of just saying happy hour is now in the back bar for one hour they give you 4 coupons per room for wine good from 4 until 11. They were so apologetic that we couldn't drink in the lobby that they'd give anyone extra coupons who asked. It was silly. The wine was $12 + dollars a glass and they poured generously. Location says \"theatre district\" but 5th ave is just a short stroll -- we walked everywhere w/ the exception of the upper east side and the airport. Cannot say enough about this place -- okay no pool, small exercise facility -- and yes, a bit of construction in the back of the hotel which we never heard since we requested a front room --- What a deal. As a former reviewer said --- Start Spreading the Muse! I cannot wait to go back and my husband is now, two days later, staying in a sister Kimpton hotel for business. We are converts.", "title": "A Gem! Can't Say Enough!", "user": "tabarber99", "date": "March 19, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 14400141, "likes": {"liked": "— Service, cool vibe, comfy beds, and location, location, location.", "disliked": "— No coffee maker in room -- this makes me cranky."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Great hotel, great location and excellent, helpful staff. Clean, well-appointed rooms with good sized bathroom. Complimentary wine reception each evening between 5 and 6. Would definitely stay again and recommend to anyone. Try Continental.com for good rates.", "title": "Great hotel", "user": "cde14", "date": "March 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14113061, "likes": {"liked": "— everything", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We stayed at the Muse from June 8-11. We were on the 19th floor and it was so hot in NYC (100oF). The room was fantastic. The bed has a feather pillow bed cover, down pillows, and 250 ct linens. The air conditioning was cold and controllable. There is a flat screen TV, free WI-FI for Kimpton members, and a fridge full of food (got to pay for the stuff) if you want it. The bathroom was clean with Occidental products. There is a fantastic make-up mirror too. The room was quiet except at 7 am when the garbage trucks and construction started. Lastly, we had a great view of Times Square, which could be blocked out with the shades and blinds. The hotel is in the theatre district and convenient to the Metro. The staff was great, arranged car services for us, etc. We would stay there again.", "title": "Great bed!!!", "user": "MarianaG", "date": "June 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 16884571, "likes": {"liked": "— The attention to detail and location", "disliked": "— Noise in morning and no breakfast included"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008", "text": "I am the guy that travels all over the world to many different cities and countries, and after all that travelling you get sick of Marriots and Hiltons, where the only lasting impression you get is that you are the same as everyone else...", "title": "Finally!!!!", "helpfulness": 1, "user": "JamieLansdell", "date": "June 5, 2008", "detail_rating": {"value": 5.0}, "id": 16691723}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "and this is the feeling i have had at every hotel in New York during my 18 or so previous visits, but i have to say I LOVED THIS HOTEL!", "title": "A quieter Times Square Hotel", "helpfulness": 1, "user": "LondonBagpuss", "date": "June 3, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 2.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 16631576, "likes": {"liked": "— lovely rooms", "disliked": "— noise"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "from the moment i pulled up, i sat down, no rooms ready, no problems, have an upgrade", "title": "Fantastic Hotel and Location", "user": "baseballgoonies", "date": "May 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16446763, "likes": {"liked": "— Everything", "disliked": "— It was all wonderful!"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "the rooms were smart and sophisticated", "title": "Run run far away!!!", "user": "Debmiester", "date": "May 27, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 3.0, "rooms": 3.0}, "id": 16433129, "likes": {"liked": "— Wilmore at the Bell Station", "disliked": "— The nonchalant attitude of the desk when presented with problems"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "My wife and I, along with the two kids (16 & 13), just returned from a M-F stay in NYC at the Muse. We were very happy with everything from the second we walked in until the moment we left when they helped us with a cab ride to Newark. Melissa, at the front desk, spent a lot of time helping us with dinner plans and directions. What a sweet person! The room as great too. Plenty of towels, very cozy beds, etc. The location is great . We could see Broadway from our window (about a 1/2 block away). If I end up in NY again, I'll be making reservations at the Muse! Thanks for a great stay! Stan & Kim", "title": "What a Great Place & Friendly Staff...", "user": "ping83", "date": "April 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15009099, "likes": {"liked": "— friendly staff, location, price."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "After a warm greeting from Willie, the baritone-voiced doorman, we walked in to the beautiful swirls and artwork on the ceiling of the lobby. The lush curtains and chase lounge chairs add to warmth and charm of this not so tiny boutique hotel in the heart of bustling Manhatten. We were then welcomed by one of the lovely front desk personnel who quickly pull up our reservation, processed our keys, and paperwork....all while sitting in the warm red velvet chairs.", "title": "Brilliant experience and wonderful staff.", "user": "Sartorialist", "date": "March 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14692955, "likes": {"liked": "— Brilliant Service", "disliked": "— Nothing really!"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Our 15th floor balcony room was gorgeous and very spacious for NYC. Black contrasting with white decor exuded the feeling of elegance. The bathroom was like that of a Roman Bath House. We had a gargantuan spa bathtub for two that would sooth away any traveler's worries. The duel head shower was a first for us in any hotel.", "title": "Not up to par....", "user": "ArkansasSmf", "date": "March 19, 2008", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 14400961}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "Room was available very early 12 and we were not forced to wait. The room was clean and there was a bucket of ice awaiting our arrival that remained full and frozen for the duration of our stay. Have real neat herbal soaps and lotions in room.", "title": "Pretty Cool", "helpfulness": 6, "user": "colecole2", "date": "July 6, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 3639702}, {"rating": 3.0, "stay_parameters": "Stayed June 2005", "text": "From the reviews, I was expecting a large room and I really was not impressed by it's size. I found it bigger than other boutiques that I have stayed at in the city but it was not larger than typical hotel rooms that I have stayed at. Location is off of side street which means it is quieter during the evening but it is only seconds away from everything-- trains, Times Square, Madison avenue, food. The name of the street that it is on was called Little Brazil!", "title": "Nice but a rather cool front desk", "helpfulness": 2, "user": "greenridge", "date": "July 4, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3635278}, {"rating": 3.0, "title": "somewhere in the middle", "text": "A GREAT RESOURCE WAS ------ to locate a parking garage instead of using pricey hotel parking.", "user": "A TripAdvisor user", "date": "June 29, 2005", "id": 3621546}, {"rating": 4.0, "title": "Anticipatory Service is Evident", "text": "We arrived at two am for check-in due to a late flight arrival. We found the front desk people rather uniformly cool and not eager to help. From time to time the bell staff was more friendly. Our room was on an airwell but well appointed and comfortable and quiet. We thought perhaps we got the lowest quality due to the fact that we booked via Hotwire. But I can't say that the rate we got was a knockout value.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "June 27, 2005", "id": 3615203}, {"rating": 5.0, "title": "Great Boutique Hotel in Great Location", "text": "We would never stay in the Times Square area again. The hotel WAS an oasis in that sea of tourists and sewage smells.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "June 27, 2005", "id": 3614530}, {"rating": 3.0, "stay_parameters": "Stayed June 2005", "text": "The Muse was a nice hotel in the center of the theater district...in walking distance to most theaters. It was overall very nice. Very nice bed linens, comforatable bed, and nice bath towels (on the contrary to what other reviewers say). We also got a very nice price from hotwire.com on the hotel. However, it really isn't a 4 star hotel, like they claim to be on expedia. It is more like a 3 or 3.5. It just doesn't have that extra something to push it up to 4 star.", "title": "Nice hotel in Theater district", "helpfulness": 2, "user": "sacbee123", "date": "June 20, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3583536}, {"rating": 2.0, "title": "If they just cleaned it up a bit and took a shoppi trip to a bed and bath shop", "text": "I wanted to like the Muse..The staff was not friendly and the bed and bath linens were very old and the room was not very cleanunder the bed was very dirty!. There was a urine smell in front of the hotel. It is a GREAT location but bring earpluggs if you are not used to city noise. It would be a good thing to just have them in the room for guests!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "June 14, 2005", "id": 3551411}, {"rating": 5.0, "title": "Made to feel special from the get-go", "text": "When the first words you hear when you enter a hotel are, \"We have upgraded you to the executive suite\" you know you are in for a great stay. This contemporary hotel is 1/2 block from Times Square, but out of reach of the maddening crowds that prowl the street. The rooms are quiet and refined. The comforters were some of the nicest I have seen. Even the soap was first class. A very nice touch is that they don't have a formal check in counter. Rather you are greeted by two concierges seated at their desks, ready to help you. There wasn't a request they couldn't handle. When we return for our next theater weekend, The Muse will be at the top of the list of hotels we would consider.", "helpfulness": 5, "user": "SportsTraveler", "date": "June 6, 2005", "id": 3534198}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "Our 14 yr old daughter and I just returned from a delightful 72 hour \"Power Shopping\" trip to NYC to celebrate her graduation from middle school. We had a blast and The Muse Hotel made things even better. Reggie, the bellman directed us to the Red Flame Grill a quick few blocks away (44th @ 6th) for a yummy breakfast of belgian waffles. It's a busy diner with very reasonable prices.", "title": "No Complaints- Great Little Hotel just off Times Square", "helpfulness": 7, "user": "bjjzmom", "date": "June 6, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3533778}, {"rating": 4.0, "title": "A good experience. . .", "text": "As previously noted, the hotel is right off Times Square on 46th. Obviously, a great location if you want to take in the touristy sights or enjoy Broadway or drop off the many packages from shopping 5th to SoHo. We stayed in Rm #1204 (Deluxe King) booked off of Hotels. No noise. No problems with the room or towels. Comfy bed, fluffy pillows and sizeable marble bath. The rate was only $249 and literally booked the day before we checked in. We felt safe and very well serviced. There was a minor snafu when the hotel charged us again for the prepaid room, but it was quickly rectified with a plethora of apologies.", "helpfulness": 4, "user": "worldtravellerNYC", "date": "June 2, 2005", "id": 3522046}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Great hotel, great location 1/2 block from Times Square. Small, 200-room mod & chic hotel. Recently re-done, new carpet. Room was absolutely enormous for a NY hotel. Terrific bed & pillows.", "title": "Great Hotel!", "user": "texashappygal", "date": "June 17, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17002346, "likes": {"liked": "— Cleanliness, Bed, Location", "disliked": "— Bad advice on where to go after theater for appetizers (Ava's Penthouse, was a loud 20-something BAR)"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008", "text": "Free wine happy hour every night from 5-7.", "title": "Great hotel, but be warned....", "helpfulness": 4, "user": "aanLondonUk", "date": "June 15, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 16935153}, {"rating": 5.0, "title": "The Muse Hotel New York City", "text": "Stayed here for two nights in April on honeymoon the hotel was wonderful small and very very good customer service.The room was smaller than we are use to but we were in New York th erooms were clean modern and had loads of lighting with a well equiped bathroom and nice soaps etc. Highly recomend excellent cocktails and also a wine and champagne reception free at 5pm cant beat it ...Would def stay again", "user": "BLINGSTER", "date": "May 7, 2009", "id": 29526628}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "My husband and I met friends for a weekend in New York. I am a big fan of Kimpton hotels and the Muse is no exception. A great, boutique hotel. The room, while not large, was big enough since we weren't spending much time in our room. Every single staff person we encountered was friendly and helpful. Even fellow guests on the elevator were friendly which is somewhat unusual for New York. We appreciated that the hotel was \"green.\" Our room was very quiet--no street noise.", "title": "I love the Muse Hotel", "user": "NancyProvidence_RI", "date": "May 4, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 29343899}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled solo", "text": "Didn't know what to expect when I got a great deal trhough AAA for The Muse, but when I got there I was more than satisfied. The check-in was quick and courteous. The room was clean and somewhat spacious for New York. I wanted to go running, so they even had a small jogging map to take me through Central Park and back. Nevermind that the hotel was mere 100 yards to Times Square. I'll be back.", "title": "Pleasantly surprised", "user": "MissionBoom", "date": "May 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29231768}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We stayed 9 nights at the Muse Hotel. This boutique style hotel is located just off Broadway, about a 2 minute walk from Times Square. A very funky foyer greets you as you enter the hotel. A video projected fire over fake logs create the fireplace, electronic video art and a bar/restaurant located just of reception. We stayed on the 15th floor, the only floor to offer larger rooms with a HUGE balcony. Decor is clean, funky and modern. Bathroom, while updated, still feels old if you look beyond the nice fittings. Limited room service but of a extraordinarily high-quality; coming form the kitchen of the hotels restaurant Nios. Free morning coffee and nightly wine tastings are a nice touch. Central to all Midtown has to offer the Muse Hotel is for those who enjoy the smaller, intimate style hotels.", "title": "Great Broadway Boutique Hotel.", "helpfulness": 1, "user": "dazman69", "date": "May 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 29212996}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We arrived early evening from the airport and were helped inside with our bags by a very helpful porter - check in was very efficient. The beds are very comfortable indeed, so much so that we nearly didn't make it out for sightseeing! Rooms are very well appointed and for the price we paid were very high quality.", "title": "Well located, great staff and very comfortable beds", "user": "mikeguk", "date": "April 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 28807892}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We saw a great deal through SniqueAway and decided to take advantage of it. We went with a King Premier room. This is a beautiful boutique hotel, very close to Times Square. The bell staff and front desk staff were extremely friendly and accommodating. This is a pet-friendly hotel, and there were a couple of nice doggies asleep behind the front desk. In addition, there was a \"welcome\" bowl of dog food in the front entryway, awaiting some canine guests who were due to arrive. Our room was gorgeous - exactly as pictured on their website, and quite large for a hotel room in New York City. The furnishings are modern, everything very clean, the king bed nice and comfy. The shower was powerful! Really powerful! They had free WiFi in the room, which was a nice plus. There was also the all-important safe for storing valuables that we didn't want to take with us. The only thing missing was a coffee maker, but we requested one, and had one brought to our room within minutes. The hotel location was excellent - just a minute's walk to Times Square. And 2 blocks down W. 46th Street is \"Restaurant Row,\" a wonderful area with a vast variety of restaurants. All in all, a lovely hotel in a great area. Highly recommended.", "title": "Beautiful hotel", "user": "Emm781", "date": "May 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130974418}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Great Location, Spacious rooms, courteous staff. Can't wait to go back", "title": "AWESOME!", "user": "Dbeachlover", "date": "May 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130946257}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "From checking in to checking out Marc was our guy. He provided us with all the information we needed. Not only did he do what a concierge does, he provided me with collar stays when I told him I left mine behind and I was late for my nephews wedding! When planning my next trip to NYC I will inquire as to make sure Marc is still there and book my trip with confidence. Thank you Marc.", "title": "Marc Camacho the concierge was the best!", "user": "leefenno", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130905016}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Room was very clean and comfortable. They complimented us with champagne and a cheese tray for our 30th wedding anniversary. Very close to times square. Nice lobby that compliments you with coffee in the morning and a wine tasting in the early evening.", "title": "Nice boutique hotel", "user": "Jeffriesgirl", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 130856164}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "Beautiful, spotless, roomy! This hotel is 1/2 block from Times Square. Close to the subway. Some reviews I read complained about the noise from a construction elevator outside. It never woke me or my son up. There were earplugs in the room just in case. Everything about this hotel exceeded my expectations!", "title": "Fabulous!", "helpfulness": 1, "user": "Care8875", "date": "May 28, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 130825014}, {"rating": 5.0, "title": "Lovely Hotel, Great Front Desk Service", "text": "This is a lovely hotel, right in the heart of Broadway, close to all the action, near the theater district, close to restaurants, subways, and more! The rooms are superbly decorated and well appointed. The bathrooms are very spacious and well done with comfortable showers and tubs and marble sinks and countertops. The lighting and sound systems in the rooms are very nicely done. Ask for a higher level floor to avoid noise from the street level below. We checked into our room and found the sit down at a desk check in system to be personal and friendly. While we were staying there we needed to do several business items of a personal nature and the front desk staff helped us arrange each of these trips individually. They sat down with us \"at the desk\" and looked up the information, helping us book cars, drivers, or public transport, making reservations for us, getting information and all sorts of other 'hand on' tasks that went well beyond the normal service you would receive at other 'big' hotels. Our only complaint is that the housekeeping staff never seemed to arrive at a timely hour. We would often wait until well after 2 p.m. for our maid to come to the room. We would go out and come back several times during the morning, only to return to find the room unmade and the maid no where to be found. We complained several times over the course of several days to the front desk. They would try to be helpful and hurry the maid along but it didn't seem to help expedite our particular maid on our particular floor. Otherwise, it is a great hotel.", "user": "andrewjv", "date": "July 28, 2008", "id": 18333577}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "We had a great stay because:", "title": "Great Hotel", "user": "CharlottesvilleVA", "date": "July 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18276861, "likes": {"liked": "— Clean, comfortable, attractive room at a reasonable price", "disliked": "— Too expensive for me without the discount"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled solo", "text": "- excellent staff", "title": "great little hotel near Time Square", "user": "uxj", "date": "July 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 18107902, "likes": {"liked": "— great style, relaxed atmosphere in great location"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "- great location (metro & theaters were close)", "title": "Good Boutique Hotel IF you get a decent rate and can find a quiet room", "helpfulness": 1, "user": "Canadianknowitall", "date": "July 2, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 17459522, "likes": {"liked": "— The wine hour in the lobby and the bathroom", "disliked": "— The lack of soundproofing to the outside"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "- clean, roomy, comfortable rooms", "title": "Location, location, location absolutley perfect.", "user": "McBee24", "date": "June 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 17339954, "likes": {"liked": "— The bathroom", "disliked": "— Nothing. Everythin was terrific."}}], "location": {"country": "United States", "city": "New York City"}, "stars": 4, "variance": {"poor": 56, "average": 99, "very good": 485, "terrible": 22, "excellent": 1119}, "aka": "Kimpton New York City", "slim_ranking": 0.0497737556561, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Beautifully renovated, The Muse Hotel New York is a serene, stylish sanctuary centered in midtown Manhattan. With top-notch service, exquisite amenities and luxurious comfort, each spacious guestroom is a sophisticated, artful inspiration. Housed in New York City’s theater district in the historic Leavitt Building, adjacent to NIOS restaurant and wine bar, this boutique hotel is within easy walking distance of Times Square, Rockefeller Center, the New York Public Library and the Museum of Modern Art."}