{"user_rating": 4.5, "review_count": 301, "name": "The Marker Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "Weekend break - bit of a walk into Temple Bar here, but it is a great location. Staff all courteous and well trained, service was great, and food was fantastic in the restaurant, as you'd expect from a 5* hotel. Don't go to the Marker for a cheap weekend away - its not a criticism in any way as that is not what this type of hotel caters for ... you gte exactly what you pay for in my opinion.", "title": "Great place to stay", "helpfulness": 1, "user": "Michael M", "date": "November 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 185046143}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Didn't get a chance to check out the spa and pool ...this time around!!! ... but will be back again.", "title": "Only average", "helpfulness": 2, "user": "34AliceL", "date": "November 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 184976634}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "We stayed at The Marker Hotel Nov, 16th. We booked late in the week and with a rugby match in town we payed what I consider 'a lot' for bed and breakfast. €309. Check in is after 3pm so if you're staying for one night this is pretty late. We were on a night away in town away from the early starts one has with children. However, our room was at the end of a corridor and right beside a large extractor fan which kicked into action at approx 6am. Our sleep was interrupted and our sleep-in well and truly over. At check out we made our feelings known and at first were told that maintenance would be made aware of the issue with the noise (brush off in my opinion, maintenance will never be able to do anything about that noise, it is what it is and might I add the receptionist knew exactly what we were referring to when we told her our room number). At this I added that this wasn't acceptable when you pay this type of money for a night away of uninterrupted sleep. She then went to discuss it with her manager whose response was to give us a refund on two glasses of wine we had had with lunch and the tip totalling €18.50. I can tell you my nights sleep was worth a lot more to me than €18.50. I made no further complaint as I considered this an insult. I feel totally ripped off and insulted.", "title": "Modern and luxurious hotel", "helpfulness": 1, "user": "adrienf11", "date": "November 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 184948671}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "On the positive side, the staff were very helpful and friendly in general, the bed was comfortable but with all the hoo ha about this place I felt it was just average. Very disappointing, Won't be back.", "title": "the market hotel", "user": "frances1983255", "date": "November 14, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0}, "id": 184718237}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "The staff are very friendly and helpful throughout all areas of the hotel which is a big plus.", "title": "Thoroughly modern, great location, just one slight irritation......", "helpfulness": 1, "user": "Minnie12359", "date": "November 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 184617784}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "I stayed at the marker in late November for a couple of days whilst at a conference at the convention centre.", "title": "Marker Hotel - no complaints", "user": "AndyB1999", "date": "November 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 185788696}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "I arrived early at the hotel 10.45am, but my room was already available for me and the receptionist gave me a choice of floors.. i stayed in a Deluxe room, right next to the lift, but the sound proofing was great and couldn't hear any noise from my room.", "title": "Gets better and better....", "user": "countrybumkin", "date": "November 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 185768701}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "The deluxe room was lovely with all the amenities you'd expect..although there seemed no facility for on demand movies in the room..", "title": "Out Standing", "helpfulness": 1, "user": "KilkennySean", "date": "November 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 185570919}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "The hotel is a 15 minute walk from the centre, and i didn't find the area 'rough' as previous reviewers had mentioned.", "title": "Impecable!", "user": "Trev B", "date": "November 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 185440878}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "The staff were faultless.. polite and courteous ..", "title": "The Marker - Dublin", "user": "simmkat", "date": "November 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 185412338}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "We stayed in The Marker Hotel this weekend as we're going to the Ireland v Samoa rugby match. The hotel is superb, great service from friendly, professional staff and such stylish , modern decor. The rooftop bar, with views all over Dublin and the bay is wonderful and they give you blankets to ward off the chill if you opt to sit outside. We were there for early evening drinks. The final, lovely touch was 2 bottles of water placed in the car for our journey home by the valet parking service.", "title": "Wonderful weekend break", "helpfulness": 1, "user": "Christine C", "date": "November 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 184284420}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "My husband and I have just spent the weekend here - what a fantastic hotel!! The room was wonderful, bathroom big (with heated floor!), turndown service and the best hotel bed I have EVER slept in! Staff were brilliant, food was fabulous (bar food and taster bites in the rooftop bar), the rooftop bar was a wonderful addition. The spa?....lovely, pool at perfect temperature. I loved every second of staying here, and I cant wait to go back!", "title": "Wow - what a find!!", "helpfulness": 2, "user": "MelanieNic", "date": "November 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 184281982}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "The Marker was a bit of a surprise. Somehow this hotel has managed to take the service standards associated with Asia Pacific properties, and deliver them in Dublin.", "title": "Great stay in a welcoming city", "helpfulness": 1, "user": "Andrew P", "date": "November 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 184184340}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "On checking in, my split stay was combined so that I did not have to check out - I'd had to extend by a night and done that online.", "title": "Very good hotel - Staff and Facilities", "user": "JoCedaro", "date": "November 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183893283}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "The room was well furnished, had good tea and coffee, a wifi dedicated to the room (that was fast and free) and I could link my iPad to the TV over wifi without an apple TV.", "title": "Excellent!", "user": "anelizps", "date": "November 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183840027}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "Absolutely delicious from start to finish, although perhaps Im too much of a wimp to appreciate the Bloody Marys (Bellinis were gorgeous). We had a lovely mixture of dishes on the table, from pancakes to wings and ribs and pulled pork sandwich. I love the idea of brunch/breakfast/lunch dining. There is something for everyone and such a high standard. See if you can get the snug around the corner, mega comfy table!", "title": "Le Drunch, my new favourite category of food", "user": "RachWade81", "date": "November 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 185410508}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Recently stayed at the Marker Hotel, have to say, they certainly are on hand to see to your every need: from the guys at the door waiting to park your car and take your bags to the room for you. Reception was efficient and speedy. The room was generous in size, TV was great, bathroom was amazing, massive bath and separate walk in shower, plenty of big soft towels too with great toiletries. Spa facilities were great All in all a luxury hotel with everything you could wish for. And yet if I return to Dublin I wouldn't stay here again, too far out of centre of town and really don't need to pay this high amount to get a perfectly good hotel closer to the centre. A bit too perfect and not enough spirit of friendly Irish welcome.", "title": "Five star luxury", "user": "Kate_McC", "date": "November 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 185406641}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "This hotel is everything you'd expect from a 5 star hotel and more. There is very little to fault here, if anything at all! From being greeted by a smiling doorman on arrival, to taking in the magnificent features of the lobby/bar area, our trip was definitely off to a good start.", "title": "Theatre weekend away", "user": "Gemma C", "date": "November 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 185343600}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled solo", "text": "The staff are so highly trained in customer service its almost hard to imagine. Check-in was very smooth. We checked in at 11 knowing it was too early to go to the room but our bags were taken and we were told they would be waiting for us in our room as soon as it was ready. Just over an hour later we got a phonecall to say our room was ready. Wow, the room was very modern with a big bed, bathroom and plush carpets. It was immaculate and the standard of finish that housekeeping adhered to was extremely high.", "title": "Lovely Modern Hotel", "user": "Ewhldn", "date": "November 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 185172598}, {"rating": 3.0, "title": "A bit disappointing ", "text": "Pool and spa area are fabulous, peaceful and calm, and they offer free refreshments and beverages.", "user": "Jonny O", "date": "November 18, 2013", "id": 185135741}], "location": {"country": "Ireland", "continent": "Europe"}, "stars": 5, "variance": {"poor": 9, "average": 17, "very good": 70, "terrible": 7, "excellent": 198}, "slim_ranking": 0.0782122905028, "description": "Extraordinary, surprising and luxurious, the Marker Hotel is the perfect urban retreat for those who crave the unconventional, yet still expect the exceptional standards of service that are the signature of a member of The Leading Hotels of the World®. One of Dublin’s most visually arresting landmarks, the Marker Hotel offers a distinct blend of urban style and luxury. Located right in the heart of the Docklands, Dublin’s most prolific cultural hub, it’s the perfect base from which to explore our capital city. The hotel features a ground floor bar and restaurant as its centre piece, with 187 guest rooms over six floors. It will also feature a Rooftop Lounge, a striking space overlooking Dublin city, which blends indoor and outdoor areas the perfect space to enjoy lunch, cocktails and dinner. The Marker’s spa features four spacious treatment rooms with a designated relaxation area and a 23 metre infinity pool. Further amenities include a jacuzzi, sauna, steam room and fitness suite. The Marker’s Conference and events facilities will contain nine adaptable spaces with capacities ranging from 20-250 guests."}