{"user_rating": 3.0, "review_count": 26, "name": "The Red Rose", "reviews": [{"rating": 3.0, "title": "Decent room in Rome for the price", "text": "We found this place on www.cross-pollinate.com, a handy website for booking private rooms in Italy. Anna Rosa's was average at best, but I felt like we got what we paid for.", "user": "ZKDDS", "date": "February 4, 2008", "id": 13271637}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We rented a 2 bedroom apartment with a private bathroom for 150 Euros per room. Not bad considering how expensive rooms are in Rome, and the place was decent enough. Everything was old, but clean.", "title": "There must be better places", "helpfulness": 3, "user": "Kim H", "date": "January 6, 2008", "detail_rating": {"front_desk": 2.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 12378526, "likes": {"liked": "— Relatively easy to find", "disliked": "— The bathroom, the smoke, the loud music from club below"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We probably could have stayed at a nicer place for a little more, but we liked to location of the place. It's within walking distance of the Colisseum and Forum, and there was a Metro station very close by.", "title": "Handy but noisy", "helpfulness": 1, "user": "Viscountess", "date": "November 9, 2007", "detail_rating": {"cleanliness": 3.0, "location": 5.0, "value": 2.0, "rooms": 3.0}, "id": 10719694, "likes": {"liked": "— Proximity to metro and Forum area", "disliked": "— Poor breakfast and noisy location"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007", "text": "I booked this B&B based on some good reviews and the fact that it seemed good value for money - it wasn't worth the money saved.", "title": "Not advised", "helpfulness": 1, "user": "121231234", "date": "September 19, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 8768726}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Firstly, on arrival we were engulfed in smoke. The owner and her friend were in the kitchen smoking. As non-smokers, you generally don't like to have where you eat breakfast to be filled with smoke.", "title": "Cute B&B, good value", "helpfulness": 1, "user": "justgottaseeit", "date": "September 25, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5835682, "likes": {"liked": "— The location and friendly service", "disliked": "— I liked pretty much everything."}}, {"rating": 5.0, "title": "Fantastic Place!", "text": "We spent 6 nights at the Red Rose B&B in Rome and the experience was wonderful! The owner was very friendly and helpful. She spoke little English but tried her best to communicate with us. Although the breakfast was humble, she's very generous with the amount. The rooms were clean and the location's very convenient. Just 5 mins walk to cavour station. It may be more convenient to stay near termini but red rose's in the safer neighbourhood. We (2 gals) returned at 10pm on most days and had no problem walking from the station to our B&B.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "January 15, 2005", "id": 3008861}, {"rating": 5.0, "title": "A Peaceful Haven in a Hectic City", "text": "We spent three nights at the Red Rose late in October. It was an all around great experience. Very comfortable, quiet and the location couldn't be better. AnnaRosa and her sister were wonderful hostesses and provided good tips on where to eat in Rome. It was a perfect way to end our month in Italy. Will go back to the Red Rose for sure.", "helpfulness": 2, "user": "Ozzie", "date": "November 5, 2004", "id": 2809402}, {"rating": 4.0, "stay_parameters": "Stayed July 2001", "text": "We stayed at The Red Rose on our first trip to Rome in 2001 and will be returning there in May. The accomodations were great for the price. Our hostess was very hospitable and helpful although she spoke little English. Since there were few reviews here I just wanted to tell of a wonderful surprise we got while staying there. We stayed in the double room with en suite bath. The room was large and very private. The best part was being awakened each morning by the singing/chanting coming from the monastery across the alleyway from our window. It was very low and not enough to disturb your sleep but upon waking, you could hear it. It was one of the most amazing parts of our trip.", "title": "Wonderful Surprise", "helpfulness": 3, "user": "Dejais", "date": "October 29, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 3.0}, "id": 2794123}, {"rating": 4.0, "title": "Lovely place", "text": "Very friendly people. They understand quite a bit of English too. Room was quiet(a rare finding in Rome) and very well maintained. We had to share the bathroom with another family, but apprantly it was not that big a problem considering the price you are paying. The location is awesome... walking distance from termini station as well as most of the attractions(close to Colloseum and Forum).", "helpfulness": 8, "user": "A TripAdvisor user", "date": "September 6, 2004", "id": 2515436}, {"rating": 2.0, "stay_parameters": "Stayed June 2005", "text": "Don't believe the pictures on the website. The owner apparently rents several apartments in Rome under the Red Rose B&B name. We had 2 reservations for the same Red Rose B&B, but we stayed in two different apartments.", "title": "don't believe the pictures", "helpfulness": 3, "user": "az-hokie", "date": "June 7, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 3538202}, {"rating": 3.0, "title": "Not anything to brag about", "text": "The first apartment was fine, but drab and very noisy due to traffic. The air conditioning unit in our room was not even connected. The second apartment was much better. It was bigger, better decorated, and more quiet. But neither apartment matched the pictures on the website.", "helpfulness": 1, "user": "MNTravel_couple", "date": "May 13, 2005", "id": 3470663}, {"rating": 1.0, "stay_parameters": "Stayed April 2005", "text": "If the website had accurate pictures of the apartments, I would not complain. The price was very economical. Both apartments seemed to be clean. However, I am annoyed that the website pictures misrepresented the apartment.", "title": "Avoid at all cost", "helpfulness": 4, "user": "HoneyBee26", "date": "April 29, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 3423535}, {"rating": 3.0, "stay_parameters": "Stayed April 2005", "text": "Our experience at the Red Rose was OK. It is nothing I would write home about and nothing I will remember in years to come. The decor was definitely that of an older woman's taste. The kitchen and hallway smelled smoky-appeared stronger after the cleaning woman came. The owner briskly brought us to our room and then we never saw her again for the 3 days of our stay. Breakfast consisted of bread, juice, and coffee, nothing special, but at least it was something to eat. The bed was comfy, the bathroom was clean, it seemed like a relatively safe environment, and it was convenient to the sights and the train station. I probably wouldn't recommend staying here though...you could find better.", "title": "You get what you pay for", "helpfulness": 2, "user": "suethetraveler", "date": "April 23, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 2.0}, "id": 3400443}, {"rating": 2.0, "stay_parameters": "Stayed April 2005", "text": "After visiting the Red rose b&b website and seeing the pictures of the beautiful rooms, I booked a 3 night stay as a birthday present for my boyfriend.", "title": "Not such a rose", "helpfulness": 1, "user": "RobinaCarina", "date": "April 21, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 1.0}, "id": 3396946}, {"rating": 3.0, "title": "Friendly, good price, clean", "text": "My daughter and I planned a week in Rome basically at the spur of the moment. We chose the Red Rose off the Hostelworld website. At the time of our booking Lucas the owner of the B&B emailed me detailed maps and good directions as to how to get to the B&B from the Termini Station. We found the rooms to be clean, lots of clean towels, a basic breakfast of rolls, crossants, tea, coffee, jam and sometimes yogurt.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "July 14, 2006", "id": 5465605}, {"rating": 3.0, "stay_parameters": "Stayed March 2005", "text": "The rooms themselves were a \"little tired\" but the rooms had high ceiling and were very spaceous.", "title": "Mediocre place in Rome", "helpfulness": 1, "user": "pspjenn", "date": "August 29, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3814776}, {"rating": 4.0, "title": "Better than I thought (my expectations were low)", "text": "We were within walking distance for most of the sites in Rome, the Vatican was a short bus ride over the river.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "July 21, 2005", "id": 3690311}, {"rating": 2.0, "title": "Red Rose Apartment on Via Equizia", "text": "Anna Rosa and Lucianna did there best to make us feel comfortable and I really enjoyed getting to know them both, the communication got better as the week progressed. My italian and their english.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "June 30, 2005", "id": 3621953}, {"rating": 2.0, "stay_parameters": "Stayed June 2005", "text": "Considering the very expensive rates for hotels proper in Rome, I felt we got what we paid for. Clean rooms, safe area, walking distance to most sites, quiet at night, bite in the mornings, and I really liked that I had a fridge to use for a cold beer in the evening.", "title": "Beware of the Red Rose", "helpfulness": 5, "user": "rpcman", "date": "June 27, 2005", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 2.0}, "id": 3615808}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "variance": {"poor": 9, "average": 7, "very good": 6, "terrible": 1, "excellent": 3}, "aka": "The Red Rose Hotel Rome", "slim_ranking": 0.825833333333}