{"user_rating": 4.5, "review_count": 245, "name": "The Ritz-Carlton, Charlotte", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "The hotel rooms are really great with terrific service. Very good location in downtown Charlotte. The lobby bar is excellent. Overall the best if you're traveling to Charlotte.", "title": "Terrific hotel in downtown Charlotte", "helpfulness": 2, "user": "SemoJim", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116190821}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We recently stayed at the ritz on a whim during a road trip through North Carolina in a parlor suite. The price reflected the splurge, but we really enjoyed the amenities, and would love to return. The room featured high end finishes, and the space worked well for a family of four. The spa is accessible, with welcoming staff, and our girls loved the pool. I have no complaints and would also recommend Enso, located directly across from the hotel, for excellent sushi. The hotel restaurant itself is very French, which meant some non-plussed looks from our five year old, but that should just reassure visitors of its quality. I was impressed.", "title": "a lovely stay", "helpfulness": 3, "user": "maesmom", "date": "July 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 5.0}, "id": 115546243}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "This is a great hotel in a city that needed a luxury hotel. The restaurant and bars are hip and great. Staff is first class. Beautiful rooms.", "title": "BEAUTIFUL, STYLISH, ELEGANT RITZ", "helpfulness": 4, "user": "HowFtLaud", "date": "July 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115503042}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "I guess I should thank U.S. Airways for their terrible service, because my unexpected 24 hour layover in Charlotte let me discover one of the best hotels I have ever experienced. It was nine p.m. and I was tired, and cranky, and in need of rest and refreshment. I call the Ritz, secure a really good AAA rate ($227) and grab a cab. We enter into an oasis. Beautiful, modern, sleek and cool lobby, amazingly friendly bellman and front desk staff. We are escorted upstairs to our room... and wow! It's very large, with nice office area, plenty of closets, and one of those over the top luxury bathrooms with frosted glass doors, large soaking tub, large shower, separate toilet area... two sink vanity, and my favorite, TV in the mirror. The bed is very comfy, fresh clean white with sheet covered comforter. It's very similar in design to the St. Louis Four Seasons, if you have ever been there.", "title": "Soothing End to Nightmarish Day", "helpfulness": 5, "user": "MelvinaSt.Louis", "date": "June 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 114620818}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We clean up and decide to get some well earned drinks at their lobby bar. It's such a nice area, we decide instead to order a bottle of wine and some food (they have a nice array of offerings from snacks to sandwiches, pizza, sliders, etc) and stay there. It's a rather quiet, classy and enjoyable area. Waitress and server both very friendly.", "title": "Very nice and modern!", "helpfulness": 2, "user": "xfire22", "date": "June 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113559262}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "Amazingly perfect stay- everything was EXCELLENT! Attentive staff, excellent in room dining, wonderful rooms. Would definitely recommend and stay here again.", "title": "Best Hotel in Uptown", "helpfulness": 2, "user": "Sylvan1", "date": "April 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 1.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102852185}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "My husband and I stayed at this beautiful hotel for the weekend while in town visiting friends. We had noticed it mentioned in the media quite a bit and were really looking forward to experiencing it ourselves. Upon arrival on a Friday afternoon, we warmly greeted by the friendly and, might I add, sharply dressed doormen who escorted us to the front desk area. Right in the lobby we were treated to some complimentary homemade ice cream in mini waffle cones - a welcome surprise!", "title": "Visit Charlotte just to stay at this hotel!", "helpfulness": 3, "user": "Stellatravels", "date": "March 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102335615}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "It was about 4 pm so we decided to relax in the lobby for a little while with a cocktail in the bar. We enjoyed our organic margaritas and the people watching - clearly this is a great spot to be in uptown Charlotte.", "title": "My Shortest Review So Far...", "helpfulness": 2, "user": "Nickpilot", "date": "February 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98306663}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "Our suite was overlooking the EpiCentre but we did not have any issues with noise (as some other reviewers have mentioned). The sound machine was a nice touch that made us very happy as we use one at home and always forget to bring it with us when we travel. If anything, we enjoyed the view and all of the activity going on in this part of town. The suite itself was beautiful. From the TV in the bathroom mirror to the nice amenities, we felt pampered and very comfortable.", "title": "WOW -- Impresses at Every Turn", "helpfulness": 1, "user": "brmusicman", "date": "February 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97545699}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "Saturday morning we spent time in the fitness center and pool before relaxing in the hot tub. It was a chilly and rainy day in Charlotte so we loved being able to unwind and indulge in room service while in the pool area.", "title": "Amazing and so needed!", "helpfulness": 1, "user": "kathryninfl", "date": "February 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 97374053}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I am a big fan of the Ritz Carlton chain of hotels and the Charlotte Ritz did not disappoint. From the Valet to the Front Desk the first 10 minutes of my stay at the Ritz were filled with gracious service. I also cannot go without mentioning the wonderful hotel staff that were making minature ice cream cones for guests as they walked in from the scorching heat. Thankfully, the fantastic surprises did not end once I checked in. My room was spacious and wonderfully appointed. The bathroom alone sold me on extending my stay for an additional night. Huge sunken tub, separate shower with a foot pedestal for shaving my legs and a mini TV imbedded in the mirror above the double sinks - who could ask for more. As a business traveller I love hotels that have pools and good work out facilities - again the Ritz exceeded my expectations. The pool has fantastic views of the city and you can run in the workout room while gazing out on the skyline.", "title": "FABULOUS", "helpfulness": 2, "user": "Suzee2351", "date": "June 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 113124471}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "Since no hotel stay is complete with out checking out the bar and room service - I have to say the Ritz hit it out of the ball park with this one. My family in Charlotte stopped by for a drink or two and just would not leave - they had so much fun we ended up in BLT for dinner.", "title": "EVERYTHINGYOU WOULD EXPECT FROM THE RITZ!!!!", "helpfulness": 3, "user": "weberskk", "date": "May 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109531058}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "I will definitely be back to the Charlotte Ritz - and recommend it to families and business travellers or for a girls weekend (the SPA is fantastic)", "title": "Hands down, the best in hotel in Uptown Charlotte", "helpfulness": 4, "user": "UniversalGC", "date": "May 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109092122}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": ".I was delayed over in Charlotte, NC and decided to make a business trip out of the ordeal I was in. The Ritz caught my eye and I'm glad I chose to stay here!", "title": "Nice!", "helpfulness": 2, "user": "Christopher R", "date": "April 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 105995880}, {"rating": 5.0, "title": "Location is a plus and a minus at the same time", "text": "Check in was smooth and friendly as I was promptly led to my room. The room was clean and refreshing after a day of travel in the dreaded skies above. The bathroom was large with a full shower and a nice soaking tub separated by glass. The TV within the mirror is a nice addition. The room was quiet and had every touch that you would expect from the Ritz.", "helpfulness": 1, "user": "Imperial_Eli", "date": "April 12, 2011", "id": 103829472}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Beautiful indoor pool and hot tub area. Pool does not have steps, and it is around 3.5-4 feet, so it is less suited for small kids and more suited for laps. However, the hot tub is great for kids if they like that, and the view from the pool area is great. Location of hotel is in downtown, right across from a new retail/restaurant complex, and a few blocks' walk from Discovery Center science museum for kids. Nice large rooms, huge luxury bathroom. Very nice doormen/valet parking employees. Bed is very soft, FYI for those who do not like that.", "title": "Great location, rooms, and pool area", "user": "Kids3", "date": "August 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117278294}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "My wife and I had a quick overnight stay this past Saturday. I must say the customer service (front desk, bellman, and valet) was beyond first rate. The room and bathroom were roomy and enabled my wife and I to quickly dress for a night out without the usual coordination issues. I especially enjoyed the TV in the bathroom mirror. The hotel itself is located in a great part of town. This will be our choice location for our future trips to Charlotte.", "title": "Excellent Overnight Stay", "helpfulness": 1, "user": "WPK1911", "date": "August 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117079089}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "The Ritz-Carlton, Charlotte was one of the best hotels. I like the design, the hospitality and the amenities.", "title": "Excellent City Hotel", "user": "DrBrother", "date": "August 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 116921491}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We were early and were upgraded to a larger suite.", "title": "class act, in every way", "helpfulness": 3, "user": "stoneiam", "date": "August 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116404901}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "The room was perfect with a bathroom that could accommodate two adults without a problem.", "title": "Perfect", "helpfulness": 3, "user": "cau3", "date": "August 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116386789}], "location": {"country": "United States", "city": "Charlotte"}, "stars": 5, "variance": {"poor": 9, "average": 9, "very good": 43, "terrible": 5, "excellent": 179}, "aka": "The Ritz-Carlton, Charlotte Hotel Charlotte", "slim_ranking": 0.0473372781065}