{"review_count": 107, "slim_ranking": 2.0, "name": "The Cafe at Hotel Mulia", "reviews": [{"rating": 5.0, "stay_parameters": "Visited April 2013", "text": "My wife and I with friends enjoyed a very relaxing and great food on a Sunday, the staff were extremley nice", "title": "Very nice setting", "user": "RobertAustralia", "date": "April 8, 2013", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 157117817}, {"rating": 5.0, "title": "Spread fit for a king!", "text": "I liked the noodle soup dish which you can specially request as per your liking, as well as the layer cake or kuih lapis that is served during breakfast. For ala carte, I would recommend Sop Buntut or Oxtail Soup - one of the best in Jakarta.", "user": "Gopi2225", "date": "April 2, 2013", "id": 156447185}, {"rating": 4.0, "stay_parameters": "Visited April 2012", "text": "On the minus side, the crowd in the morning can be overwhelming and guests may sometimes have to queue while waiting to enter.", "title": "Garlic Cheese Naan and Fro-Yo", "user": "irrasistible", "date": "March 20, 2013", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 155130760}, {"rating": 5.0, "stay_parameters": "Visited August 2012", "text": "I love love love The Cafe! Okay, for an Indonesian restaurant, it's quite expensive. But for a place that serves high-quality and tasty food, I think it's worth every penny.", "title": "Great !", "user": "Farah F", "date": "March 13, 2013", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 154426824}, {"rating": 5.0, "title": "A wide choice of food with good taste....", "text": "My most favorite food here is the Indian section, mostly the garlic cheese naan. It's a special order, btw, but the chef will take the request and make you one if you ask. The second one is the frozen yogurt or fro-yo. AFAIK, The Cafe is the only buffet-style restaurant in a five star hotel that has this. Thus, it is one its specialities.", "user": "eddyss2000", "date": "March 8, 2013", "id": 153988953}, {"rating": 5.0, "title": "Awesome hospitality!", "text": "I was invited for a dinner here...the restaurant is amaze me! I love the chinese food and the japanese food, overall The buffet and all u can eat was great! Absolutely will come back and brings another friend :)", "helpfulness": 2, "user": "Wira S", "date": "March 2, 2013", "id": 153509791}, {"rating": 5.0, "stay_parameters": "Visited September 2012", "text": "This was our 4th visit to Jakarta and one of the things the whole family wanted to revisit was the Mulia buffet. We've stayed at the hotel a few times and though we've tried several of their restaurants, the one to take the kids to is definitely this buffet.", "title": "We always make sure we have at last one meal here...", "helpfulness": 1, "user": "Dromomaniac", "date": "February 27, 2013", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 153316457}, {"rating": 5.0, "title": "meeting point", "text": "Between the AMAZING Indian food, fabulous traditional Indonesian, varied and delicious Japanese, Italian section, the fresh seafood and the incredible dessert buffet with frozen yoghurt and chocolate fountain - there's something to impress everyone.", "user": "ijapras", "date": "February 21, 2013", "id": 152743217}, {"rating": 4.0, "title": "In this case big is beautiful", "text": "I have to stress, too, that by international standards the buffet here is not only amazingly varied, but very, very reasonably priced! For our family of 5, including some drinks and full buffet for all of us, the bill was a little over AU$130 (US$135) - you'd be lucky get an average buffet meal for TWO people in most 5 star buffet restaurants for that amount.", "helpfulness": 1, "user": "Hedonist_Australia", "date": "February 16, 2013", "id": 152303041}, {"rating": 4.0, "stay_parameters": "Visited November 2012", "text": "The staff are attentive and friendly, and the cleanliness and organisation are of a very high standard. Definitely worth a visit!", "title": "Good buffey resto", "user": "RioLoekito", "date": "February 11, 2013", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 151862481}, {"rating": 5.0, "title": "I love the classic music concert from the 3 ladies:)", "text": "There was a small classicall music concert with 3 women playing piano-violin-flute of classic music in the resto..I love the classic music really:) will come there again with my family & friends :)", "helpfulness": 1, "user": "funny2222", "date": "January 8, 2013", "id": 149148206}, {"rating": 4.0, "title": "Unpleasant experienced !!", "text": "We booked table at The cafe it was 6 of us included 2 kids for Christmas lunch, we paid in advance since its mandatory. Turned out when we got there they prepared only 4 chairs for us, the hostess knews nothing about it which was strange.After few minutes standing and waiting they managed to get us table for 6,finally!!", "helpfulness": 16, "user": "Dreamtofly", "date": "January 4, 2013", "detail_rating": {"value": 2.0, "service": 2.0}, "id": 148765986}, {"rating": 4.0, "title": "Best buffet in town", "text": "Coming with kids on Christmas lunch what did we expected?? Santaclause off course !! We came at 1pm as they asked us to (plus time we gotta wait for our assigned table)guess what Santa has gone eventhough we asked for a little apperance for our kids but it seems they couldn't do much about entertaining the kids for Christmas time,they appoligize but it wasn't good enough,gutted !!!", "user": "Gunawan G", "date": "December 25, 2012", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 148025231}, {"rating": 5.0, "title": "Excellent service", "text": "Service wise ?? We understood they were busy but it's Mulia, we were few guest who were still there till the rest are left but the staff couldn't managed to cleared up our pile of dirty plated in the middle of our round table till we asked them to quite few time though. Drinks are gone and took us few minutes to get their attention for another drinks eventhough the restaurant was almost empty .... We ordered Champagne and we poured ourselves couple of times since nobody care to give us little attention.", "user": "Dennischew", "date": "December 18, 2012", "id": 147657316}, {"rating": 5.0, "title": "nice atmosphere", "text": "Overall we weren't so happy when we left not to mention how gutted our kids were about not seeing Santa on Christmas day just because Santa has only served their first sitting guests !! We need explanation on this ??", "user": "meity r", "date": "December 13, 2012", "id": 147354642}, {"rating": 4.0, "title": "Nice brunch buffet", "text": "I just like it. Being rom Europe I am always surprised about the selection. Restaurants at Mulia are good anyways.", "user": "dude2009", "date": "January 27, 2013", "id": 150725529}, {"rating": 5.0, "stay_parameters": "Visited December 2012", "text": "The Cafe Hotel Mulia ini merupakan tempat yang tepat untuk memanjakan mata, perut dan juga hati. The place is luxurious and tastefully decorated, ambience is amongst the better restaurants in Indonesia. Service is meticulous and professional, and of fine dining standard, without making the guest feel not at ease.", "title": "5 Star", "helpfulness": 2, "user": "j_herliani", "date": "January 20, 2013", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 150149376}, {"rating": 4.0, "title": "Lots of variation", "text": "The spread of the buffet is extensive - in terms of both quality and variety. Buffet ranges from Japanese, European, Chinese, Thai, India and of course, the desserts section! One word to describe the desserts section which is heavenly! Tried almost all the desserts in the section which looks really appealing and delicious. You'll be pleasantly surprised with the varieties of desserts in The Cafe.", "user": "Linda L", "date": "January 18, 2013", "id": 149961220}, {"rating": 4.0, "title": "Great food, lovely staff", "text": "Very recommended! Interior design of the restaurant is very photo-worthy.", "helpfulness": 6, "user": "aoc134", "date": "January 17, 2013", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 149915598}, {"rating": 5.0, "title": "Breakfast that can't be beat", "text": "Love the noodles bar (you can choose your own noodles & ingredients such as shrimp, meatballs, beef, etc) and also sushi.", "user": "DonaldRLeger", "date": "January 8, 2013", "id": 149160924}], "location": {"country": "Indonesia", "region": "Java", "continent": "Asia", "city": "Jakarta"}, "variance": {"poor": 3, "average": 9, "very good": 34, "terrible": 1, "excellent": 60}}