{"user_rating": 4.5, "review_count": 195, "name": "The White Horse", "reviews": [{"rating": 4.0, "title": "Ideal for a walk-loving dog........", "text": "Stayed for a couple of nights - with a dog - and the previous comments about the room are very valid - good heating, nice bathroom, and cheerful staff. Room has view of the carpark rather than towards the dunes and sea.", "helpfulness": 5, "user": "davidfisher", "date": "February 20, 2005", "id": 3212631}, {"rating": 5.0, "title": "Lovely place for a short break.", "text": "Food good, served in large busy restaurant, and wines reasonably priced.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "January 4, 2005", "id": 2974692}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We have stayed at the White Horse on two previous occasions and have booked again for Dec this year. Primarily we stay here because we have a dog and this Inn is the perfect location.", "title": "Great for dogs.", "user": "Georginabix", "date": "October 9, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10058462, "likes": {"liked": "— Very practical for dog owners, comfortable with space.", "disliked": "— TV reception"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "The rooms are away from the main building near to the carpark and the path to the coastal path. Straight out of the room and you are onto the path! What more could you want - even if you don't have a dog? There is an outside tap at the side of the Inn for washing dirty feet/boots on return.", "title": "Great pub with rooms", "user": "gmbklm", "date": "August 30, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8560672}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Rooms have everything for a comfortable stay and are very practical for dog owners. Plenty of space for a dog cage.", "title": "Beautiful Hotel and location however.........", "helpfulness": 1, "user": "montyzuma", "date": "July 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8241368}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The bar is also dog friendly and we enjoyed watching the Grand National in front of the log fire there. Food in the restaurant as mentioned by many others is good but we found it slightly pretentious and over priced. Lots of other fine places to eat in the area though.", "title": "Location, Location, Location and more", "helpfulness": 2, "user": "Adelai", "date": "May 29, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7711975, "likes": {"liked": "— Location and standard of hotel", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2006, traveled with family", "text": "Staff are OK but nothing to get excited about - remember this is an Inn and not a hotel.", "title": "We love this place", "helpfulness": 2, "user": "LiztheWhizz", "date": "January 22, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6640680, "likes": {"liked": "— The location by the saltmarsh", "disliked": "— Too popular, hard to get in at short notice"}}, {"rating": 2.0, "title": "Did not stay - but food overpriced and a great disappointment", "text": "We visited The White Horse while staying at Brancaster last week, we arrived the restaurant was full - very good sign. We sat down to order - fish and chips and plate sur le mers. What arrived was what can only be described as starters! The Plate sur le mere was 2 oysters, 2 shrimp and a peice of smoked salmon - for £8.95 and the fish and chips although tasty were very small portions. If visiting the area would reccommend Cookies up at Salthouse - quadruple the portions and you take your own wine!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "July 5, 2006", "id": 5426642}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "Fabulous food and excellent service all round. Our room was at the front of the building with views of open countryside and was spotlessly clean and comfortable. Bathroom was modern and well equipped. Rooms 9, 10 and 11 are recommended if you want a sea view. Wonderful walks right on the doorstep and loads of interesting places to visit nearby. The views from the restaurant are spectacular.", "title": "Can't wait to go back!!", "helpfulness": 7, "user": "Gill345", "date": "November 1, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4077330}, {"rating": 5.0, "stay_parameters": "Stayed February 2004", "text": "The last reviewer has clearly had a raw deal on service, although why s/he rates the place so low for cleanliness is, I suspect, down to general fury with the bad service experienced. I'd agree with an earlier reviewer that, in some ways, it's a glorified gastro-pub. In my view, it's simply not the sort of place where you'd expect the manager to contact you during your stay. The rooms are, mostly, built into the land behind the hotel. There's a seaside theme (don't worry, not horror Blackpool-kitsch). They are spacious and clean. The fact that the place is called the White Horse should provide a clue. It's a pub, or rather a pub restaurant. Expecting a non-smoking lounge in a seaside pub/restaurant in Norfolk is, in my view, totally unrealistic (much as I'd welcome there being one). This is not the metropolis (thank god). The first reviewer sums the place up perfectly. It's a great little spot, and the food is superb.", "title": "Brilliant coastal base for a few days in Norfolk", "helpfulness": 5, "user": "mackemflyer", "date": "October 9, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 4002963}, {"rating": 2.0, "stay_parameters": "Stayed June 2005", "text": "We chose to stay at The White Horse after seeing the beautiful views overlooking the marshes shown on their website. We were looking for a quiet and peaceful rest. On booking (8 weeks before we arrived) we asked for a room with a view over the marshes but when we arrived we were shown to a room at the back of the hotel overlooking an ugly carpark and a busy main road. When we complained we were told the hotel was full and they had no record of us booking the room with a view.", "title": "What a dreadful place", "helpfulness": 17, "user": "demeter66", "date": "June 21, 2005", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 1.0}, "id": 3589954}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "As usual tripadvisor comments were very accurate in summary this is a good hotel for those who take their dogs on holiday otherwise for the remaining majority of the population a mediocre hotel. The restaurantswas fairly good the food was fine but not great & the view is good. The rooms basically 3 classes, 1)those facing the carpark outside(don't expect a view) good for dog owners although I would question the attraction for the rest of us of sleeping in a room regularly occupied by dogs! 2) those with a mud flats view -small windows over the restaurant(noisy?)3) those facing the road.We faced the road the room was clean & nicely decorated, the road was barely audible but there is a beer garden between the hotel & road as it was cold the only people parting was the young staff after work which disrurbed us till midnight, also the pub is illuminated by spotlights right outside the windows that I requested if they could turn of close to midnight as the cutains were not very opaque & it was as similar to trying to sleep at midday, additionally the building is not very well sound insulated & people going upstairs & in the corridor could be hears too easily. The staff were very receptive to these comments.Good to stop to eat, stay probally not . The views are good but walking on mudflats again probally is most attractive to thos with dogs , and the restaurant was so busy with elderly locals they probally don't care what we write here.", "title": "not a peacful sleep", "helpfulness": 2, "user": "familymanHongKong", "date": "July 25, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 18223552, "likes": {"liked": "— view", "disliked": "— noise"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Took my husband here for his 40th Birthday as he loves good food and the natural English coastline. This ticked all the boxes! We stayed in the \"Room at the Top\" with a viewing telescope - a must if you're interested in wildlife as you get to see some amazing views. The food could not be faulted. The conservatory restaurant is informal and relaxed but the meals were first class! Watching the sun set on the terrace over the sea completed a perfect break. Highly recomended as a get away from it all location. We will return to recharge our batteries soon!", "title": "perfect weekend!", "helpfulness": 1, "user": "GREBBIES", "date": "July 5, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17555598, "likes": {"liked": "— View from our room", "disliked": "— Nothing!"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Firstly this pub, which is what it is, is in an unrivaled position overlooking the saltmarsh. In addition, the bar has a real pub feel too, if that is your thing. There is a good choice of beer on sale, although i have to say, as a self respecting northerner, it was with dismay, that i noticed that the southern influence is king - hence no head on the beer. The rooms are clean & spacious. Our room afforded a fantastic view out over the marsh.", "title": "Good pub, limited restaurant.", "user": "hull1", "date": "June 15, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 16946500, "likes": {"liked": "— view", "disliked": "— Overrated food"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled solo", "text": "The saff are friendly & enthusiastic. If we had a complaint, it was the food wasn't as good as we expected. Whilst the ingredients were fresh we felt that it didn't merit its score & write up in the Good Food Guide, which was one of the reasons we booked. For example, the chips on offer were no different from", "title": "Charming inn with good restaurant", "helpfulness": 2, "user": "Susan66", "date": "February 4, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 13267548, "likes": {"liked": "— The wonderful location.", "disliked": "— Could try harder to get the details right, resting a bit on their laurels."}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Mcdonalds & the swede we were served was cubed (reminder of school dinners) & undercooked. Throughout the dinner period we had long waits between courses as well - the service could be described as \"friendly but chaotic\". All in all we felt that the White Horse was overpriced. Would we stay there again? Yes. Would we eat there? A bar meal - yes, in the restaurant? we would try somewhere else.", "title": "Nice Place but get the right room", "helpfulness": 1, "user": "yorkshireman abroad", "date": "December 19, 2007", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 11682480, "likes": {"liked": "— view", "disliked": "— Room 15."}}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 12, "average": 16, "very good": 65, "terrible": 2, "excellent": 100}, "aka": "White Horse Hotel", "slim_ranking": 0.666666666667}