{"user_rating": 4.0, "review_count": 247, "name": "The Rockwell", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed October 2010, traveled solo", "text": "Katalin V. Dublin, Ireland", "title": "I am TOTAL DISSAPOINTED!", "helpfulness": 1, "user": "kezskati", "date": "October 29, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 1.0, "location": 3.0}, "id": 85305242}, {"rating": 2.0, "stay_parameters": "Stayed October 2010", "text": "Staff exremely rude and uninterested! The receptionist /with Polish or Russia accent/ was being sarcastic , unfriendly and very impolite! SUFFOCATINALY, small room!, the size of a SHOE BOX! For the price, I was expecting much better for higher standard of room, welcome, service and food! I am total dissapointed!, especially since I saw many good reviwes on here and on Booking.com. You guys must not stayed in room 203.", "title": "Rude staff, tiny room", "helpfulness": 1, "user": "mvonk", "date": "October 27, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 85008956}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Stay Away!", "title": "Excellent clean room in a desirable neighborhood", "user": "jverses", "date": "October 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 84356160}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled solo", "text": "We had to settle for this hotel because we were transferred here from the K+K George Hotel because it was overbooked (for some of their guests). We were told by the staff at K+K that we had been upgraded to an executive suite without charge to compensate for the inconvenience. When we arrived at the Rockwell Hotel at 1.10 pm we explained the situation and asked if we could check into our room. But we were told that the room wasn’t ready yet and that check-in time was 2pm. I’ve stayed at a lot of hotels and most of the time the rooms are ready to check into when you arrive after 1pm. When we told them again that the hotel we were supposed to stay at was overbooked and that we were transferred to the Rockwell instead and that we expected to be able to check-in, we were very crudely told that wasn’t their problem. Total negligence on the part of the management at K+K George because they should have made sure that our room was ready and if not, they should have told us ahead of time that it might not be. Apparently, communication is not their strong suit.", "title": "Great Value for accommodations, location and service", "user": "woodwindWI", "date": "October 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 83185101}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Anyway, when we were deciding what to do next, I could see the staff behind the desk (two young ‘ladies’) whispering about us. When I confronted them with their behaviour, all we got was a condescending look and again the response “it’s not our problem”. So much for customer service. So we had no choice than to leave our luggage at the hotel and fend for ourselves. When we eventually arrived back at the hotel around 5.30 pm the staff behind the desk was still acting very rude and arrogant, but our room was ready and we were looking forward to taking off our shoes and relaxing for a bit. Well, if that room was their definition of an executive suite, today’s executives must have low standards. It had one huge window looking out on a busy road with a huge curtain that could hardly be drawn. There was a grubby old sofa that seated just 1½ person with just enough room to plant your feet without hitting the desk. The television was mounted on the wall next to a small spiral staircase that led up to the bed. So no watching television while lying in bed. The upstairs was very close to the ceiling and we couldn’t even stretch out our arms without hitting the ceiling. The bed was uncomfortably low and in the wall just above one of the sides of the bed was an air vent that blew cold air. So needless to say, it wasn’t very comfortable up there. And don’t get me started on the bathroom (for lack of a better word). The shower cabin was just big enough for one person, but it was impossible to lather up without hitting the walls or the ceiling. Thank goodness, we’re not claustrophobic.", "title": "Perfect London Stopover", "helpfulness": 1, "user": "Allen F", "date": "September 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81009457}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "I stayed at a premier inn right next to the eye on business for 3 days and then moved to the Rockwell privatelly on the weekend. We got a room in the basement with a small tarrasse. It was a nice surprise. The room was very big, surprisingly bright, modern and very pleasant. It didn't feel \"used\" like many hotels I usually stay in in the UK. But we may have gotten an upgrade (although the staff didn's say anything). There was free internet which was nice...", "title": "Nice surprise", "user": "bartkozik", "date": "August 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 77448590}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "On a negative side, being from Poland it is a shame it is so difficult to find British people in any hotels. Same goes for the Rockwell. We checked in and out using Polish language, the cleaning lady was from Hungary", "title": "very nice", "user": "gcalgske", "date": "August 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 76452280}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Pleasant and spotless hotel, had a very tasty bite to eat in the hotel restaurant on arrival. Staff were warm and friendly, white company toiletries.", "title": "Couldn't fault this hotel", "user": "HarrisonFamilyAUS", "date": "August 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73285431}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "However there were a couple of niggles.", "title": "A most enjoyable stay", "user": "skiddy1903", "date": "July 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 72081716}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "1. No tea and coffee making facilities in the room.", "title": "Loved it!", "user": "syra1358", "date": "July 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71623204}, {"rating": 3.0, "title": "mediocre boutique hotel", "text": "staff is friendly", "user": "marie6613", "date": "May 22, 2011", "id": 109388288}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "unfortunately, the elevator was not working when we checked in and we were on the highest floor", "title": "Great hotel ! What more can you expect?", "helpfulness": 3, "user": "sharon_love_2_travel", "date": "May 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 109313993}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "bathroom is tiny but the room is very spacious", "title": "SUPERB", "user": "MaureenHughes", "date": "May 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 107771536}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "the room was clean as well", "title": "The Rockwell is a real Gem", "user": "mayhew_george", "date": "January 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 92520505}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Situated in a great area of Kensington, located next to a bus stop and between two tube stations with 3 lines going through (District, Piccadilly and Jubillie) - earls court and Gloucester road. It is very safe at day and night. Easy to walk to hide park, noting hill and even to Covent garden (around an hour walk - 3 km). We paid great rate (186 pounds including breakfast). The hotel design is just great! Like visiting a design magazine. The design is chick and inviting and pure fun and look even better that the photos on the website. The staff were very friendly and welcoming. The garden outside is just great (pure london style of red bricks and white furniture, again like a design magazine) and having breakfast there was great. I wouldn't take the ground floors room with the balcony - as there is not enough privacy, and wouldn't take the single room as they are very small. Our room was great, and even though it was less than 18m square it was comfy and big enough because of its well design. The bathroom is very small - but again it it designed so good that you just don't feel it. The only minus about it is that in the shower only one person can wash at a time and that the shower head position is fixed which makes washing a little bit annoying however the stream is excellent! Another minus is the bed size - it is only 1.4 m width (probably because they wanted to make the room look larger than it is), but it is very comfortable. Breakfast is nice and quite rich - but they don't provide eggs . They provide good WI-FI internet which is a plus! The hotel was romantic and fun and I would definitely go back again. If possible pay more and get the suites (but again - the regular rooms are just fine and great!).", "title": "Great Hotel For A Second Time.", "user": "gomo2", "date": "December 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89495441}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled solo", "text": "Stayed here for a quick overnighter. I was very impressed by much in this hotel. My room was large comfortable and modern with a lovely bathroom and fabulous shower. Everything was very clean and sparkly. I would point out that the heating/aircon system is quite noisy but that was not a major problem for me.The public areas are equally pleasant and there is a nice outdoor garden though this was the wrong time of year to try it!", "title": "Very nice hotel but watch out for hidden breakfast charges!", "user": "mrbury", "date": "December 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 89405706}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled solo", "text": "However I do have a problem with what happened at breakfast. My room rate included continental breakfast. It looked pleasant enough but I do enjoy cooked breakfasts. The menu on the table said that Continental breakfast was £9.50 and cooked was £12.50 So I asked the waitress whether I would only get charged the difference of £3 if I ordered cooked. She said yes and a perfectly agreeable and generous cooked breakfast duly arrived. The fried eggs were overdone with solid yolks but for the money it seemed fair enough. But when it came to checkout I was billed for £12.50 on top of my room rate. When I challenged this I was told that this was policy. They told me the waitress was new and had misinformed me. They did back down when I protested at £22 for breakfast but I do think that it is an underhand practice to do this without making it specifically clear on the menu. Also if it is their intent to charge that much the eggs should come immaculately cooked!", "title": "Great for a short stoppover", "user": "Jackeen_10", "date": "November 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87160825}, {"rating": 2.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "It was a shame about this episode because it tarnished what was otherwise a very enjoyable stay.", "title": "Veru ordinary, quite disappointed", "user": "Melbourne_Guys", "date": "November 13, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 4.0, "rooms": 1.0, "location": 4.0}, "id": 86909939}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "I stayed for two nights here in a standard double.", "title": "nice small hotel", "user": "MarkItaly", "date": "November 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85980765}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The room was great and spotless. I ordered room service before I went to bed at around 12.30, and it was of a really decent quality.Another perk is that The Rockwell is quite near Heathrow but still in town so I could get to my meetings easily but flying back was was also fairly easy.", "title": "Where´s the design and great service in a supposed design hotel?", "helpfulness": 1, "user": "Su_Lx", "date": "October 31, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 85489482}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 4, "variance": {"poor": 23, "average": 31, "very good": 82, "terrible": 12, "excellent": 99}, "aka": "The Rockwell Hotel London", "slim_ranking": 0.455390334572}