{"user_rating": 4.5, "review_count": 178, "name": "The House of MG", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I have been travelling to India for business for the last 10 years and my time at the House of MG has been the best experience ever. Thank you to the couple who pointed me in the direction of this 'jewel'. Becoming jaded with standard five star hotels the House of MG gives me time to experience a different slice of Indian hospitality. You will be looked after by the staff at the House of MG.", "title": "Best hotel experience in Ahmedabad", "user": "Kerebs", "date": "October 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118948624}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "If there is one hotel to stay to capture the history and culture of Ahmedabad it is the House of MG. I stayed the night of 22 September in Grand Suite No 15. The living room of the suite was spacious . The bedroom is proportionately much smaller and has a traditional swing. The room decor is ethnic and unique. However better lighting could have made a lot more difference to the aesthetics.The staff is warm and courteous. However, there is a visible lack of professionalism and training. There were many snags encountered that made my stay not as enjoyable as expected- The in room telephone was out of order was not fixed despite my complaint. The WC flush was faulty and was continuously wasting a lot of water whereas the wash basin and shower had very little water pressure. The windows facing the road need double glacing.My sleep was broken many times due to vehicular traffic and a wedding procession blaring loud music. The F&B at the hotel is very popular with the locals and is crowded for dinner.", "title": "Lots to improve", "helpfulness": 1, "user": "Pradeep_ramachandran", "date": "October 2, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 118854743}, {"rating": 4.0, "stay_parameters": "Stayed September 2011", "text": "Charming hotel- not really a business type hotel. However enjoyed my one night stay- very old school but that was the intention. Room was a Roth dusty but vey big (had rm 1). Interesting furniture and old photos- overall charming. Eat at the restaraunt on the terrace where they serve Gujarati thalis -honestly one of the best indian meals I have eaten. It's entirely veggie- and I hate veggie food in general. But this was wonderful- every dish was subtle and clean. Worth getting on a plane just to eat there", "title": "Wonderful food, interesting rooms", "helpfulness": 2, "user": "scalpel73", "date": "September 23, 2011", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 118478457}, {"rating": 5.0, "title": "The Indian accommodation \"experience\" I have been seeking", "text": "Much of the time in India I am staying in modern (or not so modern) 5 star hotels with all the modern hotel trappings, but the House of MG in Ahmedabad is something special. It is a huge 90 year old mansion in the centre of Old Ahmedabad that has been lovingly restored to its former heritage glory. It is located on the east side of the river that splits Ahmedabad, very close to the Nehru bridge, next door to the Lal Darwaja Gardens, and a number of prominent mosques.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "September 11, 2011", "id": 117960830}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "The hotel is rambling and only has 15 rooms, most opening off an inner atrium The bedrooms are enormous - easily twice to three times the size of a usual hotel room. When I first entered our Grand Deluxe room I thought we had been upgraded to a suite it was so large. Fittings are luxurious, and inlcude free wifi, large flat screen tv, DVD player, etc. All the rooms appear to benefit from lots of windows and natural light. Our room used to be the day room of the women of the house, so as well as twin fourposter beds, has bookcases with books, a full lounge set-up, a huge bathroom, and a full sofa swing seat hanging from the ceiling! (Thankfully VERY securely bolted into the ceiling with modern stainless steel fittings - I chec.ked). The room was so comfortable that my travelling companion didn't leave it our second day - just hung out reading and watching movies. History in very present in this hotel, with photos on many walls documenting the many many generations of the Mangaldas family that have always owned it - back to the early days of the philanthropist and textile baron Mr Mangaldas Girdhardas. In many cases, the photos show how the rooms themselves were used, so are like looking back in time in your own room - a really interesting touch I haven't seen done anywhere else.", "title": "Expect Much More Than Coming Home: A Complete Heritage Experience", "user": "shroffmehtap", "date": "August 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116658630}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "My husband and I stayed at the House of MG in October and thoroughly enjoyed our stay. We were allocated a wonderfully large room next to the elevator because my husband has a disability. Initially we found it noisy but soon became accustomed to the traffic that is so constant in India and slept very well. The staff, with one notable exception, were extremely polite and helpful. I did use the internet on a daily basis. I did not have a personal laptop and found that the hotel information compendimum in the room advised that to access that service one needs to hire a laptop - at a cost, of course. That was fine by me but when I inquired about hiring one the very helpful receptionist told me that that was not necessary and simply to use the facilties in the business centre instead. For the first two days that worked out fine, but on the third day I was checking my emails and this very large man wearing a flowing robe came storming into the room (I was its sole occupant) and literally hung over me and was almost apoplexic in the face as he told me in no uncertain terms to get out of the room, it was for \"business purposes only\" and to hire myself a laptop. He sat at a desk shuffling bits of paper glowering until I left the room. I was incredibly embarrassed. His attitude was way over the top and so unnecessary. He could simply have politely asked me to leave the business centre and I would have. This was our fourth trip to India and the first (and I hope last) time that I have been treated with such rudeness and nastiness. If he meant to demean me he certainly succeeded. And just to make me feel better (sarcasm) I noticed other guests checking their emails on the same computers in the same business centre and not being harrassed by this particularly aggressive staff member. He has singlehandedly made sure that two guests will never return. As a final note, yes, I did hire a laptop and used that in the confines of our room.", "title": "Fabulous location", "user": "dainabrisbane", "date": "December 31, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 122307111}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "I stayed here in December 2011. Loved this place!! Lots of nice touches and the place had character.Highly recommend.", "title": "Simply excellent", "user": "wizzywoo", "date": "December 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 122226099}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Great place to stay if you're ballin' on a budget. The accommodations are really nice, and there is actually working internet. The building is really interesting and the restaurants are really excellent. Also the pool is amazing.", "title": "Really Fancy and Interesting.", "user": "eltsmith", "date": "December 28, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122165434}, {"rating": 1.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "I paid $US230 for a suite with NO hot water", "title": "NO Hot water", "helpfulness": 1, "user": "heyheyheygoa_india", "date": "December 16, 2011", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 121793202}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Bedroom was so noisy", "title": "Lovely heritage property in the heart of Ahmendabad", "user": "Tarvel2learn", "date": "November 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 121009150}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "This hotel is classic, has history. One big combined family used to live here and many portraits and family tress all over the hotel. I love the room. four poster bed, swings, confortable sofa, beautiful curtains etc.....", "title": "beautiful room and traditional antique style hotel", "user": "churachura", "date": "January 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 123739189}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "I would say service and food were average. Agashiye restaurant is one of the best in Ahmedabad. I highly recommend. However, the ground floor restaurant is just average. Breakfast was just ok. Nothing so special. I thought the next door restaurant was bit better and cheaper.", "title": "Great.", "user": "Malkia", "date": "January 19, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 123287233}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "There was swimming pool.", "title": "WOW", "helpfulness": 1, "user": "mickmcp", "date": "January 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123197866}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "House of MG is the place to be while in Ahmedabad. I did not sleep here, but in a very nearby hotel. Every day I went at least once to House of MG. Once for dinner up in the Agashiye restaurant, once for swimming, a few times to have a snack or drink in Green House.", "title": "Top of the list", "user": "Ruberslaw", "date": "January 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122512670}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "The atmosphere is great and the Assistant manager Satyender is very nice and helpfull.", "title": "My stay at House of MG", "helpfulness": 1, "user": "Tina P", "date": "January 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122512527}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We were very pleased with our stay at the House of MG, the suite was enormous and charmingly decorated with old photos of the Mangaldas Family who originally owned and lived in the mansion before it was converted into a hotel. We liked that it was just a 50 Rs. auto ride to Gandhi's ashram from the hotel, the New Cloth Market is also close but was closed the day we were there. The outdoor tables with a covered pergola at the Green House was great for breakfast and dinner --- there was plenty on the menu even our boys would eat. The one drawback was the online booking process...originally I had called to book a room for my husband and two boys and was directed to the website. Online, however, I could only book the suite for my husband and I and one child so I added a note saying so. When we arrived there was a fair bit of back and forth about the room pricing but in the end management agreed to honor the discounted web pricing. This is definitely a unique, old school hotel and I would recommend it to a friend.", "title": "Great Heritage Hotel in the Heart of the Old City", "user": "Kate D", "date": "November 21, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120861807}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "House of MG what can you say quiet and restful in the heart of Ahmedabad, the staff are always on hand for any requests, taxi drivers very knowledeable.", "title": "peace and perfection", "user": "alvin006", "date": "November 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120812031}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "The rooms do vary a lot in size and shape, make sure you have a good idea which one you want when you book,", "title": "Excellent in every aspect", "user": "Gilkumar", "date": "November 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120743352}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "We have a very good few days there and would go back.", "title": "Pleasant and peaceful oasis with atmosphere", "user": "anonym188049", "date": "November 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120063909}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "P.S make sure you ask for discount or the best possible price they are usually busy but ask anyway.", "title": "Nice old heritage hotel", "helpfulness": 1, "user": "jackiebur", "date": "October 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 119707533}], "location": {"country": "India", "continent": "Asia", "city": "Ahmedabad"}, "stars": 3.5, "variance": {"poor": 3, "average": 10, "very good": 60, "terrible": 5, "excellent": 100}, "aka": "The House Of Mg Hotel Ahmedabad", "slim_ranking": 0.0373134328358, "description": "The House of MG is the only 'boutique' category hotel in Ahmedabad. This stately heritage property has been tastefully refurbished to retain its old-world charm but with all the amenities and comforts of contemporary living. The Lonely Planet Guide and the Rough Guide recommend this hotel highly and the discerning British travel guide 'Sawdays - Places to Stay in India' has singled out The House of MG as the only hotel worth mention, in its Ahmedabad section."}