{"user_rating": 4.5, "review_count": 1867, "name": "The Taj Mahal Palace", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We recently stayed at The Taj Mahal Palace hotel for two nights. We stayed in the palace section (not the tower). Words can't describe how beautiful it was. Nothing was too much trouble for the wonderful staff. Breakfast was fantastic. Be aware of the balloon sellers across the road at the Gateway to India, they will get you ;-)", "title": "Magnificent", "helpfulness": 1, "user": "Kathy C", "date": "January 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122343573}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Lovely location and very good hotel. The reason I give it a 4* instead of a 5 is because the waiting staff were a bit uncaring in the shamiana breakfast area and the yacht that was advertised on their website was unavailable.", "title": "Lovely location", "user": "SUZYQT11", "date": "January 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 122343132}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "However, the rest of the things were wonderful and it was a haven from all the heat, and the hustle and bustle of mumbai. The front desk and concierge etc were v good and I recommend this hotel.", "title": "Magnificent", "helpfulness": 1, "user": "Kathy C", "date": "December 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122340569}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Magnificent personalised service in a top quality excellently maintained establishment. It could be fairly described as a beautiful peaceful oasis in a massive city swarming with humanity and traffic It is situated opposite the India Gate and adjacent to the sea The check-in was streamlined and hassle free, the concierge service was superb, so too housekeeping..The rigorous security procedures were reassuring and gave us full confidence. The breakfast was excellent offering an opportunity to experiment with Indian food as well as offering a wide western menu. We organised guides and chauffer driven cars through the hotel travel desk on arrival. The guides were highly educated, informed and articulate and very well versed in working with westerners. The hotel embodies the best of a service driven culture.", "title": "\"Service with a smile\"", "helpfulness": 1, "user": "pooja_uk", "date": "December 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122327443}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "My family and I recently stayed at the Taj in Mumbai and we were overwhelmed by the service that was provided by the staff. The kindness, sincerity and effieciency of the staff is outstanding and this made our stay a memorable one. All the staff from the cleaning team to the Butlers went out of their way to ensure that we were happy. Every request from finding a simple telephone number to providing our choice of fruit in the room was catered for and provided. This hotel has a rich heritage, history and culture. The heritage walk with Viren was entertaining and informative. Our Butlers Deepak and Adrian were extremely professional, wonderful and are absoluetely great at what they do. I was very touched and moved with the devotion and commitement of Dinesh, an elderly gentlemen working in the Sea Lounge who has been with the hotel for 38 years.", "title": "Worth Staying Here--At Least Once", "user": "Eric_Hemel", "date": "December 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 122292955}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "This is supposed to be a heritage site for Mumbai, and by the look of my room, it may be. It looked and felt very old, with quite a low ceiling. since i choose smoking room, i was booked to 17 fl (?). you wont missed it, the tobacco smells will caught you right after you step out from the lift. the breakfast was decent.", "title": "mixed feelings", "user": "jontowel", "date": "December 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 122122717}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We booked a room as the last stop in our backpacking tour of India. The hotel was just fantastic. Even if we looked ridiculous with our dirty clothes and bags in the middle of the high-class crowd of the Taj's lobby, everyone was really friendy and welcoming. We took a fantastic room in the tower wing overlooking the Gate of India. Everything was perfect in the room. The pool was great and the spa very relaxing. We had a flight the day after at 5 am, and they let us use all the facilities of the hotel even after we had checked in. Just a great experience", "title": "Fantastic last night in Mumbai", "helpfulness": 1, "user": "Francesco R", "date": "December 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122076754}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "I believe the Taj Mahal Palace hotel is must for travellers who enjoy the finer things in life.", "title": "A beautiful unforgettable experience", "helpfulness": 1, "user": "gujidaughterinlaw", "date": "December 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122015390}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "It is an absolutely spectacular place. The staff are true ambassadors for the Taj- they personify hospitality at its best. The layout, the room, facilities , food - all that is offered is second to none! The Palace lounge is a novel experience - especially with the butler service - those guys are awesome. The High Tea and breakfast at the Sea Lounge - is a relaxing experience especially as you enjoy your time of being there and watching life go by. Spolit for choice in the restaurants that are available. Love their bookstore(Nalanda) and a business centre that is so well equipped. Sitting on the veranda by the pool in the evenings is absolute bliss.The depth of the history and significance of the hotel just makes everything so much more special. My future stays in Mumbai will definitely be at the Palace - as the staff and the place left a positive indelible mark and memories for us. All in all we thoroughly enjoyed our stay from the start to the time we checked out!", "title": "A historic gem in Mumbai", "user": "NuYork", "date": "December 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121953764}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We loved our stay at the Taj Palace. It feels like you are back in the colonial times of India and if you have the time, take the 5pm tour of the hotel. Our young guide was so enthusiastic and well-informed and we saw places and rooms we would have never ventured in to. Our room was in the original part of the hotel, which is what we requested when we booked and I was much happier to be there instead of the uninspiring newer wing. Dinner outside in the courtyard was delicious and you could order freshly grilled choices that were cooked to your specifications. The breakfast buffet was enormous and had a vast array of all types of foods, both western and Indian along with custom eggs and anything else you could possibly think of.", "title": "Another fabulous experience", "helpfulness": 3, "user": "AnshumanT", "date": "December 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121939651}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "I found it really good to stay at the hotel as it has a really pleasant atmosphere and i feel that it is best location to stay in the crowded city such as mumbai so must have a visit there and feel this great experience and then you wil surely be thankful to me", "title": "A SWEAT PLEASURE", "user": "srbh91", "date": "November 18, 2009", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 49488473, "likes": {"liked": "— staff service", "disliked": "— nothing as such"}}, {"rating": 5.0, "title": "Its very loveing hotel", "text": "Its a very loved ones hotel", "user": "dfgdfgfg", "date": "November 18, 2009", "id": 49464355}, {"rating": 5.0, "title": "memorable moment", "text": "after the terror attack. i afraid to go there. but the security level is good and no thinking to afraid at all.", "user": "vivekbaby", "date": "November 16, 2009", "id": 49331633}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "the service they provide. is excellent.", "title": "Distinction and elegance, a fine way to enjoy Mumbai", "user": "flyboylee", "date": "October 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 47815288}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled solo", "text": "the view of gate way of india and the sea shore is awesome.", "title": "This hotel defines exceptional service", "user": "Wanderlust028", "date": "October 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 47186619}, {"rating": 5.0, "title": "best of best", "text": "i have beem twice to this hotel excellent view room are great however they closing a night club which imake me feel sad i really enjjoyed club located near swimming pool but food services and over all i guess one of the best ever hotel i stayed", "user": "viralbaxi", "date": "December 3, 2009", "id": 50598152}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "This is a great hotel in every aspects. The most notable part is the customer service. The room service asked us whether we need a photograph. He almost laid himself on the floor to take the photograph. I was a little late for the flight. The reception called the airline to make sure that I will get into the flight. In fact the Jet Airways folks were waiting for me at the airport. These are some of the examples.", "title": "Fantstic Customer service", "user": "Chittilappilly", "date": "December 3, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 50595705, "likes": {"liked": "— Customer Service", "disliked": "— dated furniture, floors, walls, sliding windows etc."}}, {"rating": 4.0, "title": "Excellent Ambience", "text": "Had a good time with my family there.", "user": "daruboy", "date": "December 3, 2009", "id": 50556123}, {"rating": 2.0, "title": "taj, one year after the terrorist attacks", "text": "the rooms were not very cleaned and not as luxurious as we might have expected, considering the reputation of the hotel worldwide.", "helpfulness": 2, "user": "hkmajo", "date": "December 3, 2009", "id": 50553196}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "The food in the coffee shop was terrible one night, the staff was very slow in getting what we requested once having meals.", "title": "taj of india", "user": "delhidaredevil", "date": "December 3, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 50542667, "likes": {"liked": "— services", "disliked": "— too clean to be realistic"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled solo", "text": "When planning my trip to Mumbai, I couldn't imagine not staying at a property with such a storied past and such a tragic recent history. In general, I loved the hotel but there are a few things to think through, most of which other reviewers have noted:", "title": "Iconic Hotel, Great Food, Super Service, But A Couple of Caveats", "helpfulness": 1, "user": "TurtleCreekTraveller", "date": "December 10, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 50993646}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "The Positives:", "title": "love this hotel.....", "user": "mananisaurabh", "date": "December 9, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 50925535, "likes": {"liked": "— cleanliness", "disliked": "— business service"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The hotel is an icon of Asia and just being there imparts a special feeling.", "title": "Wait for the Palace wing to re-open", "user": "Goooner", "date": "December 8, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 2.0}, "id": 50863541}, {"rating": 5.0, "title": "Outstanding", "text": "The pool is superb and transports you to a more genteel time in our world.", "user": "prateekarora0019", "date": "December 7, 2009", "id": 50833133}, {"rating": 4.0, "title": "Outstanding", "text": "The restaurants are truly excellent and offer a wide range of great cuisine.", "user": "prateekarora0019", "date": "December 7, 2009", "id": 50833037}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "We ended up here for a 3 night stay after a tough but enjoyable trip round India. What a great place to end up in. We wanted heritage rooms but sadly these are still being renovated after the terrorist outrage. We were given a small room on the 19th floor with fabulous views of the gateway to India and the Arabian sea. The furnishings and bathroom were fine but compact!", "title": "Magnificent", "user": "Ian Phillips", "date": "February 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 56862220}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Downstairs is where you want to be. The public rooms and the area round the beautiful swimming pool are outstanding. Plenty of staff cater to your every whim. We ate breakfast and dinner overlooking the pool. Great food and service. All the staff know ther history of the hotel and all give the impression they are proud and honoured to work there. We could have easily spent a week there.", "title": "Beautiful place, great location", "user": "gemsstock", "date": "February 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 56833304}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We stayed in January at the Taj Mahal Palace and Tower for three nights in a high floor sea view room. The view is incredible from there right towards the Gateway of India. Due to the 2008 attacks, the hotel seems to have a lost quite a bit of its charm since security is understandably very high. But it still has not lost the aura of the 'old days' and that's what makes this place unique compared to the more stylis new hotels in other parts of the city.", "title": "perfectly situated 5 star hotel", "user": "Malky", "date": "February 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 56591312}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "The rooms are spacious and comfortable, though it was a shame that the windows would not open!", "title": "Wonderful hotel in a wonderful city", "user": "SGJ1013", "date": "February 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 56382693}, {"rating": 1.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We have not tried the restaurants even though they looked pretty. We had tea a few times at the pool which is a pretty place but all in all both food and drinks are very pricy and breakfast is not included. We found a very nice cafe with excellent baked goods just around the corner which made more than up for this.", "title": "Excellent ahotel, very good service good value although would have liked breakfasrt included,", "helpfulness": 3, "user": "Tanghorse", "date": "February 15, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 5.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 56033820}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "It feels like Royal Staying & Excellent Food & staff was very Supportive.", "title": "Exceleent Stay", "user": "tanmaymech", "date": "March 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58864129}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "Its an awe-inspiring historical property. Stay here if money's not a problem and experience every luxury. Great service, fantastic rooms and views, lovely restaurants (must try Souk) and killer location.", "title": "Everything they say about the Taj Palace is true! Magnificent!", "user": "ItsMonica", "date": "March 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58791099}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Problem with reviews about Indian hotels is that sometimes they're written by Indians themselves whom are quite prepared to settle for something that Westerners wouldn't tolerate. But this hotel really does deserve its praise with exceptional service, beautiful marble clad interior with everything you'd expect from a 5* hotel. The spa, rooms, outside swimming pool area, restaurants and shops are places of sanctuary form the manic streets of Bombay. I will definitely stay with the Taj hotel group again, after they kindly assisted us with our requests, but not least the pleasant and relaxing stay, replenishing our energy after an exhausting holiday.", "title": "A world away from Bombay", "user": "davicio", "date": "March 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58068524}, {"rating": 5.0, "title": "Absolute pleasure", "text": "The only negatives are that even on the 14th floor, which we were, you can still hear the constant horn noises from the cabs. The next negative is paradoxically a positive as well in that the security on entrance and army situated around this hotel reminds you of the terrorist atrocities not so long ago, but nonetheless keeps you as safe as possible from the obvious continuing terrorist concerns.", "user": "desitraveljunkie", "date": "February 27, 2010", "id": 57226245}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "The restaurant on the top floor also serves excellent food and would recommend to anyone with a love of views! Not at all cheap by Mumbai's standards, but you're in the finest hotel in India, possibly.", "title": "Most amazing hotel in India", "user": "Dabral", "date": "February 26, 2010", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 57139696, "likes": {"liked": "— The rooms, resturants & world class service", "disliked": "— The price that i payed"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2009", "text": "atleast once a each indian should stay there. or esla they miss a great thing in their life.", "title": "a splendid three days at Taj Mahal Hotel Mumbai", "user": "junelizabeth", "date": "October 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 47154127}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "great. great !", "title": "Best hotel in India !!!!", "user": "kdcblue", "date": "October 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47017606}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Great location close to the tourist sights (I guess its a tourist site itsefl), and even a couple of funky designer clothes shops etc... instead of your usual handcrafts! Rooms are basic 5star rooms, nothing more, service is generally first rate. Restaurants are mixed - Souk on the top was very good, the Indian downstairs was average, and the coffee shop was terribe. A lot of tourists in and out of the lobby and the cafe/coffee shop which might explain staff attitudes and inability to take orders or correct them.", "title": "Best location in Mumbai... you have to pay for it though", "user": "mike142", "date": "February 12, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 55783629}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled solo", "text": "Overall recommended as its an icon of India, but expensive for what it is. A must is to check out the self-indulgent video history of the hotel. Even shows Ghandi inside it, almost implying he approved of the expense!", "title": "Superlative service, great experience", "user": "mladww", "date": "February 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55645753}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "I stayed for 3 nights in January 2010. Having booked a room in the Palace wing I was disappointed to find this was unavailable due to delayed re-opening after the renovation work. To compensate, the hotel had upgraded me to a club suite in the Tower wing – a very reasonable solution in my opinion. Unfortunately it was also noisy as the main music/dance stage for the culture festival was directly below. To be fair this was not the hotel’s fault (and I did have a great view to compensate) but with massive amplifiers the sound was pretty invasive. One more irritation to mention: there's the common but inexcusable rip-off surcharge to access wirlesss internet. Aside from these gripes, everything about the Taj was superlative. The location is unbeatable – it has fabulous views and the most convenient tourist location for exploring Mumbai. The service is impeccable. Staff at every level are extremely professional but don't give the impression of being well-trained automata. Service is friendly, personalized (they know your name) and attentive (every need was either anticipated or met promptly) without being too intrusive. The tower suite probably lacks the character of the heritage rooms but oozes luxury – spacious rooms with spectacular views of the Arabian Sea and Gateway of India, ultra-comfortable bed, classy bathroom with great shower, etc. I ate in the breakfast room and had dinner in two of the restaurants (Indian and French style). All were pretty good, but best of all was an indulgent afternoon tea in the Ocean Breeze room. My benchmark is the Imperial in Delhi (up to now my favourite hotel in India) and I would say the Mumbai Taj Mahal is its equal. It is undeniably expensive but it does deliver a top-class experience.", "title": "Staff make this property a unique one ...", "user": "srhmmj", "date": "February 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 55489102}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "My first return to the hotel after last year's attack.", "title": "The Perfect Hotel", "user": "Resmama", "date": "January 30, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54779186}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "The room still looks a bit tired and not up to the latest standards. I understand management is busy upgrading those rooms that were more heavily affected by the attacks. My room still had an old-style TV and I don't like the bathtub without real shower.", "title": "its too improve from old..", "user": "nikhilswadas84", "date": "January 28, 2010", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 54570859, "likes": {"liked": "— its too good"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2011", "text": "Not stayed here since before the fire. We booked it with some trepidation, we needn't of bothered. Everything was as good as before and the staff were brilliant, friendly and efficient. The pool area has actually improved.", "title": "Great to See it Back to it's Former Glory", "user": "Gardenergirl01", "date": "December 30, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 122285825}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "Staying at The Taj Palace in Mumbai was an absolute pleasure. Here are all the great things about staying there:", "title": "Great service and phenomenal experience!", "user": "Ashgoldberg", "date": "December 30, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 122284762}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "- amazing service. All of the staff speak perfect English and are always wanting to please and be of help.", "title": "The Royal Pleasure", "user": "Sandeep_katta", "date": "December 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122207845}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "- beautiful facilities and restaurants. Absolutely gorgeous facility with a huge pool and lounge area. There are many restaurants to choose from all with excellent food.", "title": "The best experience you could have in India!", "user": "ashgToronto", "date": "December 28, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 122178607}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "- great location. This hotel is in the heart of Mumbai right across from the water and in a very safe tourist location.", "title": "Treated like royalty", "helpfulness": 2, "user": "JoziJetsetter", "date": "December 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122136583}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "It is truly the best hotel in Mumbai. Superbly furnished. BEst sea view and facing the Gateway of India. CLose to most tourist spots. Great food and outstanding service. No complaints", "title": "Best Hotel in Mumbai", "user": "DBSMumbai", "date": "December 7, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 50778298}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Well i really enjoyed my stay here, the view over the Gateway of India is also amazing, the rooms, beds, facilities are all up to standard. with great television/reception channels for when you just want to relax. However the main problem was that there was sometime too much noise outside the rooms and the beds felt damp, this we found out was because of building which had take place recently.", "title": "Great/Okat", "user": "davesh94", "date": "December 4, 2009", "detail_rating": {"front_desk": 5.0, "service": 3.0, "business": 5.0, "cleanliness": 4.0, "rooms": 4.0, "location": 5.0}, "id": 50645016, "likes": {"liked": "— the facilities available", "disliked": "— the building noise"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "It was my birthday and my husband had booked a weekend in Taj. It was one fabulous break. The hotel is awesome. The moment u step into it u feel u r privileged few. The staff is exceptionally polite and helpful and also well informed about the Hotel's history. Part of the hotel was closed to the public due to the 26/11 tragedy. We dined @ the Souk. The Hotel's Mediterranean Restaurant. The cuisine was new to us yet the dishes were quite delectable. We were seated at a corner table with full view of The Gateway of India and city lights of Mumbai. The table was specially decorated with flowers since it was my bday. Dinner ended with a very yummy cake from the restaurant's own bakery .", "title": "Unforgettable Birthday", "user": "GLobetrotterMumbai", "date": "December 4, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 50628306, "likes": {"liked": "— The view", "disliked": "— traffic around the location"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "It is a beautiful place , full wit heritage and fantastic ambience..", "title": "A place or i may say a palace i stayed in", "user": "naimem", "date": "December 4, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 50612562, "likes": {"liked": "— the hotel", "disliked": "— mumbais traffic"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "i loved my stay there..the staff is over friendly and the food is the best.", "title": "Taj - Still Lives Upto Mark after the terror attack", "user": "samshaikh", "date": "December 4, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 50604602, "likes": {"liked": "— Ambience", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We stayed here for 2 nights (but really 3 full days) at the tail end of our 2-week Northern India trip. We knew in advance that the palace rooms had not yet re-opened but we were upgraded to a seaview suite in the Towers. The service in this hotel is truly exceptional from top management to butler. Our travel agent had informed the hotel that it was my wife's birthday and they sent no fewer than 4 arrangements of roses to our room, with one set of white roses being individually presented by a staff of butlers, as well as a set of luxurious skincare lotions. She also received a personalized birthday cake and a bottle of champagne (although this may have come from our travel agent). The location of the hotel is perfect and the security is excellent and very efficiently handled. The hotel has a magnificent pool and we also enjoyed having breakfast outside the dining room under the veranda facing the pool. The concierge staff also went out of their way to locate the novel Sacred Games for us, which they proceeded to gift wrap and send to one of our tour guides in Aurangabad. They also tried to find a particular Bollywood DVD for us and, when they discovered that it was unavailable, offered to present us with the hotel's copy. (Unfortunately, it did not have English subtitles but we will be able to purchase or rent it in the U.S.). Since our flight home was not leaving Bombay until 3:30 AM, we had reserved our room until 9:00 PM but the hotel graciously allowed us to keep it until our checkout at midnight at no extra charge. Our travel agent had told us that this was the only place to stay in Mumbai and we have to agree.", "title": "Top of the Line", "user": "DCRE", "date": "April 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 60094956}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "Excellent location,Truly Indian,courageous staff.", "title": "PRIDE OF INDIAN HERITAGE HOTEL", "user": "drishti_00", "date": "March 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 59389225}, {"rating": 5.0, "stay_parameters": "Stayed March 2007", "text": "One of the best hotel in india which resembles the owners TATA name & brand quality.", "title": "Best hotel in Mumbai and a wonderful tourist attraction.", "user": "supremeMumbai", "date": "March 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59388466}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled solo", "text": "One must visit the hotel ,if you are in mumbai.", "title": "5star hotel", "user": "deepzaveri", "date": "March 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 59034335}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "Exceptionally magnificient hotel and tourist attraction.Excellent food and service.India is proud to have this best hotel on its land.", "title": "The PLace Of Heaven", "user": "Samcool87", "date": "March 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58877611}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "taj palace as the name stands is truly a palace, what you could see in movies.", "title": "a palace", "user": "manish_s31", "date": "December 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121924755}, {"rating": 5.0, "title": "Best One", "text": "all the amenities are truly palatial.", "helpfulness": 2, "user": "nasirhafeez1", "date": "December 20, 2011", "id": 121923699}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "the adjoining tower is much recently built and complements the old palace hotel.", "title": "Spectacular!", "user": "Shavasti", "date": "December 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121825066}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "from the 15th floor of the tower, the gateway of india, the ships in the sea and the movement is truly granderistic. Ofcourse the per night charges are truly high, but if you get a good package, you could afford the rooms.", "title": "Fan - Tastic", "helpfulness": 3, "user": "expectant customer", "date": "December 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121804743}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "But the presidential suites are out of affordability, only for ministers, presidents and celebrities.", "title": "A delight of a hotel", "helpfulness": 1, "user": "aber_james", "date": "December 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121800178}], "location": {"country": "India", "region": "Maharashtra", "continent": "Asia", "city": "Mumbai (Bombay)"}, "stars": 5, "variance": {"poor": 20, "average": 95, "very good": 324, "terrible": 24, "excellent": 1404}, "aka": "Taj Mahal Palace Hotel Mumbai (Bombay)", "slim_ranking": 0.00547945205479, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "The history of Mumbai and The Taj Mahal Palace are dramatically intertwined. The hotel is Mumbai’s first harbour landmark (built 21 years before the Gateway of India) and the site of the first licensed bar in the city. For more than a century, the Taj has played an intrinsic part in the life of the city, hosting Maharajas, dignitaries and eminent personalities from across the globe. Today it is a Leading Hotel of the World and favourite destination for discerning business travellers. A treasure-trove of invaluable memorabilia, there is a story to tell behind every pillar, a landmark deal in every boardroom, and a storied celebration under every awning. Come be a part of the legend.Overlooking the Gateway of India with a panoramic view of the bay, every one of the 560 rooms including 44 suites are the perfect blend of rich history and modern convenience."}