{"user_rating": 3.5, "review_count": 356, "name": "The Glynhill Hotel & Leisure Club", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Visited the Glynhill with my family on Saturday the 26th of October to celebrate a special occasion. The food was so so and suited the purpose however the service from a female member of staff really put a dampener on the evening. She walked away from an elderly relative mid order with no explanation, it was only when 20 minutes past we realised she wasn't coming back. She was miserable the whole evening and just gave the impression she didn't want to be there.", "title": "Service was a bit hit or miss", "helpfulness": 11, "user": "Rachael M", "date": "October 29, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0}, "id": 182784042}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "I completely understand that noone really wants to work a Saturday night but there's no need to be rude to customers. When she eventually took an order she sighed half way through it and then took an hour to bring one drink back to the table. It just got to the point where it was quicker for us to walk through to the bar near the main reception rather than have the ordeal of speaking to this girl.", "title": "Unbelievable value for £75 a night", "user": "scott f", "date": "October 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 182550347}, {"rating": 1.0, "stay_parameters": "Stayed September 2013", "text": "I got the impression that the other staff were definitely picking up the slack from her poor service as I know that myself and our party weren't the only people that were unhappy with her customer service skills.", "title": "Meh. Not improved.", "helpfulness": 12, "user": "Samantha S", "date": "October 22, 2013", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 2.0, "service": 2.0, "rooms": 2.0}, "id": 182022545}, {"rating": 1.0, "stay_parameters": "Stayed October 2013", "text": "The service from a female manager and the two male staff that were serving our table was great and we really couldn't fault them if we tried. We were also served by another male member of staff that seemed to be attending to the bar, he went out of his way to fetch a pot of tea for my gran and was given first class customer service from him.", "title": "Not impressed", "helpfulness": 16, "user": "Alanabeau", "date": "October 15, 2013", "detail_rating": {"cleanliness": 3.0, "location": 5.0}, "id": 181149200}, {"rating": 3.0, "title": "Don't be fooled by the \"free\" shuttle service to airport!!", "text": "i stayed 3 nights in this hotel last week. I regularly stay in hilton hotels throughout the world but mainly in the UK. However this hotel is 5 mins from the airport either by taxi or the free shuttle bus provided by the hotel and has all the same attributes and more. The leisure club has a swimming pool and gym, there are many eating options and the food is high quality. The friendly staff direct you through the many options in the staff and they are always happy to chat to a lonely traveler. My room was clean and very good quality for the money. I was able to get into the centre of glasgow in a 10 minute taxi. Great value hotel which is in a fantastic hotel", "helpfulness": 9, "user": "A TripAdvisor user", "date": "October 13, 2013", "id": 180807862}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "Stayed one night for a family function. The rooms are basic but very clean. We ate in the carvery for dinner. The food was alright but the service was a little chaotic. The staff were rushed off their feet and it felt like there weren't enough to cope with the number of diners.", "title": "Good location for the airport", "user": "jamiebfUK", "date": "October 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 180254612}, {"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "The room keys are actual keys on a footlong keyring (which isn't very handy to fit in your pocket!) Made us chuckle though.", "title": "Poor service", "helpfulness": 15, "user": "dopey45", "date": "October 8, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 180160239}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The hotel has a spa with swimming pool, sauna, jacuzzi etc, unfortunately I didn't have time to visit it.", "title": "Tired and Noisey", "helpfulness": 14, "user": "Lorraine1096493", "date": "September 30, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 179180871}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "There are two bars in the hotel, Harrys Bar and a smaller bar near reception. The smaller bar is much better than Harrys and feels more cozy.", "title": "Needs a rethink", "helpfulness": 13, "user": "698davidh", "date": "September 19, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 177830722}, {"rating": 1.0, "title": "Very poor", "text": "The rooms were noisy at night with children running riot it seemed up every corridor into the wee small hours. Not the hotels fault mind you, more the parents who allowed their little dears to run amok.", "helpfulness": 14, "user": "KH1Wythall", "date": "September 18, 2013", "id": 177715413}, {"rating": 3.0, "title": "Definitely not 4 star", "text": "Don't get me wrong, this is a very nice hotel. Reception area, bars, and function rooms all very nice. The rooms are fine although nothing that would set it aside from any nice 3 star hotel. Everywhere is very clean and fresh and I slept well.", "user": "MHenderson734", "date": "November 5, 2013", "id": 183618404}, {"rating": 3.0, "title": "great breakfast", "text": "Where's the problem? Service.", "user": "cazandchaz", "date": "November 2, 2013", "id": 183265396}, {"rating": 3.0, "title": "Modern decor, heating/air con let down", "text": "The reception and bar staff both great. But the restaurant staff in the carvery grill and the breakfast staff are awful. Very unfriendly, unorganised, messy, unattentive, to be honest I don't really know what they do.", "user": "Emma P", "date": "October 30, 2013", "id": 182912204}, {"rating": 4.0, "title": "The Glynhill", "text": "At the carvery, we were seated but not given any information about how to work the carvery, how to order starters or drinks. We were literally seated and not spoken to again until I requested the attention of a waitress. Starter plates were not cleared and left piled up on the already small tables which meant we had to eat our main course around them - most other tables were in the same situation. No new cutlery was given out for main course. When we left the table all the plates were still piled up and we were not offered desert.", "user": "Raymie3", "date": "October 29, 2013", "id": 182865334}, {"rating": 4.0, "title": "Service let it down", "text": "Breakfast? Disaster. The woman who was wearing a red tie and I assumed to be some kind of supervisor was horrible. Every table was messy. Resets were not done properly and tables reset with half the required cutlery. I asked for a pot of tea, was told I would get it shortly, never heard about it again and ended up just leaving without having tea. Constantly running out of bowls and plates at the buffet and had to chase the FOH staff to get such things - in fact the chefs were coming out with bowls as the around 6 FOH staff seemed incapable of running around 20 breakfast buffet covers.", "user": "Tourman2", "date": "October 29, 2013", "id": 182801997}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "I may well have been on the same delayed flight as the preceding reviewer. Knowing venues in the Paisley-Renfrew area to some degree, when our flight turned back and we were told we would have to stay overnight in a local hotel, my heart sank. But I was very positively impressed with the Glynhill.", "title": "Surprisingly good", "user": "John987654321", "date": "November 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 185475606}, {"rating": 5.0, "stay_parameters": "Stayed November 2013", "text": "The management and staff handled180 unexpected guests exceptionally well. Although, inevitably, it took a while, reception registered guests quickly and helpfully, with suitable rooms ready for all. A good buffet was organised in their function room in a matter of minutes, and - as the preceding reviewer says - the pressured bar staff were outstanding, dealing with all manner of requests speedily and exceptionally cheerfully. And I should say that every member of staff, many of whom were apparently called in from a quiet Sunday evening in their own homes, was as pleasant and helpful as they could possibly be.", "title": "Delayed flight :)", "helpfulness": 2, "user": "CatherineFen", "date": "November 17, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 185004459}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "I managed a few hours sleep in the room before the buses returned in the middle of the night to pick us up for the journey, and the bed was very comfortable. The room and en-suite were appointed to standard that regular business expect.", "title": "Overnight stay", "user": "Robert J", "date": "November 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 183837041}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "Although this is a suburban hotel with no special pretensions, I found nothing to criticize. I would be very happy to make a longer stay at the Glynhill if I again needed to stay over in Paisley or Renfrew.", "title": "good place for a night out", "user": "Colette B", "date": "November 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 183787774}, {"rating": 2.0, "stay_parameters": "Stayed November 2013, traveled solo", "text": "I am writing my review from my room incase I get home and forget to mention how good this hotel is.", "title": "very dirty room", "helpfulness": 7, "user": "Joyce M", "date": "November 5, 2013", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 1.0, "location": 2.0}, "id": 183689449}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3.5, "variance": {"poor": 47, "average": 76, "very good": 111, "terrible": 39, "excellent": 83}, "aka": "The Glynhill Hotel And Leisure Club", "slim_ranking": 0.333333333333, "description": "This commended 145-bedroom hotel is ideally located only 1 mile from Glasgow International Airport (not in flight path), 5 minutes from Braehead Arena & Shopping Centre, Xscape Leisure Park and 10 minutes from Glasgow city centre. The hotel now boasts 97 rooms of the modern, contemporary club style. A new guest lift has been installed to service 3 floors of bedrooms; facilities also include 3 bars, Carverie, Bistro and Gourmet restaurants with weekend entertainment and an exclusive leisure club."}