{"user_rating": 4.0, "review_count": 1048, "name": "The Algonquin Hotel Times Square, Autograph Collection", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "The Algonquin Hotel bills itself as the oldest operating hotel in New York City, and is surely appears that it is.", "title": "Algonquin Hotel is a Dump", "helpfulness": 7, "user": "LEJQ", "date": "January 27, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 6705691, "likes": {"liked": "— Location", "disliked": "— everything else"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Firstly, they claimed on their website that they had done renovations to the hotel, which from what I could tell only including slapping up plasma TVs on the walls and calling it a day. The rooms are abominable-dirty furniture, 19th century plumbing and ancient, broken climate controls.", "title": "Fabulous Experience", "helpfulness": 1, "user": "Dianne&Ted", "date": "January 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6692472}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "Secondly, the charm of this \"luxury\" hotel lies with the \"Algonquin round table\" where legendary authors gathered and talked literature. This \"round table\" room has possibly the most dreadful food I have experienced in New York. The french onion soup was burnt and the hamburger raw.", "title": "Beautiful but slow and boring", "helpfulness": 2, "user": "Beans and Cornbread", "date": "January 12, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 5.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 6583964, "likes": {"liked": "— The common area decor", "disliked": "— The waitstaff, bartenders and hosts"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "Thirdly, the mystic of the hotel lies with it's purported impeccable service. Well apparently, service involves a collection of untrained pseudoadolescents who apparently have been mistaken for hotel management/workers. The young girl who greeted me on arrival couldn't find my reservation and then proceeded to ask me if I was actually at the right hotel. Considering I had arrived late-(don't make that mistake-you will end up in one their unsued rooms that they keep for emergencies-translate \"unused\" as dirty and in poor repair) and had called ahead to let the hotel know, I was very concerned that this smarmy prepubescent couldn't find my reservation.", "title": "Good but Expensive", "user": "Dagdabear", "date": "January 11, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 6575234, "likes": {"liked": "— high quality, clean, beautifully furnished", "disliked": "— Poor room servicing"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Fourthly, when I called repeatedly (three times in one night) to report the complete disrepair of the air conditioning/climate control, I was told that this was my fault-apparently allowing guests to control their own climate control is unacceptable-and that the unit was frozen up and could not be repaired. Yet, this brought no rectification of the matter. I then attempted to open the windows in the room and was reprimanded by staff that this was not allowed.", "title": "Good hotel in great location", "helpfulness": 3, "user": "DevaEboracum", "date": "December 28, 2006", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 4.0}, "id": 6506921, "likes": {"liked": "— Great location", "disliked": "— Nothing"}}, {"rating": 3.0, "title": "OK but room so small...", "text": "Stayed at the Algonquin over New Year 2004/5.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 20, 2005", "id": 3289675}, {"rating": 2.0, "title": "Disappointed", "text": "Hotel looked impressive and staff attentive and helpful.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "March 17, 2005", "id": 3282777}, {"rating": 5.0, "stay_parameters": "Stayed March 2005, traveled on business", "text": "Food and drinks expensive.", "title": "A Gem with History", "helpfulness": 4, "user": "Blankko", "date": "March 10, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3263661}, {"rating": 2.0, "stay_parameters": "Stayed January 2005", "text": "Room was very small - hardly any floor space at all. Although I was not expecting much of a view in New York it was a bit disappointing to look out of your window at a brick wall!", "title": "Tiny room and no hot water", "helpfulness": 5, "user": "swelch", "date": "March 4, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 2.0}, "id": 3251293}, {"rating": 4.0, "title": "Best Hotel Experience", "text": "Reedeming feature of the stay was the wonderfully comfortable bed.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "February 23, 2005", "id": 3223080}, {"rating": 2.0, "stay_parameters": "Stayed November 2004, traveled on business", "text": "We've always enjoyed stopping in the lobby at the Algonquin for a drink after a busy afternoon. We finally took the plunge in November and stayed there four nights. We like the atmosphere, and the room was recently redecorated. But I can honestly say we will never stay there again.", "title": "Algonquin's room smallest I ever stayed in", "helpfulness": 4, "user": "connmcd", "date": "February 21, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 3213182}, {"rating": 5.0, "stay_parameters": "Stayed February 2005", "text": "I asked for a bigger room and a regular tv as opposed to a smaller room with a flat screen tv. The clerk must have misunderstood me because we got a flat screen tv in a small room. In order to go from the bathroom to the doorway, I had to crawl across the bed when my husband was sitting at the desk. If the desk wasn't being used, I could walk on the floor the whole way. He was particularly shocked at the size of the room. We planned to ask for a change, but our timing didn't work out.", "title": "A Wonderful New York Memory", "helpfulness": 4, "user": "kaikor43", "date": "February 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3205753}, {"rating": 5.0, "title": "Favorite Midtown Hotel", "text": "The other thing--we dislike staying at hotels where we can't get our own ice. The first night I had to come down to the front desk, and the next night, they brought it up which surprised me because the night before they told me the person to deliver it was gone for the night.", "helpfulness": 5, "user": "ThePlainsman", "date": "February 8, 2005", "id": 3169280}, {"rating": 5.0, "title": "We love this hotel!", "text": "The staff was nice.", "helpfulness": 4, "user": "natkoehler", "date": "February 3, 2005", "id": 3119433}, {"rating": 2.0, "stay_parameters": "Stayed January 2005", "text": "Apprehensive returning after the renovation, I found myself excited with an anticipation akin to a meeting with a long-ago love. Some of the reviews I had read were not entirely favorable. But I tossed caution to the wind, and I am so glad that I did. When I arrived late, the front desk person arranged for the restaurant to remain open for a delicious late night dinner and while dining brought the key to a room with a queensize bed that I had requested. The room was as I remembered, only now with vibrant colors, buttery linen, plush towels, sparkling bathrooms and a welcome, relaxing water pressure in the shower. The bed was so comfortable, I immediately fell asleep while watching the new flat screen television. Housekeeping was efficient, replacing a bulb within minutes. Room service is prompt and congenial.The signature bottled water is a charming touch and plentiful upon request. When I forgot my reading glasses at a store around the corner from the hotel, the concierge, Kevin retrieved them while I warmed myself from the February chill in the sumptuous lobby, sipping a brandy, reading one of the many complimentary newspapers and sampling a sweet. Although I did not have reservations for the Oak Room, the lovely,accomodating hostess arranged a table for me where I experienced a not soon forgotten fabulous performance by KT Sullivan and Mark Nadler. How luxurious not to have to leave the hotel for such high calibre entertainment! The location is central to the theater district,shopping and many restaurants. As a woman traveling alone, safety is always important. The front desk staff and doormen always greeted me personally so that I felt more than comfortable. At the last moment, I went to Central Park to take in the spectacular Gates, Cristo and Jeanne Claude's gift to New York City, and spontaneously bought a print which was too big to carry on the plane. The concierge arranged to have it sent to me and it just arrived!Thinking of my stay in New York, while I am reluctant to recommend the Algonquin, since I would like it to remain my special place, I truly feel this unique hotel and it's staff should be appreciated and highly recommended as the jewel that it was and STILL is. It was a memorable week, and I can only hope there will be availability for me when I return to New York", "title": "Stay here only in a pinch", "helpfulness": 8, "user": "Canadianknowitall", "date": "January 24, 2005", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 3045867}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The Algonquin isn't perfect, but I love this place. I stay here whenever I'm in New York and I'm always happy that I did, although it is NOT CHEAP. The staff is friendly and helpful and it's small and intimate rather than huge and corporate. (There's even a lovely hotel cat...) The location is ideal --an easy walk to the theatres and to MOMA. The decor is self-consciously historical, with endless references to its 1920s Round Table heyday -- including the New Yorker cartoon-themed wall paper in the hallways and the large portrait of Benchly, Parker, Wolcott& crew in the dining room.", "title": "My Favorite New York Hotel", "helpfulness": 6, "user": "PhoebeZamboni", "date": "November 20, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6155889, "likes": {"liked": "— Ambiance and service.", "disliked": "— No morning coffee in the room or in the lobby!!"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2006", "text": "Overall, the tone is classic rather than contemporary (plenty of wood and very little plastic) although there are the modern amenities you expect at this price range -- internet access and flat screen televisions. The rooms are lovely (high ceilings with moldings) and immaculate and the beds are INCREDIBLY COMFORTABLE. There's a lovely knitted wool blanket at the foot of each.. (The views aren't much to speak of, but the window treatments are lovely.) Actually the rooms are so pleasant it's tempting to spend a lot of time loafing around the room. Each room has character and good art on the walls, a wood desk and lamps with good reading light. And very comfy plush terry cloth robes are provided for your loafing pleasure.", "title": "History at a cost!!!!", "user": "NYC17", "date": "November 16, 2006", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 2.0}, "id": 6137856, "likes": {"liked": "— Alleged dishonesty of staff and lack of concern/professionalism by management", "disliked": "— Be careful!!!!"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The water is always hot enough and the water pressure is always terrific.", "title": "Small rooms, great service", "helpfulness": 3, "user": "guej", "date": "October 26, 2006", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 6015744, "likes": {"liked": "— Lobby lounge and great customer service", "disliked": "— Size of rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "What the Algonquin lacks is coffee and ice. There is NO ICE in the room and none available unless you phone the desk and ask for it to be brought to the room. This is silly and inconvenient. Even worse, for me, there is NO MORNING COFFEE AVAILABLE unless, again, you want to pay a fortune to get a small (for me) pot brought up to your room. There should be either in-the-room coffee makers or complimentary coffee in the lobby in the morning. Or both! (There are two Starbucks within a few blocks. and the restaurant next door, The Red Flame, is a good place to get a reasonably priced and more than adequate breakfast.) Other observations:", "title": "Wonderful experience", "user": "RProud", "date": "October 25, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6011636, "likes": {"liked": "— Comfort", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Check in is always a breeze. I always request early check in and so far a room has always been available when I get there at mid day. Some rooms are quieter than others and some rooms are smaller than others. There are NO KING SIZE BEDS. Only twins and queens.", "title": "Building site!", "helpfulness": 3, "user": "Manginiboy", "date": "October 25, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 1.0, "rooms": 1.0}, "id": 6009301, "likes": {"liked": "— It was next to red flame cafe", "disliked": "— Pretentious,over rated , very false"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2006, traveled with friends", "text": "We went to NYC for our annual shopping/show weekend before Christmas and decided to stay at the Algonquin. Everything about the hotel was certainly first class except the room service!", "title": "Lax room service", "user": "dellast", "date": "December 19, 2006", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 6472026, "likes": {"liked": "— rooms", "disliked": "— room service"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Be forewarned, room service only operated from 7 am until 11 pm. so if you go to a show and might like coffee and a little something afterwards, do it before you get back to the hotel, because room service is closed at 11 p.m. They wouldn't even bring up a bucket of ice. We were told that if we wanted ice, we could go down to the lobby and get it....imagine that!", "title": "Fair value!!", "helpfulness": 4, "user": "nroth", "date": "December 15, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6445083}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "Also, if your flight is an early one, don't depend on the Algonquin for coffee before you leave...no room service until 7am. They have complimentary coffee in the lobby, but I have to drink decaf and there was none and I was told that the regular coffee was just horrible!", "title": "Had a fab time at the Algonquin", "helpfulness": 2, "user": "SuzanneWales", "date": "December 1, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6314475, "likes": {"liked": "— rooms", "disliked": "— Have to use lift as there are a lot of stairs"}}, {"rating": 5.0, "title": "Thanksgiving in New York", "text": "Anyway, other than those room service issues, the stay was just fine. Might try somewhere else next year, though.", "helpfulness": 4, "user": "35belmont", "date": "November 27, 2006", "id": 6183006}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "We stayed here from dec9 til dec13 2006 and here is our experience:", "title": "Just loved every moment", "helpfulness": 3, "user": "shall3663", "date": "November 21, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6160264, "likes": {"liked": "— The atmosphere", "disliked": "— N/A"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2004", "text": "The Algonquin in itself is a great hotel. Its in the perfect area, the hotel is emaculate, very historic and has a terrific bar. However, I payed the lowest rate possible and was stuck in a room that was so small me and my girlfriend broke down laughing when we saw it. To say it was more then 100 square feet (not counting bathroom) would be a stretch. The bed took up more then half the room and when our room service breakfast was brought to us there was hardly any room to walk around and eat. I have stayed in many NYC hotels and understand that they are small, especially if you pay the lowest rates, but this was just absurd. The decor was fine and it was clean, but I dont know ANYONE that would feel comfortable in a room this small. Im sure from reading some other reviews that people on here were in larger rooms. I would still REC. this hotel though, just make sure you dont get stuck in my oom. We were so tired when we checked in that we couldnt muster up the engery to argue for a bigger one.", "title": "Laughably small room.", "helpfulness": 6, "user": "icem2829", "date": "July 6, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 2.0, "service": 5.0}, "id": 3639412}, {"rating": 4.0, "stay_parameters": "Stayed July 2000", "text": "It is a few years since my wife and I stayed here, on honeymoon, but I thought it worth sharing our excellent experience. I imagine the timeless character of the place will never change.", "title": "Very atmospheric", "helpfulness": 3, "user": "Zarek", "date": "June 29, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 3621212}, {"rating": 5.0, "title": "Algonquin A++", "text": "The 1930's design was wonderful and the fact that my wife was a Dorothy Parker fan made this the perfect place to stay in New York. The staff were friendly and helpful and we got the traditional free bottle of Champagne in our room which was very acceptable. The location is very convenient too.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "June 23, 2005", "id": 3606362}, {"rating": 5.0, "title": "Great experience", "text": "Was there any downside ? Will the room was small and a little tatty - I hear there has since been a refurbishment. The view from the window was grime and air conditioning units, however this was so stereotypical New York I quite enjoyed it. Breakfast was excellent and most atmospheric but also exhorbitant. Little did I realise that every time the waiter topped up our freshly squeezed orange juice (which was frequently) it was an additional $15 on the bill. After the first day we had breakfast at the diner next door which was very good value.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 13, 2005", "id": 3548190}, {"rating": 5.0, "title": "Great Hotel", "text": "I would thoroughly recommend the Algonquin for a honeymoon stay or other romantic break. Treat your partner !", "helpfulness": 3, "user": "A TripAdvisor user", "date": "May 31, 2005", "id": 3514601}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "Myself, along with 7 other women stayed at the Algonquin May 18 through the 23. We had a great stay. Yes..the rooms are small but they are clean, comfy and room service was on the spot. The beds are to die for comfortable. We all slept like babies! The people are wonderful, friendly and always happy to help with questions from finding the right bus, subway or last minute tickets to a Broadway show. I have read that the drinks are expensive and yes its true but they are everywhere you go. The lobby is the perfect meeting place to catch up on the day, have a cocktail or even spot a celeb...Robert Downey, Jr. The location is excellent! Don't believe all of those cranky people in the reviews....I researched for hours on Trip Advisor before choosing the Algonquin and I am happy to have made the perfect choice! It is fantastic!", "title": "Wonderful Little Hotel", "helpfulness": 7, "user": "coolrealestate4u", "date": "May 25, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3500693}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "Anyone expecting a flashy grand hotel will be disappointed here, but I was thoroughly thrilled to find the Algonquin exactly what it professes to be -- a charming, old-world-style hotel amid the bustle of the Big Apple. Staff always friendly and helpful, the legendary bar is warm and cozy, plenty of hot water available, and the beds are incredibly comfortable. Yes - the rooms are small (like most big city hotels) but more than adequate in size for two people with a moderate amount of luggage. Well worth the $264 a night. And Mathilda the cat is a unique extra!", "title": "History and Charm", "helpfulness": 6, "user": "MomFromTheOC", "date": "May 24, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3498100}, {"rating": 5.0, "stay_parameters": "Stayed August 2004", "text": "My Son took me to NYC for my 50th birthday August of last year. What a wonderful hotel. From the moment we arrived to the minute we left a truly nice and good experience. Arrived 5 hours before check in time, no problem. Staff always helpful. Rooms nicely decorated and very clean. Nice location seemed to be close to everything. Would stay again and actually plan on it.", "title": "Wonderful Birthday....", "helpfulness": 4, "user": "Earthspirit", "date": "April 14, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3357669}, {"rating": 5.0, "title": "Fantastic", "text": "Just returned from a 4 night stay with my 13 year old son. We had a wonderful time here! The atmosphere alone is worth a visit. The history of the hotel has been kept but made better! The staff was friendly and helpful every time we needed something. The lobby is filled with locals enjoying a drink or meal but also allowed my son to sit and read and have a soda in the afternoon. Matilda the cat is a hit with everyone and very visable at the front desk - always glad to take a picture!", "helpfulness": 6, "user": "A TripAdvisor user", "date": "April 4, 2005", "id": 3327032}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "Our room was two twins (had heard they were the largest) and we were not disappointed! Freshly painted - looked totally new! Comfortable beds and pillows, very clean and neat, room temperature controlled by us, bay window, lots of space for luggage and extras. The bathroom was small (stand up shower only), but with a large desk in the room had plenty of space there. No problems with hot water any time of day. Lots of thick towels (no skimping here) and robes. I can't say enough about how clean everything was from the front door to our room. I would recommend this hotel to anyone and I've stayed in some really great hotels!", "title": "Loved the Algonquin", "helpfulness": 6, "user": "swaffy", "date": "March 21, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3292509}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "My friend Penny mentioned that the Algonquin had a great cocktail bar, so I decided to take a look at the hotel, never imagining that it would meet our budget (£100 per night for two) but they had a great price offer for our late Feb visit. The public rooms are fabulous - a little bit of New York literary history. We loved the wallpaper (in the hallways) with NY Times cartoons.", "title": "Matilda rules", "helpfulness": 4, "user": "eiluvtravel", "date": "March 5, 2007", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6918382, "likes": {"liked": "— very stylish but affordable", "disliked": "— waiters congregate around the blue room bar and their conversation dominates."}}, {"rating": 2.0, "title": "Noisy!!", "text": "We were warned that the rooms would be small but our twin room was normal size for Europeans, and well furnished and well equipped. Very comfortable beds and a good flat screen tv/", "helpfulness": 2, "user": "jacktripper", "date": "February 25, 2007", "id": 6837157}, {"rating": 5.0, "title": "Cheery, homey, all that we wished for", "text": "The Oak Room was closed on the two nights we were there, and we think they missed an opportunity to do something special on Oscar night (but New York generally seemed less than interested in the Oscars, are they jealous that LA is focus for the night?).", "helpfulness": 10, "user": "Kamaila", "date": "February 17, 2007", "id": 6805170}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled solo", "text": "The Blue Room is a famous cocktail bar - you should definitely go in for one, but then go and find somewhere more interesting, with better service, for the next one. The lobby has much more atmosphere. Bar food not recommended - we were tired after our flight for London so we ate in the bar, but you wouldn't have to go too far to get better food and better price as the location is so good.", "title": "old style charm", "helpfulness": 3, "user": "manwithsuitcase", "date": "February 11, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6779389, "likes": {"liked": "— comfortable bed"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "And if you do decide to check in, do say hello to Matilda, the Algonquin cat. She even has her own business card!", "title": "Small Treasure, The Algonquin", "helpfulness": 9, "user": "CarolCPhiladelphia", "date": "February 11, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 6778124, "likes": {"liked": "— Space"}}], "location": {"country": "United States", "city": "New York City"}, "stars": 4, "variance": {"poor": 72, "average": 122, "very good": 366, "terrible": 50, "excellent": 438}, "aka": "Algonquin Hotel New York City", "slim_ranking": 0.322799097065, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "The ultimate in civilized Manhattan accommodations, the Algonquin was the site of the legendary Round Table literary gatherings."}