{"user_rating": 4.5, "review_count": 88, "name": "The London EDITION", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "We stayed here for a week about 2 weeks after they opened. Staff is amazing!! Everyone, from the men that open the doors for you, desk clerks, room service (Avocado on toast with poached egg for breakfast) and concierge Ro Kapila who was a huge help to us with our shipping needs.The Lobby/bar is stunning. Our king size bed room was bigger than we thought it would be and the bed was so comfortable!! We had dinner at the Berners Tavern. Great meal, wonderful service. We also got to enjoy the Punch Room. The location is just off Oxford Street. So of course close to everything. A great addition to the Marriott family.", "title": "Excellent New Hotel", "user": "Abidah", "date": "October 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183076741}, {"rating": 5.0, "title": "Great staff make this a great new hotel", "text": "Well trained staff made this a perfect stay right from the moment we arrived. We spent an enjoyable 2 hours at the bar. The bar snacks from Jason Atherton's restaurant are well worth trying. Our room was a decent size for London hotels. In the evening the lobby gets very busy as it doubles up as bar space. Great for people watching! We'll definitely be staying here again.", "helpfulness": 1, "user": "Kenpank", "date": "October 27, 2013", "id": 182597120}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Great way to spend a few hours watching Fitzrovia have fun. Lobby bar impressive, smart service there too. Dining room itself vast but not a lot of great tables at which to dine, however the noise, not helped by the pumped music, drowns out any conversation from adjacent tables.", "title": "Fun", "helpfulness": 2, "user": "Eldridge79", "date": "October 26, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0}, "id": 182454516}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Food good and different, not ridiculously expensive- incorrect bill swiftly amended with good grace, staff not quite at ease yet with the enormity of the environment they're subjected to, but more than coped.", "title": "Berners Tavern - a decibel away from perfect", "helpfulness": 1, "user": "Samantha E", "date": "October 26, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0}, "id": 182431627}, {"rating": 5.0, "title": "Lovely", "text": "A must visit place even if the loos are a challenge to find!", "helpfulness": 2, "user": "Lulwa A", "date": "October 26, 2013", "id": 182419330}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "First off, this place is EXPENSIVE... but so worth it. The staff were the nicest people I have ever come across in a hotel. The best thing about this hotel is the bartender. I think his name is Martel, but I do know he is Italian and watching him make drinks was impressive. And the chips were amazing! I loved every drink he made. As far as the room, I found it to be comfortable, with comfy pillows, and the bathroom was pretty nice as well. It did seem like a business hotel, but has a trendy vibe. With the pretty girls and guys opening doors, you felt as if you were going to a club when you entered the lobby. The area is in the heart of shopping and food but can get a bit crowded when leaving the Underground and searching for the hotel. Overall, this is a pretty nice place and would stay here again.", "title": "Trendy, Great Bar Tenders, and Comfy Pillows!", "helpfulness": 1, "user": "GrlTrvlr", "date": "October 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 182395294}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "Food was fantastic last night - we had the lamb starter and then the halibut with squid ink risotto and chilli squid topping. Best food i have had out this year.", "title": "Food was so delicious", "helpfulness": 2, "user": "Sian B", "date": "October 25, 2013", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 182317595}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "Room glamorous and staff were charming.", "title": "Smart", "helpfulness": 2, "user": "nwhoran", "date": "October 25, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 182304583}, {"rating": 5.0, "title": "Outstanding", "text": "I stayed here on business and as soon as I walked in, I fell in love with the bar, restaurant and foyer areas which were quite extraordinary. The room, however was a bit of anticlimax, that said it was extremely comfortable, it just didnt have the wow of downstairs. There was some confusion over payments but this was quickly resolved. Overall I would definitely go back.", "helpfulness": 2, "user": "SPCTraveler", "date": "October 23, 2013", "id": 182162702}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Outstanding new hotel. Recently spent a couple of nights there. I am usually not a big fan of Ian Schrager properties but this is an excellent hotel. Amazing design and top notch service. After only one month of being open you would expect to see a few glitches in their service but everything was flawless and super friendly. Rooms are good sized and super comfortable. Will definitely stay here again.", "title": "The Place To Stay In London", "helpfulness": 2, "user": "wolves05", "date": "October 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181945951}, {"rating": 5.0, "title": "I loved it", "text": "This is a brand new hotel ( opened on September 12, 2013) with warm, but modern design and excellent service.", "user": "Travellersfromswitzerland", "date": "November 14, 2013", "id": 184662823}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "The hotel is generously staffed, there is always and everywhere somebody to attend you. The staff is young, enthusiastic, helpful and efficient. Reception team wears very nice uniform, dark stripped high waist skirt, beige top, black jacket - all modern, elegant, with a touch of nonchalance. I could not take my eyes off this phenomenon. The doormen are very friendly and galant. The morning I was leaving (6.00 am) the young man was insisting to accompany me to the taxi with umbrella even though the distance between the door and taxi was 2 meters and only a small mist was falling from the sky.", "title": "This is better than haven.", "user": "Sherman0714", "date": "November 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 184651783}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "My room (210) was small but it was ok as I was staying alone. For 2 it could be too small. I loved the bed with their soft skin immitation cover, a big mirror in which you can see yourself when you are on the bed. The bathroom had a big sink and some shelves below to put all your goodies, an unresolved problem for many hotel rooms. The shower was big and modern. The towels the thickest and softest ( all brand new! ) ever experienced - I loved them. In the room, there was a bathrobe, very comfortable slippers, iron. The only things that I was missing was magnifying make up mirror in the bathroom and water kettle.", "title": "The currently most hip nd cool", "user": "Hildur O", "date": "November 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 184620387}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "The lobby was totally opposite to my room - it was very spacy. At the entrance you have a smoker table, sitting area with a fire place and a bar. There is also a table with some Mac computers for guests use. The restaurant where the breakfast is served has a very interesting style, with many pictures on the walls and another impressive bar. There is no breakfast buffet but the morning serving is done á la carte. My benedictine eggs were great featuring the lightness that is very rare. I did not dine in the hotel, but I could see that the restaurant was always busy.", "title": "Great experience", "user": "Maxine0", "date": "November 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 184598015}, {"rating": 4.0, "title": "Pretty nice hotel", "text": "The hotel is located at 5 min walk to Tottenham Court Underground station.", "user": "WilAndGabe", "date": "November 13, 2013", "id": 184585659}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "Exceptional Staff, a superb environment with great atmosphere.!", "title": "Very Elegant and Comfortable", "user": "kentcritique", "date": "November 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 184447373}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Fabulous entrance and bar area, lovely dining room with great decor.", "title": "Berners Tavern - amazing dining experience!", "user": "amethyst26_81", "date": "November 8, 2013", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 184077620}, {"rating": 5.0, "title": "Berners Tavern - Go Now", "text": "The bedrooms are slick and well appointed,", "helpfulness": 1, "user": "VikingDevon_UK", "date": "November 6, 2013", "id": 183771237}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled solo", "text": "downside, there is no quiet area and short on reception rooms.", "title": "Almost perfect", "helpfulness": 1, "user": "prettysweetgirl", "date": "November 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183519404}, {"rating": 5.0, "stay_parameters": "Stayed October 2013", "text": "Decor is lovely except for the 'net' curtains ! downstairs and in the bedroom.!", "title": "Some thoughts on the margins", "user": "RADS5", "date": "November 2, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 183257340}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "variance": {"poor": 2, "average": 3, "very good": 23, "terrible": 3, "excellent": 57}, "aka": "The London EDITION England", "slim_ranking": 0.10780669145, "description": "The London EDITION brings together the integrity and character of a historic building with a simple, sophisticated design sensibility, creating a seamless blend of charisma and ease. With 173 rooms, a restaurant, two bars, meeting rooms and a buzzing lobby, the hotel offers a dynamic social hub where guests and visitors can work, relax, socialise and dine all under one roof."}