{"user_rating": 4.0, "review_count": 3809, "name": "The Westin New York at Times Square", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We stayed in a King room at the Atrium Club within the Westin hotel: Atrium Club rooms are lower floor rooms which have recently been remodeled and updated to a modern decor and they feature a club lounge which serves continental breakfast (bagels, cereal, juice, coffee, etc.) and cocktails in the evening and has free beverages (water, soda, etc.)", "title": "Atrium Club: newer, clean, quiet, a decent stay", "user": "ChiquiMonster", "date": "April 7, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 103206718}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "The rooms have very small windows without much view of interest but the room itself is spacious for NY standards and the decor is a light blue which makes it feel lighter and brighter than it otherwise would. Internet access is free and there's a Mac in the room for your use, which was nice.", "title": "Great Room... not so sure about the concierge...", "user": "Luxe333", "date": "April 7, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 103195650}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The bathrooms were short on counter space and the shower also felt small because the shower heads are so big and there's a rack for towels inside the shower. But everything felt new and clean and well organized.", "title": "Great hotel", "user": "voyageurbear", "date": "April 4, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 102845218}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Times Square is not my favorite part of Manhattan to stay in given the touristy glitz and crowded sidewalks, but it's convenient enough and the rates were much lower than in other parts of town for comparable rooms. I think this hotel is a decent option if you get a good rate (we booked ours on the Starwood website and got a 30% off prepaid rate).", "title": "Fantastic hotel in a great location", "helpfulness": 1, "user": "Mr_MrsH_11", "date": "April 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102805242}, {"rating": 5.0, "title": "The hotel and staff are great", "text": "My only concern was that hotel security seemed a bit loose - we could come and go as we pleased and get all the way to our room without a keycard - I think that rooms at a Times Square hotel should have keycard access in the elevator to protect guests and their posessions.", "user": "AMDude", "date": "April 4, 2011", "id": 102795090}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "Our family of six stayed here for a long weekend in November. It was in just the right location with it's easy access to Times Square. Teenagers (15 and 16) felt like they were in the most exciting place on earth. The 10 and 11 year old agreed. Therefore, that made it work for the parents.", "title": "Family Weekend in NYC", "helpfulness": 5, "user": "mlizBoston", "date": "February 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6805283, "likes": {"liked": "— access to times square", "disliked": "— huge hotel, no personal attention"}}, {"rating": 4.0, "title": "Great for a New York week", "text": "Our 6- persons situation requires two rooms which we booked with Starwood points and upgraded to the club level. We booked two rooms each with 2 doubles on the Club floor. One of the rooms had a couch and a couple of chairs plus large windows. The rooms did not connect but we felt safe with the setup.", "helpfulness": 6, "user": "TannadiceTerrors", "date": "February 10, 2007", "id": 6777620}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "Before we got there I thought this was one of the hotels right in Times Square. It is not, but it is 1 block off which was just fine with us.", "title": "great hotel", "helpfulness": 5, "user": "HJCF", "date": "February 10, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 5.0, "value": 5.0, "rooms": 4.0}, "id": 6776050, "likes": {"liked": "— location", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "We were there to see shows on Broadway and to visit with family on the upper west side. Theatre's are nearby and for restaurants we enjoyed Tony's DeNapoli on W. 43rd between 6th/7th. Also, Angus McIndoe on W. 44th between 8th/Broadway. Both very good quality and family-friendly.", "title": "Favorite Hotel", "helpfulness": 6, "user": "lfresa", "date": "February 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6732906}, {"rating": 3.0, "title": "Cold. Sterile. Depressing.", "text": "It's an enormous hotel but it worked really well for our family. We weren't there to spend a lot of time in the hotel room but we were seeking a high quality hotel in a central location. We walked or took taxis everywhere. The service was fine but we had pretty low expectations because we knew it was a huge hotel. We would definitely return with our family and stay again on the Club floor to take advantage of the muffins, coffee/tea/juice, fruit in the morning and snacks and desserts at other times.", "user": "herculepoirot", "date": "February 2, 2007", "id": 6726700}, {"rating": 2.0, "stay_parameters": "Stayed December 2012", "text": "The wife and I booked this hotel for the second time due to the fact we stayed here a few years ago and enjoyed it here. Location was a big plus for us and rooms were good. Arrived on dec 3rd long travel time almost 13 hours so were quite tired when arriving at the hotel . When we arrived at the check in desk the girl on duty asked us for Our name and identification. She then spent a few minutes on the computer and handed me the room key. Here's what annoyed me she never welcomed us to the hotel . Was this our first time here?? Because if she did not know she forgot to inform us any info about the hotel or services. When I asked if the breakfast and wifi were included she told me no that expedia bookings do not include this. I informed her that it was included in my booking . She asked me had I a booking ref and I gave it to her . And then just walked off to an office I presume to check as she did not say anything to us then returned minutes later to say there was no breakfast or wifi included on this booking. I told her there must be a mistake and she said unless I had documentation to say different she could do nothing. I asked her if there was wifi at the desk so I could retrieve my booking from my phone. I was un able to so I just took the key and said I was tired and would come back later . Sadly we ended back downstairs again because we were not told where the lift to the room was! When we got to the room We were shell shocked. First the room was smaller than before even though we booked a deluxe king room. The air con was banging away very noisy. The door on the bathroom was hanging off and the bathroom itself was in poor condition. The room was in need of a revamp.we decided we could not spend a week in this room so I made a call to hotels.com to check my booking and they told me breakfast and wifi are included in my booking and he would ring the hotel straight away to clear this up. We went back down to the check in and a new lady was on the desk. Oh boy I though the worst was over but how wrong was I. The lady at the desk Janice was her name not that she introduced herself but I took note of it later on. I explained to her that the room was not satisfactory . Room was small noisy and bathroom a poor standard. She said nothing and looked up the computer. Said to me minutes later the room had a walk in shower?? I said the room was not up to standard as we had stayed here before and the room was far better than this. She turned away and walked into an office in the back said absolutely nothing to us . Five minutes later she returned worked on the computer for a few minutes and turned away and walked back to the office. She still had not spoken to us. Minutes later she returned and worked on the computer . Another cane from the office and worked on another computer beside her and five more minutes later she handed us keys to a new room. So far this has tale 15 mins approx and the only words spoken to us was the fact the room had a walk in shower! I asked her was the breakfast and wifi included with this room as the booking company rang during the process to confirm they spoke to the hotel. Without even checking she said it was not as expedia do not include breakfast and wifi in their bookings! I informed her that the booking company rang to confirm they spoke to the hotel when she disappeared to the office. Again without a word she turned and yes again went back to the office. Five more minutes later she returned spent five more minutes later writing and handed me five vouchers. I then asked was my wifi included and she told me it was . I then had to ask if I needed some sort of password to access the wifi and she told me what I had to do to access it. We went to our room. We have travelled the world over the past 15 years and we have stayed in the best and not so good hotels in our time. This has to be the inhospitable reception we had seen actually just outright rude and bad mannered. No excuse can be accepted here as both receptions were bad.", "title": "Never again", "helpfulness": 2, "user": "Dazzer41", "date": "December 14, 2012", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 147466458}, {"rating": 4.0, "stay_parameters": "Stayed December 2012", "text": "It took a day or 2 to put this behind us and enjoy our holiday. We decided not to complain to a manager the treatment we received and chose to instead avoid contact with these people and enjoy our holiday. I have never wrote a review of a trip away before but I was compelled to write this. Doing so I am getting very angry and upset with the treatment we were given on arrival. Not once did they apologise for anything making us fell small and stupid all the time. Shame on you westin hotel.", "title": "Brilliant location", "user": "MatronMiddlesex", "date": "December 14, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 147460743}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "", "title": "Excellent choice in Times Square", "user": "Mike S", "date": "December 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 147435346}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "Have stayed here 3 times now. Each experience matches the other. Price per room has increased and decor looking grubby despite price increase.", "title": "favorite hotel in times sq", "helpfulness": 1, "user": "blackcard2", "date": "December 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147214958}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Excellent location for Times Square and broadway, saw 'Mary Poppins' this time.", "title": "Great staff - room - view", "user": "Lynn E", "date": "December 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 147188473}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We arrived in the big apple last week for a first time in new York holiday.we travelled with three other couples, we all had great rooms.The staff were so nice every time I asked them for something whether it be extra towels or where's the best comedy club Here comes a big shout out to all the concierge staff you guys were great.Jesse what can we say but thank you again and wow what a great hotel and we love new York .", "title": "Wow we loved everything", "helpfulness": 2, "user": "Laemerald444", "date": "May 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110612956}, {"rating": 2.0, "stay_parameters": "Stayed June 2010", "text": "I stayed there with my mum and my aunt and we had separate rooms which were of a good size and were comfortable. Reception was not at all helpful and did not take much notice of any requests we had. But the main reason why I have decided to write this review was on the saturday night we deciced to have dinner at the hotel restaurant-it was quite late but they said that as we were staying at the hotel we could have dinner. I had invited my aunt who lives in New York to have dinner with us and I had the steak which was good, but my two aunts shared the lamb. We had other side dishes including brocolli which were cold and quite disguting. We belive the lamb was off as that night my two aunts were sick and constantly throwing up. We feel they both had food poisoning. When we discussed this matter with the hotel manager -they first argued that this was not the case even though they refunded the food and sent up us fruit etc. BUT A FEW MONTHS LATER THE HOTEL RECHARGED MY AUNTS CREDIT CARD WITHOUT TELLING HER OR GIVING HER ANY EXPLANATION OF AN AMOUNT 0VER $300. So if you wish to stay at this hotel then do not eat at the steak restaurant in the evening. I am completely disgusted and shocked that such a hotel can act in this manner.", "title": "Don't eat at the restaurant -you have been warned !!!!!!!!", "helpfulness": 1, "user": "lisalondon186338", "date": "May 29, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 110373864}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We stayed here for 5 nights. The location is ideal for exploring New York - the subway is directly opposite. The staff were very friendly and helpful (porters, reception and conceirge service) We had room 2042 on 20th floor. It was roomy, the bed was comfortable and had all the amenities that we wanted. The shower worked fine but was nothing out of the ordinary. The view was excellent and every morning I spent a couple of minutes watching the world below. The room was clean and linen changed daily. The only downside to this hotel is that it is so big that it is quite impersonal.If we hadn't needed the excellent advice of the staff on a daily basis , no one would have spoken to us for the whole of our stay - the reception area is vast. Whilst there was a coffee making machine in our room, tea had to be bought from Starbucks on the ground floor - a bit of a trek in the morning! The hotel breakfast is expensive so we went to the Westway Diner on 9th Ave between west 43rd and 44th, excellent value. We also ate at 5 Napkin Burger 630 9th Ave; Hells Kitchen 679 9th Ave bet 46 and 47 sts and Amys bread shop opposite. I would recommend them all. We also ate at the Oyster Bar in Grand Central Terminal - the fish is superb!!", "title": "Great Location,good staff, appears to be for the business sector not tourists", "helpfulness": 2, "user": "hannahFlintshire", "date": "May 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 110369587}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "Location was perfect for what I needed.", "title": "Location, quality of accommodation and comfortable bed!", "user": "C J Mitchell", "date": "May 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110191506}, {"rating": 1.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "The reception staff were helpful and welcoming. The quality of the accommodation was high and it had new and an impressive decor. A comfortable bed! The bed was extremely comfortable and that was very much appreciated after a long day of shopping.", "title": "Find another hotel in New York!!", "helpfulness": 2, "user": "Globetraveler40", "date": "May 25, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 109771801}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We stayed at the Westin Times Square on a recent Friday and Saturday night (06/20-22) with a good priceline bid of $170. The hotel is very nice and in an excellent location.", "title": "Excellent Stay", "helpfulness": 1, "user": "toltecs", "date": "July 6, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 17597982, "likes": {"liked": "— Quality and location", "disliked": "— No complaints here"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The day of our check-in, I called the Westin to see if we could check-in early at about noon. To my surprise, the person on the phone said he couldn't answer me, I would just have to go to the hotel and see if they have any rooms available when we arrive. I thought that was odd, but we went to the hotel anyways. We were given a king room (#1403) on the 14th floor upon checking in without any wait. The room was very clean and modern looking. Some of the highlights of the room were:", "title": "OK stay in Times Square", "user": "gregpbc", "date": "July 4, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 17540365, "likes": {"liked": "— Heavenly Beds", "disliked": "— Unfriendly staff."}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "Large, LCD TV,", "title": "Great Location", "helpfulness": 1, "user": "whatalife", "date": "June 30, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 17371309, "likes": {"liked": "— Location", "disliked": "— nothing to dislike"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Dual shower heads,", "title": "Disappointing", "user": "0319", "date": "June 29, 2008", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 17340427}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Very comfortable bed,", "title": "Excellent!", "helpfulness": 1, "user": "patriot98", "date": "June 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 17255746, "likes": {"liked": "— quality of room, view"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "My husband and I stayed at the Westin for 1 night while my parents were in town visiting. We booked a high floor room with a view and that is exactly what we got. We had a great view where we could see 42nd street and some of Times Square. The room was very clean. The TV was a little bit small, but the furnishings were nice. As others have noted, the sliding bathroom door is a bit weird.", "title": "Really enjoyed the Westin", "helpfulness": 1, "user": "LoraJae", "date": "May 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 30400718}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Check-in was smooth and the staff was very friendly. I thought the lobby was really nice. They have a Shula's there. Have not eaten at that location, but have in other cities and we really enjoy the food there. Wanted to check out the bar but it was closed when we got back to the hotel after gallivanting around town.", "title": "never disappointed !", "helpfulness": 1, "user": "golfc", "date": "May 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 30339519}, {"rating": 2.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We would definitely stay here again. The location is great!", "title": "Room smelled.", "user": "sightseeing1", "date": "May 19, 2009", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 30331514}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "Just back from our second stay there. Incredible location. Nice view on the Hudson River ( high floor ). Room big enough by NewYork standards. Staff very welcoming. Only complaints = a little hot in the room / internet should be free considering price of rooms . Plan to visit again !", "title": "Like staying in a college dorm", "helpfulness": 3, "user": "UTAustin", "date": "May 17, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 2.0}, "id": 30162420}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We only stayed one night, but we found the staff to be unattentive, carpet in room very dirty and the toilet made a harsh sound when flushed. The Good Stuff - we got a discount on Parking, the shower and bed were amazing. Location was good..", "title": "never fails to meet my expectations.", "helpfulness": 1, "user": "Sunlover1981", "date": "May 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 30026325}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Excellent hotel in the heart of New York", "title": "Honeymoon in New York", "user": "christosLimassol", "date": "June 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17191811, "likes": {"liked": "— location"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Very nice modern size.", "title": "Nice Hotel", "user": "lisloy", "date": "June 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 17167237, "likes": {"liked": "— location", "disliked": "— cost"}}, {"rating": 1.0, "title": "The hotel was ok.", "text": "Try to book a corner room in the highest possible floor.The view is amazing.", "user": "hotelsearchers", "date": "June 22, 2008", "id": 17139515}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We stayed at the Westin for our recent NY trip and loved the location! The room were nice and clean. The beds were great. Bathrooms were nice but with little counter space. The rooom service was great and fast. I would stay again.", "title": "Cheap Fantastic Corner Room Booked On Hotel Website", "user": "Vittorio_69", "date": "June 22, 2008", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 17126094, "likes": {"liked": "— Spacious Corner Room and Great Hotel Website pricing", "disliked": "— Check in delays"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "This hotel was not the best hotel I stayed in before.", "title": "Loved the Westin in NY!", "user": "sherrera95376", "date": "June 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17108802, "likes": {"liked": "— location", "disliked": "— Nothing all was great!"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We stayed at this Westin just before New Years Eve. While it's well located, I'd say it's overrated. We have stayed at many different Westin Hotels and we've never been charged to use the gym which were were at this Westin. And we had NO hot water for showers following our workouts. When we called down to inquire about the hot water they said they were working on it and that we could have until 12:30 to check out (As an extension of the standard time which is 12 noon!). I asked at that point to speak to a manger who was more able to work with us regarding the hot water issue and the gym charges. It was a shame to have to spend anytime, while we were in NYC so briefly, dealing with these issues. The rooms are nicely appointed, clean and we had a nice view.", "title": "By Westin standards not the best value.", "helpfulness": 3, "user": "impytraveller", "date": "January 23, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 150391094}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "This hotel was in a marvellous location. Central for all the sights the tour buses stop right outside. The restaurant in the hotel was amazing best steak I've ever had! The staff were very friendly and nothing was any trouble. We stayed on the tenth floor and had a corner room which was very spacious. I would definitely go back.", "title": "Fab location", "helpfulness": 2, "user": "nicola r", "date": "January 23, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 150378142}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Cant beat the location / price combo. Close to theatres, food, subway, shops. Hotel is Westin quality for sure, not above or below. Great for romantic getaways! Mexican below the hotel is great food at reasonable prices.", "title": "Great location", "helpfulness": 2, "user": "northstand", "date": "January 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 150351713}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "First of all, great location!, right near the theaters and many excellent restaurants in midtown. (Tip: go to 9th Ave for good restaurants that arent as busy before show times)", "title": "First Class Hotel and Service", "helpfulness": 1, "user": "timflies", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150330357}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "The middle level (quality) room we had was beautiful! I was amazed at how quiet it was too.", "title": "Great stay at the Westin Time Square", "helpfulness": 1, "user": "Marcie F", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150314907}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled solo", "text": "The front desk staff member was exceptionally helpful. I was running behind on meeting my college daughter at the hotel for checkin. The staff member went out of his way to facilitate our checkin, while I was communicating all the details from the highway (juggling our dog on a leash, no less...). I really appreciated how easy he made the process. Also, when we arrived with our small dog, the entire staff were very friendly and helpful as we negotiated NYC w/ a pet. Thank you, a very nice stay.", "title": "Excellent Front Desk & Very Helpful w/ Our Pet!", "user": "Mellie007", "date": "April 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 102544866}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled solo", "text": "A great solid hotel in an ideal location in NYC. Was there for weekend trip to see Broadway shows, shopping, and visit friends. Check in was a breeze, and even though it was early in AM, got a upgarde to room with free Apple Imac (helps that I am SPG). Then when I accidentally locked myself out, agent got me keys after going through correct steps to confirm my identity. What made stay even better was when checkingout next day Cesar remembered who I was and room/floor. Impressive in a hotel that's 43 floors and was full that weekend. Would highly recommend and looking forward to another visit.", "title": "A GOOD STAY", "user": "GTSINC", "date": "March 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 102328066}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "My wife and i stayed here 25--29 March 2011, At the end our speedy check in we were told that we had been given an upgrade to a 45th top floor room and upon opening our door we were taken aback by the NY skyline view from our window. Room was well equipped and very comfotable, nice bathroom, Internet access, large flat screen, mini bar, iron + board, TV etc. Staff and porters very pleasant and helpful. The real gem is the fabulous location barely 120m from Times Square and just along from the Hard Rock Cafe. Broadway shows were all within a short walk as was everything. Cabs were readilly available from Hotel door to take you anywhere further and very reasonable. Grand Central, Maceys, Central Park, Empire State, Chrysler Bldg. all within walking distance. Bar 10 and Shulas Restaurant in Hotel were OK though we only had breakfast once there. You really should try Grand Central Stationeateries for breakfast , the cosmopolitan array of different eating styles is really an experience, sharp suited business people alongside tourists and street living folk, what contrast. We have stayed at the Soffitel (very plush) and the New Yorker (A bit basic but good value) but for location comfort and value the Westin is a tough act to beat.", "title": "Location, Views and comfort.", "helpfulness": 3, "user": "JohnDoeTyneandwear", "date": "March 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 102278972}, {"rating": 2.0, "title": "Westin - Part I", "text": "OK - We just arrived in NYC today for a six night stay but I had to get this down (you'll understand later), hence the Part I.", "user": "COFamilyTruckster", "date": "March 29, 2011", "id": 102110928}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "Traveling with the family and I'm determined to get a workout in every day we're here - there's plenty of walking in NYC but there's also plenty of good eating/drinking and I don't want to return home up 10 pounds. The hotel was picked, in part, based on what looked like a decent hotel gym - they even have special rooms with a spa/fitness emphasis (maybe good for non-family trips).", "title": "Best Hotel in New York to stay!!!!", "helpfulness": 1, "user": "LouSpistoAssist", "date": "March 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102100508}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "Okay truth is i could never afford a room here but we won a 1day stay in a charity raffle for $250 the room was listed as $1500/night. We were set up in a Executive suite with all the amenities. Our room had 2 queen beds each with $2500 bedding ( the bed is really firm though), a apple computer ,a large flat screen TV, a slate stone bathroom with 2 shower heads, and a view of Time Square. The downsides are parking is 1block down the street and is only up to 24hr parking, it was cold outside we could feel the wind break thru the windows and here all noise of Timesquare, they charge you to use the excercise room and extra for internet access incl WIFI.", "title": "All I can say is Wow", "helpfulness": 1, "user": "RandomRoadTripper", "date": "May 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30762645}, {"rating": 4.0, "title": "Memorable memorial weekend with kids, Westin Times Square", "text": "The hotel is located in one of the busiest sections of the city on the corner of 43rd and 8th Avenue. The check-in was easy (up the escalator) and it took about 5 minutes. We got an upgrade to 45th floor with a view of the Hudson & NJ. We reserved a double since we had 2 kids with us. The room was clean and comfortable. It had a flat screen TV, but since we weren't there for business we didn't look for an internet connection. The room was a good size for NYC and was big enough for the 4 of us. It had the heavenly beds indicative of a Westin. The bathroom was larger than I expected for NYC. It was modernly decorated with a large bathtub, pocket door and double shower heads. The water pressure was a bit weak, but the bathroom was CLEAN, no mold on the shower curtain, bathtub, tiles or sink and no stray hair. My only complaint is that the toilet flushes really, really loud. We didn't use the room service or the restaurants in the hotel. There is a Starbucks (on 44th) and cafe Europa next door for coffee in the morning. No need to pay $8 for a cup of coffee or $4 for bagel.", "helpfulness": 1, "user": "travelmomwkids", "date": "May 25, 2009", "id": 30717354}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "There's some construction nearby but since we were on the 45th floor we weren't bothered by the noise. I was awakened by some drunk men getting off the elevator the first night but we got them back since our kids wake up at 6am and watch cartoons. When we checked out we were charged for 6 cans of beer. I had moved them around since I wanted the room for milk in the fridge for the kids. They removed the charges and told me that the hotel offers complementary fridges and that the minibar has sensors. When the drinks are moved it's automatically charged. They were pleasant and without attitude.", "title": "Fabulous Place to Stay in New York City!", "helpfulness": 1, "user": "math48teach", "date": "May 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30680930}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "The hotel is in a good location. There are lots of restaurants and grocery stores one block away on 9th ave. and is in walking distance to central park (about a mile, 15 blocks). The area has changed alot since I lived there 13 years ago and Times square is alot safer and gentrified. No more hookers or x-rated shops. We felt very safe walking around even with small kids. One note skip the Waybest Diner on 9th avenue its the way worst diner we've been to but try Nick's between 50th & 51st on 9th Ave. its the best Greek restaurant.", "title": "Construction Everywhere - Oh the Noise, noise, noise", "user": "Lainey17", "date": "May 23, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 30613512}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "My friend and I needed a girls get-away weekend and always love going to New York City. The Westin, located at the corner of 43rd and 8th is a super great location. It's close to Times Square, the subway, Grey Line Tours, and of course the most important thing, SHOPPING!!!!!", "title": "Great hotel & location", "helpfulness": 1, "user": "allready", "date": "May 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 30526699}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Overall, I'd say that I'd stay here again. It is expensive, but that's New York.", "title": "Convenient, but expensive", "user": "sassypanda", "date": "November 28, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6185749, "likes": {"liked": "— Location", "disliked": "— Cost"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "The property is very, very conveniently located, and I was thankful for this! The room we stayed in was on a high floor (although we used reward points), and was clean and well-appointed. Service was good, and we enjoyed the property.", "title": "Excellent service at the Westin", "helpfulness": 2, "user": "flossy_h", "date": "November 28, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6185581, "likes": {"liked": "— Service and heavely beds.", "disliked": "— Nothing."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "Stayed at the Westin 20-24th Nov over Thanksgiving and the service was excellent, starting from check in we had orginally a king size bed and the guy changed it to 2 doubles, our room was on the 26th floor and was spotlessly clean. The tv was massive and the beds were definatly heavenly after a long day in NYC.", "title": "Great family stay", "helpfulness": 4, "user": "dedsy", "date": "November 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6181252}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "My mum had gotten sick so asked advice from the reception and they sent complimentary a chicken broth and over the stay they just was brillant from getting a doctor to providing advice hospitals and late check out.", "title": "Fantastic Hotel", "user": "cazzielou", "date": "November 25, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6174032, "likes": {"liked": "— Lovely comfortable beds", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "Hotel was really central to subway and could walk to majority of places. Would definatly stay here again next time.", "title": "Shopping heaven", "helpfulness": 4, "user": "kenny2005", "date": "November 25, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6173966, "likes": {"liked": "— Clean with all mod cons.", "disliked": "— No dislikes"}}, {"rating": 4.0, "title": "Very lovely hotel in great location", "text": "My daughter and I stayed at the Westin this past weekend, March 18th-20th, 2005. Great location, right next door to many Broadway shows and only 1 block from Time Square. If you want to be where that kind of action is, this is the right hotel for you. This part of town is a little to touristy for me, I'd rather be in the Village.", "user": "A TripAdvisor user", "date": "March 21, 2005", "id": 3291369}, {"rating": 4.0, "title": "Great!", "text": "The double showerheads or the soft beds? It's a toss up as to which was more luxurious. The biggest rooms I have ever seen in a hotel in New York City. Maybe I just don't get around much.", "user": "kr203040", "date": "March 20, 2005", "id": 3289758}, {"rating": 5.0, "title": "Loved it.", "text": "It is a little pricey but I feel worth the price.", "user": "nyeze", "date": "March 19, 2005", "id": 3286700}, {"rating": 3.0, "title": "Ho-hum", "text": "My daughter loved breakfast at Shula's. The best breakfast she had.", "user": "A TripAdvisor user", "date": "March 18, 2005", "id": 3284368}, {"rating": 5.0, "title": "such a comfy bed", "text": "The service & security were wonderful.", "user": "shawspice", "date": "March 17, 2005", "id": 3282648}, {"rating": 4.0, "stay_parameters": "Stayed December 2012", "text": "First let me start by saying the location is great right in the middle of time square you are surrounded by plenty of Restaurant,shops,theaters. The staff at the hotel was great I had a standard room and got upgraded to a premium. The rooms are not that large but this is New York. The room was clean. My only suggestions if you want spa service book before you arrive. I wanted a facial and they had nothing until Monday I called on Sat. They have valet parking but it is expensive $57.00 a day plus tax we paid it because dealing with all the traffic right there by the hotel is a headache. I would stay again but if you have more than two people you may want to get the biggest room.", "title": "Great Location", "user": "Shortcake079", "date": "December 22, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 147917702}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "My boyfriend took me to New York for my 30th and we chose this hotel as it was not too pricey but not too cheap and seemed a good location, as it was our first time in NYC for both of us. We were impressed with the Westin, just round the corner from times square the location is excellent. We walked all around despite being cold in February, we walked to 5th Avenue, Central Park, Macy's, Empire State, Rockafella, Library, Grand Central Station, we even walked down to Grenwich village! with a few stops on the way. After tiring days sightseeing and lots of walking we were so happy to have a clean room and comfy bed! and oh i forgot the amazing view from the window! I was so excited by the view and to be in New york i couldn't wait to get up each morning and look out the window! i took a lot of photos of the view! and around New York. We weren't in the hotel too much just to sleep and rest so it was a perfect base. Would highly recommend especially for first time visitors. It even snowed on my birthday which was very romantic! When we arrived we were told we were upgraded to a spa room, which was on a higher floor (amazing view) and had a lovely massage chair- very nice to ease aching limbs, and a fancy bathroom- lovely! Also with our package from Virgin holidays we had $20 a day to spend in the hotel, so when in New York we had a cocktail in the bar before dinner, nice touch. All in all a magical trip to New york, thanks partly to a fab hotel and location. Hope to go again, maybe 40th!!?!", "title": "30th in New York", "helpfulness": 1, "user": "mktravelgal", "date": "December 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147895723}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "I had been here once before for a quick work trip so I knew I liked the location. I wanted a room with a view for the weekend trip with my 8 year old; this will likely be his only NYC trip this year.and we wanted to do the holiday stuff. I booked a premium deluxe room at $400 plus, primarily to ensure a room on a high floor with a view. This hotel must improve its reception staff and procedures. Last time, it was bad -- no welcome at all. This time, arriving at noon, I waited in line for 20 minutes, only two people were working check in (aside from the separate Starwood gold line.) The man who checked me in told me \"It's always like this on saturday.\" If so, why not put an extra person on? A manager looked on in a disinterested way but did not jump in and help. I travel a lot and this level of disinterest in the very first guest impression of the hotel is surprising. When I politely asked what floor we were on, he said he'd put me in a large room on the 11th floor, (a preferred guest floor) and that he \"didn't advise\" waiting for a room on a higher floor, which I'd have to check back on later in the day. i took his advice; I did not want to spend another long time in line. The room on the 11th floor was nice, ok amount of space by NY standards, and had an interesting (but low) view for my son down the cross street. The bathroom was superior to the room last time.", "title": "second visit -- family weekend trip", "user": "KW_Cpl", "date": "December 22, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147895194}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The negative: This floor has a LOT of street noise. I was awakened at 4 am by a ton of police sirens. My husband and son slept through it. Next time I would insist on a higher floor.", "title": "Great Location, good service.", "user": "Nolberto A", "date": "December 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147875479}, {"rating": 4.0, "stay_parameters": "Stayed December 2012", "text": "The surprising positive: My husband was staying for a few days on business in a different hotel and called to ask for a late check out on Monday. they accommodated him with 2 PM, which is very unusual and was much appreciated.", "title": "Easy stay off Times Square", "helpfulness": 1, "user": "JBMandJCM", "date": "December 19, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 147718941}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "My BFF flew in to nyc for the weekend for us girls to celebrate our 50th birthdays! They knew we were celebrating our birthdays and the room was decorated with balloons and birthday signs-really creative way of using garland to spell out \"50\" on the bed. The staff from check in to check out were so attentive and friendly. Our room was more spacious than the room I had stayed in once before so we decided upon checkin to order room service and hang out until going out that night. Yummy chicken Soup and vegetable wrap was so delicious and was delivered to our room within minutes. That night I had ordered room service for the morning to be delivered at 9am but called at 8am to see if it could be delivered earlier. While waiting for them to call me back the breakfast was devlivered within minutes! Our room was on the 11th floor with what they called a not so great view (we have stayed in a room before with a view of the river) but we were able to see the hustle and bustle of the city below, not a brick wall.", "title": "Fabulous and Friendly!", "helpfulness": 1, "user": "metsma62", "date": "December 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 147687142}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The hotel is the perfect location for a nyc adventure. And the entire staff was so professional and friendly!!!", "title": "Unlimited possibilities within walking distance", "helpfulness": 1, "user": "Ron_in_paradise", "date": "December 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 147682020}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We recently returned from a combination work/pleasure week at the Westin. It's always fun to be in New York when it's decked out in full holiday splendor anyway, but staying in the middle of the action in a wonderful lodging made it even more special. For the business side of the week, the conference facilities and staff at the Westin were professional, and attentive. Of course, that was why we \"had\" to be there. Why we wanted to be there was for all of the adventures awaiting us in the Times Square area. Within easy walking distance from the Westin are more theaters, restaurants, parks, and shopping than we could visit in a year! We particularly enjoyed staying in such a central location because it allowed us to easily stop by the hotel to drop off the results of my wife's shopping, grab a quick shower, take a nap, or change into evening attire without a hassle. We were always within a short walk back to the hotel. Once at the hotel, the room we had was on a Starwood Preferred floor, 44th to be exact. The views around the city from our spacious King room were impressive. The other thing we noticed was how quiet it was in the room. Usually, in previous visits to the city at other properties, the noise level was much higher. I think being on one of the higher floors, in an upgraded room, made a worthwhile difference. When you're in the Times Square area, there is activity 24x7. Being able to come back and get your sleep to recharge for another day of shopping, shows, eating, drinking, and walking is pretty key! We travelled to NYC by Amtrak, and Penn Station is only a few blocks away. There's a subway and bus station on the street next to the hotel, it couldn't be more convenient. We'd be happy to go back to stay at the Westin if we had business in that area, or just needed a fun escape.", "title": "Awesome", "user": "j2005jl", "date": "December 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147558644}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "What a marvellous hotel.", "title": "Great Location, Not 5 Star", "helpfulness": 1, "user": "Medidate", "date": "December 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 147548817}, {"rating": 5.0, "stay_parameters": "Stayed November 2012", "text": "First of all, the location is perfect, one block from times square, so you are close to the hustle and bustle but just far enough away for it to be a bit quieter. I think 8th Avenue is much better and 7th Avenue for places to eat, too. There was a starbucks in the hotel lobby, and numerous diners and a mcdonalds as soon as you walk out.", "title": "I would stay at the Westin again next year hopefully", "user": "lited", "date": "December 16, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 147526274}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "I stayed one Saturday night at Westin Times Square with my sister and mom for my sister's 30th birthday. I chose this hotel because the Hilton was not available, and we needed to stay somewhere close to both Port Authority terminal and the Schoenfeld theatre for our show that evening. We arrived prior to noon and our room was not available. We left our bags with the bellman, left the hotel, and returned after 3:00pm, the hotel's check-in time. There was somewhat of a delay in getting our room, with the front desk clerk needing to check with a supervisor, but ultimately we were given a room with 2 double beds on a high floor overlooking 8th avenue, as I had requested in my initial reservation (I am a Starwood Preferred Guest member). The room was not as small as I had expected. The bathroom had a tub/shower combo, small sink and commode, closed with a frosted pocket door. The closet contained the coffee maker, fridge and safe. The two double beds had a single nightstand between, but there was room for a desk, chair and lounge chair as well. Flat screen TV. I love the Westin's heavenly bed, and we were able to get a good night's rest. Street noise was minimal despite being on the Port Authority side of the building. We were high enough up to overlook the river and New Jersey. It was peaceful to look out over the city on Sunday morning. The window in the room actually opened for those of you who like fresh, city air. Overall the room was neat and clean. On par with Westin standards.", "title": "Tranquility in the middle of the Manhattan Jungle", "helpfulness": 2, "user": "traveling_esquire", "date": "September 7, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 19862795, "likes": {"liked": "— Westin's Heavenly Bed", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The lobby was in classic Westin decor -- peaceful tones, spotlessly clean, pleasant scent and comfortable seating. Our guest room was pleasantly decorated in Westin's new modern look. Traveler's pictures accurately depict it.", "title": "Will return to the Westin Times Square", "helpfulness": 2, "user": "opinions4EatorTravel", "date": "September 1, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 19617907, "likes": {"liked": "— Location", "disliked": "— small room size"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Service was good. I asked for a birthday cake for my sister and they delivered it when we returned from the show. Despite the wait, check-in and check-out were smooth. I had to correct the room rate at check-out, but this was done with pleasantly and without incident. Our rate included in-room breakfast, which was delicious, fresh and up to Westin's standards. Bell staff were eager to help and hail a cab.", "title": "Fantasic Hotel", "helpfulness": 1, "user": "laurier_traveller", "date": "August 31, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19588435, "likes": {"liked": "— The fabulous room!", "disliked": "— Can't think of a thing!"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Overall, the hotel had the tranquil, upscale ambience makes you feel relaxed and welcomed the minute you enter the hotel. I would choose this hotel again for my Manhattan hotel needs and would recommend it without hesitation.", "title": "Peaceful Stay in a Hectic Location", "helpfulness": 1, "user": "mdean09", "date": "August 30, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 19552873, "likes": {"liked": "— Size and Cleaniness of Room (and the bed!)", "disliked": "— Constant Tip Reminders"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Our family stayed at the Westin Times Square 8/27 to 8/30 . We are Starwood gold members and were upgraded to a \"VIP\" room. I assume VIP means upper floors, as my wife and daughter had stayed there once before in a larger corner, non \"VIP\" room. However, I do recommend getting an upper level room if possible as the room was very quiet, and we could hear very little city noise. Overall, the room was small, but this is probably to be expected in NYC. However it was comfortable with the heavenly beds and dual showhead we've come to expect with Westin hotels. I would add that there is very little counter space in the bathroom. The location is very convenient to Times Square and Broadway theatres. All the staff we encountered were courteous, friendly and helpful. Our plan is to stay here again on our next visit to NYC.", "title": "Fantastic views and location", "helpfulness": 2, "user": "TravelFan_01", "date": "August 30, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 19541681, "likes": {"liked": "— Location", "disliked": "— Bathroom size"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Hotel was fab - our stay was for our honeymoon we stayed 7 nights, our room was upgraded and we received a bottle of wine and a cheese board on the house on the 1st night which was a lovely gesture and a surprise.", "title": "Fantastic Location", "helpfulness": 1, "user": "helenstratford05", "date": "October 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 20750232, "likes": {"liked": "— Ex0cllent Location"}}, {"rating": 5.0, "title": "Family friendly, superb location.", "text": "The room was spacious with fantastic views of the empire state building, the hotel e walk is fab - starbucks and a cinema etc. The hotel is perfect for getting to any location - we walked most places and found them all very close to the hotel - the nearest to the hotel been Times Square.", "helpfulness": 4, "user": "adasco02", "date": "October 6, 2008", "id": 20664477}, {"rating": 5.0, "title": "Great hotel with central location!", "text": "The hotel staff were all very friendly and the hotel is very new and clean.", "helpfulness": 4, "user": "S1980", "date": "October 4, 2008", "id": 20626215}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "I would definately recommend this hotel and hope to stay in NY again in the future. Best holiday ever!!", "title": "Good Location for Broadway Shows", "helpfulness": 3, "user": "WaupacaTraveller", "date": "October 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 20623879, "likes": {"liked": "— location", "disliked": "— room size"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008", "text": "Great choice of Hotel. Excellent location, friendly staff and great Concierge. Was able to check in on arrival early am, and the reception staff went out of there way to offer an alternative lower floor, but we held out for our booked room type on the 35th floor. Smallish size room with two double beds and excellent views of Times Square and the Empire State Building. Hardly any noise. Beds were bliss. Travelling with a 2 year old, I liked the kids pack (including night light, socket covers and plasters etc.,. Would recommend that bed guards for Children are pre booked as none available during our stay. Toiletries in bathroom a little limited,(no shower caps, earbuds) but powerful hairdryer. Hotel services a little pricey but typical of a 5 star. Good deli right next to hotel for cheaper food and supermarket across the road. Overall brilliant stay. Would recommend and would revisit.", "title": "A Fantastic, Modern Hotel a Few Steps from Times Square", "helpfulness": 2, "user": "sherriwiz22", "date": "October 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20540503, "likes": {"liked": "— The bed!", "disliked": "— You had to pay to use the internet in the Business Center."}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "Thanksgiving week brought me to Westin New York Times Square. This was my first visit after years of staying at the Doubletree Times Square for work. Neither hotel is anything to write home about, but for the price and checking that $500 a night for “average” hotels was not uncommon during Thanksgiving, they’re not horrible.", "title": "They have the Westin basics down, but need help with service.", "helpfulness": 5, "user": "IntegrityTravel", "date": "December 9, 2007", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 11394129}, {"rating": 5.0, "title": "Great experience at the Westin", "text": "Overall I sum up my Westin stay as good. This location has the basic Westin stuff down. Heavenly bed and heavenly bath are fine. Where they lack is in service. Now to their credit, being the Thanksgiving holiday, I’m not sure if they were on limited or secondary staff. Regardless it should not take the operator 12-15 rings to answer the telephone. Four co-workers reported the same delays in answering. For seemingly simple requests, comparing stories, not all of our calls were placed at what would be peak check-in and check-out times.", "helpfulness": 3, "user": "3-girl-traveler", "date": "December 7, 2007", "id": 11302199}, {"rating": 4.0, "stay_parameters": "Stayed November 2007", "text": "I was extremely displeased with the speed of their so-called “high speed” internet service. The connection was expensive, and so slow that they ended up crediting me as it’s less than dial-up speed was un-usable. Unfortunately due to being booked, they could not move me to another room.", "title": "Enjoyed our stay at the Westin", "helpfulness": 2, "user": "WorldTravellerChick", "date": "December 7, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 11295016, "likes": {"liked": "— The suite size and bed!", "disliked": "— The rooms were a little draughty but this was eased by the blinds and curtains."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "The bedding and bath products were quite nice, as Westin has become known for. Yet, I found my room not to be stocked with items such as a laundry bag, robe and extra toilet paper. My co-workers alerted me to this, but the hotel does not supply shower gel. Though they did have bath bars.", "title": "Very Nice Accomodations, Great Location!", "helpfulness": 1, "user": "beachiemom", "date": "December 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 2.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 11245734, "likes": {"liked": "— The location and the bed!", "disliked": "— The rude bell men."}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "In-room television was above and beyond with a 42” LCD HDTV, and unlike most hotels that just put in an LCD screen with “stretch-o-vision” SD programming, the hotel offers 15 digital channels. Including all of the local NYC network affiliates (excluding WNBC), ESPN and ESPN 2, Universal, and I believe Discovery or National Geographic HD. The hotel services/ppv preview channel was in HD, yet the film previews were SD stretched.", "title": "Lousy Club Room", "helpfulness": 6, "user": "Ozi_Traveller", "date": "December 1, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 1.0}, "id": 11181262, "likes": {"liked": "— Location", "disliked": "— Club amenities (breakfast room)"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "My husband and I recently \"settled\" on the Westin Times Sqaure, as it was the only hotel left in NYC where I could use my Starwood points. We are very glad we did. Although I've generally shunned Times Square on visits back to NYC, we had a great time. The hotel itself is well-located on 43d and Eighth Avenue, close to numerous theatres as well as Hell's Kitchen and within easy walking distance of Madison Avenue shopping. The hotel lobby was bustling but the staff efficient--as a Starwood gold member, we received a complimentary upgrade to a deluxe king corner room on the 28th floor -- absolutely fabulous room with flat screen TV, wonderful bed, iHome, and gorgeous corner room views of the city. The bathroom was great too--never wanted to get out of the double-headed shower. I can't comment on the lower rooms and street noise, but we couldn't hear a thing in our lovely room.", "title": "Happily Surprised", "helpfulness": 3, "user": "linda528", "date": "December 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 2.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12049367, "likes": {"liked": "— The views and location", "disliked": "— Snotty concierge"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "A couple of small quibbles: the concierge was snotty and could not seem to believe we had arrived on Christmas night without a dinner reservation. We asked if she could recommend any nearby Asian food and", "title": "Very Pleasant Stay at the Westin", "helpfulness": 5, "user": "melpierce79", "date": "December 28, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 12017663, "likes": {"liked": "— location"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "she told us everything was likely booked and lamely offered to call a place I'd never heard of on the upper east side (not close) that was", "title": "A Solid Choice in New York", "helpfulness": 4, "user": "jonahleon", "date": "December 28, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 12015377, "likes": {"liked": "— Location and Price", "disliked": "— View from Room, Size of Room."}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "\"probably booked.\" We said no thanks and walked over to Ninth Avenue (a block away!), where we found a number of Asian places serving dinner, no reservations required. The same concierge was equally snotty when we asked where to find the half-price ticket office for same day broadway tickets (on 46th between 8th and Broadway), although", "title": "Good Experience, lived up to Westin standards", "helpfulness": 3, "user": "guvnor1001", "date": "December 26, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 11966219, "likes": {"liked": "— The bed", "disliked": "— Atrium next to room"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled solo", "text": "we at least got an answer that time. Other than that, we were very happy with our beautiful room and the fun location. Recommended!", "title": "Zero Service, Tiny rooms", "helpfulness": 4, "user": "JBATL", "date": "December 20, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 2.0}, "id": 11719443, "likes": {"liked": "— the elevator", "disliked": "— everything else"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "While a very nice facility, I found the Westin disappointing on so many levels. The room is very modern, too much so for my comfort level. The dark tile leading to the closet and bathroom is so cold. The large bedside lamps were mirror silver and kind of disconcerting to me. My husband was doing business and liked the long desk area with easy access to power and a nice desk chair. But the TV is on it as well, so you have to face sideways to watch the TV. We had a nice corner room as shown in their photos, but most rooms have fewer windows of course.", "title": "Better for Business Travel", "helpfulness": 1, "user": "aeisenberg", "date": "March 19, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 58978679}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "My least favorite thing was the bathroom! The noisiest toilets ever made. Terrible. We could hear them even from another room when they flushed. And there is a sliding door with frosted glass. What a terrible idea, it's not convenient to use a slider, plus when my husband went in there early in the morning, the light flooded the room through the glass. I agree the water pressure was weak, and in fact I had to turn it all the way to HOT to get it warm enough to shower.", "title": "Absolutely Fantastic", "helpfulness": 1, "user": "Ilagam1", "date": "March 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58965328}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "I don't know what that picture they have of the front entry to the hotel is about. The entry is extremely unassuming into a small security lobby, and you have to ride up a long escalator to get to the lobby and front desk, etc. I can't believe that doesn't bother people; it's very --well, not grand.", "title": "We have stayed here 3 times now and are going back for a fourth next year", "helpfulness": 3, "user": "LondonGirl14", "date": "March 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58830586}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "That said, the location is great for anywhere you want to go in the city. And the front desk people were nice. I need to ask the concierge something, but when I called from the room, I couldn't get through; they were always busy. Oh and maybe it's just me, but I was irritated that they charge $10 to use the fitness facility. For these prices, they should include it.", "title": "Nice hotel, service could be better", "helpfulness": 2, "user": "sunshinelover33", "date": "March 16, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 58764949}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled solo", "text": "The Westin was an amazing place to stay! Centrally (and perfectly) located just a few minutes from Time Square, right next to the subway. Walking distance to \"restaurant row\" as well as other wonderful places to eat. Walking distance to the Boradway shows......no need to pay for taxi! Our room was quite large, very clean, and suprisingly quiet. I have rarely met such friendly and helpful staff. I would recommend this hotel and plan to go back myself!", "title": "Amazing", "user": "UkBruce_wayne", "date": "March 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 58754799}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "I stayed at the Westin on June 17th and it was the best hotel I have ever stayed at. It was deff the BIGGEST room I was ever in in NYC. I shared a room with my friend who had booked it for a very low $147.00. I was looking at the real room price and it turns out that we were in a $1500.00 a night room. The double shower head was AMAZING and I wanted to take it home with me. The beds were comfy but not as comfy as I expected them to be. The quilt(comforter) that was on it was so heavy that it gave me leg cramps while I was trying to sleep. The BIG flat screen TV was a plus as was the Ipod dock radio. Overall I would stay there again only if I could get a great deal like my friend did because quite frankly I could never afford to stay there any other way.", "title": "Best Hotel I Ever Stayed At!!!!!!!", "user": "DefyGravity", "date": "June 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17057088, "likes": {"liked": "— Everything but the comforter on the bed", "disliked": "— Nothing but the comforter on the bed"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "I have stayed at Westin Hotels all over the world because I love them...all but the Westin Times Square. The lobby was dingy and the furniture was worn. Our room was large by NYC standards but there was a dirt spot on one of the duvets and dust on the headboards. They did accommodate an early check-in and late departure. However, after requesting a 2:30 check-out time we found ourselves locked out of our room after returning at 2:15. Apparently the keys automatically time out at 2pm but no one bothered to tell us. The hallway had debris in it for an entire day that was not cleaned up, etc. The beds were comfy as always, but other than that I would not recommend this hotel.", "title": "Not up to Westin Standards", "user": "Adobegal", "date": "June 18, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 17025134, "likes": {"liked": "— The beds", "disliked": "— The hotel needed updating"}}, {"rating": 4.0, "title": "Great Location ~ OK Room ~ Great Service", "text": "Hi......Booked for a weekend trip to the city. Stayed Friday - Sunday. Our flight was delayed and we arrived at 10:00 pm - the receptionist gave us drink vouchers for the bar since the club level was closed. Very nice. We booked through the website - great deal and then after we booked we received an email from the hotel w/ an offer for $50 upgraded to club level. We accepted the offer and really enjoyed the club level. Drinks, breakfast and afternoon appetizers (which were more of a meal than a snack:).......room was just ok - we didn't find the bed nearly as comfy as previous westin stays and our view on the 26th floor wasn't good either - definitely request room w/a view....", "helpfulness": 2, "user": "KellyinKentucky", "date": "June 17, 2008", "id": 17008741}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "..Our flight on Sunday did not leave until 9:00 pm so they happily kept our luggage safely while we went to the Yankees Game and enjoyed the city. After we returned we were able to shower in the spa and change before our flight home, which was a wonderful touch since it was such a hot weekend. Staff went above and beyond to meet our every need. We realllllllllly enjoyed our stay and would not hesitate for the location again - soooo close to Times Square, Broadway Shows, Subway, etc.", "title": "Good choice", "user": "Lacunar", "date": "June 17, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 5.0, "value": 3.0, "rooms": 4.0}, "id": 17005784, "likes": {"liked": "— Location, cleanliness/comfort of hotel", "disliked": "— Somewhat overpriced"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "This is a very nice hotel. It is located in the Times Square area, and several Broadway theaters are within 1-3 blocks. There are plenty of restaurants in the area as well. The hotel itself is nicely decorated. I stayed in a corner city-view room, which offered impressive views of the city. The room was average in terms of size but above average in terms of decoration and comfort. The shower features 2 shower heads. It might not be good for the environment, but it sure felt good. The air conditioning was not able to keep up with the 100 degree weather as much as I would have liked, but the room was fairly comfortable. Overall, this is a very nice hotel in a good location. Pricewise, you'll pay for it, but this is still a good choice.", "title": "Less than impressed", "user": "DocJewels", "date": "June 16, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 16974227}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "I stayed here for five nights in June of 2008. I had stayed at this hotel two years prior to this visit and my second trip as not as nice as my first. The staff seemed bothered every time you would ask them a question. The room was nice and I was offered my choice of view... that was nice. However, the room looked a bit worn from my last trip. It was not dirty, but it just did not have a fresh feeling to the room. The location is great if you are looking to attend the theatre. The Javits was my destination and the walk is not bad. Its a long walk, but its an easy 15 min walk. They do not offer free access to the gym to SPG members. As a loyal member, this was quite a turn off. I dont think I would return for that very reason. I think the fee was only $10 a day, but again as a loyal member one should not have to pay to go to the gym when you are paying ~$400 a night. When you travel as much as I do, a gym is critical. I ran in central park every day, so that was a nice option; but, if you do not run be warned.", "title": "2nd Stay Not As Nice As First", "user": "avillebud", "date": "June 16, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 16972063, "likes": {"liked": "— Location", "disliked": "— Gym Fee"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "We arrived on Friday afternoon and had put in a request for a club level room which was unavailable. We were told that we had been upgraded to a better room but I couldn't see anything out of the ordinary. The lobby was extremely crowded.", "title": "Weekend Stay in NYC", "helpfulness": 1, "user": "katiey424", "date": "June 16, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 16970425, "likes": {"liked": "— location and comfortable accomodations"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We had a leak issue in the room and reported it to the front desk. Someone from Engineering called to confirm the situation and promptly took care of it while we were out to dinner.", "title": "great stay in the city", "user": "markobmf", "date": "June 15, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "business": 3.0, "cleanliness": 4.0, "rooms": 4.0, "location": 4.0}, "id": 16938823}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "Our room was on a higher floor and provided a spectacular view of the river. There are two entrances to the hotel (one facing 42nd and one facing 43rd) which provides easy access to the subway system and Times Square.", "title": "What a waste!", "helpfulness": 1, "user": "MFT", "date": "June 10, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "location": 3.0, "rooms": 3.0}, "id": 16833762, "likes": {"liked": "— The bed", "disliked": "— The service"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "Overall, the location was great and the accomodations were comfortable. The hotel decor is very modern and clean. Our room had a stainless steel sink and counter area along with two shower heads in the shower. The beds were the signature Westin Heavenly Bed and the room had a beautiful flat screen television.", "title": "Good for business or theater", "helpfulness": 1, "user": "SPGloyal", "date": "June 9, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 16793514}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We stayed for 3 nights at the Westin Times Square Nov. 10-13 and loved the hotel. The location is ideal since you are in the middle of Times Square, it doesn't get any better than that. Walking distance to all Broadway shows and entertainment, restaurants, etc. Main subway station across the street, it was awesome. The hotel is beautiful, very modern and clean, very comfortable bed, spacious room with a nice flat screen TV and cable. We had a corner room with beautiful views of Manhattan and the Hudson river. We got a great deal through the hotel website, they were running a promotion of stay 2 nights and the 3rd night was free. I would not stay anywhere else in NYC.", "title": "Absolutely loved the Westin Times Square", "helpfulness": 2, "user": "babydix", "date": "November 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11146891}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "We stayed in a corner room on the Executive Club level. The room was *huge* - it would've been a junior suite at most other NYC properties.", "title": "A Great Hotel in Times Square", "helpfulness": 3, "user": "JoeLeTaxii", "date": "November 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 11120231, "likes": {"liked": "— The Westin level of service - helpful but not intrusive, casual but classy.", "disliked": "— The location is very difficult to access for limos/taxis. Shula's restaurant is too serious."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Much bigger than I'd expected. The bonus of breakfast, appetizers, and", "title": "Fantastic Hotel", "helpfulness": 3, "user": "jules0497", "date": "November 26, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 11083230}, {"rating": 4.0, "title": "Excellent hotel", "text": "espresso in the Club Lounge was great. We were traveling with our 1.5 year old daughter and the added space of the large room and the comfortable retreat in the club lounge were very welcome.", "helpfulness": 2, "user": "alandubo", "date": "November 26, 2007", "id": 11072832}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "We ordered a Heavenly Crib (free of charge), but it is smaller than a normal crib and our daughter ended up sleeping in the king size Heavenly Bed with us (there was plenty of room). For an infant, the crib would've been fine. It was great having a bathroom that was big enough to help the baby take her bath without feeling crowded. The room was clean, but showed clear signs of wear and tear. Some touch up on the trim and wallpaper could resolve this. The TV and computer were great, but even though we had a slick iMac in the room there is an additional charge for Internet access. The iMac worked great as a video player for the Teletubbies DVD when we needed a little quiet time.", "title": "Great Hotel!", "user": "Lambie22", "date": "November 26, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 11068937, "likes": {"liked": "— Rooms", "disliked": "— Some staff a little 'Snotty'"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "TIPS: Great pizza place one block over (I think on 44th), John's Pizzeria, also Junior's (I think on 45th) was a great place/good value, wonderful cheesecake (I had the carrot cake cheesecake, so good!!!!). We also bought the CityPass, which is a really good deal if you are planning to do the things that are included with it.", "title": "Great central hotel", "user": "kajLondon", "date": "August 29, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 19521793, "likes": {"liked": "— Location", "disliked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "My girlfriend and I have just returned from a 5 night stay at the Westin at Times Square and cannot complain about the service received or the room itself.", "title": "Nice hotel - pricey, but average for NYC I guess", "user": "kellehs", "date": "August 28, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 19490564, "likes": {"liked": "— room quality, cleanliness, location", "disliked": "— price !"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "We spent one night at the Westin after seeing a show in the city and wanting to be able to go to a nice dinner out and not worry about driving home. We were pleasantly surprised at how peaceful our stay was during this busy holiday season. Upon arrival we pulled right up to the curb and handed our keys over to the doorman - very quick and simple. Check in was also easy, without any wait at all, and we headed up to our room - a corner room on the 19th floor. The room was spacious - much more so than I expected, especially since we had only booked a standard king size room, rather than paying extra for a higher category room. The heavenly bed was very comfortable, the heavenly shower was enjoyable and the decor was sleek and modern but still maintained a welcoming warmth. The one thing we really noticed during our albeit brief stay was how incredibly quiet the hotel was. Not once did we hear a peep either from the outside or the inside of the hotel - very peaceful - just what we were looking for. The only complaint I have is that there was no \"do not disturb\" sign to place on the doorknob, so I turned the inside latch to \"privacy\" but someone still attempted to enter (I'm assuming it was housekeeping) while I was in the shower in the morning.", "title": "Very nice stay at the Westin", "helpfulness": 5, "user": "jjax", "date": "December 21, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6479190, "likes": {"liked": "— peaceful and quiet hotel room"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "My stay at The Westin Time Square was extremely satisfying and helped make my first trip to NY enjoyable. The lobby is impeccably polished and tastefully decorated; the staff -professional, knowledgeable, friendly and they aim to please. I couldn't have asked for a better hotel room...everything from the large bathroom and the flat screen tv to the Heavenly Bed was absolutely perfect. The location of the hotel is convenient and is in the middle of everything! I will definitely stay at The Westin Time Square again.", "title": "Wonderful place to stay while in New York!", "helpfulness": 2, "user": "40YO", "date": "December 20, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6477161, "likes": {"liked": "— Location, Heavenly bed", "disliked": "— When you make your reservation, ask them to place a chocolate on your pillow. They'll do it! ;-)"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We stayed at this hotel form Dec 8th-11th after having cancelled the W New York after seeing the bad reviews. We were worried it might be a bit too big and not as trendy but we found it to be excellent. Exactly what we needed. We had a corner room on the 42nd floor with great views over the city which really made the stay for us to wake up to that every day. Room was large and modern - lots of windows (even in bathroom!) - great shower. We did not spend much time in the hotel and ate out for breakfast each day so not too much to comment on the staff (apart from check in which was very quick - just us, but we nearly did not get the corner room we had requested online until a manager happened to walk by and say there had been a cancellation and we could have it). Had good drinks and snack in Bar 10. Great Location - walked everywhere - not too noisy or busy.", "title": "Perfect", "helpfulness": 3, "user": "GU1", "date": "December 20, 2006", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 5.0, "value": 4.0, "rooms": 5.0}, "id": 6475517, "likes": {"liked": "— The views and the location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Ideal for first time visit.", "title": "What A Great Hotel", "helpfulness": 4, "user": "clay304399", "date": "December 12, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6432587, "likes": {"liked": "— Large updated modern rooms", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We have just returned from our stay at the Westin 8 - 12 December and what an incredible stay.", "title": "Heavenly Bed on My Mind", "helpfulness": 2, "user": "atisi", "date": "December 11, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6364828, "likes": {"liked": "— The bed", "disliked": "— Having to leave!"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "I just stayed here the weekend of Dec.15th through Monday. The hotel is very nice, but there were a few unexpected glitches that people should be concerned about. First, I have been to NYC more times than I can count, but never stayed in Time Square, now I know why. I am in my 20's and love this city, but Time Square actually has a lot more low lifes in it then good people, so if you want a more peaceful hotel that is near the same places, stay on 5th ave. I speak from experience the quality of the people is just better. Second, my 2 complaints for the actual room was this, there is no fan in the bathroom so it is like a sauna, and the sink is so small that you cannot fir your items on it. Lastly the biggest thing, my sister left her wallet (with no cash, but credit card and license!!) in our room because it didn't fit in her tiny purse. We didn't realize it until the next morning when we had to leave, but her wallet (with her photo ID) to get on the plane was missing!! A maid took it and we later found, used it at the hotel vending machine (debit/credit card). The staff denied maids in the room at this time, but this is not true due to the fact that I was w/ my sis and saw her place the wallet on the dresser. We almost missed our flight, and had to go fill out a police report for her to even get on the plane, such a fiasco. Anyway. this was upsetting along w/ the treatment of the situation.I realize one should not leave a wallet lying in plain sight in a room, but still is was just shady and plain wrong. Word of advice, watch the maids and all personal belongings, we didn't and ended up getting burnt. Other than that this hotel is ok, I'd reccomend staying on 5th ave though, take my advice.", "title": "Nice Hotel, but there was one BIG problem", "helpfulness": 6, "user": "Amberti79", "date": "December 19, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 2.0, "cleanliness": 5.0, "value": 2.0, "location": 2.0, "rooms": 3.0}, "id": 11698379, "likes": {"liked": "— The beds and TV", "disliked": "— The sink, maids that were thieves"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "I have mixed reviews about this hotel. We stayed here for over two weeks while our NYC apartment was getting renovated, so we had a lengthy stay. We chose this hotel for the Starwood points, the location and the size of the rooms.", "title": "Could have been much better, but could have been worse", "helpfulness": 3, "user": "jzo77", "date": "December 19, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 4.0}, "id": 11690426}, {"rating": 4.0, "title": "Great central location", "text": "We had reserved a corner king room on a high level floor at around $750 a night. We went upstairs and our keys didn’t work. My husband had to run downstairs and get them to reissue the keys. When we finally got in, we found that they put us in a regular room. I’m not sure if she just didn’t realize she did that, or if she thought we wouldn’t notice. They did move us when we called down and asked, but just having to do that seemed like a negative start.", "helpfulness": 2, "user": "theseatsaretooclose", "date": "December 12, 2007", "id": 11508049}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We did ask if we could get access to the club amenities (gym, breakfast, hors d'oeuvres) since we were staying for so long. They did put that perk on our keys, which was nice.", "title": "Room with a view", "helpfulness": 3, "user": "Robberbobbles", "date": "December 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 11421460, "likes": {"liked": "— Views from the Hudson River to the Empire State Building and Times square", "disliked": "— Annoying traffic noise that even the closed windows could not keep out"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007", "text": "Our real room was nice and a decent size, with windows facing north and west. The whole ‘Heavenly’ line was mixed. The bed was very comfortable, and the shower was wonderful. The robe was pretty pathetic though, and the towels were pretty rough.", "title": "More like a 3 star than a five star", "helpfulness": 2, "user": "Earthman83", "date": "December 9, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 11408758, "likes": {"liked": "— The signiture westin heavenly bed", "disliked": "— The street noise and the noise from the next door rooms and the poor shower/bathroom"}}, {"rating": 4.0, "title": "Good all rounder", "text": "Stayed here for four nights between 22nd and 26th Feb for first trip to NYC. Excellent location especially for first timers like ourselves as it is convenient for trips to all parts of Manhatten and beyond.", "user": "HotelCleve", "date": "February 27, 2007", "id": 6844009}, {"rating": 5.0, "title": "Excellent Place To Stay, Could not Fault It At All", "text": "Check in was easy although booking, which was made through Expedia, was down as Traditional Double when we'd booked a Deluxe 2 Double. After getting a manager to assist a room on the 40th floor was found.", "helpfulness": 2, "user": "pippaengland37", "date": "February 24, 2007", "id": 6835806}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "Room itself was of a good size and standard. The decor was perhaps a little too grey but that would be picky. Very comfotable beds. Wonderful view of the New York skyline and over to the river. Bathroom was fine with good quality towels and the much noted double headed shower which certainly helps blow the cobwebs away of a morning.", "title": "Loved the Westin", "helpfulness": 1, "user": "starrynights", "date": "February 24, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6835469, "likes": {"liked": "— Heavenly bed / luxury"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "I would agree with previous reviewers about the noise problem at this hotel. You get noise from the adjacent rooms, hallways and the lift. Not that awful but a surprise for such a new hotel of a high end brand.", "title": "Good location, good service but average room,", "helpfulness": 1, "user": "JayCeeUK", "date": "February 24, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "location": 3.0}, "id": 6833999, "likes": {"liked": "— Location & comfort", "disliked": "— Noisy room / lack of sound-proofing"}}, {"rating": 5.0, "title": "Stylish and Modern", "text": "We also went to the Westway Diner on 9th Ave which we found to be very welcoming, good food and good prices. Virgils BBQ, W44th St, was an experience in large portions of succulent ribs. For any one looking for a bit of entertainment the piano bar Don't Tell Mama, W 46th St, comes highly recommended.", "helpfulness": 4, "user": "aoneill87", "date": "February 23, 2007", "id": 6833034}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "The Westin New York at Times Square is one of the best Hotel in NYC.", "title": "One of the Best Hotel In NYC if Not The World.", "helpfulness": 1, "user": "Carley Trish A", "date": "January 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150707069}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "What makes this SPG Hotel - Westin New York at Times Square the best.", "title": "Pretty Good Actually (...for the Price in NY)", "user": "RNG1008", "date": "January 25, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 150562956}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "1. Staff are friendly, Warm, Welcoming, Accommodating, Knowledgeable.", "title": "Luxury in heart of Times Square, NYC!", "user": "luckytraveller1", "date": "January 24, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 150482067}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "2. The hotel features are all updated. ( Rooms , GYM, ect. )", "title": "Quiet HVAC! Comfortable bed!", "helpfulness": 1, "user": "LuvFlying", "date": "January 23, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150434760}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "3. Location wise. ( The hearth of TImes SQ NYC). Perfect for both business and for touring", "title": "A Gem In Times Square", "helpfulness": 1, "user": "Karen B", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 150416995}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "We went to New York City to meet friends and stay over night. The Westin is a wonderful hotel: check-in was the fastest I have ever experienced; staff was friendly and helpful; our room was pristine, extremely comfortable, and beautifully updated.", "title": "Wonderful", "helpfulness": 2, "user": "motherbored", "date": "March 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13999814, "likes": {"liked": "— Service", "disliked": "— Lobby is cold and unattractive looking"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008", "text": "The Westin is also located in the heart of Times Square, so walking to and from a number of attractions, theater, and restaurants is easy.", "title": "very good but unfortunately a bit noisy", "helpfulness": 1, "user": "brandenburg5", "date": "March 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 2.0}, "id": 13968342}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "We had a quick bite to eat at Europa down the street--quick, convenient place to grab a cup of coffee, bagel, etc.", "title": "Exemplary Westin Property", "helpfulness": 1, "user": "NGerding", "date": "February 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13934251, "likes": {"liked": "— The Staff, cleanliness, location", "disliked": "— internet access fee"}}, {"rating": 4.0, "title": "Very good stay", "text": "We walked to Caroline's Comedy Club and had a great time.", "helpfulness": 3, "user": "anne999", "date": "February 26, 2008", "id": 13871503}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "We would stay here again and recommend the Westin to everyone.", "title": "Excellent service", "user": "Firefly207", "date": "February 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13847801, "likes": {"liked": "— Excellent service and comfortable beds.", "disliked": "— Expensive restaurants"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2010", "text": "I organize a yearly girls' NYC weekend trip centered around a Brodway show and after going through Hotel Planner and getting an awesome rate, our group of 30 made our reservations here. I have to say I wasn't flying blind - I have stayed at this location several times. The group sales staff was impeccable (Joann Casiano) and they took care of all of our requests. Not one of the group had any issues with the room or the stay in general. sooms are well appointed and the location can't be beat. If I had a complaint, it would only be the selection of dining in the hotel. There is only Shula's (a little pricey) and the bar, not much else. Notso big of a deal because you are right in Times Square and there are a million restaurants right out your door but ont he evenings when we didn't want to leave the hotel, we had limited options. Otherwise, it was a great trip and a great stay!", "title": "Love the Westin - Perfect Way to Experience NYC!", "user": "shida_girlBoston_MA", "date": "April 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60551561}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "We stayed in the Westin for 5 nights and would return.", "title": "Would stay here again!", "user": "Dublinbride", "date": "April 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 60518167}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "Check in was excellent and when our room wasn't ready we were given two vouchers for complimentary drinks. Thanks Candice!!", "title": "Outstanding", "user": "dbilewicz", "date": "April 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 60477678}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "Our room was one of the new Atrium Club rooms. I got a better rate through a 3rd party so contacted Westin and availed of their Best Rate Guarantee programme and this further reduced our rate. We were upgraded to a corner room which was fantastic.", "title": "The Westin will give you a memorable, comfortable stay with the most capable, high calibre and friendly staff!", "user": "eyesforu", "date": "April 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60462689}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "The room was really spacious and recently renovated. Having stayed in Club rooms in 2 other starwood properties I felt that a couple of things should have been included in our room as standard - slippers, robes and some extra blankets. The complimentary internet was a good bonus.", "title": "Just terrific! The perfect NYC spot! Incredible staff", "helpfulness": 1, "user": "vacainfo7", "date": "April 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 60083009}, {"rating": 5.0, "title": "New York New York what a wonderful town!!!!!", "text": "Stayed at the Westin Times Square In September 2004 and booked to stay at the Le Parker Meridien in Sept 2005. The Westin was fabulous.", "helpfulness": 4, "user": "normansue", "date": "April 5, 2005", "id": 3331625}, {"rating": 5.0, "title": "excellent hotel", "text": "What a great vacation it was in 2004 so good that we are returning for a second time.", "helpfulness": 1, "user": "sue_lovers", "date": "April 4, 2005", "id": 3326691}, {"rating": 5.0, "stay_parameters": "Stayed December 2003", "text": "What could we find wrong with the trip........nothing.", "title": "Would Stay again", "helpfulness": 1, "user": "BtweenUandMe", "date": "April 4, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3326679}, {"rating": 5.0, "stay_parameters": "Stayed January 2005", "text": "We danced at the Cotton Club Harlem, dined at Sardis, saw Chicago (the musical), travelled on the underground, visited ground zero, walked Brooklyn Bridge and felt completely safe at all times. What a vacation. Nothing compares with our visit.", "title": "Excellent Hotel!", "helpfulness": 1, "user": "Rosee", "date": "April 2, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3323319}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "spent 5 great nights at the westin 23rd-28th march. lovely hotel, had a corner room on the 28th floor with a spectacular view, the heavenly bed and shower were amazing. lovely and clean. the concierges were really helpful and very friendly. thoroughly recommend this hotel", "title": "Excellent hotel in a great location", "helpfulness": 2, "user": "LizGore", "date": "April 1, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3318026}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "Stayed at the Westin for a business trip in March. Chose the Westin due to its proximity to the NASDAQ Marketsite facility. Had a very pleasant stay from beginning to end. Check in was the only part of the experience that was not smooth. I reserved a block of rooms ahead of time for my colleagues and also paid a deposit on them. We reserved King rooms for everyone. At check-in we were told there were no Kings available, which just didn't sound right. After approximately a 10 minute delay, we received our King rooms. To my surprise, I received one of the Westin's Workout rooms, which was an absolute treat because I needed to do my workout on the road. Room came equipped with a treadmill, weights, a ball, a mat, and a DVD player which I got a lot of use out of because I brought my fitness DVDs with me. The standard rooms do not have a DVD player. The bed was very comfortable. The bathroom was a bit tiny and had limited counter space which is probably only an issue for women who want to spread their toiletries out, like me. Unfortunately my mini fridge was not cold so I had warm water upon check-in. I requested a mini fridge to be brough to my room because I eat a very special diet and needed to refrigerate my food. The fridge was promptly brought to my room. It was a little scuzzy but I'm low maintenace, so it wasn't an issue. Overall, great experience and would definitely stay again.", "title": "Great Hotel in Prime Location", "user": "LuvSLO", "date": "June 7, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 112015306}, {"rating": 1.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "I stayed at the westin for a business conference (also held within the hotel complex) on May 23-25. On the morning of May 24, I left my room at 745 am to attend my meetings on the 5th floor. I went up to my room during the10am morning break since I forgot my notes. When I entered my room, I noticed that my ipod, kindle and personal blackberry, which I left on the bedside table to recharge were gone. The devices were gone; but the idiot thief left behind the chargers! I immediately called hotel security. Someone came up 10 minutes later to take down my report. That was the only action taken, since apparently, they had to wait for the security manager, who was offsite, to return after 2pm . In the interim, there was no action taken. Hotel securtiy did not interview the staff nor conduct a physical check. The security manager finally got back to me after 4pm that day to inform me that they will be reviewing the door security logs. After several phone calls and discussions, they told us (who had arranged the trip) that they had no record of anyone entering my room and will not compensate me for my loss. At some pointy, one of the staff even insinuated that I made this up. IF THE WESTIN HOTEL HAD NO RECORD OF UNAUTHORIZED ENTRY IN MY ROOM, THEN THEY HAVE A HUGE PHYSICAL SECURITY GAP! THEY NEED TO HAVE BETTER PROTOCOLS THAN MERELY TAKING DOWN AN INCIDENT REPORT AND REVIEWING THE ENTRY LOGS!", "title": "DON'T STAY HERE! POOR RESPONSE TO IN-ROOM THEFT! Ipod, Kindle & Blackberry were stolen from my room.", "helpfulness": 4, "user": "vgtero", "date": "June 5, 2011", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 111663812}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "In the mean time, I have no way of recovering my kindle, ipod, blackberry and the content and contacts. All I could do was report the loss of the devices to amazon, apple, and my telephone service provider so that they could prevent any future transaction from those devices.", "title": "Ready to go Back", "helpfulness": 1, "user": "slimjem2", "date": "June 3, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 111335547}, {"rating": 2.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "Enjoyed my stay at the Westin, it was scary when we first arrived, one of us got ill and we thought we had to call an ambulance...it turned out okay after a fewwww hours...want to thank Soo Lee (Mgr) very helpful in assisting us w/ medical contacts. Great location!! I got to save up money, ready to return now!! Thanks Westin Staff ( concierge, housekeeping (thanks for the many towelssssssss) :)", "title": "Good location", "user": "yitravelMumbai", "date": "June 3, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 111242799}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "The Westin Times square is very well located just off the Times Square. However, the rooms are a big disappointment. I had booked myself a club room which was advertised as being the top-end in luxury. However, unfortunately, the room was very basic with absolutely no view at all. Very stuffy and unfriendly staff made this a totally forgettable experience. Would not return here in a hurry", "title": "Loved it...would return again!", "helpfulness": 1, "user": "my2kidsmom9702", "date": "June 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111204948}, {"rating": 4.0, "title": "Mostly great, but ...", "text": "For theatergoers, the location is phenomenal. We were no more than two blocks from our theaters, Birdland, great restaurants, etc. Great access to the subway. The hotel was, as other reviewers have pointed out, newish, very clean, and well run. The room was spacious and well appointed, and the view (from the 25th floor) was terrific. Our only complaint goes to the lack of soundproofing--we could hear doors closing, toilets flushing, ice making, and conversations in adjoining rooms. That said, we got a terrific rate on Priceline, and we would go back.", "user": "weewinkie", "date": "February 19, 2008", "id": 13686436}, {"rating": 5.0, "stay_parameters": "Stayed October 2005, traveled as a couple", "text": "My wife and I spent a single night there two and half years ago and we still talk about it!", "title": "Incredible hotel in an incredible location", "helpfulness": 5, "user": "Spiceumup", "date": "February 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13646907, "likes": {"liked": "— the bed was amazing", "disliked": "— nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "First:", "title": "Not up to Westin Standards", "helpfulness": 3, "user": "Petenchris", "date": "February 14, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 13559899, "likes": {"liked": "— The Location", "disliked": "— Price, and Room for price paid"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "The service is excellent, a very helpful young man at reception made sure everything was just so and was polite in the extreme.", "title": "Westin didn't disappoint!", "helpfulness": 6, "user": "thriller_7", "date": "February 12, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 13512044, "likes": {"liked": "— The heavenly beds and the shower heads!", "disliked": "— Thin walls meant that hallway noises were audible in the room"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Second: though the room was on the small side, it was very well appointed and the decor was magnificent. We were on the Spa level and there was a message chair in the room. That was so wonderful after a day of walking around the city.", "title": "A good big chain hotel", "helpfulness": 8, "user": "Lighttraveller1", "date": "February 10, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 13418539, "likes": {"liked": "— The location, service, amenities, price", "disliked": "— N/A"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "We stayed at the Westin Hotel for 3 nights as a package holiday through Virgin holidays(brilliant airline). What a fantastic experience it was and all the staff could not have been more friendly or helpful. The location, just around the corner from Times Square, was ideal & very central for sightseeing.", "title": "Fantastic Hotel !!!", "helpfulness": 1, "user": "HolidayHunter64", "date": "March 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14428425, "likes": {"liked": "— Friendly Staff, clean rooms, good location", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "I emailed the hotel a month before we went explaining that the holiday was a surprise 18th birthday present for our daughter and enquired whether they had interconnecting rooms as our daughters are 18 & 13. The Westin emailed me back immediately stating that they had found our reservation and would try to fulfill our request.", "title": "Recommend to stay here", "helpfulness": 1, "user": "KateLondonLondon", "date": "March 12, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 14236991, "likes": {"liked": "— Good service from Staff"}}, {"rating": 1.0, "title": "4 Star Hotels shouldn't serve coffee in paper cups!!!", "text": "On arrival at the hotel, the lady on reception dealing with our reservation, immediately wished my daughter a \"Happy Birthday\". She explained that we had been allocated interconnecting rooms on the 29th floor, which had just been refurbished. The check- in was completed extremely efficiently and quickly in a friendly but professional manner.", "helpfulness": 1, "user": "james_d69", "date": "March 10, 2008", "id": 14174495}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "The rooms allocated were amazing with a view of the Empire State Building. They were kept spotlessly clean throughout our stay & restocked daily with products.The temperature of the room could be controlled by ourselves using the thermostat in the room.The beds were so comfortable.", "title": "Luxury-like experience at an affordable price", "helpfulness": 2, "user": "jaysonsmith", "date": "March 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14171898, "likes": {"liked": "— Clean, very classy, friendly staff"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The bathroom, as previously stated in other reviews, was decorated with slate & stainless steel, and was kept immaculately clean. The twin-headed shower was to die for! I dont know how previous reviewers could complain about it. It was luxurious.", "title": "Fantastic Stay", "user": "Vee78", "date": "March 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 14004713, "likes": {"liked": "— Cleanliness", "disliked": "— Street Noise"}}, {"rating": 5.0, "title": "Pricey, but worth it", "text": "Yes it's on the expensive side, but what nice hotel isn't in New York?", "user": "MGMarch", "date": "April 1, 2005", "id": 3317939}, {"rating": 5.0, "title": "Very nice experience!!!", "text": "Stayed Sat-Tue Easter weekend and had a very good experience. Had to work hard to get the price I got ($279/nt club level). Originally booked a non-club level room with two double beds for $329/nt Sun-Wed. Later I saw on Westin website they offered a 15% discount if checking in Thu-Sat. The webiste showed a club-level room at $279 with discount, but I was concerned about getting my desired double room (one person at Westin reservations said there was no guarantee). So I called the hotel directly and was told to book the room online and call back to get the two doubles guaranteed (traveling with wife and 2 teens). Everything worked out fine.", "user": "A TripAdvisor user", "date": "March 31, 2005", "id": 3316051}, {"rating": 4.0, "title": "nice but just a few glitches", "text": "We drove to New York, staying just outside of the city in Fairfield, NJ, so we could get into Manhattan early Saturday and start sightseeing. Our room was not available, but the desk agent put a hold on our double, so we checked our bags and car and set of.", "user": "CjgMeK", "date": "March 30, 2005", "id": 3312773}, {"rating": 5.0, "title": "Request Corner rooms!", "text": "When we returned at about 4 p.m., we were able to check in quickly. We were booked into a handicapped accessible room and forgot to change it at check-in. Good move: the extra wide walking area in rooms made it seem all the more spacious. No NYC claustrophobia here. The only bad thing about the room was the location: it was on 15th floor at the corner of 8th and 42nd with a spectacular view of the Port Authority terminal! The club level is located on the lower floors (10-16 I think), so I am not sure any of them has much of a view. The plus side of the club level is the complimentary continental breakfast and evening hors d'ouevres. Avoiding the typical $15 per person cost of breakfast was a great deal; and we combined a late lunch with the evening snacks to avoid a $150 pre-theater dinner. The down side (at least this particular weekend) was the crowds. There was a seemingly endless flood of people, which kept the staff struggling to keep up with the demand. Still, the food choices varied daily and if you were patient, you always got enough to eat.", "user": "A TripAdvisor user", "date": "March 23, 2005", "id": 3295934}, {"rating": 5.0, "title": "Really nice place!", "text": "While the location of the hotel is very good, the entrance is on 8th Avenue, something I overlooked when booking. That puts you more toward the peep-show side of things, but still just a short walk to Times Square. We had the extra benefit of a major sideshow. While the kids were at a movie (at the conveniently adjoining Loews theater), half of the NYPD (at least 20 squad cars) ended up on 42nd St. just below our window. The best I could tell, they were chasing down guys selling counterfeit purses (I saw a load of them in the back of one squad car). It was quite a scene; if that kind of stuff makes you nervous, you should probably avoid NYC altogether, or at least Times Square.", "user": "davidt0526", "date": "March 22, 2005", "id": 3293069}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "I debated giving this hotel five stars, but settled for four. It's a very upscale business hotel located just off of Times Square (on 8th Ave. at 43nd St.). The service and rooms aren't quite up to 4 Seasons, but for the price and location, it's quite nice. Modern, well-furnished rooms, with widescreen LCD TVs. The bedside nightstand clock radio was actually an Ipod docking station. A very nice concierge lounge with free wireless. (Also free wireless in the lobby, but in the rooms, VPN-compatible internet access is $18 per day!). I did not ever eat in the hotel restaurant so cannot comment. The workout room is very well-furnished too. Bathrooms are kind of small, but hey -- it's New York. All rooms are small. There's a huge Starbucks on the back (42nd St.) side of the hotel, which is accessible without going outside.", "title": "Very nice", "helpfulness": 2, "user": "Chgo_biz_trvler", "date": "November 20, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6157040}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "Four of us stayed in a double club room on the 16th floor. Our views were amazing! We had a corner room and two large windows (room 1608). The heavenly beds were great and the service effieicent. The location can't be beat. You are two blocks to the red line subway to go uptown or downtown in a flash. We would stay here again.", "title": "Great stay at the Westin TS", "helpfulness": 6, "user": "Xlady", "date": "October 30, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6032183, "likes": {"liked": "— Great midtown location", "disliked": "— Bathroom could have been bigger"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2005, traveled as a couple", "text": "I've stayed in at least ten different hotels in the Times Square area, and the Westin clearly sets the gold standard. Since my wife was traveling with me for a 3 day weekender in the city, I wanted to stay at a nice property and the Westin didn't disappoint. We reserved a non-smoking king with a request for a view room. When we opened the door we experienced a panoramic view of the Hell's Kitchen neighborhood and the Hudson River extending from the George Washington Bridge to Madison Square Garden. The location is excellent, a block away from Times Square taxi horns, with a subway station in the same black.", "title": "Best Times Square Hotel", "helpfulness": 8, "user": "TVTravel", "date": "October 28, 2006", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6021273}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "Our room was bigger than most NYC hotel rooms. It was smartly decorated and spotlessly clean. Like all Westins, it featured the aptly named \"heavenly bed\".", "title": "Go For It!", "helpfulness": 11, "user": "Kymmberly", "date": "October 22, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5983001, "likes": {"liked": "— Location and room size.", "disliked": "— Hotel restaurant."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The second floor lobby bar is a great place to sip a martini and watch the parade of pedestrians flowing down 8th Avenue.", "title": "Great hotel, Great location!!", "helpfulness": 12, "user": "CFNOBIS", "date": "October 21, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5982187, "likes": {"liked": "— The location, tv, bed and shower!", "disliked": "— The bathroom sink."}}, {"rating": 5.0, "title": "Great location", "text": "This hotel is in the center of everything! The hotel is easy to get to, which is great when you have heavy packages. The room we stayed in was beautiful. Very modern, and we loved the white beds. Dual shower heads woke us up perfectly every morning. We enjoyed everything, but there are a few things I should mention. For those who like their privacy, there are no locks on the bathroom door, no fan, and the light in the bathroom shines very brightly into the shower. The bed was very comfortable, though, and all in all we had a FANTASTIC time here! Definitely will be back. I have never been in a hotel that is so fast, it makes your ears pop! So cool!", "user": "JACE", "date": "March 14, 2005", "id": 3271909}, {"rating": 3.0, "title": "Extra charge for NS & fitness", "text": "Stayed here weekend of March 5. Had booked on Travelocity and requested NS room for health reasons. I even called the hotel directly during the week to emphasize request and was told \"no problem.\" When we arrived at the hotel (early, I might add) we were told there would be no NS rooms available in \"our category because we booked through a third party\" but we could pay $30 more per room per night (plus all of the tax...) and get NS. So, that is what we had to do. I do not feel this was handled well. During my earlier phone call, I also asked if there was a fitness center and was told \"yes\", but no one told us it is $10 extra per person per visit. While the room was nice and facilities nice, I thought these extra fees were a ripoff and not in keeping with \"great service\" - if you want/need a NS room, beware!", "user": "A TripAdvisor user", "date": "March 13, 2005", "id": 3271006}, {"rating": 4.0, "title": "Great stay!", "text": "I stayed at this hotel for a conference in January. Loved the bed, very comfy. The location is great, a lot of sights are walking distance, and the subways are very close. There's a Starbucks downstairs if you want a quick cheap breakfast too. The rates for in room internet access were quite high, but there was free wifi in the lobby, although that was advertised nowhere. The only drawback was being forced to watch CNN in the elevators.", "user": "tiredconferencegoer", "date": "March 11, 2005", "id": 3267472}, {"rating": 5.0, "title": "Had a great stay!", "text": "Just got back from a trip to NY with another couple and loved the Westin! Great rooms with comfortable beds stacked with lots of down pillows, really fast elevators, good views, one room had a city view, one a river view. The food at Shula's was delicious, the location great, we walked to our show, Times Square, shopping...etc But the best part about staying at the Westin was the people who work there. From the front dest, to the concierge, to the bellman, we coudn't have asked for a more helpful, nicer group. They made our first stay wonderful and we will be back!", "user": "A TripAdvisor user", "date": "March 9, 2005", "id": 3263023}, {"rating": 4.0, "title": "Heavenly Bed", "text": "Overall, the Westin was an above-average experience. Aside from the Heavenly Bed, which definitely changed my life, the entire hotel was quite nice, but not spectacular. By Manhattan standards, the Westin is a wonderful establishment, but the room still could have been more spacious. I requested a corner room after reading that it really improved stay due to the windows on all sides. It really made a difference and I would recommend that everyone get a corner room!", "user": "A TripAdvisor user", "date": "March 9, 2005", "id": 3260962}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "My husband and I live in NJ and stayed at the Westin Times Square for 1 night because we were in town for a Bob Seger concert. Overall, this was a very nice hotel and we are used to staying at very nice properties (Ritz, Four Seasons, etc). I'll break this down in sections for easy reference.", "title": "Great Short Stay at the Westin Times Square", "helpfulness": 6, "user": "momcat1959", "date": "January 26, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 4.0}, "id": 6700484, "likes": {"liked": "— Location, View from Room", "disliked": "— Can't think of anything"}}, {"rating": 2.0, "title": "Nice, but some issues as well", "text": "Location: The location of this hotel is terrific. Located between 44th and 43rd streets it is close to the shows and many attractions. We walked to the Garden and it took us only about 10-15 min. We were right across from Madame Tussaud's.", "helpfulness": 2, "user": "fllw_fan", "date": "January 25, 2007", "id": 6693714}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "Check-in: We arrived about 4pm on a Thurs night. We waited only a few minutes and then the Valet took our car. It was $45 for valet parking and $25 for self park. We opted for the valet. It was cold and we were prepared for high prices, this is NYC. When we go away whether a long vacation or short over night, we budget for expenses. We were then sent up an escalator to the lobby. It is modern and sleek like the rest of the hotel. It's not the same Ritz gliz, but sleek and understated. Both are nice in their own right. There was no line and they took us right away. They had a little trouble finding my reservation, but since I had my confirmation printed out, they located it in short order. I had made a change from club room to corner deluxe upper floor that morning so things got a little mixed up (my fault). That brings us to the room.", "title": "Very disappointed", "helpfulness": 2, "user": "RachelinSoCAL", "date": "January 22, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 6636657, "likes": {"liked": "— The location", "disliked": "— The room was shabby and dirty."}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "Room: All I can say is WOW. When I explained to the desk clerk that I changed rooms because I heard (from this forum) that club level rooms were not on the highest floor and I wanted a good view, he said, \"so you want a good view, I'll give you one.\" And what view he gave us. When he gave us the key and it said \"4429\", my husband said I looked so happy. I said \"Wow, a \"29\" room. The 29 rooms are the rooms you want if you are looking for a view. We were on the 44th floor one side (3 windows) facing the Hudson River and Empire State Building, and the other the city and Times Square. This view was amazing. The room decor was sleek like the rest of the hotel. Done in black, grey and beige, with a splash of orange. The bathroom was not large, but well done with a stainless steel sink and black and white decor. We could even see the Hudson from the bathroom! There was a nice flat screen TV. The room was very clean.", "title": "Our Favorite Place in the Big Expensive City!", "helpfulness": 4, "user": "Carolyn S", "date": "January 20, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6628631, "likes": {"liked": "— Contemporary decor, trendy but not over the top", "disliked": "— the hallways -- dingy and depressing."}}, {"rating": 4.0, "title": "Perfect Location -- wonderful stay at the Westin", "text": "Restaurant: We ate both dinner and breakfast at Shula's. The steak was superb and the service top notch. I had a barbeque shrimp appetizer that was very nice. The creme brulee and cheesecake were both amazing. Large portions. Once again, expensive, but it's NYC and we budgeted for it.", "helpfulness": 2, "user": "xichic", "date": "January 17, 2007", "id": 6611190}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "A group of us stayed a week at the Westin New York at Times Square. The staff was friendly and helpful, service was prompt, everything was very clean, and the view from our corner suites was fantastic. (Loved the dual showerhead!) The location is perfect, close to Times Square and and walkable to theatres, bars and restaurants. The nearby subway system made travelling to other areas easy and convenient. Had a great dinner at their restaurant \"Shula's\" one night. All in all, we had a wonderful time and would highly recommend staying at the Westin at Times Square!", "title": "Great stay at the Westin Times Square", "helpfulness": 1, "user": "lui25", "date": "May 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109702613}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "L.P.", "title": "Great location but expect for hotel rating!", "helpfulness": 2, "user": "saelda80", "date": "May 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 109312627}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "We began by going to our room and finding quilt and pillows all over the floor and ring marks left in the bathroom on surfaces that hadn't been cleaned. We rang to reception and asked what we wanted to do either change rooms or someone come up to make bed but decided to move rooms. Had to queue again downstairs but then given another room on floor below. Rooms were nice but nothing special.", "title": "Centrally Located Comfortable Hotel", "user": "Kozano", "date": "May 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 109065792}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We were given umbrellas on our last day being told they are complimentary, it's unfortunate that we hadn't been told three days previous after getting soaked every day. so if there is rain whilst your staying there make sure you ask. They were helpful in organising our transport to airport. Overall a good hotel. After seeing photos from previous travellers I was eager to look at the valence of the bed after many photos showing stains. Unfortunately our room had stains on the valence also. I'm sure they had been washed but stained permanently. You would have though a hotel of this size would replace these to make sure they appear claen with the amount of money they charge.", "title": "Wonderful Westin Stay in NYC!", "user": "Wolfeway", "date": "May 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108973826}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "I stayed in this hotel for 3 nights to attend an exhibition in Javits Centre. I will not normally choose a central location like Times Square in New York but I had to be walking distance to the Javits centre and needed two double beds in the room to share with a friend and Westin was the best looking of available hotels. It is indeed extremely central, pleasant, professional and friendly staff, good modern decor. The room I stayed was quiet, overlooking away from Times Square, roomy with 2 double beds and a nice enough bathroom. The iron and board was a plus. The toiletries were very mean, not even shower caps. The area is of course extremely busy and difficult to find taxi in the evenings to go out for dinner. I used their spa for a body treatment and it was OK, nothing special. But all in all for my purposes it was adequate and pleasant.", "title": "Excellent Stay/Immaculately clean", "helpfulness": 1, "user": "TallTrvlGuy", "date": "May 18, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 108845862}, {"rating": 5.0, "title": "Fabulous!", "text": "We stayed here for 4 nights and loved every moment. We were lucky enough to get an upgrade so had the benefit of a high room with superb views.", "helpfulness": 1, "user": "Salpabs", "date": "January 27, 2007", "id": 6704980}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "Booked this unit for $150 through Priceline. Great deal. Location is perfect. Got to the hotel at 5pm and the lady at reception checked us in and upgraded our room to one of the newly renovated ones on the 11th floor. Beautiful room, very modern decor. Huge floor to ceiling mirror on one of the walls. The dual shower head was great. The room is clean, came with a bottle of water, a couple of wine glasses, a couple of free Starbucks coffee packs and an in-room Mac computer. That's where all the good things ended. We asked for a crib for our 9 month daughter. The lady at reception called for one before we headed up. I expected to hear a knock on the door within 30 minutes of getting in the room. We settled down, spent about 1.5 hrs in the room before heading out for dinner and still no crib. However, when we got back the crib was there. When my daughter had a little accident on the crib, I called for an extra crib sheet. 30 min later, I had to call again and ask for it. They came about 15 minutes after the second call. I wonder what happened to the person they sent for the first call. Instead of sending a bed sheet, they sent a blanket. The guy that brought it up was nice and very polite. He even ran down to get us a sheet, so to thumbs up to him. The next day, after the room was serviced by housekeeping, the wine glasses were nowhere to be found. Instead they replaced them with disposable plastic cups. Plastic cups! Are you kidding me? So my wife called to ask for drinking glasses. They said it will be brought up but no one came. We did not bother calling again. Then on day three, they serviced our room and did not leave us fresh towels. I mean no bath towels at all. I just noticed after I got out of my bath. So I had to use the little dinky face towels to dry myself. They brought the towels up within 30 minutes this time around. What a disappointment.", "title": "Nice hotel but service not consistent with their brand.", "user": "Emigoo", "date": "March 31, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59978705}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "Overall, the room was nice and well equipped. The bed was amazingly comfortable. The personnel was really nice except the service we got was really inconsistent with their brand. I expected more from a Westin. The plastic cups feel like a slap in the face, almost like we've upgraded you, you paid cheap because you booked through Priceline, so you don't deserve proper drinking glasses. I'd only recommend this place to a friend if you want a place at Times Square and you don't care much about service. Otherwise, stay at the W instead.", "title": "Above and Beyond!", "helpfulness": 1, "user": "TRadd", "date": "March 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59929499}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "I had an incredible stay! I was checked in by the most pleasant staff. Even though it was busy at the desk, the staff took the time to hold conversation and answer my questions. My room was clean, modern and had an amazing view. When leaving, I misplaced my business portfolio which the concierge staff immediately moved to help me locate, successfully! I was very impressed and will stay again without a doubt.", "title": "Nice Hotel, Would stay again!", "helpfulness": 2, "user": "MooneyPilot", "date": "March 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59573086}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "This was a nice suprise in Manhattan... The hotel is truly up to Westin quality standards throughout (unlike other hotel chains in Manhattan). The smell of white tea when you arrive is quite calming. The room was much larger than I expected. Usually, I stay at the New York Hilton on the Hhonors Diamond Floor (most renovated) and I have to say that the room here on the regular floor was much nicer and larger. The Westin Heavenly Bed is the best (in my opinion) of any hotel chain and the Heavenly Bath Towels are awesome after a shower. The shower was okay, but water pressure was a bit low. The location is very good with lots of restaurants in walking distance. I generally prefer the central location of midtown, but this was an acceptable location and would be a gret location if you wanted to see shows. The bar area was nice, though busy, and service was good. The hotel has a Shulas Steakhouse in the lobby level which is consistantly good. All in all, I would recommend this hotel and will stay here again!", "title": "Great service!", "helpfulness": 1, "user": "jmida", "date": "March 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59538907}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "My husband, my 6-month old daughter, and I stayed at the hotel for 5 nights and 6 days and were very impressed with the service. We had an overnight flight so arrived in the city at 7 AM. The front desk receptionist indicated that our room was not ready but recommended a great nearby cafe for breakfast. When we returned, our room was ready, and we were upgraded to a corner deluxe room. The view was amazing! The crib was brought up right away, and later during our stay, they also provided a high chair and a microwave. The location was perfect, close to everything, and we only took the subway to get to Brooklyn to visit friends.", "title": "Relaxing", "user": "moboogie", "date": "March 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59404811}, {"rating": 2.0, "title": "Not a 4 star hotel", "text": "I was very unimpressed with the Westin. I certainly would not give it a 4 star rating. Shower was clogged, very little space in bathroom (no place to put your make-up bag) staff was not very helpful. Even spoke with a manager and let me assure you that customer service is not their strong suit!", "helpfulness": 1, "user": "dpickert", "date": "February 25, 2008", "id": 13836373}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "We stayed at the Westin Time square 2/22 - 2/24.", "title": "Great location, great price, nice hotel", "helpfulness": 2, "user": "alwayz_on_vacation", "date": "February 25, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 13834084, "likes": {"liked": "— location and price"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "We found a great rate of $199/nt through travelticker and were even upgraded to a spa inspired corner room with a view of the river, wonderful massage chair and spa bath products. The hotel is nice, the staff very friendly and helpful and everything kept very clean. We did, however, return at 5 pm on saturday from a matinee show and shopping to find our room not cleaned but without a call someone came to do it about 6 pm. We were leaving to go to another show and dinner so it worked out fine.", "title": "Great Hotel & Location", "helpfulness": 2, "user": "rgarick", "date": "February 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13818360, "likes": {"liked": "— Location, Cleanliness & Star quality"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "The weather was cold, dismal and windy so we really enjoyed the great location, an easy walk to all the theaters, many bars and restaurants the port authority bus station, etc.", "title": "Excellent with a couple of hiccoughs", "helpfulness": 3, "user": "JanJanVanMan", "date": "February 24, 2008", "detail_rating": {"front_desk": 2.0, "business": 5.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 13815458, "likes": {"liked": "— The Apple computers in the room and the size of the room", "disliked": "— The maid service"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "We would definitely recommend the Westin Time Square and will stay here again.", "title": "Fantastic as usual", "helpfulness": 1, "user": "Catherine72", "date": "February 20, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 13699266, "likes": {"liked": "— Location, staff", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Very good location, just a few hundred meters from the Times Square with all its action.", "title": "Perfect hotel close to Times Square", "helpfulness": 1, "user": "P-D-Norway", "date": "March 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59360176}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled solo", "text": "Nice personell and a great lobby. Nice room with a wonderful view over the city!", "title": "I loved my room and the bed was so comfortable", "helpfulness": 1, "user": "atomkoko", "date": "March 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59326965}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Its 2 yrs since we stayed at the hotel, but we cant remember anything negative.", "title": "A quiet respite in a bustling neighborhood", "helpfulness": 1, "user": "Jazzycru", "date": "March 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 59322618}, {"rating": 5.0, "title": "Clean, safe, comfortable, GREAT BEDS!, friendly staff, competitively priced, great location", "text": "We recommend it.", "helpfulness": 1, "user": "nicksnymomma", "date": "March 23, 2010", "id": 59314248}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "It was in the heart of everything and everywhere I wanted to go. The location was great and the service was impeccable. I decided to extend my stay an extra night and the gave me a special deal.", "title": "They really tired to make our stay great ! i the morning bell george is great!", "helpfulness": 1, "user": "str8stud", "date": "March 21, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 59182945}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "I've stayed at this hotel so many times I can't even count. And every time I do I'm not disappointed. It is by far the best hotel in Times Square and probably my favorite place to stay in NYC. I'm surprised that other reviewers would have anything negative to say about this place because I have never had a bad experience here. Everything from the lobby, to the rooms, to the service, to the location is ideal in my opinion.", "title": "Best in Times Square", "helpfulness": 3, "user": "marblehead_prospects", "date": "September 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20512286, "likes": {"liked": "— Everything"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "Firstly, the rooms are about as big as you'll find anywhere in the city. The heavenly beds are incredibly comfortable and despite the fact that the hotel is just about a block away from the center of Times Square, I can't recall ever really noticing the noise from outside. The bathrooms are very clean, modern, and contemporary and I absolutely love the heavenly shower.", "title": "Cold, sterile, uncourteous", "user": "timmmad06", "date": "September 26, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 20389730}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "The location is also ideal being just a block away from the middle of everything in Times Square but equally conveniently located less than a block from the Port Authority bus terminal and right across the street from the entrance to the Subway. No matter how you come into the city it's easy to get to the Westin via public transportation.", "title": "great hotel choice for NYC", "helpfulness": 2, "user": "cj_minneapolis", "date": "September 25, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 20384920, "likes": {"liked": "— super comfy beds", "disliked": "— not a lot of bathroom counter space"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "I also happen to love the cocktail bar off of the lobby. They have a great martini menu and also have a light food menu... a perfect place to start an evening. I've also heard really good things about the steak house Shula's (although I'm not a big red meat eater myself).", "title": "Great place to stay", "helpfulness": 2, "user": "Maesha", "date": "September 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20326863, "likes": {"liked": "— location, cleanliness, amenities"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The concierge has always been very helpful in suggesting places to eat nearby and the front desk staff has also always been very accommodating in allow us to check-in early when rooms are available.", "title": "Very good overall but expensive", "user": "RobCh", "date": "September 22, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 20288632, "likes": {"liked": "— Close enough to the action but not in it, modern feel, amazing city view", "disliked": "— Bizarre bathroom, barely sufficient air conditioning"}}, {"rating": 1.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "This hotel was an utter disgrace from the moment i entered to the moment i left the staff were untrained rude morons and i blame the management which are obviously very bad. The hotel is a very badly run hotel...", "title": "What an utter disgrace", "helpfulness": 2, "user": "leeabbey", "date": "April 19, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 104617542}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "If the hotel was not in such a central area they would be bust as the staff are rude reception never picks up rooms were not cleaned properly and when you asked for anything you had to wait wait wait. I normally stay at the Ritz and the difference in the people staying here the staff was so different, their attitude stank and was on the level of a 3 star hotel. They also let anyone in the hotel and lift which was scary at night. My friends money was stolen from their room when they stayed there.", "title": "Pleasant stay - but disappointing to be overcharged", "helpfulness": 1, "user": "anget123", "date": "April 18, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 104542877}, {"rating": 5.0, "stay_parameters": "Stayed April 2011", "text": "Where do i start i arrived to the hotel late Saturday I was shown my club room which was renovated but not cleaned to a good standard and the noise coming through the window was so loud due to the double glazing not being changed in the last 30 years. I went back down to reception to some rude so called front desk manager who said there was nothing she could do. I then tried to call the RITz Battery park to try and leave but they were fully booked so needed to find a solution. I got the hotel manager on duty who found us another room and then said go to the club lounge for a drink which when I arrived the waiter said what do i want and he wanted to go home....", "title": "Westin TImes Square Great Experience", "user": "pattiruth", "date": "April 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104246671}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "The club lounge was an utter joke you had to PAY for your drinks this is unheard of and I have travelled the world and never had this. The Club lounge looked a little like a school canteen and the people working there were rude and unhelpful..", "title": "Very friendly and very clean!", "user": "mmbailey", "date": "April 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104192436}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "When i called done to reception ask for something no one ever picked up. I had to call 5 times to get my room cleaned and it took 2 hours for someone to come i ended up screaming.", "title": "Clean, Friendly and Well Located", "user": "CindyAngel", "date": "April 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 104175237}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "I took my girlfriend to the Westin Times Square for her 25th birthday. We had never been to NY before. Everything was great with the check in, our room. The robes seemed to be wore, and there was only 1 in the room. Housekeeping was quick to respond to bring us a second robe.", "title": "I had a so-so stay at the Westin Times Square", "helpfulness": 1, "user": "guyfromwyoming", "date": "August 10, 2008", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 18792558, "likes": {"liked": "— Nice Room", "disliked": "— Bar 10"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "The only complaint that I had, was at Bar 10. The food we ordered was not good. The food was under cooked and too salty. But we ate it and the next day my girlfriend & I had food poisioning. It ruined our NY vacation.", "title": "Great Service and Property", "helpfulness": 1, "user": "convert94", "date": "August 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 18790931, "likes": {"liked": "— Service of all staff, especially front desk", "disliked": "— Could use a little more counter space in bathroom"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The hotel was nice enough to adjust the check off our bill.", "title": "Never again!", "helpfulness": 1, "user": "krisyManila", "date": "August 9, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 18789065, "likes": {"liked": "— proximity to Broadway theaters", "disliked": "— efficiency/coordination of hotel staff"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "I would recommend the hotel, but definitely not Bar 10.", "title": "Sleek & stylish", "helpfulness": 1, "user": "Smiller11", "date": "August 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 18727690, "likes": {"liked": "— Location, style, view", "disliked": "— Umm nothing really"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We arrive late and unfortunately the hotel did not have our requested two bedded room available but the desk clerk volunteered to get the front desk manager who appologized, compensated us with a free dinner in the hotel restaurant and by the time we were through eating our request room was ready.", "title": "Fantastic Birthday Surprise", "user": "VTgirlKent", "date": "August 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18566486, "likes": {"liked": "— The bed!!!", "disliked": "— High Internet charges"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "My husband and I live in NYC, but stayed at the Westin Times Square last Thursday night for a \"night out.\" The room was so-so. The outlet in the bathroom is over the toilet, so you literally have to blow your hair dry over the toilet. Another problem - you get no cell phone reception in the hotel, so you have to use the hotel phone to make all of your calls and they charge several dollars for each call (I think about $5 per call with taxes, but can't recall for sure), so it adds up quickly. Also, no cell phone service means no blackberry service, so I had to log on to my computer (pay $15 for internet service) just to see if I had received e-mails. The bed was comfortable and we got a good night sleep even though you can hear noises from other rooms (people sneezing, flushing the toilet, etc., but no street noise). We went to the hotel's bar for a drink and got great service and good drinks. However, the hotel service is not so great - we called the front desk three times and asked for laundry bags, but they were never delivered.", "title": "Not horrible, but I wouldn't stay here again", "user": "BMR10023", "date": "May 12, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 29855003}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "My husband and I stayed at the Westin for 3 nights in NYC April 2009. The location was great for seeing shows. The hotel can be accessed from either 42nd or 43rd and it's right in the middle of all the action. If you want to stay in the heart of Times Square - this hotel is definitely a great option!", "title": "Great View, Clean Comfortable Rooms, Heavenly Shower, Comfortable Bed, Perfect Location... Horrible Internet!!!!!", "helpfulness": 1, "user": "BroadwayWannabe", "date": "May 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 29335451}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We encountered one \"not so friendly\" host at the front desk and she told us our room was not ready to try back in an hour. This was at 3:00 pm and she wasn't at all apologetic. They could have put us in another room immediately but since we had reserved a \"view\" room that wasn't ready yet - we decided to wait. The wait paid off and we got a beautiful view from the 41st floor!!! We could see the Empire State building and even a little bit of the water on the other side.", "title": "Had a great time", "helpfulness": 1, "user": "FirstClassOne", "date": "April 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 28911022}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "The $15/day internet access was horrible!!! The wireless connection was so low I could barely use it, and the wired connection was slow and unreliable. I tried to download a couple of large files I really needed and wasn't able to get them downloaded. I feel like if they are going to ask guests to pay $15/day they should at least offer reliable high speed service.", "title": "Top Class Hotel in a Top Class Location", "helpfulness": 1, "user": "fissy1983", "date": "April 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28888974}, {"rating": 3.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "Overall I had a great time though! The rooms were clean. The dual head shower and bed were both heavenly! The street noise was never a problem and we never heard noise from other guests. It was close to all the wonderful Broadway shows NYC has to offer!!!", "title": "Not great, not like a Westin should be", "user": "Brian&Alan", "date": "April 27, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 28875085}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "I booked this hotel after looking at HUNDREDS after reading the reviews on this site. I think the best way to judge a hotel is by finding out what others think rather than if the hotel has a glitzy website or a great deal.", "title": "Amazing Hotel and great value.", "helpfulness": 6, "user": "laceygabriella", "date": "January 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6715734, "likes": {"liked": "— amazing room and service", "disliked": "— Room could have been bigger but was large for NY standards"}}, {"rating": 4.0, "title": "dated decor but otherwise superb", "text": "I cannot write all the great points about the hotel because eveything was amazing. I have stayed in hotels all over the world and this is defianlty one of the best. The staff, the concierge service, the room and most of all the heavenly bed and shower were all second to none.", "helpfulness": 4, "user": "JulieGlaurelMD", "date": "January 28, 2007", "id": 6711893}, {"rating": 5.0, "title": "INSIDER TIP: \"Don't pay extra for the Club Lounge!\"", "text": "I would reccomend this hotel to anyone.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "January 28, 2007", "id": 6711629}, {"rating": 3.0, "title": "Less Than Expected at the Price", "text": "My best piece of advice would be to hold out and check the website weekly for a great deal, we paid just $209 a night for an executive room on the 32 floor with amazing views and every detail you could ever want.", "helpfulness": 2, "user": "cinncitraveler", "date": "January 28, 2007", "id": 6709522}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "fantastic location at times square, superb size room with air conditioning. good view over the city.", "title": "fantastic location", "user": "rambuster", "date": "August 20, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 19178348, "likes": {"liked": "— room and location", "disliked": "— nothing to report"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "This hotel is good. Very good position at Times Square. Rooms ok, a bit drab, but beds/bathrooms are good...it's just the decor, weird colours. The bar/breakfast diner are fantastic, and all in all good value, we obtained a far better rate via the hotels own website. A must is Ellens diner nearby and avoid breakfast buffet at Hard Rock...!", "title": "Good value", "user": "fyona", "date": "August 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 19153499}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Being a New Yorker I have had the chance to stay at the good and the bad in the City. The old adage you get what you pay for is true here.We stayed at a club level room for my brothers 50th birthday and found this hotel fantastic. Not only were the rooms super clean the service was above expectations. We had a few drinks in Bar10 although very low key the bar tender and wait staff were friendly and courteous. The rooms in this hotel are much bigger than others like the W in the area. You don’t feel like you are in a closet. As far as convenience you are steps away from everything the area has to offer. Literally. We saw Young Frankenstein which was several doors away. Overall this hotel is in a class of itself. We are not high rollers but felt like kings for the weekend. and can’t wait to go back next year.", "title": "A gem in the heart of Times Square", "helpfulness": 1, "user": "Robby7", "date": "August 15, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18997673, "likes": {"liked": "— Super clean hotel", "disliked": "— nothing really"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "Overall, this was a lovely hotel which I would definitely recommend if you are staying in New York.", "title": "Lovely Hotel", "helpfulness": 1, "user": "anna_rg", "date": "August 12, 2008", "detail_rating": {"front_desk": 2.0, "service": 5.0, "business": 3.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 18883194, "likes": {"liked": "— The Staff", "disliked": "— The Check-In!"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Our stay at the hotel started off quite badly as after 15 hours of traveling from England we arrived to find that our room wasn't ready as it hadn't been cleaned. The man on the desk told us he would go and find someone to clean it and would return in ten minutes. After ten minutes he informed us the room would be an hour till it was ready, at which point we were starting to get quite annoyed. However, they allowed us to have a complimentary meal at the restaurant and later in the week sent some wine and cheese up to our room as an apology for the inconvenience.", "title": "Not as happy this time around", "helpfulness": 2, "user": "Vacation209", "date": "August 10, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 18803058, "likes": {"liked": "— Great location; nice beds", "disliked": "— Terrible customer service; noise between rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled solo", "text": "I stayed at the Westin for 5 nights at the end of a month long trip throughout North America. I was generally happy with the hotel in the end, although my initial check-in experience was terrible.", "title": "Good location", "helpfulness": 1, "user": "Trekabout", "date": "August 28, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19453958, "likes": {"liked": "— Bed, room size, second front desk staff member", "disliked": "— first front desk staff member, concierge"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The lady at the front desk was extremely rude. I was two hours early for check-in and realised I would probably be unable to go straight to my room however she was exceptionally dismissive and almost annoyed that I had dared show up early (unavoidable due to flight times). As it was my first trip to New York I went to the concierge to see if I could get a map and some pointers to walk around until I could come back and check-in. Again I was faced with a rude and unhelpful staff member.", "title": "Good midtown location, spotty service", "helpfulness": 1, "user": "iheartvaca", "date": "August 26, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 19379999, "likes": {"liked": "— nice room with good use of space", "disliked": "— housekeeping inconsistency"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "However, that said this was my only complaint. By the time I returned there were new staff on the front desk and the gentleman could not have been more helpful or polite. I settled right in and was very happy with my room which was very large and had an extremely comfortable bed. I was very happy with the lobby bar, which had excellent staff and a nice atmosphere. It was clean with very fast elevators and I am a big fan of the in-room coffee machine.", "title": "Excellent service, fantastic hotel and what a perfect location!", "helpfulness": 1, "user": "George081", "date": "August 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19212863, "likes": {"liked": "— I liked everything, all worked so well!", "disliked": "— I cant think of any"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Obviously it is in a good location for broadway shows and plenty of tourist action.", "title": "Great Hotel for What we Paid", "helpfulness": 1, "user": "rylierules", "date": "August 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 2.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 19187582, "likes": {"liked": "— location, view, service, concierge, accessibility", "disliked": "— lack of maid service until checkout, then maid nocked on door 4 hours before checkout"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "I managed to get a very good price on the room so it was definitely worth it and I would stay again and recommend it, however had I paid more, the intital check-in experience would have definitely turned me off from returning.", "title": "Excellent location!!", "helpfulness": 1, "user": "bracamontes1123", "date": "August 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19181931, "likes": {"liked": "— Location--proximity to everything", "disliked": "— No fridge/microwave"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "Stayed here for a second time this year and was pleasantly surprised both times. This hotel has everything you would expect from a new and well maintained Westin. Except for the St.Regis, the rooms in the Westin are far superior to the other starwood properties in the NYC area (W Hotels, Sheraton, etc). The hotel gets a more mature crowd so it is not abuse by party goers like the W. If you are a starwood Gold member or higher ask for a corner room, its a great upgrade and an even greater view. Please keep in mind that this is times square aka the \"tourist trap\" so be prepared to deal with lots of noise, the higher the floor the less noise you will have to deal with. Great access to subway - NQRW123ACES trains all within 1 block!", "title": "Clean, friendly, but times square noise", "user": "novatravelreview", "date": "June 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 32084667}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "After reading many positive reviews, we decided to book a room for one night. Considering the location, proximity to the Port Authority and being a Westin hotel, we really thought the hotel was going to be great. Deluxe city view was just okay. Bathroom was the best part because of the awesome double shower. Room service was fine. No complaints there. Front desk staff didn't seem to be very familiar with the area as to give suggestions of places to eat. We found that very annoying considering they are right in Times Square. Will not be coming back to this hotel. I guess we had high expectations because the Boston Westin is beautiful and it is in a very nice part of the city. Hotel location is great if you are going to a show, other than that, book somewhere else away from stinky hot dogs stands.", "title": "Just okay - a little disappointing", "user": "snoopy4ever", "date": "June 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 31889715}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "Just returned from an anniversary stay at the Westin and have to say that this is a great hotel perfectly located for the tourist that wants to see the sites. Fifth Avenue, central park and Grand central station (to name just a few sites and streets) are all within walking distance. Used the subway and walked around at all times of the day and night and felt really safe.", "title": "Great location", "user": "onetrubrit", "date": "June 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 31664102}, {"rating": 5.0, "title": "What a great place to stay while in New York", "text": "The staff where always happy to help with any questions we had.", "helpfulness": 2, "user": "PinnellMom", "date": "May 27, 2009", "id": 30910292}, {"rating": 5.0, "title": "Best Hotel In Times Square", "text": "The one thing I would recommend you do though is not use the mini bar as the prices are something else! you can always get ''stuff'' in from the numerous stalls in Times square and yes as my wife say's this is me being tight with my monies but do me a favour and just take a look at the prices first before you judge me.", "helpfulness": 1, "user": "Smilyone", "date": "May 26, 2009", "id": 30829553}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We had an average stay at the Westin. It certainly doesn't feel like a high-class five star hotel but neither is it disappointing. The lobby is attractive and the beds were huge (we had a king), with a well-appointed bathroom. But the view we had was pretty dull and the paper was slightly peeling off the walls. The lamps were also not put together properly and rattlesdwhen you turned them on. A bit more attention to detail would vastly improve this hotel. I wouldn't pay $500 a night for this Westin but there are some good deals on the hotel website, so check those out.", "title": "Okay stay at the Westin", "user": "JaneKirby", "date": "September 22, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 20272015}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "This is the best hotel I have stayed at it were just a shame it were only for the weekend but i will be staying again next time i visit the big apple.", "title": "Best hotel ever", "helpfulness": 1, "user": "l3ann3t00ts", "date": "September 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20225264, "likes": {"liked": "— Very modern", "disliked": "— nothing it were all great"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The staff were very helpful and nice not at all rude like some other reviews made out.", "title": "Would Never Recommend This Hotel!", "user": "PTKAdvisor", "date": "September 19, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 2.0, "location": 4.0, "value": 2.0, "rooms": 3.0}, "id": 20187619, "likes": {"liked": "— The bathroom was exceptional, and the doormen were friendly.", "disliked": "— The reservation and billing experience."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "The rooms were huge and the beds are the best beds in the world there to die for very good for chilling out in after having a hard day at the shops and sights.", "title": "Sleek Oasis in Crazy Town", "user": "RissesPieces", "date": "September 18, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 20183797, "likes": {"liked": "— Location, and of course, the heavenly bed.", "disliked": "— Leaving it to leave town."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Also the room were very clean and were always done by the time we returned in the late afternoon.", "title": "Great hotel for sightseeing base", "helpfulness": 1, "user": "Graburn", "date": "September 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19889543, "likes": {"liked": "— location, room size"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "my sister and close friend stayed there for nine wonderful nights. the room we stayed in had plenty of room for the three of us. i believe we were in the deluxe double. the room was very clean as was the entire hotel. the staff was very professional and polite. i had a chance to check out the spa which i loved, could have spent more time in there. if you would like a little frig for continous drinks and to put a few snacks/food in they will provide you with one. there is everything you need in this area, the night-life, liqour stores, comedy shows across the street, drug store, endless food, a movie theater, we took in SITC, great movie.. easy excess to everything.. oh yes the beds were heavenly.. i would recommend this to anyone as i haved been to nyc 3 times and this was my best stay. it was a little more cost wise but truely worth the little more that i paid. i miss the westin and can't wait to get back to enjoy fabulous new york city..", "title": "miss it, would go back", "helpfulness": 1, "user": "misheeCanada", "date": "October 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21159790, "likes": {"liked": "— service, cleaniness, excess", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "My wife and I checked in to the Westin New York last weekend and it really blew us away. The location of the hotel is ideal, since it is so close to Times Square, but the doors don't open directly into the massive crowds of people on Broadway. Considering the large size of the property, I was especially impressed with the quality of service. Check-in was a breeze, there was virtually no waiting at all. When I called the front desk from my room, someone picked up the phone immediately and was able to assist me. Housekeeping was attentive and did a great job. We were in a junior suite, which was a huge room by NYC hotel standards. Great views from our giant windows (which also kept the room nice and bright) and the room was also very quiet. The bathroom was cool and modern and everything was super clean and comfortable. We would definitely recommend this hotel over the other hotels in the TImes Square area.", "title": "Great Hotel!", "helpfulness": 1, "user": "CousinBenny", "date": "October 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 21118949, "likes": {"liked": "— Great views from great rooms!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "This hotel is wonderful... Not to mention the Staff!!! Very polite, courteous and profesional! When I mentionned it was my first time in NYC, she decided to give me the room with the BEST view... And I have to admit, it was!!!! I dont think I could of got any better. The room was big, clean and had everything I needed to complement my stay in Time Square. Conveniently located, this hotel is close to anything and everything!!! The only thing is the hotel's restaurant... WAY TOO EXPENSIVE!!!! I dont see how they can justify 6$ for a small coffee... It ended up costing 60$ for ONE breakfast, for two... CRAZY!!! But beside that, I would stay there again without even thinking about it! :)", "title": "Awesome experience... Breathtaking view from our room!!!!", "helpfulness": 2, "user": "danyka006", "date": "October 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 21032195, "likes": {"liked": "— The location, the view", "disliked": "— The restaurant!!!!!!!!!!!!!!!!!!!!!!!!!!"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "This was a great hotel! Shula's steakhouse is in the lobby so the food is fantastic if expensive. The rooms were clean, and surprisingly spacious for Manhattan. I loved being right by Times Square as we were easily able to walk to most of our sights and the subway was close to get us everywhere else! The bed was yummy, exactly what you expect from a Westin hotel. I will definitely stay here next time we visit the Big Apple!", "title": "Brilliant location!", "helpfulness": 2, "user": "nielsensmith", "date": "October 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 20991023, "likes": {"liked": "— The central location was excellent", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Stayed here for 4 nights. The hotel is in a great location for Times Square. We had a King room which was excellent, large for NYC and with a huge comfortable bed which is what you need when you have been on a long flight and also after long days of sight seeing! Did not hear a thing from neighbours so we had a sound nights sleep, plus being on the 44th floor meant great views of the city and no street noise. The air conditioning worked very well and one of the quietest systems I have experienced recently. The room was very modern with everything you could expect (bathroom had 2 types of shower gel, conditioner, body lotion, sewing kits, shower caps, vanity kit and mouthwash). There is a coffee machine that brews Starbucks in the room which is great but to make a simple cup of tea was a challenge and they never provided enough creamer also the room service was expensive (but to be expected) but they were our only negatives. You pay a lot for an average hotel in NYC but not a lot more to get a high standard one so I would definately recommend this hotel.", "title": "Great Location, comfy beds", "helpfulness": 2, "user": "Y2CLL", "date": "October 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 20974123, "likes": {"liked": "— Bed", "disliked": "— Cost of room service"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "I spent ages looking for a special hotel to celebrate our 30th Anniversary. It was also our first time to New York so we didnt have any knowledge of the area. We went at a very expensive time of year and so our expectations were probably high. On arriving at the Westin we were dissappointed that it really is predominantly a business hotel although the reviews we had read were really good. The room we had been appointed was nothing special, no bath although it did have very good views from the 38th floor. The following day I spoke to a lady at reception saying how disappointed we were that it was not a little more special for our anniversary and she said she would see if she could do anything although it was unlikely as they were so busy. Upon returning she had kindly managed to find us a corner room which is much better because you have more windows and the rooms are generally a lot bigger. The room was better and we had a bath and amazing views from the windows but it is definitely not really the sort of hotel for a romantic break. There are several other small chic hotels that we visited that I wish I'd have booked in hindsight which are very trendy and a lot more personable and no dearer. These are the 'W' hotels if I'm allowed to say it. But overall we had a great time and tried to make the best of it. We didnt use the hotel facilities at all, choosing to eat out. We had a wonderful cruise along the Hudson River at night and also a lovely meal at River Cafe just the other side of Brooklyn Bridge which was very special. Also the Boathouse restaurant in Central Park was pretty magical too. We did a food tour with Foods of New York around Greenwich Village which was really a great way to spend a few hours and was a highlight of our visit. It takes a while to know where you're going with all the shops, some are incredibly expensive but we really liked Maceys, huge with some really good deals.", "title": "Not great for romantic break", "helpfulness": 2, "user": "gra500360", "date": "February 27, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "location": 5.0, "value": 3.0, "rooms": 4.0}, "id": 6846683, "likes": {"liked": "— very comfy bed 'heavenly beds'", "disliked": "— too businessy"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "This property is newer, but comparable to many I've stayed at in NYC. The location is phenominal and the staff is attentive. Upon arrival, we were upgraded and our room was ready early. The room was very good & comfortable. Toiletries weren't stocked properly, but that was corrected the next day. Cleanliness of the bathroom was ok, but borderline. My suggestion is for management to keep an eye on that. I would return to this hotel if pricing was comparable to or better than others.", "title": "Good stay & treatment", "helpfulness": 1, "user": "kekeman", "date": "January 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 150787060}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "I'm here on business. Living in NJ I rarely stay in the city but in this case business needs made it a necessity, etc. The decor is spooky and dissonant, a strange mix of wood and Eurotech Orangish belch. The rooms are small and dreary. The plumbing leaky and noisy. I'm shocked it gets such good ratings. When I read one of the best hotels in NY given the really world class establishments in this city I am appalled.", "title": "Above Average? Seriously??????", "helpfulness": 1, "user": "stevesottl", "date": "January 27, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 150780691}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "The Westin Times Square is just OK....I stay at this hotel because it is close to my office and was at one time an excellent choice but not it is in need of some renovations (they are doing some of the rooms on the upper floors)....The gym is OK and the lobby is big and inefficient. Staff at check in are friendly and helpful. They have breakfast in the lobby bar in the morning but I am told that will shut down on January 27th....if you ask the staff what they plan to do the response is consistent (they do this all the time, shut things down with not plan)....", "title": "Westin Times Square", "user": "JacquelineSmith", "date": "January 27, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 150741673}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We have stayed at the Westin Times Square many many times, and each time, the service and the people are extraordinary.", "title": "Always a Wonderful Experience!", "user": "SDG896", "date": "January 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150738709}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "The rooms are spacious, and excellently maintained, and of course how can you go wrong with the views of beautiful New York City!!", "title": "Best place to stay in NYC!", "user": "Starwoof", "date": "January 27, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 150735163}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "We just love staying at this hotel. There were 2 of us who have stayed here several times, and 2 who were new. We may be back in NY in November and everyone has asked that we stay at this same location.", "title": "We always look forward to staying at the Westin New York at Times Square", "user": "moochieg", "date": "April 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104172158}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Myself and my new husband spent the last two nights of our honeymoon in the Westin New York at Times Square and it was fantastic!! On arrival there was some confusion over our booking and because they were almost fully booked we were given a double upgrade to one of their Atrium Club rooms. It was gorgeous. Much bigger than most New York rooms, had a fantastic corner window overlooking the craziness of the New York streets below and the bed was fabulous - really comfy and big enough for 4 people never mind 2!", "title": "Perfect End To Our Honeymoon!", "user": "SheensK", "date": "April 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104140574}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "The location of this hotel is amazing, 2mins walk from Times Square and across the road from a subway station that'll take you anywhere you want to go. If I'm in New York again (which I plan to be) I'll def want to stay here again!!!", "title": "Fantastic location, great rooms", "helpfulness": 1, "user": "MandaB01", "date": "April 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104127386}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "Thsi hotel is located 1 minute from Times Square adn right next to 42nd St Bus and Subway station.", "title": "Won't find service here!!!", "user": "LouisianaLadyBug", "date": "April 14, 2011", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104052087}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The checkin was quick and the room allocated spacious and clean. The facilities in room include an alarm with Ipod connector as well as information about the hotel and things to do.", "title": "An oasis of comfort", "helpfulness": 1, "user": "dstenson54", "date": "April 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 103420559}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "I absolutely LOVE this hotel! Three friends and I spend five nights at the Westin every year the week after Thanksgiving. A nice girls' shopping trip! I have never had one problem in the four years that I have gone there. The staff is always friendly and courteous. Concierge is always so helpful--giving advice about restaurants and which subway train to take. My three friends think they are in hog heaven when they go with me to the Westin. One of my friends says that I have spoiled her by taking her to the Westin Times Square. This place really knows how to treat you! One day on this year's trip, we accidentally left the \"Do Not Disturb\" sign on the door all day long! We came back to the room at 6 pm to find it in the same condition we had left it. We called the front desk just to ask for some clean towels. They sent housekeeping in immediately to completely clean our rooms. It was our fault that we left the sign on the door! But they are always so accomodating! I promise you that you won't be disappointed with this hotel---at least I never have. I love it so much that I'm taking my husband, two college-age kids, and two of their friends back after Christmas. I know they will love this hotel.", "title": "My 4th Time Here", "helpfulness": 1, "user": "NotesForYou", "date": "December 6, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6336190, "likes": {"liked": "— The large rooms with great views.", "disliked": "— Ask the concierge for help with choosing subway trains."}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Great hotel, very modern. The room was very comfortable with a great shower (dual shower heads!! loved it). Wonderful view from the 27th floor and totally silent at night. The noise from the elevator was a bit annoying at first (we were right next to the elevator).", "title": "Such a cool place", "helpfulness": 2, "user": "seagal_30", "date": "December 5, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6335406, "likes": {"liked": "— The location could not be better.", "disliked": "— Bag check was pretty busy, but was the holiday season so no big deal."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Stayed at the westin in october and it was just what we wanted .", "title": "right in the middle of it all", "helpfulness": 2, "user": "justgo", "date": "December 4, 2006", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6330900, "likes": {"liked": "— in the middle of it all", "disliked": "— Rooms a little on the small size"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "It was smack bang in the middle of it all we love it .", "title": "Good hotel in Times Square", "helpfulness": 2, "user": "reisejunky", "date": "November 30, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6307957, "likes": {"liked": "— great view of the Hudson River from our 34th floor room", "disliked": "— nothing, really"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "We was a little worried because we had just got married in vegas and stayed at the bellagio so we were thinking that our hotel would not be as nice but we had nothing to worry about", "title": "Great Hotel and Service", "helpfulness": 5, "user": "yachtinteract", "date": "November 30, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6307767}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled solo", "text": "Do not confuse the Westin with the Wynn or Wyndham", "title": "Do not confuse the Westin with the Wynn or the Wyndham", "helpfulness": 1, "user": "jerry50MW", "date": "October 16, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 20937369, "likes": {"liked": "— Quality bedding", "disliked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "hotels, the Westin is not as nice as the others. This hotel", "title": "Excellent", "helpfulness": 1, "user": "mistralksk", "date": "October 11, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 20798025, "likes": {"liked": "— Location and rooms", "disliked": "— Location"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "is located in the crowded Times Square area. I had hoped", "title": "Do Not Stay Here", "user": "triplovee", "date": "October 10, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 20776065, "likes": {"liked": "— The Bed", "disliked": "— The Staff"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The Westin, NY at Times Square is a great place to stay.", "title": "A Great Hotel in a Great City!", "helpfulness": 2, "user": "Michael G", "date": "January 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 150301996}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "I visited with My Wife and 3 Kids and stayed for a week.", "title": "OUTSTANDING STAY!!!!!", "user": "Michael T", "date": "January 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150301772}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "The rooms were great and the staff were accommodating.", "title": "Beautiful building, friendly and helpful staff, and great location", "user": "Mermaidgirl1973", "date": "January 22, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 150286110}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "It is located in a central spot and is within easy walking distance to everything.", "title": "Great Stay as Usual at the Westin Times Square", "user": "kappyWashington_Dc", "date": "January 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150277170}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The concierge was great as I wanted tickets to the baseball and he had no problem sourcing the tickets I needed (great seats).", "title": "Great location but!!!", "helpfulness": 1, "user": "FiveStarKazz", "date": "January 22, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 150240101}, {"rating": 2.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "American Express travel services arranged our trip to New York.", "title": "Not my kind of place", "helpfulness": 2, "user": "mrsregino", "date": "December 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 148137981}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "They rarely miss, however this time, they sure did by booking us at the Westin Times Square.", "title": "Decent Stay, Good Location", "user": "Ryan B", "date": "December 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 148075378}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Staff was very nice, however problem was rooms. They are ultra small, not NY kind of small, more like prison cells. This matches with the green they picked for the walls. You get the feeling of either being in a hospital, a cell or a dorm room.", "title": "Nice break...but....", "helpfulness": 1, "user": "CL232012", "date": "December 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 1.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 148069180}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "Depressing.", "title": "Great Hotel", "user": "Carol M", "date": "December 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148050235}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "This was my second trip to New York and the Westin was exactly what we were looking for, a good location, nice hotel, and not to pricey. My wife and I went there for a long weekend with both of our mothers (daring I know). The room was not that big, but this is New York...the four of us were fine in a room with two queens. The view from our room was unfortunately non-existent, but we weren't in the room much anyway. The service was great, the staff helpful, and as I said before the location is great.", "title": "Westin Times Square", "helpfulness": 1, "user": "Mitch B", "date": "December 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148007162}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We spent 6 nights in April. After a late arrival (we had booked through Expedia - maybe that was the problem) we were told we would have to change rooms the next day so don't unpack. This was inconvenient and we were never given a real reason for having to move. The next morning when we left the hotel, one of the concierge staff was having a loud argument with a cab driver who he eventually told to f... off!", "title": "rooms nice, service poor, staff rude", "helpfulness": 5, "user": "mozartandmonty", "date": "June 2, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 2.0, "service": 1.0}, "id": 111045582}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "The rooms came with computers with wireless internet which was good. However one day when it didn't work we rang reception who wanted to argue and inferred we didn't know how to use it. They put us through to help desk who told us all of hotel wasn't working. When we rang back to tell reception no thanks was offered for letting them know. All they said was okay and slammed down the phone.", "title": "Would definitely return", "helpfulness": 2, "user": "gatrgrad", "date": "June 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 111026558}, {"rating": 2.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "We have stayed at many 5 star hotels including many starwood but this was defintely not a five star experience", "title": "Very average all around and wouldn't return", "helpfulness": 1, "user": "AKCToronto", "date": "May 31, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 3.0, "service": 2.0}, "id": 110788600}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "I'm a little late in getting this posted but wanted to write anyway. This hotel is probably your standard Westin. Staff was friendly and helpful. Room was good with flat screen tv. We had a problem with the shower head but it was fixed promptly. Hotel is very conveniently located, close to Times Square. The subway is a really close walk to/from the hotel, even if you have luggage. You don't need a taxi to get there. Save your money. We got there early and our room wasn't ready yet but they called us to let us know when it was ready. I would definitely return without hesitation.", "title": "Perfect location, restful sleep in NYC", "user": "CHEESESLAVE", "date": "May 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110753748}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "This isn't the Trump SoHo...I get that but this hotel needs to seriously revamp their service. Perhaps we made the mistake of staying during the weekend. It's a big hotel and they don't employ enough staff to handle their guests. Checking in at 2 PM was ridiculous. There was a long long line-up and only 1 attendant at guest services at prime check-in time on a FRIDAY! Although I'm a Starwoods preferred member, I skipped that line because it took longer! When we arrived, the hotel had decided to change our reservations. Luckily I had an email confirmation regarding the original rooms we had booked. TIP: Bring any reservations via email with you as you never know if they will try to give you something else. As a result of my presenting my original reservations we were upgraded to the corner rooms which were great in size. They are very very large for any hotel in any city. The amenities were poor. We had to constantly ask for towels and toiletries. You may need to call for the same thing a few times before you finally get a response. Even if you complain that your phone isn't working for incoming calls and they send someone to investigate, it still won't be taken care of. TIP: if you need to contact guest services, never dial '0' as you'll get charged for that connection! Even though there is a 'service' button on the telephone, they may not answer but don't dial '0'. It's just the way this hotel operates.", "title": "Great location, super-nice people, well-appointed.", "user": "Andreawine", "date": "May 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 110741423}], "location": {"country": "United States", "city": "New York City"}, "stars": 4, "variance": {"poor": 200, "average": 468, "very good": 1266, "terrible": 92, "excellent": 1783}, "aka": "The Westin New York At Times Square Hotel New York City", "slim_ranking": 0.296380090498, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Our Times Square Hotel is located in the heart of New York. The Westin New York at Times Square Hotel offers a great location and comforting accommodations."}