{"user_rating": 4.0, "review_count": 151, "name": "The Xara Palace Relais & Chateaux", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We stay for one week at the Xara Palace inside the ancient village of Mdina.", "title": "Ancient luxury style - marvelous experience ;-)", "user": "traveller1969", "date": "July 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 71331535}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "You can touch history at every stone inside the castle. Very friendly and professional staff, very good food at the restaurant and an opportunity to reside inside a very old place.", "title": "The place to stay in Malta", "user": "luisrr", "date": "July 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 70508375}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Charming hotel which we would like to recommend to everybody who plans to visit Malta.", "title": "An oasis for relaxation", "user": "vinobuffer", "date": "June 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 66518144}, {"rating": 5.0, "title": "beautiful small boutique hotel", "text": "Same high level of quality like other Relais & Chateaux places we experienced before.", "user": "GunnarP", "date": "June 1, 2010", "id": 66057060}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We recently spent five nights at the Xara Palace. Without a shadow of doubt, the place to stay in Malta is Mdina and in Mdina the Xara Palace stands out as the best alternative. Valetta holds many tourist attractions, but precisely because of that it feels overcrowded. By contrast, Mdina, especially after five o'clock, offers a captivating experience with its narrow and silent streets that transport you in time. The service throughout was impeccable and unobstrusive. The reception desk was informative and efficient (got us tickets for the Hypogeum). The Trattoria is fine for most meals and the Mondian offers excellent cuisine as is to be expected from a Relais & Chateau member.", "title": "Gorgeous Hotel in Beautiful Location.", "user": "CoupleWarwickshire", "date": "October 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 47941043}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "My husband and I have stayed at some of the best hotels in the world and his usual comment is 'it's nice' much to my frustration! However he was blown away by both Mdina and the Xara Palace. In Mdina itself most of the bars and restaurants were closed but we were only there for 3 days in any case. We ate at the hotel one night and at Bacchus twice. There will be much more choice during the main holiday season. As for the Xara Palace we were in Room 6, the largest of the basic rooms and it was magnificent. A very large seating are downstairs furnished with antiques together with a small balcony. Upstairs was the bed and the bathroom. During our stay the staff couldn't have been more helpful and the room was spotless. The view from the breakfast room was spectacular. On the day we checked out we were allowed to use Room 7 to freshen up which had the real WOW factor. It had 2 shower rooms, a roof terrace with hot tub and silk furnishings. Brad Pitt and Sharon Stone have stayed in it. If you want lots of bars and nightlife then don't stay in Mdina but if you want sophistication and a wonderful base to go back to then choose Mdina and Xara Palace. We travelled with Kirker holidays and I can thoroughly recommend them as well.", "title": "Exceeded expectations -quite stunning", "user": "PandCDoncaster", "date": "January 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94919864}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "If you want to have a beautiful hotel in a quite place to make day excurtions to discover Malta, this is the best place. The hotel is very nice, and is located in the old part of Mdina, one of the most interesting cities in Malta. If you preffer to spend more time in Valetta, then this might not be the best choice.", "title": "Magnificent building in quite part of the island", "user": "Suabo", "date": "December 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 90069770}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "This was the third hotel we stayed at as part of our wedding/honeymoon and was unfortunately our least favourite of the three. Having looked at the hotel’s website, we were expecting to have a relaxing and comfortable stay in beautiful surroundings. The surroundings are certainly beautiful, but we found our room to be cramped and dilapidated and definitely not relaxing. The bathroom wasn’t particularly impressive – the shower screen was rusty and the shower temperature and pressure were very variable. The seating area was far too small to relax in and there was only one small wardrobe and a chest of drawers for storage. The air conditioning was old and noisy so we had to turn it off at night so we could sleep. Due to the noise from the street outside, it was impossible to sleep with the window open so the room got very hot at night. Our biggest bugbear, however, was the stairs between the mezzanine sleeping area and the seating area/bathroom. The lack of handrail alongside most of the steps made them dangerous at night and the loud squeaking they made meant that neither of us could use them without waking the other one up. After 2 nights there – we were glad to leave!", "title": "Not as good as we expected", "user": "Corinne76", "date": "December 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 88740174}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "On the positive side, the building and location are lovely and it was great to be able to pop back during the day when Mdina itself was too crowded. The roof terrace was an added bonus and should be promoted more. The staff were also very polite and helpful – and we did receive a personal reply to the comment form we submitted. I think it’s possible we would have had a better stay in a different room to the one we were given (room 5).", "title": "Stunning beauty - A true world heritage site - a magical place", "user": "travelistanr1", "date": "October 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 85365504}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Mdina itself is a ‘must visit’ during the day but at night there is little to do and we found the restaurants there to be a bit overpriced. On our last night we ended up at the Grotto Tavern in Rabat which had a lovely food at good prices – we would definitely go there again. If we ever go back to Malta then I think we would certainly revisit Mdina itself but it is highly unlikely that we will ever go back to the Xara Palace.", "title": "Tranquil Oasis and a great base for all of Malta", "user": "JV1977", "date": "July 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71763225}, {"rating": 5.0, "title": "A palace as its best", "text": "Just excellent! The place for an extra special day and night...", "user": "SwissGuyWinti", "date": "October 6, 2009", "id": 46036175}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "We're just back from 4 days in Malta, where we are getting married next year. We're having the reception at the Xara Palace and I have to say we can't wait. The staff have all been fantastic in particular Johanna, who looks after events, has helped with everything from flowers to photographers to musicians/DJ; and Kevin, the chef, did two beautiful menus for us and came out to talk us through our meal as we tasted both options and chose the combination we wanted. Bernice in the De Mondion restaurant was also really helpful. The food at the Xara Palace was amazing, beautiful presentation and lovely ingredients - we can't wait for our wedding!", "title": "Unique hotel - excellent staff", "user": "fionapm", "date": "September 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45222681}, {"rating": 2.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We were shown all of the rooms/suites but one (suite #7) and they're all gorgeous, from the duplex suites where you can sit in your rooftop jacuzzi with a drink and look down over the whole island to the standard doubles, they're all tastefully decorated, combining antiques with mod cons. Even the standard doubles aren't the usual run of the mill rooms, they're all different, whether with views over the piazza, out over the island or peeking out into the winding lanes of Mdina from a juliet balcony - all characterful and comfortable.", "title": "DO NOT GO THERE", "user": "Jepetto62", "date": "September 20, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 43025721}, {"rating": 5.0, "stay_parameters": "Stayed August 2009", "text": "We just got back from a trip to Malta and stayed at the Xara Palace. While the hotel is charming and well located, it does certainly not live by its supposed five stars standards.", "title": "One word - AMAZING!!", "user": "Traveller12399", "date": "September 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39762763}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The jacuzzi was broken (and not very clean...), furniture and rooms have had better times and cleanliness is not one of their strength.", "title": "Perfect place !", "user": "Fanf", "date": "July 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36167579}, {"rating": 3.0, "title": "OK.....", "text": "The hotel delivers great service, but it is expensive and my feeling of the rooms was more \"drafty\" than stylish. It is located in a truly historic area, but I would rather be near the sea next time.", "user": "PandEKew", "date": "May 1, 2011", "id": 106324218}, {"rating": 3.0, "stay_parameters": "Stayed April 2011", "text": "The hotel was situated in very historic area.Reception staff could not explain the Easter package we booked and did not produced the service.My son and I booked seperate rooms.The rooms was different, noisy at night with the high winds blowing through the shutters. The breakfast resturant staff, menue and service was excellent. I will not recommend this hotel in the future.", "title": "Not 5 star,overpriced,noisy.", "user": "ocean055", "date": "April 28, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 105929356}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "Pamela and Stacey Martin", "title": "Our favorite", "user": "mat101010", "date": "March 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99827961}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "My wife and I gave her parents a trip to Malta as a birthday gift. Naturally, we tagged along for the ride. Most everything was booked because of helpful reviews found on tripadvisor with the exception of the Xara Palace hotel. I never found this hotel's entry until after the trip was over. And let me tell you - what a great surprise.", "title": "Amazing hotel where the staff were outstanding", "user": "LondonUKjohnW", "date": "February 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98244964}, {"rating": 2.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "We aimed to do a bit of everything on our 5-day trip. As such, we booked two nights at the Phoenicia in Valletta, one night at the Kempinski in Gozo, and then 2 nights at the Xara Palace in Mdina. Although the Phoenicia offered a great location and the Kampinski provided relaxation, the best was saved for last. These were all four and five star properties but the Xara Palace was our favorite.", "title": "Very disappointing", "user": "GiaEastGrinstead", "date": "February 3, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 95358752}], "location": {"country": "Malta", "continent": "Europe", "city": "Mdina"}, "stars": 5, "variance": {"poor": 9, "average": 14, "very good": 40, "terrible": 5, "excellent": 83}, "aka": "The Xara Palace Relais & Chateaux Hotel", "slim_ranking": 1.0, "description": "The Xara Palace Relais & Chateaux has 17 Rooms and Suites, all vary in size and style. Some of the Suites have Jacuzzis on their private terrace with spectacular views of the island. The Duplex rooms and Suites offer split level accommodation with the lounge area and private facilities on one level and bedroom services on the other level of the Room or Suite. Outdoor pool is available in an alternative location and shuttle service is provided."}