{"user_rating": 4.5, "review_count": 1206, "name": "The Grand Mayan Acapulco", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "This was the first time we used my friend's time share, normally we try to fint the cheapest place to stay, and I was extremely pleased with the outcome. From the minute we walked into the main area and looked out at this scenic pool that seemed to touch the ocean. Just Beautiful! Then with the added surprise that we were being upgraded to the Grand Mayan, because the SeaGarden was under renovations.", "title": "Rembering the Mexico that I Loved", "helpfulness": 1, "user": "GinM", "date": "June 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 31721896}, {"rating": 5.0, "title": "Acapulco, MX was FAB!", "text": "The room was excellant, it had three sinks in the bathroom, a shower, a huge tub, a wading pool on the balcony, toaster, blender, mirowave, coffe pot, ironing board/iron, hair dryer, dishes, etc. I slept on the sofa which turns into a twin bed and it was very comfortable (extra sheets, blanket, pillows). At night the maid would come in and turn the down/make beds(sofa), while always leaving chocolate. Only issue I ran into, is at certain times of the day (when everyone is heading back from the pools/beach), there was no hot water for the showers.", "user": "honeydewflute", "date": "June 2, 2009", "id": 31430294}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "The grounds, pool, beach area were kept extremely clean. The pool area was set up to be like a mini river that wound around the propertly near the beach. Never once had a problem finding a lounger to relax in by the pool. Everyone was so friendly and if you needed anything they were there to assist you.", "title": "The Grand Mayan Is Beautiful", "user": "smaken", "date": "May 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 31177837}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "However, the highlight of the trip was using the service of Sebastian Hernadez, who we found using TripAdvisor. He picked us up from the airport and from that moment on I felt like we were part of the family.", "title": "Outstanding February Getaway- better late than never!", "user": "NurseInNY", "date": "May 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 30179736}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "One day we took the city tour around Acapulco and were shown the high-lights, such as the cliff divers, the location of the Hollywood actors, silver shop, and Diego Rivera's murals. The story about Diego Rivera and why the murals were created was fanastic (everyone loves a good love story).", "title": "Girls Just want to have fun!!", "user": "Shiloh46", "date": "May 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29420979}, {"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We travel a lot and we are used to different qualities of management; but as soon as we arrived at the hotel we were frustrated by the absurd policies and restrictions. The people selling time share are really a plague! The are rude and very persistent.We felt oppressed!", "title": "Management was terrible!", "helpfulness": 2, "user": "Trip60", "date": "August 9, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 37172917}, {"rating": 5.0, "title": "This Resort Has It All!!!", "text": "The place is OK generally, but the policies are not clear and very confusing. Staff are not well trained and answer without having the knowledge. We night we were informed that the hotel did not provide sheets for the bed but blankets for the extra beds. Fortunately this was proven to be a mistake, later clarified by other staff.", "helpfulness": 2, "user": "JLeoG21", "date": "July 31, 2009", "id": 36348201}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The cleaning people were very nice and helpful.", "title": "A Wonderful Visit To Acapulco Thanks To Trip Advisor And Sebastian Hernandez!!!", "helpfulness": 5, "user": "travel whiz", "date": "July 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 2.0, "service": 4.0, "rooms": 5.0}, "id": 36265158}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We will not return to this place!", "title": "Beautiful Resort in a Wonderful City - Allow Benjamin Alarcon to show off his home!", "helpfulness": 1, "user": "ltdayun", "date": "July 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 35993969}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Great beach, never ending pools, fun staff, amazing scenery.", "title": "Grand Mayan was so-so, but Roberto is a must in Acapulco!", "user": "SanDiegoCA09", "date": "July 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 35715589}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "The Grand Mayan was very nice as you would expect. Beach was great. Beach Cabana was always available. Service was good. There will always be pressure to buy or upgrade a timeshare..... Great resort and experience overall. Beach there was perfect for our 12 year old to boogie board. Waves are strong at times but not too strong. Food at the resort is very expensive. For $5 dollars each way, you can get a ride to the Wal-Mart near by. The bell men will carry your groceries to your room for you when you return. That way you can cook breakfast, snack, etc. In the parking lot with Wal-Mart is a Suburbia (clothes), a Sam's club, and a couple of very casual restaurants. If you are looking for a cheap restaurant for the family and you are tired of the tourist stuff, eat at the VIPs then go shop at Wal-Mart. The tortilla soup and key lime pie at VIPS are pretty good. Your cab driver will wait. We found a couple of really good drivers that made the trip worth while. Jaun Carlos Camacho (mentioned in an earlier review) proved to be as good as advertised. We did a city tour with him and he did a great job. He was very busy and asked his cousin to help us out some as well. Felix Radilla Mendoza ([--], [--]) did an awesome job for us. He provided great recommendations and was always there when we needed him. Our kids loved him. We would tell him what kind of food we wanted and would pick great restaurants. We particularly liked the little Italian place he took us too. It was not too far from the hotel. Our favorite restaurant of the trip was probably Linda Vista. It is a beautiful setting that overlooks the bay. We watched from Sunset until the lights came alive around Acapulco. Food is very good. It is a little more expensive than most restaurants where we ate. We enjoyed the city tour, the cross and chapel overlooking Acapulco, and haggling in the markets. If you want an off the wall tour, head north to the Island and visit Sunset beach. This is actually part of an estuary where the river meets the ocean. The water is fresh water and brown mostly (like a lake) but it made for an intersting day. Tres Maria's is a very good restaurant there. They have a small marina there and you can take a private ski boat into the lagoon to see islands covered in a variety of sea birds and visit several little places there. This is a basic lake boat ride but you see a lot of birds and during the wet season you can get all the way to the ocean. One stop has an alligator in a pen. It is a big alligator and kind of sad to see him penned up. You can definately get a feel for the local fisherman and the poverty that exists in that region. The kids were able to rent wave runners from the marina and had a ball. You can also water ski or wake board there. They will teach you if you don't know how. It is probably a 40 to 50 minute drive from the Grand Mayan. We went to Acapulco at the last minute and did not expect much. We were extremely surprised and voted it our best place to visit in Mexico. We liked it better than Cancun, Cozumel, Cabo, etc. As for safety, I am not an expert so don't take my word. One taxi driver indicated that there is the occasional drug war stuff that goes on but overall crime had dropped because both the police and the outlaws protect the neighborhoods and the tourists.... He said that he 1/2 wanted to thank the dealers and 1/2 wanted them to go away. I was never in a place where I felt unwanted or unsafe at all. It was a great vacation. If you go, call Felix or Camacho. You will not be sorry. You can also ask for Felix or Camacho when you ask for a cab at the Grand Mayan.", "title": "Acapulco June 27th thru July 4th", "helpfulness": 1, "user": "ystayhome", "date": "July 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 33942112}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Austin, Tx", "title": "Acapulco", "user": "theeaglemaker", "date": "June 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 33421711}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "Our Acapulco trip was absolutely awesome-- great weather all week and our driver Angel Flores, who we were able to contact easily from earlier reviews, was the best. He took us to the best restaurants in the Acapulco area-- La Tortuga and Esmirna del Mar, where the shrimp and snapper are outstanding as you can see from the enclosed picture. The hotel concierge could have been better but the overall experience was great and the daily activities at the pool were outstanding because of Paul and Angel. I know that the swine flu and the inner city drug activities have caused people to cancel their trips but that is the overblown media talking and there is nothing to fear but having a great time in sunny Acapulco!!!!!", "title": "we loved ACAPULCO!!!!!!!!", "user": "juuaan72us", "date": "June 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32182299}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "i just came back from Acapulco where i had the time of my life thanks to Juan Carlos Camacho who was kind enough to take us everywhere i didnot know Acapulco had so much to offer (ecological,adventure,& historical tours) were made very interested by Juan Carlos, who by the way speaks very fluent english, and the most important he is not just a cabbie from the mayan palace , but a well studied tour guide. his cell phone is", "title": "Grand Mayan was Grand", "user": "PetraAlaska", "date": "June 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32122651}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "(044)7445877907 just in case you want to have a real & fun vacations. DEBBY FRITTS ATL.GA.", "title": "A Great Vacation", "user": "BevComputer", "date": "June 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 31970413}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "We went to Acapulco June 12-19 and had a very good time. There were not very many tourists at the time and half of the places to eat at the resort were closed. The staff at the front desk is nothing special but everyone else there is excellent... the servers along the pool were by the far the best! The rooms were very clean, we stayed in a two bedroom suite which was at first was a little musty(probably from the extreme humidity). We had to keep the AC going to get the smell out. Everything at the resort is well maintained and it is very impressive. You will be able to take some very nice photos upon entering the resort. I highly advise a trip to Wal-Mart for water, beer, snacks, liquor and food. It is not cheap to eat and drink at the resort... drinks we very overpriced. The Wal-Mart is just a short drive from the resort (Roberto Alarcon can take you there).", "title": "The Gran Mayan is very nice... but Roberto Alarcon is even better!", "helpfulness": 1, "user": "bryden06", "date": "July 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 35262451}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The hotel is located about 20 minutes away from the city which will cost about $30 round trip if you take a cab, perpare to bargain with the cab drivers. While we were there we used Roberto Alarcon to take us around town (Roberto Alarcon Tel from USA: [--]. Tel in Acapulco: [--]). He was a lot of fun and had a lot of good suggestions whatever it was we wanted to do... most of all, he made to sure we were well taken care of. I would advise that you call him to pick you up from the airport, it's cheaper than using the hotel services (they do have nice vans with good AC). He took us to dinner three times... once to Linda Vista and twice to Su Casa. Linda Vista has good food with a good view but Su Casa by far has some of the best food in Acapulco and sits up in the hills overlooking Acapulco. The service at Su Casa was exceptional, so good that we went there twice during our stay... they even made us our own personal Mango Magaritas picked right off the tree! We also did the city tour and the day trip to Taxco. The trip to Taxco is a must... it's an old colonial city that has great deals on silver!", "title": "Beautiful grounds and relaxing atmosphere", "helpfulness": 1, "user": "caoinaz", "date": "July 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 34543238}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Su Casa and Taxco were our favorites! We will definitely be back in the future, there's still a lot left to be done in Acapulco.", "title": "Nice Hotel Bad Location", "user": "susy_elena", "date": "July 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 2.0, "service": 4.0, "rooms": 4.0}, "id": 34358050}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Arrived at the Grand Mayan on a Saturday afternoon. We were picked up at the airport by Sebastion Hernandez.[--]. We found Sebastion through trip advisor and he made our trip even better. He is a certified tour guide, he greeted us at the airport, you feel like someone special when he is standing there holding a sign with your name on it. and was available for taking us anywhere we wanted to go that week. We had arranged for him to take us to the local Wal Mart to stock up on food and water for our room. We had an unfortunate incident at the Wal Mart, I accidently set my phone down at the check out counter, got distracted and left it there. When I went back to inquire if someone had turned it in, of course no spoke English. This is where having an English speaking driver came in handy. He went back with me into the store and spoke to the customer service person. Apparently the woman behind me found my phone but didn't leave it at the counter, but informed them that if I inquired that I could call her on my phone to have the phone returned. SCAM HERE.......we tried calling my phone, but she didn't answer. This is what they hope you will do, keep trying to call the phone. Since the only way to get in touch with them is to call your phone, they figure you won't shut it off so that way they can continue to use it to call and end up costing you a fortune in roaming charges. We immediately cancelled the phone after several attempts in a ten minute period. They now have a worthless phone. Anyway, once we arrived at the Grand Mayan I have to say they have a beautifil entrance as they all do.", "title": "Acapulco is Guaranteed Fun", "user": "Luv2Shop_9", "date": "July 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 34185960}, {"rating": 4.0, "stay_parameters": "Stayed June 2009", "text": "The entrance is beautiful and the grounds are beautifully kept. The grounds and the rooms are very clean. The staff is helpful and friendly. One of my only complaints are the beds. They are very very firm, not to my personal liking but others may like. Restaurants in the Grand Mayan are a little pricey, like the Prime Rib Dinner night was 340 pesos which equaled about $30 per person. We did order room service one night and got the filet mignon and a chef salad for about the price of one prime rib dinner and it was very good.", "title": "Taking a Honeymoon without your spouse would be like going to Acapulco without Roberto as your personal Driver.", "helpfulness": 1, "user": "TexasChief", "date": "July 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34178840}], "location": {"country": "Mexico", "region": "Pacific Coast"}, "stars": 3.5, "variance": {"poor": 35, "average": 67, "very good": 387, "terrible": 26, "excellent": 691}, "aka": "Grand Mayan Acapulco Hotel Acapulco", "slim_ranking": 0.0170454545455, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}