{"user_rating": 4.5, "review_count": 424, "name": "The Whiteface Lodge", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "I visited the lodge with my parents to celebrate their 40th anniversary and it was a splendid choice. While the location doesn't offer a lake view it is secluded enough to give the impression of solitude. We stayed in Room 305 which is two floors and offers plenty of space. The rooms have kitchens, gas fireplaces, washer/dryer and walk in closets. Very comfortable beds.", "title": "Not Your Ordinary Cabin in the Woods", "user": "C_and_MH", "date": "October 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 179845802}, {"rating": 5.0, "title": "Luxury in the Adorondaks", "text": "The property is beautiful and has a rustic, luxury feel. The campus includes a swimming pool, both outdoor and indoor and hot tubs. For the fisherman, their is even a catch and release pond. In the evening, in the fall, s'mores are available to make by the fire.", "helpfulness": 1, "user": "Chris S", "date": "October 4, 2013", "id": 179756183}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "The restaurant offers man options as does the bar with local beers. In the basement you will find a fun area with a movie theatre, bowling lanes, broken air hockey table and billiards.", "title": "Perfection in All Respects", "user": "jes4317", "date": "October 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179704098}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The staff are very friendly, but the concierge wasn't too informed about boating as she suggested that we would need a boating license, which is not the case.", "title": "Not directly on the lake, but perfect otherwise", "user": "pickytravellers2", "date": "October 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 179640833}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "First, make sure you become a member of the leading hotels of the world. This includes free breakfast and a free room upgrade. We stayed in room 305, which is two floors with a deck. The rooms are huge with walk in closets and a kitchen. The property includes spa, pool, movie theatre, hot tub and a game room with bowling. The staff is very friendly and breakfast and dinner are well prepared.", "title": "Wounderful Mountian resort", "user": "Wego1234", "date": "October 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179601679}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "First off, let me say that anyone complaining about traffic noise and giving this place a 3 rating based on that is way out of line. This was the most serene, peaceful, and quiet hotel I've stayed at in a long long time. You could hear a pin drop in our room. OK, rant over.", "title": "Simply the best in every possible way", "user": "NitPickyTraveler", "date": "October 1, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 179399812}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "As for the rest, flawless from check in to check out. Spectacular facility, friendly staff, gorgeous grounds, impeccable attention to detail, rooms you could live in forever, and the list goes on. We only spent one night here and we wanted to move in. This was pure heaven.", "title": "Fantastic Fall Getawy", "user": "Jennifer35", "date": "September 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178653754}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "As we were roasting s'mores over an open campfire at The Whiteface Lodge, I chatted with a young couple who confessed that this was their sixth stay at the resort. Wow! That right there tells you something about this wonderful resort.", "title": "Excellent 3 day mini get-away", "helpfulness": 1, "user": "Alan B", "date": "September 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 178610857}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "My husband and I had never vacationed in the Adirondacks but jumped at the chance when my parents offered to watch the kids for a long weekend. While we aren't spa people, but we used as many excellent resort amenities as we could including: the pool/hot tub, bowling alley, game room, kayaks, roasting s'mores and full breakfast. Our room was luxurious with a wonderful bed. I loved that we could open the windows and patio doors to let fresh air in the room. The staff was very helpful in planning bike rides, hikes and kayak trips. Overall, the Whiteface Lodge far exceeded our expectations. We are contemplating bringing the kids for a few days during winter vacation.", "title": "4 day fall weekend birthday", "user": "Tim W", "date": "September 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 178472615}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We booked a 2 night stay recently at the Whiteface Lodge and it was an exceptional experience. The resort itself offers everything you would want from a movie theater, to a gym and game room to a deluxe spa. We took advantage of all the resort had to offer and were absolutely pleased with how wonderful the staff was and how great this resort is. The Lodge itself is made almost entirely from real logs to get that true Adirondacks feel. The rooms (actually suites) offer a full kitchen (appartment sized appliances) with everything you would need, a dining area, nice vews of the mountains and the beds are extremely comfortable (one little complaint - if you like a firm pillow bring your own as the ones provided are extremely soft). The deal we had included breakfast each morning which was served in the main dining room, which offers lovely views of Whiteface. The Indoor-Outdoor pool with three whirlpools are a nice way to relax after a day of hiking. In the evening there are two fireplaces to enjoy a fall evening in the mountains. The one on the main lawn offers do-it-yourself smoores and then there is the one at the lean-tos (which is the only area where smoking is allowed). We did book massages in the Spa and it was well worth it. I know some people complain of traffic noise. I live in the country and it is extremely quiet where I live, this resort is right off the main road that leads to Lake Placid from Saranc Lake however we barely heard any traffic and once in your room at night we were never distrubed by any traffic noise - could be because we travelled mid-week so less traffic on the road however we never bothered by the noise.", "title": "I am not a fan of big resorts but Whiteface...perfect!!", "helpfulness": 1, "user": "Chocolate74", "date": "September 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 178359209}, {"rating": 5.0, "title": "Summer trip to LP", "text": "Excellent place to stay in the Summer. Great rooms, great facilities, including Cinema, pool and games room. Lovely people to look after you. We really enjoyed the Canoe Club, where you are shuttled down to the Lake and you are able to relax with a stunning view of lakes and mountains. If you have more energy, then canoes, paddle boards, kayaks are available on a first come first serve basis in the boat house. I now believe that Lake holidays are better than beach holidays, and you couldn't get much better then the Whiteface Lodge in LP.", "user": "Ian H", "date": "September 11, 2013", "id": 176771200}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "What a treat! This place is fabulous! Spa...amazing. Salon...great service. Accommodations...could not want for anything (maybe a private chef!)...this property is TOP TIER. I have done a lot of traveling and would come here any time and will recommend it. The staff are very helpful, friendly, happy, and willing to go out of their way to see to all your needs. Kudos to management for running such an incredible facility. It takes a lot to keep a place this well-run and a lot of forsight to maintain this caliber of facility. NOT SURE IF I MADE MYSELF CLEAR...WE LOVED IT!", "title": "Excellent in EVERY way!", "user": "KellBellHocking", "date": "September 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176648952}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "our first Adirondack experience and they serve it up like it should be. only thing one could ask for is more privacy (rent your own camp?). s'mores every night by the fire. great indoor/outdoor pool. tennis. small beach (accessible only by short shuttle). excellent linens and bathroom setup. complimentary choc. chip cookies every night (a little overboard). free day camp for the little ones. 3 movies a day in their cinema. given the deal we had ($100 spending money at the hotel per day) it seemed like everything was complimentary. the food... eh... it could be better. but whatever.", "title": "like having a huge family camp for 90 families", "user": "modulus1", "date": "September 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176243395}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Firstly - if you want stay here book in advance, it wasn't available for most long weekends I tried to book it for.", "title": "No doubt its the best rated hotel in the area", "user": "Earn2Travel", "date": "September 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 175806496}, {"rating": 5.0, "title": "Bring Money and the Kids", "text": "The hotel location is just on the banks of the huge lake placid. Has a great restaurant, and Jetty, from where you can hire speed boats, paddle boats, etc and spend your day in the lap of the majestic Adirondacks.", "helpfulness": 2, "user": "Christopher J", "date": "September 4, 2013", "id": 175637674}, {"rating": 3.0, "stay_parameters": "Stayed September 2013", "text": "If you are looking to get away and hear the sounds of nature in the Adirondacks do not visit Whiteface Lodge. It is located parallel to the main road - resulting in intolerable traffic noise all day and all night long. The property is amazing in everyway other than location. They did move our room in hopes of reducing traffic noise but the entire property is right off the main strip - no room would have reduced the noise unfortunately. If noise is of no concern to you then please consider this property - service, rooms, spa, pool, movie theater, bowling, kids club etc.. all 5*.", "title": "Traffic noise!", "user": "Retiredvacationers16", "date": "September 20, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 2.0, "service": 5.0, "rooms": 5.0}, "id": 177944999}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We stayed here in August, with our kids 8 and 10, and were all wowed by the service, cleanliness, food quality, and grounds. Can't really think of one thing to complain about. Rooms were clean and nicely decorated, and kitchen was fully equipped, if you want to do a little cooking. Loved that the \"game room\" wasn't about video games, but rather pool, ping pong, fooseball etc.. And the kids enjoyed popcorn and ice cream in the nearby snack bar. Breakfast was delicious.and included in the room rate. Also loved the Smores at night by the fire, and small fishing hole with complementary worms and poles. Weather kept us from enjoying the Canoe Club; maybe next summer!", "title": "Love, love this place!", "user": "chaplo", "date": "September 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 177463388}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "If you can fit it in your budget, it is definitely worth a visit for a few days.", "title": "Fantastic hotel simply wonderful", "user": "dotty500", "date": "September 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177311882}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "Stayed for 4 nights on hiking trip. Upscale resort with very friendly staff excellent service without being stuffy and formal. We made full use of the facilities this would be a wonderful place for a family holiday. We will be back.", "title": "It's definitely worth the price", "user": "mocha1217", "date": "September 15, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 177219302}, {"rating": 5.0, "title": "Rustic flavour, modern service, awesome experience", "text": "I absolutely loved my Superior room at this resort/spa/inn!! It's pricey but the location is awesome. If you want to cook in your room there is a grocery store near by! Very relaxing place. Next time I'm staying longer than just one night. I'm thinking making this our yearly vacation! Definitely check it out if you are visiting lake placid area! Perfect year round getaway spot!", "helpfulness": 1, "user": "WJR-041", "date": "September 12, 2013", "id": 176920389}], "location": {"country": "United States", "city": "Lake Placid"}, "stars": 4.5, "variance": {"poor": 13, "average": 21, "very good": 57, "terrible": 8, "excellent": 325}, "aka": "The Whiteface Hotel Lake Placid", "slim_ranking": 0.0322580645161, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 5.0, "location": 4.5}, "description": "Nestled in the Adirondack Mountains, this exclusive resort is a haven of comfort and elegance. A retreat where guests can relax in sumptuous suites and enjoy superb cuisine. A refined atmosphere, log architecture, fire places, year round activities and the Canoe Beach club on Lake Placid. A Member of Leading Hotels of The World."}