{"user_rating": 5.0, "review_count": 138, "name": "The Parsonage Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Convenient for the beaches and the center of the cape. The town center is a short drive away with a variety of shops and restaurants. Rooms are homely and comfortable. The owners that run the hotel are welcoming and do their best to meet your every need. The inn itself is a historic style building with many charming features. A perfect place for couples looking for a peaceful, well run B&B in a convenient location. One tip...take a flashlight with you, if you plan to walk to the local bars and restaurants as the roads can be a little dark at night. And there are some very good bars and restaurants in walking distance from the inn.", "title": "Excellent B&B, now on our list of places to stay", "user": "Julie H", "date": "September 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117959381}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We return to Cape Cod as many summers as we can, knowing that the weather can be glorious or it can present a challenge. Liz and Ian always greet us with broad smiles, eager to hear about our children who have now grown up and married. This year the greetings were no different, but Hurricane Irene was making her way up the East Coast and provided a bit of anxiety for many. Just at the tail end of the storm the power went out -- and stayed out for two days. Liz and Ian made their guests comfortable by providing extra portable lights and -- amazingly -- gourmet breakfasts each morning. After 20 years, they have Cape Cod storm cooking down pat and use an outdoor grill and who knows what else to still turn out yummy food.", "title": "Very accommodating under difficult circumstances", "user": "DFWTraveler17", "date": "September 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117955096}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The location of The Parsonage is ideal for folks who like to walk to local restaurants. There are several in the immediate area and sidewalks where they are clustered. Plenty of menus of other restaurants farther afield or just a short drive away are available in the inn living room. Liz and Ian will be happy to make suggestions.", "title": "Our Ninth Visit and Looking forward to the Tenth", "user": "Myrna R", "date": "September 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117847043}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "If you're like us, whether you go into the water or not, the main attraction is Nauset Beach. That's less than 2 miles away. It's walkable if you don't carry much, but that's not our style (umbrella, cooler, beach chairs, ... ). We do run while we stay in East Orleans but are careful to do so single file where there is no sidewalk since most roads are narrow.", "title": "A lovely Inn; we will be back", "user": "hah19r", "date": "September 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117825327}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We always look forward to our return.", "title": "Even better than we remembered", "user": "Donna S", "date": "September 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117772506}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "On our silver wedding, my wife and I had he chance of spending very few days at The Parsonage Inn. An ideal and central place to be in at Cape Cod. We felt so well taken care of, in such a relaxing and cozy ambience, that it made hurricane Irene feel a breeze!", "title": "Most relaxing and cozy experience", "user": "carlos_oxenford", "date": "September 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117719393}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Very much recommend this beautiful B&B so well taken cared of by Ian & Liz.", "title": "I loved it and will be back", "user": "Stephanie M", "date": "September 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117711825}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "I found the Parsonage excellent. The decor was amazing. The hosts the Browns were providing wonderful service. I would highly recommend it to may friends", "title": "\"There is no better place to stay on the Cape\"", "user": "2JosephP", "date": "August 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117325610}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "My wife and I just spent our 20th year at the Parsonage. It is like returning to see good family & friends. Hosts, Ian & Elizabeth, are very friendly, personable and gracious. The historic home is immaculate and the rooms are cozy & air conditioned.", "title": "Our Home Away From Home", "user": "MarilynandNorm", "date": "August 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116798965}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Awake each morning to a fine breakfast and good coffee/tea. Your choice to dine in or outside.", "title": "We keep coming back", "user": "GailAbramson", "date": "August 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 116780114}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "I can hardly imagine more gracious hosts, more comfortable rooms, a more perfect location or a more lovely vacation experience. We always have a wonderful stay at the Parsonage Inn. We not only recommend it, we have begun taking our friends there. It is Cape Cod for us.", "title": "Just Lovely", "user": "David P", "date": "September 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 118736464}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We had a delightful stay at The Parsonage Inn. Our hosts, Ian and Liz, could not have been more gracious. We had so much fun chatting with them about the area, common interests, etc. Our room was beautifully decorated \"a la shabby chic\". The bathroom was large and had all the customary accessories! The public areas were historic, warm, and cozy. But I have saved the best for last, breakfast. Cooked by Liz and absolutely delicious. We dined on the patio overlooking beautiful gardens. Only a mile and a half from the best beach on the Cape, Nauset Beach!! Also walking distance to town. A terrific location.", "title": "Post-labor Day getaway", "user": "Nancy M", "date": "September 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118666095}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Charming and historic, The Parsonage Inn and Elizabeth and Ian, Innkeepers,", "title": "Fabulous Cape Inn ~", "user": "Janis N", "date": "September 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118531287}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "are just what one needs to escape the hubbub and relax!", "title": "Wonderful hosts and accommodations", "user": "Kait N", "date": "September 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118335151}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We loved our stay and so enjoyed the old Cape feel with the beautiful antique furniture and decor, wide floor boards, beams, nooks and crannies, quilts and much more, coupled with anything and everything a guest might need or want while away from home! Softest sheets ! Comfy bed with great lights for reading! Plenty of closet and drawer space! you name it!", "title": "An unforgettable B& B or more", "user": "ann h", "date": "September 17, 2011", "detail_rating": {"value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 118226304}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "My wife and I have stayed here over the last two Columbus Day weekends. The Inn's location is extremely good: halfway out the Cape, and just a 5 minute drive to Nauset Beach (at this time of year, parking is free at all the Cape beaches that are part of the National Seashore). The innkeepers, Ian and LIz, are congenial, informative, and always helpful with recommendations. When I made the reservation on the phone, Ian remembered not only our names but where we lived. Breakfasts are very good. The entire Inn (we've only stayed in the original building) is kept immaculately clean and attractive. The only possible complaint I could imagine is that, with windows open (though each room has a window airconditioner), some traffic noise could be heard, but it never bothers us. The Parsonage Inn is just a wonderful, relaxing place.", "title": "Charming B&B", "helpfulness": 3, "user": "Genings", "date": "October 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119288740}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We love the Parsonage Inn! We have been visiting Cape Cod for over 10 years and always return to the Parsonage. We have stayed in every room at the inn and all are very clean and beautifully decorated. The breakfasts that Liz prepare are simply", "title": "Our home away from home!", "helpfulness": 2, "user": "Beth K", "date": "October 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119199268}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "d-e-l-i-c-i-o-u-s!", "title": "Seeing the more traditional side of the Cape", "helpfulness": 1, "user": "UV1982", "date": "October 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 118984954}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Thanks to Liz and Ian we always feel at home on the cape.", "title": "The real Cape Cod", "helpfulness": 1, "user": "Jerry S", "date": "October 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118854662}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "We stayed at The Parsonage Inn whilst visiting Cape Cod over a few days. Liz & Ian offered us a very warm welcome and were very friendly, informative and helpful during our short stay.", "title": "Our Wedding Weekend", "user": "Rosemary K", "date": "September 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118790042}], "location": {"country": "United States"}, "variance": {"poor": 1, "average": 1, "very good": 3, "terrible": 0, "excellent": 133}, "aka": "The Parsonage Inn East Orleans, MA, United States", "slim_ranking": 0.4, "description": "New Innkeepers Jo-Anne and Richard Hoad are looking forward to welcoming returning and new guests to The Parsonage Inn, an 18th century parsonage, now a romantic village Inn, located in the heart of East Orleans and just one and a half miles from Nauset Beach. The eight guest rooms have been redecorated with refitted bathrooms to offer a relaxing, cozy and contemporary feel. Breakfasts are freshly prepared each morning, using wherever possible organic seasonal produce locally sourced."}