{"user_rating": 4.0, "review_count": 996, "name": "The Marine Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2011", "text": "We had a one night stay in Troon and stayed in the marine , and I must say the staff in the entire hotel from the reception to the spa were excellent , we paid for an upgraded room and were not disapointed , the food in the main restaurant was first class as was the service . We will return !!", "title": "Hotel was great !!!", "user": "Jimmygf1", "date": "November 25, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 121019640}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We stayed at the Barcelo Marine Hotel for a 3 night break and had a lovely time, the room was immaculate although would have loved a view over the beach and golf course but this didn't spoil it. The staff were lovely and the food was excellent. We took advantage of the spa and booked a back massage and hot stones which was very relaxing. Would definately go back but would love a room with a sea view next time. Great location for relaxing walks along the beach no matter what the weather with the local town within easy access. Will go back in the summer hopefully to make the most of the beach. Full cooked breakfast is a must with fresh hot food with plenty choice, the porridge is lovely. All staff very friendly and helpful who attended to all our needs. Thanks for a great stay, definately be back.", "title": "Weekend Break", "user": "Elaine M", "date": "November 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120965374}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Perfect views, relaxing spa, superb food, excellent service, very courteous and helpful staff in September. Therefore returned to the same standard with an a superb upgrade and champagne on arrival in November. Couldn't ask for more, will be booking again in the New Year. Don't miss this jewel in Ayrshire. Thank You.", "title": "Another relaxing stay with my teenage daughter", "user": "mary d", "date": "November 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120883426}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Booked a three night break 6th to 9th September, through Superbreak and got avery good rate however on arrival at the hotel we where told that they had no record of our booking even though I had confirmation from Superbreak both by post and email and to cap it all they where fully booked, as you can imagine we were rather shell shocked, however the hotel receptionist very quickly redeemed the situation by organising us a room at the nearby 5 star Lochgreen House and promising us a seaview room when we returned next day. On our return to the Marine Hotel we where met with another apology as we checked in and where told that dinner that evening would be compliments of the hotel, we where given our key and off we went to the room, when we got there we discovered we had been given the Mark Calcevecciah suite which overlooks the 18th green of the troon golf course and within minutes of getting to the room a bottle wine was delivered with a note from the hotel manager , all very impressive considering what we had paid for our break. The room had everything you would expect being a suite including plasma tv's in both the bedroom and sitting room, a large comfortable bed and fantastic views out across the golf course and across the sea towards the isle of Arran.", "title": "Enjoyable break", "user": "UkTel", "date": "November 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120880197}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Their are excellent leisure facilities within the hotel including heated pool, jacuzzi, steam room and sauna all of which we made good use of. The hotel bar serves a good range of bar snacks in comfortable and relaxing surroundings and although not the cheapest, given the location good value for money. Dinner was very nice although not necessarily what we would choose if paying for it ourselves, breakfas howevert was excellent with the full scottish breakfast and selection of cereals etc. to choose from.", "title": "First Class", "user": "GeorgeHubbard", "date": "November 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120849996}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Returned to this hotel in September having booked the deal for dinner B&B, once again couldn't fault the reception and restaurant staff, food or the room and we enjoyed another relaxing stay.", "title": "Another relaxing stay", "user": "LoobyLou050", "date": "November 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120835036}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Only criticism was that during our stay we had lunch in the lounge which was as usual very busy and as a result service was slow, this has been the case every time we have stayed at this hotel there never seem to be sufficient staff to cope at peak times.", "title": "Well Done Barcelo Troon", "user": "FatBoab1", "date": "November 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120733397}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Booked a cut price deal for dinner bed and breakfast and got an upgrade to a suite. Lovely room with a bay window overlooking the golf course and a separate bedroom with four poster and large screen TV. Bathroom is a bit small in comparison but not worthy of complaint.Restaurant is nice and a seat in the conservatory at the far end is worth asking for. Residents lounge is a bit stuffy - more like an old golf club but not off putting. Used the spa facilities which are good - pool a bit shallow for swimming but good for kids. Nice spread for breakfast with plenty of choice - prefer Stornaway black pudding. Very friendly and helpful staff. Well done.", "title": "Top Class", "user": "leshaswell", "date": "November 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120696741}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Booked a standard room and got a phone call offering me a reduced cost upgrade to a suite which I accepted. Good decision! The suite was spacious, well equipped, comfortable and offered great views across the Firth of Clyde. Breakfast was excellent, good choice, friendly staff and included in my room rate.", "title": "'Just Perfect'", "user": "james w", "date": "November 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120668242}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "I have stayed at the Marine regularly and have no qualms about recommending it to others.", "title": "Surprising and very enjoyable", "user": "annhedgehog", "date": "November 16, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 120657071}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Not used to staying at hotels, I find myself a little intimidated - like everyone knows the etiquette except me! Not here. The staff are really welcoming, happy to answer any questions and quick to offer assistance. My husband and I were ushered to the lift after check-in while the porter ran up the stairs with our bags and almost got there first. There was no hanging around for a tip, giving the impression that staff were just keen to please. The room was warm and cosy with appealing decor. Champagne and chocolates were a special touch. The bathroom was a little cold. The bath would not have suited anyone much taller than me. I didn't know baths so small were made! But there was an over-bath shower too. The dinner menu was creative and I'd have enjoyed everything on offer. Service was excellent - not too quick so that you get indigestion, but I didn't feel that we were neglected either. And breakfast was excellent. I've been to places where the sausages or black pudding just have a weird taste to them. Not here. Proper Ayrshire ingredients here.", "title": "Friendliest Staff", "user": "Clare W", "date": "November 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 121112132}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The pool overlooks the coastline so we saw the most stunning sunset as we swam in the warm water. The sauna was good but the steam room needed attention. It looked a bit the worse for wear but upgrades were going on in the hotel so maybe this is to be remedied.", "title": "Friendly Hotel", "user": "Audrey L", "date": "November 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121112027}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The area is stunning but we didn't explore much because of the storm that had been raging. I'd be keen to go back for an overnight or weekend getaway. It was a really welcome port in a storm.", "title": "wee lil and big t", "user": "weeyin077", "date": "November 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121095547}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "We stayed at this hotel for a couple of days to celebrate my birthday. The staff were very friendly in all areas and very helpful when needed. The 3 course dinner was superb and the wine was very reasonably priced. The swimming area and spa was very good and the gym was excellent with all the equipment being up-to-date. We had a deluxe room which was lovely but only fault was the windows were a bit draughty!", "title": "Great hotel for short stay", "user": "lynnlog", "date": "November 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121028606}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Would definately recommend as location was ideal for doing the West of Scotland.", "title": "Long drive but worth it", "user": "shaunP", "date": "November 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 121019733}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We stayed here for two nights at the beginning of November and had booked an executive room which turned out to be on the first floor at the side of the hotel with a sea view overlooking the golf course and towards Ayr.", "title": "Fantastic old hotel full of character with great staff", "user": "Maeboyce", "date": "December 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121361784}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The room was very large, plenty of space, big bay window with good views of the sea, BUT, our room was absolutely freezing. We turned on the heaters and made a cup of coffee, but had to sit with our jackets on to drink this. After half an hour there was still no heat to the radiators (late afternoon) so popped down to reception for advice. Receptionist fantastic - on it to the best of her ability immediately and within about ten minutes housekeeping arrived with a small oil heater. Although not huge, this was a very welcome addition. Sadly by the time we went out for dinner, the heating had still not come on. On speaking to Reception, we were advised if it had not come on by the time we returned, we would be moved to another room. Fortunately when we returned, the room was warm and cosy.", "title": "Excellent Hotel, great location", "user": "Pam C", "date": "December 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121283136}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Although things can go wrong during a hotel stay, the staff here took responsibility for trying to resolve the problem with the minimum of fuss and delay. I have also read quite a lot of the reviews of the hotel and no-one has mentioned a problem with the cold, so I think we probably had an isolated incident and would not let this deter me from returning (which we plan to do with friends in the New Year.", "title": "First class hotel", "user": "Alexandra S", "date": "November 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121237091}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Breakfast during our stay was excellent and the chap on duty on both days was extremely helpful and friendly. Same for bar staff where we enjoyed a glass of wine in a very nice atmosphere on a particularly wild night.", "title": "Fantastic experience", "user": "Janice B", "date": "November 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 121204700}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "In conclusion, the pros far outweigh the cons for the hotel and the problems we encountered were resolved by staff who genuinely seemed to want to get things right for their guests.", "title": "not as i expected", "user": "cjdLanarkshire", "date": "November 28, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 121122214}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 58, "average": 107, "very good": 290, "terrible": 37, "excellent": 504}, "aka": "Barcelo Troon", "slim_ranking": 0.8, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "The Marine Hotel Troon is a four-star luxury hotel overlooking the 18th hole of the Royal Troon golf course on the stunning Ayrshire coast, just 30 miles from Glasgow. With 89 bedrooms, including four suites and 12 deluxe rooms, it has magnificent views over the Firth of Clyde to the Isle of Arran and is the ideal location to explore Dundonald Castle, Dean Castle Country Park and Burns Cottage.With the new Two Fat Ladies restaurant, beautiful seaside location, and a swimming pool, jacuzzi, sauna and steam room, it’s the perfect place to unwind and get away from it all."}