{"user_rating": 4.0, "review_count": 302, "name": "The Waterside House Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We stayed there on a Living Social break on 20/6/2013. The hotel is right on the beach overlooking the Skerries and Dublin Bay and is a marvellous setting with great walks in both directions. We were upgraded to a sea view room on the ground floor on arrival. The room was very comfortable with a garden outside and a 2-seater swing chair outside the French windows. The rooms in that part of the hotel are in an extension and are reached through the Tower Bar/Grill, which is a bit quirky. There is also a separate entrance to the extension from the car park. We had dinner in the hotel - in the Samphire Restaurant - and both the food and the service were first class. We would recommend eating in the restaurant.", "title": "Great views, marvellous setting", "helpfulness": 1, "user": "Alanadale_13", "date": "June 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 165474454}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "There is a large terrace/patio outside the Tower Bar which also serves snacks and hot meals. There was a large wedding party on the terrace when we arrived but there was plenty of room for us. However the drinks service was a little slow on the terrace.", "title": "Go for drinks", "helpfulness": 2, "user": "zman1528", "date": "June 25, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 165214334}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "We had breakfast in the Tower Bar/Bistro and enjoyed a freshly cooked Irish Fry. The service could not be faulted. Our only criticism might be that there was a limited choice of jams for toast/croissants. Not a big deal.", "title": "Beautiful Beachy Day :)", "helpfulness": 1, "user": "tara c", "date": "June 19, 2013", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0}, "id": 164521388}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "This little gem of a hotel is well worth a visit. We would plan to go again and stay a little longer, A bedroom with a seaview or on ground floor adjacent to the gardens/terrace is a must. Our room was 131.", "title": "Great stay!", "helpfulness": 2, "user": "Smul64", "date": "June 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 164233512}, {"rating": 1.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "Stayed here on 6/18/2013. My daughter had lovely room overlooking the sea and close enough to hear the waves. On the other hand, my room across the room was stifling hot (sunny warm day) and there was some damn machine running all night off and on.", "title": "Poor service", "user": "CheekyDublin", "date": "June 16, 2013", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 4.0, "service": 1.0}, "id": 164176795}, {"rating": 2.0, "stay_parameters": "Stayed June 2013", "text": "Stayed here in June 2013, as they advertised a great Stay and Park deal if you were flying from Dublin Airport and leaving your car in the hotel, and offered a free shuttle bus to the hotel.", "title": "2 hours sleep before a long flight :(", "user": "RoryMc", "date": "July 20, 2013", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 168255827}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The hotel is in real need of renovation and is quite grubby in general. The rooms are very average, really has a 1970's feel to it.", "title": "Beatiful view", "helpfulness": 1, "user": "FreddyFresh", "date": "July 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 167817804}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Our biggest gripe was the noise levels. On the night we stayed there was some event on for kids and a disco. The noise levels were horrendous, with kids/teenagers running around freely and even knocking on room doors. There was no control whatsoever from staff.", "title": "disappointed", "user": "caroline m", "date": "July 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 167641184}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "We got about 2 hours sleep before a long flight to America with an infant.", "title": "Frequent visitor, never disappointed!", "helpfulness": 1, "user": "aisling1986", "date": "July 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 167345308}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Another member of our group complained and we got a full refund.", "title": "A hotel with a five star heart", "helpfulness": 1, "user": "BrianCork", "date": "July 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 167214505}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "My good lady and I stayed here 13-14 June 2013 for our wedding anniversary and it was simply excellent from start to finish. All the staff were extremely helpful and always had a smile on their faces. The room was clean and tidy with the sea view a delight by day and night. The bar was welcoming and our first evening meal there was delicious, as was breakfast on both mornings. The jewel in the crown is without doubt the Samphire Restaurant. The meal was outstanding and the service from Tibor deserves special mention. We had a great time and hope to repeat the experience and we have no hesitation in recommending this hotel to all our friends.", "title": "Friedley, relaxing, enjoyable break !", "helpfulness": 1, "user": "Vester215", "date": "June 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164149279}, {"rating": 1.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "myself and my partner came here for a bite to eat, was charged 10 euro when we attempted to park, the 10 euro was a voucher towards our food bill, ok I can live with that, sat down at a table, which was not clean, no sign of any waiters, went and got menus myself, 10 mins later approached by waiter, ordered our food, asked could I see a wine menu , another 10 minutes later no menu, proceeded to the bar for our wine, waiter eventually returns with menu and hands to me obviously seeing that we had already got our drinks, he didn't even acknowledge this, had to ask him to clean the table, we ordered 2 main courses , chicken and steak ,waited an hour for our food which was not of good quality , even though we were starving after waiting so long we did not finish our meal, ,a group of 4 had come in the meantime, sat down, waited for a long time to be served and then got up and walked out, there was a table beside us that was having issues with their food also, lady ordered onion rings, and the waiter serves her calamari, after she had eaten it,(funnily enough) I had heard her ask the waiter what was that she was eating as she had ordered onion rings, and he tells her no, we don't serve onion rings ???? her face was priceless, all in all it was like a scene from fawlty towers, the restaurant was not busy at the time and with 4 waiting staff on duty , I would hate to see how they would cope under real pressure, , in my opinion, this place is riddled with a total lack of customer service and lack of morale in staff which in my opinion stems from bad management , simple as.......will not be returning.", "title": "Bad service", "user": "caroline m", "date": "June 15, 2013", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 4.0, "service": 1.0}, "id": 164050282}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "We arrived at 2PM, and sat down at a dirty table. We then went to the bar and got pints (averagely priced, that was alright). So, we then ask one waiter for menus. 35 minutes later they appear. We said to two waiters that we were ready to order, before getting an order in with the third, who claimed that they were \"really busy\", despite there being adequate staff about the place. This was at 10 to 3. By half three, we still hadn't seen our food, so we upped and left. I'll never set foot in this place again as long as I live, it was like Fawlty Towers!", "title": "90 minutes of waiting", "helpfulness": 3, "user": "cantwellsam", "date": "June 8, 2013", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 5.0, "service": 1.0}, "id": 163371716}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Waterside Hotel is one of the best places I and my family have ever stayed in, for staff, food and service.Rooms are well looked after and plenty of entertainment for adults and children .It is right on the beach which has a BLUE FLAG", "title": "AT THE WATERSIDE.", "helpfulness": 1, "user": "Christopher S", "date": "June 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163149487}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "My sisters and I took my Mother to The Waterside House hotel on 26th May 2013 and upon entering the car park we were advised that there was a fee of €10 to park as members of the public were parking there and going to the beach, we were told that if we purchased food in the hotel the €10 would be deducted from our bill. So we went in and ordered lunch and waited and waited, 50 minutes later our meals arrived but as we ordered hot meals we expected they would be hot however that was not the case. The only reason we waited so long was that we had paid the car park fee and having spoken to other diners who had been waiting 1 hour for their meals this was also the reason they stayed. While the hotel was very busy that day as the weather was good they should have been able to get the meals served much quicker and hot food should have been hot. The €10 fee is an outrage and I will not be returning anytime soon.", "title": "€10 to park car", "helpfulness": 1, "user": "Millie1900", "date": "June 4, 2013", "detail_rating": {"value": 2.0, "service": 1.0}, "id": 163013556}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The Waterside Hotel in Donabate is situated in a fablous area, they have a beautiful beer garden overlooking the beech which is fabulous is you get good weather, they also have rooms which overlook the sea, always booked out when we look for them. Entertainment at weekends and food is lovely served in the bar and also lovelt restaurant.", "title": "One Night Stay", "helpfulness": 1, "user": "pettigrew44", "date": "May 29, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 162276706}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "discovered this hotel with a grab one deal and was pleasantly surprised firstly by location right on the beach at donabate we were given a twin room with shower which was both spotless and spacious the only fault as a light sleeper was a noise early in the morning about 5ish coming I take it from the boiler or central heating starting up. we went for a meal in the samphire restaurant in the hotel and what a treat views of the sea great service and excellent food at a reasonable price. the next morning we had an excellent breakfast and there was plenty of it and then went for a long walk along the seafront and took full advantage of a late checkout. it will definitely be a place I would like to return to again and again", "title": "relaxing location with an added bonus", "helpfulness": 1, "user": "skanker7", "date": "May 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161850757}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Stayed for one night B&B and dinner at the Waterside on Friday 24th May. All of the staff including reception, bar, restaraunt and cleaning staff were very professional and friendly. Karen at reception made us feel really welcome. We had a stunning sea view from our bedroom, and also had a great sea view at dinner and again at breakfast on Saturday morning. Both dinner and breakfast were really good. There are fabulous walks on either side of hotel, one along the cliffs and one along the beach. Unlike another post below, our shower had fantastic power. Looking forward to another stay again soon at the Waterside.", "title": "Great stay", "helpfulness": 1, "user": "Olivia366", "date": "May 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 161811877}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "Myself and my husband got", "title": "Our Amazing Wedding", "helpfulness": 1, "user": "EmmaScarborough", "date": "May 19, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 161202622}, {"rating": 2.0, "stay_parameters": "Stayed May 2013", "text": "married here in The Waterside in May. We couldn't not have asked for anything better. The staff, the food, the rooms and the atmosphere were first class. We were treated like royalty & all of", "title": "Clean up your act", "helpfulness": 3, "user": "bannerdublinireland", "date": "May 8, 2013", "detail_rating": {"cleanliness": 1.0, "location": 5.0}, "id": 160070850}], "location": {"country": "Ireland", "continent": "Europe"}, "stars": 3, "variance": {"poor": 33, "average": 49, "very good": 77, "terrible": 21, "excellent": 122}, "slim_ranking": 0.5, "description": "The Waterside House Hotel Dublin boasts 35 well appointed bedrooms. Nineteen of the bedrooms, over look the sea and have every facility to enhance your comfort. Just a stones throw from this beautiful sandy beach and with panoramic views of Howth Head, Lambay Island and Malahide, we will ensure your stay will be a stress free and tranquil experience. If you prefer the warm green colours of Ireland, then choose one of our rooms overlooking the greens of the local golf course."}