{"user_rating": 4.0, "review_count": 34, "name": "The Residence Seminyak", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "We booked a certain villa months ahead of our stay. It was to be a special holiday for my daughters, granddaughter and friend. When we arrived we were in a completely different villa. Nowhere near as nice as the one we had booked. When we queried this we were told that the villa we had booked (and confirmed) wouldn't be available for three days. As we were only there for five days this was not acceptable. We were eventually transferred to the villa we had booked but by then it was too late. Very unprofessional and disappointing.", "title": "Very disappointing experience.", "helpfulness": 1, "user": "Kathy C", "date": "November 4, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 183496927}, {"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "The villa we stayed in was nice - not as \"Balinese\" as some of the others in the same complex - really we could have been staying anywhere, so that was a little disappointing. It was however clean, well maintained and well presented.", "title": "Needs Improvement To Justify Position In Market", "helpfulness": 1, "user": "Squidgy S", "date": "October 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 182773792}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "I read an earlier review which says not to bother about the breakfast - we couldn't agree more - it was very ordinary at no fault of the staff who prepare it, but rather the budget allowed for it. We were served \"Jungle Juice\" rather than fresh juice which is readily available and delicious in Bali. The pastries were extremely ordinary and delicious pastries are available at retail outlets nearby in Seminyak. We opted to have breakfast at nearby restaurants on a couple of occasions and much preferred the experience. We have stayed in villas in Bali before where breakfast has been prepared in our room at a far higher standard, so we know it is possible. The budget was just stingy.", "title": "mid-city paradise", "helpfulness": 2, "user": "Sweet1988", "date": "September 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 176177778}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "The wifi did not work well in the lounge room/dining room of the villa. The only place where it was reasonably effective was out by the pool - this was okay, but just okay, as we were not there just to holiday, but to do work as well, and it can be exceptionally hot outside in the middle of a Bali day, so the wifi experience was particularly ordinary.", "title": "Second Stay, just as good as the first", "helpfulness": 2, "user": "dmatthews2013", "date": "August 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 174049191}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "The staff were delightful. Overall we enjoyed the stay, but it doesn't take much to reduce the overall experience. These villas are not cheap to stay in and the very least that international travellers expect is wifi. Properties should not offer breakfast with the belief that they are doing the guest a great favour unless it is a really enjoyable experience. We certainly didn't need to walk far to find first class produce that could have been offered to us at breakfast or to find first class breakfast cafes.", "title": "Perfect Family Retreat", "helpfulness": 2, "user": "Donut_Dodo", "date": "August 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174048120}], "location": {"country": "Indonesia", "continent": "Asia"}, "stars": 4, "variance": {"poor": 0, "average": 5, "very good": 11, "terrible": 3, "excellent": 15}, "aka": "The Residence Seminyak Hotel", "slim_ranking": 0.622775800712, "description": "Our villa estate is only 20 minutes drive from the International Airport and is nestled in the most fashionable district of Bali, called Seminyak. We are located within a minutes’ walk to Bali’s famous Eat Street with lots of popular restaurants, fashionable boutiques, prestigious art shops and clubs."}