{"user_rating": 4.5, "review_count": 513, "name": "The Chatwal, A Luxury Collection Hotel, New York", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "As a Starwood Gold member (just recently downgraded from Platinum), we used 30,000 points for a 1-night stay at The Chatwal. Although the hotel is a very nice property, it did not come close to our expectations for a \"Category 7\" hotel. We requested an upgrade a couple of weeks before our stay and informed a \"front office supervisor\" that we would be celebrating a special birthday. He responded promptly and said he would do his best to obtain an upgrade but could make no promises. Our reservation was for a \"grand deluxe\" 400-square foot room. At check-in, we were advised that we had been \"upgraded\" to a larger room (but not a suite) on the tenth floor. The room, in fact, was the bedroom of a suite and had a locked, adjoining door to the suite itself. It had two windows, but limited natural light and no view to speak of. One of the first things we noticed was that the occupants of the suite kept trying the adjoining door to our room (presumably assuming it belonged to their suite). This was a bit unsettling from a security standpoint. The room was luxuriously appointed but did not appear to me to measure anywhere near 400 square feet. The bathroom had 2 sinks, a heated toilet (which held no appeal to us in 90+ degree weather), a TV built into the mirror, and a rainshower tub/jacuzzi (but not very much room for toiletries). The bedroom had a sitting area, desk, and coffee table, with a good selection of interesting magazines. The major disappointment we had was that the so-called \"lap pool\" was not a lap pool at all. I would call it a \"plunge pool\" at best. The spa attendants referred to it as a \"resistance pool\"--it is the type of pool that would be installed in a luxury condominium unit that does not have the space for a \"real\" pool. I tried it out (very skeptically) as I am a devoted lap swimmer and found that I could not take more than one stroke before being pulled back to the wall of the pool. I am sure there is an art to mastering this type of pool, but it is not for real swimmers. The picture of the pool on the website makes it look much larger than it is and, when I mentioned this to the spa attendants, they laughed (good naturedly) and said they did not understand how it could have been so misrepresented. All in all, our one-night stay for an occasion that we hoped would be quite memorable was nothing special. Perhaps it was naive of me to expect the level of luxury that we had encountered in such properties as Tambo del Inka in Urubamba, Peru, the Rambagh Palace in Jaipur, the Park Hyatt Palacio Duhau in Buenos Aires, the Nadesar Palace in Varanasi, the Taj Mahal in Mumbai, and even the ITC Maurya in New Delhi and the ITC Mughal in Agra. I wish I had saved my 30,000 points for a truly seven-star property.", "title": "Great Expectations", "helpfulness": 1, "user": "DCRE", "date": "July 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 134619881}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "I stayed at this hotel in June 2012. My first impressions were great. I thought the location near Times SQ would make it really noisy, but it's actually set far back enough from the action that you're not really affected by the hustle and bustle of the square. The hotel's proximity to 42nd St station and Grand Central make it perfect for getting around NYC. We had a little trouble with our credit card when we checked in: the staff tried to put a 'hold' for the total cost of our stay on it, as is normal practice, but it was being declined (my bank thought it was a fraudulent purchase and stopped my card). However the staff were so pleasant and understanding about the situation- not snooty at all- and gave me the time to sort everything out. The room was phenomenal. We stayed in a suite which came with a butler! To be honest we didn't use him much, but it was great to know that he was there. The concierge was super, printing out all of our boarding passes for us the day before departure and putting them under our door, and the reception staff, especially Elizabeth and Catalina, were the most friendly hotel staff I have come across in a long time. We were even loaned a laptop for the duration of our stay. I think a lot of hotels forget simple things, like remembering the name of guests, smiling, and being genuinely helpful. The Chatwal had all this perfected and it made this a truly great stay. The only reason i haven't given this hotel a full five stars (although I'd like to give it 4.5 out of 5, but TripAdvisor doesn't allow that) is because the control panel for the lighting/curtains in the room was a little complex and confusing and on a couple details didn't work. But our butler sorted it out, so it was fine in the end! I'd definitely recommend this hotel to anybody visiting NYC- I've been coming every year for the past 8 years and this is the best hotel I've stayed at in the city.", "title": "Surprisingly good location", "user": "EMCLondon", "date": "July 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 134596308}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "For our first trip to New York, my girlfriend and I and chose to stay at The Chatwal because I read quite a few very good reviews on this hotel. I have to admit that all the reviews I read did not even do this wonderful hotel justice. I have had the chance to stay at some very nice 5-hotels in the past, but this is the first time that I feel that I just HAD to take the time to write about it.", "title": "Simply Amazing!!!!", "user": "patrickusmaximus", "date": "July 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134568088}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "First off, the staff was absolutely charming and always very nice to us. There was even this one instance when, one morning, we leave the room and someone from the staff whom I had yet not met before already knew my name as he wished us a very nice day. I found that to be a very nice human touch.", "title": "Wonderful Service, Luxurious Hotel, Best Staff!", "user": "Nicole S", "date": "July 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 134547680}, {"rating": 3.0, "stay_parameters": "Stayed July 2012", "text": "As for the room, it was simply gorgeous and every aspect of it said abundance, class, and comfort. And as a man, I really enjoyed some of the more luxurious touches such as the hidden HD tv in the bathroom mirror and the heated toilet seat/bidet.", "title": "I was expecting more - not impressed", "helpfulness": 2, "user": "debbfrog", "date": "July 14, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 134383918}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The Chatwal was probably the most luxurious hotel we ever stayed in, not only the accomodation but the placement is nothing short of divine (right in the center of NYC). The hotel employees were always enormously friendly, and were always ready to help if we needed anything.", "title": "Delightful", "helpfulness": 1, "user": "Valentitine", "date": "June 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132531737}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "If there's anywhere that can make your stay in New York even more memorable, we can only advise you to stay at this litle piece of heaven in the center of the Big Apple.", "title": "Gorgeous Art Deco boutique hotel near Times Square", "user": "TTravlr", "date": "June 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 132452972}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "We stayed at the Chatwal over Memorial Day weekend. Great service at every turn from the front door (Ali) to the bar (Jacques). Excellent dinner recommendations from the concierge. The staff was ready with umbrellas and any amenity we needed. The rooms were elegant- suede walls, well-stocked bar, great furnishings, roomy closets and storage, and the bathroom is amazing. The Chatwal is a beautiful retreat at the edge of busy and chaotic Times Square with easy access to multiple transportation stops (42nd Ave, Port Authority and Bryant Park). There are no views from the rooms, but the rooms themselves and public areas are gorgeous. We'll definitely be back.", "title": "Wonderful", "helpfulness": 1, "user": "Jess H", "date": "June 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132273197}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "Thanks to Starwood's overly generous and short-lived Best Rate Guarantee Free Night NYC promo, I stayed here last week in a Junior Suite. It was wonderful. At no point did anyone make me feel badly that this was a free stay. The room was large and well appointed, although very masculine in decor (which is fine but my tastes are more feminine). I enjoyed a drink in the hotel bar and while the drink was delicious, my friend and I were ignored until we flagged down a waiter and then ignored again once we got our drinks until we flagged him down again for the check. I guess we didn't look like the typical patrons. Oh well. Otherwise, the night was great, the bed was comfortable, the rain fall shower was amazing (although the rest of the bathroom was a little too mirrored for my tastes--everything including the vanity and sink was completely covered in reflective metal) and it was well sound proofed.", "title": "My New Favorite Hotel!", "helpfulness": 2, "user": "Cara P", "date": "June 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 132026877}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "I was overwhelmingly impressed by my stay this week at The Chatwal. As a frequent business traveler, I've stayed at several different Midtown hotels, but this one was far and away the best. From the moment I walked into the beautiful Art Deco lobby, everything at the Chatwal was perfect. The Front Desk staff and Concierge were both friendly and extremely helpful. The room was incredible - amazing amenities and the best hotel bathroom I've ever seen (think heated toilet seat and TV integrated into the mirror!). The restaurant also had great food and service for breakfast. For such an amazing location so close to Times Square, my room was perfectly quiet. I can't wait to come back and stay again!", "title": "Elegance, personal service", "helpfulness": 1, "user": "BSRoth", "date": "June 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131990582}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "This is truly the nicest hotel I have ever been in! I picked this hotel for the location to Times Square. The hotel looks like you are walking into another time and place. I happen to love the 30'-40's era and the Chatwal made me feel like I was there. The attention to detail of furnishings is amazing. Professional staff great you with a smile and make you feel special from the minute you walk in. We booked the Junior Suite at a price that I would normally not pay. But I thought for just once, spend a little more to see what happens. Well, I never wanted to leave the room. It was so wonderful! We were there for a quick night into the city to see a concert and I can be sure we will stay at the Chatwal again! I can't wait to come back!", "title": "Spectacular Hotel!", "user": "NYCHotelLady", "date": "July 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134299024}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Our recent stay at the Chatwal was amazing at every level - I rarely write reviews but I think our experience should be shared. I travelled with my husband, 6 year old daughter and 20 year old nephew...as frequent travellers, we bring our daughter everywhere with us and she always rates the hotels. She compared the Chatwal to many other 5+ stars and we all agreed that we would return. Our nephew appreciated the art deco design and loved the tv in the mirror. He also liked the location as it was steps from Times Square, but my husband also noted how quiet and serene it was at night in the hotel (it was hard to believe we were in the middle of Times Square when we were in our room). We didn't have any issues with noise which was nice!", "title": "Boutique and Luxurious - but Staff makes it even better!", "helpfulness": 2, "user": "TO_Traveller_771", "date": "July 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134069397}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Check-in:", "title": "Classic Art Deco in the Heart of the Theater District!", "user": "Shelane N", "date": "July 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134055420}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The staff at the Chatwal are all so professional and friendly, and most of all helpful. Prior to my arrival, the Concierge staff (Nick, Tim, Juan, Pierre) emailed me with hotel, weather, and local information as well as answered all of my questions and arranged for everything that was requested, including accepting packages and making reservations for dining/transportation, etc. Check-in with Catalina was literally 5 minutes and we were in our room with our luggage and a tour of the room right away.", "title": "1st trip to New York - Chatwal did not disappoint", "user": "Trevor S", "date": "July 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 133355474}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "When I was out and about during the day, I was able to email concierge with any requests or questions and they were always answered almost immediately or in a timely manner. Thanks so much to everyone at Concierge!", "title": "Review Incomplete", "user": "Viyas", "date": "July 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 133319299}, {"rating": 4.0, "title": "Style, location & great staff.", "text": "We stayed @ The Waldorf last year but wanted a more central locality this year,happy we did!! Rooms were large,fantastic bathroom & heaps of wardrobe space.", "user": "Goradelhiwalla", "date": "June 30, 2012", "id": 133137380}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Breakfast was expensive but of high quality.Given the closeness to Times Square, the room ( on the 6th floor ) was surprisingly quiet.", "title": "Fabulous", "helpfulness": 2, "user": "JD1946", "date": "June 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132895454}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "All in all, the staff were what made this place a reccomended experience.", "title": "Wonderful experience in every respect", "helpfulness": 1, "user": "TravelingEstonian", "date": "June 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 132834466}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We just got back from a 4 night stay and were very impressed to say the least. The room decor was great - I loved the technological \"gadgets\" and particularly the computer phone by the bed from which one can do a zillion things from calling the butler to shutting the drapes. We loved the art deco theme and particularly the 40's background music playing throughout the property. Excellent location also - and despite being about 1 block from Times Square and in the middle of the theater district the rooms are acoustically sound - a very quiet hotel and we were street side on the 3rd floor! We did not eat there but the staff were fabulous and we will definitely stay there next trip. Kudos!", "title": "Great Property and Great People", "helpfulness": 2, "user": "S&CF2", "date": "June 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132776269}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "I stayed at the Chatwal for two nights with my parents following my graduation from university and we truly enjoyed our time. Unlike most hotels in New York, Chatwal demonstrated a consistent standard both in terms of service and the condition of the property. The hotel has a sleek modern art deco feel to it, the staff was wonderful in every respect, and we enjoyed our two spacious rooms, one single and one double. The bathrooms were particularly enjoyable with a waterfall shower and an integrated TV-set, which also worked as a mirror. The Chatwal was like an oasis in a part of New York that generally has a pretty touristy feel to it being just a few steps away from the madness of Times Square. Lastly, I wanted to thank the front desk staff for a complimentary late check out and for being so accommodating. We will surely stay at the Chatwal during our future visits to New York City.", "title": "FABULOUS HOTEL", "helpfulness": 2, "user": "Fran T", "date": "June 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132555269}], "location": {"country": "United States", "city": "New York City"}, "stars": 5, "variance": {"poor": 12, "average": 30, "very good": 64, "terrible": 10, "excellent": 397}, "aka": "The Chatwal Hotel New York City", "slim_ranking": 0.0654627539503, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "The Chatwal, A Luxury Collection Hotel, New York.Once home to the prestigious Lambs Club, this Stanford White designed landmark was reborn as The Chatwal in 2010. Fusing Art Deco style with Manhattan’s signature sophistication, The Chatwal has reinterpreted the elegance and glamour of classic New York City.Offering 76 guest rooms, inclusive of 27 suites, The Chatwal features a current pool, 24 hour fitness center and is home to The Red Door Spa by Elizabeth Arden. Guests are invited to enjoy celebrated “Iron Chef” Geoffrey Zakarian’s Lambs Club Restaurant, featuring modern American Cuisine. Wireless internet access and butler service is complimentary to all guest rooms."}