{"user_rating": 4.0, "review_count": 54, "name": "The Anchor Inn at Sutton Gault", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "We and group of friends decided to go to the Anchor for New Years eve celebrations and we were not disappointed! From the moment we arrived the staff were first class! Service with a smile and very attentive to all of our needs, Food was amazing and probably the best meal I have experienced for a long time! This restaurant has to be top of the list to visit..highly reccommended!", "title": "It has it all! Great location, fantastic service and Top class food.", "helpfulness": 1, "user": "OJECambridge", "date": "January 17, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 123222289}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We have. Just returned from an overnight stay in this quaint old inn which is located alongside a river, with dyke wall walks all around. The staff were wrk, welcoming and helpful - although the heating didn't start up until almost 6pm - so don't arrive too early on aa cold day!", "title": "Away from it all weekend retreat.", "helpfulness": 1, "user": "Denise G", "date": "January 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 123141941}, {"rating": 4.0, "stay_parameters": "Stayed December 2011", "text": "The inn is really known for good food and it certainly delivered on this score - well done to the lady chef!", "title": "A jewel by the river", "helpfulness": 1, "user": "P12345w", "date": "January 13, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 123039370}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The only thing which would have improved our stay would have been access to a cozy sitting room for per or post meal drinks. There was a room with a wood burner which would be great for sofas bur we guessed they needed the extra income the four tables in there generated, shame. We loved it and would recommend you try it too.", "title": "Could so easily be very much better", "user": "fifteenbedford", "date": "January 6, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 122675048}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We have eaten here a few times and enjoyed each occasion. Celebrating our anniversary to a summers evening, just because. Great seasonal food with a good wine selection and attentive service", "title": "Peaceful Rural Retreat", "helpfulness": 1, "user": "Susiesue55", "date": "September 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 118442456}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We have stayed at many restaurant/pubs with rooms and found Anchor Inn Riverside Suite to be average. The decor was very tired and needed somebody with an 'eye for detail' to bring the suite to the potential and character it could have. Forgetting all the creeky & slopping floors (the building is very old) the loo was very bad at flushing. From the sounds every room had the same problem. The shower was excellent. The food was excellent but have never had to choose between orange juice or stewed fruit at breakfast before! This place could be 100% but felt that it trades on its reputation.", "title": "Good Situation", "user": "Sauvarin", "date": "September 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 140013182}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Position by the river is very good and the riverbank walk was very interesting.", "title": "Friendly hotel, quiet area.", "user": "pdloots", "date": "May 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 130422908}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The staff were very friendly and very helpful. We had breakfast there, which was decent. Our room was very tiny, clean and fairly comfortable, but really small. Felt like we were in a hotel in Paris, as far as size goes. There are bigger rooms I believe, so I would suggest upgrading to something bigger. The hotel itself is nice and in a lovely area right next to the river. Good for a romantic get away.", "title": "Excellent food. Reasonable accommodation.", "helpfulness": 2, "user": "harvesthome", "date": "April 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 128329561}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Stayed in the Riverside Suite. Accommodation comprises sitting room (double sofa bed, couple of wicker chairs, TV) with views out onto the river, this leads through to the bathroom (corner bath, shower) and then through the bathroom to the double bedroom ( River views, TV, dressing table, tea and coffee making facilities - real coffee, real milk. Take your own biscuits if that's your thing as none provided). Bedroom can be accessed by separate door without going through bathroom.", "title": "Fine food and fresh air", "helpfulness": 2, "user": "14Rom", "date": "April 13, 2012", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 127789542}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Not much soundproofing but unlikely to attract rowdy neighbours. Everything very clean. Furniture / fittings basic and servicable. Not the Ritz but at the prices charged just about right for the money. Beware the low ceilings / doorways. Although you can regulate the heating to some extent it was very hot in the rooms.", "title": "Hidden Gem in the Fens", "helpfulness": 1, "user": "sayitasiseeit", "date": "April 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 127517912}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "My partner and I have regularly visited the Anchor and usually at last minute notice.", "title": "A warm and friendly welcome in the fens.", "helpfulness": 1, "user": "julia_anderson5", "date": "March 21, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 126459247}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The owner Adam and staff have always been very welcoming and friendly even when the restuarant has been at full capacity they have managed to get us a table, service and food have alway been of a high standard. The Anchor has always maintained it's atmosphere of a quaint and historical building, reflected by the decor and fixtures and fittings. It has not been falsely presented to appeal to customers and once you visit here you will return. We have always found the Anchor a place of quality and the friendliness and professionalsm of the staff have been second to none. It has an excellent and varied menu utilising local produce where possible, offering very good value for money and if anything, the main courses are on the large side for high end food. This is a quality restuarant not a gastro pub!!!!!", "title": "An enjoyable stay", "helpfulness": 1, "user": "alanlwright", "date": "February 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125017046}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Although we have never stayed in the rooms, we have made a point of viewing them and have recommended to business colleagues and relatives to stay here.", "title": "Worth a trip", "helpfulness": 1, "user": "lepidocrocite", "date": "February 17, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124710045}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "My wife, who had previously stayed at The Anchor last year, suggested a return visit for a 'short' weekend break. We enjoyed excellent food and courteous and friendly service from the Proprietor and his staff. Accommodation and facilities are first rate (though don't forget to 'Mind your Head' when negotiating some of the low beamed original rooms and stairways of the house).", "title": "I like the food but the accommodation is average", "helpfulness": 1, "user": "Charlieandaustinsmum", "date": "February 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 124467362}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We thoroughly recommend the Anchor and will definitely be making a return visit during the Spring.", "title": "First class evening meal", "helpfulness": 1, "user": "Bongodog1964", "date": "January 28, 2012", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 123756329}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "My name is sam bb i stayed at the anchor for my birthday. it was amazing. food was great, service was brilliant, location beautiful, very clean and lovely looking place and great vaule for money. THE BEST - i also reccomend the white horse in witcham also 5 star very nice chef to.", "title": "THE BEST EVER", "helpfulness": 1, "user": "sambroadley", "date": "April 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102418637}, {"rating": 5.0, "title": "Excellent find", "text": "sam", "user": "suffolksimon", "date": "January 16, 2011", "id": 93224194}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "I would thoroughly recommend this excellent inn. It is not really a pub as there is no designated drinking area it is all tables for food , but the food is totally excellent . There is a good selection of real ale and beer and the wine list is huge . There are a small number of rooms , ours was spacious and comfortable . Breakfast was very good . The area is a bit remote and very flat and featureless and was flooded at the time of our visit , so a quick ring to confirm all is okay might be a good idea . Great service too. Maybe one slight and only moan is that the service was a little rushed , maybe a little more time between courses would have been more relaxing .", "title": "Peaceful and relaxing", "helpfulness": 1, "user": "krhBedfordshire", "date": "October 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84647014}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We booked the New Bedford Suite on Late Rooms and were delighted to spend a night in such a wonderful setting with such spacious accommodation. Our bedroom was large, with a very comfortable, firm bed. There was also our own hallway with private bathroom, as well as a sitting room with a comfortable sofa, TV, radio and little fridge with complementary bottles of water and a small jug of fresh milk. This room is used for guests if you travel in a party of four. However, it was a lovely peaceful, relaxing haven for the two of us to spend the evening. There was a cafetiere with fresh coffee supplied, as well as a large, flat screen TV. We liked the White Company toiletries in the bathroom too. The manager greeted us when we arrived and was very friendly. We did not eat in the restaurant on this occasion, but it looked very inviting with lighted candles on the tables. The position is brilliant - situated on the banks of the New Bedford River and away from it all.", "title": "The Anchor Inn at Sutton Gault", "helpfulness": 1, "user": "zurmac", "date": "July 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 72962199}, {"rating": 1.0, "stay_parameters": "Stayed July 2009", "text": "Stayed here because there was nothing available in Ely. Just as well after visiting the one place I was considering in Ely. This Inn is about 8 miles outside Ely and a Sat Nav like Tom Tom will get you there with a little bit of input from yourself as well. Picturesque site, Looks just like it does on the Internet site. The owners are very friendly and helpful. The Inn was full the night we had booked in, classic case of overbooking but we were lodged in a B & B right next door, a two minute walk. We had our meals at the Inn and they were superb. Much better than what we had had in Ely earlier that day. Very good well thought out wine list and good 'real' beer. Highly recommendable. It is a great spot for people who like to walk the fens, one can see for miles. There is a river walk that literally goes right past the front door.", "title": "Terrible Meal", "user": "camb48", "date": "July 6, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 3.0, "service": 1.0}, "id": 34058006}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 2, "average": 10, "very good": 16, "terrible": 2, "excellent": 24}, "aka": "The Anchor Inn At Sutton Gault Hotel Ely", "slim_ranking": 0.371428571429}