{"user_rating": 4.5, "review_count": 1992, "name": "The Rubens at the Palace", "reviews": [{"rating": 5.0, "title": "Loved The Rubens", "text": "I've stayed at the Rubens before but must write to say their attention to detail, professionalism, friendliness is outstanding. They have also added additional security, so when entering another floor of the hotel you need to swipe your bedroom key before entering. An excellent idea - especially when you are a female staying on your own. I feel very safe and well looked after at the Rubens", "helpfulness": 2, "user": "beckyYorkshire", "date": "August 20, 2007", "id": 8456649}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "L Hogarth", "title": "Wonderful Experience", "helpfulness": 2, "user": "Rick07", "date": "August 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8452109, "likes": {"liked": "— The service"}}, {"rating": 4.0, "title": "Small but nice hotel", "text": "Before arriving at the hotel we had book rail tickets to Scotland. I was having some problem with the rail line because they do not send tickets to the US so I needed a London location to send them. I contacted the hotel and they were more than willing to help me out. They even contacted me to let me know when the tickets had arrived at the hotel and they were waiting for me when I arrived several months later. The rooms were very nicely appointed but what made the stay exceptional was the wonderful service provided by the reception desk staff, the bartender (John) and Nathan the doorman. These people were aware of our travel plans, because they cared enough to ask and then remember. They provided excellent recommendation, direction and were always ready with a warm and welcoming smiles at the end of a long day of site-seeing. We had friends staying at a high end hotel on Piccadilly and upon seeing our hotel and experiencing the service wished they had stayed with us at the Rubens. From London we went to Scotland for a few days and then back to London. We had originally been scheduled to stay at another hotel upon our return for one night. Instead we contacted our travel agent who got us booked back into the Rubens for our return. While the Rubens is not an economy hotel it is also not extremely expensive. I felt we got more than a good value because of the location, the clean and well appointed rooms but especially because of the people working there. This was my 6th trip to London and I think I have finally found a hotel I will return to on all future trips.", "helpfulness": 2, "user": "3amigosmom", "date": "August 9, 2007", "id": 8376481}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "I stayed at the Rubens for business. The staff is very helpful. Our concierge Dave and doormen were extremely friendly.", "title": "Rubens is Top-Notch!!!!!!!", "helpfulness": 1, "user": "Tackle", "date": "July 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8243360, "likes": {"liked": "— The quality of the room and service and location for the price", "disliked": "— Terribly expensive internet access in the room"}}, {"rating": 5.0, "title": "Service with a BIG smile!!", "text": "The room:", "helpfulness": 5, "user": "ZandaSpain", "date": "July 21, 2007", "id": 8209891}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "This is my third stay and it didn't disappoint. I just love it at The Rubens. The concierge even gave me a hug as he was so glad to see us back! If you want to really feel like you are near the palace, get a room facing the Royal Mews. You pay a bit extra but well worth it.", "title": "Back Again!", "helpfulness": 1, "user": "WALPOLE401", "date": "May 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130352210}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Rooms are small but cozy and bathroom is very nice and large by european standards. Its convenience to many sites, charm and historic nature makes it just a wonderful place to stay. I look forward to my 4th stay!", "title": "Afternoon Tea", "helpfulness": 1, "user": "mikki6416", "date": "May 21, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0}, "id": 130311077}, {"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "I visited the Rubens for afternoon teaon 8 May for my 30th birthday. This is the second time I have had afternoon tea at the Rubens.", "title": "Home away from home", "helpfulness": 1, "user": "janitravels", "date": "May 20, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 130264824}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "The staff are always polite and helpful. We requested vegetarian sandwiches as I am vegetarian and they happily accommodated this.", "title": "Holiday @ The Rubens", "helpfulness": 1, "user": "Leesh77", "date": "May 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 130233189}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We had the 'Queens Tea' which comes with champagne which is very good. I think the price was about £39pp and we were stuffed by the time we left.", "title": "fourth stay always the top of london", "user": "ciraldoa", "date": "May 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130227388}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We would recommend this place as it is right in the centre of London within walking distance to Victoria station and so easy for transportation links.", "title": "Great Location, Great Staff", "helpfulness": 3, "user": "HKPlum_Bum", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 141185164}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "We arrived on an early morning flight ahead of the normal check-in time and the staff were so helpful to sort us out with a choice of rooms to get over the jet lag. A much appreciated service.", "title": "A Grand Old Lady", "helpfulness": 1, "user": "episode10", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141165827}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Restauarant was good and again the staff were prepared to consider alternative requests rather than that which was on the menu.", "title": "Friendly and Welcoming", "helpfulness": 2, "user": "serenityofgaia", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 141150045}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "Price was a little high for the size of room but I'm not sure you will get much better value withi Central London.", "title": "Still A Gem", "helpfulness": 2, "user": "daverogers2001", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141071551}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "This grand old lady is a beautiful hotel. From the time I approached the front door from the street, everything was taken care of for me by the absolutely delightful concierge and receptionist staff. The hotel is old, but clean, well appointed and had that touch of elegance, style and good manners that one does not often encounter.", "title": "Fantastic welcome and service", "helpfulness": 1, "user": "Ruth P", "date": "September 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 141006021}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "I think there should be a rating between \"okay\" and \"terrible\", like \"bad\". You just don't get what you pay for, here - that's the rub. $339 per night for a 10' by 10' room. Smallest room I have EVER seen. No room for bags (2 people), walking around the bed (a DOUBLE!!), just not comfortable at all. I'd pay $75 for it to save money. But the $339 was a REAL slap in the face. In addition, food and drink prices were a shock, and NOT just because of the exchange rate. Entree (chicken), $49. Standard drink - $17. Absolutely ridiculous. Just trying to help. SO many alternatives around Victoria Station and the Palace. Use one.", "title": "Read the negative reviews! Shocking room for the money.", "helpfulness": 1, "user": "salieb", "date": "July 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 2.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 1.0}, "id": 8108782, "likes": {"liked": "— location", "disliked": "— room size, cost of food, frink, cost of internet (ridiculous)"}}, {"rating": 5.0, "title": "Fantastic Hotel Stay", "text": "My wife and I have just visited London for the fifth year running and have stayed in a variety of hotel chains,our visit to the Rubens at the Palace hotel has been the best to date.From the minute we entered the reception area we were met by friendly helpful staff who really could not do enough to help,the reception area is bright and welcoming and the staff on the desk made checking in simple and efficient.The rooms were of a very high standard and provided all the comforts needed and then some, the maid service and room service available was first class.With the risk of sounding gushy we really do not have a bad word to say about any aspect of our visit the only downside was that it was'nt long enough!", "helpfulness": 1, "user": "windsor55", "date": "July 10, 2007", "id": 8091049}, {"rating": 3.0, "title": "Posh but chaotic", "text": "The food was excellent and prices were very reasonable for the heart of London, location is superb for all the tourist attractions and theatres of the West End and the building itself is directly opposite Buckingham Palace and the entrance to the Royal Mews.If you fancy being treated like royalty in the closest hotel to Buckingham Palace visit The Rubens we have now found the hotel we will be staying in on every visit to London.", "helpfulness": 1, "user": "Tango_tastic", "date": "July 2, 2007", "id": 8040369}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "The Rubens is a nice hotel, but a little eccentric in its habits. I stayed there on business last month. Staff were friendly and courteous at all times.", "title": "Our new favorite London hotel", "helpfulness": 3, "user": "LBBud", "date": "June 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8019243}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "However, I was given a room that had been loaned to a couple for 20mins whilst they got changed, which was embarrassing for me and for them when they walked in. Then when I came back later, the room had been made up again but my key didn't work! Staff apologised and offered me upgraded room and complimentary glass of champagne, which entirely put the world to rights again.", "title": "The larger room was nice, the smaller ones are tiny.", "helpfulness": 2, "user": "Shelley04", "date": "June 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7953152, "likes": {"liked": "— The larger rooms were very nice.", "disliked": "— The smaller rooms are very small."}}, {"rating": 5.0, "stay_parameters": "Stayed January 2011", "text": "We stayed for 6 nights and loved ever moment. Especially the breakfasts! Make sure to include the breakfast in your room reservations! The before/after drinks in the lobby/parlor were a nice touch as well. We loved the location.", "title": "Going to London? Stay here!", "helpfulness": 13, "user": "30thanniversary", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 116970525}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "There are so many wonderful sightseeing hot spots within walking distance of The Rubens at the Palace, as well as the Victoria Station for the underground, buses, and trains. The concierge team was so patient to answer all our questions about getting around London. Our room was very comfortable, quiet, and beautifully furnished.", "title": "Wonderful service and location", "helpfulness": 12, "user": "Martha G", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116958980}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "We've stayed in the Rubens twice now, once for business and once for pleasure. The service is impeccable, the rooms clean and quiet (we stayed in room 312, with a lovely view across the street, plenty of light, walls upholstered with gentlemen's pinstriped suiting material!). Everyone you meet there, from the reception desk, the porters, the cleaning staff, will all great you and be lovely.", "title": "We wouldn't stay anywhere else! Love it!", "helpfulness": 13, "user": "marianapippa", "date": "August 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116892389}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Minus - the beds are not big, like American hotels. They are cozy. That didn't bother me.", "title": "Great Location", "helpfulness": 11, "user": "jtamchay", "date": "August 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 3.0, "service": 5.0}, "id": 116800173}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "Highly recommended!", "title": "Great Weekend", "helpfulness": 10, "user": "Fay M", "date": "August 16, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 116791873}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The Rubens is not cheap, but the service, the room & the food make you forget about the cost.", "title": "the best", "helpfulness": 3, "user": "hayden p", "date": "August 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117489344}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "For central London its pretty good value when you consider the quality of the surroundings.", "title": "WOW - 5 star location-service and rooms", "helpfulness": 3, "user": "highwaytrip", "date": "August 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 117473153}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "This hotel is located across the street from the Palace, close to Victoria Station and easy walking to most of the sights around London, including the London Eye. The rooms have all been redone with individual design. The towels are lush - the linens are Egyptian cotton, the walls are padded to lessen the sounds as is the windows. The food is typical English. The High tea is expensive, but worth it! My husband and I really voted this our best stay over the 3 weeks we were in Europe. Stay - you will not regret it. Keep yopu camera handy as the Queen guard frequently ride by.", "title": "Sheer Luxury & Service", "helpfulness": 2, "user": "LeanneLewi", "date": "August 30, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 117442798}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "It was our first time in London so for myself and two teenage daughters it was very special. I took hours looking at the computer checking Hotel reviews and ratings on London Hotels. I always smile when I think back at the great choice it was to stay at The Rubens by The Palace. Everything was just perfect we stayed in the sandringham suite the decor had a touch of royalty in every room. The bedswere super comfy the views were amazing over the Royal Mews! The breakfast here were great plentiful with variety, the food in general was oh high standard and the waiters and staff in general were the best! I have stayed at alot of Hotels in my life but the concierge and doorman give 10 star service. The great staff here make the best stay and we would defineatly come back and stay at this hotel. We Love The Rubens At The Palace, the position of location was close to everything Buckingham Palace, Theatres, interesting Restaurants and pubs and the beautiful surrounding parks. Ps. There is a wonderful Pianist playing at nights in Lounge who plays requests........so much fun!", "title": "Great Hotel", "helpfulness": 4, "user": "hunt88", "date": "August 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117389904}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We have just spent the weekend in London staying over night at The Rubens celebrating our 35th Wedding anniversary. It's lovely hotel recently refurbished to a very high standard, the room although a little small was beautifully decorated and furnished with a great size bathroom.", "title": "Wonderful Pre-Theatre dining experience", "helpfulness": 2, "user": "scottishtraveller099", "date": "August 28, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "service": 5.0}, "id": 117366055}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "We have stayed here previously and our expectations were not to be disapppointed. From the front of house staff to the unseen members of staff the experience could not be faulted, the rooms are of a high standard, a choice of restaurants, nothing is to much trouble our son even got a complimentary birthay cake and birtday card and enjoyed the hotel tour, would recommend this hotel to any one wishing to stay in this area of London. Mr & Mrs worthington, North Wales", "title": "One of the friendliest hotels in the centre of London, perfect location and the staff can't do enough to help ypu", "helpfulness": 6, "user": "daveworthington", "date": "August 26, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 117270015}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "I was at the Ruben at the Palace in London", "title": "Loved the Hotel will be back", "helpfulness": 8, "user": "catgranny", "date": "August 23, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 117156685}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "In July of 2011 for 4 nights.", "title": "My three day break", "helpfulness": 11, "user": "Bryan W", "date": "August 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 117150357}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "we loved the room, service and the food was great.", "title": "Lovely smallish hotel, very close to Buckingham Palace and Victoria Station", "helpfulness": 10, "user": "Ididntdoit", "date": "August 22, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 117073503}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "It is in a great location and they were friendly and helpful.", "title": "Great time at The Rubens!", "helpfulness": 13, "user": "CPfromNJ", "date": "August 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 116988203}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We have stayed at the Rubens before and were very impressed then, and even more so on this occasion. The staff are extremely courteous and helpful, the rooms are beautifully decorated and the hotel has excellent breakfast arrangements. We had booked an Executive room but were upgraded on arrival which was a complete surprise and enhanced our stay even more.", "title": "Stay on May 16th/17th", "helpfulness": 1, "user": "Ray B", "date": "May 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130170800}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Red Carnation hotels are definitely setting the standards that other hotels need to achieve and that includes many 5* establishments.", "title": "The flavor of England", "helpfulness": 3, "user": "Anitajane75", "date": "May 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 130119165}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Although cold and windy outside, it was warm and welcoming when we arrived at the Rubens after disembarking from a transatlantic cruise at Southhampton. From the time we entered the hotel until the time we left, we were treated royally. We had reserved a Superior room but because of a mobility problem with my leg the bathtub, while beautiful, was just too high for me to use. No problem! We were upgraded to a quiet room in the Royal Wing that had a separate shower. The room was spotless and ample for our needs and the bathroom beautifully appointed. Our package included a full English breakfast and indeed it was. Not only a variety of breads, pastries, cereals, cheese and meats but also eggs made to order and they even made oatmeal for me one morning. On the morning we left,(quite early before breakfast) they had coffee and pastries for us in the lounge while waiting for our ride. We also enjoyed a delicious dinner in the Library and the lounge was perfect for afternoon tea or cocktails. But the best thing about the Rubens is the service from the front desk clerks to the friendly bellmen and especially head concierge Tom Bergin and his staff including John Goncalves. Besides making reservations and suggesting alternate routes to places of interest, they went above and beyond to facilitate the resolution of our lost luggage. We are truly grateful and look forward to our next stay at the Rubens.", "title": "Rubens - 16th May 2012", "helpfulness": 1, "user": "Peter B", "date": "May 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130100910}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Excellent and consistent hotel. Friendly and courteous staff and a great breakfast", "title": "Great Location", "helpfulness": 1, "user": "travelbugdfw", "date": "May 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 130065587}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "My husband and I stayed in one of the executive suites which having the extra room was nice since we had so much luggage. We stayed 3 nights and found that being near Victoria Station was very convienent and a 15-20 min walk to other sites was doable. We happend to just miss the Queen leaving the palace for Parliament and unfortuantely would not see her return as we had to be someplace by 2pm. I was a little disappointed in the room but as my husband pointed out that we weren't crowded and had room to move around. The bathroom was decent even tho it seemed small and crowded but maybe that was because of the layout. There was plentiful supply of towels and bathrobes for our use. Our bed was comfortable and the only noise was that of other guests letting their room door slam shut and being near the fire exit the help would go back and forth in the morning and you could hear the swinging doors close. On the most part the hotel doorpersons and concierge were pretty nice but not always there to open the hotel door for you and at times didn't even acknowledge you except for the Scottish guy who I think was part of Concierge was personable. Again you couldn't beat the location. We did not have the breakfast even at the discounted price as we were up and ready to go as soon as we could so would just stop at the Cornish Pastry nearby and picked up a quick bite to eat on the way. All in all we did enjoy our stay.", "title": "LOVE THIS PLACE!", "helpfulness": 1, "user": "mnotton", "date": "May 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130063093}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "I had a pleasure to stay 2 nights at this spectacular hotel. On arrival I upgraded my room to a suite ( room 308). The room was very comfortable, huge bed, wonderful decoration ( yellow) and nice bathroom.", "title": "unforgettable staff", "helpfulness": 1, "user": "greeneyes010", "date": "September 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 140745912}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Excellent breakfast service but most of all the front desk especially Mr Roman made me a real impression. His style of taking care of his customers was/is very unic and special.", "title": "The Rubens is resplendent!", "helpfulness": 2, "user": "borders1", "date": "September 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140692649}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "This hotel is definitely worth the money. Will be back for sure.", "title": "A perfect two night stay, superior location & service, quiet, friendly!", "helpfulness": 2, "user": "Rocky B", "date": "September 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140572326}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Just one negative note... 2 cleaning ladies arrived to room without knocking first.", "title": "Going the extra mile", "helpfulness": 1, "user": "MaidMarian2", "date": "September 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140533771}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "This is an amazing hotel in close proximity to Buckingham Palace. We were greeted by smiling, courteous and knowledgeable staff who allocated us a room at the rear of the hotel on the fourth floor. It was quiet, very clean, and decorated stylishly with a huge bed and a good sized bathroom. A bonus was that a cake was delivered to the room, as the staff knew it was my birthday.", "title": "Fantastic weekend in London", "user": "freddofrog", "date": "September 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 140523395}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Just returned from a 3 night stay at this wonderful little hotel. Location is perfect as you can walk to Westminister Abby and Big Ben and then cross the bridge to the Eye in less than an hour. Using Victoria tube station is a breeze if travelling to Covent Gardens, Queensway, Embankment and Knightsbridge tube stops. Of course, Buckingham Palace is right across the street. Our room was quite comfortable, recognizing that hotel rooms in London/Europe can be small. We faced the palace mews and traffic from the busy street outside wasn't a problem. Our heating and air conditioning fan posed a minor problem as it blows directly on the bed and there doesn't seem to be a medium setting. Bed linens and towels were wonderful as was the comfort of the bed. Staff were exceptional. From the top hat wearing doorman, reception staff, concierge and of course, Alex waiting to assist with our luggage, and any other things we might need, we thought the Rubens was wonderful and certainly a hotel we would stay at again.", "title": "Well Located, Comfortable, Attentive Staff", "helpfulness": 5, "user": "S D", "date": "September 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 140988896}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Bbar next door was very good for dinner.", "title": "Love this hotel", "helpfulness": 3, "user": "Suemalnc", "date": "September 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140934279}, {"rating": 4.0, "stay_parameters": "Stayed September 2012", "text": "This was our second stay at the Rubens, sept 2009 and sept 2012 for our anniversary. On arrival we were greeted by the same friendly, helpful, courteous staff, with some new faces, who work very hard to provide such a high standard of care. Dave the concierge,who we contacted before our stay, had booked excellent theatre tickets for Les Miserable and Singin in the rain and gave us a very warm welcome back. Breakfast is plentiful, big appetite or small. Afternoon tea is deliciously good, just loved it. Our meal in the Library restaurant was superb gourmet food in a wonderfully relaxed atmosphere, Thankyou to Nicole and David for the most professional service. Our room was a classic double, clean and bright,lovely furniture,exceptionally comfortable bed and modern bathroom and if you get a hot spell, as we did,the air conditioning is very good. Great location for sightseeing, Buckingham palace 5 mins away, royal mews just across the road, st James park, Westminster abbey and good shopping around the corner. It was good to meet the General Manager, Malcolm Hendry, on the Sunday as we left ,so we could pass our compliments on to him. We cannot say anything negative about this hotel and would recommend it to anyone wanting to visit London. Homely, comfortable, charming and relaxing luxury. Looking forward to our next visit/treat.", "title": "Beautiful Older Hotel with Charm near Buckingham Palace and Victoria Train And Tube Station.", "helpfulness": 3, "user": "MustangRoxie", "date": "September 22, 2012", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 140928540}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "The Rubens Hotel at the Palace has charm and an exceptional staff. We were greeted by the hotel manager and everyone from the Concierge to the doorman has gone out of their way to ensure we are happy. We had a bottle of red wine in our room courtesy of the hotel and drink coupons as well. Included in our room (5 days) was a full breakfast. Others enjoyed the full breakfast, I don't eat breakfast so it was wasted on me.", "title": "Old fashioned, expensive, but - OK", "helpfulness": 2, "user": "LaughingJane", "date": "September 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 140926897}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "The hotel is right near Buckingham Pallace and Victoria Train and Tube station. We purchased the Oyster Card from home and used the Tube for most outings. We did take Bus #52 to Kensington Palace and Harrods! It is a 1 -2 block walk.", "title": "We love this hotel", "helpfulness": 3, "user": "Peggy L", "date": "September 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140831174}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "We went there for the marathon. It is so near to the finish line that works perfectly for runners. The hotel itself is very convenient for sightseeing, near to Victoria, to Backingham and so on. Rooms are not bad, although perhaps need some refurbishing. Service is good, and breakfast is reasonably fine. Not too expensive for London standards.", "title": "convenient for tourism", "user": "jimmy61Madrid", "date": "May 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 130993193}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Don't get enamoured by the postal address of this hotel and hence don't give it preference over other London hotels. Its very much overpriced hotel and a standard room measures approximately 8'x10'. I could barely move in the room.Since this hotel was booked by my travel agent and was pre-paid,I had no choice.Believe me there are better hotels at lesser price in the vicinity.Moreover, this hotel is facing one of the many gates of Buckingham Palace and the main gate where the change of guards takes place is nearly hallf a kilometer walk. Don't throw away your money on this hotel for its postal address.Whenever you wish you can reach Buckingham Palace within minutes from any place.", "title": "THINK TWICE BEFORE YOU RESERVE THIS HOTEL-HIGHLY OVERPRIZED.", "helpfulness": 3, "user": "harsh_khanna9", "date": "May 30, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 130947569}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Suffocating rooms and highly overpriced.", "title": "Fabulous location and great staff", "helpfulness": 2, "user": "gigigood", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 130879933}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "This hotel has one of the most responsive and friendliest staffs of any hotel that I have stayed in. A staff person comes to your room immediately to solve problems such as \"I don't know how to regulate the hot water in the shower.\" The buffet breakfast is lovely. My standard room was very small but had all the amenities. I was staying alone so it was fine, but it would have been too small for two persons.", "title": "Perfect Stay", "helpfulness": 3, "user": "abcgreys", "date": "May 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130779307}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The location is perfect--across the street from the Buckingham Palace Mews and three short blocks to Victoria Station for the tube or trains. I would definitely recommend this hotel but would request a larger room.", "title": "Wonderful 3 nights!", "helpfulness": 3, "user": "Belbris", "date": "May 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130717556}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "The Rubens is a lovely hotel within walking distance to the Victoria subway station and several sight seeing opportunities. My BF and I stayed for only one night but I would certainly stay again anytime.", "title": "Perfect Stay at Rubens!", "user": "epiphaneia", "date": "September 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8751851, "likes": {"liked": "— The location and cozyness.", "disliked": "— The elevators are a tad slow."}}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "The room was large enough to move around comfortably and had a desk, a wardrobe and TV housed in an armoire. The bathroom was nice but a bit small. Bathrobes and slippers were provided along with lovely and abundant toiletries.", "title": "Over priced stay at average hotel", "user": "Morto", "date": "September 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 1.0, "location": 4.0, "rooms": 2.0}, "id": 8738701, "likes": {"liked": "— Location", "disliked": "— Rip off rate and very small room"}}, {"rating": 4.0, "title": "Convenient location", "text": "The hotel offers an internet/movie package, for one price you can watch all of the pay per view movies and use the internet for 24hrs, or you can go a la carte.", "helpfulness": 1, "user": "dena2882", "date": "September 8, 2007", "id": 8675907}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Breakfast was included when we booked the room (otherwise it is a quite hefty 15 pounds), and it was incredible. Both continental and hot english breakfast are available buffet style with loads of variety.", "title": "great location", "helpfulness": 2, "user": "garage3", "date": "August 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 8514318, "likes": {"liked": "— location", "disliked": "— small rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled solo", "text": "For £289 per night I was expecting far better. Room was average and annoying air conditioning unit kept me awake.", "title": "Great location and touch of luxury", "helpfulness": 1, "user": "dspgrace", "date": "August 24, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8499853, "likes": {"liked": "— Touch of luxury", "disliked": "— Nothing"}}, {"rating": 2.0, "title": "VAT not included!!!", "text": "having telephoned to book afternoon tea for 4 people, AND specifically asking the price, I was outraged to discover that the qouted price did not include VAT.", "helpfulness": 1, "user": "colant", "date": "September 4, 2011", "id": 117673352}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "This bumped the bill considerably, PLUS service charge.", "title": "Home away from home", "helpfulness": 5, "user": "Jaboki", "date": "September 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117576348}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The tea wasn't even that special....", "title": "Another Excellent Stay", "helpfulness": 6, "user": "EssexBod", "date": "September 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117528306}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I have now stayed at this hotel a good number of times - in fact I always stay here when I visit London for business. It is my home away from home in London, the best service - always. Friendly staff and always willing to help. The food in the Library Restaurant is very good and the breakfast is outstanding. However the rooms are small - I will not recommend the standard single rooms - they are more like shoe boxes. But the style of the rooms and the decor is charming. One of the good things also about this hotel is the central location.", "title": "Friendliest people in all of London!", "helpfulness": 5, "user": "Kaktusc", "date": "August 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117503140}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "We stayed once again at the Rubens Hotel for an anniversary celebration weekend in London. We are happy to report that the high standards are undiminished, and the Rubens continues to be a top-notch, traditional, professionally run, 4-star hotel.", "title": "Amazing!", "helpfulness": 4, "user": "PrincessAlexandra", "date": "August 31, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 117491213}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Staff were very polite and efficient on arrival. We were given the choice of smoking or non-smoking on arrival. Our room was of a good standard, very quiet and very clean. A large sash window provided good ventilation for our smoking room. I do NOT recommend you use the air conditioning in the smoking rooms unless you want the ghost of smokers past wafting in, which is what happened. It made the room stink! The only other problem with the room was the creaky floorboards - you can hear every step taken on the floor above you. However, the room was a reasonable size for London and our first breakfast there was excellent - fantastic choice, great quality and the staff were really on the ball. We found room service slow (took an hour to receive a complimentary bottle of wine) but they were polite and very apologetic about the delay. Drinks from the bar are a little expensive at £18 for 2 glasses of house red, that's £16 for the drinks and a £2 bar charge. A £2 charge for going down to the bar and taking the drinks up to the room myself seemed a bit steep but I didn't want to wait another hour for room service. We decided against having dinner at the hotel and went elsewhere. Breakfast on day 2 was a bit chaotic. There were plenty of tables but not enough of them set so people were waiting in the bar area and the queue extended into one of the lounge. This presented a problem as we had a train to catch, but when we eventually got through to the dining area the standard was excellent once again and we got our train in good time. Overall - nice room, excellent polite staff, good location, and on the downside - air conditioning needs attention, creaky floorboards, room servce slow.", "title": "Lovely hotel - good smoking rooms, but don't use the air con", "helpfulness": 2, "user": "jak63", "date": "July 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 2.0, "cleanliness": 5.0, "value": 2.0, "rooms": 5.0, "location": 5.0}, "id": 8204282, "likes": {"liked": "— Nice rooms, staff had very good attitude.", "disliked": "— problems with the air con, creaky floorboards"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We just got back from four nights here. We had a great stay - the concierge team is amazing! This has English charm and great proximity. Nice bar and restaurant.", "title": "Great stay, great service!", "helpfulness": 2, "user": "cau3", "date": "July 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 8176518}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We got 2 joining rooms for us and our 2 kids. This was key, as the rooms are VERY small. I suggest emailing with them directly for the best rate.", "title": "Personalized Service Made the Stay Special", "helpfulness": 1, "user": "rmt011", "date": "July 16, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 8128005, "likes": {"liked": "— The great service", "disliked": "— The expense due to the weak dollar"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "We would certainly go back here!", "title": "Great value hotel in London!!!", "helpfulness": 1, "user": "malousadiua", "date": "July 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8118609, "likes": {"liked": "— room size is very comfortable and very well kept.", "disliked": "— the elevator, like most European ones, is the size of a small broom closet."}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007", "text": "One major factor in our selection of Rubens at the Palace was their Kids' Weekend Promotion. We wanted to stay at an upscale hotel but were concerned that some choices may be unsuitable for families.", "title": "A great weekend at the rubens!", "helpfulness": 1, "user": "roadmomLA", "date": "July 13, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 8113908}, {"rating": 5.0, "title": "Central location, top service", "text": "My wife and I stayed here as part of our honeymoon and picked the Rubens after reading reviews on trip advisor. When we arrived we were greeted by the concierge and our bags carried in for us. Check in was polite and speedy, and we were upgraded to the royal wing! After this our bags were taken to the room and we were shown around. The concierge was lovely and explained where everything in the room was and how the tv, air con etc worked. The room itself was classical in decor, clean tidy and had everything we wanted. We even had a tv in our bathroom and a shower each. Reception called shortly after we were in the room to make sure we were happy, and within a further ten minutes, the door rang and we we given delicious chocolate covered strawberries complimetns of the management. It was a lovely touch. All I can say is that the staff were wonderful, friendly and attentive at every turn. It really makes the stay.", "user": "akendall1983", "date": "September 16, 2012", "id": 140430939}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "On top if this, the hotel is very nice. We would stay here again without hesitation.", "title": "Top Notch", "user": "segapfour", "date": "September 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140267356}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "From the moment we arrived everyone on staff - doorman, front desk , conceirge, wait staff - were extremely friendly and accomodating. My wife and i spent two nights at The Rubens and would definitely stay again. Ideally located for tours, especially if you enjoy walking. Room was small but then again you are not going to live here. Less furniture would be a plus. Received a couple of drink vouchers which we used at the bbar next door (very good also), and in the lounge. Breakfast was good and plenty to choose from. It was great to see what appeared to be genuine smiles on everyone's face. Made you feel like you were special. Great job Rubens.", "title": "Good hotels that's close to many of London's hotspots", "helpfulness": 1, "user": "Travelling-Ninja", "date": "September 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 140231348}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "We stayed here for a couple of nights in November. As it was a short city break, we wanted something that was quite central to most of the attractions. And we weren't let down in this regard.", "title": "Excellent service..........however", "helpfulness": 4, "user": "charlie S", "date": "September 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 140079107}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The bedroom was fine, although the en suite was a little cramped. However, the \"window\" looked out onto a small, dark internal \"courtyard\" although I'm not exactly sure what it was. No view at all. Also the room was right beside a service room or stairwell and staff were constantly going through the door, which would bang each time they did. Quite noisy, especially in the small hours of the morning. We only had breakfast in the hotel, and this was average hotel buffet stuff; certainly nothing to write home about.", "title": "Lived up to expectations....excellent.", "helpfulness": 1, "user": "seymoose", "date": "September 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 139943836}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "A great hotel in a great location. The rooms are elegant and comfortable, the food is delicious but it is the staff that really enhance the experience - there are plenty of them and they are exceptionally friendly and helpful. I will definitely be back. A fabulous hotel.", "title": "A great hotel", "helpfulness": 1, "user": "Christine G", "date": "May 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130663920}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "This hotel is lovely and well maintained, the staff and service excellent. Our room was spotless, well furnished and a decent size with a lovely big bed which gave us a good night's sleep. The room had everything to make our stay enjoyable. However the room appeared to be sandwiched between two buildings and the narrow window looked out onto walls and a multitude of pipes, with little natural light. The hotel had tried to disguise the walls/pipes by putting a trellis on the outside of the window with what appeared to be artificial ivy but sadly this made the outlook even more gloomy.", "title": "Excellent hotel but room without a view", "helpfulness": 3, "user": "KristieH", "date": "May 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 130586294}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We didn't eat dinner at the hotel but did have a few drinks in the bar and again the service was second to none, as was breakfast. I especially liked having a choice between crispy or lightly cooked bacon served at the buffet!!", "title": "Wonderful Stay1", "helpfulness": 1, "user": "Pam H", "date": "May 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130575509}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "A first class hotel in an excellent location. I would have liked to award 5 stars but for the \"room without a view\",", "title": "Recent Stay", "helpfulness": 1, "user": "A M", "date": "May 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130569452}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We stayed at the Reubens for three nights in early May during our trip in London. All I can say is that we can't wait to go back! Our room was very comfortable and decorated very nicely. The service was excellent...especially Dave Brown who assisted us in where to go and what to do. He was always a friendly face to see when we stepped off the elevator. One of our favorite things to do was to stop in at the lounge after a day of touring, sit by the fire and have a delicious bite to eat and drink. The full English breakfast in the morning was great and they even accomodated my request for \"non dairy\" scrambled eggs. 5 stars to the Reubens! We'll be back!", "title": "just lovely, central to everything, beautiful hotel", "helpfulness": 1, "user": "Bells54", "date": "May 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130565272}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 4, "variance": {"poor": 56, "average": 116, "very good": 483, "terrible": 17, "excellent": 1320}, "aka": "The Rubens At The Palace Hotel London", "slim_ranking": 0.0390334572491, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "Traditional, Edwardian-era hotel, originally built as a debutante hostel for nearby Buckingham Palace."}