{"user_rating": 4.0, "review_count": 393, "name": "The Grand New Delhi", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "this hotel was more than we expected!", "title": "delicious buffet & big room with good facilities", "user": "butaho", "date": "July 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115283301}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "Though our room was on the 1st floor, we could see a beautiful pool view. more than that the room is so big that we could stay comfortably. Bathroom and toilet are separated, but they are connected to room.", "title": "Always a new delightful experience", "user": "allstern", "date": "June 28, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 114839712}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "As for morning buffet, it was fantastic and especially we liked the atmosphere of the dinning hall.", "title": "Great rooms but not so decent food", "user": "PriyankSamaria", "date": "June 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 114633916}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "Next time also we would like to stay here. We can stay at the half price of other 5star hotels located in the center of New Delhi! So, if you do not mind the distance from the center (approximately it takes 30-40 mins to Connaught Place by taxi), we recommend you to book this hotel. Access to international airport is very convenient. It takes only 25 mins or so.", "title": "Overnight stay to catch a morning flight", "user": "Jubbin55", "date": "June 15, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 113691091}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "The only thing that we were disappointed is the rate of internet service. If you need to use the internet, it costs 800 rs.(per day). So, as business trip we do not recommend.", "title": "Do try this for your next business trip to Delhi", "user": "SonnyCrock", "date": "June 15, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 113687641}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "Le Grand New Delhi is a majestic hotel. The lobby and the surrounding gardens are just overwhelming. I was only able to spend one night in new delhi and regret i couldn't have more. The service and collaborators at the reception desk are very nice. The breakfast are is very pleasant and the service as well. Hope to be able to come to this great hotel some time later on.", "title": "Amazing !", "user": "lsilva", "date": "September 17, 2011", "detail_rating": {"value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 118242379}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "Was stranded at the airport for an extra three days on a business trip and was sent with 200 other passengers by the airline to The Grand at 2am. The hotel did a fabulous job taking care of us all throughout our unexpected stay. Thank you!", "title": "Great hotel near the Dehli airport!", "helpfulness": 1, "user": "Intbusiness", "date": "September 9, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 117883897}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "Large sized, not gigantic. Very luminous hall and restaurant, facing the front garden. Large and beatiful pool, nice spa area and adequate fitness center.", "title": "Wonderful stay, relaxing, spacy -not much Indian flavour, probably.", "helpfulness": 1, "user": "Hedin", "date": "September 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117735677}, {"rating": 5.0, "title": "Whenever I visit the Capital, my choice of stay will always be \"The Grand\"", "text": "I particularly enjoyed the restaurant -a buffet on the National Holiday was the best i ever had in India.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "August 26, 2011", "id": 117296775}, {"rating": 1.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The architect made a great job, but still not much Indi-style is present. The best achievement is to me having built under the top level of the garden: the whole structure seems immerged into the green hill.", "title": "Very bad checked in service for 5 stars hotel standard", "helpfulness": 4, "user": "Luluna-21", "date": "August 14, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 3.0, "value": 1.0, "service": 1.0}, "id": 116693553}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Spent two nights at the hotel on a business trip. Check in and out was efficient. All staff friendly and helpful. Room modern, specially bathroom, and everything worked well. Coffeemaker available, but no ironing board. However, laundry service good, on time. There was chocolate, fresh fruit and plenty of bottled mineral water on a complimentary basis. Bed very comfortable and room quite, window cannot be opened. Newspaper delivered to room early morning. Quality of food, buffet, breakfast very good. Something to mention however is that waiters, specially at the lobby, are very slow and not really attentive and not all drinks on the card are really available. Also, Limousine pick up at airport was exaggerated and rather expensive, two cars for three people (two cars invoiced). What is missing somehow is a reference to the rich local culture, the hotel, though five-star, makes an international impression and could be located anywhere in the world.", "title": "Comfortable and good Infrastructure", "helpfulness": 1, "user": "Frequentvoyager", "date": "October 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 119675011}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Stayed there for 4 nights in the last week of September.Excellent location.good ambience,friendly people.My room was elaborate but the washroom was small.good quality furnitures in the room,grand external view.avoid inroom dining because you might not get what you ordered for ;at least this is what I experienced.All in all a comfortable stay", "title": "World class experience", "helpfulness": 2, "user": "sivaprasadTalcher", "date": "October 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 118984761}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We stayed here on two separate occasions during our stay in India and both times, the hotel met high standards. The room we had was a premium room which had a very luxurious large bathroom and plenty of space. The services offered are the usual you would expect in a Western style hotel. The hotel is situated across the road from a very large extensive mall where high street as well as luxury brands are available. There is a bowling alley and a good range of restaurants.", "title": "A very comfortable hotel.", "helpfulness": 1, "user": "Steftheref", "date": "September 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 118611377}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "The hotel is not really in Delhi, its on the outskirts and is actually quite close to the airport (20 mins with light traffic).", "title": "Do not expect a Five Star Experience", "helpfulness": 2, "user": "Jacob J", "date": "September 22, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 118468950}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "The hotel has a few restaurants, 2 of which are situated on the ground level in a large atrium. On our second visit there was some sort of 'entertainment' arranged in this area (2 women singing very badly) so in order to get away from the noise, we found the hotel had another restaurant at lobby level. This is actually a speciality Indian restaurant and for some reason seems completely under publicised by the hotel. Its tucked around a corner and there is very little signage or literature promoting it, which is a real shame as the food we had there was excellent.", "title": "Stay Somewhere Else - You Can Do Much Better", "helpfulness": 3, "user": "buckeye_26", "date": "September 19, 2011", "detail_rating": {"value": 1.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 118306212}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "checked in at around 9 pm in the hotel while returning from Agra. One of the few excellent place to stay in Delhi. Rooms are quite spacious, tidy. The food quality is good. I had ordered for a veg meal and it was served the way I wanted. The only concern area is the distance from the major places in Delhi.", "title": "Nice place to relax after a long trip", "user": "hawk_wanderer", "date": "August 10, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 116534698}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "If one really wishes to enjoy his stay in Delhi, he should try to stay neat the connaught place or chandni chowk to get feel of real Delhi.", "title": "It was great and serene stay at your hotel", "helpfulness": 1, "user": "RoshanImphal", "date": "August 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116288943}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I had booked the hotel thru online travel websites as the direct rates from the hotel were much expensive.", "title": "Innovatively done rooms", "helpfulness": 1, "user": "Deep S", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116149684}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "It will be great if you could put a clock in each room which have an alarm too", "title": "Really, really good, but...", "user": "PhSch16", "date": "July 20, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 115569104}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "During our visit in Delhi for an exhibition we stayed in this place.", "title": "My home away from home", "user": "beatrizjellinek", "date": "July 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115370470}], "location": {"country": "India", "continent": "Asia", "city": "New Delhi"}, "stars": 5, "variance": {"poor": 19, "average": 62, "very good": 152, "terrible": 19, "excellent": 141}, "aka": "The Grand New Delhi Hotel", "slim_ranking": 0.185185185185, "description": "The Grand New Delhi is a five star luxury hotel located in Vasant Kunj. Set amid 10-acres of lush greenery, it has an inventory of 390-keys which are furnished in contemporary style and among the most spacious in room size in New Delhi. The hotel has been recently refurbished and boasts of an elegant, white marble lobby and signature restaurants are which , namely, It, serving Italian fine-dining and Caraway, which offers traditional tandoor cuisine. A sweeping grand staircase leads to Cascades, the three-meal, gourmet dining outlet, and Woktok, the Pan Asian restaurant, which overlook aesthetically landscaped gardens. The G Bar, serving the finest selection of Cuban cigars, single malts and other spirits, is located at lobby level and so is the Crystal Lounge, which offers a daily English hi-tea, while the Aqua bar is located at the poolside. Spa Oasis provides a rejuvenating experience with its extensive range of treatments using exclusive French products, and a gamut of therapies encompassing the Ayurveda, Thai, Swedish and Oriental methods. The Grand hotel New Delhi strategically located with a distance of 10 kms from the Airport in the heart of South Delhi, is close to the commercial Business district of Gurgaon (10 minutes) and Government Offices (15 minutes). This gives an equidistant location between the city centre & the commercial business hub like Connaught Place & Noida. The Grand is one of the best luxury hotels near Gurgaon. This downtown hotel is also surrounded by green belt with no high rise building obstructing the view from the hotel & hence extremely secured for VIP visits. The Grand New Delhi offers among the largest banqueting space in the area, with state-of-the art convention facilities. Its close proximity to the international airport and the business hub of Gurgaon, as well as high-end luxury malls such as DLF Emporium and DLF Promenade make it your hotel of choice be it for a corporate or leisure visit."}