{"user_rating": 4.0, "review_count": 33, "name": "The Capitol Apartments", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled on business", "text": "These apartments were modern, well fitted out and ideally located. I had a room on the fourth floor and was unable to hear anything through the night despite being a bit concerned when first looking outside and seeing the train line. The staff were efficient on check in and there's a little restaurant downstairs that seems to do a great trade. Ideally located for the museums and art gallery and the nightlife at west end. Also very handy for south brisbane station which you can get to from the airport without changing trains.", "title": "Modern, well located apartments", "user": "robmigrates", "date": "December 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 186971403}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "The Capitol apartments were spacious and very comfortable. Check in was quick, efficient and friendly. We stayed in a 2 bed, 2 bathroom apartment. The Capitol was located with easy walking to explore the whole of Brisbane CBD. Parking was easy and very reasonably priced. The ensuite bathroom was very modern, but personally I didn't like the lack of privacy with the glass doors. I would recommend these apartments and stay again. We stayed on a higher floor and we had no sleep disturbance from the railway.", "title": "Spacious apartment and a great location", "user": "Susan T", "date": "December 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186884974}, {"rating": 4.0, "title": "Great South Bank find..", "text": "Needing a 1 night stay to see an Art exhibition & some shopping we came across Capitol Apartments which seemed walking distance to the Queen St Mall and around the corner from the South Bank arts precinct. We were able to secure a executive 2 bdrm apartment for the price of a 1 bdrm in central Brisbane and the parking was only $10 compared to at least $20+ elsewhere.", "user": "Traveller2005", "date": "November 30, 2013", "id": 186367905}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "Reception staff were friendly & helpful and the apartment was huge with views back towards the river. The kitchen was thoughtfully kitted out with everything you need for a dinner party for 6, 2 large bathrooms (1 ensuite) and tastefully decorated with contemporary furnishing - everything you need for your Brisbane stay.", "title": "Great location, great amenities, great price", "user": "croceau", "date": "November 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186294972}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "We'd highly recommend these apartments & will use them as our base for future Brisbane visits...", "title": "Lovely apartment and great location", "user": "AdnilAustinmer", "date": "November 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 185563055}], "location": {"country": "Australia", "continent": "South Pacific", "city": "Brisbane"}, "stars": 3.5, "variance": {"poor": 0, "average": 5, "very good": 19, "terrible": 2, "excellent": 7}, "slim_ranking": 0.179775280899, "description": "FREE Wi-Fi!!! (Conditions Apply).Brand new South Brisbane Apartments opened in May 2013, The Capitol Apartments offer studio and self-contained apartments with kitchen and laundry facilities. Guests have access to a fitness centre, outdoor pool and a day spa called \"C-Spa\". These air-conditioned apartments are fitted with an iPod dock, DVD player and a flat-screen TV. There is a refrigerator, microwave, toaster and tea/coffee making facilities in every apartment. Some offer a balcony and all a spacious lounge area (with surcharge sofa bed).The Capitol is 300 metres from the Brisbane Convention & Exhibition Centre and a 5-minute walk from South Brisbane Train Station. It is a 10-minute walk from South Bank Parklands and a 20-minute drive from Brisbane International Airport. Queen Street Mall is only 2 km away. Reception hours are: Monday to Sunday: 07:30-20:30. If you expect to arrive outside reception opening hours or on the weekend, please inform The Capitol Apartments in advance. You must show a valid photo ID and credit card upon check-in. Please note that The Capitol Apartments requires a credit card pre-authorisation upon check in. Cash is accepted at this hotel, and you are kindly requested to present a valid credit card on arrival. The Capitol Apartments enforces a strict No-PARTY-POLICY. Any guest not following this rule will immediately be asked to leave, no exceptions."}