{"user_rating": 3.5, "review_count": 637, "name": "The President Hotel - Miami Beach", "reviews": [{"rating": 3.0, "title": "Not bad for the price", "text": "We booked this hotel for $94 a night through a website and stayed there December 23. It was fine for one night. It actually feels like a tourist class hotel in Europe. The front lobby is charming and festive, the front porch restaurant looks like it would be fun for people watching. The front desk people were friendly - they spontaneously offered to let us leave our bags there when we checked out. The room was fine - it looked like a motel room, but it had two beds, so it could have been easily shared by four people. The air conditioner worked well and the room was clean. The bathroom was tiny but also clean. Walls were paper thin, though. I think President guests can use some of the facilities of the adjacent Penguin Hotel (the face of which is on Ocean Drive), but I did not investigate those options. If you are looking for a place to crash and you don't intend to spend a lot of time in your hotel, this is a good bang for your buck.", "helpfulness": 6, "user": "PT1976", "date": "December 27, 2005", "id": 4301349}, {"rating": 1.0, "stay_parameters": "Stayed December 2005", "text": "This is the worst hotel in Miami (along with it's sister hotel The Penguin. They charged me twice but refused to correct the error. They say the have facilities that they don't (Like internet) and the place is filthy. You need to walk through a restraunt kitchin to get in and out. I moved into a backpackers after this hotel and is was 100 times better. The staff were some of the worst I have ever dealt with. Avoid at all costs.", "title": "The worst hotel in Miami", "helpfulness": 1, "user": "othermaster", "date": "December 21, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 4254901}, {"rating": 4.0, "stay_parameters": "Stayed October 2004, traveled on business", "text": "Having already changed one hotel with Expedia as a result of bad reviews (Expedia were great about it)I then chose The President, Read the reviews - and began to worry.", "title": "Found It Great", "helpfulness": 8, "user": "welshjonah", "date": "December 6, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4164706}, {"rating": 2.0, "title": "Get what you pay for", "text": "having booked in with some very friendly and helpful French staff, I discovered the room to be delightful -looks exactly like the one in the picture.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "December 5, 2005", "id": 4163524}, {"rating": 3.0, "stay_parameters": "Stayed November 2005", "text": "The hotel was clean, actually spotless, the room was perfect, the location was excellent and staff very friendly. Spent time eating and drinking int the Hotel on the occasional evening and was tremendous. Would not hesitate to return here.", "title": "Satisfactory stay, but hotel needs refurbishment", "helpfulness": 3, "user": "jp7541", "date": "November 10, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "service": 3.0}, "id": 4103326}, {"rating": 1.0, "title": "The rooms stink!!!!", "text": "I had booked a 1 night stay at this hotel when I was at South Beach for the Labor Day weekend of 2005. This has got to be the worst hotel I have stayed in all my life. Smelly rooms, dirty bathrooms, dingy lobby and overall a terrible place and too much money for a crappy place.", "user": "A TripAdvisor user", "date": "September 6, 2005", "id": 3846553}, {"rating": 3.0, "title": "Not the Radisson but not that bad", "text": "I had to check out at 2.00 AM since staying there was unbearable and found an alternate place at Ft lauderdale instead.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "September 1, 2005", "id": 3835470}], "location": {"country": "United States", "city": "Miami Beach"}, "stars": 3, "variance": {"poor": 77, "average": 130, "very good": 227, "terrible": 82, "excellent": 121}, "aka": "The President Hotel", "slim_ranking": 0.459183673469, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.0, "rooms": 3.5, "location": 4.5}, "description": "The President Hotel is located directly on Collins Avenue, minutes away from the famed pedestrian shopping and entertainment center of Miami Beach, Lincoln Road, as well as a vast array of restaurants, cafes and other entertainment venues. Tastefully renovated in 2008, the 64 guest rooms are all different, each appointed with one wall entirely covered with a picture portraying green elements of nature and complemented by an accent decorative pattern in a stylish cut-out sequence."}