{"user_rating": 2.5, "review_count": 456, "name": "The Great Southern Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "We stayed in the Hotel Enterprize for 1 night on 2 separate occasions while passing through Melbourne. The location was great; right accross the street from Spencer St. station, and within walking distance to the whole city. The rooms were both very clean, and the staff was very helpful and courteous. Definitely agree that it is a no frills accomodation, but we were not looking for that. This place did the job. If you want more amenities, maybe look into the Holiday Inn that was right across the street. Same great location near the train station, and they probably have more to offer. Otherwise, you get a tremedous bang for your buck at Enterprize. Where else can you stay in a safe part of downtown Melbourne in a clean room with en-suite bathroom for 78AUD (approx 50 USD)? That's tough to find. There was a nice variety of small cafes/restaurants on the same block too, so that was a nice bonus.", "title": "Perfect for a short stay", "helpfulness": 2, "user": "Hophead515", "date": "February 4, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4412378}, {"rating": 3.0, "title": "good value for money", "text": "we stayed here in december 2005. convenient location... the breakfast was ok... good value for money!!!", "user": "sobekra", "date": "January 30, 2006", "id": 4398707}, {"rating": 3.0, "stay_parameters": "Stayed November 2005", "text": "We stayed here in Nov 2005 for five nights while visiting Melbourne. Our room was spacious, with mini-fridge, large bathroom. The hotel lobby and elevators are a bit run-down but the location is good--walking distance to Yarra River, downtown, and the bus station (from which you can catch the airport shuttle). Hotel was quiet although we had a view of a brick wall. We felt safe walking in the area (even at night), and the desk staff were pleasant and helpful. Our room was clean and fine for a few nights stay. Lots of hotels in the area so you can always shop around if you choose. We would stay here again--paid $135 AUD per night.", "title": "Good location, quiet, but nothing extraordinary", "helpfulness": 2, "user": "WBinBC", "date": "January 26, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4389983}, {"rating": 2.0, "stay_parameters": "Stayed April 2006", "text": "My patner and i stayed here during the easter long weekend and suffice to say we found the front desk staff highly incompetent and clueless when it comes to assisting, simply they were not attentive enough. We originally booked the budget room but were forced to upgrade once we saw the size and location of the room (the curtain looked like table linen and window facing a dirty wall). We liked our west wing studio room however it wasnt very clean for example i noticed pubic hairs and a few stains in the bath and our tea cups had crust on the rim. Overall it was a good location and if ur not worried about service and you're into no frills accomodation then this is the hotel 4 u!", "title": "Decent room/ incompetent staff", "helpfulness": 1, "user": "ciaobella_bambina", "date": "April 18, 2006", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 1.0}, "id": 4984775}, {"rating": 2.0, "title": "Good location....", "text": "Room very dark (which perhaps was a good thing) although the hotel was in a pretty central location, I wouldn't stay here again.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "April 2, 2006", "id": 4828568}, {"rating": 4.0, "title": "Good Location, Friendly Staff", "text": "Me and my husband stayed here for 7 nights in December 2005 when we got married in the botanic gradens in the city. The location is excellent near the Crown Casino, tram stops, small shop and internet cafe, my husband loved the Anzac biscuits provided with the tea and coffee in the room! We booked a deluxe room which was nice and included breakfast which was delicious. The staff were also very friendly and helpful. Overall, this hotel is excellent value for money and I would recommend to anyone visiting the area.", "helpfulness": 1, "user": "jen83", "date": "March 30, 2006", "id": 4775479}, {"rating": 3.0, "stay_parameters": "Stayed March 2006", "text": "My husband and I had three nights at the Enterprize during the recent Melbourne Commonwealth Games. We had booked the Business Rooms which were on the 3rd Floor. We found the room small but very comfortable and clean. We couldn't find the TV remote but we were glued to the Games events and weren't channel surfing! They have cable stations if you prefer. The bathroom was just fine with a large tub - the shower was a little problematic with the floor getting soaked with each shower, so stick with the bath. The staff were courteous and efficient and there is a large storeroom to store luggage on the day of departure. We didn't try the restaurant but this is Melbourne and a 1 minute walk in any direction gives you lots of breakfast options. Great for anyone needing to be close to Southern Cross Station or the Telstra Dome. 10 minute walk gets you into the centre of the city. A good choice if you are on a budget.", "title": "Very Good Value", "helpfulness": 3, "user": "lucindaarmour", "date": "March 25, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 4732881}, {"rating": 3.0, "stay_parameters": "Stayed March 2006", "text": "We stayed at the hotel for two nights after flying in from Los Angeles. The hotel is in a good location if you don't have a car. It is almost acros the street from the train station, and just a few blocks from where the Skybus depot is. The hotel is certainly a little old and no frills, but we thought it had some character. The room was clean and in decent shape. The shower curtain does tend to creep in on you, but if you leave the curtain open near the back to let the air flow through, you won't have a problem. We had no problem with the staff at the front desk, and everyone seemed friendly enough. We certainly felt that we had a decent room for the price we paid, which was about $85AUD a night. There is an internet cafe next door and a convenience store just down the street.", "title": "Good room for the right price", "helpfulness": 2, "user": "Kkelly74", "date": "March 20, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 4717283}, {"rating": 2.0, "stay_parameters": "Stayed March 2005", "text": "We booked at the Enterprize for 2 nights to have some fun in the city without having to worry about driving home, but decided to head home after the first night! The hotel lobby was OK, but it went downhill from there. There was an air conditioner in the room which was loud enough to stop you sleeping, and the bed was like sleeping in a sagging pit. We didnt have any interaction with the staff so cant say much there, but the hotel just felt run down and neglected. If you don't mind a budget type hotel I guess it's OK, but I wouldn't recommend it. Good location though.", "title": "Not too good", "helpfulness": 3, "user": "traveldrMelbourne", "date": "March 18, 2006", "detail_rating": {"cleanliness": 2.0, "rooms": 2.0, "value": 2.0}, "id": 4690878}, {"rating": 1.0, "title": "hotel enterprize", "text": "Worst hotel i have ever had the displeasure of staying at. We stayed in the deluxe rooms and all i can say is that i would hate to see the budget rooms. When we first entered the room we were quite shocked that the carpet looked like it hadn't been cleaned in years, the bed covers had stains all over them, the shower didn't spray enough water to wet your face, the tub was tiny and the shower curtain had to rest against you the whole time you showered, the toilet had a great magnet door stop right in front of it so you could keep banging your foot on it if you weren't concentrating, the foot of the beds had wooden spike looking things hanging out the end of them that actually busted the skin on your shins if you happened to bump against them. Little things that other hotels provide such as pamphlets extra cups etc.. were non existent (probably to save a few extra cents). If you spoke english you were at a disadvantage as most of the staff that we met just replided 'don't speek english' if you required assistance. I will never return to this hotel.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "February 6, 2006", "id": 4416608}], "location": {"country": "Australia", "continent": "South Pacific", "city": "Melbourne"}, "stars": 3.5, "variance": {"poor": 83, "average": 131, "very good": 107, "terrible": 109, "excellent": 26}, "aka": "Enterprize Hotel Melbourne", "slim_ranking": 0.825842696629, "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.5, "location": 4.5}, "description": "The Great Southern Hotel Melbourne provides the perfect location for both the tourist and business client alike, at a very affordable price, placing you within extremely close proximity to all the wonderful Melbourne attractions. This amenable Melbourne City Hotel is located minutes from the Southern Cross Station and interstate Bus and Train Terminal and a short drive from Melbourne Airport. The Great Southern Hotel comprises 2 separate sections - both dedicated to the business/leisure client featuring Superior rooms; while the New Standard rooms and Classic rooms overlook a spacious courtyard - a virtual oasis in Melbourne's CBD. Situated within close proximity to the Crown Casino and Entertainment complex, Melbourne Aquarium, Melbourne Exhibition and Convention Centre, Etihad Stadium and Southbank. Trams and public transport virtually at the door providing easy access to all that Melbourne has to offer. Wifi available at an additional cost. Hot buffet breakfast is available at a cost of $20 per person (served between 6:30am to 10:00am) Porter service is not available, however Luggage storage is available at a cost of $2 per bag per day. Additional administration fee applies when making payment via credit card to settle incidentals during check out. Great Southern Hotel is a smoke free property with no smoking permitted in guest rooms. This Hotel does not cater to bookings of unaccompanied minors under the age of 18 years. ***Currently there are refurbishments in the courtyard section, power tools and machinery will be in use between 10am and 4pm. There will be noise inconvenience during these times***"}