{"user_rating": 4.0, "review_count": 1155, "name": "The Mills House Wyndham Grand Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "Stayed one night with wife and older teenager on a mixed business trip plus College of Charleston orientation. Got rate through Priceline ($80). Rooms were normal sized but very nicely appointed and ours came with view towards Mt Pleasant and view of Fort Sumter and the bridge - nice treat. Room was clean and comfortable with nice chairs and free wifi. Room did not come with breakfast but plenty of places nearby. Enjoyed cocktails in the garden bar. Staff was efficient and businesslike but not outwardly friendly. . Very easy to walk to anywhere in the historic district, just three blocks towards the Battery from Market. We visit Charleston a lot and this stay was a treat. Had dinner at Blossum (walk - four blocks) and breakfast at the Hominy Grill (drive or walk the 3/4 mile)- thumbs up to both. Keep in mind parking is $20/day - so add to room price if you are shopping prices", "title": "Nice grand hotel", "helpfulness": 4, "user": "RichardSoutheast", "date": "July 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 35613813}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "I booked my stay through Hotwire so I got a really good deal. My son and I were in town for a tour of the College of Charleston. The hotel was very clean and well appointed. The staff was helpful for the most part. The older valet was especially nice. The biggest problem we had was parking. When we arrived the side street was closed due to construction which made parking for unloading impossible. We had to circle the block several times before we could get enough room to unload. This wasn't the fault of the hotel but just very inconvenient. We did use valet parking.The location of the hotel couldn't be better. I had trouble logging on to the internet but called the desk and they connected me to internet support. They weren't very friendly but did fix the problem. We ate breakfast at the hotel. Very expensive! I would definitely stay here again if I could get the same deal through Hotwire. Wouldn't stay there for full price.", "title": "Historic Charleston", "helpfulness": 2, "user": "LynnSC", "date": "July 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 34911961}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "We stayed at the Mill House Inn June 25-28. Everything about our stay was great. The location is excellent for walking to both King St and to Vendue Range for access to the Waterfront Park. Every member of the staff was courteous and helpful. Room was clean and had everything you could want, even though it was a tad on the small side. If you have several people in your party this could be problem. The POOL was the best part! While we were in Charleston it was in the mid 90's with 90%+ humidity. It was wonderful to be able to come back to the hotel and cool off in the pool. The shallow end was a bit small, but it really didnt matter, my son was in it for hours at a time anyway. The restaurant, bar and patio areas were very charming. If you want to get out and grab breakfast, I recommend a small restaurant on Meeting St, two blocks up from the hotel (toward Market Streets) called TOAST. Excellent food, cheap, fast service and the place was spotless. We tried Josephs, but found it to be very dirty and my sons eggs were so overcooked they could have bounced. Plus no oatmeal!!! The hotel does have a very small fitness center on the second floor but it had only a treadmill, an eliptical and a recumbent bike which had the seat bolted so you couldnt move it!!! No weights, medicine balls etc. Ive come to the conclusion that Charleston is not a very athletic town. If you want a serious workout you may want to check with local gyms to see if they will offer a day membership. Overall we had a perfect stay at the Mill House and would recommend it to anyone, but especially to those with children who would like a pool.", "title": "Great Stay, great pool!", "helpfulness": 1, "user": "runner4", "date": "July 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 33654374}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "You could not find a hotel in this area more \"Charleston\" than this hotel. It was built in the mid 1800's thus the rooms are small, but that is how they were built then. You are staying in an historic district, expections should follow and it is nice to stay in something not built of concrete and glass. Period furniture and decor just enhance the ambiance. If you want a regular Holiday Inn, go down the street away from the district, there is a brand spanking new Holiday Inn there at Calhoun and Meeting, enjoy yourself. I like feeling like I am in the historic district. The dining room is totally charming and the food is good. If you want a cheaper breakfast, go a block north to Joseph's, they only serve breakfast and lunch and the food is southern! The bells ring every 15 minutes from St Michaels Church, just as they have for how many centuries. You can't hear that when you stay away from this district. The hotel staff was courteous. They have exceptional concierge service. I just feel that if I had stayed anywhere else that the charm of this historic district would have been lost. To visit it is one thing, to live in it is another. I will stay here again without fail. The summer can be hot and very humid here, I am from Arizona and SC is not a dry heat at all. The humidity is substantial. This property has wonderful a/c and the second you walk in the door, the relief is wonderful.", "title": "PURE Charleston", "user": "jp85715", "date": "June 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 33010175}, {"rating": 4.0, "title": "Great location, comfortable room", "text": "I recently spent 2 nights at the Mills House. This was my second visit. I booked thru Hotwire and got a great rate. The sevice was excellent. I requested a room near the pool and got a room that opened on to the deck area near the pool. Perfect location. The room was comfortable. I could not get the internet to work, the hotel offers free wireless but for some reason I could not log on. NO worries, I used the business center to print my boarding passes.", "user": "eggtmt", "date": "June 21, 2009", "id": 32831495}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Just returned from three nights at the Mills House. First time traveling with the kids to a place that didn't include a small rodent and friends. I chose the Mills House over other hotels because I knew my kids could take only so much history before they would need to cool off and relax. A nice size pool was my only absolute criteria. Many of the nicer hotels in Charleston don't have pools, are not in the historic district or are more upscale than I was looking for with my kids. I wanted a hotel with a pool, in the historic district that was kid friendly and the Mills House was a perfect fit!", "title": "Worked for My Family!", "helpfulness": 1, "user": "southjerseymom", "date": "June 20, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 32750164}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "We upgraded to a poolside room and were very happy we did. I knew going in that amenities such as large bathrooms and spacious rooms were not possible in this historic hotel so we loved the outside private terrace. The kids could walk right out the door and hop in the pool while we enjoyed an adult beverage on our patio and still kept an eye on them Perfect.", "title": "OK", "user": "JDK5", "date": "June 15, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 32335377}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Beds were comfortable. Bathroom was tiny but upgraded with granite etc. We dealt with it for the three nights with four people so it was fine. The room next to us had some drama both in their room and on their patio which marred an otherwise perfect visit but that was not the hotel's fault and they did a fine job of keeping an eye on things. Housekeeping delivered towels promptly and kept our room clean. The rest of the staff including servers, bellmen, valets, pool cleaners and the concierge were all very friendly and provided excellent service with a smile.", "title": "One of the worst hotels ever", "helpfulness": 2, "user": "seahorizon", "date": "June 11, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 32135475}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "The location can't be beat! We were able to easily walk to the Market, Waterfront Park and stroll the quiet streets down to the Battery. It really is a wonderful location.", "title": "Excellence!!!!", "user": "Cjoins4165", "date": "June 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 31313158}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled solo", "text": "All and all I would highly recommend the Mills House to anyone traveling with children or first time visitors to Charleston. If you are looking for ultra posh then another hotel may be better. But for us our stay was enhanced by the amenities and location of this great historic hotel.", "title": "Adequate", "user": "Sunnybird", "date": "May 31, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 31244873}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Normally we stay in hotels in a different price bracket to the Mills House but through Hotwire we scored the Mills house at a not outrageous price. The valets were helpful when we arrived and directed us to the self parking with a smile. Front desk staff were nice and helpful throughout our stay. The room was certainly no bigger than most we have stayed in and smaller than some. It was nicely furnished and had lovely comfortable pillows. The Mills house is handy to many eating spots in the neighborhood. The only small problem was when we left the window open and were woken by the garbage collection truck at 4am.", "title": "An upscale stay in Charleston", "user": "qwill", "date": "May 31, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 162561388}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The Mills House is apparently a historic landmark, which must explain the over-the-top attempt at turn of the century southern genteel luxury. If that kind of decor is your preference then you will love The Mills. If you are looking for updated, convenient accommodations you might consider looking elsewhere. For what it is worth, the average age of fellow guests was 50+ by my estimation.", "title": "Quaint southern decadence (if you're into that)", "user": "Neall007", "date": "May 31, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 162513405}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "We stayed in room 620. It was on the corner of the building, and because of the small size we received a great rate ($150/night). For that price this is a very good choice. For the standard room rates I think you could find something better.", "title": "very lovely and updated", "helpfulness": 1, "user": "drudol", "date": "May 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 162161951}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The Mills House Inn is a lovely \"historic hotel\" centrally located in the historic district of Charleston. You can walk to most attractions such as the City Market, Waterfront Park, Battery. King Street is one street over for those who want to shop. There are lots of very good restaurants nearby such as Husk, 82 Queen & Poogans are located next door on Queen St. Toast,a good place for breakfast, is a few doors down on Meeting St. The lobby area is very nice and has a nice sitting room as you enter the hotel. There is also a bar as well as a restaurant on site with a lovely patio for dining. The hotel has a business center with 2 computers and printers. Check in and out was easy and quick. The employees at the Mills House are very friendly and helpful.", "title": "great location in historic district", "user": "bbeerbower", "date": "June 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 163522248}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "The doormen were helpful with luggage. There is a full time concierge who was very helpful with good suggestions on what to see as well as directions. The most important things I look for in a hotel are location, clean rooms & comfortable beds. The Mills House rated a 5 in all of these areas. Our room was average in size but most important it was clean as was the bathroom. The bed was comfortable. and free internet. The Mills House is a very good choice and when I am in the Charleston area I will definitely stay here.", "title": "Great Charleston location.", "helpfulness": 1, "user": "willkiam", "date": "June 9, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 163429779}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Tip 1: The hotel has valet parking for $22 but there is a public city parking deck behind the hotel which is $20 a day. There is a walkway from the hotel to the parking deck.", "title": "Wonderful Experience", "user": "John E", "date": "June 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163289002}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The Mills House is a great spot to stay for a weekend in Charleston. It's close to everything. We didn't need to use our car the whole time we were there.", "title": "Great location, charming southern feel", "user": "elh", "date": "July 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70543643}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled solo", "text": "The lobby is charming. They have a fountain right outside, plenty of places to cool off or rest in between activities. There is a pool and plenty of places to relax outside in the early morning or evening when it's not eight thousand degrees out.", "title": "Great location. Classic charm.", "user": "frequenttraveler222", "date": "July 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 70330849}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The rooms are as expected- clean and adequate. I wish they had refrigerators in the room, but besides that, the rooms were great. We actually had a corner room which they mentioned would be a bit smaller than other rooms, but had a great view of the town and the water.", "title": "Very Classy!", "user": "lovestravel10", "date": "July 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69833222}, {"rating": 1.0, "title": "Bait and Switch", "text": "You do have to pay the valet to park ($22 a day with in and out privileges) or park in the attached public garage ($20 a day with no in and out privileges). However, like mentioned in three days, we did not use our car once.", "user": "Passport1006", "date": "July 4, 2010", "id": 69660149}, {"rating": 5.0, "stay_parameters": "Stayed June 2010", "text": "Stayed one night here via Priceline and was glad I got this room. It was a nice spot in historic Charleston. The hotel itself was decorated very nicely. The room was a bit small but this is to be expected in historic buildings. Parking was in the public lot behind the hotel and got crowded during the work day but there was a nice walkway directly to the hotel's 2nd floor. Really nice patio area that seemed like it would be relaxing and pleasant but I didn't have time to sit out there. Front desk was helpful as well.", "title": "This hotel is elegant, the staff is fantastic and our event was fabulous.", "user": "water18", "date": "July 2, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 69462924}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The worst upscale hotel I have ever stayed in. I thought I had gotten an upgraded room. upon check-in found this wasn't true. When I asked for another room, I was told what I had was \"pretty much it.\" Also upon checking-in, I found a card by the bed that said there were firmer pillows available upon request. When I called down to get another pillow, I was told that only one kind was available. I was told that she didn't know why the put that card in the room. The concierge was rude and very unhelpful to the point that she began lecturing my wife like she was a 5 year old. We were forced to make our own reservations for dinner and a tour. The valet parking was a joke. It took an average of 20-25 minutes to get our car when we could find some at the stand. I wrote a letter to the manager expressing my problems with his hotel. To date there has been the silence I would expect from such a classless organization. This hotel is nothing more than an overpriced Holiday Inn with a nice lobby. Don't stay there!", "title": "Avoid this hotel like yellow fever.", "helpfulness": 3, "user": "mjrwjr", "date": "July 31, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 36322133}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "If you only care about location, well go for this place. It lies in heart of the city, so it seems for a tourist at least. I got a deal through hotwire (157$) and was rather satisifed, until I found out breakfast was not included. In other words, I did not get a very good deal at all. The room was like any other hotel room at a decent hotel, nothing much special about it. The lobby was just wonderful, it was \"gold and glitter\" everywhere, and it was nice to have a bath in the small pool too.", "title": "Great location", "helpfulness": 3, "user": "OnklReisendeMac", "date": "July 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 36108246}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "To sum up, if I had seen this hotel before I stayed there, I would not have paid as much as I did. If you get a good deal (no more than 100$ for a regular room I would say) WITH breakfast, then this place is probably just great.", "title": "Perfect ly located in the Historical District", "helpfulness": 1, "user": "madrose", "date": "July 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 36082870}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "PS parking costs 23$ a night.", "title": "Great Location and nice hotel", "helpfulness": 3, "user": "keithshoe34", "date": "July 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 35759675}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We got a good rate for this splendid hotel on Hotwire. We were based in Davinport Florida and drove up to Charleston for one night to see the city.", "title": "Wish we could have stayed longer", "helpfulness": 1, "user": "yournobetter", "date": "July 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35668506}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Very lovely hotel and such wonderful reception. Both Rob & Ross at reception desk takes it to the next level in hospitality. Two very charming, gracious and extremely helpful representatives of this fine hotel. A credit to the manager who hired them.", "title": "Grand Hotel", "user": "Jacqueline093", "date": "June 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 162853121}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Lobby and surrounding areas very attractive, especially the outdoor garden. You can see the attention to detail. However, would have liked to see the same attention to detail in the bedroom and bathroom. Needs a little updating and cleaning. Overall, a great place to stay and location very central.", "title": "No", "helpfulness": 1, "user": "rod B", "date": "June 2, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 162734876}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "This property was recommended by an out of state resort that we love (OEI) so we booked.", "title": "Very nice hotel in a Great Location", "helpfulness": 1, "user": "BarryAZ", "date": "June 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 162704715}, {"rating": 1.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "PROS- Location and front desk manager Rob Weil.", "title": "Miniscule Room and Dilapidated Furniture", "user": "ShopHunter", "date": "June 1, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 3.0}, "id": 162654231}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "We deicided to stay here, because we had stayed here before, and the price was better than any of the other places we were considering. Still, at $200 per night, I found the rooms to be in need of some refurbishment. There wasn't sufficient light in the bathroom to even put on my contact lenses. The TV cabinet was dusty.", "title": "Lovely Charleston", "user": "BackTooSoon", "date": "August 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 74347768}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "That said, it is an attractive property with a nice pool area and bar area. There is also a very nice courtyard off the bar where we had breakfast. It is centrally located, and there is a convenient parking garage attached to the hotel that is accessed by a walk-way.", "title": "Southern Hospitality and Charm", "user": "emileec", "date": "August 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 73851461}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "Everything was clean, nicely decorated and open. The staff was warm, friendly and helpful. It was a pleasure to stay there and we would do it again. We were comfortable and within walking distance of everything we wanted to visit. The historic setting was very pleasant and this small town is a hidden treasure of South Carolina.", "title": "Charming - good location - good value", "user": "BillyMcKay", "date": "August 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 73750184}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "Able to walk to everything in historic district. Lobby was charming - better than you'd expect at a Holiday Inn. Rooms were fine, but you don't come to this part of town to stay in your hotel room.", "title": "Great hotel, great location!", "user": "aroundtheworldin60da", "date": "August 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 73533978}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "Folks were very friendly at restaurants. A couple of the bars we visited had bartenders with a bit \"too cool\" attitude. I live in Toronto, so I don't need to travel if I wanted bartender attitude.", "title": "Good location but...", "user": "Ojem", "date": "August 2, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 73501738}, {"rating": 5.0, "stay_parameters": "Stayed June 2010", "text": "I along with six of my family members aged 5-65 stayed at the Mills house on June 14th. The staff went above and beyond to anticipate our needs and accommodate them. I stayed in a room overlooking the courtyard and the view wast outstanding and the room itself was lovely. Before I set out sight seeing, I stopped in the gift shop and the woman working behind the counter was a wealth of information about the city and the sights I shouldn't miss. My experience at the Mills House was fabulous, I can't imagine staying anywhere else in Charleston.", "title": "The Mills House is the epitome of Charlestonian elegance and old world charm.", "helpfulness": 1, "user": "3lilstinkers", "date": "June 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68539300}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We just returned from two nights at the Mills House and were completely happy with our experience. We were fortunate to get the hotel from Hotwire so we paid less than half of the normal price. The public areas are beautiful. While the room was just your basic hotel room, it was up-to-date. The beds and pillows were good. The staff was courteous and helpful. The bellman offered to bring us up a refrigerator free of charge. You have to pay for parking but we found the valet parking of $22 a day, with unlimited in and out, worth it. The location is perfect - right in the middle of the historic area and just down the street from great dining. The courtyard in the evening was fabulous. This was our first trip to Charleston, but it won't be our last. Mills House will definitely be our destination next time.", "title": "Perfect location", "user": "tnpatti", "date": "June 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 67847151}, {"rating": 2.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "While the location is great, the hotel itself is not. The rooms are small and the bathrooms are even smaller. The room amenities are weak- old televisions, poor wi-fi - even the coffee maker is cheap. I wouldn't return", "title": "Disappointed", "user": "Retiredandhappy064", "date": "June 16, 2010", "detail_rating": {"value": 3.0, "sleep": 2.0, "location": 4.0, "service": 2.0, "rooms": 1.0}, "id": 67734586}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Shades of the Old South still hover over the Mills House. From the courtesy of the staff to the coolness of the fountained courtyard, you feel you have stepped back in time. My wife and I felt totally at home durring our stay and enjoyed every minute of it. Sitting on the balcony overlooking Queen St. you could easily forget it was 2010 and find your mind wandering the cobled streets of Old Charleston or, just as fantastic, Casablanca of the 1930's. I would reccomend a stay at the Mills House and a visit to Historic Charleston to anyone. A private carriage ride through Old Charleston followed by an intimate dinner for two in the Barbados Lounge will indeed give any man Brownie Points with his Missus.", "title": "The Old South Lives", "helpfulness": 1, "user": "Hanko54", "date": "June 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67208505}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "This was our second stay at The Mills House and it was a treat once again. We booked through Hotwire, so a great value as well. This hotel is ideally located....so close to everything, you can just park your car & walk where you need to. The rooms are not huge, but are very nicely decorated and clean. The pool area is beautiful and great for an afternoon swim after a steamy day. Take some time to sit in the courtyard, it is lovely there in the evening. Not sure if this is a coincidence, but this is the 2nd time we have booked through Hotwire, and both times we've been assigned rooms near the elevator & Ice machine...I thought this might disrupt our sleep, but it turned out to be ok. Not sure if they give the less-desirable rooms to the cut-rate customers? But regardless, it was still a great value. Spend a little extra and have breakfast in the courtyard....it is a real treat. All of the staff go out of their way to be helpful and friendly! Overall, a wonderful stay and we will be back!", "title": "Another great stay!", "user": "charlestonchick", "date": "June 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 67175177}, {"rating": 4.0, "title": "Wish we would have received a warmer greeting at registratio.", "text": "You know, when you've traveled hours to get to your destination a \"Welcome to the Mill House\" or \"Good Afternoon\" but unfortunately the young girl hardly smiled and did not greet me. Isn't that like customer service 101? However, with that being said, our valet and bellhop Hollaway was awesome. He was personable, helpful, and made up for the lack of personality at the front desk. The rooms were really small but cute. The beds were pretty narrow for queens but actually really comfy.To get to any fun you have to walk a few blocks but it wasn't too bad since there is so much to look at.", "user": "beckaroo8", "date": "August 1, 2010", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 73251372}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled solo", "text": "Even though the hotel during my stay was quite expensive, my room was a bit smelly and I there was a constant piercing noise from the AC which didn’t let me sleep the whole night. Furthermore, I could hear my neighbours talking and even moving around. However, the location is most advantageous, the entrance hall is very grand and the garden area is beautiful.", "title": "very good location, but..", "user": "lori05", "date": "July 27, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 72588940}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "A bit annoying was that to retrieve my car (valet parking) it took more than 30 min. but this was maybe because I stayed on a busy weekend.", "title": "Great Location - Nice Hotel", "user": "mfreeze", "date": "July 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 72100633}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We visited the Mills House for two nights, July 20 & 21, 2010. Curbside attendance is a bit hectic as the hotel staff is, by their own admission, short on personnel. Check-in went very smoothly and the desk personnel were very nice and accommodating. We were automatically upgraded as a benefit of our Priority Club membership with Holiday Inn. The room was on the small side for two people, but very nicely decorated. The bed was very comfortable and we had a nice view of the street in front of the hotel. The only downside to the room (and really the whole hotel) was that the bathroom floor was not at all clean when we arrived. It honestly looked lie they had forgotten to clean it. However, that is about the only bad thing about our stay. The hotel is a couple of blocks south of all the main action, but after you see the crowds and masses of traffic, you'll be glad you stayed a little further from the hub. All of the popular dining locations, attractions, and the city market are within easy walking distance. I'd also recommend the Barbadoes Lounge for a few drinks after dinner. We had an overall great experience and will visit the Mills House again on our next visit.", "title": "Perfect location, awesome hotel", "user": "jescowhite", "date": "July 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 71666216}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "My wife and I stayed at the Mills House July 11-15 for our summer vacation. It was our first trip to Charleston and I was amazed at the location of this hotel. Restaurants, shopping and most sites are all within walking distance. Parking is either valet or self park. We chose self parking. It was $20/day. We didn't use our car much, so we didn't see the need for valet. The pool is very nice. The courtyard is beautifully landscaped and is a great place to eat breakfast in the morning or have a drink in the evening. The hotel is very close to some great places for breakfast (Brent's, Fast and French, Toast, etc.) as well as being next to 82 Queen, which I highly recommend for lunch or dinner. We ate breakfast in the hotel's restaurant one morning and it was very good (I recommend the shrimp and grits for breakfast). To be such a nice hotel, I thought the prices for breakfast were great ($7-$12/person). Our room was decorated nicely and was very spacious. We were surprised to see the hotel provided Coconut Lime Verbena toiletries from Bath & Body Works, which was a nice touch. The bed was really comfortable also. The only complaint I have is that if your room is at the back of the hotel near the parking garage, you will hear a garbage truck or delivery truck very early in the morning and it will probably wake you up, but I always went right back to sleep. Our room was always very comfortable. The air conditioning felt amazing after being out in the heat. General Robert E. Lee used the hotel as his headquarters at one point during the Civil War, so it has some history to it. If you're looking for a place that's close to everything, I highly recommend the Mills House. I really don't see how anyone could be disappointed with this hotel.", "title": "Beautiful Rooms & Staff", "user": "beerbug", "date": "July 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71515519}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Historical and georgeous building, beaytiful art everywhere, central to everything downtown Charleston and the staff is the best to be found anywhere! Great food, clean, quiet, well-appointed and comfortable rooms - outside dining, a great pool, and the bar is regal and inviting. I plan to stay at this hotel every time I visit Charleston!", "title": "A perfect hotel in the heart of Charleston!", "user": "PauloIRW", "date": "June 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163217310}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "This historic hotel located on the corner of Meeting & Queen is next door to Husk, Poogan's Porch & 82 Queen, all excellent restaurants & a short walk to Eli's Table, a small farm to table cafe we fell in love with. The Gibbes Art Museum is within several blocks & the City Market in walking distance as well.", "title": "Excellent value,location & ambiance", "helpfulness": 1, "user": "Nancy A", "date": "June 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 163068310}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Everything was perfect or nearly so. Charming renovation of an antebellum building. Tremendous value for the budget conscious. Tops in service at reception, room, room service, restaurant, bar.our room was on the top floor with panoramic views of the city, harbor, Ft. Sumter. Located in the middle of everything. Don't miss it.", "title": "Excellent value and service", "helpfulness": 1, "user": "stewartsdad", "date": "June 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 163025477}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "the hotel is very nice, our room was big and on a corner. bathroom needs renovation. Staff at the front desk were rude and the valet boys seems are on holidays.", "title": "nice hotel, bad staff", "helpfulness": 1, "user": "marco.to", "date": "September 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 1.0, "rooms": 5.0}, "id": 40090080}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Our third stay here and still love it! Staff is extremely friendly and helpful. Room is a little small but we don't care..everything else is wonderful.", "title": "Beautiful Hotel", "helpfulness": 1, "user": "Medic2430", "date": "August 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39104187}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Spent three nights in Charleston at the Mills House with husband and 9 year old. Would recommend highly - no usual Holiday Inn \"average-ness\". Indeed, the Holiday Inn logo / branding is hard to spot anywhere. Location would be hard to beat - in the very heart of Downtown. Very pleasant communal areas, great little outdoor pool and terrace. We stayed using our Priority Points so can't comment on rates - we were also upgraded to the Exec Floor. The room wasn't generously proportioned as the building is quite old (but this is stressed on their website). It was well appointed, tasteful and clean. Each floor has ice machines and free soda vending - a pleasant surprise. Staff chatty, helpful and knowledgeable about local sights/restaurants etc. We would really recommend a trip to Boone Hall Plantation. The Buccaneer in Charleston is great for seafood, prime rib etc. 20 bucks per day for parking at the hotel isn't ideal but it's the price you pay for being in right in the centre of a compact city. We just used the public car park next door, not the valet. It really wasn't a big deal. So if you're planning a few days in this beautiful city, I would recommend this hotel very highly . . . and I am hard to please!", "title": "Holiday Inn's Best Kept Secret", "helpfulness": 1, "user": "emmalittleb", "date": "August 25, 2009", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38804466}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "This hotel is very elegant and in a great location. We had a blast exploring the hotel late on a Sunday night when the rest of the city was asleep. Charming layout- the terrace, patio and bar look straight out of a scene from the Titanic. Most comfortable pillows I've ever slept on (wanted to take one home with me!).", "title": "Beautiful historical hotel with Southern charm.", "helpfulness": 1, "user": "GlutenFreeFlying", "date": "August 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 38782330}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The service was excellent, especially when we ran into a parking snafoo. Have already recommended to several people.", "title": "wonderful", "helpfulness": 3, "user": "ncbosoxfan", "date": "August 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 37797998}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 70, "average": 135, "very good": 413, "terrible": 28, "excellent": 509}, "aka": "Mill House Charleston", "slim_ranking": 0.5, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 5.0}}