{"user_rating": 4.0, "review_count": 259, "name": "The Castle at Taunton", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "My family and I had lunch at the Castle restaurant on Sunday for my son's birthday. We had never been before but had heard of its reputation with previous top chefs working there. On entering the hotel lobby we had no idea where to go. The place was deserted. I went over to reception but the receptionist was on the phone. My husband then went into a small bar where he found one member of staff serving a couple, the only other people in the bar. She took our name and said we could have a drink here before going through to the dining room. Our table had been booked for 1.30, the only time available at the time of phoning but I find this puzzling as the place was so quiet. We waited quite a while for our drink orders to be taken - first choice of draught beer for my son was off so he was offered Tribute which he accepted. The staff memebr had to go somewhere else for this, I don't know why but she was gone some time. My husband and I ordered orange juice, again she had to leave the bar to get a jug of orange juice! Eventually our drinks were served and we were offered the menus. Finally at 1.55 we decided to go to our table as the bar staff member had disappeared and we were left on our own. Once in the restaurant the staff were excellent. The food was good although we did pass commnet on the roast potatoes which were horrible. Huge potatoes with tough skins and very dry inside. It is a shame that our initital experience was not positive but I do feel front of house staff need to be a little more attentive when people arrive. Not sure that we will return which is a shame because the restaurant staff were trying very hard and the chef is obviously very talented but when I go out for a special meal I expect a little more than what the Castle was offering.", "title": "Lack of welcome", "helpfulness": 1, "user": "Gemima", "date": "December 10, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0}, "id": 147102338}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "A group of friends and I have just had the most beautiful evening, including a top class, four course meal with all the Christmas trimmings and excellent service. Originally I had organised a meal for there dining area in Brazz but on them finding this was not available they excelled themselves by offering to host us in the Penthouse suite. The waiter was both professional and friendly and our surroundings were used to there full potential making it feel like a very special evening.", "title": "Christmas meal", "helpfulness": 1, "user": "Nick M", "date": "December 6, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 146886084}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "We held a retirement dinner for a colleague at the Castle Hotel, with a number of guests staying at the hotel overnight.. Arrangements started back in october, with an excellent and friendly service from the Conference and Events team at all stages of planning.", "title": "Fabulous, Friendly & Efficient", "user": "Dawn-Pimm", "date": "December 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 146742973}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Everything was perfectly planned, then handed over to the Maitre d, who, along with his team, saw the event through to the end, with nothing being a problem, and a bright friendly manner throughout.", "title": "Comfortable, welcoming and friendly", "user": "John S", "date": "November 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 146475751}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We couldn't have wished for a better team.", "title": "unexciting", "user": "burgermaster007", "date": "November 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 146168819}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "I Spent an evening at this hotel on a business dinner and I also stayed overnight. Excellent location, comfort and great food. If you're staying in Taunton, this hotel is a must, as the level of refinement is first class and you really do feel as though you are in luxury surroundings. I will definitely return.", "title": "Great hotel", "user": "Steve O", "date": "November 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146024287}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "We needed to arrange a training venue for around 25 delegates at a South West location, and were fortunate to find this gem in Taunton.", "title": "Training Conference Success", "user": "Gary G", "date": "November 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 145302264}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "All of the staff were courteous and efficient, and helped to make the event a real success, which delegates rated highly.", "title": "One of the Best 4 star,", "user": "CHRISTINA K", "date": "November 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145100981}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "This venue has a traditional country house hotel feel, much appreciated compared to the corporate chains - the buffet food was outstanding, as was the Music Room we used for the training.", "title": "Traditional Hotel", "user": "Charlie6126", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 144588251}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Definitely one of the best 4 star hotels in fact it is the best 4 star I have had the pleasure of staying in.Verging on 5 star...This hotel was fully booked on the night before . I had to check in elsewhere .Fortunately I called in personally the next day just to see the hotel...I was impressed with the rooms shown to me.There were 3, all good, but the one I chose to stay in was most impressive.Also the favourite of the lovely receptionist who gave me the tour.After seeing the room I booked in for my extra night in Taunton.If the hotel had not been up to par I was going to drive home early...A 5 hour long wet drive North up the motorway was not inviting but far better . than staying in inferior accomodation...I was so pleased I chose this hotel.The service was excellent from every member of staff..It was late in the evening I ordered dinner in my room.Room service dinner can leave much to be desired.. A few meals in other hotels have had to be banished to the corridor with an accompanying telephone complaint to the restaurant.. ....not so at The Castle Taunton..5 stars should be awarded to the chef..", "title": "Great place to stay in Taunton and definitely worth a vist", "user": "SiandZoeLondon", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144548660}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "We had our Wedding Evening Party at the Castle and the service we received from Marc,Aimee and the team was second to none.Right from the off set with the initial plans we found we had the best service and we knew we had chosen the right place we needed to make our evening special.On the night the food and service were excellent and lots of our guests are still talking about the food now!", "title": "First Class", "user": "Ian B", "date": "October 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142199214}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "We wouldn't hesitate to visit again,we will be back.", "title": "Excellent", "helpfulness": 1, "user": "S D", "date": "October 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141815042}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "All the guests thought the stay at The Castle was excellent and we were very well looked after.", "title": "FANTASTIC! from start to finish - the staff at this hotel could not do anymore for you, the customer service was excellent!", "helpfulness": 1, "user": "smh82", "date": "September 23, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 140992364}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The dinner in the Wisteria Room was very well managed and the food and service outstanding.", "title": "Castle Hotel Taunton", "user": "lornaphil", "date": "September 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 140492291}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "I am sure we’ll all be back there soon.", "title": "Certainly not what it was!", "helpfulness": 1, "user": "Hungry_Horace_Surrey", "date": "September 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 139890122}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Stayed for Niece's wedding and all I can say is what an excellent Hotel, one of the best I have ever stayed in. The staff were so helpful and the rooms excellent. Nothing was to much troubleand I would recommend this hotel unreservedly. I can't think of a negative other than we should have stayed longer.", "title": "should have stayed longer", "user": "madmike65", "date": "October 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143993643}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "We were slightly disappointed with the food, as we had great expectations . Rather over priced and steaks were tough. However the staff were very attentive and professional and the dining room was very comfortable.", "title": "The Restaurant", "user": "J B", "date": "October 29, 2012", "detail_rating": {"value": 3.0, "location": 5.0, "service": 5.0}, "id": 143972758}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "My wife and I have been staying at the Castle Hotel for many years and have seen many changes in this time .", "title": "A wonderful New Restaurant at the Castle Hotel Taunton", "user": "Broxwood", "date": "October 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143674732}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "During our most recent we received our usual very warm welcome on arrival from the staff and , on this occasion, the very charming and professional new General Manager Marc Mac Closkey . Our room was perfect , with a beautiful view of the garden but the real surprise and delight was the new Castle Bow Bar and Grill , which has replaced what used to be the billiard room .", "title": "Blissful wisteria covered Battlements", "user": "Zanzibarvale", "date": "October 24, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 143599736}, {"rating": 3.0, "stay_parameters": "Stayed October 2012", "text": "Brixham Scallops and Wild Quantock Hill Rabbit were followed by Hampshire Partridge and Line Caught Grey Mullet and all were just superb.", "title": "Great ancient luxury but poor basics made for bad experience- hygiene & customer 1st service", "helpfulness": 2, "user": "GWsaltford", "date": "October 14, 2012", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 142757440}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 9, "average": 41, "very good": 100, "terrible": 14, "excellent": 95}, "aka": "The Castle At Taunton Hotel Taunton", "slim_ranking": 0.263157894737, "description": "The Castle at Taunton, your hotel in the heart of Somerset. Whether you are exploring the finest landscapes of England's West Country, seeking a wedding or conference venue or looking for fun and exciting holiday activities for the entire family - The Castle Hotel offers unrivaled accommodation with plenty of warm, friendly hospitality to make your West Country business or pleasure visit memorable."}