{"user_rating": 4.0, "review_count": 252, "name": "The Comfort Inn & Suites Anaheim, Disneyland Resort", "reviews": [{"rating": 4.0, "title": "Worth the Price", "text": "Our family of four just returned from a trip to Southern California. We stayed at this property for five nights. Ideally, we'd have preferred a property closer to Disneyland. However, for $63.20 plus taxes per night, and the fact that we had a rental car, we felt this worked out well. We had a room on the 5th floor facing the freeway. Freeway noise was never a problem. The room was larger than expected. It appeared the carpets and mattresses were recently replaced or in the process of being replaced. The air conditioning unit was one of the better we've had to deal with because we could actually set a comfortable temperature. No complaints about the housekeeping: our room was cleaned and the bathroom necessities (i.e., towels, soap, and shampoo) were replenished daily. There were also a mini refrigerator and microwave in the room, which came in handy. The Continental breakfast offered make-your-own waffles; a variety of cereals, breads, and fruits; and coffee, tea, milk, and orange and guava juices.", "helpfulness": 8, "user": "Donna I", "date": "June 20, 2006", "id": 5363678}, {"rating": 1.0, "title": "not child friendly", "text": "Disneyland is located about a mile left and on the side of Katella opposite of the property. Because of the median and the close proximity of the driveway to the intersection of Katella and Manchester Avenues, we got to Disneyland in a roundabout way. After making the right turn from the driveway onto Katella, we either drove up a couple of blocks and made a U-turn to go back in the direction of Disneyland, or we made a right onto Manchester and drove around aimlessly until we figured out where we were.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "May 22, 2006", "id": 5187428}, {"rating": 1.0, "stay_parameters": "Stayed April 2006", "text": "The front desk folks were not very friendly, although they were courteous, businesslike, and efficient for check-in and check-out. They also were not very helpful when we asked for directions to other places. Basically, the response was, \"I don't know,\" and was left at that. The property does not have a coin-op laundromat, but there is one two or three doors down from the hotel that's open around 7a.m. to 9 p.m. (last load).", "title": "Disgusting!!", "helpfulness": 5, "user": "calimele", "date": "May 2, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 5026597}, {"rating": 3.0, "title": "Pleasant and clean but nothing special.", "text": "Overall, we were satisfied with our stay. We would consider staying at this property again, unless, of course, something better is available.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "April 22, 2006", "id": 4995485}, {"rating": 3.0, "stay_parameters": "Stayed April 2006", "text": "My family and I were very unhappy with the hotel, there was prostitution going on the", "title": "Comfort Inn & Suites is Decent.", "helpfulness": 4, "user": "4-Lollygaggers", "date": "April 21, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 2.0}, "id": 4993842}, {"rating": 2.0, "title": "Old, Dingy, and Dangerous for Kids", "text": "I stayed here with my husband and my two kids, because we were able to get a room for $67 a night, and all the hotels across the street (where we have stayed before) were running around $100-$130. Boy do I wish I had paid the extra $$ because this hotel ruined our trip.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "March 13, 2006", "id": 4606300}, {"rating": 4.0, "title": "Good value", "text": "The furnishings were old and dingy, the room smelled musty, everything was old and gross. The pool was too dirty to swim in. The hotel is WAY too far from the park to reasonably walk, especially if you have kids with you.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "November 10, 2005", "id": 4104558}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "The continental breakfast is okay-- One of the few good things.", "title": "mommas trip............", "helpfulness": 5, "user": "skiddles", "date": "November 7, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4091457}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "The WORST part of this hotel was the location of the hotel's ART shuttle to the park—TERRIBLE location!! Absolutely unacceptable, especially if you have small children. The “shuttle stop” is located on an EXTREMELY BUSY freeway onramp!! There is no fence or gate, we’re talking, if your five year old stumbles and falls, they are falling into a freeway onramp. I am not a paranoid or over-protective parent, but I cannot stress how dangerous this is. When I complained to the hotel, they said there was nothing they could do about it.", "title": "Would Stay Again!", "helpfulness": 5, "user": "CerasiJ", "date": "October 28, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4069033}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "This hotel is completely NON-SMOKING. I am a non-smoke and can easily smell any hint of smoke ... there was NONE! While the hotel does showed some wear-and-tear simply due to continual usage, I found it to be VERY CLEAN. (i.e., in the threshold area from the hall to the room, the carpet was fraying.) The beds & pillows were very comfortable. The bath area well stocked with clean towels, bath & hair sundries, hair dryer, and 4 cup coffee pot. Although we did not take advantage of it, the hotel offers a free (and rather substantial) continental breakfast in the morning. The only two downsides I came across were MINOR at best. First, the night clerk (we checked in at 3 a.m.) was very less than friendly. The second being the 11 a.m. check-out time. We requested, and were granted, an hour extra for checking out. During this additional hour the hotel maid knocked on the door wanting to know when would be leaving. Incidently, while booking my reservation, I discovered I could receive a better discount using my AAA card, than taking advantaged of their Sr. Citizen discount. BOTTOM LINE: I would absolutely stay here again!", "title": "Terrific Price! Comfortable Beds! Very Clean!", "helpfulness": 1, "user": "jacsbri", "date": "February 26, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 3.0, "location": 4.0, "value": 4.0, "rooms": 4.0}, "id": 13868030, "likes": {"liked": "— Non-Smoking Hotel; comfortable beds", "disliked": "— night desk clerk bordered on rude"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "My boyfriend and I stayed her for 2 nights since we visited Disneyland. I must say, the price was right (considering the area) and the room was very clean. We didn't encounter any issues while we were there. They even had free continental breakfast! I would definitely recommend staying here if you are on a budget and want to stay in a place that is clean and safe.", "title": "clean and affordable!", "helpfulness": 2, "user": "chego121", "date": "January 28, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13077902, "likes": {"liked": "— cleanliness and price", "disliked": "— people at the front desk should learn to smile"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Me and my husband stayed here a week before Halloween to enjoy disneyland in the fall. I have to say was not sure about the hotel at first due to other reviews.The hotel is extremely easy to find off the freeway. We were surprised when we where greeted by the hotel employees they where more then helpful to get our room quickly and to get us our shuttle bus tickets to enjoy the park in the evening.The rooms where big and extremely clean! The bed was so comfortable even our shower was a great size. The best nights sleep I have ever had on a off disney property! Great price for your money. My husband loved the breakfast and coffee.The only complaint I had was the Shuttle bus route was a bit long and took you a bit out of the way to get to the park it is not close to the park.However this is not the hotels fault but the shuttle company which is ART. Other then that we had a great time will definetly stay again!", "title": "Great hotel for a quick disney trip!", "helpfulness": 1, "user": "diva_jones2801", "date": "November 25, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 11058384, "likes": {"liked": "— The great beds !", "disliked": "— Shuttle location and distance to Disneyland"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled solo", "text": "I stayed at this property for two days while I was evacuated during the San Diego fires. My room was large and clean, complete with a microwave and refrigerator. The bed was comfortable and the room had wireless internet access.", "title": "Clean and comfortable", "helpfulness": 1, "user": "Shaky", "date": "November 6, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 10649515, "likes": {"liked": "— Clean", "disliked": "— Everything was OK"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "I believe the entire property is non-smoking. Regardless, my room had no hint of smoke.", "title": "Awesome new beds & large rooms", "user": "Tracy-in-WA", "date": "September 6, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8667993, "likes": {"liked": "— The bed!", "disliked": "— Hot humid hallways"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007", "text": "We paid over $100 and the room was pretty good. The fridge and microwave was nice to have. The only complaint is that the hallways were really hot!! -no AC. Breakfast was poor and very crowded, so don't use the free breakfast as a reason to stay here.", "title": "Pretty Good, Can probably find a better room for the money", "user": "williamtraveler", "date": "August 15, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 8431390}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "15 minute walk to Angels stadium so it was good location for staying after the game.", "title": "Unforgettable", "helpfulness": 2, "user": "Charmed1", "date": "April 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 7394526, "likes": {"liked": "— Wasn't in the heart of everything but easy enuf to get to places", "disliked": "— nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "There were lots of cheap hotels in the area, I would guess that another one is newer / nicer / cheaper...", "title": "Would not stay again!!!!!!!", "helpfulness": 3, "user": "snrwalker3", "date": "April 7, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 7291595, "likes": {"liked": "— 1st stop on the ART to and from Disneyland", "disliked": "— Quality of Hotel"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2005, traveled as a couple", "text": "My friend booked this hotel from an internet cafe while we were in San Franciso and it wasnt until after an argument on arrival at the front desk we realised it was her that had got the rates wrong!! The guys there were brilliant... they let us pay for one night until we decided what we wanted to do... we finally decided we were gonna stay three nights there and four in LA itself...but they were so friendly & hospitable we decided to stay the full time there...they dropped us at greyhound stations when we needed to go places...the manager gave us a ride to Universal and spent his day off with us (he'd never actually been himself so was a first for him)... We were made to feel so comfortable during our stay here...We even swapped email addresses and stayed in touch for quite a while afterwards...They made a great impression on us and I dont think we'll be forgotten in a hurry either!! lol!! After reading some of the other reviews I guess we were lucky... our room was nice and we had A+ service!", "title": "Average accomodations, not recommended for families", "helpfulness": 4, "user": "luckygirl79", "date": "November 16, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 2.0, "rooms": 3.0}, "id": 6136593, "likes": {"liked": "— Cheap rates, excellent free breakfast", "disliked": "— Bad location in relationship to Disneyland"}}, {"rating": 1.0, "title": "Dont stay here", "text": "This was my second stay at this hotel. I had stayed once before last Sept. and the stay had been ok. This time however we had problem after problem, including a manager that was not customer service oriented. When checking into this hotel we were told that even though we had a confirmation for 2 queens and a roll-a-way that they couldn't provide that for us. The women working at the front desk were somewhat helpful but the manager was irritated that he had to accommidate us. We never had enough towels, the breakfast was basic, room conditions were far below other Comfort Inns. They charged us for the roll-a-way that they wouldn't allow and then we got the run-around when we wanted them to remove the charge. We have stayed in many Comfort Inns and would never come back to this one.", "helpfulness": 2, "user": "dsmark2615", "date": "October 29, 2006", "id": 6024618}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 9, "average": 31, "very good": 100, "terrible": 13, "excellent": 99}, "aka": "The Comfort Inn & Suites Anaheim, Disneyland Hotel Anaheim", "slim_ranking": 0.0720720720721, "description": "The Comfort Inn & Suites Disneyland, Anaheim is a contemporary, five-story hotel with spacious rooms and suites, modern amenities, offering exciting Disneyland vacation packages."}