{"user_rating": 4.5, "review_count": 7464, "name": "The Royal Playa del Carmen", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "This was our 3rd visit to the Royal and we chose a 1BR master suite ocean view for our annual winter get-away. We booked our reservation and flights through the Real Resorts website for the first time and were delighted to have the entire process handled quickly and accurately. Check-in was easier than usual but after all we knew the drill and there was no sign of 'Real Club' staff looking to schedule us for a conversation. We loved our suite's 2 balconies, had a nice view of the pool and despite our location (furthest away from the beach), we could even see the ocean. Our room (#747) was in the newer, detached part of the resort and was furthest from the beach and pool but we enjoyed having the coffee bar and the Mediterranean Restaurant just steps away from our door. The distance from the pool and beach resulted in a very quiet stay and a longer walk to those areas but the walks were always enjoyable! The resort was busy with weddings during the Valentine's week and we felt some sympathy for the wedding parties that had to endure blowing sand and gusty winds. We were overwhelmed and at times annoyed with pillow choices and the fragrances that the resort thought would help create a romantic atmosphere in the room. We enjoyed great beverage service (pool and beach) from Maggie and Ruth and our housekeeper cleaned our room and turned down the bed every evening. A very delightful 8 day stay that reinforces this property's status as one of our favorites!", "title": "Always a Favorite!", "user": "GOmaha", "date": "February 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153204198}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Just Book this place...the location of this resort can not be any more ideal. On the left hand side is your beach and on the right is Playa Del Carmen 5th avenue which is wide awake and alive deep into the night. Amazing beach, great pool, great food, great service, great staff, SPECTACULAR ROOM! Really, what more can be said. Enjoy! :)", "title": "Royal is an appropriate use for this resort!", "user": "adnanhoque", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153152703}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We have been to the Royal in Cancun two times and loved it so we thought we would try the Royal in Playa del Carmen for a change. The location to the town of Playa del Carmen was a big draw for us and proved to be a great choice, we loved the resort too. We stayed February 13 - 20 with 6 other couples of varied ages from early 30s to late 50s. The service was excellent from the concierge to the housekeeping to the wait staff to the entertainment crew. Katie, Azu, Mayer, and the rest of the pool entertainment staff were great and always stopped to talk even though they were very busy keeping everyone moving. Antonio and Jeronimo wonderful in Spice, my husband ate there almost every day for breakfast and lunch. Maria Marie was great, wonderful service and food. Never tried Asiana but heard very good too. We loved the beach and loved the short walk to downtown Playa. We had a terrific vacation and will definitely go back again!!!", "title": "Great vacation with friends", "helpfulness": 1, "user": "Luvnthesun42", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153141060}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": ".", "title": "Awesome vacation - such a relaxing time!!", "user": "lelliott614", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153137536}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "My husband and I stayed at the Royal Playa del Carmen from the 6th to the 13th of February 2013. This is only the second life time experience for a \"all-inclusive\" but I have to say that this place was nothing short of a dream.", "title": "Wonderful vacation..", "helpfulness": 1, "user": "Refurnished", "date": "February 25, 2013", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 153133955}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "entertianment staff they are the best specially sexy omar poncho jorgelicious and denis by the pool they made my vacations memorable .", "title": "The sexiest cabana boys in the whole riviera maya", "user": "tamjomoore", "date": "February 17, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 124721127}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "I visited the Royal with three friends Jan 27- Feb 1. We were originally booked at the Gran Porto, which was overbooked, so we moved to the Royal. It was a great move! We found it to be at the top of the list of resorts we have visited. This is our seventh girls trip to Mexico. I also travel to Mexico on average two to three times a year.", "title": "High Quality AI Resort", "helpfulness": 5, "user": "traveljenChicago", "date": "February 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124721087}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "The rooms are large and very comfortable. There was a jacuzzi in one corner of the room. We also liked the sink and mirror separated from the toliet and shower. It comes in handy with two women getting ready! Our balcony overlooked the courtyard between the two hotels and the ocean was visible.", "title": "Beautiful Resort - I would definitely go there again!!!", "helpfulness": 6, "user": "TriciaW_70", "date": "February 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124695350}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The pool was great, a little on the cool side, especially if no sun or late in the day. The saving chairs game is alive and well, as it is everywhere I have been! Very generous with towels. The jacuzzi is warm and becomes a party tub at the end of the day. The service around the pool is pretty good and if you have to get up and get your own drink it is not far to find one. The entertainment staff works hard at providing games, cooking lessons, water aerobics, etc. One of the extras I noticed was a gentleman walking around offering to spritz you with cool water. Another day they were handing out frozen grapes. Very nice! Also there was a book cart with complimentary sunscreen. First time I've ever seen that. The spa ladies were walking around offering info everyday, but a polite no thank you was taken with no further sales pitch.", "title": "5th time to The Royal in Playa del Carmen and it still loving it", "helpfulness": 16, "user": "KellyGirlOntario", "date": "February 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124679992}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "The beach was average. You could walk quite far in both directions.", "title": "Great place", "helpfulness": 5, "user": "Helenbarton", "date": "February 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124671432}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "I have traveled to the Riviera Maya multiple times and I keep being drawn to The Royal", "title": "The Royal stays Royal", "helpfulness": 1, "user": "Tvlenthusiast", "date": "April 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106114604}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Playa del Carmen. There are many incredible resorts in the area, so for The Royal PDC to be my overall favorite, this speaks volumes about it's quality of service.", "title": "Most Courteous Staff and Clean Resort", "user": "uclafan84", "date": "April 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 106065230}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "My hushand and I just returned yesterday from celebrating our 30th wedding anniversary. Our 25 year old single son went along and he had a fabulous time as well. We didn't request suites together and we were in 315 on the front of the resort facing the Gran Porto Real, he was in 809 near the quiet pool, El Mediterraneo, and the Coffee House.", "title": "Feels Like Home", "helpfulness": 2, "user": "BackinParadise", "date": "April 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106035798}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Even though we didn't upgrade and select our rooms, the online registration worked and we received concierge service the moment we arrived at the property. Also, I had given them my cc online. When I arrived they had it in their system, we were able to charge incidentals to the suite without any other information being given to them. They didn't run the card until check out. This was fabulous as in many cases with other resorts and on cruise ships the company authorizes a large amount on the card I have used to guarantee a room or for the cruise ship onboard account. So, I was amazed that they took us at face value. This wasn't my first stay there - just my first time to do online check in. I had read the bad reviews and thought, what the heck, I will just see what happens.", "title": "\"AMAZING HOTEL\"", "helpfulness": 1, "user": "Tvlenthusiast", "date": "April 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 105978017}, {"rating": 2.0, "title": "Argh!!!!", "text": "I have stayed in the oceanview Jr Suite before and don't think that an upgrade is worth it unless you are going for an oceanfront or presidential suite. This is just my humble opinion. The Royal service trickles down to all levels of rooms and that is what makes this resort special.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "April 27, 2011", "id": 105874951}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "This was our second girls trip to the Royal in Playa Del Carmen and we plan to use them as much as possible in the future. We get treated like princesses and pampered for a whole week. My sister and I loved the activities and recreation staff. Danny, Azu, Meyer, Alex, Katie, all of the activities staff are truly amazing. The facilities rock. The accommodations are amazing. The restaurants are fabulous. We loved the spa and spa services. Top of the line on everything you can imagine. The Royal meets and exceeds expectations yet again!", "title": "Love the royal, our home away from home!", "user": "Walkab", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153056726}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "Due to overbooking in their sister hotel across the street, we upgraded us to this paradise. I have staid at fine hotels before: sugar beach, mauritius/savoy beach club, madeira. I must say, this was a winnig prize.", "title": "What a surprise!", "user": "Karppa64", "date": "February 25, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 153040617}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "The service was exellent, soooo friendy. Needless to comment the facilities. Perfect is perfect. The location could not have been better. Some rock on the water made the beach experience down to 90%.", "title": "\"Maria & Gilles - Great vacation February 2013 at the Royal\"", "user": "Maria A", "date": "February 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152998304}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Only thing that I did not find up to these highstandards was the house kerping: on the first night, we used some glasses. We put them in to the superb discrete delivery hatch for room service. They were taken away, but no replacement. After 2days I called room-service. New glasses were delivered, but not all types. Only wine-flutes.second thing: we got to choose pillows of our choice. They were delivered, but the others were left on the arm-chair for the whole stay.. Also we used a bottle of their shower-creme in their jacuzzi. The empty bottle was left on the side of the jacuzzi the whole stay.", "title": "It was just ok", "helpfulness": 1, "user": "Noname11111", "date": "February 24, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "service": 4.0}, "id": 152995710}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "These are microscopic things to a traveller, but certainly not the goal of this fine hotel.", "title": "The Do's and Don't s", "helpfulness": 2, "user": "slfrickle", "date": "February 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 152994700}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "We spent the week at the beautiful resort The Royal with excellent grounds and Food. We were with a groups of people and met many helpful staff. We made a special friend Azu the second day and she entertained our group and made us all laugh. It made our trip that much better. I will be back someday.", "title": "Fun and beautiful week in Mexico", "helpfulness": 3, "user": "2blooney", "date": "January 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150305810}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Spent a week with 200 + friends from our local radio station Wisconsin/Illinois boarder. Everyone was so pleasant and helpful, and our room was beautiful! We met a lot of terrific people that entertained our entire group, and always greated us with a smile. I specifically want to thank Azucena Estrada Rairdin! She has a special gift of entertaining, and is such a sweet person. I would come back again just to see her smiling face:)", "title": "Paradise", "user": "Lisa L", "date": "January 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150305613}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "This was by far the best hotel I've been too. The resort is beautiful, service was top notch, and entertainment was better than Las Vegas. The sports and entertainment employees Azu, Jesus, and Katie were awesome. Made me feel like royalty. Awesome. Only complaint was the guy who was the boss for the entertainers talked down the sports and entertainment employees multiple times in front of my wife and I. I forgot his name but he was the main boss.", "title": "Best hotel ever been to", "user": "Zr2berger", "date": "January 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150305341}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Food was very good. Jose (Spice am) was awesome. Taught me how to carve fruit into clown faces. Chef Porfilio was amazing. Jaquine was also amazing, always making sure I had a drink and was having fun. I will be back to this resort. Also, Jaime who walks around by the pool cleans your sunglasses and wears funny sunglasses. I love this place a lot.", "title": "Azu is the BEST entertainment girl in the business!", "user": "TracynJohn M", "date": "January 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150303704}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "We just spent the past week staying at The Royal, it was amazing! Their rooms are beautiful, the service is impeccable and they have THE best staff ever! We had Azu as our group hostess with the mostest! She planned activities for us, hung out in the pool, the bar, the pajama party, the beach party, everything, and she was amazing! She figured out how crazy our group was (we went with a local radio station) and instead of being afraid or embarrassed by the things we said or did, she embraced it and tailored the activities to make the trip even more enjoyable for us! She made the trip so much more! Plus she has an arm that could get her into MLB!! Thank you Azu for being the best and for becoming friends with so many of us. We will never forget you and I can't wait to come back again and see you. I have made a lifelong friend after a week! The Royal seriously needs to give her a raise, I loved everything about the hotel, but SHE is the biggest reason I will be coming back!", "title": "Vacation to The Royal", "user": "Meribeth L", "date": "January 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150297583}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "Second time here. Weather was nice, friendly staff. Food was delicious! Clean. Good entertainmen. Enjoyed the shows. Well dressed staff. And of course I Havana to talk about Danny , & Alessandro of sports & entertainment, they make my vacations really funny and magic moments when they bring me to cocobongo in a crazy party!!!! I never going to forget that thanks a lot!!!! I will back soon friends!!! My new MExican friends.....", "title": "Danny boy was great with entertainment!!!!", "user": "Highpocke", "date": "January 22, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 150285023}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We went for our 20th Anniversary and it was amazing! The resort was beautiful and very clean. Their motto is Expect the Exceptional and they delivered it! The service was great, especially by Carlos the bartender at Pelicanos Bar! Another person that we felt went above and beyond was Edgar with Best Day Travel. He recommended and helped plan some wonderful excursions for us. The only things negative we have to say are the wifi in our suite was poor, signal wasn't strong and the mini-bar in the room didn't keep things very cold, just slightly cool. They asked us at check-in for 90 minutes of our time and it was a presentation to join the Real Club, which we didn't do and felt like that time could've been spent by the pool or the beach. The food was good, fancier than what we're used to but the taste was good. Since we went in January I was very happy that I brought pants and a light jacket since the evening breeze was chilly. Overall, it was fantastic and I can't wait to go back.", "title": "First All-Inclusive Resort Vacation", "user": "Tiffany I", "date": "January 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150275828}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "this is an excellent hotel! I'd say it may have in the top three vacation resorts I've ever been to. first, it's an all-inclusive. having said that, the food is marvelous. MariaMarie was our favorite. I have to call out Carlos the manager who was spectacular in terms of service. also Nancy del Dios and my favorite Anais at the door, wonderful ladies. Servers Genis and Jose were great, all of them are superfriendly no matter who you get.", "title": "amazing hotel in a gorgeous beach city!", "helpfulness": 6, "user": "Shahrooz76", "date": "January 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150226177}, {"rating": 4.0, "stay_parameters": "Stayed January 2013", "text": "the only two negatives were the Asian restaurant- Asiana. terrible. they really have to bring in someone to show the chefs how to make real asian food. clearly the talent is there its just that they dont get the flavors right. not at all.", "title": "This hotel was wonderful. The entertainment staff was fabulous.", "helpfulness": 2, "user": "Mwojo", "date": "January 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 150209717}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "the only other negative- they had allowed a large group of radio people from the Midwest to book a huge chunk of the hotel. big mistake. these were really trashy, redneck folk from the middle of nowhere in the midwest./south. terrible rude, vulgar behavior at the bar and everywhere else. made me feel embarassed to be American. Im talking tattoed trailer park trash here. please dont allow those radio stations to hold their uhm 'conference' at your property ever again. everyone I met who had been to this place before, lots of vacation home and time share people, were shocked and disgusted and disappointed that management had not checked the group before letting them book. but anyway, minor issue.they left within 2 days of us getting there.", "title": "Fantastic Stay & Scuba", "user": "Robert M", "date": "January 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150209520}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The facilities are beautiful and immaculate. The only drawback is the water has an unusual odor, which can be a bit strong and distasteful. The spa is great...had awesome deep tissue massages with Edith. The food is good, although my favorite one is at the sister resort next door...El Pescatore. That was amazing! We would definitely go back.", "title": "almost perfect", "helpfulness": 1, "user": "luvsunlux", "date": "February 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 124620720}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "The food and booze at this place was great! My wife layed by the pool all day, while I bellied up to the bar and drank Johnnie Black. We really like the pool and the bar in the back, it's like a secret pool that many people don't know about, so it was never backed and very relaxing.", "title": "Great Honeymoon", "helpfulness": 2, "user": "Rob F", "date": "February 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 124620134}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Great locations, spotlessly clean, friendly, polite service.", "title": "Paradise but few reservations...", "helpfulness": 7, "user": "ALAB75", "date": "February 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124586807}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Food well presented and tasty, pork & beef little tough. In my opinion you get better food at the buffet restaurants, the a la carte are over rated.", "title": "utter nonsense", "helpfulness": 31, "user": "angeebabesManchester", "date": "February 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124583580}, {"rating": 1.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Be careful with the rooms, we had to change two times due to the very strong smell of mould. Beds are very comfy, but the heavy duvets and lumpy pillows could be improved. The jacuzzi in the room probably contibutes to the mould, when you have an ocean & swiming pools who needs jacuzzi in the room?", "title": "Starving in Paradise - Decent Property - Food was a Total Failure", "helpfulness": 19, "user": "1IrishLass", "date": "February 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 124525511}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "I want to mention these employees name that made this stay a wonderful memory. Marcel the bartender by the main lobby. Christopher our waiter @ the beach! Jesus bartender @ the main lobby, then transferred to the Chinese Restaurant, no matter where he was he gave excellent service. All three gentlemen are an asset to the Royal Hotel. The hotel is beautiful, but there are alot of beautiful hotels, so service has to be your top priority and that is what we got. And there was also our cleaning lady that was absolutely wonderful, I cannot remember her name. The gentlemen that came to fix our hot tub, which I cannot remember his name either. There were so many employees in different restaurants that went above and beyond that contribute to the good memories of this place. Didier Vargas, in the reception area made sure we were moved to a quieter room (construction was going on when we went) & got us the best view of the playa, so nice, also stayed on top of getting our hot tub working correctly. The stores and other restaurants are right by the hotel, no taxi is needed, all walking distance, this was great!", "title": "Employees made this place", "helpfulness": 1, "user": "Janie F", "date": "February 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 152991522}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "My friends and I (a group of 6 ladies 40s-50s-60s) stayed at THE ROYAL from Feb. 9 to Feb. 16. This was a really great vacation. The check-in went smoothly, our rooms were beautiful and all located close to one another. We loved the ambiance at the pool even though there are no sun umbrellas at all. The service on the beach in the cabanas was really good; we did found though that the cabanas were all too close to one another. It would have been nice also to have some sun huts on the beach so that we can take a long chair and isolate us from the crowd. The week we were there, the ocean was quite agitated by wind and waves; 2 of our friends are not good swimmers so we were'nt able to be all together in the ocean at the same time. I have to say that there were a few rocks here and there and therefore the ocean did not compare at all to my last experience in Negril, Jamaica. The food was good, the activities numerous and the personnel quite charming. I love that every person working in this hotel would acknowledge me by putting their right hand on their heart. To **Victor**, Katie, Yorge, Asu, Ivonne, Alberto, Armando, Jeronimo, Antonio and all the others, thank you for making my vacation a pleasant experience. I loved the service box in my room and the turndown service. The hotel store had a good variety of gifts and let me tell you, we shopped like there was no tomorrow. It turned out that some of the items in the store were better priced than items on 5th avenue. I will definitely recommend this hotel to my family and friends. Lorraine from Ottawa.", "title": "Annual trip with friends", "helpfulness": 1, "user": "Lorraine021965", "date": "February 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152991245}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "My wife and I have been to several all-inclusive resorts (Mexico, Jamaica, Dominican Republic) and a couple cruises and by far The Royal was the absolute best. The people, facility, food, beach were first class! The staff was very friendly, helpful and anything that was needed was provided promptly with a smile and sincerity.", "title": "Best All-Inclusive Experience Ever", "helpfulness": 3, "user": "Tom B", "date": "February 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152973362}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "All the rooms are beautiful suites that are large, luxurious and very well maintained. You select a time for maid service to clean your room each day, time for turn down service and what aroma you prefer at bedtime. Our lovely room attendant was Odilia Maldonado Camarista and she did an outstanding job taking care of our room and entertaining us with beautiful swans, hearts or flamingos on our bed made from towels and flowers. We splurged on a couples massage at the spa and had wonderful treatment from Paty and Evelia that made my knees weak.", "title": "The only one for us!", "helpfulness": 2, "user": "Theresa R", "date": "February 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152965314}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "All the restaurants were wonderful, even Spice which is buffet and not normally something that we are interested in, however, their varied selection and also fresh made for you stations along with the wonderful service, kept us coming back.", "title": "Amazing Location!!!", "helpfulness": 3, "user": "tcost", "date": "February 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 152958004}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "This review is waaay overdue!! Stayed here for our honeymoon in 2009 for 6 nights. We choose it for the swim up pool bar which was fun!! After our wedding we were completely exhausted and slept for 3 days and this was just the place. We lay by the beach and the pool every single day and totally relaxed. Joined in on the morning yoga classes and cycling days which were lovely. Breakfast and lunch was excellent, tried dinner in a few of the various restaurants but the buffet had the best food for us. The rooms were huge and comfortable, but quality of the furnishings wasn't the best, all painted mdf. We considered some other hotels where the furnishings looked very lush but this place seemed more fun with the added advantage of being adult only! They had a pool room with snacks all day and for us it was the chiller we lived in on hot afternoons!! Really worth while splash out for our honeymoon. Would love to return, but can't see it!!", "title": "Honeymoon fun!", "helpfulness": 1, "user": "caitni2000", "date": "February 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 124801166}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "I realy enjoyed the activities at the pool area and the beach volleyboll.", "title": "Very good and professional entertainment team", "helpfulness": 2, "user": "Erik N", "date": "February 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124785896}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "The entertainment team was realy freindley and fun to be around.", "title": "The Entertainment Department", "user": "RadRyan88", "date": "February 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124785824}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "The most noticeable staff members were: Dennis, Jonathan, Poncho, Jorge, Omar and Hilerio.", "title": "RPdC", "helpfulness": 2, "user": "clark94321", "date": "February 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124740877}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "The entertainement staff made the whole vaccation more fun!", "title": "3.5 stars at best..", "helpfulness": 4, "user": "ToophDoctor", "date": "February 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 4.0, "location": 4.0}, "id": 124739319}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "This resort was unbelievable. The service was by far the best we've ever experienced on any of our holidays.", "title": "AMAZING!!!!", "helpfulness": 2, "user": "Finney2008", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150344341}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "It was a nice quiet resort, great food and fabulous rooms", "title": "Mexico 2013", "helpfulness": 3, "user": "Dan B", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150335209}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Bar staff were always friend and ALL the servers were amazing.", "title": "Amazing", "user": "Emily J", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150335131}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "We've never stayed at a resort twice....but I would here again!!!!!", "title": "Beautiful resort, superb service!", "helpfulness": 1, "user": "hilltool", "date": "January 23, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 150329645}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Excellent hotel with great food and great service. The rooms were very nice and spacious. The maid service was second to none. The location in Playa del Carmen was perfect. It is located directly on the beach and right next to 5th Avenue. The best part of the entire experience however was one of the activities directors. AZU was awesome! She really turned a good time into a great time. She was extremely friendly, funny and had a smile that never ending. This is someone who truly enjoys their job. Every resort should have at least 5 AZU's!", "title": "Excellent vacation and fabulous service from staff", "helpfulness": 2, "user": "Aubre V", "date": "January 22, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "service": 4.0}, "id": 150311080}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "I was at the resort for a wedding and had a pretty good experience-especially compared to what many experience at resorts in Mexico. I think if you are looking for a Mexican all-inclusive, this is one of the better places to stay, however, compared to other luxury hotels I've stayed at in the caribbean and elsewhere.", "title": "A very good resort for Mexico-Not sure I'd return.", "helpfulness": 1, "user": "jbritton78", "date": "May 3, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 106753837}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "Room: The rooms were LOUD! We were not near a bar but the noise from people drinking was heard throughout the night. The hallways were outdoor and tiled and you heard EVERYONE going by. The maids also made no effort to be quiet past 7AM.", "title": "Royal Playa Del Carmen, Excellent Resort!!", "helpfulness": 1, "user": "Coldandsnowybuffalo", "date": "May 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106742081}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We also requested an \"ocean view\" and paid for an ocean view room. Our \"ocean view\" suite overlooked the parking lot to the Gran Porto hotel and when we turned to look to the left toward the ocean you saw a bunch of palm trees. If the wind blew correctly, you could see a strip of ocean.", "title": "5 Diamond All The Way - Top knotch resort", "user": "busterbrown480", "date": "May 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106741765}, {"rating": 5.0, "stay_parameters": "Stayed April 2011", "text": "We also requested a King bed, we didn't get one. We were told requests were simply that, just requests.", "title": "2nd stay and it's still great.", "user": "AussiegalUsaguy", "date": "May 2, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 106580967}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "HouseKeeping: Overall it was good except one day we were there. We had been out at the pool from 10AM until 5PM. Our room was never cleaned. I called Housekeeping, they said someone would come, we went to dinner, got back at 9PM and still no one had come. It took three calls for me to get towels.", "title": "a true 5 star resort", "helpfulness": 1, "user": "thebuffalocrew", "date": "May 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106503009}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We traveled to this gorgeous resort with friends after waiting 7 months for the time to arrive. We had long anticipated this trip and the resort was more than we expected in many ways. Greeted as we arrived and guided well by wonderful, friendly staff made our arrival easy and stress free. You really feel welcomed from the moment you enter the resort. The rooms are absolutely beautiful and always very clean and well stocked. The food is presented well at all a la carte restaurants and very tasty. The buffet styles are also very good. We felt like we had the opportunity to wine and dine every night. Again, the service is great everywhere you go. They are all so friendly! My favorite place for meals was the El Meditterraneo. The staff there was just the most caring and welcoming and the food was my favorite for all 3 meals. You have the choice of buffet or a la carte and it has air conditioning! I also like the fact that the Coffee House is just next door and the quiet pool is there also. There was a special little man there that worked as maintenance and cleaning. He has a beautiful smile and works very hard. I believe his name is Gaviel. Paco and Roberto are also 2 waiters that we really liked. The pools are very nice and well kept. Pool water is a little cool but also refreshing. My other favorite place to have lunch was Pelicanos. The scenery is really nice and the food is very well presented and good! The Entertainment team are all very kind and friendly but not too pushy! We participated at a cooking class at Chef's place with Regina and this was alot of fun! Take it if you can; it is free and includes recipes and lunch! Now, for the beach front, there is a very nice man that wears the title of beachtler called Alexis. This man plays a huge role in the service at the beach and even at the pool. He is very kind, friendly and really makes your trip unforgettable. At the beach, we also got to know 2 wonderful lifeguards; Manuel and Rafael. They both have very nice personalities and make your day even more pleasant. The beach is somewhat crowded but the beachfront is limited in space. I preferred the beach in the morning and the pool in the afternoon. The only thing that I would recommend is some music at the pool. It feels really too quiet sometimes in the afternoon and after the water exercises, I was often disappointed that they shut the music off. I have so many nice things to say about this resort. We went to the Spa one morning and the service there is also amazing! We really enjoyed this. We had special treats when we returned at night like lit candles and some chocolates at the bedside. We took the time to go shopping on 5th Ave. one night and it was fun but also very crowded. It feels weird that the resort is so close to this commercial area. Once you cross the lobby it is another world. I loved the gift shop in the resort. It has alot of nice gifts including a nice jewellery collection. The service, the food and the beauty is at its best here. I strongly recommend it and I hope to return to it! You really can expect the exceptional at the Royal.", "title": "Service, food and beauty at it's best!", "helpfulness": 3, "user": "natdan155018", "date": "May 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 106422060}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Thanks to all wonderful people that work so hard to make your stay there amazing!", "title": "The Royal Treatment", "helpfulness": 2, "user": "fireman9s", "date": "May 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106421653}, {"rating": 5.0, "title": "SIMPLY EXCEPTIONAL!!!!", "text": "Stayed April 23-28 (Easter)", "helpfulness": 3, "user": "Sunshinegirlb", "date": "May 1, 2011", "id": 106375196}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "I had been in contact with Fernando for months before traveling. About a week before traveling, Fernando advised me he was no longer in charge of Suite placement, but would forward my e-mails. Rocio contacted me and put himself in my service.", "title": "Great resort.....spotless and friendly", "helpfulness": 1, "user": "Skfroman", "date": "May 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 106343768}, {"rating": 5.0, "stay_parameters": "Stayed April 2011", "text": "Arrived Saturday at around 11:00am. We were advised our Suite was not yet ready. We were offered a $200 resort credit to move to a Cancun location, or a Suite upgrade. I had paid for a an Ocean Front Master Suite. We were upgraded to a Presidential Suite, but the room would not be ready until 1:30pm.", "title": "Great entertainment", "user": "Meynon", "date": "April 30, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 106265062}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We spent 8 days at the Royal this year and 5 in 2011, which should indicate that we very much enjoyed our 2011 stay. The staff was so very accommodating and the food was top notch! Our beach waitress Elizabeth was outstanding and Lorenzo our beach butler were just TOPS!", "title": "Royal Playa Del Carmen", "helpfulness": 1, "user": "mckymouse", "date": "February 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 124643407}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "This is definitely a resort that people go back to year after year! We met people last year that were back the same week again this year!", "title": "What's all the hub bub, bub?", "helpfulness": 20, "user": "scattman", "date": "February 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124640219}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "I would definitely recommend this resort.", "title": "3 Star Hotel at most", "helpfulness": 2, "user": "blondbear", "date": "February 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 124639389}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Ok , we are in countdown mode to our second visit to the Royal PDC April 19 to the 25th. I didn't post a review of our first visit two years ago but as everyone knows who travels, Tripadvisor is a great place to check up on everything before you leave. First, everything has been pretty much covered but I will tree top. All rooms a teriffic. The ocean view rooms are just that but you have to be on the balcony to see the ocean as the layout of the resort is a horseshoe design. Spotless and impeccably attended to. The only complaint one of our guests had was that there was no Dewars on the property. The help is....helpful and fun. My favorite is Jaime, the pool butler. The entertainment staff was great and it's nice to see that they are all still there. The restaurants were rated by our travellers from good to great. Remember, you are in Playa del Carmen, Mexico and not cosmopolitan Manhattan. If you don't like something, order something else or try a different venue as it is an all inclusive. I agree that the hot tub is warm, the pool is cold but come on...you are on vacation!!! Is the sky too blue and the ocean too many shades of aquamarine? For our travellers from the north, congratulations on your Super Bowl win but I am beginning to wonder if you could be happy anywhere as witnessed to mostly negative reviews on everywhere they travel. This place overall is a great value. 5th Avenue, Playa del Carmen IS NOT Manhattan. If you think that because the Avenue is similar to NYC it is not. Again, this is old town Mexico. Quaint, bustling, and vibrant for a resort town. You won't be disappointed. We stayed at the Valentin(2 times), Dreams(2 times) and Barcelo resort. The Royal has it all. Service, amenities, food, location. The little things such as the magic box, 24 hour room service, a nice cold beer or mixed drink in your room after a hard day of leisure by the pool or beach is just the icing on the cake. Where else can you go for 7 days stay on the beach and have everything paid for just $2,800 all in? A house on the beach at the jersey shore runs $6000+ for a week and my wife still has to cook and clean. How anyone can rate this place as a one star resort even if the food was not up to par is beyond me. Don't worry, be happy...:) See everyone at The Royal in April!!! First drink is on me...", "title": "Fantastic Staff Makes The Royal the Best!!", "helpfulness": 5, "user": "BeachLover4257", "date": "February 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124629665}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Arrived at The Royal. The first thing offered was an upgrade for $120/nt. We were staying 14 nights so that would have been quite a lot of money. Our room faced the courtyard...no ocean view whatever. Many issues. 4 requests to have the non-working phone changed. Internet access spotty at best. Newspaper delivered only 2 of 14 days. Rarely given hand towels or wash cloths. The duvet was heavy and lumpy, the pillows hard and lumpy and the total bedding needed to be upgraded. The toilet ran continually though we reported it twice. The pool was so cold, hypothermia was the daily joke. Lots of seaweed and the beach not raked. Often out of towels at the pool and when we got them they were sometimes ragged and should have been thrown out. Little attention to detail...the candle holders in the lobby were never lighted, the fountain in Maria Marie never worked. The noise from hand carts in the hallway and in the courtyard went on at all hours. At night it was impossible to sleep with the doorwall open. The service in the Lobby Bar was poor. It seemed the servers were unaware when we came into the bar. We are generous tippers so that was a puzzlement to me since they were often not busy.", "title": "The Royal - The Best All-Inclusive I've ever visited!", "helpfulness": 12, "user": "Michael N", "date": "February 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124624974}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "This is the first time I have ever been to an all inclusive resort, and I'm pretty sure others pale in comparison! The rooms were beautiful, and the beds were very comfortable. The entertainment crew at the pool and the beach consisted of Azu, Jesus, Alejandro, and Katie. They kept us on our feet, laughing, dancing, and playing the whole time. What an enjoyable group of people!", "title": "AWESOME!", "helpfulness": 1, "user": "Patty H", "date": "January 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150307772}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The service by the bar staff at the pool was wonderful, I never had an empty drink glass. The restaurants were all high quality, I visited Spice, Pelicanos, Maria Marie and Tapas & Pintxos. All were delicious and the service was very good.", "title": "Beautiful!!", "helpfulness": 1, "user": "Laura P", "date": "January 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150306742}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "I'm looking forward to returning someday soon.", "title": "Amazing hotel, food, and spa services!!", "helpfulness": 1, "user": "Scostanza", "date": "January 22, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 150306462}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "We went to the Royal for our honeymoon for ten days. I have been to a lot of resorts and this one is the best by far. The first impression was amazing. The check in was great. The grounds were beautiful. Our room was fantastic. Every room has a jacuzzi and a hammock on the balcony. Best of all was the service. Far exceeded any service we have seen before. Everyone was friendly and helpful. We stayed on the beach everyday where Mich would set up our chairs for us in the morning and always made sure we were good. He was very friendly and personable. He really made our beach time fantastic!! Really, I have nothing bad to say about the hotel or the service. It was perfect.", "title": "The amazing hotel and staff of The Royal Playa Del Carmen!", "helpfulness": 1, "user": "Karen_Us", "date": "January 22, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 150306377}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Stunning views, incredibly delicious food. The beach was great, especially the cabana beds; not to mention the beach butlers who bring you drinks and food all day! The room was unbelievable: clean, luxurious, romantic, and the housekeeping staff made our visit special with turndown services, rose petals, and different towel \"animals\" every night.", "title": "Azu is the best", "helpfulness": 3, "user": "Qvedder", "date": "January 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150306145}, {"rating": 3.0, "stay_parameters": "Stayed February 2013", "text": "The help is super friendly and work very hard. We brought a couple hundred in $1s and used it all plus for tips. Rooms are large and pretty good I didn't consider this resort a 5 star by any measurement. We booked a fishing trip and it was a total ripoff,they forgot to pick us up and we had to take a taxi back to the hotel. $450 for 4 hours that was 3.5. Hours too long. I understand that fishing isn't always good but it was totally misrepresented. Then when we returned and they asked about the trip they promised to try and make it right but we really never heard from them again.", "title": "Hit and miss", "helpfulness": 2, "user": "MTScott", "date": "February 25, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 153119792}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Also played golf, if you do you might contact the courses direct I think you can save quite a bit of$$. Again no ride back to the resort.", "title": "The perfection in client's personal attention", "helpfulness": 2, "user": "Michel D", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153112436}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Restaurants are ok Marie is by far the best and is pretty good. The buffets are just that all you can eat kings buffet etc.... Drinks pretty watered down which I really didn't care about. Still those that wanted to get sloppy drunk and sunburned accomplished their goals.", "title": "Treated like Royalty", "helpfulness": 1, "user": "PeterandMaxine", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 153099305}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Beach is nice, back to Hawaii for me.", "title": "Best hotel experience I've had", "helpfulness": 3, "user": "Hilary999", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153081915}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The suites are spacious and luxurious. The food is always excellent. We have eaten a lot at Spice's restaurant and the staff was real professional and always smiling :especially Selma Nicoli, Cori, Andres, Reynaldo, Adan. The Maria Marie was also one of the best place for dinner. Best regards to Carlos Rodriguez (the manager) and Genis for the warming attention : great service and great food, a real nice experience.", "title": "Excellent Resort and Great Value", "helpfulness": 1, "user": "Sherri H", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 153062645}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Just spending my last day at the Royal! Been the best two weeks ever. Rooms are excellent, food is outstanding. It was perfect. Everyone works so hard to look after you! Charlie goes way out of his way to make you feel welcome. He's is a great. Always great to have Charlie around the pool to make sure your looked after. Charlie is a true gem. The rest of the entertainment stuff is exceptional as well. I wanted to send a huge thanks to Alex, Diego, Victor, Hilario, Hugo, Alberto, Regina and Adam.", "title": "Best place on earth", "user": "dmoeller", "date": "April 30, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 106262653}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled solo", "text": "Jamie your great :).", "title": "Awesome!", "helpfulness": 2, "user": "maureenb55", "date": "April 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 106233067}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Very proud to see Mireya Diaz is now working the front desk. A great girl doing a great job!", "title": "Still Wonderful!", "user": "dogwriter", "date": "April 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 106221671}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Thanks to Louis Roberto for all the great drinks.", "title": "Only at the Royal......", "user": "warmwaterturner", "date": "April 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106212383}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Excellent place to stay, a person would have to be looking for fault, to find any! Great staff, great food and drinks. It is crowded on the beach but really nothing to complain about. As a solo female traveller, I was treated with respect and made to feel comfortable. I will return!", "title": "Amazing stay, location in Playa can't be beat", "helpfulness": 3, "user": "relax7500", "date": "April 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 106155710}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 4.5, "variance": {"poor": 201, "average": 391, "very good": 1123, "terrible": 125, "excellent": 5624}, "aka": "The Royal Playa Del Carmen Hotel", "slim_ranking": 0.0969387755102, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "New redesigned and redefined THE ROYAL Playa del Carmen is one of the most successful resorts on the Riviera Maya. Guests will discover an explosion of luxury around every corner, all provided in an atmosphere of casual elegance boasting a perfect beachfront location, mere steps from Playa del Carmen’s famed Fifth Avenue."}