{"user_rating": 4.0, "review_count": 332, "name": "The House at The Three Drums Hotel (U Tri Bubnu)", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "I stay in this hotel during one week. The placement is good, in the center of the old city. Staff if helpful. But it has some limitations: 1) steps are hard to climb, 2) there is not shampoo in the bathroom, 3) bed sheets were not changed during 7 days of our stay, 4) there was no view from our room, 5) it smelled from restaurant downstairs, 6) it was noisy, you can here your neighbors at 5 a.m. and repairs outside during all the day.", "title": "It has limitations", "helpfulness": 2, "user": "Leonid1971", "date": "September 16, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 79738647}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We had the top attic room for 4 people andit was large and comfortable. It was very hot in Prague but a fan was supplied which helped as there is no air-conditioning. The bathroom was down a flight of stairs and quite small but quite adequate. This hotel is definitely not suitable for anyone who has difficulty with stairs - we had 85 stairs to our room and bags needed to be carried up. It is a quaint hotel in an old traditional building, in a superb location right near the astronomical clock and easy walking distance to all tourist sites. There is free internet which is a real bonus and the staff were helpful and a good breakfast was supplied. There is paid parking a short walk from the hotel.", "title": "Great location, helpful staff, lots of stairs.", "user": "Taraterrific", "date": "July 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 71412156}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Excelent location,very helpfull staff,clean room and decent fresh breakfast. Good for the price.", "title": "good hotel for the price", "user": "searchru", "date": "July 9, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 70307881}, {"rating": 4.0, "stay_parameters": "Stayed June 2010", "text": "No elevator ,so be prepared to get your suite case or backpack on your feet to whatever floor you staying. Rooms are clean and neat,but no shower curtain and airconditioner!!!.", "title": "Hotel is in a great location with friendly staff and a great choice of breakfast.", "helpfulness": 1, "user": "Cate1949", "date": "July 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 70092129}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "I stayed here with my adult son in Room 8. Great size room but very small bathroom and the king size bed is actually 2 separate single mattresses - so worked well. Friendly and helpful staff. Choice of breakfast was good - juice, cereal, cold meats and cheese, bread and a TOASTER - unusual in Europe. We stayed for 4 nights and I 'assumed' we had the special deal - stay 4 nights and pay cash and get the 4th night free....there was a misunderstanding about this but it was resolved eventually by the manager in my favour. So confirm when booking that you have this deal - don't just 'assume' it will happen. Great location but a bit noisy at night as our room faced the front with a small bar immediately below our windows. But it was World Cup, so perhaps more noise than usual.", "title": "A little gem in the heart of historic Prague", "user": "Moniquefrancis", "date": "June 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 67659913}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We liked this hotel a lot. The location was right around the corner from the old square and a couple blocks from tram and metro lines, so very convinient. The hotel itself was really good - neat old building, very clean, and our room was quite spacious. We were there for 5 nights and didn't feel cramped at all. The hotel staff was very friendly. And the rates were very reasonable.", "title": "Really great hotel close to the old square", "user": "november_moon", "date": "August 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117336142}, {"rating": 3.0, "stay_parameters": "Stayed August 2011", "text": "The only thing that kept me from giving this hotel 5 out of 5 was the shower. It was one of those hand-held showers, which was fine, but the bracket on the wall for the hand-held part was really loose so that the shower head continually fell down during a shower. It was really annoying and the silly thing is that it isn't a difficult or expensive thing to fix. IMO, a good shower in the morning is important.", "title": "Perfect location but no smiles :(", "user": "pepe-1976-pepe", "date": "August 25, 2011", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 117211195}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "You cant beat the location however \"good morning\" from a reception desk is something to expect even on camp sites. I would not dare to ask for a smile on the faces of sevice personnel. The room was very small and hot. A good place for quick visit but not a longer stay.", "title": "An excellent place to stay in Prague, near Old Town Square", "user": "1975magnus", "date": "August 20, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 116993524}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "Nice small hotell in the absolute city center in Prague.", "title": "Simply Perfect! Location, Staff, & Room with Historic Character", "helpfulness": 3, "user": "FlyInMyShoes", "date": "July 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115207246}, {"rating": 2.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "Nice and clean rooms.", "title": "Disappointing", "helpfulness": 1, "user": "VisitorPrague_11", "date": "June 30, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 2.0, "service": 2.0}, "id": 114912297}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "We stayed 3 nights in U Tri Bubnu Hotel last week. I gave 4 stars to them because two things: first, the breakfast was far from the perfect, eg. there wasn’t cooling facilities for yoghurts, hams, juices etc. and it was about 33 celsius degree. Second, on departure, we’ve been asked for 50 CZK because – as they told us, we consumed one item from the minibar and that wasn’t correct. We didn’t pay, explained that it’s expensive to consume (and the frige is not cooling well – we prefer the really good tap-water!).", "title": "Great stay", "user": "Kismaci", "date": "June 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67577529}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Else, our stay was very good, the receptionists speak english well, they was helpful if we needed anything, and the free laptop was a great idea! Of course I have read almost all of the reviews and learnt that they don’t have elevators and air conditioning. Well, latter was terrible, because the hotel is sooooooo hot. BUT: they have standing blowers and our worked well.", "title": "U Tri Bubnu is wonderful!", "user": "rdunek99", "date": "April 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61198997}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "We had a triple room, amazingly spacious, with comfy beds. I slept well, really. The room was on the 2nd floor, and the climbing after a long walking… well… but I knew that, so it was OK for me, and the stairs was beautiful, the building from the 15th century, it was something special!", "title": "What more can you ask for?", "user": "Skansens", "date": "April 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60854167}, {"rating": 5.0, "title": "Very Comfortable", "text": "Summarized: the hotel was OK, beside the breakfast and the leaving-incident it was a perfect stay. And the LOCATION! Wow. I think it’s the better price-value hotel in the Old Town Square.", "helpfulness": 2, "user": "LaskaSL", "date": "March 8, 2010", "id": 58070738}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We stayed there 5 nights. It was recommended by my cousin, who lives in Tabor. Wonderful location, clean and a friendly staff! What more could you ask for? Separate secure doorway for some of the rooms. Good European style breakfast (pastries, cereal, cold meats, yogurt, bread - all good!)", "title": "Excellent value in a great location.", "user": "JONNINHO", "date": "March 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 57830884}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "Small charming hotel in the heart of Prague. Artfully restored building the beginning of 15 century in harmony with the eclectic atmosphere of the city.", "title": "Charming hotel in the heart of Prague", "user": "MiglenaMilusheva", "date": "April 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 103128223}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Friendly staff, cleanliness, uniform but sufficient breakfast, free internet access, hotel taxi service, - all the comfort without pretensions to luxury.", "title": "Great Location, Wonderful Staff", "user": "Ken882", "date": "March 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 100281364}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Thanks for a wonderful stay in your cozy hotel emitting perfect authenticity.", "title": "Perfect in Every way!!", "user": "BlakieeNZ", "date": "February 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97400493}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Friends of Bulgaria", "title": "Fantastic staff!", "helpfulness": 1, "user": "Toadhollowtravellers", "date": "November 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 85805391}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We stayed at The Three Drums for a week in early March. The location cannot be beat. The best part was the staff. The ladies at the front desk were the most helpful and friendly people we encountered during our stay. Their willingness to help was wonderful. 2 things stick out. We had a light bulb burn out in the bathroom overnite and we mentioned this to the front desk at breakfast. The bulb was replaced by the time breakfast was over. The 2nd thing that really sticks out was when we borrowed a laptop and took it to the room. We were unable to get it to work and had to go back several times to ask them what was wrong. They were patient and helpful and when we still could not get the laptop to work they had it hooked up in our room when we got in one evening. The breakfast was varied and the whole place very clean.", "title": "An excellent place to stay in Prague, near Old Town Square", "user": "TowsonLen", "date": "October 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 84923815}], "location": {"country": "Czech Republic", "region": "Bohemia", "continent": "Europe", "city": "Prague"}, "stars": 3, "variance": {"poor": 17, "average": 48, "very good": 128, "terrible": 8, "excellent": 131}, "aka": "The House At The 3 Drums Hotel (u Tri Bubnu)", "slim_ranking": 0.455357142857, "description": "The house of the hotel was built in the 15th century. It consists of two adjoining buildings. The complete renovation to a small comfortable hotel was finished in May 2002 (the left building) and in April 2003 (the right building). The house is located in the historical centre of Prague in the street U Radnice, only 100 metres from the Old Town Square, opposite to the house where once lived the writer Franz Kafka."}