{"user_rating": 4.5, "review_count": 67, "name": "The Red Lion", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "All pubs should be like this one - expertly run with fantastic food, excellent service and great surroundings. The menu was enticing, using local ingredients and the food was really tasty and expertly cooked. Real ales included guest beer. The atmosphere was friendly and the service attentive without being in uour face. We shall be returning and staying on one of the five bedrooms.", "title": "Get here now - it's fantastic.", "user": "James F", "date": "March 30, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 156069818}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We are very lucky in that we live very near to the Red Lion. We have been there before and had a great time so when my mother came to stay it was an ideal place to take her for lunch. Good menu which is varied and covers most price points. Food was excellent. Service very good and attentive and the pub itself which is a good combination of old and new is pleasing to the eye and comfortable to relax in. In my opinion the Red Lion sets the benchmark for the area. Give the place a try you will not be disappointed.", "title": "The Benchmark", "user": "Border50", "date": "March 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0}, "id": 155229068}, {"rating": 5.0, "title": "Wish I lived nearer!", "text": "My mother, the hardest to please diner likely to visit, was treating 2 members of the family to lunch. She is almost local and almost a regular. Nuff said really. The Red Lion is 'just' a very good modern gastro- pub. Decor is more trad pub than modern pastels ( a refreshing change for this pint of ale drinker), lots of choice of alc, fixed price lunch menu and specials. Such a range almost makes one think 'it can't all be fresh' but our choices certainly were. I might argue that it all took a long time but in fairness we had 2 courses each and weren't in a hurry - but although busy it wasn't full - so I trust staffing increases for w/e evenings. The food was of a high quality with friendly service.", "helpfulness": 1, "user": "dazler01", "date": "March 1, 2013", "id": 153457884}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Must visit my mother more frequently!!!!", "title": "Another Saturday Lunch...", "user": "Mark D", "date": "February 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 153376859}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "This was our second visit to the Red Lion. It is about a 20 minute drive from home so within our normal range for going out to lunch. The first visit was so good that we felt it deserved a second just to make sure it was not a fluke. Well we were certainly not dissapointed and I wonder looking at some of the reviews here whether some people have the wrong pub!. For us this is the perfect place to go especially on a cold winters day as it was for this visit. The staff were just about perfect for us, helpfull and knowledgable unlike some places, the menu was excellent as was the wine list. The food we had was just about perfect I quite like to have to wait for food to be cooked rather than have it delivered in seconds as you know it has come via the microwave. This was certainly fresh cooked fresh produce and cooked beautifully. I can have no complaints at all about it, except maybe it was too good and that tempted me to go for a dessert and maybe I shouldnt (have to watch the waistline!) however it was worth it.", "title": "The Place to Stay to the North of Oxford", "helpfulness": 2, "user": "KITENICS", "date": "January 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150053129}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We stayed for two nights in early January here and had a really good relaxing break, looked after admirably by Lisa for whom nothing was too much trouble. She even went out and bought extra lighting help for reading in bed! The room though small had everything we could possibly need and Molton Brown toiletries a real treat. We ate here both nights and the food was delicious. Altogether a great find. We shall return", "title": "We felt really well looked after here", "user": "Gillian H", "date": "January 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149515513}, {"rating": 1.0, "stay_parameters": "Stayed January 2013", "text": "En route to an overnight break in Moreton in Marsh we decided to find somewhere to eat off the beaten track.", "title": "Horrific service, horrific food, avoid at all costs", "helpfulness": 1, "user": "Matreece", "date": "January 2, 2013", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 148617620}, {"rating": 3.0, "stay_parameters": "Stayed December 2012", "text": "From the outside the Red Lion Pub in Long Compton looked very pleasant. Inside, the decor did not disappoint. At the bar we asked if they had any tables for two. They had one table left which was cobbled together from an old Singer sewing machine stand which set us a long distance apart from one another but we didn't mind as we were hungry and were still able to hold a conversation - just.", "title": "Cosy place once you're allowed inside", "helpfulness": 1, "user": "Francesca B", "date": "December 28, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 1.0, "rooms": 3.0}, "id": 148199236}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We were told we would have to be quick choosing our food as the kitchen closed in 20 minutes. Once we'd been sat for a few minutes some other tables became free so when the waitress came over to take our order I politely asked if we could move to another table to which she rudely replied that everything had to be wiped down and re-laid. We never saw her again until our food arrived 20 minutes later so didn't bother moving.", "title": "Enjoyable and relaxing stay", "user": "186225Amanda", "date": "November 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 145646458}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "I ordered the steak ciabatta with horseradish sauce, my partner ordered the Smoked Salmon sandwich.", "title": "Lovely Village Pub with Gourmet Grub", "user": "Utnapishtim", "date": "November 5, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0}, "id": 144579292}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled solo", "text": "I stayed at the Red Lion for one night to visit family, so only really needed a room and breakfast. The Red Lion was very clean, comfortable and attractively presented, and at a very reasonable price. As I was staying on a Saturday night, I was concerned that there might be some noise, but I noticed none at all on that account, although there was some temporary noise from what I assume was the plumbing in the morning.", "title": "Just what was required", "helpfulness": 2, "user": "Oliver344", "date": "April 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 158606902}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "I didn't have a cooked breakfast, so can't really comment on the food, but the breakfast room is a very pleasant spot in which to eat it.", "title": "Excellent B&B off the tourist trail", "helpfulness": 1, "user": "Jan C", "date": "April 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 157674902}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "I received a most helpful and friendly welcome, and, although I didn't need to, would have felt confident of a good response if I had had to raise any issues.", "title": "Excellent!", "helpfulness": 1, "user": "Dista", "date": "April 4, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "service": 5.0}, "id": 156618585}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Recently stayed here for three nights, using it as a base for exploring the Cotswolds and Oxford. Very conveniently situated between Chipping Norton and Shipton-on-Stour. All the public areas and the rooms were kept scrupulously clean, and the service was excellent. We ate in one night; the food was superb, and the table sevice very good without being oppressive. It's hard to find fault other than to say that the room we had was slightly small for a double, but the adjoining en suite was huge. Suspect this was down the the constraints of providing accommodation in a very old building. Overall an excellent experience and would highly recommend.", "title": "Fantastic food & service", "helpfulness": 1, "user": "Oxscot", "date": "April 1, 2013", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 156267891}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "I visited this pub for the second time recently. (My son is lucky enough to work nearby, so this is his lunchtime 'local'.) I have to agree with some of the other comments below - I wish I, too, lived closer!", "title": "Hard to fault which is unusual for me", "helpfulness": 1, "user": "AndrewChapple", "date": "March 31, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0}, "id": 156178243}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Just one night but the service at check in dinner and breakfast was superb. Lovely old inn and the rooms have been used very well considering constraints on the sizes available. Spotlessly clean and very comfortable beds. Proximity to the main road and the lack of a fixed shower may have been a problem had we stayed longer but the excellent food and ambience made up for that.", "title": "A very pleasant stay", "user": "UKBells", "date": "July 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 167424716}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "First time for us and just the one night acting as stop over for a long journey and it was most welcome.", "title": "Fantastic country retreat", "user": "YorkshireJames42", "date": "July 3, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 166143612}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "The Inn is immaculate, our room, the pub and dining room are well presented and spotless. The location is ideal if you like country walks and exploring so we couldn't fault it.", "title": "The perfect country Inn", "helpfulness": 3, "user": "420Anna", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162156757}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Unfortunately the evening meal was marred somewhat right from the start. The veggie options were a bit limited so we asked if there was any chance of an omelette being made (which was on the menu 10 mins earlier) we were told this would be very unlikely. Quite disappointing especially when you're spending around £100 on meal and wine. That said, the service at the next day's breakfast was a complete contrast and we couldn't have asked for more.", "title": "Excellent in every way", "helpfulness": 1, "user": "Trudeolausen", "date": "May 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 162030877}, {"rating": 5.0, "title": "Perfect Country Inn Exprience", "text": "It was the 3rd time we stayed at the Red Lion Inn in Long Compton and we do want to come back again..Each time we are spending a night it is more lovely and perfect.The new colors and refubishments give a more unique experience. Lisa and her team give great hospitality and a warm welcome. The food was excellent and defenitely the best we had during our stay in the Cotswolds. A Country Inn to remember.", "helpfulness": 1, "user": "Paris44", "date": "May 26, 2013", "id": 161914371}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 1, "average": 6, "very good": 12, "terrible": 4, "excellent": 44}, "slim_ranking": 0.5, "description": "The Red Lion at Long Compton"}