{"user_rating": 4.5, "review_count": 672, "name": "The Marquette", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "Stayed with a group of friends for a night downtown. Upon check-in, the staff member asked if we were there for a \"girls weekend.\" When we replied yes, they upgraded our room to one on the executive floors which included security access, upgraded bathrooms, and access to a lounge with free food and drinks. The staff at both the front desk, executive lounge and of course, our bell man were amazing. Told us where to go and shop on nearby Nicollet Mall. Rooms were amazing! Beds were heavenly, view was great, and you CANNOT miss the steam showers. Absolutely amazing. It was hard to leave the next day.", "title": "Excellent!", "helpfulness": 2, "user": "mqt1984", "date": "May 21, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5186785}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "My husband and I had the PLEASURE of staying at this wonderful hotel for three nights last week, and already I wish we were back. This was one of the best experiences we have EVER had at a hotel, and my husband words at a AAA five diamond resort -- so we know what a good hotel should be like!", "title": "Fabulous location, service, and room. The Marquette can't be beat!", "helpfulness": 3, "user": "TKVDL", "date": "May 9, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5045606}, {"rating": 5.0, "title": "Wonderful Experience Overall", "text": "From the get go, the hotel won us over with the great location in the heart of downtown Minneapolis. It is within walking distance of MANY restaurants and shops, so you will never run out of things to do. Just leave your car parked and walk somewhere! It is really that easy.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "May 9, 2006", "id": 5045507}, {"rating": 5.0, "title": "A Wonderful Experience at the Marquette", "text": "The next thing that is great about the hotel is the room itself. Our room was probably the largest room we've ever stayed in that wasn't considered a \"suite\". The decor was beautiful, with new carpeting, lovely curtains, thick duvet and high thread count sheets, and very attractive furniture -- all done with an almost contemporary, modern feel. The huge desk, oversized sitting chair with ottoman, and overall very tasteful decor added to the beauty of the room. It was simply beautiful, and had a 14th floor view to match.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "May 7, 2006", "id": 5039858}, {"rating": 1.0, "stay_parameters": "Stayed April 2006", "text": "The best part about the hotel was the SERVICE. It is simply World Class. My husband and I arrived disheveled, tired and weary after a 6 hour drive from Eastern Wisconsin, and we were treated with a friendly smile by Paul at the front desk, who welcomed us to the Marquette. Immediately we felt at ease. When he found out we had never been to Minneapolis before, he proceeded to tell us how to get around town, and where we might want to consider visiting. He was so gracious!", "title": "Avoid this hotel. Did not provide the promised room", "helpfulness": 5, "user": "Route162", "date": "April 30, 2006", "detail_rating": {"service": 1.0}, "id": 5020706}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "Fantastic location within IDS Center so acess to Minneapolis skywalks and elevator to underground parking is a huge bonus in winter!", "title": "Great boutique hotel in downtown Minneapolis", "user": "PPTA", "date": "January 1, 2014", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 189211997}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled solo", "text": "Staff is friendly and helpful.", "title": "Superb stay in Minneapolis.", "user": "ChristopherEng1979", "date": "December 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 189135685}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "All the luxury and service of a large Hilton with a more cozy feel.", "title": "One night getaway", "user": "Fred Z", "date": "December 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 189067783}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "Stayed on Executive floor this holiday ( and last) and lounge access for breakfast, afternoon lounging and early evening appetizers is pleasant and onvenient.", "title": "Minneapolis in one night", "user": "Graham A", "date": "December 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 189094880}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "Rooms are nice size and well furnished with nice desk and several nice comfy chairs.", "title": "Nice stay but check your credit card!", "user": "cerny", "date": "December 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 189094189}, {"rating": 4.0, "title": "Nice Downtown Hotel", "text": "When I'm in town on business, I stay at the Marquette. It is by far one of the nicest downtown hotels I have ever stayed at, regardless of city. The lobby is nothing to brag about but the location. It is only a couple blocks away from the lite rail, which is a fast an inexpensive way to get to the Marquette from the airport. In addition, it is near shopping, dining and the skyway.", "helpfulness": 8, "user": "espj", "date": "June 19, 2006", "id": 5362224}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "The best part is ..... once you are in your room, they are nearly sound proof. I rarely hear anything which makes for a good night's sleep. The beds and the pillows are really comfortorable.", "title": "Above the rest", "helpfulness": 4, "user": "Solange72", "date": "June 18, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5357568}, {"rating": 5.0, "title": "Great Service, Wonderful Facilities", "text": "They also have a very nice exercise room. It gets busy though so timing is of the essence here.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "June 8, 2006", "id": 5324357}, {"rating": 5.0, "title": "Love the Marquette!", "text": "If you can afford to upgrade to the executive level, I would recommend it. The bathrooms are definitely roomier and have a steam shower available. Some of the other cheaper rooms have just a pedestal sink and a toilet which makes it hard to have toiletries in the bathroom. In addition, the executive level gives you access to the executive lounge, which includes a nice breakfast and nice happy hour with snacks.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 7, 2006", "id": 5318317}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "If I had any criticisms, they would be two-fold. The first would be that some of their shower doors are difficult to operate. One time, I actually got stuck in the shower and had to remove the shower door from its track in order to get out. The second would be that I wish they would include high speed internet in the price of their room. Many business hotels do these days and I think that would be a nice perk.", "title": "dont want to burst your bubble", "helpfulness": 5, "user": "edgycated", "date": "May 30, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5236603}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled solo", "text": "I am a Marriott Rewards, Starwood and Priority Club member and while all three programs had more affordable hotels in Minneapolis on the weekend I was there, I decided to give the Marquette a try given the glowing reviews here and being \"#1 in Minneapolis\". I've relied on tripadvisor many times and the reviews have always been reliable, but just this once, the reviews posted were very different than my experience at the Marquette.", "title": "Did I get the defective room?", "helpfulness": 9, "user": "islington3164", "date": "September 5, 2006", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 5772927, "likes": {"liked": "— If this was in fact standard, the room was very big.", "disliked": "— The hotel claims to be something it's not."}}, {"rating": 5.0, "title": "Fantastic Ezperience", "text": "On a good note, the Marquette is centrally located in downtown Minneapolis, but then again, so are the Marriott, Radisson, Crowne Plaza, etc. After circling the street twice looking for the valet parking (later learned that it was not manned during certain hours), I decided to self-park in the parking lot which the Marquette shares with other establishments. The Marquette lobby is very small and there were only two check-in clerks (for a line of about 6 guests), although the complimentary coffee and cookies were a nice touch. In a normal chain hotel, I would have no problem with 2 clerks for 6 people, but if you're touting yourself as the creme de la creme in Minneapolis, then you shouldn't have to wait 15 minutes to check in. I must say, the check-in clerk was very, very pleasant.", "user": "bonvoytrav", "date": "August 25, 2006", "id": 5709223}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "Upon arriving at my room, 1067 (avoid at all costs), I was surprised at the large size of the room which the check-in clerk had described as standard. But, it also seemed strange that there was no television in front of the bed. In fact, this is the first hotel I've ever visited where the tv is in a cabinet perpendicular to the bed and therefore, not clearly viewable from it. Although you can roll out the tv and turn it toward the bed, the cabinet door partially blocks viewing. Very strange.", "title": "Spectacular view", "helpfulness": 1, "user": "wearyworldtraveler", "date": "August 21, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5652169, "likes": {"liked": "— The meeting room and the hotel restaurant/bar"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "I started unpacking and while placing my amenity bag in the bathroom, I noticed there was no soap in the room. I called housekeeping and soap was delivered quickly by an indifferent member of the staff. When I opened the door to take the soap, I noticed a second door, inside my room and catty-corner to the front door, and opened it thinking it was a closet. Instead, I walked into another guest's room, complete with IPOD, laptop and all the guests clothes in full view; fortunately, he wasn't there and I promptly returned to my room and locked the door.", "title": "Nice Hotel", "helpfulness": 2, "user": "JPJ", "date": "August 21, 2006", "detail_rating": {"cleanliness": 2.0, "front_desk": 3.0, "location": 5.0, "value": 4.0, "rooms": 3.0}, "id": 5649795, "likes": {"liked": "— Location", "disliked": "— Mold in the shower"}}, {"rating": 5.0, "title": "Very Happy", "text": "I took a shower the following morning, prior to leaving for lunch with friends and then to the airport. The device to unplug the tub was not working so I manually pulled the plug from the bottom of the bath tub only to find a clot of hair. It was disgusting but as I was checking out, I had no option but to shower and get out fast.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "July 10, 2006", "id": 5448386}], "location": {"country": "United States", "city": "Minneapolis"}, "stars": 4, "variance": {"poor": 24, "average": 42, "very good": 176, "terrible": 16, "excellent": 414}, "aka": "The Marquette Hotel Minneapolis", "slim_ranking": 0.0816326530612, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Luxurious, contemporary-style hotel offers generous-sized rooms and some with computers and whirlpools."}