{"user_rating": 4.0, "review_count": 132, "name": "The Kenmore Inn", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Comfy room, close to downtown, nice staff. This made for a nice weekend getaway for our anniversary.", "title": "Enjoyed our stay.", "helpfulness": 1, "user": "Jason C", "date": "November 26, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 121055873}, {"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "While the Kenmore Inn is a beautiful home and historically fascinating, the noise factor is overwhelming. The first night we stayed in the Ville de Frejus room. The noise from the pub's outdoor patio just below our window went on until after 2:30 in the morning, although the pub supposedly closes at midnight. We got about 2 hours of sleep between the loud voices and the noise from the refrigeration system which runs late into the night. The next day we spoke with the management and were moved to the Betty Washington room (a more expensive room for which we were not charged extra). The room was very nice but again the noise was terrible - the constant opening and shutting of doors in the pub, the loud dumping of bottles after midnight, the refrigeration system, and the street noise. The breakfast was also disappointing and below par - small portions and no extras. This is not the place to stay if you are looking for peace and quiet. I was very disappointed.", "title": "Bring your ear plugs", "helpfulness": 3, "user": "Janice S", "date": "October 23, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 4.0, "location": 4.0}, "id": 119639178}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Kenmore Inn was without a doubt one of the best b & b inns we stayed at during a recent two month tour around south east USA. Superbly situated in the historical area of Fredericksburg and close to the downtown shops and restaurants it is a beautiful house with comfortable rooms and excellent service. The downstairs bistro was superb and we ate there both evenings and enjoyed excellent meals at reasonable prices.. And the bar next to the bistro is a hidden gem! The staff were all extremely pleasant and helpful to the extent that they were kind enough to send on to us in Australia four personal drinking glasses that we left behind! We highly recommend this Inn, and we found Fredericksburg to be a charming and very interesting town, well worth at least a two night stay.", "title": "WONDERFUL B & B", "helpfulness": 1, "user": "maragani", "date": "September 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 118337212}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Great Place, conferable, clean, inviting... food was excellent and the staff friendly, helpful and professional! The location is great (watch one way streets!). The bar and dining downstairs was really neat - great atmosphere. We would definitely go back again.", "title": "Very good B&B!", "helpfulness": 1, "user": "Tom S", "date": "September 18, 2011", "detail_rating": {"value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 118292964}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Absolutely lovely and welcoming place. Guiness on tap the basement bar, too. Good breakfast, pleasant rooms, and a good mattress. And easy strolling distance to Historic Downtown Fredericksburg and its emerging antique and boutique shops and a slew of good restaurants in recent years. Highly recommend dinner at Bistro Bethem - about three blocks from Kenmore Inn . . . just round the corner from a first-rate local coffee/expresso shop.", "title": "First-rate accomodations and great location", "helpfulness": 1, "user": "JonKukla", "date": "September 18, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 118273962}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled solo", "text": "I spent one evening at The Kenmore Inn. They were kind enough to allow me to drop my bag off upon arrival on a morning train so that I could tour Fredericksburg without it. When I arrived later in the afternoon to check in, they were having some computer problems so that I couldn't formally check in but they gave me the key to my room so I could go relax after a long day of site seeing. I was in the Marye's Heights room, which is different now from the photographs on the website (furniture-wise). The bed was extremely comfortable. On the downside, you can hear the conversation of those in the garden area below. I don't know if it was thin windows or through the air conditioning window unit. The breakfast was splendid and includes a choice of menu items. It was exactly what I wanted. The location is excellent right in the historic district.", "title": "Short but Sweet", "helpfulness": 1, "user": "SiteCer", "date": "May 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130587946}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "My friend and I stayed in the Washington suite (203). We had stayed in the same suite several years ago on a trip to Fredericksburg. However, even though their website said the inn had been updated, I failed to comprehend that the former 2 bedrooms was now a bedroom and living area with a sleep sofa. That was no big deal, but having no door on the living room was somewhat of a nuisance since every time one of us used the bathroom, it disturbed the person in this room. Other than the sleeping arrangements we were very pleased with our stay. The rooms are large and comfortable and we did not hear any noise from the other guests coming and going in the hallway. It is located on a busy street so you do hear some street sounds. The breakfast was excellent and plentiful. Having a coffee maker in the upstairs hall was a welcome touch.", "title": "Overnight stay", "user": "TheMcColes", "date": "May 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 130494183}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Kenmore Inn is nice place to stay in Fredricksburg, well located and operated by a very pleasant staff. It is not luxurious though and certain amenities need to be fixed, e.g. the second floor coffee station had a broken coffeemaker which was not replaced during my two nights' stay. The public lounge was not inviting; no comfortable chairs or sofas, no books or games.. Its main draw is location : one can walk anywhere downtown within minutes.", "title": "Kenmore Inn", "user": "vaart", "date": "May 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 130172139}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Had a very nice two night stay at The Kenmore Inn. We stayed in the Rose Room which was a nice size. The Kenmore Inn is an historic inn, not a traditional B&B. Our room was comfortable, the front porch and gardens are beautiful and a nice place to relax after a day of sightseeing. Our breakfasts were excellent--great choices, good food, pleasant service. The Inn is located within an easy walking distance of the historic downtown sites. It is also an easy drive to the Civil War battlefields. We had dinner in the downstairs restaurant at the inn on our second night. The food was wonderful and there is a very nice bar there as well. Only complaint about our stay would be that insulation is poor and noise travels easily.", "title": "Historic Inn with Great Location", "user": "cny12", "date": "May 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130111058}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "I enjoyed a lovely one night stay at the Kenmore Inn, but I wish I was able to stay longer! I stayed in the Marye's Heights room with private bathroom. The bed was very comfortable, there was a nice dresser with TV (didn't watch TV), and there was complementary sherry which was a nice touch.", "title": "Charming stay - great location", "helpfulness": 1, "user": "HikingWithWine", "date": "May 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129546074}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We stayed in the Kenmore Inn for 3 nights, one of which was during a thunderstorm when the lights went out! The staff had already given us torches but it really made the evening very atmospheric as the Kenmore is a beautiful period property. Outside you have the porch with swings and lots of comfortable chairs where you can spend your evening watching the world go by. It is very close to the historic center of Fredericksburg and, if you can get a space, you can park right outside for free. The rooms are small but brilliantly furnished. Ours had a fourposter bed and a fireplace. The bathroom, however, was small although it did have a jacuzzi bath and shower. The breakfast was fine in the main dining room and I would recommend the restaurant in the cellar - we had an evening meal of steak and creme brulee which was mouthwateringly good! I had confirmed out reservation with an online site before travel and unfortunately when we arrived the booking had not been confirmed. This was not a problem to the staff who gave us the room we wanted (you confirm which one you want at time of booking) and said they would sort it out with the booking agents. The staff also let me print off boarding passes etc on their own systems when leaving. I would high recommend this property is you want something authentic to the area.", "title": "Brilliant period property", "user": "Something-Different!", "date": "October 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 141832658}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "This is a cross between a B&B and an Inn. It is professionally staffed 24 hours per day like an Inn but the rooms are more B&B-like. It is an old place (circa 1824) but was updated in 2001. The rooms are spacious, clean and well appointed but a little dark for reading. Also, since the place is historic, it is cooled by window air conditioners which can get on your nerves.", "title": "Pleasant", "user": "wakefantwo", "date": "August 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 138645312}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The breakfast was very good and served on your schedule between 7:30 and 10. Also, there is a bar and restaurant in the basement so you don't have to go out for dinner if you are tired of driving. You can also walk a few short blocks to the historic district where there are lots of nice restaurants. If we were in the area again, we would definitely return.", "title": "Quiet night", "user": "Ron064", "date": "June 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132693603}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We had a very relaxing stay. Breakfast was excellent. The scones were delicious. Bacon unbelievable. Coffee...just ok and the coffee maker on the second floor did act up at times. But , a beautiful place. Quiet, but just a short walk to the center of town. The restaurant down stairs is a real hidden gem. Some of the best Tuna I have ever had. If I get back to this area again there is no doubt that I would stay there again.", "title": "A sweet retreat!", "user": "Shae B", "date": "June 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132563512}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Don't even hesitate when booking this B&B! It's a hidden treasure! I knew nothing about Fredericksburg, but I happened to stumble upon this Inn while planning a road trip to Manassas, VA. We were taking my daughter's boyfriend home from college and Manassas didn't have much to offer in terms of accomodations. We reserved the \"Washington Suite\" which offers 2 bedrooms and 1 full updated bathroom with a separate shower and jetted tub. The price was awesome considering a full gourmet breakfast was included. The only con was the room did not have central air, but we had a window unit that kept us cool even in July. I loved all the antique decorations and furnishings, but what I enjoyed most was the front porch swing. If you look carefully, you can see the Robin's nest from the front porch. I was able to zoom in and capture a photo of a baby bird ready for a feeding. This place feels like home and we can't wait to return, especially now that they are offering dinners. You can also follow them on Facebook. Enjoy!", "title": "Charming Historic Inn", "user": "DHLJP", "date": "June 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 131492260}, {"rating": 5.0, "title": "Lovely B & B", "text": "We stayed here one night on our trip through Virginia and I only wish we had more time! Perfectly located to take advantage of all Fredericksburg has to offer we hardly had to leave the hotel to experience the charm and hospitality of the South. the building itself is perfectly restored and the rooms very elegant and yet cozy. The restaurant and tavern were reasonable priced and the food was very good. The only place where improvement could be made is in the training of the wait staff, but even they were so nice and willing to help that it seems an unkindness to suggest it!", "helpfulness": 2, "user": "Paranormalnj", "date": "May 1, 2012", "id": 129166233}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The manager who checked us in went constantly above and beyond the call to satisfy our every whim and although we did not partake,they had a wonderful wine tasting scheduled, which she invited us to.", "title": "Charming B and B in Historic Fredericksburg", "helpfulness": 1, "user": "bloatedpig", "date": "January 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123127267}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "The house itself is uniquely built,used originally as a private home, refitting for hotel was done well so as to maintain the charm and 'family' feel while never losing the luxury of privacy.", "title": "A Step Back in Time", "helpfulness": 2, "user": "Antiqlvr", "date": "January 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122436949}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "I loved it and would happily go back!", "title": "Nice B&B in a great location", "helpfulness": 2, "user": "DelRayTravelers", "date": "December 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 122237527}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "It's a nice B and B with many rooms and a bar and restaurant in the basement, and a courtyard. Our room was nice, quaint and comfortable. The Kenmore is conveniently located for walking about historic Fredericksburg. The breakfast was very good; it was more like a restaurant style breakfast; no specific time to eat, no group eating, and a menu. This was a refreshing change from the more typical everyone-eats-at-once at a specific time, though maybe a little lighter breakfast.", "title": "Very Good B&B", "helpfulness": 1, "user": "jtchapman", "date": "December 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122154613}], "location": {"country": "United States", "city": "Fredericksburg"}, "stars": 3.5, "variance": {"poor": 11, "average": 20, "very good": 34, "terrible": 6, "excellent": 61}, "aka": "The Kenmore Hotel Fredericksburg", "slim_ranking": 0.380952380952, "description": "Located in downtown Fredericksburg, the Kenmore Inn (c1793) offers charm and southern hospitality in a beautiful intimate setting. Nine unique and elegantly appointed bedrooms all with en-suite bathrooms await your stay. We offer complementary sherry and bottled water in each room as well as a plated breakfast for each guest in our formal dining room. Located on the lower level of the house we have a European style pub and our garden restaurant & patio serving creative contemporary foods that will please the casual or refined diner. Whether you sit on our front porch swing and enjoy a glass of Inn-made sweet tea, take a stroll to the many historic sites and antique shops in town or relax in the parlor with a good book, the Kenmore Inn is your relaxing getaway. For visitors seeking classic southern hospitality, luxury accommodations and personalized service in a premier location, this Princess Anne Street Inn offers all that and more. Come see why this historic Inn catches the admiring eye of virtually everyone who passes by."}