{"user_rating": 4.0, "review_count": 676, "name": "The Buttes, A Marriott Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We liked this hotel because it was different from your average place. It was between a hotel and a resort. Closer to a resort, but not quite.", "title": "Unique hotel", "user": "TipsterTrip", "date": "February 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 97905648}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The property was great. Everything was integrated into the rock and landscape, so it felt like you were in a very natural environment. The hot tubs and walkways, along with the reception areas etc were built right into the side of the butte. The pool area was very nice - lots of chairs in various areas/levels, towels available poolside, waterfalls, hot tubs, and even a waterslide. It was very relaxing. As a note, the waterslide's pressure isn't really strong enough to push you down the slide, and the hot tubs are a bit secluded so it makes if feel even more relaxing.", "title": "Highway Noise!!!", "helpfulness": 1, "user": "IrishFan-80", "date": "February 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 4.0, "location": 2.0}, "id": 97799579}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The rooms were also nice. Ours was a king, which featured a separate bedroom and sitting area. The bathrooms were very nice as well. Fluffy bathrobes and a safe too.", "title": "Great Hotel, Unique Decor", "user": "OrganizedTourist", "date": "February 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 97658685}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "There is also a short walking trail up to the top of a butte that has a nice sunset view of the city. We ate at the casual restaurant, which had very good food for a reasonable price. The seating area had an open wall so that the outdoors and indoors flowed together.", "title": "Great resort hotel", "user": "lucycan", "date": "January 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 94484325}, {"rating": 5.0, "stay_parameters": "Stayed December 2010", "text": "I would say this is a great hotel for a family vacation. It's got all kinds of features that kids would love, there's something new around each corner and kids will love exploring. but adults would like it too.", "title": "Fantastic Hotel", "user": "tedsmith68", "date": "December 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91027033}, {"rating": 2.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "For how much you pay, unless you use the pool and amenities then it is not worth your money. The rooms were small and not all that nice. I would expect a flat screen TV in a hotel for this price. And what hotel makes you pay to park?? How else am I supposed to get there, by helicopter?", "title": "Way Overpriced", "user": "world31190", "date": "April 26, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 105629927}, {"rating": 1.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "My husband and I stayed in this hotel for the night of our anniversary. My husband reserved a room and we were given a \"Romantic Package\" by the sales rep with a free bottle of champagne on our arrival. Since we are a Platinum Elite member with Marriot, we expected a good treatment as we have experienced with them before. But disappointed this time when we did find the bottle of champagne waiting for us in our bedroom. My husband tried to call at first but couldn't find anybody to asnwer the phone and when he got hold of somebody, the person checked the details of our reservation and found out that we should have indeed a free champagne bottle included in our reservation.", "title": "Disappointing!", "helpfulness": 1, "user": "ruffles52", "date": "April 25, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 105507953}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "In short, we were told that somebody would bring the bottle into our room shortly, but two and half hours later, we were still waiting for it. Until we came back from the pool, the bottle was not in our room yet. Considering this is Marriot and we were a Platinum member for years, we were really disappointed with the staff of this hotel. I will not recomment this hotel...it's not worth the money!!", "title": "Unusual setting", "user": "scoper", "date": "April 16, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 104266405}, {"rating": 4.0, "stay_parameters": "Stayed March 2011", "text": "I stayed at the Buttes for a conference. It is well located in Tempe close to major highways.", "title": "Almost far enough away from the airport", "user": "Jim E", "date": "April 13, 2011", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 103945240}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "It has a very organic Frank Lloyd Wrightish look with part of the mountain actually incorporated into the lobby. The rooms are nice, nothing fancy,with all the usual amenities.", "title": "terrific hotel, great views, rooms, pools, facilities, service and resturants", "user": "Miusa", "date": "April 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103287403}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "Stayed here two nights for a business trip. The grounds and facilities are nice, although a bit spread out. It's located on a mesa in the heart of urban Phoenix. Great views of the fine gardens and natural beauty of the mountain, but also of the traffic jams on I10 and of the airport. The room was clean and updated, with the exception of the television (older 19 inch tube). The movie channel didn't work. Nice pool and exercise facilities. As others have noted, everything is extra: parking, wireless internet access, etc. This is odd since it's almost always complimentary at lesser Marriott properties. Would stay here again for the price I paid, would look at other options if it was their \"high season\" rate.", "title": "Nice place for leisure, less so for business", "user": "NorthstarTravellers", "date": "April 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 103049223}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled solo", "text": "I booked this resort through Hotwire.com since I had a few extra days after my conference. The resort is beautiful, set on a hillside in Tempe. I was greeted by staff and the check-in went fast. Parking did cost extra and was nothing special. It was a surface lot outside my room. I had asked for a room facing the pool/courtyard, but instead got one facing the parking lot. In the end this was probably the better option as there are only a few rooms that actually have a view of the pool. The rest that face the courtyard face a hill right outside the window and have no view at all!! If you are planning to get a room facing the courtyard, make sure it is on level 3 or 4!! The rooms were very comfortable and relaxing. However, internet did cost you even if you used the business center! The pool area was wonderful and relaxing, with lots of lush vegetation and waterfalls. They have 4 spas set in the hillside at various places and heights - offering spectacular views of the city and hillside. The waterslide was not operational while I was there, but that was a very small issue as they have 2 huge pools with waterfalls. The food was great and they offered room service. I got a very good deal on Hotwire.com, so I'm not sure what the actual price to stay per night was. However, you do pay for extras like parking and internet.", "title": "Nice Resort, But Pay for Extras", "helpfulness": 1, "user": "PsychRN12", "date": "April 5, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 102941732}, {"rating": 1.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "If I could give this hotel 0 stars I would. We just went this past weekend for Spring training, and I will never ever go back to this hotel. The first night there, my purse was stolen from the pool chair. Guess who it was?? A Pool Cabana boy! The police said with 100& certainty he had stolen it. The hotel management was rude, disrespectful, and horrible to us. In the end, there were no apologies given and not even a response after I had called and emailed repeatedly to get a refund. DO NOT STAY HERE!", "title": "Most horrible experience of my life", "user": "angsal222", "date": "March 18, 2011", "detail_rating": {"service": 1.0}, "id": 100612921}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "We were attending a family event and booked a suite for four adults. We had plenty of space and really nice service. We were surprised that with the cost of the suite that it didn't have a microwave in the kitchenette. Also, the room did not include wifi, which seems a little outdated.", "title": "Nice location, suite was perfect", "user": "Eddie12", "date": "March 18, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 100568157}, {"rating": 2.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Staff were very helpful and more than willing to help with any questions. The room service was very nice as we had breakfast in the room each morning.", "title": "No Way", "helpfulness": 2, "user": "armageddonsomemore", "date": "March 6, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 99117632}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "My husband and I spent a night at the Buttes before flying back to Atlanta. We loved the pool area and spread-out hot tubs. We enjoyed some cocktails at the pool. We also loved the added touch of always available cucumber and orange infused water and coffee/tea in the morning throughout the lobbies. The location is conveniently located close to the airport and the highway. It still feels like a remote resort. The room was comfy, not huge but nicely decorated.", "title": "Loved the ambience and pool.", "user": "SOnjana", "date": "May 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 107751917}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "This is a classic resort and could not be built today. Built into the side of mountain there is a real charm to this place. The staff was outstanding. Once you get used to the layout (and the steps - there are a lot of steps) you can really feel you are in a special place even though you are in the heart of the congestion of Tempe. Excellent spa services and food at every restaurant.", "title": "Classic charm in the Valley", "helpfulness": 1, "user": "Toomuchtravel59", "date": "May 4, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 106764583}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We stayed here overnight during a brief stay in phx using a discount rate. For what we paid it was a nice hotel with a great pool area. Our only issue was when we asked for a late checkout (our flight didn't leave until the evening and we wanted to spend the day by the pool) we were only give an extra hour and were told to be out of the room by 1pm. Given it was a Fri. morning and the hotel was very quiet we were surprised they couldn't be more flexible.", "title": "Quick trip", "helpfulness": 1, "user": "LuC_WA_10", "date": "May 3, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "location": 3.0, "service": 5.0, "rooms": 3.0}, "id": 106712035}, {"rating": 3.0, "stay_parameters": "Stayed April 2011", "text": "The rooms here really need some updating. We found the beds to be quite uncomfortable and you could barely make out a picture on the television. The pool area is nice, but $9.50 for a pina colada was a bit much.", "title": "Average hotel at resort prices", "helpfulness": 1, "user": "recently74", "date": "May 1, 2011", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 106345440}, {"rating": 1.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The location was nice as was the scenery. Otherwise, its really just an overpriced hotel.", "title": "Wedding Night Ruined Because of Terrible Service", "helpfulness": 4, "user": "edwinssally", "date": "April 28, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 105983067}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 33, "average": 87, "very good": 229, "terrible": 31, "excellent": 296}, "aka": "The Buttes, a Marriott Hotel Tempe", "slim_ranking": 0.0851063829787, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Impressive Mountaintop Conference Resort with view of Phoenix & Valley of the Sun located in center of historic Twin Buttes area."}