{"user_rating": 4.5, "review_count": 494, "name": "The House Hotel", "reviews": [{"rating": 5.0, "title": "Excellent boutique hotel in Galway.", "text": "This place was recommended to us by the TI office and was a little pricier than we originally wanted to spend. But the hotel was in a great area - walking distance to the Spanish Arch and other sights (but what isn't walking distance in Galway). The staff was extremely friendly and the hotel stunning.", "user": "Lynette R", "date": "June 1, 2013", "id": 162589045}, {"rating": 5.0, "title": "Trendy, Cool yet welcoming!", "text": "Our room was large and modern and the décor was very 'Alice in Wonderland'. The hotel bar was very busy in the evening, although we went out for dinner. The breakfast was delicious. The only negative about this hotel was that there is no parking - we had to park in a public garage a long block away.", "user": "Ronda K", "date": "May 31, 2013", "id": 162486699}, {"rating": 4.0, "title": "Nice quaint hotel in Galway", "text": "This place was great, loved the decor, can't beat the location and the restaurant/bar were really good. We did not have enough time here, but this hotel provided a great room with ample space and a very updated/modern bathroom that makes you feel like you are staying in a suite anywhere in America - very roomy with all the amenities you could want. As with all European hotels the elevators are smallish and there's a little bit of effort to get through doors/hallways to get to your room, but once there - perfect. The check-in staff, breakfast staff, afternoon reception - all great. If you are wanting an old school experience this is not for you, but I would highly recommend. Location is unbelievable as you can walk to every restaurant/bar/shopping/sight you would want to. Parking isn't exactly convenient but it didn't bother me and I am easily annoyed.", "user": "rreece", "date": "May 30, 2013", "id": 162380178}, {"rating": 4.0, "title": "Boutique hotel in Galway", "text": "Stayed here to 3 nights in May. The hotel is not particularly easy to find. However, once here I was made to feel very welcome and given a room on the first floor (just as well since the lift was out of order). The room itself was a good size and kited-it out in a boutique-style. The bathroom was small (and only contained a shower), but everything worked and fitted together well. The 'free' Wifi was good too.", "user": "DestinationHogwarts", "date": "May 28, 2013", "id": 162156523}, {"rating": 5.0, "title": "Hens Party", "text": "Breakfast each morning started at 8 AM, but the staff on the reception desk were at pains to point out that the buffet was available from 7. The range and quality of food available was pretty good. Even when I was not able to have the cooked breakfast (8 AM really is too late), I certainly did not go wanting.", "user": "TazzyT", "date": "May 28, 2013", "id": 162084049}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "My friend booked this hotel for us and I was delighted as it looks like a lovely hotel!", "title": "Gorgeous hotel but with a few disappointments", "user": "TravelBear87", "date": "May 25, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 4.0, "location": 5.0}, "id": 161772692}, {"rating": 3.0, "stay_parameters": "Stayed May 2013", "text": "The website pictures are true to what the hotel is like! Really lovely, clean, modern but with a funky twist. The bedroom was lovely and clean and so was the hotel in general. This hotel would have made 4-5 stars if these things had not let it down.", "title": "Cute as a cat", "user": "martinosllivan", "date": "May 24, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 161675038}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "- When checking in we were left waiting and wondering around. There was no one at the front house to check us in. We couldn't find anyone to ask and eventually the receptionist turned up.", "title": "Excellent hotel", "user": "jane C", "date": "May 20, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 161309146}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "- Although I love music and I'm young, getting to sleep was a nightmare. I have stayed in hotels with loud bars downstairs but this was another thing altogether! It was soooooo loud!", "title": "A sleek and modern hotel in traditional Ireland", "user": "slworld", "date": "May 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 161001264}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "- Getting served at the bar for cocktails was a looooong wait, then once they were ordered they took even longer to get to us.", "title": "Noisy but good food", "user": "Edmund R", "date": "May 16, 2013", "detail_rating": {"value": 4.0, "service": 3.0}, "id": 160897758}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Well located in the centre of Galway, a perhaps surprisingly thriving and active small city, the House Hotel offered comfortable if quite small rooms within an easy 2hr driving distance of Dublin airport.", "title": "Convenient location in central Galway", "helpfulness": 1, "user": "Intrepidtoo", "date": "June 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 164110446}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The hotel is popular, with a modern vibe, efficient reception, great cocktail bar and good restaurant. Lack of parking is overcome by a deal with a nearby carpark, 200m away although dropping off bags can be a bit of a hassle in peak hour traffic if the pull in bay is full. Rooms are compact, clean, well furnished and stylish, with modern bathrooms and represent good value for money. Windows are double glazed so street noise is not a problem. Although the hotel has a lift, there were a few stairs getting to and from our room and fire doors to contend with.", "title": "Not for family events", "helpfulness": 1, "user": "angelsguardian", "date": "June 13, 2013", "detail_rating": {"value": 3.0, "service": 4.0}, "id": 163919411}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "Great for an overnight stop, or a weekend break, very convenient for the main pedestrianized street of bars and restaurant. Breakfast was typical Irish fare, not bad, and efficiently served.", "title": "Excellent hotel", "helpfulness": 1, "user": "Paudge", "date": "June 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 163598459}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Came here with my family for a family celebration to have dinner, as it had been recommended. The restaurant was in a bar/lobby area and by 8.30 pm we couldn't hear ourselves speak as the music was so loud. It appeared to be trying to do too many things at the same time.", "title": "Great location", "helpfulness": 1, "user": "NGRG123", "date": "June 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 163307661}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "On a separate occasion came to meet some friends earlier in the day with a view to having a few drinks and something to eat, but by 6.30 were surrounded by 5 hen parties so conversation was impossible.", "title": "What a gem!", "helpfulness": 1, "user": "Kester B", "date": "June 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162603383}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Hi Aislinn,", "title": "Beautiful Fun & Enjoyable!!", "user": "venice1000", "date": "May 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 160571796}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Just a quick mail to say a big thank you.", "title": "Beautiful and Enjoyable!", "user": "reailtin", "date": "May 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 160484309}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "To the House Hotel.", "title": "Outstanding", "user": "JohnnyJay_Tucson", "date": "May 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160459221}, {"rating": 5.0, "title": "Home from home", "text": "I want to express my gratitude to you and all your staff", "user": "wattenwo", "date": "May 10, 2013", "id": 160290755}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "It gives me great pleasure to be sending this email and also to post a comment on Trip advisor in regards to Evelyn’s Hen Night that took place at the House Hotel on Saturday the 11th of May 13.", "title": "Some aspects very nice", "user": "RJames32", "date": "May 9, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 160202388}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "It's not in the central touristy part of London, but Hampstead is a great neighborhood with lots of interesting shops and good restaurants. And the trip into town is a quick one on the tube. We had a room in the main house, which was of reasonable size, well-appointed and clean. There was good water pressure, and a nice continental breakfast. It's a charming little hotel, but on a busy street so ask for a quieter room if you can get it. The only small complaint was the staff. They tried hard to be helpful, but were poorly equipped. Had a hard time recommending restaurants and when they did, they couldn't remember the names, provide directions or give phone numbers. Seems like management could solve that with a book of recommendations and info. Overall, very good for the money. Would definitely stay there again.", "title": "Nice Reasonably Priced Hotel in a Fun Neighborhood", "helpfulness": 2, "user": "rwoody", "date": "July 14, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "service": 2.0}, "id": 3667543}, {"rating": 3.0, "title": "Not as impressive as I thought", "text": "Stayed for two nights in the House Hotel. It was in a great area, and seemed nice. However, they advertise that there is Moulton Brown in the bathrooms - there isn't! They have it in the public bathroom and they sell it - so that didnt impress me for a start. The room was exceptionally small, but comfortable at the same time and nicely decorated. Also, our CD player didnt work.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "December 16, 2004", "id": 2885444}, {"rating": 4.0, "stay_parameters": "Stayed July 2004", "text": "Continental breakfast was served till 10. At 9:55 they started to clear everything away and made you feel uncomfortable for sipping over your coffee. The breakfast staff were very rude.", "title": "Romantic retreat in London", "helpfulness": 5, "user": "Kismet007", "date": "November 15, 2004", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 2825993}], "location": {}, "variance": {"poor": 27, "average": 41, "very good": 127, "terrible": 7, "excellent": 292}, "aka": "The House Hotel Galway", "slim_ranking": 0.0909090909091, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Welcome to the House Hotel, a luxurious boutique hotel located in the heart of Galway City. The House Hotel represents the ideal \"Home away from home\" with its cosy atmosphere, chic style, excellent facilities and personalised service. Features of the guestrooms include flat screen TV's with internet access, safe and crisp white linen that will guarantee you a comfortable night sleep. The Parlour Bar & Grill specialises in modern and international cuisine."}