{"user_rating": 4.5, "review_count": 521, "name": "The Zetter Hotel & Townhouse", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We were initially due to have our wedding reception here only to have our booking cancelled (the new chef didn't want to honor previous wedding bookings) and our deposit returned when we were due to do tasting. Luckily we managed to find somewhere else for the same date nearby (others weren't so lucky I believe). We still ended up staying at the hotel but were again unhappy with our treatment. Having been sent away at around 1:00 for an hour while our room was made ready it still wasn't ready 2 hours later. It was as if none of the staff knew what they were doing. The room was quite small but perfectly clean and comfortable so the nights sleep was all good albeit quite expensive. Check out the following morning was frustrating though as overnight the 2nd of 2 lifts stopped working resulting in hotel staff dragging lots of peoples luggage down 4+ flights of stairs. Again, just seemed really disorganised. For the money you'd expect a slick operation. Look elsewhere.", "title": "Warning - Think twice before organising an event here!", "helpfulness": 3, "user": "NickA79", "date": "January 25, 2011", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 94386912}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "I booked this hotel through Tablet hotels for my boyfriends birthday as a surprise. Being a frequent visitor to London I knew we didn't want to be in the tourist area and we'd primarily spend out time in trendy clerkenwell and around Brick Lane. This was perfect location.", "title": "Great location in trendy clerkenwell, brill staff + rooms!", "user": "chartley87", "date": "January 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94348146}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "On arriving to the hotel, about a 5 min walk from Farringdon station we met a very friendly receptionist. They checked us in and took us all the way to our room and showed us around and how to work the mood lighting etc.", "title": "really nice", "user": "madazen", "date": "January 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 94132571}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Brilliant sized bathroom with amazing shower and good lighting and large mirror (!!!) Bathrobes too :)", "title": "Great boutique hotel in trendy neighbourhood, weekend room special is superb value!", "user": "MichaelGTelAviv", "date": "January 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 93732119}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We had the standard room, very spacious for what we needed with a double bed with room either sides, wardrobes and a desk. We had a coffee machine outside our room which was free and various things inside such as an ipod dock, Wallpaper magazine and Penguin books.", "title": "2 cool 4 skool: Nice place but a tinsy bit pricey for what you get", "user": "Team_Panda", "date": "January 1, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 91326705}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "The great things about this hotel where the location, staff/service, the bed mattress quality and the quality of the breakfast (not included in standard room rate). The let downs where the tiny plasticy bathroom (descale the shower head please!), the double glazing that didn't keep out the traffic noise and the tiny queen size bed provided in superior rooms.", "title": "Overall Experience was 'so so'", "user": "wbBracknell", "date": "March 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 101909946}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "I really have no idea what the standard rooms are like but the superior was really only very standard. I had had fairly high hopes from the hotel's description of itself and some of the reviews; I can only guess that the most expensive rooms must be in a completely different class to the rest of the rooms.", "title": "Great hotel, great location", "user": "VGC40", "date": "March 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 100178806}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "There was a good attention to detail in places and some nice touches but overall I am afraid in my opinion there are plenty of other places in London creating the vibe and the style and doing it better.", "title": "Great hotel for a treat", "user": "nickfear", "date": "March 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 99087706}, {"rating": 2.0, "stay_parameters": "Stayed March 2011", "text": "My husband and I stayed at The Zetter on Saturday 12th March and had a really lovely time. You couldn't wish for a better location in London and the hotel itself is extremely welcoming, comfortable and with an incredibly high standard of service. The Guest Relations Manager went out of her way to make sure that our stay was really special, as a friend had informed the hotel that we were there to celebrate a 40th birthday; this made the whole experience a really memorable and enjoyable one, and the hotel is to be commended for this level of personal service. The rooms are relatively small but have everything you would need and expect from a boutique hotel. We overlooked St Johns Square which was extremely peaceful. The breakfast was fantastic too! Defintely one to recommend.", "title": "2am and no sleep....", "helpfulness": 3, "user": "gareth_curtis", "date": "March 5, 2011", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 4.0, "service": 4.0, "rooms": 2.0}, "id": 99058223}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "Whilst its certainly not cheap I liked most things about this hotel. I stayed in the cheapest/smallest room category and although its not big I've seen far smaller in other boutique hotels. The room was well designed and furnished. The bed was very comfortable with excellent linen, duvet and pillows. Quality products in the bathroom and \"rain\" shower (though personally as long as the pressure is right I prefer showers that are not fixed). Nice extras such as the free water, books, magazines. Free wi-fi and decent reliable tv/radio.", "title": "Good location, good design", "user": "PHoustonCBalara", "date": "March 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 98759590}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "The Zetter has for a number of years offered a great, stylish boutique hotel in a hip part of London. The addition of the Zetter Townhouse is perfect. More traditional in style to its sister, its design is eccentric English. You walk in to a welcoming lounge/bar, with plenty of sofas and a relaxed atmosphere. There is no Reception Desk - its more like arriving at someone's home. The bar offers a number of old fashioned cocktails, with English twists - such as a Gimlet with Nettle and a Rhubarb Kir Royale - all wonderful. The staff are extremely friendly and create a warm, relaxed atmosphere. We were there for a friend's 40th Birthday party - which was held in one of their private dining rooms. A lovely entertaining space and again, in line with the homely atmosphere. Dinner was excellent and large serving dishes provided on the table in a family style. A beautiful goats cheese and lentil salad to start, followed by beef stew, with mash and apple pie and creme fraiche - perfect food to share with friends. We were able to bring our own music and a great party developed. There are a few rooms upstairs - all very unique and comfortable. I would thoroughly recommend this place for people looking for a memorable vacation in London (away from large, corporate hotels) and also, as its close to the business district - it would be a real treat for a business traveller, who spends their life on the road. Oh - and also throw a party there - a truly great place.", "title": "Zetter Townhouse - Fantastic quirky addition to the Zetter", "user": "Globaladventure", "date": "June 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112845196}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "As always had a wonderful stay at the Zetter. Love the decor, service and quirkiness. The bistro was a disappointment as was the fact that the local metro is closed for another year but the hotel itself is homely and focuses on the small details (really well!) Love the fact it is super-sustainable too!", "title": "My home from home in London!", "user": "endlessummerLondon", "date": "June 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 5.0}, "id": 112225710}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "I rarely write reviews, but the service that my wife and I experienced at the Zetter Townhouse on our wedding night was absolutely exceptional and I really want to write that for the record.", "title": "The best way to start our married life", "user": "simonbfreeman", "date": "June 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 111952723}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "On arrival from the dinner we had to celebrate our wedding, the staff were really wonderful, the barman mixed a couple of fantastic cocktails which he then decided were on the house. We were shown to our suite which was huge and had the most comfortable bed I have ever slept in. And the crowning glory of it all was the breakfast in our room the next day which was the best eggs florentine either of us had ever eaten.", "title": "lovely,quirky, delightful", "user": "madley_10", "date": "June 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 111068533}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "A massive thank you to the Zetter for helping me organise a surprise stay and making our wedding day even more memorable.", "title": "retro cool", "user": "neilsonparc", "date": "May 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 110070664}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We stayed at the Zetter Townhouse last night for my husbands birthday and I had booked a standard room and mentioned by email it was his birthday. When checking in the lady wished my husband a happy birthday and had upgraded us to room 1 which was spacious and had a lovely bathroom with huge bath. After showing us to the room she returned a few moments later with a birthday cake! The service was exceptional throughout our stay and we had amazing cocktails here and at the Zetter. The townhouse is a must and the decor is fab!", "title": "Perfect in every way!", "user": "champagnecharlie1977", "date": "May 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108644551}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Stayed here for a friends wedding. Hotel is fantastically located, staff extremely friendly and helpful. The mattress was comfortable and the bathroom nicely done.", "title": "Friendly, clean, comfortable but small bed.", "helpfulness": 1, "user": "Henmeister", "date": "May 4, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 106829320}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "However the bad points were the bed and the price. We stayed in a standard guest room. The bed was to small for a 6 footer like myself. Room was small but thats fine as its in central London after all and the space was used well. However for a small bed in a tiny room I thought £185.00 for the night was a little steep. Not outrageous but don't feel it was value either.", "title": "Once again spoilt in this wonderful hotel", "helpfulness": 1, "user": "carabinier", "date": "April 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 106241847}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Would stay here again in a bigger room with a larger bed.", "title": "Style, comfort and fun in the Zetter Townhouse", "helpfulness": 3, "user": "sobakasu", "date": "April 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 104635679}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "My wife and I share a birthday and for some time now we have been to the Zetter to celebrate. This year the hotel surpassed themselves in spoiling us and making it a very special day, from a beautiful cake baked by Bruno Loubet himself, to presents, and Bucks Fizz at breakfast. All the staff seemed to know it was our birthday and helped make it a memorable stay.", "title": "perfect stay", "user": "dorikad31", "date": "March 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 102019403}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 4, "variance": {"poor": 19, "average": 47, "very good": 180, "terrible": 6, "excellent": 269}, "aka": "The Zetter Hotel And Townhouse", "slim_ranking": 0.154275092937, "description": "The Zetter Hotel & Townhouse has 59 bedrooms (Hotel) + 13 bedrooms (Townhouse) and suites which have all been individually designed to offer style, comfort and personality including 7 rooftop studios all with private outdoor terrace. Located in London's most fashionable neighbourhood, Clerkenwell boasts superb restaurants, excellent pubs, clubs,wine bars and a number of galleries and theatres. The Zetter Hotel is also home to the award winning Bistrot Bruno Loubet and ZTH cocktail bar."}