{"user_rating": 4.0, "review_count": 178, "name": "The Marina Inn", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We recently stayed here on our trip from Vancouver Island to Seattle (found the hotel through previous recommendations on this site). The room was a good size, clean and comfortable. We stayed on the second floor on the back side and found it to be very quiet (there weren't many other guests on the upper floor) but there is no elevator for anyone who has mobility issues - not a problem for us and I would rather be above others than having people over my head. The front desk staff were friendly and helpful. The breakfast room is small which could be a problem if the hotel was busy but didn't affect us. There was a good selection of foods for the continental breakfast. I would definitely stay here again if I was in the area.", "title": "Good value", "helpfulness": 1, "user": "Aldergreen", "date": "May 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 160605207}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "This hotel is one of the best values around. I attend the Tour De Lopez bike ride every year and this is the first year I decided to spend the night near the Lopez Ferry. Most places were way overpriced so I was happy I found Marina Inn. My only complaint is that the walls are pretty thin. You can hear the TV in the next room. It's not an issue if you have good neighbors but I can see it being a huge issue if you have rowdy neighbors. The rooms are cute, spacious and clean. Breakfast is included as well as dinner cookies. Overall, great stay. I'll be returning.", "title": "Affordable & Clean", "helpfulness": 1, "user": "PamelaJaneF", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 159916660}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "If you are looking for a very clean, reasonably priced place to stay in Anacortes then the Marina Inn is a good choice. If you are looking for views, fitness room, full-service breakfast -- you won't find them. If you are looking for helpful 24 hour staff, well working Jacuzzi rooms and a good night's sleep, you will find that at the Marina Inn.", "title": "Value Lodging - Done Well", "helpfulness": 1, "user": "Man-of-Mystery-007", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 157070655}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "We arrived here having been recommended from a sister establishment, the Orcas Inn, in the San Juan Islands. The Marina is even better. It has 24 hour reception service, bigger bedrooms and includes a fine breakfast in the price. The staff are very well trained, attentive without being obsequious and always available. The rooms are much better than I had assumed they would be, given the very reasonable prices. Spotlessly clean, warm and well appointed, the beds were delightfully comfortable, I have stayed in the Hilton and the level of service was comparable at a fraction of the price. This is a hotel that I would be happy to recommend to my family and friends without cavil.", "title": "Get more for your bucks, stay here and enjoy premium service.", "helpfulness": 1, "user": "Thomast1940", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 157030037}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We were pleasantly surprised by our stay at the Marina Inn. We were made to feel welcome right from check-in, where the staff were pleasant and there were fresh-baked cookies on the counter. The rooms were impeccably clean, the beds were comfortable, and there were chocolate mints at our bedside! That was definitely a little touch one doesn't expect in budget hotels! The only drawback to our room was that the bathroom was tiny, but that being said, it certainly had everything you need. The amenities provided were again higher quality than typical for a hotel of this type; they provide Rusk salon-quality products, which were lovely. We appreciate the included continental breakfast, which has hard boiled eggs, yoghurt, cereal, pastries, bagels, toast, juice, tea/coffee/cocoa, and fresh fruit. What more could you ask for?", "title": "Great value accommodation", "helpfulness": 1, "user": "JDH154945", "date": "April 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 156841267}, {"rating": 4.0, "stay_parameters": "Stayed March 2013", "text": "Flew out here for a few days to work at the Tesora Refinery. Hotel was real close to the site. Very clean rooms and good price. Downfall, they keep a cat in the lobby. So if your allergic to cats, the lobby will make u crazy. Still a decent place though.", "title": "Nice scenic views", "helpfulness": 2, "user": "Aaron D", "date": "March 15, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 154664968}, {"rating": 4.0, "stay_parameters": "Stayed February 2013", "text": "This was actualy my second stay at the marina inn. The rooms are comfy and clean and the nightly cookies are a special treat. The staff is super friendly and helpful. The rates are reasonable for those of us on a budget around $60 a night. My only complaint is the teeny tiny breakfast room is so small that the adults had to stand to allow room for the kids to sit.", "title": "Beautiful and safe hotel in anacortes", "helpfulness": 1, "user": "Amboobean", "date": "March 8, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 154040790}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "The Marina Inn is in my option the best place to stay in Anacortes. It's located close to a number of places to eat and close to everything Anacortes has to offer. Our room was perfectly clean and it was clear that the hotel staff takes pride in the work they do there. The staff is polite and friendly and even provided us with printed directions to some of the things we were looking for. You wont find a better hotel in Anacortes and will be the only place we stay from now on.", "title": "The perfect stay", "helpfulness": 1, "user": "Giovanni A", "date": "January 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150517855}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The Marina Inn was perfect for us as we visited with our daughter and son-in-law in Anacortes. The room was nice and clean. The staff was very friendly and helpful and the Inn is located in the heart of Anacortes, a great location. The breakfast is nice, although the breakfast room could be enlarged to accomodate a greater number of guests. We loved the fresh baked cookies waiting for us each night and the mints on our nightstand! We would definitely stay there again!", "title": "Very clean, helpful staff, great location!", "user": "Finnyspap", "date": "November 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 145852775}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "We needed a place to stay in Anacortes before catching the ferry to Victoria, BC, the next morning. The Marina Inn was just right: clean and quiet with friendly help and a filling breakfast to start the day. Rooms are not huge, but well-equipped. Beds were comfortable.", "title": "Just what we needed", "user": "BudgetTraveler94010", "date": "November 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 144887175}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "When I walked into the lobby I thought I had made a bad mistake. The carpet is reminiscent of the '70s ( UK) style. The corridor with the same carpet seemed dark and dreary, there being no external lighting.", "title": "Oh no! But then again..................", "helpfulness": 4, "user": "travguy", "date": "July 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 165971677}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "The room was different again. Light, bright and clean. Looked as if it had been redecorated for the season. The beds were comfortable with good linens and the furnishings in good condition and of light wood. The coffee maker produced better than hotel average.", "title": "Cozy little inn, good for a nights reprieve", "helpfulness": 3, "user": "AKranis", "date": "June 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 165719361}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "There were good toiletries and, quite a treat for US there was shower gel. Only confusion was whether to use liquid soap or shower gel to wash hair.", "title": "A Great Place to Stay", "helpfulness": 2, "user": "Rebecca H", "date": "June 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 165614000}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The breakfast room is tiny and seats only about 12 - for about 50 rooms. Standard cold 'continental' with fresh fruit although they did have hard boiled eggs one morning. Orange juice appeared to be full strength.", "title": "Great value for the price", "helpfulness": 1, "user": "love2dine50", "date": "June 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 165133121}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "In summary, I was wrong to be put off by first impression, should have trusted my research.", "title": "Great place to stay", "user": "Gregg T", "date": "June 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 163402798}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "This hotel is clean, neat, pretty, the rooms are great, the staff is great, and the rates are unbelievable! The lobby is cozy. The dining room was clean, with a beautiful view, and the menu selection was more than adequate. I'll definitely try to stay here every time I'm in Anacortes. There are warm chocolate chip cookies offered every evening in the lobby!", "title": "All-Around Fantastic!", "helpfulness": 1, "user": "Portia2272", "date": "June 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162987597}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The Marina Inn is on the main drag in Anacortes, so there's competition from other nearby, similiar establishments. The Inn is 2 levels, perpendicular to the street, with interior hallways, and free parking. Rooms have nice updated decor, and are spotlessly clean. Nice Gilchrist & Soames toiletries.", "title": "Excellent value!", "user": "lomimu", "date": "May 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 162237539}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The included breakfast had great selection, lots of food. Staff were really cheery, and it felt like there were lots of personal touches that set it apart from a chain. We were impressed.", "title": "Worth another try", "user": "fanfare50", "date": "May 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 161517131}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Nice little inn on the outter edge of downtown. The room was nice and clean with nice little amenitities. Nice selection of bathroom supplies.", "title": "Beware the Captain's Cabins!", "helpfulness": 3, "user": "wumpus7", "date": "May 20, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 161317875}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "The front desk staff were very pleasant and helpful. The beds were comfortable. At 6 in the evening they bring in fresh cookies for the guests. That was a nice touch.", "title": "Good for long-term stay", "user": "danibee33", "date": "May 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 161305330}], "location": {"country": "United States", "city": "Anacortes"}, "variance": {"poor": 2, "average": 18, "very good": 86, "terrible": 2, "excellent": 70}, "aka": "The Marina Hotel Anacortes", "slim_ranking": 0.5, "description": "Located in Beautiful San Juan Islands on the Fidalgo Island. The Marina Inn is close to downtown restaurants, shops and Marinas. Minutes from the Ferry. Exceptionally friendly staff, Remodeled rooms, New beds, Free wireless internet, Complimentary expanded continental breakfast, hat and air-conditioned rooms, cable TV, guest laundry,and much more."}