{"user_rating": 4.0, "review_count": 115, "name": "The Palms Cliff House Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2006", "text": "I stayed here for part of my honeymoon! This is perfect for a quite, relaxing departure from the craziness of planning a wedding. The hosts were very nice and their daily breakfast was amazing.", "title": "INCREDIBLE!!!", "helpfulness": 1, "user": "chriseggs", "date": "August 4, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 5559752}, {"rating": 5.0, "title": "I'm a Hero", "text": "Stay in the Bellisima Suite, best views and decor. i cannot wait to get back there on an anniversary.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 5, 2006", "id": 5425927}, {"rating": 5.0, "title": "The Relaxing Vacation", "text": "I live in Hilo and my wife had been wanting to stay at The Palms Cliff House Inn for quite some time, (she and her girl friends have gone there for afternoon tea) and she was always talking about us staying there, so I secretly booked us in to celebrate our 45th wedding anniversary. I have stayed in many resorts and hotels, and this one really impressed me. I thought it would be nice, but I was very surprised by what we experinced, and it was all good. Our room was very nice, it had a bamboo canopy bed, my wife said \"oh\" and \"Ah\" quite a bit. I'm not that romantic a guy on a daily basis, but I scored points for this stay. I even booked us a his and hers massage. My wife loved it. I think if you are looking for a quiet and romantic place, then this is the place for you. So my advice to other husbands...is book it guys, and you'll be a hero too.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "June 27, 2006", "id": 5393573}, {"rating": 5.0, "title": "ALOHA SPIRIT OVERFLOWING", "text": "Recently I received a gift certificate from a relative for a couple of nights at the Palms Cliff house. I am a well traveled person and I have been to many top resorts. I have a very busy schedule and I put in very long days. My Aunt felt I need sometime for myself and gave me a gift certificate for two nights. I took me a month to make the two days that I needed to use my certificate. It was well worth the wait. When I arrived, I was greeting by a local woman named Starr. When I was checking in, she gave me a Hawaii Savers Card for discounts on all the Hawaiian Islands. I told her that I read on the web site that they offered massages and I asked her is it was possible to arrange one for me. With no hessitation she called a therapist for the next morning and made the appointment for me. It was just what I needed. When she gave me a tour of the place, it gave me a feeling of peacefulness and the veiw of the ocean was simply beautiful. I got to my room and the first thing I saw was a very large jaccuzi set intoa bay window over looking the ocean. I knew immediatly that was the first thing I was going to do.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "June 23, 2006", "id": 5377493}, {"rating": 4.0, "title": "A Relaxing Retreat", "text": "The next morning I woke up and went to a very large lani, there was juice, purified ice water, a large assortment of teas and coffee. I made me a cup of hot tea and I was served a four course breakfast. It was so tasteful. The lady that served the guest was very friendly and full of conversation. I felt so welcomed. ( Sometimes I feel uncomfortable, because I'm single.) I sat and read the paper after breakfast enjoying the ocean scene. I went back into my room and watched a DVD and then my massage therapist came and gave me a massage right on my own lani.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 7, 2006", "id": 5323101}, {"rating": 5.0, "stay_parameters": "Stayed November 2006", "text": "Three of us stayed at the Palms Cliff House in mid-November, and loved it. The rooms were spacious and beautifully decorated. The common room was well stocked with books, games, tea, etc. The owners were very friendly and accommodating.", "title": "Outstanding!", "helpfulness": 3, "user": "NoJa", "date": "December 12, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6367040}, {"rating": 2.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "We were fortunate to have had sunny weather the whole time we were there, which was somewhat unusual for that time of year, but the Inn would be a comfy and inviting place to stay in any weather. The photos on the Web site are very representative of what we saw.", "title": "No Aloha, never again", "helpfulness": 9, "user": "wide-world-traveler", "date": "December 12, 2006", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 4.0, "rooms": 4.0}, "id": 6364874, "likes": {"liked": "— The view", "disliked": "— The poor attitude of the owners"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The Inn is well situated so that you can easily get to Hilo for dinner and shopping, or to the Botanical gardens, Akaka Falls, Waimea and many other sites. We highly recommend the Inn. Yes, it is more expensive than other choices, but we feel it is worth it to be tucked away in such a beautiful and restful setting. We would not hesitate to return!", "title": "Stunning!", "helpfulness": 3, "user": "CazN", "date": "November 5, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6058880, "likes": {"liked": "— Everything!", "disliked": "— Nothing!"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "This place sounded lovely and very Hawaiian--what a disappointment! I can't remember the last time I was treated with so little courtesy by owners of an inn property. The were aloof and couldn't be bothered--even patronizing. The rooms are nice, but overpriced. Much better value to be found in the big plantation homes in Hilo. It felt as though this is purely a money maker for them--no heart, and no real care about their guests. There are many better options, with much lovlier grounds and equally good views, in Hilo.", "title": "Not exactly heaven on Earth", "helpfulness": 8, "user": "mireddoc", "date": "September 9, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 4.0}, "id": 5785255, "likes": {"liked": "— comfort"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "We chose the Palms Cliff House hotel for our honeymoon and stayed in the Garden Suite for 14nights. What an amazing experience!", "title": "Wish We Had More Time!", "helpfulness": 3, "user": "cbearden", "date": "August 28, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 5718273, "likes": {"liked": "— The view", "disliked": "— A little more expensive than other accomodations on the Hilo side of the Island - but still worth it."}}, {"rating": 4.0, "title": "What is everyone's problem?", "text": "My husband and I spent our honeymoon at the Palm's Cliff House and loved it. The owners were polite and helpful when we had questions and yes they do keep to themselves but isn't that one of the reasons to go to a place like this? Breakfast was wonderful all week and we were always satisfied (the banana pancakes were my favorite)The view from the breakfast area is amazing and the lady that served us was always a delight to talk to.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 6, 2006", "id": 5315580}, {"rating": 2.0, "title": "Big disappointment", "text": "We had reservations to go to the other side of the island for one night and cancelled it because of how much we liked it here. Mr. Gamble was helpful when we asked if there was an available room that we could upgrade to at the last minute and all of our belongings were moved for us while we were out playing for the day.", "helpfulness": 8, "user": "madhackSanFrancisco", "date": "June 1, 2006", "id": 5289704}, {"rating": 2.0, "stay_parameters": "Stayed April 2006", "text": "Overall, if you are looking for a quiet romantic place this is it!", "title": "A disapointing Birthday present", "helpfulness": 12, "user": "Vagabond1946", "date": "May 1, 2006", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "rooms": 3.0, "service": 1.0}, "id": 5025371}, {"rating": 1.0, "title": "Disappointed Property", "text": "The place is gorgeous, but you feel like you're walking on tiptoes--that you're in someone's private home. The place is run by its owners, but they lack any kind of graciousness or Hawaii alohoa spirit. We stayed two nights and got one break from this--when a wonderful Hawaian woman served us breakfast. Much was written about the breakfasts, but they too disappointed. The sausages were great, but you have to be in love with sugar to eat the rest of the offerings. No internet, no complimentary afternoon wine, no fun. If we had not already paid, we would have left after the first night.", "helpfulness": 12, "user": "marilynreymann", "date": "April 28, 2006", "id": 5016942}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "The stay at this site was supposed to be a high point of a wonderful Hawaii trip from my bride-to-be to me as part of a Birthday present for my 60th Birthday: Unfortunately it was not ! We both were extremely disappointed in the overall stay. There is nothing special about the room but for its' price being higher than the other nice places we stayed at during our week on the Big Island. The young lady who checked us in was polite, but needs to speak up more loudly; we saw no other guests, so she would not have bothered anyone by speaking with greater volumn. The woman the next day at check-out {Her name is Starr} was, however, most polite and very, very helpful in helping us find some local businesses.", "title": "A romantic tropical getaway!", "helpfulness": 5, "user": "StephanieLuvs2Travel", "date": "March 10, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4599051}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "We took a two week tour of several islands and our last stop was Hilo and the Palms Cliff House. I couldn't have dreamt of a better ending to a picture-perfect vacation.", "title": "A great way to end our trip", "helpfulness": 3, "user": "kfio", "date": "October 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 10136920, "likes": {"liked": "— The view, the coziness of the room, the breakfasts", "disliked": "— Hmmm. Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We stayed two nights in the Tropical Dreams suite which was perfect for us. The lanai was beautiful and the room the perfect size. They offer wine (for a charge) in the room but have all the amenities necessary so you can bring your own bottle if you wish. The hot-tub was relaxing and private and one night we made use of their HUGE dvd collection and relaxed in the room but were still able to appreciate the great view outside of our room. The location of the B&B is great - close to Hilo (be sure to try Ken's Pancake Houes!) and Akaka Falls and a good place to stay if you plan to go to Volanoes National Park.", "title": "A Lovely B&B", "helpfulness": 4, "user": "ben17a", "date": "September 24, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8885073, "likes": {"liked": "— The views"}}, {"rating": 2.0, "title": "Disappointed", "text": "The breakfasts were superb (baked grapefruit, french toast and apple turkey sausage!) and the chef was very cooperative in packing us a breakfast to-go on our last day there when we had to catch a flight before breakfast was served.", "helpfulness": 7, "user": "annieduffy", "date": "July 25, 2007", "id": 8235415}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "I've already recommended this to my friends who are going on their honeymoon to Hawaii and I cant' wait to hear what they have to say!", "title": "Wonderful place!", "helpfulness": 2, "user": "liliuokalani", "date": "June 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8017461, "likes": {"liked": "— Service, views, location, room quality", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "My wife and I just spent 3 lovely days at the Palms Cliff House. The reviews on Tripadvisor were very mixed so we had concerns going in, but they were unfounded. The staff was very friendly and helpful; we arrived early and they took our luggage so we could go tour a nearby waterfall. The breakfast was lovely each morning and the staff was great. The fresh fruit came from the trees on the property. The property is beautiful, perched on a cliff overlooking the ocean. Each", "title": "Exquisite", "helpfulness": 1, "user": "madelinb", "date": "June 24, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7973701, "likes": {"liked": "— The room and views", "disliked": "— nothing"}}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 17, "average": 9, "very good": 22, "terrible": 7, "excellent": 60}, "aka": "The Palms Cliff House Hotel Honomu", "slim_ranking": 1.0, "description": "This 3.5 acre private estate offers sweeping ocean views perched ocean side atop a 100 foot cliff. Delicious full breakfasts are included in the regular room rates. Honored in Song and depicted in hula, this inn specializes in catering to couples seeking a quiet and romantic get away that embodies the feeling of the Old Hawaii we all dream about. Book your stay today."}