{"user_rating": 3.5, "review_count": 696, "name": "The Villages at Ocean Edge Resort & Golf Club", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Just got back from a weeks vacation at this resort. Maybe our expectations were too high but this resort leaves a lot to be desired. We booked a one bed villa for £1448 for the week. For this price we expected a decent level of accommodation. The villa had seen better days, the furnishing were badly damaged, the bathroom very small and damp and the queen bed had the worst mattress in the world. To such an extent we had to ask to move rooms as we could not suffer the bed in terms of its size and the condition of the mattress. After quite an ordeal we were moved to a room in the main part of the resort.", "title": "Very Average", "helpfulness": 1, "user": "TripadYork", "date": "June 18, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 7899098, "likes": {"liked": "— beach", "disliked": "— rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The staff were average, the food okay, the resort too big and the overall service slow, we had to call reception 3 time before we had someone deal with another issue we had.", "title": "terrific experience", "helpfulness": 4, "user": "inthehorizon", "date": "June 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7753432, "likes": {"liked": "— location, bike path access to cape code rail trail, property and friendly staff, lots to do on grounds", "disliked": "— shower water pressure"}}, {"rating": 3.0, "title": "Nice location..but very expensive!", "text": "The resort itself is very pretty and Cape Cod is lovely but we will not be returning to this resort.", "helpfulness": 4, "user": "ZacmanMontreal", "date": "May 18, 2007", "id": 7640932}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "A spontaneous weekend get away at this resort was just amazing. the mansion is very impressive. old period furniture, historic wood work is abound. staff were very friendly, accomodating and available if/when needs arose. check in/out was smooth and quick. the property is split into 2 separate estates however a convienent shuttle was available with a simple call to main desk to transport us over to the water side if/when we desired. there was the largest pool on the property within a short walk from our villa (located in arbor village. grounds were impecablly kept, construction was taking place for the new golf course but did not interfer with our stay. our villa was on the second floor and was spotless. furniture tastefull and very traditional of cape cod decor. the bed was comfortable enough for our 2 night stay. slightly more firm then i prefer but far from horrible. full kitchen in our unit very functional and a nice +. beach was clean and a good size. only negative was the shower water pressure. had dinner at bayzo's pub one night.food very good but a little on the $ side. would recommend", "title": "Lovely resort- stay in the hotel, not the condos!", "helpfulness": 11, "user": "rbellody", "date": "April 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7270292, "likes": {"liked": "— beach", "disliked": "— No water view from my room, but you could smell the salt"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2005, traveled with family", "text": "Ok....where to begin.....the hotel itself is very nice...but...we had a 2 1/2 bedroom appartment near the pool that was a little on the old side and could definitely have used a little TLC. The grounds are large and beautiful , however be aware that this hotel is divided in 2, and each side lies on opposite ends of a main road. So, if you find yourself on the golfcourse side, you will be a considerable distance from the ocean. The service at the front desk was a little iffy, I had the misfortune of arriving at the same time as a group of 10, and ended up waiting 45 minutes before anyone even said hello. I would have chocked this up to bad timing except that when we went to one of the onsite restaurants, we waited 30 minutes after seating ourselves and to our surprise, nobody came to see us, so we got up and left! I must admit that given the price I paid...(700/night)...I was expecting a little something extra...I don't consider myself a diificult person to please, so if you are a picky person in general, I would probably suggest you pass on this place. If however you are laidback and can stand a few incidents despite the extravagent pricetag, then go for it.", "title": "Overpriced and Boring", "helpfulness": 2, "user": "DGDavis", "date": "March 21, 2007", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "rooms": 4.0, "location": 1.0}, "id": 7197762, "likes": {"liked": "— The room was modern and nice", "disliked": "— Website was misleading, very expensive"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "My family and I have just returned from a holiday at the Ocean Edge.", "title": "Poor housekeeping standards at Ocean Edge Hotel", "helpfulness": 2, "user": "EmsmumDublin", "date": "August 20, 2007", "detail_rating": {"cleanliness": 1.0, "front_desk": 3.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 8458517, "likes": {"liked": "— nice pool", "disliked": "— poor cleanliness"}}, {"rating": 4.0, "title": "Ocean Edge Resort...Wonderfully relaxing, highly recommend", "text": "The location and facilities are good though you really have to take a shuttle bus to get anywhere as the resort is on 400 acres. Much of the accomodation is based on the opposite side of the road to the main hotel and beach.The buses certainly didn't come every 15-20 mins as promised.", "helpfulness": 2, "user": "djartzt", "date": "August 18, 2007", "id": 8447386}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Housekeeping left a lot to be desired. The villa wasn't vaccumed for almost one week until we requested same. Shampoo and toilet rolls were never replenished unless we left a note for the housekeeper. You don't expect this when paying over $400 per night", "title": "second time was not a charm", "helpfulness": 3, "user": "gimmel1", "date": "August 13, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 8402559}, {"rating": 5.0, "title": "Fantastic experience", "text": "Friend who lives nearby recommended OceanEdge...When I read the reviews though, I considered cancelling..which is why I decided to leave a review. This was a great place to stay. The service was absolutely 1st class every which way...we stayed in a three bedroom, three bath condo and it was clean and bright and the beach was just 1 minute away. It was great to have a private beach, a gym, a good restaurant all within a stones throw and to be able to order room service while having a fully stocked kitchen. When we realized the kitchen didn't have a frying pan, the hotel found one in their kitchen and brought it to us. I would definitely stay there again. Hotel is expensive, but worth it. Highly recommend if you want a quiet, relaxing vacation with the services of a good hotel. I'd like to go back every summer. One thing I would advise...don't stay at the golf course if you want to be near the beach...there are two parts to this hotel..and there is a shuttle that takes you from the condos at the golf course to the beach area...I would have found that a hassle...If you want the beach, stay at the condos right near the beach..There are two pools..one indoor and one indoor and a nice gym which was perfect for a \"vacation\" gym.", "helpfulness": 1, "user": "scnewhaven", "date": "August 9, 2007", "id": 8377834}, {"rating": 3.0, "title": "Not quite the truth", "text": "We stayed at OE three years ago and just returned from a long weekend. This time, the differences we noted were not for the better. While many staff members are friendly, there are at least an equal number who are not.", "helpfulness": 2, "user": "BrooklynMelody", "date": "August 1, 2007", "id": 8277075}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "our villa was musty smelling and the mattress was very uncomfortable; however, the grounds were pretty and it had everything we needed, i.e., washer dryer, full kitchen (no cremora for coffee), balcony, living room, separate bedroom", "title": "nice place, but mattress was very uncomfortable", "user": "pegga", "date": "July 15, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 8123528, "likes": {"liked": "— the amenities", "disliked": "— the mattress"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We stayed at Ocean Edge from July 8th-11th. Overall, the grounds and resort are gorgeous...very well maintained. The first two nights we stayed on the bay side at the hotel on the second floor. We were a bit disappointed to see the elevator was broken and we have a 2.5 yr old with tons of things to carry in, however it was fixed later the next day. The room was very nice and spacious, there were some things that turned me off, like the trash I found when opening the door to the safe in the closet, also the screen was ripped on our sliding glass door, which my husband fixed so that we could at least enjoy some fresh air without having bugs all over our room. There were little things that could have been better, but overall it was a nice stay the first two nights. The final night we stayed across the street at a one bedroom villa at Britterige Village. That was very nice also, but again there were little things like light bulbs out, and our sliding glass door didn't lock, the bed was very uncomfortable also. This could be a top notch place to stay if they paid more attention to the little details. Overall, we very much enjoyed our stay. We found plenty of things to do with a 2.5 year old, and I must say all of the staff were very friendly. We ate once at The Reef Cafe, which is a great place. Very kid friendly, very nice, welcoming people. We were pleasantly surprised. Overall, we enjoyed our stay, and even though it's a bit pricey for what you get, we will definitely go back again next year.", "title": "Very nice, but a little pricey.", "helpfulness": 1, "user": "Beachbum120", "date": "July 14, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8116463}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "Initially reservd a villa online then called and changed to a room in the \"mansion.\" On checking in, they had no room in the Mansion, despite me showing them the email confirmation I had received. They offered nothing to make me whole. Our room was down the highway, across the street, which proved very inconvenient for the meetings I was atttending at the Hotel. Not to mention poor access to the pools, beach and restaurants. One day we had to call 3 times over an hour, finally speaking to a manager, to get room service and final settled for just towels so that we could freshen up before exploring the Cape. Had I not been attending a meeting at the Hotel, I would have asked them to check availability at the Chatam Bars and I would have moved on. Instead, it felt like their screw up was my loss. The villas are basic, poorly situated, and if I am going to pay for a resort, I would like to stay at one.", "title": "Never Again", "user": "jonathan21", "date": "July 13, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 1.0, "rooms": 2.0}, "id": 8112977, "likes": {"liked": "— Leaving", "disliked": "— Poor Service"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We stayed at this property from July 5-July 8. We had a one bedroom condo on the golf course side, with a full kitchen, living room, washer dryer, dishwasher and balcony. We got it for 189 a night plus 12 dollar/night resort fee via travelzoo's special.", "title": "It's alright for a long weekend, but not a true resort", "user": "Bedhog", "date": "July 8, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 8079648, "likes": {"liked": "— that it's not really a resort!"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "Our unit was newly renovated in a tasteful decor with all new appliances. The mattress was very soft and \"mushy\". The maid service was erratic, one day I had to call twice before fresh towels were delivered to my room. It seemed like the house-keeping department was understaffed, and VERY poorly organized. Trash bags were left outside by the entry ways over night,==with diapers and bathroom waste visible in the transparent bags. In the morning chipmunks were poking into the bags..GROSS!!!", "title": "not so great....chatham bars inn much nicer", "helpfulness": 2, "user": "wayfaringmom62", "date": "June 25, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 2.0, "rooms": 4.0}, "id": 7987434, "likes": {"liked": "— cleanliness and could accomodate 4 people into a room", "disliked": "— no organized activities, too spread out, no entertainment, no games (shuffleboard, etc.)"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We just returned from a week's vacation at Ocean Edge Resort in Brewster, Mass. on Cape Cod. It is an outstanding , truly five star resort with magnificent staff and impeccable service. Every attention to detail is given, and client satisfaction is the highest priority of the entire staff. The grounds are immaculate, as are the properties. We had a large party (9 in total, with 7 kids in tow!) and stayed in a three bedroom villa, oceanside. The villa was incredible, and was like a home away from home. The housekeeping staff was fantastic, and took care of our every request in record time. The activities staff for the kids couldn't possibly have been kinder, and the kids all loved going off with them on their various adventures. We dined at 3 of the restaurants on property during our stay, and loved each of them. The wait staff was friendly and helpful, and our meals were wonderful. In particular we absolutely loved the Reef Cafe. It's comfortable, family and kid friendly, and has THE greatest staff ever working there. Ocean Edge is a place where you can go on vacation, park your car and \"push the easy button\"! From the moment we were greeted at the door , until the moment we left for home, it was the perfect experience. On a 1-10 scale from us, Ocean Edge gets a 10 plus, and I would highly recommend it as a destination vacation!", "title": "We love Ocean Edge Resort!!!", "user": "mehb9", "date": "July 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8249840, "likes": {"liked": "— The friendliness and client attentiveness of the entire staff", "disliked": "— We loved everything!!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "My husband & I, and our 2 older children spent a weekend in May at Ocean Edge. This was our first visit (will not be our last!) to the resort and we were delighted! We stayed in a 2 bedroom villa on the Bay side. The villa was spacious, tastefully decorated, extremely comfortable, quiet and immaculate! The beds extremely comfortable.....loved the pillows! We had brunch in the restaurant - the food...spectacular!", "title": "A little bit of Paradise", "user": "jmm1503", "date": "July 23, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8224280, "likes": {"liked": "— The spactacular grounds", "disliked": "— can't think of anything I didn't like"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Can't even begin to describe how absolutely breathtaking the grounds are! The perfect place for long walks, although there are many, many activities for those who like to keep on the move. There is a fabulous private beach, never have to worry about parking or crowds. There are 4 or 5 beautiful pools - (indoor & out). There is also a beautiful spa - haven't used their services yet, but definitely will on my next visit. You can access the Cape Cod bike trail right from the property. Of course, bike rentals are available. The staff was superb! Always pleasant, courteous and making sure we had everything we needed for an enjoyable stay.", "title": "A good place to stay but....", "helpfulness": 1, "user": "JordycatConnecticut", "date": "July 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 8193328, "likes": {"liked": "— Grounds, location", "disliked": "— Beds.....Terrible mattress"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "There is so much to see and do on this side of the Cape, such as, antique shops, great restaurants, Nickerson State forest, golf, and the Cape Cod baseball league.", "title": "Good space for the money - questionable cleanliness", "user": "dalcy3", "date": "July 15, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 8124013, "likes": {"liked": "— lots of space", "disliked": "— cleanliness"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Truly a wonderful vacation - can't wait to return!", "title": "Underwhelmed", "user": "Boston77", "date": "July 15, 2007", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 2.0}, "id": 8123732}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 100, "average": 114, "very good": 159, "terrible": 75, "excellent": 248}, "aka": "Ocean Edge Resort And Golf Club", "slim_ranking": 1.0, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "This Victorian-style mansion is a sprawling year-round resort."}