{"user_rating": 3.5, "review_count": 1443, "name": "The Westin Las Vegas Hotel, Casino & Spa", "reviews": [{"rating": 4.0, "title": "Friendliest casino staff on the strip", "text": "We just spent a weekend at the Westin, and enjoyed the friendly staff in the casino. The cocktail waitresses had real personality, as did the casino-floor help and even the security guard! Although smaller and quieter than the other casinos, we ended up spending our entire evening there since we were having so much fun. This was a much different experience than we had at Alladin - rude, rude, rude.", "user": "A TripAdvisor user", "date": "June 15, 2004", "id": 2190676}, {"rating": 4.0, "title": "Good hotel for Vegas fun!", "text": "The rooms are typical Westin - heavenly bed! The bathrooms are a bit smaller than a typical Westin. Located a couple of blocks from the strip - right near Bally's.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "June 6, 2004", "id": 2158264}, {"rating": 3.0, "title": "Nice Rooms, Lousy Pool", "text": "The Westin Casaurina was very nice. I was there for a conference. It is not on the same level as Bellagio or Venetian but still very nice and very affordable. The rooms were small but clean and of course the bed and bathroom were 'Heavenly'. The walk to the strip is tolerable and it was very easy to get to Bally's and Paris, Bellagio and Ceasar's Palace. For some patrons getting a cab was difficult due to the layout and nearby intersections. The casino is small as was the pool but acceptable. Overall, nice accomodations and no problems with room or any other operation of the hotel. If you have a few minutes, check out Elisa Furr in the lounge as she has a beautiful voice. I would definitely stay here again.", "user": "A TripAdvisor user", "date": "June 1, 2004", "id": 2143133}, {"rating": 4.0, "title": "Nice Staff, Excellent Beds, Small Casino:", "text": "Liked the lobby area (quiet - even though there is a small casino in the lobby, the slot machine sound is turned off). The rooms are nice - clean lines, great beds and linens, nice bath products. The only negative is the pool - woefully small for a hotel this size. They need to address this before I would stay here again.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "June 1, 2004", "id": 2142537}, {"rating": 4.0, "title": "Great place for a quiet stay in Las Vegas.", "text": "I found the hotel to be conveniently located, as most of my itinerary included stops at other hotels -Westin seemed to be centrally located between everywhere I needed to be. It's a short walk to Bally's, Bellagio, Caesar's & Flamingo. Undoubtedly, the best part of the stay, though, was coming back to that heavenly bed after a long night of partying! I only stayed 3 nights at Westin, then moved to the Riviera - what a HUGE difference! Wished that I'd stayed at the Westin for all 5 nights - I'll know better next time.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "May 25, 2004", "id": 2116562}, {"rating": 1.0, "title": "Didn't leave a good first impression never again!!", "text": "Where do I start? My anniversary started with arrival and check in dark. Yes a power outage in the hotel! Lobby dark no computers..that means no keys for the room everytime you needed to go to the room you had to have a bellboy take you top let you in. Rooms out of power, no lights, phone, no hot water! Resturant closed no electricity to cook. It was like a giant slumber party with everone hanging out in a dark lobby drinking. My husband could not take a shower for us to go out on the town for our anniversary..They did give us FLASHLIGHTS on check in! Power was out from 4 p.m. until after 11 pm. Another minus is they have the SLOWEST elevators I have ever seen! We waited sometimes 10 minutes to go to the casino! Also in case anyone at the westin is reading this..a mirror in the bathroom that dosen't fog all up would be nice..no fans? The only good thing I can say is the beds are wonderful. Rooms are average. Sorry but I won't be back.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "August 2, 2004", "id": 2355094}, {"rating": 5.0, "stay_parameters": "Stayed January 2005", "text": "We stayed at this location July 19 - 24. This is a great hotel in a great location. My wife and I, both agree that this is the place to stay. It has all the quality that can be expected from Westin/Starwood.", "title": "Great Location", "helpfulness": 2, "user": "lestaanderson", "date": "July 31, 2004", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 2347800}, {"rating": 5.0, "title": "Opulance with Style", "text": "It is walking distance to the strip and all the the action. It also has a small casino in the lobby, the resturaunt was good and all the staff we met were great. Whenever we go back to Vegas, we will be staying at this hotel. It was good to be so close to everything, yet removed from all the hustle and bustle when we were in our hotel.", "user": "A TripAdvisor user", "date": "July 29, 2004", "id": 2329952}, {"rating": 2.0, "stay_parameters": "Stayed July 2004", "text": "We were treated like royality from the moment we arrived at the hotel to the time we left. As a SPG member we enjoyed the private reception held on Tuesday evenings. Paul, the front desk manager even went out of his way to book additional rooms at Westin in Long Beach at below published rates. If you want quiet and special treatment, this is the place in Vegas.", "title": "You can do a lot better in Vegas than this.", "user": "SadieDelaney", "date": "July 20, 2004", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "service": 3.0}, "id": 2308903}, {"rating": 5.0, "title": "Give me your car keys !", "text": "My husband and I go to Vegas a lot and have stayed at many different hotels there. This hotel just isn't good enough for the price, although they do have a few nice features (lovely bed linens, nice showerheads). The rooms are tiny, almost European in size, and you have to walk around a dresser to get to the far side of the room. Forget the pool, it is impossible to go there no matter what normal time of day you might try - there are only a few lounges and they are always gone. The lobby and casino area is a disapointment, we were looking forward to the low-key style we heard this property offered, and have stayed at many Westins throught the States, so we thought we knew what to expect but this is barely above the standards of a 2 star property. (The rooms was CLEAN though, very clean, no problems there.) The check-in people were lovely, the valet people not. The hotel gave us some free magic shows tickets (Collin Foster) and he was great! You can hear everything in the rooms next door, when they cough, open their curtains, talk on the phone, etc. I knew way more about these neighbours than I wanted to. You can also hear everyone talking when they walk up and down the hallways and the security staff walking the hallways talking on walkie-talkies kept me up half the night! Oh, we ate the restaurant, very mediocre and the couple dining next to us must have felt the same as they left most of their food as well. Westin can do a better job than this and with little effort, YOU can find a better hotel to stay at in Vegas for the same price. Enjoy Vegas, but not here.", "helpfulness": 2, "user": "malokran", "date": "July 14, 2004", "id": 2295585}, {"rating": 4.0, "title": "Depends on your style==suited mine", "text": "I've stayed at the Bellagio, Venetian, etc. etc. so I know a bit about the comparisons. I prefer the Westin because: the beds are truly heavenly, the casino is small and quiet, I can find the elevator in 30 seconds, I can walk to the strip in 4 minutes, the shampoos and conditioners are top notch, the shower has two heads---so it is a pleasant respite from the strip without being far from it...and the price is right. I paid $134/night using AARP rates (you really don't need to belong to check the box, and no one asks---note: i do belong, btw). I wouldn't pester with the bar or the restaurant, but you are close to plenty of those. So, if you aren't in to the glitz of the strip and can't stand the noise and frenzy, but want to have it all at hand, this is a place where you won't go wrong.", "helpfulness": 3, "user": "aglazen", "date": "March 27, 2004", "id": 1748717}, {"rating": 5.0, "title": "Class Act!!", "text": "This hotel is a class act from beginning to end. Great location; easy parking; super fast & pleasant & easy check-in; great rooms. This is a real New York type boutique hotel, designed with adults in mind. Great clientele, great staff, great management, and a great breakfast. This will be my first choice in the future.", "helpfulness": 4, "user": "Prine041745", "date": "March 25, 2004", "id": 1746316}, {"rating": 3.0, "title": "The Westin Leaves One With Mixed Feelings.......", "text": "I stayed there March 15-18. Check in was about the best I have ever experienced in Las Vegas, absolutely no line, helpful staff. The rooms, while done tastefully, cannot overcome their heritage of the size of its predecessor Maxim. Bathrooms were fairly nicely done and beds are great.I found the staff of the hotel pretty friendly and helpful most of time. It is unfortunate that I cannot say the same for the casino staff. Although I found the location to not be a problem for going other places on the strip, I also don't mind walking pretty moderate to long distances.If a person has been to Vegas 5 or 6 times (as I have), the Westin is probably OK for a change of pace. I would not recommend it to first time visitors who want to be near the Strip action or experience Las Vegas downtown.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "March 22, 2004", "id": 1737019}, {"rating": 5.0, "title": "Great Stay", "text": "We stayed there 3 nights (March 18-21, 2004) and will return. The hotel has 800 rooms, small be Vegas standards, but we loved it. The small casino was a great place to end the evening and even though the hotel was sold out, you could get a seat at the table and have a good time.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "March 22, 2004", "id": 1736915}, {"rating": 3.0, "title": "Okay", "text": "The rooms were not large, but very nice and the bed snd shower were fabulous. They have a niced restaurant, where again you can get a seat, and the food was good and service excellent.", "helpfulness": 4, "user": "PabloPicasso3", "date": "March 19, 2004", "id": 1731609}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled with friends", "text": "We stayed here from December 30th to January 2. We very much enjoyed the Westin and I would stay here again without any reservations. In Las Vegas terms this is a small hotel. This is what made our stay enjoyable.", "title": "A Welcome Respite From The Strip", "helpfulness": 5, "user": "SLin96", "date": "January 11, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6574634, "likes": {"disliked": "— Tiny closets, elevators a bit slow"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006", "text": "Checkin for us was uneventful and I thought the hotel lobby was very nice. It has a small casino area, Starbucks, and their only restaurant which is a bit higher priced than a coffee shop.", "title": "Clean rooms with good amenities", "helpfulness": 1, "user": "aznheart81", "date": "January 1, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 3.0, "value": 5.0, "rooms": 5.0}, "id": 6533776, "likes": {"liked": "— The rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "Our room, on the 5th floor was fine. We loved the Heavenly Beds! More than just gimmicky. So enjoyable. Bathroom was fine if a little on the small side. The only down side - tiny closet.", "title": "Nice Hotel", "helpfulness": 6, "user": "WindowPlease", "date": "December 30, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6520562}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Our in room safe malfunctioned (dead battery) so they had to drill into it to open it. They were fast and prompt and when we returned to our room that evening a new safe had been put in our room.", "title": "good hotel", "user": "cquinn", "date": "December 13, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 6436853, "likes": {"liked": "— Room", "disliked": "— Service wasnt personal due to the number of people about"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "In terms of distance, I definitely agree that the Westin is almost as close as many of the hotels on the strip. In fact, I might even say closer. If you exit the Westin by the Starbucks, cross the street and enter Bally's, you can be in Paris Las Vegas in 10 minutes. The light to cross Flamingo Road can be very slow and that really is the only holdup. I didn't find the walk scary at all and one does not need to go take a taxi to go to the Strip. Then again, weather was really nice. The demolition site beside the Westin isn't that bad and we had no noise issues during out stays.", "title": "Wonderful Room, Wonderful Service, They LOVE dogs!", "helpfulness": 5, "user": "blueroads", "date": "December 6, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6340019, "likes": {"liked": "— Staff friendliness and welcoming attitude towards dogs", "disliked": "— Nothing, it was a memorable stay!"}}, {"rating": 4.0, "title": "Enjoyed our Vegas stay here", "text": "We got a great deal (about $75 / night) by booking early on the Westin website but after reading some of the reviews on this site, we weren't too sure what to expect. It turned out there was no need for us to worry, we had a great stay here for a week in July.", "helpfulness": 4, "user": "Dublin_Lad01", "date": "August 11, 2004", "id": 2442222}, {"rating": 4.0, "title": "Westin Casuarina just fine!", "text": "Our room was pretty big, bigger than I had expected. There was a nice seating area with a table by the window.The \"Heavenly Bed\" was without doubt the most comfortable I have ever slept on. We were very happy with the size of the bathroom aswell.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "August 5, 2004", "id": 2421952}, {"rating": 4.0, "stay_parameters": "Stayed July 2004", "text": "The location of the hotel is great, a few minutes walk to the strip. We usually walked through Bally's (the back entrance is just across the street) - it was a good way to avoid the 110 degree heat. You can also catch the monorail through that entrance - it takes you from one end of the strip to the other.", "title": "Fabulous Hotel", "helpfulness": 7, "user": "hoser9", "date": "August 5, 2004", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 2418101}, {"rating": 5.0, "title": "Return in a heartbeat", "text": "The casino is small with a limited selection of table games - roulette, craps, blackjack. They have a three card poker table which I never saw open. I did play there a few times - they always had a $5 table and the dealers were very friendly. For a wider selection of games, you need to go to the main strip but since it's so close, this wasn't a problem.", "helpfulness": 4, "user": "myjb", "date": "August 2, 2004", "id": 2362918}, {"rating": 1.0, "stay_parameters": "Stayed July 2004", "text": "We didnt eat at the restaurant but ordered room service one night and were happy with what we got. We didnt use the pool either although it did look a bit small for the size of the hotel. Found the staff to be helpful and pleasant.", "title": "For the same money, you can do way better - DON'T BOTHER", "helpfulness": 2, "user": "StayClassy", "date": "August 2, 2004", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 1.0}, "id": 2361909}, {"rating": 5.0, "title": "Great Priceline Deal", "text": "Hotel service was great, room was huge, shower was heavenly (double heads, double comfort!) Only downside was that 2 elevators were broken, making it very difficult for all to get downstairs at check out time.", "user": "A TripAdvisor user", "date": "March 16, 2004", "id": 1726617}, {"rating": 1.0, "title": "Could of done a lot better", "text": "My wife and I checked into the Westin on March 7th for 3 nights, I called in the morning and asked if there was any upgrades available because it was a special ocassion, I was told I was given a nice upgrade and when I arrived I asked what I had been upgraded to and I was told we have upgraded to a deluxe non smoking king room, my response was how did you upgrade me to this room when that is what I booked, the front desk person was very unhelpful and seemed very uninformed to SPG Platinum members benefits. I was never recognized as a Platinum member and received no benefits Of the SPG progam except for my USA today, I will say nice clean rooms with heavenly beds and quiet, but if your looking for the STarwood experience, maybe in a couple of years when they get there act together.", "helpfulness": 1, "user": "FrankVBoston", "date": "March 14, 2004", "id": 1725027}, {"rating": 3.0, "title": "Good location but nothing special", "text": "We are Starwood members and have stayed at many Westins before. The check-in and general services were at the usual Westin standards, but the rooms were not. The two chairs in our room were stained and the bathroom was tiny, especially the shower. Free wi-fi was not available in the room. It is located two blocks behind the Barbary Coast, so you are close to the strip. Right across the street is Bally's, so the monorail station is close as well. I would stay here again, but not if the weather were warm, as it is a good walk.", "user": "ChristieBett", "date": "February 18, 2007", "id": 6808684}, {"rating": 4.0, "title": "Warm & Welcoming Customer Svc. & Room", "text": "The Westin's rooms are comfortable and inviting. It's staff is superior to comparable hotels.", "user": "karattop", "date": "February 16, 2007", "id": 6802014}, {"rating": 3.0, "title": "Not bad, probably would stay on the strip next time", "text": "Suede Restaurant staff is wonderful, even if the food swings from great to so-so.", "helpfulness": 2, "user": "lamedic91", "date": "February 7, 2007", "id": 6752835}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Just returned from a two night stay at the Westin in Vegas, as other reviews stated this hotel definitly doesn't have the typical Westin feel to it. First the pros, comfortable bed, clean room, big bathroom, friendly staff especially at the lobby bar. Cons, a good walk to the strip in a bit of a seedy neighboorhood (we were warned at the rental car counter in the airport), small room, only one person taking care of check-in at 2:00pm on Superbowl Sunday, long line! No room service after 11pm and very very limited casino. If your going to stay here definitly rent a car, that made it alot easier to get around, valet was very fast and friendly. I would probably not stay here again because of the limited casino and limited night-life and the distance to the strip. If your on a budget though and you find a good deal it is definitly an option.", "title": "Vegas with some class", "helpfulness": 2, "user": "Awaygrrl", "date": "February 6, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 4.0, "value": 5.0, "rooms": 5.0}, "id": 6751633, "likes": {"liked": "— The comfy, classy rooms", "disliked": "— The odd shower head"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "Got a great deal on a Sat night. Right off the strip. Posh and quiet. Loved the Heavenly Bed! Totally non-smoking. Professional desk staff. The shower heads were weird with a double nozzle that alternated hot and cold. Couldn't seem to make it work like a normal shower. Great fitness room with little flat screen TV's at every station, fresh fruit and bottled water. Would stay here again if the price is right.", "title": "Best to avoid this particular Westin", "helpfulness": 5, "user": "KenInSanJose", "date": "February 5, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 6745550}, {"rating": 5.0, "title": "I wanted to move in to the Westin!", "text": "My boyfriend and I thoroughly enjoyed our stay at the Westin Casuarina July 4th-10th. The hotel provided a serene resort environment that was literally steps away from the hustle and bustle of the strip. We examined many flight/hotel deals before deciding on the Westin, and felt that we received a very good value for the money we spent.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "July 12, 2004", "id": 2291498}, {"rating": 5.0, "title": "Loved the Westin", "text": "The decor was so calming, as a previous reviewer mentioned, no crazy palm trees or bright colors on the bedspread. Even the artwork displayed in the room was great to look at, rather than a boring mediocre landscape painting you might find bolted to the wall of a less stylish hotel. I even commented to my boyfriend that I would love to have my home decorated by whomever designed the Westin rooms! The online photos don't really do it justice.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "July 7, 2004", "id": 2275236}, {"rating": 4.0, "title": "Good hotel, just get your act together", "text": "The Heavenly Bed and Bath were amazing, obviously. Everything on the bed was so clean, pristine and white. It was like sleeping on a cloud! I am even contemplating the idea of purchasing the pricey showerhead featured in the Heavenly Baths, so I can have the best showers I've ever had everyday! The spa was also a great experience. We got our first ever massages while staying at the Westin, and we were a little nervous going into it. However, the staff at the spa put us completely at ease, and we enjoyed a couples massage in a very relaxing setting.", "user": "dsimoes", "date": "June 25, 2004", "id": 2221592}, {"rating": 4.0, "stay_parameters": "Stayed June 2004", "text": "As others have mentioned, the casino area and pool were very small compared to big theme hotels on the strip. But, I like to think of the Westin as a haven away from all the loud crowded casinos, where you can spend a romantic evening looking out onto a fabulous view of strip (where we a spectacular view of the various July 4th fireworks displays), or enjoy a cup of Starbucks in your room or in the lobby cafe while you gear up for a day of exploring the strip or areas surrounding Las Vegas. I suppose if you're looking to be surrounded by an overly-stimulating atmosphere filled with the clang of the slots and crowds of the shops and casinos, you shouldn't choose this particular hotel. But if you want to be able to get away from all that, head for the Westin. I was very pleased with the relaxing atmosphere, and the exceptional service.", "title": "Table Gamers, Leisure Seekers will Love It", "helpfulness": 8, "user": "whitneysw", "date": "June 24, 2004", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 2220849}, {"rating": 5.0, "title": "Just Heavenly!", "text": "The staff, from check-in to housekeeping and valet, was so courteous and helpful. We were able to have an early check-in on the day of our arrival without any problem and many of our requests were fulfilled within minutes. The valet even called to check on the status of a tour we booked, after seeing us wait outside for over half an hour (he found out that our tour was running late). He was so nice and helpful!! The breakfast we ordered arrived precisely at the time we requested, and was hot and delicious. My only service \"complaint\" if you can even call it that, was that there were no refrigerators available during our stay, although they were mentioned on their website and brochure as being available by request. We were put on a waiting list, but I suppose other guests snatched them up before we were able to receive one. But it really was no problem, we just used the mini-bar fridge that was already in the room. We swapped out the always over-priced mini-bar stash with our own snacks and goodies, and swapped it back before checking out. It was a very slight inconvenience for us.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "June 18, 2004", "id": 2204735}, {"rating": 2.0, "title": "Not impressed", "text": "Stayed here for two nights on business. Hotel is about two blocks off the strip - have to walk through a seedy area to get to the strip, but it only takes about 5 mins.", "helpfulness": 3, "user": "bec060874", "date": "February 1, 2007", "id": 6725621}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "Problems:", "title": "The Best of Intentions....but missed the mark", "helpfulness": 4, "user": "Guinness5", "date": "January 29, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 6712809, "likes": {"liked": "— Location", "disliked": "— Amount of time staff took to get things as they should be"}}, {"rating": 5.0, "title": "A comfortable and well-located alternative to the large casinos", "text": "- Am a preferred guest, but ended up on low floor (even though traveling companions who are not preferred guests were on highest floor in building).", "helpfulness": 2, "user": "turtlez", "date": "January 19, 2007", "id": 6622642}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "- Light in bathroom burned out. Asked to have it replaced. Never done.", "title": "We really enjoyed our stay", "user": "ikepola", "date": "January 13, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 6589994, "likes": {"liked": "— The Beds", "disliked": "— The walk to the strip."}}, {"rating": 2.0, "title": "Not up to Westin standards", "text": "- Wireless internet is a pain to connect to. Kept asking me for an authentication code. Called front desk who connected me to someone else who told me I had to look on the TV for the code (????). Hung up, went on TV - no code. Only instructions for wired internet which also didn't work. Had to call desk again - spoke with nice girl who gave me the code I needed. All in all, took about 20 minutes to get connected. Never had problems like this anywhere else.", "helpfulness": 1, "user": "aurrora98", "date": "January 13, 2007", "id": 6589320}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "Bottom Line: We love Westin, this was a great value for our family, and the Hotel Staff made all the difference. For fussier reviewers, PLEASE PLEASE PLEASE don't expect a Wynn or Bellagio experience at the Westin. Go to the Wynn or Bellagio and stop whining.", "title": "Great Staff Make All The Difference at Westin Casuarina", "helpfulness": 5, "user": "UnbiasedReviewer", "date": "November 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 3.0}, "id": 6178395, "likes": {"liked": "— Smoke Free Hotel", "disliked": "— Elevators are a bit slow, but were fine for us"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "Reasons to Stay here:", "title": "Uneven service - but still a good deal.", "helpfulness": 4, "user": "Summitpark", "date": "November 18, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "location": 4.0}, "id": 6149142}, {"rating": 3.0, "title": "Decent, Not Great", "text": "The staff is incredible. Hotel was 100% booked during our stay and the staff were very professional and treated us like valued guests.", "helpfulness": 4, "user": "swaibel", "date": "November 13, 2006", "id": 6121354}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Close to the Strip but you avoid the Strip traffic and the convention crowds at the big hotels. Very easy to park and enter/exit the hotel. You can also walk to the Strip, which we did the night we went to see Mystere at the Treasure Island (GREAT SHOW!!!!).", "title": "You Surely Can Do Better", "helpfulness": 6, "user": "TRAVELINGLIFE", "date": "November 4, 2006", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 2.0}, "id": 6056569, "likes": {"liked": "— Good enough for low Lack of funds", "disliked": "— Location and ambience"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Close to great restaurants. We ate at Bahama Breezes (5 min away) and really, really enjoyed it.", "title": "great bed and shower", "helpfulness": 4, "user": "u2valleygirl", "date": "November 1, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 6035074, "likes": {"liked": "— Heavenly Bed"}}], "location": {"country": "United States", "city": "Las Vegas"}, "stars": 4, "variance": {"poor": 144, "average": 297, "very good": 550, "terrible": 108, "excellent": 344}, "aka": "The Westin Las Vegas Hotel", "slim_ranking": 0.362962962963, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 3.5}, "description": "The Westin Las Vegas Hotel, Casino & Spa is located just one block away from The Strip, Forum Shops, The Linq and Miracle Mile Mall. Our hotel is also just minutes away from the Las Vegas Convention Center, Sands Expo and UNLV campus and 5 miles from McCarran International Airport."}