{"user_rating": 4.0, "review_count": 198, "name": "The Fairmont Pierre Marques", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2004, traveled as a couple", "text": "My husband and I had a great stay at this hotel on our honeymoon. We were there in November, but the weather was perfect and we felt like we had the place almost to ourselves. The bar and restaurants on-site were good and we loved the pool. The beach was nice, but we hated that you couldn't get to it after they locked the gates at night. (No romantic moonlight walks...)", "title": "Quiet, relaxing honeymoon", "helpfulness": 2, "user": "TxAggieGirl", "date": "April 13, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 7347950}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "Our only negative was that the last night there, a loud, raucous party was going on in the room next door at an ungodly hour. We had to call the front desk a few times before they finally shut our \"friendly neighbors\" down. Needless to say, we were tired on the trip home. But overall, I would definitely recommend this hotel.", "title": "So Relaxing.", "helpfulness": 4, "user": "SuTravels", "date": "April 10, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 7326864}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "This was a wonderful relaxing hotel. I went with two other friends and we had a room with 2 double beds which we were all comfortable in due to the good size. You had to learn how to work the shower, but the water pressure and temperature were just fine. The food and drinks were good and reasonably priced for hotel food. The sound of the beach by the pool made it so relaxing, we had to force ourselves to leave the hotel.", "title": "Loved the hotel, Beware of the tourguides", "helpfulness": 12, "user": "BellaFromLA", "date": "March 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 7192119, "likes": {"liked": "— Friendly staff", "disliked": "— The water pressure"}}, {"rating": 5.0, "title": "Perfect beachfront relaxation.", "text": "I would advise not to travel over the Easter Holiday because a lot of visitors from Mexico City are in town which makes the traffic bad and more reason to stay at the hotel.", "helpfulness": 9, "user": "mochacat", "date": "February 17, 2007", "id": 6805592}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "We were in Acapulco for 9 days in January and stayed at the Pierre Marques. This was our second visit in 5 years. Our room was in one of the main buidlings on the second floor and we overlooked the pool and the Pacific. Our room was very clean and well kept the whole time. Every staff member was friendly and accomodating to the best of their ability (sometimes hampered by the language barrier)The pool is very nice and it is a plus to be able to have access to the Princess facilities as well. Their workout room is nicer than the Pierre's, for instance.I would definitely stay there again. I like the relaxed feel of the hotel. There are no loud deejays barking out comments and playing music by the pool to entertain the guests. The whole mood of the place is pretty laid back.", "title": "Pleasant and Relaxing", "helpfulness": 1, "user": "gee_ess61", "date": "January 21, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 12842978}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "The negatives I will mention were :", "title": "Great hotel in good spot", "helpfulness": 2, "user": "ASK1", "date": "January 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12707870, "likes": {"liked": "— The room"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "I know this sounds petty, but the wait staff around the pool was not as efficient or customer service oriented as in the past. I spent a lot of time looking for a waiter and that was not the case on my last visit. If we ordered food, then the waiter delivered it but never came back to check if there was anything needed, etc.", "title": "I would recommend the Fairmont Marques", "helpfulness": 2, "user": "cindyeo", "date": "January 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 12365513, "likes": {"liked": "— Great service", "disliked": "— Could have been a little more luxurious, I hate being forced into meal plans"}}, {"rating": 5.0, "title": "Wonderful Hotel!", "text": "Every Saturday night, there is a very loud party with a band and huge speakers held on the public beach which sits adjacent to the Pierre.This was the case on the Saturday we were there. fireworks were also a part of the \"festivities\" which lasted until about 3 am. The hotel is evidently used to dealing with this(but cannot keep it from happening) because they moved anyone who asked to another room farther away (via golf cart and just for the night) to accomodate them. Our room was about midway between the party and the farthest point away and the band sounded like it was on our balcony- no kidding. It only happened one night though so that is a plus.(and we didn't ask to move. I can only imagine what it was like for those who stayed on that end of the property!)", "helpfulness": 2, "user": "jandcstanton", "date": "October 14, 2007", "id": 10079151}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Another petty point, when we were there 4 years ago, the view to the water was fairly unobstructed. You could sit by the pool and look straight out to the beach and the water. Now, the hotel has erected grass huts that guests can sit under and enjoy the beach from. However, it does kind of mess up the nice view of the water for hotel guests on the actual property. Not a big negative, but one difference I noted.", "title": "Stay here- you will not regret it!", "helpfulness": 3, "user": "NJ151", "date": "August 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8381109, "likes": {"liked": "— Relaxing atmosphere", "disliked": "— Quality of food; more choice in Pierre's deli"}}], "location": {"country": "Mexico", "region": "Pacific Coast"}, "stars": 4, "variance": {"poor": 23, "average": 26, "very good": 61, "terrible": 14, "excellent": 74}, "aka": "The Fairmont Pierre Marques Hotel", "slim_ranking": 0.136363636364}