{"user_rating": 4.5, "review_count": 198, "name": "The Edinburgh Residence", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "I chose the Edinburgh Residence for our anniversary break because of the good reviews and the description on the hotel's website. When we arrived we were delighted to find a welcome card and chocolates in the room, but I was rather disappointed with the \"suite\" (No 19) as it was just a hotel room, although the bathroom was enormous. We were also aware of next door's plumbing! The following morning I mentioned my disappointment to the lovely girl on reception. When we returned from a day's sightseeing our belongings had been moved to suite 29, which was beautiful - twice the size of the previous room and much quieter. It had two sofas, a decent sized dining table for breakfast and four floor to ceiling windows looking down on the crescent below. We were delighted.", "title": "Very relaxing break", "user": "Cegidog", "date": "June 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 31297114}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We enjoyed the breakfasts and thought the location was ideal - clean, quiet and only 10 minutes walk from the centre. We also walked to the Botanical Gardens, in the other direction.", "title": "A Quality Residence", "user": "MLP19", "date": "May 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31074660}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "We ate at the Bonham (sister hotel - just down the road) one evening and enjoyed a lovely meal. We also ate at a great retro burger bar called Bells Diner in Stockridge, which is just 10 mins walk over the bridge.", "title": "Fantastic Hotel", "user": "Renee_Dubois", "date": "May 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31037963}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "All in all a relaxing break in style and comfort.", "title": "Highly recommended", "user": "KQAN", "date": "May 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31001301}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "The Edinburgh Residence is a beautiful place to stay, situated in a peaceful tree lined crescent in the west end of Edinburgh, a peaceful location with some lovely restaurants nearby and yet only a few minutes walk from Princess Street. We stayed here for a two night break in May, staying in one of the Grand suites. The room was immaculate and incredibly spacious and beautifully decorated with elegant furniture and and a lovely comfortable bed & sofas. The bathroom was vast, bigger than some hotel rooms! a stunning room, spotless with a large roll top freestanding bath and separate cubicle with powerful rainshower. The staff were wonderful and made us feel very welcome and were very helpful and efficient. Our stay at the Edinburgh Residence was a wonderful experience and highly recommended.", "title": "Brilliant!", "user": "friend63", "date": "May 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30791488}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "We stayed at the Edinburgh Residence from March 10th to the 16th, 2006. Our room had a very large bathroom with a Jacuzzi tub and separate shower. There was an entertainment center with a good TV with MANY channels and an accompanying DVD player. The Residence had movies that you could borrow to watch, which we didn't take advantage of, but was a nice touch. There was also a stocked mini bar with enough room to store your own supplies. The bedding and towels were clean and the room was made up meticulously every day. The lounge or sitting area had an honor bar, several places to sit, and a computer with free internet access for guests. The entire building felt more like the name implies-a residence. No chain hotel feel here. There was a lot of beautiful furniture and lovely woodwork. The Residence is on a quiet street that is still within easy walking distance from most of the Edinburgh sights. As for the staff, they were largely very good. However, the day before we left, I put in a request for an early wake up call and a cab to the airport. When we arrived back from dinner that night, I just happened to ask the (different) desk staff to confirm my request. My wake up call and cab weren't in the book. I don't know what possessed me to ask, but it was a good thing I did. Still, we enjoyed our stay at the Residence and loved the city of Edinburgh and Scotland in general. We would stay here again.", "title": "Enjoyed the Edinburgh Residence", "helpfulness": 11, "user": "CosmoC", "date": "March 23, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4727767}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "This a very good hotel: quite grand, spacious rooms; polite and professional staff; excellent service. It's sophisticated but not opulent. Excellent value compared to other edinburgh options.", "title": "Very good", "user": "coconutcrab", "date": "June 30, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 33586903}, {"rating": 5.0, "title": "Fantastic service all round", "text": "Myself and my wife stayed here after our wedding, and the Edinburgh Residence impressed us both.", "user": "GrumandJen", "date": "June 23, 2009", "id": 32963660}, {"rating": 5.0, "title": "Impressed", "text": "I had to change into my kilt etc prior to the wedding, and although my room wasn't ready the staff found me a room where I could get showered and changed. Our luggage was then ready and waiting for us when we arrived back after the big day.", "user": "Dickey", "date": "June 22, 2009", "id": 32902722}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled solo", "text": "The staff and service were excellent, as was the breakfast and the view from the room over Dean Village and Edinburgh was stunning.", "title": "I'm 70 and this place is much older.", "user": "bluotter", "date": "June 2, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 31407011}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "We are already planning our return visit!", "title": "Wonderfully Welcoming", "user": "VJStewart", "date": "June 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 31346992}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The Edinburgh Residence is perfectly situated in a quiet georgian crescent a short walk from the royal mile. The large suites are well appointed but a little worn around the edges. Staff were helpful and the car parking service was a plus. Breakfast was average quality but included. For £155 good value for a city centre location.", "title": "Good value and spacious if booked well in advance", "user": "PandEKew", "date": "September 19, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 42831046}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Stayed for one night through booking.com and saved quite a considerable amount on the going rate. We paid £95 and the website says rooms between £255-£350!", "title": "Edinburgh Excellence", "user": "Gina56", "date": "September 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39586016}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We thought this hotel was unique in that you had a microwave, fully stocked fridge at reasonable prices, full set of crockery and utensils, tea and coffee facilities with a percolator!", "title": "Overall a wonderful anniversary weekend during the festival.", "user": "SPDS1", "date": "August 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37907823}, {"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "The room we stayed in was a classic room which was huge, yet on the website it is stated as being one of their smaller ones!", "title": "Poorly managed hotel and not worth the price.", "user": "Seriouscomments", "date": "August 13, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 3.0}, "id": 37595969}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Staff here are excellent, and the parking service was also excellent, our car was parked for us and left in a secure parking area at the back of the hotel, and brought to the front door for us on departure.", "title": "Gorgeous big rooms... whirlpool bathtub tops it off!", "user": "Rita_Z_K", "date": "August 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 36868689}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The entrance to this hotel – centrally located in a quiet neighborhood a few blocks from Prince Street – is unassuming, but inside there are oak-paneled walls and high ceilings, a grand staircase and a comfortable lounge. The hotel is filled with eccentric 19th century artwork, old books and vases and other interesting bits and pieces. It has a charming 19th century atmosphere, yet it doesn't feel stuffy or old, and it's contains all the appropriate modern amenities.", "title": "Memorable hotel exudes Edinburgh atmosphere", "user": "ChristpherO", "date": "August 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36699093}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Our room, suite 5, was huge. We had a large living room, a large bedroom and two full-sized bathrooms, one with a separate shower and bathtub. We joked, half seriously, that it felt like the royal residences at Edinburgh Castle. From what I understand, this wasn't even the largest suite in the hotel. Our bed was extremely comfortable. The hotel staff brought a proper breakfast and a newspaper to our door every morning. Staff was friendly and professional.", "title": "Beautiful and grand, but not perfect", "user": "derringo", "date": "July 29, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 36112815}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "I loved that the historical atmosphere of the hotel meshed with the overall atmosphere of Edinburgh, without feeling tacky, phony or \"touristy.\" Occasionally you stay at a hotel that you'll remember for years to come, and for me this is such a hotel. I think costs at this hotel can be high, but we were able to secure a competitive rate by booking well in advance.", "title": "Grand Suite was perfect for 3", "user": "Via1135", "date": "July 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 36028906}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Stayed for 4 nights in a Grand Suite, roomy and beautiful though not prefectly clean as expected. The location and the spaciousness of the place can hardly be beaten though. Bathrooms are huge and the views are impressive. The privacy of the place is also incredible. Breakfast (which is served in the rooms by defualt, something I quite like) is not too impressive though, very limited selection and of not great quality. Other than that, it is perfect. I stayed in quite a few hotels in Edinburgh before and this is certainly the best value for money I had thus far.", "title": "Free upgrade", "user": "PAman", "date": "July 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 33690582}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "As a couple traveling with a grown child, a room for 3 is much more economical than 2 rooms. This grand suite was so spacious, we had tons of room for ourselves and our belongings. The location is a bit far from the main sites, but we enjoyed the walk and the up side is the extremely quiet location. Our dinner and the Bonham Hotel down the street was delicious and unbelievably reasonable with the discount from the Edinburgh Hotel.", "title": "Very nice hotel", "user": "CLE78", "date": "July 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 33632081}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 5, "variance": {"poor": 6, "average": 6, "very good": 36, "terrible": 5, "excellent": 145}, "aka": "The Edinburgh Residence Hotel", "slim_ranking": 0.102739726027, "description": "The Edinburgh Residence is a collection of 29 elegant, 5-star hotel suites through three adjoining Victorian houses in the West End of Edinburgh. Categorized as 'Classic,' 'Grand' and 'Town House,' the 5-star suites are more like apartments, with magnificent proportions that really allow you to spread out and make yourself at home. In some, the sitting rooms are adjoining, and in others they are self-contained."}