{"user_rating": 3.0, "review_count": 1744, "name": "The Park Lane Sheraton Hotel", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed September 2011", "text": "Half way through our stay in this hotel that has clearly seen better days. You enter through the plush Palm Court and it is downhill from there.", "title": "Disappointing even on a priceline rate - couldn't imagine paying full price.", "helpfulness": 3, "user": "sjh2311", "date": "September 3, 2011", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 117626111}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Checkin was an ordeal, before in terms of the length of wait, the challenge of getting a nonsmoking room and the difficulty of penetrating the English of the person checking us in.", "title": "We loved the old world charm and spacious room.", "user": "sparkareno", "date": "September 1, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "service": 4.0}, "id": 117549844}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "Our room was dingy (lights had to be on even during the day), the bathroom prehistoric with chipped tiles which were at the edges partially overpainted in a slapdash paint job.", "title": "Austerity Plan on the customers", "helpfulness": 3, "user": "BebeDragon", "date": "September 1, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 1.0, "value": 1.0, "service": 2.0}, "id": 117543144}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "We were woken at 0830 on a Saturday morning by an insistent chambermaid (our own fault for not using the do not disturb sign) and, as we turned her away, when we returned after 5pm the room was untouched. Another long wait at reception was required to get fresh towels.", "title": "Location –vs- Quality. Price to pay may be too high!", "helpfulness": 3, "user": "epickard", "date": "September 1, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 2.0, "value": 2.0, "service": 2.0}, "id": 117535546}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "I assume when the economy is better this hotel (which has a great location) will get a makeover but until then don't let anyone pretend it is five star.", "title": "GREAT hotel! Awesome location, good service, nice room - would definitely go back.", "user": "CaliforniaNewlywed", "date": "September 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "service": 5.0}, "id": 117534044}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "This hotel is rated as a 5 star hotel, and was sold to me with that expectation. As they say, expectation is everything. This is not even close to a 5 star property. Everything in this hotel is old and outdated, beginning with its lobby and front desk, which is inadequate to handle their guest load. It took 30 minutes to get checked in becaues the line was so long and it appeared to be that way many times during my stay. The HVAC system is a bit of a joke. It's either on hot or on cold. There is no in between. To balance things out, they put two space heaters in my room. 5 star? To be fair, the staff geniunely tried to make me happy, but there is no question I would have changed hotels were it not for the fact that it was prepaid through a travel agent and it was noncellable.", "title": "Old and outdated", "helpfulness": 1, "user": "Crticalone", "date": "September 10, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 2.0, "value": 1.0, "service": 3.0}, "id": 117890224}, {"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "I´m hosting the most popular prime-time travel-show in my country, spending 200 nights a year in different hotels around the world. \"Anonymous\", of course.", "title": "Believe me", "helpfulness": 8, "user": "Jackoffinland", "date": "September 9, 2011", "detail_rating": {"sleep": 2.0, "value": 1.0, "service": 4.0}, "id": 117876118}, {"rating": 1.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Every now and then I book a room through these exciting and trendy \"top secret\" -offers, with which you only know the room-rate, location and the rating of the hotel.", "title": "Avoid this terrible hotel at all costs, noisy and shabby rooms, it's vile'", "helpfulness": 3, "user": "rebalance", "date": "September 5, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 117712108}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "This far it´s been fun and worth it.", "title": "A tired old classic", "user": "Billingsontour", "date": "September 4, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 2.0, "service": 3.0}, "id": 117679341}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled solo", "text": "Believe me... If you´re checkin in (if you ever even have a chance to get the room you booked) to The Park Lane Sheraton Hotel in London, be ready to face the ugly truth. The only 5-star quality is the staff.", "title": "great location, needs to be refurbished", "helpfulness": 1, "user": "viajeraTR86", "date": "September 4, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 117673876}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled solo", "text": "I had read horrendous reviews on the Sheraton Park Lane. It does not deserve it! The hotel is old, but that is its charme. Check to toilets downstairs : they are probably the most elegant and charming toilets original from the '30s in town. The staff is great. Daniela, at the reception is friendly and very helpful. You don't have state of the art facilities but, hey, if you want transparent showers, go to the W (they are part of Starwood as well). Location is great: three minutes walk and you can enjoy a beer in one of the lovely pubs in Sheperd's Market. In the morning you can run in Green Park. One negative point? Internet connection at £ 16 a day is a rip-off. But that's a London problem. And I would add a basic kettle for tea making in each room. I just want the Park Lane to remain like it is and I do hope it won't be slaughtered like they did with the Savoy's refurbishment.", "title": "Excellent Value for money - Fab location & Staff", "user": "Francesco F", "date": "May 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 109673068}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "I have stayed in many London hotels but the Sheraton Park Lane continues to be a gem and always exceeds all my expectations.", "title": "Remarkable Stay ...... As Always!", "helpfulness": 1, "user": "Worldtravelguy", "date": "May 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109565827}, {"rating": 1.0, "stay_parameters": "Stayed May 2011", "text": "In the early 2000's, I spent approximately 300 nights at the Sheraton Park Lane, mostly for business, and enjoyed every minute. In the years since then, I have stayed numerous times for holiday whether it was alone, with friends or a loved one. Every time I stay at the Park Lane hotel I am reminded of the service excellence and attention to detail that only a few hotels in the world can deliver consistently. I have stayed at many of the top hotels in Europe, US, South America and Asia but none can compare to the Sheraton Park Lane.", "title": "An absolute disgrace and huge disappointment", "helpfulness": 3, "user": "sickofripoffs", "date": "May 22, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 1.0}, "id": 109366734}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "I would highly recommend the Sheraton Park Lane to anyone visiting London. Great location close to everything, impeccable service, remodeled rooms but tastefully retaining the classic british architecture & warm staff. You can't go wrong with this hotel!!", "title": "great value if you can get rooms at 30% less than neighbouring 5 stars", "user": "sunshinetravellers", "date": "May 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 108826497}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "I had the misfortune to stay at this hotel for two nights recently.", "title": "A Winner Again-Our Second Visit", "helpfulness": 1, "user": "Love vacation time", "date": "May 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 108399956}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "My friend booked afternoon tea at the Sheraton Park Lane Hotel in London for her birthday. Before the tea we had read a lot of reviews on Trip Advisor which weren't very complimentary and we were worried about the quality of the tea and the service. I must say however, that we had an excellent afternoon tea. It was in a lovely, comfortable room with delightful surroundings. The food was delicious and filling - we didn't need to eat for the rest of the day - and the service was faultless. I felt that it was such a nice experience and the reviews on Trip Advisor are, in my opinion, not reflective of the afternoon we had. I would definitely recommend this hotel as a good value and tasty afternoon tea in London.", "title": "Excellent Afternoon Tea", "helpfulness": 2, "user": "DelorisPurdy85", "date": "May 15, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0}, "id": 108364533}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "Small rooms, creaky floors, very old building. No special charm. Not even on the Main shopping streets....there are better hotels in the area.", "title": "Bad value for money, better deals are available", "helpfulness": 1, "user": "udaypilani", "date": "May 14, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 108151708}, {"rating": 3.0, "stay_parameters": "Stayed May 2011", "text": "I booked the trip through lastminute.com as I usually do for short leisure trips to London. The hotel was graded as 5 star but I am pretty sure this must be self classified as the bedrooms are certainly not of 5 star standard. The beds are comfortable yes, but the decor is pretty dated and our bathroom was in need of some attention. To use the hairdryer I had to get on my hand and knees to plug it in under the desk and my daughter rang for room service on and off for an hour on Sunday morning with no answer. On our last night we moved to a very small twin room where it was impossible for two people to open their suitcases at the same time. As I had chosen to pay a little bit more than usual I was expecting something rather special. I was disappointed.", "title": "Great location but hotel rooms disappointing", "helpfulness": 1, "user": "GillD1954", "date": "May 11, 2011", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "location": 4.0, "service": 3.0}, "id": 107772766}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "I had booked this through last minute as a secret hotel, and when I looked at a the reviews I was horrified, however I had noticed that the manager had replied to each e-mail and e-mailed the hotel prior to my arrival. My e-mail was replied to promptly and courteously.", "title": "Great service and good night's sleep,", "user": "silva02", "date": "May 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 107472370}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "On arrival i was upgraded and all staff at the front desk and at the concierge desk were polite and attentive. The hotel does need refurbishment, but my room was dated in decor but was scrupulously clean, large for London standards. The bathroom again clean and good bath and shower facilities with decent water pressure and also a powerful hair drier!!", "title": "A great week in London", "user": "GordCummings", "date": "May 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 107132240}, {"rating": 2.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "Stayed only for one night but the hotel feels institutional. Room has large white portable aircon unit plonked under window & all furniture shoved aside. No luxury touches. Had to drag suitcase through lounges to find reception if you arrive via Piccadilly. No door staff, no greeting. Watery juice in reception. Better it was not there. Toiletries were cheap & nasty. (Always a good indicator in my view.) Average shower. At least it was clean with comfortable beds. Good location but 5 star, I don't think so. Lots of choice in this part of London.", "title": "Can't believe the star rating", "user": "Lindavisitor", "date": "May 27, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 110110639}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Stayed for 4 nights, 3 paid and 1 on starwood points. Pre-paid rate on sheraton.com was excellent and beat other competing luxury/nicer hotels in a central location. Definitely nice to find a relative \"deal\" with the british pound. We stayed 2 nights in standard room and 2 nights using points to upgrade to superior room. Standard room was 4 star experience, superior room was much nicer. Found the standard room a bit tight with suitcases, pack&play for our child, etc. Rather old looking bathroom in standard room but very clean and outstanding shower and hot water pressure. Superior room had view of big Ben across green park in the distance. Lots more space, good layout, nicer bathroom, etc. Didn't have any meals at hotel so can't comment on food. There are multiple breakfast and other food options just a quick walk away for anyone not interested in a big overpriced hotel breakfast. Beautiful hall area where high tea is served. We elected to have our tea at Ritz which was just down the street - probably a slightly fancier experience although certainly stuffier than what I witnessed at Park Lane. Entrance and reception area to hotel is somewhat counter-intuitive in location (to back, not on Picadilly). Obvious pedestrian entrance in front is not very accessible with stroller or with luggage. Overall great hotel, central location close enough to green park tube station and would definitely consider staying there again.", "title": "Great location, good value in nicer London hotels", "helpfulness": 2, "user": "JDK12345", "date": "May 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 110031479}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "I booked this hotel as it had a great rate, and I know the location is perfect, Sheraton is a good brand. I, then read some very disturbing reviews on TripAdvisor, that made me decide to cancel most of the stay.", "title": "Outstanding Experience", "user": "KWG75", "date": "May 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 109954446}, {"rating": 1.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "When I walked into the hotel, it was an absolute pleasure. I must tell you that these negative reviews are not true at all. The rooms are big. Electic plugs are there, close to the study desk and in the bath. The bed is very comfy, the bath is spacious and offers shower separate to tab. The staff is very friendly.", "title": "Worst hotel we have stayed in", "helpfulness": 1, "user": "mattwagstaff", "date": "May 26, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 109922527}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "I would greatly advise staying in the hotel. The room was overlooking Green Park and provides a magnificant view on the park.", "title": "Cannot Wait ti Come Back, Again!", "user": "EuropeanbyHeart", "date": "May 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109887693}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "After paying almost $600 USD a night to stay here I feel ripped off. The rooms are old, run down, dirty, and not up to starwood standards. I am a starwood gold member and prefer to stay in starwood hotels for my travels but this hotel is a disgrace.", "title": "Can't believe starwood allows this hotel to operate", "helpfulness": 5, "user": "novatravelreview", "date": "June 4, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 1.0, "service": 3.0}, "id": 111488861}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "When we arrived our room's toilet did not work. We were then transferred to another room where the toilet barely worked but required lots of \"finicking\". The towels on the towel rack were dirty and had hair on them (gross). The walls were scuffed and badly painted over. The ceilings had signs of water damage and shoddy patch work. The carpets were old an smelly and the non-smoking room smelled like smoke. Our bathroom was almost the size of the bedroom but was half empty and a total waste of space. The television did and could not face the bed. The bed was stained and the headboard was chipped. Breakfast was almost $50 usd for a cheapo buffet. Need I go on? Please save your money and stay somewhere else.", "title": "Great Location in Mayfair", "user": "journeymaid48", "date": "May 31, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 110652085}, {"rating": 2.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "I don't care what anyone says about location, I can stay in the most luxurious hotel in NYC for this price and be in any location I want...then again a dump like this would never survive in NYC.", "title": "As bland as Yorkshire Pudding!", "helpfulness": 1, "user": "Nats68", "date": "May 30, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 110530879}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "The hotel is older and the rooms are huge which for London is very nice. You can walk to Green Park Metro stop in about five minutes and connect to anywhere in the city. The staff was helpful.", "title": "Best Location, Attentive Staff", "helpfulness": 1, "user": "drosen85", "date": "May 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110291391}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The room was uninspiring, and the staff were completely disinterested. Other than being conveniently located, there is absolutely no reason to book!", "title": "Very comfortable older hotel with excellent service", "helpfulness": 1, "user": "Tshowalter1", "date": "May 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 110158545}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "We stayed one night in a suite. Very hard to reach their front desk by phone; for 2 hours couldn't get through to them. Some concierges were better than others. Service was fairly good. Food and beverage tasted OK but my wife got very stomach sick right after eating breakfast there and it may have been the food. Room size was decent and the bathroom was large but these old English tubs are quite dangerous to get in and out of and the room itself had poor air conditioning and heating and we slept all night without clothes on because we couldn't open the windows and couldn't control the room temperature. Engineering might have solved the problem but it was after midnight and my baby was sleeping so we just lived with it. Hotel needs a major HVAC overhaul and modernizing of its bathrooms.", "title": "Not my favorite hotel", "helpfulness": 4, "user": "ivanciment", "date": "January 1, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 6533087, "likes": {"liked": "— good price for what i got", "disliked": "— just not a great hotel considering what it should be"}}, {"rating": 2.0, "title": "Nice location", "text": "We ended up enjoying our stay at the Park Lane. The location was great. My wife enjoyed the tea, and the family really enjoyed the English breakfasts. We were able to experience the two-faces of the Park Lane. We checked in and were told they had no connecting rooms in their hotel. We were given two very small rooms that were without a doubt the worst hotel rooms I have ever stayed in. The bathrooms were so antiquated and unkept that it was ridiculous. I told the night manager we need to change rooms, but no help. The next day I told the day manager that I would be departing early from our 4 night stay and would be searching for a new hotel. He asked if I could pay an additional 40gbp per night per room, and he could get us two suites. I agreed, and we went from staying in the likes of a homeless shelter to two nice hotel suites. Amazing.", "helpfulness": 3, "user": "CamFamily", "date": "December 18, 2006", "id": 6458426}, {"rating": 2.0, "title": "overall o.k., but best avoided", "text": "The fitness center was the best--it looked like they got some equipment from a torture chamber from the Spanish Inquisition.", "helpfulness": 3, "user": "lupo_mm", "date": "December 2, 2006", "id": 6317218}, {"rating": 3.0, "title": "Not that bad...", "text": "The Park Lane Sheraton has had its best days in the 1930s and does not appear to have been refurbished since then. You could say its charming, but you could also say it's a rip-off. A hotel of this category and price range should at least have clean carpets and wallpapers and contemporary sanitary faciltiies. The Park Lane Sheraton does not, at least not the room I was staying in. I won't try it again.", "helpfulness": 1, "user": "kfoster19", "date": "November 27, 2006", "id": 6182468}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "After reading some of the posts, I contacted the hotel directly to voice some concern about my reservation. The hotel returned my email and assured me that the hotel was absolutely up to standards. As a Starwood member and frequent visitor to other Starwood properties, I had traded in points for this trip - so I didn't want them wasted!", "title": "Not Luxurious, but adequate", "helpfulness": 1, "user": "socoman74", "date": "November 27, 2006", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 6181591, "likes": {"liked": "— Location", "disliked": "— Price"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "I was in London in July for business. As I am a Starwood Platinum member, I usually try to stay at Starwood hotels. Unfortunately, my favorite in London (the Belgravia Sheraton) switched ownerships. So on this trip I tried both the Park Lane (where I had stayed previously) and Le Meridien. The Park Lane is a beautiful hotel -- but many of the rooms leave a lot to be desired if one is using North American standards. Also, I found the staff to be rather abrupt. There was confusion over a coupon for breakfast (I thought they were offering a free breakfast because I was a Platinum member -- no it was simply a discount on an already exorbitant price). In contrast Le Meridien was delightful. The rooms are smaller at Le Meridien but the staff and ambience are delightful.", "title": "Not my favorite Starwood hotel in London", "helpfulness": 2, "user": "Joe K", "date": "September 12, 2011", "detail_rating": {"value": 2.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 118039491}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "I read all of the reviews before I went on my trip and was prepared for the worst but the hotel wasn't as bad as the reviews indicate. During the trip I realized the biggest issue was one of expectations.", "title": "Your Experience will Depend On Your Expectations - Better than the Reviews Indicate", "helpfulness": 1, "user": "RedRover123", "date": "September 12, 2011", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 118028311}, {"rating": 2.0, "stay_parameters": "Stayed September 2011", "text": "This is a 5 star UK hotel. It isn't a 5 star AMERICAN hotel. If you are expecting it to be a 5 star US hotel you will be disappointed. I would say it ranks as a 3 star American hotel. For London, this hotel is considered quite posh and impressive. Several people from the UK asked me where I was staying and all 3 were visibly impressed when I told them.", "title": "3 stars masquerading as 5.", "helpfulness": 2, "user": "Overeasyplease", "date": "September 12, 2011", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 5.0, "service": 2.0, "rooms": 1.0}, "id": 117964129}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Yes, this is an older hotel and yes it isn't a 5 star by American standards but the hotel isn't in America. It's in London and for there it's considered 5 star. It's in a great location and has a great reputation. It's also just a few short blocks from the Ritz.", "title": "Excellent Location but get the right room", "user": "lotsofspots", "date": "September 11, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 5.0}, "id": 117952564}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Some of the reviews like the staff and others didn't like the staff. The staff are all very polite and helpful. They are not all \"friendly\" in the American sense but again they are British, not American. Unlike Americans not all of the staff pretend to care and they don't 'kiss up' to the guests. That's just how the British seem to be. Again, that doesn't mean they aren't helpful and polite as they all were. Some were just friendlier and cared more than others.", "title": "Nice Hotel - Tiny Room", "user": "AJWW4764", "date": "September 10, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 117890983}, {"rating": 1.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "This hotel is in serious need of refurbishment of the bedrooms. Yes I know it's an old building and yes it's a great location but this doesn't mitigate the fact that the rooms are well past their best. Very dated decor in both the bedrooms and the bathrooms (1970's at best in the beathrooms) rooms looked grubby with cracked tiles in the bathroom, stained carpets etc. Overheated rooms with no way of changing the temperature nor being able to open the windows meant an uncomfortable night. Good front desk staff, but overall would not stay here again. Stayed the previous week at the Holiday Inn Kensington which was in a much better condition and much better value.", "title": "Worst Sheraton I've Stayed In", "helpfulness": 4, "user": "Englishlee", "date": "February 20, 2007", "detail_rating": {"cleanliness": 2.0, "front_desk": 4.0, "location": 5.0, "value": 1.0, "rooms": 1.0}, "id": 6815113, "likes": {"liked": "— Location", "disliked": "— The rooms !!"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "We got married last May in the ballroom which is simply stunning. We searched many hotels as a venue and this beat both the grosvenor , Mayfair and Carlton - In fact it was the best in London. The food and service was top class and really had the wow factor. The night before I stayed in a deluxe room which was very nice but a little dated. It was also noisy ( think it was near the generator). We had the bridal suite the following night which was beautifuly traditional with big oak doors, a massive bathroom, four poster bed, large lounge area and beautiful views over the park. For the cost however the rooms were dated and overpriced. The staff were pleasant but language barrier a problem , very few had english as their first language. Top location , prestigious and a super wedding venue but perhaps not the standard you expect if you are just booking a room to stay in for a visit. The onsite restaurant was informal and pleasant and not too pricey", "title": "Fabulous Wedding Venue In The Ballroom But Bedrooms Dated", "helpfulness": 2, "user": "AWHITT", "date": "February 18, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 6807207, "likes": {"liked": "— massive bed", "disliked": "— dated decor and bathroom"}}, {"rating": 1.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "It was my worst stay ever in London. I make at least one trip a year to this great city and usually stay within the West End of London. As a recent SPG member I thought of staying here considering the great location. But, right from the word go it was quite bad. The day I arrived after a very long and delayed flight, the weather in London was extremely stormy. The taxi from Paddington dropped me on the main road, i.e., Piccadilly. I did not find any doorman to welcome me. Nor there was any proper reception within the hotel through the front entrance. Instead to my utter dismay I found myself into a casual dining area where people were having drinks and eats, some of them stared at me while I was struggling with a suitcase, laptop and a hand bag. After sometime a hotel staff came forward and guided me to the reception at the back of the ground floor. I then discovered that the main entrance was in a small lane off the main road where there was no arrow or sign showing the right way. I booked an executive room with high expectations. But, I was allotted a room without a view and very stuffy. When asked for a change I was refused. Afterwards I spoke to the Duty Manager and insisted in a change of room as I found it to be absolutely suffocating. Hence, it would not be possible to spend two full days and night there. Anyway, after much insistence he obliged and allocated a better room with good view. However, I found hotel staff in every area were quite stiff and unfriendly. The hotel was not of Sheraton class or standard and appeared highly neglected. The front entrance area leading to the dining hall stinks. The aircon controls in room did not work at all, hence, I had to keep my window open throughout the night. Even the towels in the bathroom did not have the desired freshness. All in all nightmarish experience, and never again at Sheraton Park Lane.", "title": "One of the Worst Central London Properties", "helpfulness": 6, "user": "reli01", "date": "February 12, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 4.0}, "id": 6782755, "likes": {"liked": "— Location", "disliked": "— Almost everything else"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "This hotel has a great location, but it didn't seem to have the same quality as other Sheraton properties I've been to. It felt a little run down, hallways were dark and dreary. Overall, if you can get a good price then this hotel is not bad, but the ownership could stand to spruce it up a bit.", "title": "Great Location, could use some sprucing up", "helpfulness": 2, "user": "bruinluvtravel", "date": "February 9, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 6774553, "likes": {"liked": "— location", "disliked": "— kind of drab"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2007", "text": "Rooms & Bathrooms were pretty standard. They did have a nice looking lounge & restaurant in the lobby, but we didn't eat there. Very close to the subway...really a great location.", "title": "Can do better", "helpfulness": 5, "user": "WanderLife", "date": "January 15, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 6598821}, {"rating": 4.0, "stay_parameters": "Stayed September 2011", "text": "We booked this room on points and were upgraded upon arrival. Large room with double sink and comfortable amenities. Entrance hidden (we lugged our luggage through the bar). We loved the location especially the locals at Sheppards Market. You can't go wrong with this hotel if you get the right room. Ps use GReen Park instead of Hyde Park tube.", "title": "Great value for all rounder to London! Ask for room 605!", "user": "mmccormi", "date": "September 17, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 118236453}, {"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "This is the fourth time I have stayed at the Park Lane. Again I received a warm welcome, a beautiful room and great food. As always, the location is perfect. There is nothing like waking up and looking out of the window at Green Park. It is absolutely beautiful. I will make my reservations for November soon! I would not think of staying anywhere else in London!", "title": "Once Again A Marvel!", "helpfulness": 1, "user": "EuropeanbyHeart", "date": "September 15, 2011", "detail_rating": {"value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 118166220}, {"rating": 2.0, "stay_parameters": "Stayed August 2011", "text": "One of the worst experiences we gathered while I along with my family stayed there from 8-15 august, 2011. Followings :", "title": "It's a disgrace to Sheraton name!", "helpfulness": 2, "user": "camelliaway", "date": "September 15, 2011", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 118142302}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "1) We had reservation for two rooms 2 adults and 2 children. While booking on the phone I had to agree 2 rooms as 1 room can't allow 4 people despite one is really minor aged 3. No issue on that. On arrival the 2 rooms we were given not inter connected, however, 2nd room took 2 hours to get ready. Sill no issue. But both the rooms were tiny and some one can't even properly stretch. Rooms were not equipped with any basic amenities ie mini refrigerator, hair dryer etc. The rooms were not centrally air-conditioned and one of the room the standing cooling system was not working. So we had no choice but to upgrade ourselves to suit which can accommodate 4 people, (however, when I was booking online I have been told several time that no room even the suit can hold 4 people including minor as per the UK regulations) superior, larger, spacious at a cost of additional 200 GBP per night means 2 rooms price that we booked originally plus GBP 200 per night. However, no one could tell us properly what is the room called or named.", "title": "Definitely not a Starwood standard hotel!!!", "helpfulness": 1, "user": "Manos_LHR", "date": "September 14, 2011", "detail_rating": {"value": 2.0, "location": 5.0, "service": 3.0, "rooms": 1.0}, "id": 118107100}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "2) The suit we got finally was spacious, however none of the doors inside the suits were working. The room was old and not sure when last carpet was cleaned. They said it is a refurbished room.", "title": "Excellent location-tiny outdated room", "helpfulness": 1, "user": "EHZagCro", "date": "September 13, 2011", "detail_rating": {"value": 3.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 118049054}, {"rating": 2.0, "title": "5 Stars for location but 3 1/2 star hotel room", "text": "The hotel is in a Great location. It's 7 minutes from Buckingham Palace (through Green Park, right across the street). It's 10-15 minutes--very pleasant walk, to Covent Garden and/or Picadilly Square and/or Trafalgar Square. Like I said, the location is fantastic!!", "helpfulness": 2, "user": "pechung", "date": "May 3, 2007", "id": 7543277}, {"rating": 2.0, "stay_parameters": "Stayed April 2007", "text": "The hotel room is not Sheraton level. It doesn't have a hot water pot for coffee or tea. The king bed is actually 2 beds placed together.", "title": "Not a 5 star Hotel", "helpfulness": 3, "user": "Jeff11300", "date": "April 12, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 3.0}, "id": 7338210}, {"rating": 1.0, "stay_parameters": "Stayed January 2006, traveled on business", "text": "The Brits are a great bunch of people and very helpful. The exchange rate is absolutely terrible for us USA folks. Here's some useful info.", "title": "Don't let these fraudsters have your credit card number!", "helpfulness": 5, "user": "Roadwarrior58-7", "date": "March 26, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 7220369}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "Currency--We had no currency when arriving in London. The train takes", "title": "Not very much satisfied", "helpfulness": 4, "user": "nightcrowler", "date": "March 5, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 6915658, "likes": {"liked": "— location", "disliked": "— rooms"}}, {"rating": 3.0, "title": "Good location.", "text": "credit cards. When you get into town, go to a bank and get change at the most favorable rate", "helpfulness": 3, "user": "nic1047", "date": "March 3, 2007", "id": 6907815}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We have stayed at the Park Lane numerous times for the past 6 years. We have always had clean comfortable rooms and beds. We love coming back from the theatre and sitting in the beautiful elegant Palm Court for tea or snacks with excellent service. There is no other setting like this in London. Breakfast buffet is great too.", "title": "Our favorite London hotel", "helpfulness": 4, "user": "BritishRevelers", "date": "November 5, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6061181, "likes": {"liked": "— Palm Court"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Great service is received from all staff routinely. Excellent location as well. Don't hesitate to stay here.", "title": "Great Stay", "helpfulness": 5, "user": "ckm1956", "date": "October 29, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6026354, "likes": {"liked": "— service"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "As an SPG Gold member, we got a large room on the 8th floor.", "title": "New carpet and a little paint would help tremendously.", "helpfulness": 8, "user": "MissBonie", "date": "October 24, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 6007258, "likes": {"liked": "— Location", "disliked": "— Needs updating."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Immaculate and roomy. No bugs, stains, smells.", "title": "Not too bad", "helpfulness": 5, "user": "davecraig", "date": "October 23, 2006", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 6002314, "likes": {"liked": "— Location", "disliked": "— Tired"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "The concierge was most helpful, and the other staff was courteous and attentive.", "title": "Stinky biz hotel.", "helpfulness": 3, "user": "267alisonr", "date": "October 23, 2006", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 6001994}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 5, "variance": {"poor": 336, "average": 456, "very good": 473, "terrible": 212, "excellent": 267}, "aka": "Park Lane Sheraton", "slim_ranking": 0.573420074349, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.0, "location": 4.5}, "description": "The Sheraton Park Lane Hotel is centrally located near Buckingham Palace and stroll over to the boutiques of Bond Street, Knightsbridge, and London’s West End theatres. As evening falls enjoy a conversation over a world famous English afternoon tea at the Palm Court, or share the tastes of Italy at the Citrus Restaurant."}