{"user_rating": 4.5, "review_count": 387, "name": "The George Christchurch", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Arrived in new Zealand after 13 hours of travel from Singapore. Picked up a car at the airport & headed for the George dead easy one straight road which was a consideration when you are as tired as wee were. Car was valet parked and cases taken to our executive room which was superb. Massive bed really comfortable ( I slept for 11 hours) ultra modern bathroom with bath and top quality shower with top notch toiletries. Spotlessly clean ,looked like the room had just been refurbished and ever so quiet. Good location for pubs and bars just a mile out of town. Unfortunately the centre of christchurch is still wrecked but plenty of nightlife in the suburbs.", "title": "First night haven", "user": "holidaygirl46", "date": "January 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 123580290}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "I stayed here for for the first and last night of my honeymoon and it was a great choice. The hotel rooms are beautiful (we were upgraded to a junior suite because it was our honeymoon which was nice!) and the service is very good. We didn't have breakfast but they recommended where we could go for a relaxed dinner and arranged our taxi to the trans-costal train which was departing early in the morning. IThe hotel is in a very nice location next to the park and a relatively short taxi from the airport. All in all, very impressed.", "title": "Excellent hotel and service", "user": "Ann H", "date": "January 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123374641}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "I stayed here with my husband for our wedding anniversary in October 2011. Everything about the stay was great, with just one exception. They don't offer wifi included in the room rate! For a boutique hotel charging $400+ per night, I would expect to have wifi access included in the room rate. I did give them this feedback at the time of our stay, and via the online survey they sent later. Hopefully they change their policy soon and get with the times.", "title": "Lovely hotel - shame about the wifi...", "user": "Kiwiana13", "date": "January 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 123226133}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "In terms of the hotel, it is great - we were upgraded to a junior suite, which was a bit more spacious with a balcony overlooking the gardens. We ate in the 50 on Park Restaurant, and our meals were wonderful. Attentive but not overbearing service from the waitstaff, and the food was delicous. After dinner we watched the Rugby World Cup final in the bar with a few other guests - nerve-wracking game to watch, but the All Blacks won in the end :) The bar was officially closed by that time I think, but they were happy to serve us a round of celebratory drinks anyway.", "title": "Christchurch Spirit", "user": "Wastrel080", "date": "January 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122918027}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "The service at the hotel was very personal, with a note from housekeeping advising the name of the person who had prepared our room, and a turn down service as well.", "title": "Excellent stay, impeccable service!", "user": "Travellator10", "date": "December 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 122168277}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "We stayed in Christchurch for 2 nights at The George in November 2011. The hotel is very modern and very clean with excellent facilities. The Concierge service was excellent. They arranged our car hire and made sure that the car was collected back from the hotel in our absence.", "title": "A Great Hotel", "user": "NZS54", "date": "December 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121657859}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "........has a sliver lining! The George is one of the only hotels in Christchurch to be unaffected by the earthquake. There is some minor damage but the hotel is running on full steam. Normally when a hotel is as busy as this hotel is, it losses its customer service / attention to detail and can become sloppy. Not The George!", "title": "Every Cloud…..", "user": "Chappells", "date": "December 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121606602}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Mark at concierge was so helpful – thank you for your help with suggestions and assistance when work came calling on holiday!", "title": "Awesome wedding venue + excellent stay!", "user": "chewey1981", "date": "November 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121074555}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Super hotel, certainly worth staying at.", "title": "Helpful to our stay", "user": "D E", "date": "November 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120811195}, {"rating": 5.0, "stay_parameters": "Stayed November 2011", "text": "We held our wedding @ The George recently. Some wedding guests and the bridal party got to stay at the amazing hotel. My guests were really happy with their rooms. I personally got to stay in the junior suite (night before the wedding) and also the bridal suite which were far beyond my expectations! Clean, spacious rooms with underfloor heating (definitely a pluspoint), recycle bins and George Teddybear! Excellent food in 50 Park restaurant and also for the wedding reception. Wonderful, friendly staff made the stay an enjoyable one. I'm glad I chose The George hotel for my wedding and stuck to the decision even after the September + February earthquakes. Thanks for the wonderful experience and keep up the good work!", "title": "Wunderfull stay", "user": "Axelke", "date": "November 20, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 120804316}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "I cannot comment on the value for money of the hotel as we booked it through an agency as part of a much bigger package, but we were very impressed with the facilities and the service on the two nights we stayed there. As we arrived by taxi, a member of staff came to open the taxi door and greeted us by name. She led us to reception with our luggage and sat us down to check us in. She then informed us that we had been upgraded to a junior suite. The room was amazing - very spacious and luxurious, and we were provided with complimentary cups of coffee 10 minutes after entering the room. The staff were most helpful in helping us find our way around the city and service in the bar was very prompt and friendly. Breakfasts were really good - we went for the continental buffet option and there was plenty of good quality fare to choosefrom. I would highly recommend the George, which is in easy walking distance of Hagley Park, the lovely botanical gardens and the excellent museum. And Christchurch is such a friendly and welcoming city, it's well worth a visit.", "title": "Faultless service", "user": "Steve-G23", "date": "February 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124097207}, {"rating": 4.0, "stay_parameters": "Stayed January 2012", "text": "The rooms are modern, clean and comfortable.", "title": "I almost lost my flight", "user": "EduardoPeixoto", "date": "February 1, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 5.0}, "id": 123984241}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The tv channels list is quite short. I wanted to watch the Australian open and I couldn't find a single channel for that.", "title": "Outstanding", "user": "M L", "date": "January 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 123927879}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "About the service, everything was quite good but the wake up call. They didn't woke us up at 4AM as I had asked for.", "title": "A Wonderful Gem", "user": "CaptainRN", "date": "January 30, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 123842254}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "I had booked there manly because its location, close to the old city. But due to the last earthquakes, it didn't matter at all.", "title": "Perfectly good... but feels a little corporate", "user": "Lexiloola", "date": "January 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123751866}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Since the February 2011 earthquake the choice of top class Christchurch hotels is limited - The George is probably the best on offer. Situated a 15 minute taxi ride from the airport and a 5 minute stroll from Christchurch centre (still sadly mostly fenced off into a prohibited Red Zone) The George overlooks a pleasant park. Unfortunately we were allocated a room with a view of a flat roof which the hotel tries to obscure with a green plastic hedge 2 metres from the window. Normally this would be enough for me to write off the hotel. It speaks volumes therefore for the friendly, helpful service and the room facilities themselves plus the fact that a quiet night's sleep is possible that I can still rate it and would stay again.", "title": "Good Value", "user": "Rover10", "date": "February 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125329198}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "It has membership of Luxury Small Hotels of the World which seems to me to be stretching it a bit but nevertheless I would recommend The George.", "title": "A comfortable overnight stay", "user": "LaDolceVita27", "date": "February 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 125058723}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Since we stayed at The George for less than 12 hours, between arriving from Kaikoura on the Tranz-Coastal Express and leaving for Greymouth on the Tranz-Alpine, my review is necessarily a limited one. Our original choice of hotel was still closed because of the earthquake and nearly a year later there is still evidence of its impact in the vicinity of The George.", "title": "Excellent Location.. Wonderful Hotel", "user": "Rahul_36_Sarawgi", "date": "February 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124512103}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "The hotel was certainly a very good choice for our purposes and we would happily have stayed there longer - we had the cheapest double room available but it was of a good size with a comfortable bed and ample storage space. The bathroom was also good apart from one of those irritating water-saving washbasins which result in water being splashed everywhere. The only criticism I would make is of the extortionate extra charge for Wi-Fi when everywhere else in New Zealand, however modest the accommodation, has provided this free.", "title": "Great hotel, great restaurant.", "helpfulness": 2, "user": "mitamenau", "date": "February 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124420808}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The gourmet restaurant wasn't open on the night of our visit but the food in 50 Bistro was excellent: a delicate chicken/chicken liver terrine which was served with a beet salad and a fruit mustard was as good as I've eaten anywhere and our fillet steaks were also very good albeit of such gargantuan proportions that my wife could only eat half of hers.", "title": "Fabulous", "user": "Helen P", "date": "February 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124183323}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We stayed just one night in the George - it was recommended to us by our travel agent and I got the impression it was one of the few places in the city center to remain unaffected by the Feb earthquake. Couldn't fault the service and the concierge in particular were incredible helpful (we checked out the following day to find they had washed our incredibly filthy cross county car!). They were very accommodating in booking us into the excellent (if pricey) Bistro 51 at short notice. Just as well as we couldn't find anywhere else to eat nearby - food was super though - best scallops I've ever had. Rooms very comfortable (slightly annoying extras for internet) although with all the automated lighting systems everywhere it was a bit like sleeping in a spaceship. Seems to attract a lot of British coach tours - or at least it did when we were there- and I think we halved the average age in the dining room (we are 37-39!). To be honest, given the current situation in the city center and if you have a bit of time in Christchurch and your own transport I would recommend staying further out on the Banks peninsular - we drove down to to Akaroa the following day and there looked to be a fair few quirky and gorgeously located b&bs out there and en route - only about 30 mins - 1 hour from the city center.", "title": "Top notch hotel in Christchurch", "helpfulness": 1, "user": "Phnom_Penh_Tiger", "date": "December 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 122075261}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "With Christchurch devastated by the earthquakes, hotels are limited and fully booked all the time, so a level of complacency has set in.", "title": "An average hotel, overpriced for the level of service", "user": "frankfurness", "date": "December 23, 2011", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 1.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 122048190}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "I found this hotel very expensive at $400 for what I would consider an average hotel. Service was indifferent and I had to pay for internet usage, when will hotels learn to include this....like the Asian hotels.", "title": "Gem in Christchurch", "user": "Lindsay1210", "date": "December 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121842635}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "Service was extremely slow, nearly 30 minutes for coffee in the garden. Rooms are nothing to write home about, disappointing.....", "title": "High quality, but a food price to match", "helpfulness": 1, "user": "Michael H", "date": "December 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 121746854}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "We arrived at 8am after a very long overseas trip and lost luggage. Service was outstanding, the concierge diligently called our airline periodically to check on the status of our bags even though we were only scheduled to stay one night before we head off to another city. Rooms are superb, clean, modernized with comfortable beds. Hotel itself is across the street from a huge park, walking distance to some restaurants & shops as well.", "title": "Very Pleasant", "user": "CR111", "date": "December 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121745484}], "location": {"country": "New Zealand", "region": "South Island", "continent": "South Pacific"}, "stars": 5, "variance": {"poor": 6, "average": 31, "very good": 83, "terrible": 0, "excellent": 267}, "aka": "The George Christchurch Hotel", "slim_ranking": 0.036496350365, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "The George is the essence of supreme comfort. Its 53 spacious rooms are designed with a stylish eye for detail, complete with luxury amenities. With a one-to-one ratio of staff to guests, impeccable service is guaranteed. In 2013, 2012 and 2010 it was recognised as ‘New Zealand’s #1 City Hotel’ in Travel + Leisure World’s Best Awards, was New Zealand’s Leading Boutique Hotel’ 2006 – 2010 & 2012 – 2013 in the World Travel Awards. The George offers discerning travellers superb comfort and individual attention in an intimate ambiance."}