{"user_rating": 5.0, "review_count": 326, "name": "The Raford Inn Bed and Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "It truly was like going home...on our second visit to Raford Inn. The location, about 20 minutes from Healdsburg & Dry Creek Valley, is incredible...the inn sits up on a hill facing 100's of acres of vineyards. The owners Dane & Rita really make you feel welcome. The rooms are spacious & very clean with lots of nice touches. The inn's magic draws very interesting guests, who really get to know each other at breakfast and the wine & cheese hour on the porch every evening. The inn is very attentive to special diets, e.g., home-baked gluten free scones at breakfast. Be sure to eat at some of the nearby \"country\" gourmet restaurants (such as Corks at The Russian River Winery) as well as the retaurants in Healdsburg (Dry Creek, Barndiva). If you like to bike, rent a bike in Healdsburg at Wine Country Cycling and bike through Dry Creek Valley (anywhere from 15-25 miles). Just be sure to keep well-hydrated in the dry heat...and with the winetastings.", "title": "Second visit....feels like wine country home away from home!", "helpfulness": 1, "user": "travel JR", "date": "May 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129337324}, {"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "My husband and I just for back from a weekend getaway at the Raford Inn and I feel more more relaxed and happy than I have in years!! Dane and Rita were like stayin with family, really awesome family you never want to leave! They are so friendly an welcoming that they bring out those same qualities in their guests, so morning breakfast becomes social hour and the evening wine and cheese (not I be missed!) becomes a gathering with friends. And do not miss Dane's tour ! Also, I had a massage in the spa room and was transformed for the next 24 hours. The entire experience at the Raford was heavenly - I can't wait to come back!!!", "title": "Heaven on Earth!", "helpfulness": 2, "user": "KaiteaB", "date": "April 23, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 128368260}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We spent 2 nights at the Raford Inn and loved every minute of it. Driving up, we realized we would love the location as it was beautiful-- very peaceful, on a vineyard, etc. We walked in during the afternoon wine and cheese reception and were immediately welcomed by Dane and Rita as well as the other guests. Dane and Rita went out of their way to make sure our stay was everything we wanted--- from making sure we had dinner reservations to giving advice about attractions in the area, and even finding me the emergency room with the shortest wait time in the area when I had an urgent medical issue! They clearly went out of their way for us. Breakfast was spectacular as well, and prices were affordable. I would stay here again and recommend it highly to anyone else visiting.", "title": "A perfect B&B in the Russian River Valley!", "helpfulness": 1, "user": "Emily R", "date": "April 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128359969}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Rita and Dane are simply the best combination of B & B owners around. I cannot find one negative thing to say about the Inn. Riat and Dane asked us before we left if there were any suggestions for improvements and we could not come up with any. Dan loves his vineyard and even though we visited in early spring before any growth had occurred he still gave us a a vineyard tour, demonstrated his wine making process, and let us sample hsi award winning wines. Rita's breakfasts were superb, including the early morning brown bag departure breakfast. And the happy hour was also outstanding. We will be back.", "title": "simply the best", "helpfulness": 2, "user": "Loftbrookeville", "date": "April 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128187522}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The Inn is a quiet oasis in a spectacular setting. All of the rooms are very beautiful ( Angelica is our favourite with a wood burning fireplace and private entry and deck). The home made breakfasts are incredible.But what separates this inn from any other is the genuine warmth with which they deliver excellent service! We found ourselves hurrying back from wineries so not miss a minute of their social hour where we all chat about the day!! Rita kept us organized and Dane kept us entertained. They both work very hard to ensure the visit is perfect in every way and yet still have time to get to know every guest! It is impossible to give this inn undeserved accolades.", "title": "Dane and Rita have spoiled us for staying anywhere else!", "user": "kimono", "date": "April 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127838097}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We just got back from San Francisco and Sonoma County. It was a fantastic trip! We really wanted to stay away from the traditional hotel. We thought it would be a lot if fun to stay at an Inn. After reading everyones review of the Raford Inn we decided to try it out. The reviews were right on. We loved it. Rita and Dane and staff are great! We loved everything about the stay. We especially loved the 5:30 wine and cheese. If you visit it's a must. It was nice meeting the other guest and hearing what they did that day. It also helps on deciding where to have dinner. We learned a lot while sipping great wine. The breakfast was awesome. Everyday was something different. Thanks again Rita and Dane for making this a trip we will never forget. Mary and Larry", "title": "The Best Country Inn experience", "helpfulness": 2, "user": "Brinkwood", "date": "April 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127318796}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "My wife and I spent 3 nights at the Raford Inn B&B, and found that everything was very well done. Rita and Dane are great hosts, and know what it takes to make their guests feel welcome and comfortable. There is a Happy Hour every evening with all the guests, and they served a great Pinot Noir from the winery right next door, Moshin. As an added bonus, winery owner Rick Moshin stopped in one day to say hello. There are menus from the local restaurants to look at, and Rita is happy to make reservations at your restaurant of choice. There are no restaurants within walking distance, so a car is required. The beds and pillows are exactly what you expect at a nice B&B - perfect. Since the Inn is away from the major road, there is no noise other than nature. Breakfast is served at 9:00, and all the guests sit together at the big dining room table. Rita is careful to note any food allergies or preferences, and will adjust for just one guest if necessary. We had to check out early on our last day, so missed the sit-down breakfast, but Rita and Dane had to-go boxes prepared for us.", "title": "Great service, great location, great food, great wine", "user": "Kevin H", "date": "April 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127300830}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Without question, we will stay here on our next visit to wine country!", "title": "Raford Inn Bed and Breakfast is delightful!", "helpfulness": 1, "user": "MicheleLM51", "date": "April 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127215265}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "We stayed here for part of our honeymoon and it was our favorite! The Inn is beautiful. Location is beautiful. Dane and his wife are a delight. His wine is wonderful! Thanks for the wine tour, Dane. They knew it was our honeymoon and had a wonderful chocolate grenache torte and champagne in our room. Hospitality was great. Enjoyed sitting on the porch each evening and sampling wine with the other guests.", "title": "One of the Best in the Country", "helpfulness": 2, "user": "Traveler13a", "date": "March 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126308663}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We can only repeat what others have said about this gem in the Russian River wine country. Our family was looking for a place where our older young adults (20-30 crowd), would feel comfortable - yet would still appeal to the parents. We found it at the Raford with Rita and Dane. Their Inn is welcoming and quite simply the essence of hospitality and service. It is in the middle of wine country - and all that comes with it. Vineyards, small winery's on curvy country roads - and a sense of community that you can feel. Within a short distance are the Armstrong Redwoods, the ocean and stunning vistas. It is true that it is out in the country - but that makes it an even better place to stay. If you forget the cell phone and the computer you won't miss them. It is replaced with interactions with other interesting people, wine and cheese conversations, or simply relaxing on the porch. (There is WiFi if you MUST have that connection.....). Sebastopol, Healdsburg and Santa Rosa are a short drive away if you thirst for an evening in a town. Regardless, other activities and restaurants are also close by. We stayed a week - and everybody loved it. We learned about wine, we spent time together and we had a fantastic time. The service is excellent, the breakfasts were magnificent, and a set of hosts like Rita and Dane simply cannot be replicated. We would not suggest the Raford for families with small or young children. But if your kids are older and appreciate nature, the opportunity to learn new things and enjoy adult conversation, the Raford will be a memorable experience.", "title": "Spot On!", "user": "utahlovin", "date": "March 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 126005250}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The Raford Inn is a gorgeous white wooden home, about 140 years old and lovingly restored, perched high on a hill in the countryside. Sitting in wicker chairs or a glider on the huge porch, and looking down on acres and acres of grape vines is a very special experience. When no cars are in sight below the house, you can easily feel transported back in time. The hosts and staff are extraordinarily accommodating and friendly - and they are happy to give a mini lecture on how they make their own wine. Wine/cheese and goodies in the afternoon was a lovely treat (good wine!) and breakfasts were simply delicious. All the guests shared champagne to celebrate our anniversary. The drive into Healdsburg is truly beautiful - but it will take 15-20 minutes to get to restaurants there from the inn. There are several closer restaurants, highly recommended, nearby if the evening drive seems formidable. Loved our room - we would definitely go back.", "title": "Stepping back into wine country history", "user": "NinaKPaloAlto_CA", "date": "June 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 132780481}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We truly enjoyed our 5 nights with Dane and Rita. They are very accommodating and gracious hosts. They did all they could to make the experience great. Very helpful in finding places to eat and things to do.", "title": "Great view and hosts", "helpfulness": 1, "user": "Jerry W", "date": "June 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132274485}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "My husband and I had the pleasure to stay at The Raford Inn. From the moment we drove up, we felt like we were truly on vacation. Dane and Rita as well as Kristen were very welcoming and helpful in working with us on dinner reservations and we were just in time for the evening wine and cheese reception where we could do a tasting from a local winery. The atmosphere is very relaxed and you feel like you are completely at home here. The inviting porch with the perfect evening views out onto the vineyards locally is truly like a postcard picture. We enjoyed the views, and sunset and made sure to enjoy the same amazing views for breakfast the following day. Be sure to get Dane's tour of his vineyard as well as it adds more quaintness to an already quaint stay. We were in Sonoma and Napa area five years ago and after stumbling onto Russian River Valley area, we decided we much preferred Sonoma and its laid back feel, friendly atmosphere. Now that we found The Raford Inn we will most certainly be back here again for a stay and a longer one next time. Thanks to Dane and Rita for their hospitality and making it feel like a home away from home and sharing their knowledge of some local places also.", "title": "Great hidden treasure in Russian River", "user": "MASevilla", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130851312}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "The irony of this vacation is that it was two miles from our home in Forestville. With three couples coming to visit, we didn't have room to accommodate everyone comfortably, so we decided to give the Raford Inn a try, having passed it hundreds of times during the past thirty years. It exceeded our expectations. We LOVED it!!! May is a beautiful month, so the flowers around the B&B were beautiful and the vineyards stretched before us for miles. Our rooms were perfect as was were the breakfasts all four mornings of our stay. We also enjoyed the afternoon wine and cheeses and appreciated the wine tasting passes to almost all of the wineries in the county. Dane and Rita are knowledgable and welcoming. (We are pleased to now know our neighbors!)", "title": "PERFECT Stay in Wine Country!", "user": "NancyJ6975", "date": "May 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129950109}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We spent one day at our favorite wineries (gardens) along Dry Creek, a second day touring Korbel, walking through Armstrong Woods, enjoying seafood at The Tides and then hiking along the coast, and the third day in Napa. There are so many things to do around here, it was hard to choose, but we all left the Raford Inn this morning, feeling like we'd had the best of experiences!", "title": "A perfect base for wine country travels", "helpfulness": 1, "user": "Escargo1", "date": "May 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129550232}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "I'll join the chorus of people who think this place is great. The hosts, Rita and Dane, treat you like family from the moment you walk in the door. The second morning we were there, Rita said that about 60-70% of their guests are repeat business. I can certainly see why. We'll be among the repeaters when we visit the wine country next!", "title": "Nothing to improve", "user": "jbullock47", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 133953648}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "I was somewhat disappointed after reading good reviews. Good points are the location amongst the vineyards, delicious breakfast and pleasant hosts. I was disappointed that the room was not comfortable, in any way. The attention to maintenance of 'ye olde world charm' has meant that the bed, chairs, floor coverings, soft furnishings, etc are all really old and their best days are behind them. This will appeal to some people, but not everyone. We had the downstairs room, so every footfall above was really loud. There is a bar fridge in the room, which cycles and is very noisy, and so guests are encouraged to turn it off. It prompts the question: why have a small fridge in the room that you can't be left on? Sleep was challenging. I'd say this property would suit an older demographic, who want a nostalgic experience. The hosts are very nice, and this did soften the blow of the room. I probably won't stay here again though, too much like granny's place.", "title": "It's okay, but a little stuffy and not particularly comfortable", "user": "Gazmol", "date": "July 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 133489315}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "This is a wonderful B&B. The propietors are warm, caring and offer personal attention to detail. The food is gourmet and well prepared. We make a point of staying here when we are in the area.", "title": "Very special place to stay.", "user": "Bluewatergirlie", "date": "July 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133359198}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We would absolutely come back! It started with a last minute reservations for a Thursday evening and planned to arrive for the wine and cheese between 5:30-7:00 p.m. Unfortunately the 101N traffic did not cooperate and we arrived after 7:00 p.m. Melia, who we booked with knew we were going to arrive late and fixed us a wonderful plate of cheese, olives and crackers and made sure we had a glass of red and white wine waiting! We stayed in Sage, which had a gas fireplace, a large shower with two shower heads, BOSE radio and two sitting chairs. The bed was yummy as was the breakfast the next morning! We had a wonderful artichoke quiche, potato wedges with sausage and fresh fruit. Before we left we had a wonderful opportunity to learn from Dane, our host, about his foray into wine making for his family and friends. Fresh cookies were also available in the evening! Wonderful experience. Thank you to our hosts Rita and Dane! Looking forward to coming back.", "title": "Everything you could possibly want and more!", "user": "wildivycreations", "date": "June 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133081749}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We spent one night here and loved it. Friendly staff and surrounded by vineyards. About 10 min from Healdsburg but for a quiet night in wine country it was great. Sat outside and enjoyed the seclusion. Dane's wine tour was fun.", "title": "Wonderful find", "helpfulness": 1, "user": "NCTraveler245", "date": "June 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 132781928}], "location": {"country": "United States"}, "variance": {"poor": 2, "average": 3, "very good": 18, "terrible": 0, "excellent": 303}, "aka": "The Raford Hotel Healdsburg", "slim_ranking": 0.125, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "description": "This classic Victorian Plantation landmark manor house, built in 1880, once presided over a huge empire of hops. Converted to an intimate country bed and breakfast in 1980 it sits upon a knoll above an unspoiled Russian River vineyard valley ringed by redwood forested mountains. Lovingly preserved it is a place of quiet beauty in the hills of Healdsburg Wine Country. Return now to a time and place that has not quite yet gone by."}