{"user_rating": 4.5, "review_count": 1575, "name": "The Langham", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "The Langham in Auckland is a perfect hotel for the business traveller. I had to make a quick trip back to Auckland from the States and needed a 5 star hotel that could make the trip feel seem-less. The Langham achieved this for me. The Staff from front desk, bell hop to room service are all fantastic and professional. Everyone, said hello and knew my name which was a very special touch and very unexpected in a Auckland Hotel. The rooms are now a little dated but more than fine with an exceptionally comfortable bed - which I appreciated. The brunch is fantastic and great value with wide variety and very fresh produce. As for Hotels I have stayed the Langham in Auckland gets top marks for exceptional service.", "title": "Excellent Service & Food: Rooms little dated.", "user": "sastudio", "date": "June 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 131611598}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "I could not fault the service at the Langham Auckland. Why are all hotels not like the Langham???? Sensational customer service makes all the difference.", "title": "exceptional", "helpfulness": 1, "user": "skellelj", "date": "June 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131603850}, {"rating": 4.0, "title": "Luxury Hotel in Auckland", "text": "The outdoor spa and pool and indoor steam room/sauna were great too. The buffet breakfast was excellent. The evening turndown service was very sweet, chocolate and a bottle of water by the bed was a nice touch.", "user": "Steven S", "date": "June 8, 2012", "id": 131574748}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "In March, we stayed here on our last night in New Zealand. The Langham is a luxury hotel at a reasonable price. The room was fine, and the staff was attentive. The people at the concierge desk provided us with a good deal of valuable assistance in planning our 24 hours in Auckland. The hotel is located at a distance from the downtown area, but we enjoyed being in a somewhat less busy area, and the hotel’s free shuttle to downtown made access to restaurants, etc. very convenient. Our one minor complaint is that the Langham was the only one of the eight places we stayed in New Zealand that did not provide free wi-fi.", "title": "LOVELY LANGHAM", "helpfulness": 1, "user": "Philly179", "date": "June 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 131516764}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Stayed for two nights with my husband and daughter and her husband in side by side rooms and was definitely very impressed with this Hotel. The whole effect is lovely with huge very comfortable beds and lovely bathrooms. A tiny bit tired in decor but very clean. We loved that they turned your bed down at night and left chocolates on the bed with hotel slippers on the floor beside. My other shoes I had left out were put on little towels. The staff were so friendly and couldn't do enough for you. Breakfast was fabulous and the Hotel also has a shuttle bus to take you to the cbd and back. Overall was great and would definltely stay there again.", "title": "Luxury in Downtown Auckland", "user": "blossie89", "date": "June 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 131514077}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Staff was very accommodating and professional, and was friendly with our 3 year old son as well which was greatly appreciated. Beatiful, relaxed environment. They organised a babysitter and made it a hassle-free experience. Overall great experience. Only complaint would be that it got a bit stuffy during the night making sleep a bit difficult for us, but our toddler slept very well so that was all that really mattered!", "title": "Enjoyable stay", "user": "spinzyfox", "date": "June 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 131112111}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "The Langham used the \"personal touch\" throughout my stay - even before I check-in I receive an email telling me about the goings on, confirming my reservation details and welcoming me in advance.", "title": "lux business", "user": "peppernic", "date": "June 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 131105510}, {"rating": 5.0, "title": "The hotel that I measure others by", "text": "Throughout my stay all of the staff I came in contact with said hello, used my name when answering the phone, were very accommodating to whatever my needs were and being genuinely friendly. Even when there was an loud event right underneath my room, they were empathetic and put me in touch with security to figure out when it would be ending, turning down the music to help the crowd disperse and offering me a different room.", "user": "Stephen F", "date": "June 1, 2012", "id": 131100369}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "The Langham is a personal sanctuary when travelling, and I am looking forward to staying again!", "title": "Great place to stay", "user": "fismum", "date": "June 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 131099227}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Top service, top staff, top rooms. This is the benchmark by what I measure other accomodation by. Very handy location for the CBD along with a great shuttle service to the lower CBD of Auckland. This is a great hotel in which to treat that someone special with a memorable break.", "title": "Great choice when in Auckland", "user": "WH0A", "date": "June 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 131096242}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "The staff was top notch. Very friendly and made us feel comfortable. Average size rooms and included everything a hotel this size should have. Breakfast was fantastic, although it was about $40NZ per.", "title": "The Langham, Auckland, New Zealand", "user": "JohnDrags", "date": "December 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 188544503}, {"rating": 2.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "We were put up at the Langham Auckland for a night to attend a corporate function that night. The hotel reception was extremely slow. Two long queues were formed within a few minutes. Valet parking staff was where to be seen. Hotel room was tidy but not clean, especially the toilet. Guest amenities were totally forgotten! When called up, it took two hours to be delivered and wrong items were sent. Very disappointing for a big name like Langham.", "title": "Slack, slow, silly", "helpfulness": 1, "user": "MsCritical", "date": "December 25, 2013", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 188521243}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "This was a real treat for us. We come 'home' each year for Christmas and I have tried various ways of battling through a Christmas dinner in various homes we are housesitting - it is always expensive and stressful and not very relaxing. So this year we stayed at the Langham and went out to visit, then had a feast in the hotel. Every aspect was superb, even though we had the cheapest and smallest room we were never made to feel anything less than special. Food is excellent and the room extremely comfortable. Next time I would splash out on a double twin, just because the single bed is small (I am tall and on the larger side), and I like to sprawl a bit. However this is more an observation. The 'classic' rooms could probably do with a bit of a refresh quite soon, the upholstery and so on is looking a little worn. Cleanliness was excellent and there were plenty of power points for phone chargers etc. The hotel itself is in a great position for getting around Auckland and I would recommend this as a perfect place, if you are looking for 5 star accommodation.", "title": "Superb", "user": "irenemalone", "date": "December 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 188519142}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Stayed in a club room and the usual top range hotel facilities are there, but what sets this place apart is the service from the staff. it is really good. the club lounge is good, not remarkable but good enough.", "title": "Great Hotel in Auckland", "user": "smellyfish", "date": "December 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 188515337}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "The room has a feel of a top hotel as you would expect.", "title": "5 star hotel - 5 star service, 4 star room, great deal thru wotif", "helpfulness": 1, "user": "Tony S", "date": "December 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 188507597}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "Wow, we had the best Christmas. It was our first stay at Langhams and the hotel was relaxing and the service was impeccable. The staff were professional and knowledgeable. We stayed in a Park Suite with access to the Langham Club lounge and we thoroughly recommend it, if you have time check out the day spa you won't be disappointed. We will be recommending this hotel to all our friends and business associates.", "title": "Christmas at Langhams Auckland", "user": "Colleen S", "date": "January 1, 2014", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 189277605}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "We stayed in a standard double room and we thought it was lovely. The reception staff were brilliant and we checked in around midday with no problems (unlike other hotels who wont let you check in early even if room is ready!) Room was very comfortable and well appointed. Furnishing may be a bit outdated but we really don't find that to be a problem. Bed was really comfortable and we loved the turndown service with choccies! Hotel provides a free shuttle bus down to the harbour which we found useful on first day. We didn't eat in hotel so cant comment on food. I thought it was actually good value for money and would definitely stay again.", "title": "Lovely hotel and excellent service", "user": "Alan H", "date": "January 1, 2014", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 189196492}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "I have been going to this hotel for about 25 years in the days it was the Sheraton I had my honeymoon at the hotel and when we want to escape to somewhere special this is the place. I decide I was going to spoil my wife, earlier we had made a reservation at Eight restaurant for my wife, son and me to see the new year in. Since my son was going to join us in town I decide to stay in house. The moment I arrived nothing was too much of a problem they offered to park my car and my bags where unload for me taken straight to our room, they even notice my shoes need a good shine and cleaned them for me. Into the reception area we created and I do not know how they did it but they created us my saying good morning Mr and Mrs Barfoote very impressive they knew who we were. Then they blew my mind away we not a rich couple or anything special and without asking and at no extra charge they upgrade us to a suite which gave us access to a special area call the club rooms. The suite was to die for beautifully decorate and the décor was luxurious they even turn our beds down for us with chocolate on the pillows. Our diner reservation was at eight we decide to avail us of the services in the club rooms where they offer their guest pre-dinner drinks and nibbles to contemplative the day and plan for what you are going to do for the night. Again service was excellent where nothing is too much trouble and the nibbles scrummy and lick smacking good. When my son arrived he was escorted and seated at the restaurant and we were advised of is arrival. They say the Eight restaurant is a Culinary Journey they are so right but it also the small things like our waiter Michael cleared our plates immediately kept our glasses of water and wine top up not imposing but ready to help. At midnight they had staff ready to take us to the roof top to see the fireworks at sky city tower. After midnight we retreat to our sanctuary with a bed so soft and supported we had a fantastic night sleep follow my breakfast in bed and a late checkout. And when I called downstairs to let them know I was checking out and by the time I got to the lobby my car was ready for me with the bags in.", "title": "The best", "user": "Stephen B", "date": "December 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 189171394}, {"rating": 2.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "Another hotels should follow The Langham example of service", "title": "Tired & Dreary", "helpfulness": 1, "user": "balimontana", "date": "December 31, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 189107439}, {"rating": 3.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "We hade a suite and two regular rooms for three nights during early December. I was excited at the thought of staying in a Langham property as they're marketing as a chain is quite hip and modern.", "title": "A little dated", "helpfulness": 1, "user": "waiheke", "date": "December 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 189067344}, {"rating": 5.0, "stay_parameters": "Stayed January 2014, traveled with family", "text": "The Langham is like an old friend - always great to see each other time away. The Langham is that friend with the best service and the most comfortable rooms that seemed to be design for the comfort of you. Again, Reception was a friendly breeze to a clean wonderful executive room. Its the second time my mother has stayed just down the hall from me and the Langham always makes sure we have a hoot. This time I tried the pool which is part of the spa. I was surprised - it was actually really cool and quite a sanctuary on top of the hotel. Love there breakfast as one of the best but this time service was a little pushy, brisk and then clumsy. The food is always great and get there before 8.30am and the crowds hit. Will def.be back!!!", "title": "Stillone of my Favorites Hotels", "user": "sastudio", "date": "January 5, 2014", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 189687764}, {"rating": 4.0, "title": "Excellent staff and service", "text": "I was very pleased with my three nights at the Langham, mainly due to the professionalism and helpfulness of the hotel staff. My \"classic\" room was spacious and comfortable if a little dark and the bed was pleasingly firm but with a nice feather mattress topper. Bathroom is a little small for a top class hotel. Location of the hotel ensures some exercise if you plan to walk to the main shopping street or Viaduct Harbour due to the topography of the city, although there is a shuttle bus service if that presents a problem.", "user": "Lee K", "date": "January 4, 2014", "id": 189610570}, {"rating": 5.0, "title": "Fantastic Christmas, great service, excellent hotel", "text": "Christmas at the Langham. Fantastically enjoyable experience with Christmas dinner at Eight restaurant.", "user": "dmartora", "date": "January 4, 2014", "id": 189562014}, {"rating": 4.0, "title": "Quietly professional", "text": "The service throughout our stay was excellent. Every member of staff were knowledgeable and considerate.", "helpfulness": 1, "user": "Jwcaldwell", "date": "January 3, 2014", "id": 189516255}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled on business", "text": "Quality rooms, excellent housekeeping and great facilities.", "title": "Amazing experience!", "user": "KurtPPNZ", "date": "January 2, 2014", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 189396341}, {"rating": 2.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "So disappointed today. We booked to go to High Tea at the Langam Hotel - something Ive wanted to do for ages but after our experience today would definately not recommend it. There were 6 of us - 3 adults and 3 children ages 12, 5 and 5. The first thing that happened was that my 5 year old daughter badly burnt her hand touching the big Dilma hot water urn on the counter beside our table. I notified a staff member and they bought a bucket of iced water to soak her hand in. We were then handed menus and poured some stale warm water that tasted really bitter by the manager.", "title": "Dont bother going to the High Tea at the Langham Auckland!", "user": "Sarahchamps", "date": "December 30, 2013", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 3.0, "service": 2.0}, "id": 188967755}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "Unfortunately his breath was so bad that it put me off straight away. I nearly gagged when he was talking to me.", "title": "Perfect Weekend at the Langham", "user": "JaxMason", "date": "December 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 188919428}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "We had to wait at least 25 mins for our food or drinks to arrive and although we were supposed to have 1 item of the menu each we were only given 4 items off the menu between 6 people. When I queried this I was told that there wasnt enough room on the table for 3 cake stands and that when we had finished they would then bring the other 2 items each out. This was so ridiculous and confusing and created numerous problems of each of us trying to remember what we had tried and what we hadnt received - it was really annoying.", "title": "Exemplary", "user": "HK_Ivan", "date": "December 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 188861848}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "The ham and tarragon butter sandwich was literally miniscule 5mm squares of ham mixed in with so much mayo that the sandwiches just tasted like eating white bread with (and im not exagerating here) a 1cm thick spreading of best foods mayonaisse - they were inedible. I mentioned this to the manager but he just nodded and walked off.", "title": "Great stay at the Langham", "user": "Lee D", "date": "December 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 188853601}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "After finishing what we could on the trays we were then brought the missing extra 2 items on 2 more plates - nobody wanted to eat egg sandwiches and goats cheese tarts after already finishing their desserts it was a ridiculous setup so we had 2 complete trays of food left uneaten.", "title": "Definately 5 Star", "user": "YvonnePapamoa", "date": "December 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 188844435}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "The Langham has once again proved to be the best spot in Auckland for a short stay.", "title": "Excellent Stay", "user": "johnno540", "date": "June 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131095587}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "Well located, attentive staff and great restaurant/bar facilities.", "title": "Best hotel in Auckland", "user": "stanInternational", "date": "June 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131069549}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "I think the Langham is Auckland's best. From start to finish, terrific, with winning little flourishes.", "title": "I'm in love with The Langham", "user": "Yankiwi245", "date": "June 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 131065169}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Luxurious, relaxing, modern, practicaL.", "title": "Review from Singapore", "user": "Sasi062012", "date": "June 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131064296}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Perfect night from the moment we stepped out of the car. It's all such a dream. We were treated sooooooo well by everyone. This has to be the best Auckland has to offer ... service, food, comfort, elegance, class...", "title": "A romantic night out", "user": "Gail_Bazz", "date": "June 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131060999}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "We stayed here for one night and couldn't believe how great the service and rooms were. The staff went out of their way to make sure we were comfortable. It's fairly pricy but given the great experience we would happily pay that to stay again. The room was very clean and comfortable. Highly recommended.", "title": "Fantastic - Highly Recommended", "user": "sez444", "date": "June 4, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 131237820}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Visited the langham for it s spa really to get readu for an important business meeting.", "title": "lovely service and spa", "helpfulness": 1, "user": "estellejulie", "date": "June 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 131173709}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "the hotel really looks drab from the outside and is not so flas and modern on the inside as well. The service however is really very good and the general feel is relaxed and appreciated.We stayed in a executive room which had a loveky sealy king size bed and nice amenities, abit on small side though. There was free internet on every floor, which was nice. The pool is heated and outdoors with a spa pool as well. Decent sized both and very clean. The spa itself is on the small size compared to US or european Spas, but lovely furnished very clean. the staff is very well trained and I thoroughly enjoyed the back massage. (special thanks to amber) Afterwards they give you tea and fruits and lovely juice in a relaxing area. They also have a sauna and a wonderful steam room. I felt thoroughly refreshed and much better than weeks before.", "title": "lobby pretty nice, pool reat, room just so,so", "user": "SusanWellington", "date": "June 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 131162110}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The restaurant also wishes to accommodate guests and special wishes not on the menu were prepared for us after asking for it, which was a nice touch.", "title": "Romantic Night for Two", "user": "Stookies", "date": "June 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131155028}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "High tea looked great but we did not have a chance to experience it. They also have free shuttles into the BD, but it is really not far. The servce by the staff in hotel and staff was wonderful and yes we will be back definitely. One tip: book spa treatments in advance, they were pretty booked out on weekends.", "title": "Good choice in Auckland", "user": "Bollywoodqueen", "date": "June 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 131133930}], "location": {"country": "New Zealand", "region": "North Island", "continent": "South Pacific"}, "stars": 5, "variance": {"poor": 32, "average": 132, "very good": 380, "terrible": 25, "excellent": 1006}, "aka": "The Langham Auckland Hotel Auckland Central", "slim_ranking": 0.025974025974, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "Our 5-star luxury Auckland hotel in Auckland's CBD offers: 409 rooms and suites including 47 Langham Club Rooms and 16 suites* Dining at Eight restaurant, The Winery and SPE Bar & Restaurant* 24hr business centre* Free wifi for 1865 members *Spacious meeting & banqueting facilities* Central CBD location* Luxury sedans available for airport transfers & sightseeing* Complimentary inner city shuttle service to waterfront* 24hr room service* Chuan Spa for luxury spa and beauty treatments* Chuan Healthclub & fitness centre* Heated outdoor pool plus sauna and jacuzzi* Walking to distance to Auckland city attractions including museum, art gallery, shops and restaurants."}