{"user_rating": 4.0, "review_count": 1829, "name": "The Fairmont San Francisco", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "we got a seemingly great rate online but when we arrived realised why. this is a grand hotel but with budget amenities. we had a double room but were given only one robe, a small bottle of water cost $8 - there were no complimentary ones in the room ad not enough shampoo etc for 2 people. the staff were below average for a hotel like this the first concierge we met gave us massively wrong info and was actually rude. the carparking is unrealistically expensive as is room service. the best things about the hotel are the location and comfy bed but the walls are so thin we could hear the couple next door having a quiet chat and the TV from the room over the corridor. the wifi and gym are not available unless you join their privilege club and there is no spa or swimming pool, you have to go to another place for that - which means the website actually lies! thoroughly disappointing stay, never again.", "title": "Not as good as it should be", "user": "Escaping_the_Gulf", "date": "February 1, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 54938746}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "This is a beautiful and historic hotel in the Nob Hill area of San Francisco.", "title": "Excellent hotel- tip: stay in a Tower room with a view over the Bay", "helpfulness": 1, "user": "adelaidiantraveller", "date": "January 30, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 54742512}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "It's a great base for a stay in San Francisco. You can easily take a cable car ride from the hotel to the waterfront.", "title": "Beautiful property; All was not up to expectations", "user": "laurensaunt", "date": "January 29, 2010", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 54685118}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Pay the extra, and stay in a Tower room overlooking the Bay- you'll have a magnificent panoramic view which takes in the Golden Gate Bridge and Alcatraz.", "title": "Still A Classy Hotel", "user": "ExperiencedTravelers", "date": "January 24, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 54284537}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The hotel is magnificent, with an air of luxury and opulence. The (Tower) rooms are spacious and well appointed.", "title": "Nice Place, some charges a bit annoying", "user": "FrequentTraveler021", "date": "January 22, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 54091926}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "Got a superb half price rate for the Fairmont from Trailfinders in Ireland. Stayed here for 2 nites in late September with my wife and some friends.", "title": "Highly Recommended!", "user": "RoryMc", "date": "March 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57963437}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "This grand old hotel is really stunning, from the impressive opulent lobby to the large, very comfortable rooms. It is well located, just a few blocks up from Union Square and there are a constant stream of cabs waiting out front.", "title": "Expensive but grand in a dated sort of way", "user": "DoesNotGetOutMuch", "date": "March 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 57903305}, {"rating": 2.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Really couldnt fault this hotel in any way..only gripe was one of the nites we were looking for late drinks, but the bar shuts very early and there was no way we were getting drinks even 5 minutes after the official closing time.!", "title": "dont stay there not worth the money", "helpfulness": 1, "user": "rudolfadelaide", "date": "March 2, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 57579557}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "All in all would highly recommend this hotel, especially if you can pick up a good rate, as it is a bit pricey otherwise..", "title": "Different folks different opinions", "user": "Durer", "date": "March 1, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "location": 1.0, "service": 4.0, "rooms": 3.0}, "id": 57461484}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "Grand hotel, excellent food and service (although the cafe in the middle is reminiscent of some shopping mall food courts) but way more expensive than needs to be. Late night service ends early - go across the street to the top of the Mark!", "title": "Great hotel", "user": "zulu12", "date": "March 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 57443015}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "I stayed for business for 3 nights the first week of November. Beautiful old hotel, in pristine condition, tastefully done and very grand. The location is convenient to Union Square, trolley cars nearby. Late evening and early morning, I could hear the bells clang from below, which was incredibly charming to me.", "title": "History atop a hill", "user": "Steve_and_Jocelyn", "date": "November 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 120244818}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "The room was lovely, great view, wonderful bed, quiet, wished the internet was free but alas...", "title": "Old world charm at the crossroads to the best of San Fransisco", "helpfulness": 1, "user": "adoola", "date": "November 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120212895}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Did I mention the view?? I was in the new Tower by the way corner room. They told us at the front desk when making a reservation, ask for rooms ending with 10. (example 1010, 1110 etc...) These are the end rooms and corner spaces.", "title": "Amazing Hotel", "user": "jmt1961", "date": "November 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120123713}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Staff at the hotel were all courteous and mature. Everything is pricey ala Fairmont. My only complaint is that there was no coffee available in the lobby after 7am.", "title": "Someday I'll live here...", "user": "miniorange", "date": "November 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120043085}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Variety of guests: tourists, business, surfers, etc...", "title": "Luxury hotel", "user": "swnyrawel", "date": "November 1, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 120040865}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "spend 4 days there for business. try to get a room with a view over the bay: I was overlooking Alcatraz Prison! the hotel has a great history as it is probably one of the first luxurious hotel of SF. Many famous people, from US president to actors came there. You feel the history with the rococo design. a bit kitschy but perfect for a romantic stay and great if you like this kind one hotel which reminds you the French Riviera. The staff was very helpful. the rooms are big, bathrooms nice with bath and shower, 32 LCD TVs. the lobby is huge with lots of private space if you need to meet people.", "title": "Amazing view over the bay, kitshy deisgn! but great if you like that!", "helpfulness": 2, "user": "JeromeS187", "date": "March 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14415516, "likes": {"liked": "— the style! the view", "disliked": "— you have to pay for the gym/no pool"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled solo", "text": "There is a bar where you can have a big breakfast in the morning or have a drink later in the day. there is also another bar in the former swimming pool with an Tahitian theme where you can have cocktails or diner. didn't try the food but the cocktail were good (and pricey as it is a first class hotel).", "title": "Not much to fault at this local landmark", "helpfulness": 3, "user": "tcook052", "date": "March 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 14355417, "likes": {"liked": "— Location", "disliked": "— thin walls"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "the gym is ok but you have to pay, sthg like $10 or $15/day.", "title": "happy returns", "user": "retiredincyprus", "date": "March 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14295564, "likes": {"liked": "— beds and linen", "disliked": "— restaurant"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "the hotel in on top of a hill so if you are a lazy type person you will have to take a cab or the tramway to come back or find another hotel downtown! it s a 5 min cab ride to go downtown and there are always cabs waiting at the entrance.", "title": "Loved it!", "user": "MissNippy", "date": "March 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14144838, "likes": {"liked": "— Everything!", "disliked": "— Nothing!"}}, {"rating": 4.0, "title": "Pretty nice...", "text": "the concierge has great restaurant recommendations. indicated me an awesome tapas place in the Spanish area.", "user": "x2fr", "date": "March 2, 2008", "id": 13992313}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "This is the place to stay if you want the feel of San Francisco's grandeur and a locale that cannot be beaten - at the top of Nob Hill, two blocks from Chinatown, a trolley ride away from the Ferry Building. There are places to go in every direction. It is an elegant, old hotel that has mostly kept up its grandeur, though a tad tired in hidden corners. The room and views in the Tower were spectacular. We overlooked the city skyline and often just opened the drapes and stared. The bathroom was wonderful - a grand and luxurious shower, marble tiles, elegant features. The room itself was large, grand, elegant. At the same time, the rug looked worn and needed repair, and the room could have used a comfortable chair and more drawer space. Service in the hotel is as grand as its reputation. The concierge was always pleasant and helpful. The front desk people were friendly and responsive. You knew you were in a place of pride, and it really felt good to be here. We were here for a conference, and the room price was surprisingly affordable.", "title": "Old but elegant", "helpfulness": 1, "user": "richchar", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 119995142}, {"rating": 5.0, "title": "Excellent Girls' Weekend", "text": "A girls' weekend is always a great time, but our time at The Fairmont made it so much more wonderful! It is a beautiful historic hotel with a lovely lobby and common areas. We were upgraded and had a corner room with a great view of the city. The room was huge and had a walk- in closet! The bathroom was functional....not lots of vanity space, but plenty of outlets in other places...so it works! Everyone was very friendly and helpful. Talk about on- time service...we ordered breakfast, as well as bell desk services and they were not even one minute off.....unbelievable! We had cold oatmeal with breakfast and it was cheerfully removed from the bill. If there is a down-side....it's a steep climb from shopping back to the hotel...but it ia a good calorie burn! Parking was included in our rate...but can run up to $55 with taxes...just good to know to factor in! Would be happy to go back for our next adventure!", "helpfulness": 1, "user": "Bobcat 12", "date": "October 31, 2011", "id": 119964047}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "I'd always wanted to stay in the Fairmont ever since my salad days as a \"casual\" worker in SF. The opportunity came with a recent conference and I decided to bring along my wife for a three-day stay. Stately and well-kept is how I'd describe the building and it's lobby. \"Classic\" and clearly of a different time are the rooms. The service is toward the top-end, friendly staff who try (and succeed) in being helpful in many ways. The grand lobby is just that: grand. The bar can seem a bit dark and cold but once tucked into your own cocoon on a banquette, it makes sense. A little peeve is the \"touch-me-and-you-will-pay\" display of bottled water and goodies meant to tempt you. Likewise, I wish hotels like this would just include the internet charge in the room instead of adding the $13.95 daily fee. Nevertheless, if another conference offers the Fairmont at a reasonable rate, I'll return.", "title": "A comfortable classic", "user": "Thomas R", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 119938416}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Undoubtedly on one of the best locations in San Francisco, the Fairmont at the top of Nob Hill is a stately hotel with old world charm, but modern conveniences. The staff is extremely friendly and attentive to all guests' wishes. The food in the hotel's restaurants is excellent and up to the Fairmont's standards. Not only is the food delicious, but so are the beds!", "title": "The place to stay in San Francisco", "user": "thefriedlands", "date": "October 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119910015}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "The Grand Old Dame of San Francisco. Wonderful atmosphere, great service and excellent location! We will be back Fairmont!", "title": "Loved it!", "user": "ollib02", "date": "October 29, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 119875587}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Spent a week at this fine hotel celebrating my wife's 50th birthday and I rank it near the top of my favorite hotels. The location is perfect atop Nob hill and easy to walk to places or catch the cable cars which come by right beside the hotel. The lobby is spectacular, maybe my favorite of all US hotels, and I enjoyed the older rooms in the main building with their high ceilings and large closets and clever shapes. The customer service was excellent and responded to anything we asked about or needed with a smile and with first class service. I can't say enough about this fine hotel. The perfect place for a special event in your life or just for a get-a-way weekend. Not cheap of course but the value for your money is there and you don't feel ripped off, but rather glad you chose to stay in such a comfortable and classy hotel, full of charm and memories of a lifetime.", "title": "Absolutely the Best", "helpfulness": 1, "user": "nuheart", "date": "January 21, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54019184}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We stayed here for 5 nights from the 28th of December , everything about the hotel was perfect. Our room was beautiful, spacious and clean. The staff were so helpful and kind and made our stay a truly memorable one. Perfect location too.", "title": "Wonderful place", "user": "td84", "date": "January 15, 2010", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53527308}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "No one seemed to be available to assist with our luggage so our immediate impression was not a positive one. After arriving in our room, we discovered the luggage rack was broken. One call and we had a new one within 6 minutes. Before going out to dinner, we found that the in room safe did not work. The situation was remedied in short order. These aspects were more what we expected from a Fairmont property. The room was standard and not very large. The decorator touches, such as the drapery over the large window, were all that distinguished the room. The bathroom was nicely finished but a larger vanity with 2 sinks would have been much appreciated when we were getting ready for the day. The lack of an in room coffee service was disappointing. It was a long trek to the Cafe Centro coffee shop (lower level) first thing after rolling out of bed. The trolleys were convenient in location but after waiting in a long queue one chilly evening we opted to cab it from then on. Our group was offered a limo one night near Ghiradelli for the same $/person as a trolley. Join the President's Club (free) before booking to receive free access to the fitness center. Chinatown is a short stroll and there is walking access to many Italian area restaurants. It is a downhill walk to Pier One and a quick commute to Sausalito for a nice afternoon. Cab it back to Nob Hill and the Fairmont. This hotel is a historical gem and they are proud of the fact that all President's except George W. & Obama have stayed here.", "title": "Opulent hotel", "user": "Takemeaway79", "date": "January 12, 2010", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 53291845}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "Spent 3 nights here on the way to and from Mexico, in December 2009 & January 2010", "title": "Stunning Hotel", "user": "tuxedo", "date": "January 7, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52866572}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Stunning hotel in every way, jaw dropping lobby, beautifully decorated for Christmas.", "title": "loved the decor & heritage feel", "user": "audreylou", "date": "January 7, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 52822215}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Firstly let me say that my husband and I are very particular about which hotels we stay at. The Fairmont San Francisco exceeded all of our expectations and then some. When we arrived the valet took our car and gave us a claim check and told us that when we checked in that our luggage would be right up. We were a bit early but were given our room immediately on the 8th floor. I asked for a higher floor and without hesitation was given a georgeous room on the 19th floor. Within minutes our luggage arrive. Not an easy feat since it was Labor Day weekend and the hotel was hopping!! It was our anniversary and when we came back from lunch there was a bottle of champagne as well as strawberry covered chocolates. Keep in mind that we booked directly from the hotel at the last minute and being a President's Club member our $203..00 dollar a night room (including breakfast) was just over the top. If you are a Presidents Club member...check out their last minute deals. I felt guilty for paying the amount that we paid. The service was excellent from the valet, to the check in process, the housekeeper (each day we left $10.00 for housekeeping and they left us alot of extras for our room.) We even had turndown service. The Laurel Court Restaurant was just okay...not horrible, but just okay for the prices that they charge. We had our first mornings breakfast in the restaurant and they had a buffet. They were so busy but the service was once again excellent. The next morning we had room service and it was once again just okay. They charge $3.50 per person extra, plus a 19% service plus something else which I can not remember at this moment. It was still worth it to us!! They don't tell you that they have complimentary coffee at the concierge until 8AM but that is nice to know if you are like me and need my coffee before I can get our of bed. The gym was fine nothing great but with all the walking that we did in San Francisco it suited it purpose. It is free to President's Club memebers.All in all if you are looking for an elegant hotel with outstanding service...This is the place to go.", "title": "5 star and then some", "helpfulness": 4, "user": "lorrainesgourmet", "date": "September 6, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 5775303}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "By the way parking was 51.60 per night...ouch!!", "title": "Beautiful Hotel", "helpfulness": 9, "user": "SushiLvr", "date": "August 19, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 5624739, "likes": {"liked": "— The beautiful rooms and service", "disliked": "— Nothing significant"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "I just returned from a week-long stay at The Fairmont Hotel in San Francisco, and my experience there was great.", "title": "wonderful,old world charm", "helpfulness": 3, "user": "ex-laxmom", "date": "August 15, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5613320, "likes": {"liked": "— the size and cleanliness of rooms", "disliked": "— price of food"}}, {"rating": 4.0, "title": "Fairmont's the Best-Hands Down", "text": "The view from the room I was given at first was not what I expected, and the room was also in a noisy location. However I contacted the front desk and they promptly upgraded me to an even larger room, that had a breathtaking view of the bay--for the same cost.", "helpfulness": 3, "user": "luvseattle", "date": "August 14, 2006", "id": 5607436}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled with family", "text": "The service at the hotel was wonderful--everyone I encountered there was very accomodating and professional. I especially enjoyed the exceptional room service. The room service menu was extensive and the food was delicious. The hotel's restaurants were also quite good. The Tonga Room was a very unique restaurant with an interesting atmosphere and refreshing Asian-Polynesian cuisine.", "title": "Don't miss the Fairmont!!", "helpfulness": 2, "user": "Hunter Fisher", "date": "August 9, 2006", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5592847, "likes": {"liked": "— service, history, decor", "disliked": "— wish it had a pool"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "With so many great hotels in San Francisco we had no idea where to stay for our anniversary. Since the price was right, we finally decided to stay at the most famous of them all, the Fairmont. The location on Nob Hill is perfect if you're looking to tour the entire city. (Make sure to walk to your destination and get a ride back...that walk back uphill can be tough on hot days).", "title": "Good Overall, but Great Location and History", "helpfulness": 1, "user": "L6Traveler", "date": "August 8, 2006", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 5578379, "likes": {"liked": "— Location, History", "disliked": "— Room slightly worn"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "The good: The lobby, the history, the location, the friendly valet service.", "title": "A Jewel", "helpfulness": 3, "user": "MWA1004", "date": "July 21, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5493963, "likes": {"liked": "— Location", "disliked": "— High Parking Fees"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled on business", "text": "The bad: Seemed understaffed especially the concierge desk, regular rooms are on the smaller side, and there are some signs of excess wear (paint peeling, carpet stains, etc)", "title": "Nice", "helpfulness": 1, "user": "traveljunkiegirl", "date": "July 20, 2006", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 5488619, "likes": {"liked": "— historic value", "disliked": "— old hotel, poor layout"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2006", "text": "Overall, if you find a reasonable price you can easily overlook any negatives b/c after all, it's still the Fairmont San Francisco.", "title": "Great hotel, but horrible food service", "helpfulness": 6, "user": "dbolt", "date": "July 14, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 5.0, "service": 4.0}, "id": 5466993}, {"rating": 5.0, "stay_parameters": "Stayed February 2006, traveled on business", "text": "My wife, two sons, and I stayed at this hotel from July 12th to the 15th. We had Fairmont rooms on the 2nd floor which were large with high ceilings. The bathrooms were fresh and spotless. This hotel is located at the top of Knob Hill, which puts it in easy walking distance of the waterfront, and Union Square (Down Hill going to these places, and then the hotel is on the trolly line comming back). The lobby is beautiful with large columns and grand staircases. The service was first class. We did not eat at the hotel so I can't speak about the food quality. We did go to the Tonga Room for happy Hour, and the food there was just so so. The Hotel has a commercial health club on site, and they refused to let our 16 year old sons work out, but a complaint to the hotel manager solved that problem. The only down side is the parking fees of $45.00 per day, but you do not need a car because of the hotel location. I would highly reccomend this hotel to anyone visiting San Francisco.", "title": "Very Impressive Hotel", "helpfulness": 2, "user": "Oldsurfer", "date": "July 3, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 5421495}, {"rating": 3.0, "title": "An expensive museum", "text": "We were at the Fairmont for a scientific meeting. Facilities were adequate, but no better than your average businessss hotel. Room was large but poorly laid out. Decor dated. In a hotel noted for its terrific views, we had a view of a tin roof surrounded by the backside of the entryway. Food was basic hotel buffet. I generally like classic hotels (including this hotel's sister in Boston), but this one fell flat: quite a feat in a city as exhilarating as San Francisco. I'd have been really angry had I had to pay for this place myself. Save your money for better places.", "helpfulness": 21, "user": "Roskolnikov", "date": "April 29, 2006", "id": 5018979}, {"rating": 5.0, "title": "The Best San Francisco experience", "text": "This is a truly sensational hotel. If you are looking for a great staff and a great authentic local experience, this is the best choice!! Also, the concierge is fantastic and can really give you advice and get you into some of the hardist non-touristy restraunts. I have stayed all over San Francisco and while the Four Seasons and Ritz-Carlton may offer a greater consistency, this is truly San Francisco's Grande-Dame. Stay here and you will have a great experience!!", "helpfulness": 17, "user": "A TripAdvisor user", "date": "April 7, 2006", "id": 4949879}, {"rating": 4.0, "title": "Terrific Hotel", "text": "I stayed for 3 nights at the Fairmont for business, and loved it. It's a lovely old grand hotel. I upgraded to a tower room with an amazing view of the bay, Alcatraz and the Golden Gate. It was wonderful. The room was elegant, comfortable and quiet, with a great bed. The bathroom was enormous, all warm colored marble, with a separate whirlpool tub and glass shower. I also had some documents delivered and sent a few FedEx packages--all went smoothly. The concierge desk was well above average, actually arranging dinner reservations at restaurants that did not smack of tourism. He was also able to get us a table for eight at Boulevard on short notice, which was amazing. The gym is also excellent, and the lobby bar is well-staffed and has a good selection of wines by the glass.", "helpfulness": 21, "user": "A TripAdvisor user", "date": "March 23, 2006", "id": 4727959}, {"rating": 2.0, "stay_parameters": "Stayed December 2005", "text": "I had only 2 complaints. First, the Fairmont charges for use of their gym and for high-speed internet. It turns out that you can get these for free if you fill out a little form and join the \"Fairmont Club,\" which costs nothing. However, no one tells you this--you have to figure it out for yourself. This is ridiculous. It is a fairly expensive hotel, and should simply provide these things for free. Second, the restaurant is ridiculously inefficient at breakfast, a major faux pas when serving business travelers with flights to catch. My colleague and I waited almost ten minutes for a table, when literally all but two of the tables were empty. The wait staff would not allow us to sit until the Maitre'd came over and took down our names and room numbers on a clip board. It was absurd.", "title": "Bad Bad Service", "helpfulness": 21, "user": "Clyde_1013", "date": "March 1, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 4567788}, {"rating": 5.0, "title": "Great!", "text": "We stayed here for Friday and Saturday night in a king tower room. The room was nice. Very large with a large bathroom. The interior seemed clean until I looked out the window. There were two condoms (used) lying on the window sill. I tried immeaditaly to ring the front desk from the room phone and ended up in an endless voice mail loop. No operaters to answer nothing! So I went back down to the front desk where to have a talk about it and could not find anyone. Finally after waiting at the front desk for 20 mins. They changed my room (with very little apology) however due to it being a holiday weekend I was given a dark and tiny queen room for the same price! Upon leaving on Sunday morning I tried to calll the car park to let them know that we were planning on leaving in 30 minutes as we were instructed to when when deposited the car with the valet. I could not reach anyone again and ended up in voicemail loops again. Even when I tried the front desk. When we brought the keys down we waited for over an hour for our car to be returned. I will never be staying here again. There are far better places in SF.", "helpfulness": 12, "user": "sjp1", "date": "February 14, 2006", "id": 4459692}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We recently enjoyed a weekend stay at The Fairmont San Francisco through Disney Vacation Club points usage. As a quintessential San Francisco property, there is much to this property as well as nearby.", "title": "Classic San Francisco", "user": "volvo99", "date": "April 7, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14858949}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "We stayed in room 590, the Dunkirk suite. It is a corner accomodation with great city views. It is well appointed in the classic sense; elegant Napoleonic decor along with modern touches like large flatscreens and two full baths.", "title": "Great Rate and Quiet Stay", "user": "yellowrose13", "date": "March 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14648309}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Along with numerous lounges and restaurants, I would recommend the Tonga Room. It is a Polynesian themed lounge and restaurant replete with thatched roofs, tiki iodols and rain falling from the ceiling accompanied by thunder from the loudspeaker. A true nostalgic experience!", "title": "Very impressive.........", "user": "iamadamant", "date": "March 28, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 14601084, "likes": {"liked": "— All around impressed", "disliked": "— Nothing bad to say"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "This hotel is ideally situated at the intersection of two cable car lines, and walking distance to Chinatown. It boasts an enviable location atop Nob Hill, and the service aspect from the staff is one of total service.", "title": "Beautiful Lobby but a Little Shabby", "user": "Buben", "date": "March 24, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 14502797, "likes": {"liked": "— Lobby", "disliked": "— Shabbiness of rooms and hallway"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2008", "text": "This hotel is ideal for couples or families on a holiday, all the way to conventions. As it is a classic hotel, it will not have all the wired amenities of newer properties like a W Hotel, and Nob Hill is a bit far from the airport or Silicon Valley. However, if you enjoy classic hotels, this is among the best.", "title": "Stay away from the historic Main Building rooms", "user": "travel2006j", "date": "March 20, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 2.0}, "id": 14419547, "likes": {"liked": "— Fancy lobby", "disliked": "— Thin walls in the Main Building"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "My boyfriend and I escaped to the Fairmont San Francisco this weekend for a romantic getaway. This is hands-down the nicest hotel I've ever stayed at. The building is spectacularly beautiful and very well-maintained. The Fairmont doesn't suffer from the peeling wallpaper and dingy carpets that are common in historic hotels.", "title": "Experience the Grandeur of a Bygone Era", "helpfulness": 4, "user": "embolita", "date": "February 5, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 13295334}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "We were delighted with our \"Fairmont Exterior Room\", which was on the 5th floor of the main building and had splendid views of Coit Tower and the Bay beyond. The bedroom was spacious and airy, with high ceilings and a massive walk-in closet. The furniture was beautiful and sturdy and, unlike most particle-board hotel furniture, it felt real. The bathroom was a splendid combination of peach marble and striped wallpaper, with a black marble sink and an ornate mirror.", "title": "Clearly one of the best", "helpfulness": 6, "user": "CruisinFlorida", "date": "January 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12998130}, {"rating": 4.0, "title": "Super Elegant, but maintenance questionable", "text": "We didn't bring our car (after reading about the $50/day parking fee) but we got around town with ease. Union Square is just a few blocks down the hill and a source of endless entertainment. If you want to go further afield, you just hop in a cab or jump on the cable car that runs directly behind the hotel.", "user": "trvl2lv", "date": "January 21, 2008", "id": 12856085}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "We enjoyed everything about our stay at The Fairmont San Francisco and will most definitely return.", "title": "Beautiful hotel!", "helpfulness": 2, "user": "tigerider", "date": "January 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12845717, "likes": {"liked": "— History of the hotel and condition of it.", "disliked": "— Rough Towells"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "My recent stay at the Fairmont was my third in approximately 30 years. As a young child I traveled there with my family and remember watching Michael Douglas and Karl Malden filming the Streets of San Francisco in the hotel lobby. I recall the ornate, but classic lobby and the stately rooms. This hotel is clearly in an elite class. 12 years ago I returned with my wife and likewise throughly enjoyed my stay. This time I returned with my wife and daughter, both of whom found the hotel to be first rate. The hotel is at the top of Nob Hill right off the Powell street cable car line. The neighborhood is great and the location even better. There is nothing I can say negative about this hotel. The staff was courteous upon check in. When the room I had requested was not available, without request, I was offered a different upgraded room at no charge. The parking attendants were quick and efficient. The room was clean and extremely comfortable. I especially was looking forward to the comfortable beds which once again did not fail me. The large flat screen television was a plus. Lastly, our room rate included a buffet breakfast, which while pricey, was outstanding. All in all, this is the hotel to visit when in San Francisco.", "title": "Lovely Weekend", "helpfulness": 4, "user": "karlyn", "date": "January 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 12831321, "likes": {"liked": "— location, location, location", "disliked": "— lack of cleaning the hallway regularly of dirty dishes etc."}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The Fairmont was the last of three hotels we stayed at during a recent trip to Napa and San Francisco. Overall our impressions were good, although there was a major problem that shouldn't have happened.", "title": "Overall a nice stay--But We Had a Major Security Problem", "helpfulness": 2, "user": "TakesPix", "date": "February 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 13841886, "likes": {"liked": "— Great view, wonderful linens", "disliked": "— Security issue, a few minor housekeeping issues."}}, {"rating": 5.0, "title": "Beautiful", "text": "First, the good. We were in room 1801, right off the elevator on the 18th floor with a wonderful view of the Golden Gate Bridge, Alcatraz, and Coit Tower. Being so close to the elevator we were somewhat concerned about noise, but our fears were unfounded. The room was overall clean, although the duvet was torn--something housekeeping should easily have noticed and taken out of service for repair. The minibar was well stocked, as was the bathroom with toiletries, however there was only one robe where two should have hung. The bed was comfortable with Frette sheets, and there was a large flat screen LCD TV.", "helpfulness": 2, "user": "CAtravel39", "date": "February 23, 2008", "id": 13775800}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "The bad--Our second day there we returned after a day of sightseeing to find the door to our room had been left ajar by housekeeping. Fortunately we had locked up all valuables in the large safe, but it was very unsettling to know that anyone who happened by could have walked into our room and taken anything they wanted out of it. The front desk was called and a member of the hotels security staff was dispatched to read the records on the automatic door lock so they could determine who had left the door open. We felt that the hotel should have offered a small something as a token of apology--a few sweets left in our room while we were at dinner, or a couple cocktails at one of the lounges--we've been comped far more for far less serious issues at other hotels without asking. Unfortunately the hotel offered only an apology for our inconvenience.", "title": "Great hotel, thin walls", "helpfulness": 1, "user": "DANI24", "date": "February 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 13660610, "likes": {"liked": "— graciousness of staff", "disliked": "— thin walls"}}, {"rating": 5.0, "title": "a place with history", "text": "The hotel did bend over backwards when I became incredibly ill on our final day, offering to send a doctor and extending our checkout until late evening as we had a redeye home. All and all it was a nice stay, and we would return.", "helpfulness": 2, "user": "alzo", "date": "February 13, 2008", "id": 13538278}, {"rating": 5.0, "title": "the wonderful Fairmont Hotel", "text": "I have to say that this minute you walk into this hotel you are amazed and feel luxurious. I loved the service the moment my husband and I arrived with our two children. We were there for our family Thanksgiving and stayed in a one bedroom suite with an amazing view and great bathroom.", "helpfulness": 4, "user": "daschle", "date": "February 11, 2008", "id": 13466644}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Nice pleasant stay,friendly staff,beautiful lobby area and clean room.No upgrades or anything even though it was a birthday and wedding anniversary present trip (It would have been a nice gesture).Tonga Bar entertainment band was \"different\" to say the least.", "title": "\"Nice stay\"", "helpfulness": 4, "user": "Coastview4", "date": "October 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 119848980}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Not sure though why the hotel are still holding $200 on my credit card as I had no hotel charges and checked out almost a week ago . . . .", "title": "Easy, opulent, and perfect", "user": "doctort", "date": "October 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119799193}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "A complete review with video is on our site EatPackGo.com -", "title": "Fairmont San Fran", "user": "ToonTownFarmer", "date": "October 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 119793604}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Suffice to say that this hotel has the perfect location. The unknowing San Francisco traveler will note that the hotel is at the top of Russian/Nob hill - those of us who know SF, know that you want to be here- because it means you can get anywhere you want to in the city- easily, without the traffic that those who stay along the bay. Do not try to walk up the hill to this hotel- take a cab. And cabs from the hotel are easy- without long lines.", "title": "Classically Beautiful with a Good Location", "helpfulness": 4, "user": "MissFranberry", "date": "October 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 119778351}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Want to check in fast, join the Fairmont Hotel's President club, and with that you get great lines, and better service.", "title": "Beautiful and Elegant", "user": "SashaCamille", "date": "October 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119719521}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Pros:", "title": "Regency Suite", "user": "kitty811", "date": "November 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120357150}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "- amazing room upgrade (from a standard in the main/older building to a suite in the newer tower)", "title": "My home in San Francisco", "user": "RKW206", "date": "November 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120346377}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "- huge living room large enough to entertain 20 guests", "title": "The good, the bad and the ugly...", "helpfulness": 1, "user": "Kent A", "date": "November 7, 2011", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 120310779}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "- very comfortable bed (firm w/feather bed and down comforter). perfect!", "title": "Fairmont holiday", "user": "klsmackay", "date": "November 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120286232}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "- great views of the Golden Gate Bridge and Alcatraz. Telescope in room to get close and personal...", "title": "Insight for the business traveler staying the San Francisco Fairmont", "user": "ptbrk", "date": "November 6, 2011", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "location": 4.0, "service": 3.0}, "id": 120251997}, {"rating": 5.0, "stay_parameters": "Stayed September 2004", "text": "My husband and I celebrated our 1st Anniversary at the Fairmount a few years ago, and it was wonderful. The views were spectacular, and the accomodations were luxurious.", "title": "Pancakes Oscar a Must!", "helpfulness": 4, "user": "dc26", "date": "July 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5419380}, {"rating": 2.0, "stay_parameters": "Stayed April 2006", "text": "But if you go, you absolutely must order the Pancakes Oscar from room service. You will not be disappointed. I still think about those pancakes and the yummy toasted marshmallow topping. It's nothing like I have ever had. Enjoy!", "title": "big, tired and expensive", "helpfulness": 7, "user": "Voldar15", "date": "July 1, 2006", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "service": 2.0}, "id": 5415564}, {"rating": 5.0, "title": "Fantastic Visit", "text": "I stayed here for three nights as part of a wedding.", "helpfulness": 31, "user": "A TripAdvisor user", "date": "June 14, 2006", "id": 5348618}, {"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled on business", "text": "Positives - The views (if you are facing alactraz) are nice.", "title": "Nice, classic -- perfect for a long stay", "helpfulness": 8, "user": "Belasaria", "date": "June 14, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 5348601}, {"rating": 4.0, "title": "An awesome glimpse into the past", "text": "Negatives - Very big \"Hyatt like hotel\" at Ritz Carlton, Mandarin Oriental, Four Seasons pricing. Our room was a discounted wedding rate and after tax was over $400. I have stayed at the Ritz, Mandarin and the Four Seasons all of which are a giant leap above this hotel and all (especially the Four Seasons) are better located. You pay for the view (if you are on the right side of the hotel) if you want to walk anywhere in San Francisco as the last block to the hotel is more of a climb than a walk.", "helpfulness": 27, "user": "A TripAdvisor user", "date": "June 6, 2006", "id": 5315338}, {"rating": 5.0, "title": "Great Historic Hotel", "text": "My wife and I spent 3 nights in this beautiful hotel. Room was plenty big enough with excellent views of the city. I recommend requesting a tower room - if you can get a corner room you will have views from two sides of the building. The building is very large with a beautiful lobby. Location is very convenient with a cable car stop right outside hotel. I recommend buying a 3 day transportation pass, which includes cable cars, trolleys, buses, etc.", "user": "jmrpax", "date": "February 28, 2010", "id": 57329027}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "We loved the hotel, it is very beautiful and great views from knobb hill. We do prefer the Ritz hotel though for the club floor service and nicer room. But I would totally reccomend it!!!!", "title": "Beautiful Fairmont Hotel", "user": "vicki3", "date": "February 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 56991299}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "This hotel is just stunning from the grand architecture of the building on the outside to the elegant décor on the inside. Initially we checked in to the hotel and were a little disappointed with the location of the room as it was on the inner circle of the building, we overlooked other hotel windows and air conditioning units etc, not that we wanted to complain but merely just ask if there was a room with a nicer view.", "title": "Simply Awesome!!!", "helpfulness": 1, "user": "Travelling_Carlos", "date": "February 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56743325}, {"rating": 5.0, "title": "Hotel Fairmont in San Francisco", "text": "At first we were just going to stick with it but as this was a once in a lifetime trip for us I decided to ask (After all they could only say no). I spoke to a really nice guy in reception who told me that we could change rooms but there would be a charge (which is fair enough), he told us that he would sort out an upgrade deal for us and as I left the desk he said “I think you will find this much more to your liking”.", "user": "VictoriaL1", "date": "February 21, 2010", "id": 56700297}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Wow! he was not wrong we walked into this room on one of the higher floors to a view of San Francisco harbour and Alcatraz all lit up, we just stood there staring out of the window at the bright lights of the city it was stunning!!! Of course the next morning I felt obliged to slip this guy a tip to say thank you (which my girlfriend found hilarious because she said I did it Chandler Bing style)", "title": "Glamorous and Perfect!", "user": "travelpal28411", "date": "February 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56419369}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 4.5, "variance": {"poor": 111, "average": 251, "very good": 566, "terrible": 42, "excellent": 859}, "aka": "The Fairmont San Francisco Hotel San Francisco", "slim_ranking": 0.204255319149, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "World-renowned, The Fairmont San Francisco hotel presents an awe-inspiring picture of historic San Francisco. The grandeur of the hotel coupled with its reputation for impeccable service promises a truly memorable experience. Known for turning moments into memories for leisure and business travelers alike this luxury San Francisco hotel has been host to some of the most influential meetings and events, breathtaking weddings and personalized special occasions of the century. Each of the San Francisco hotel's spacious guestrooms and suites have been elegantly updated including flat screen TVs, Frette linen ensembles, pillow top beds, and MP3 docking stations.In addition to its 591 guest rooms and suites this luxury San Francisco hotel offers fine dining with three renowned restaurants and lounges, as well as 55,000 square feet of spectacular function space. With a panoramic view of the City and the Bay from high atop Nob Hill, The Fairmont San Francisco hotel presents an unmatched blend of luxurious accommodations, elegant meeting spaces and superb services, which make for an unforgettable stay."}