{"user_rating": 4.5, "review_count": 697, "name": "The Shilla Seoul", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "An amazing building to look at as well as be in. The Chinese restaurant had a wonderful menu and was the best kung pao chicken I've ever eaten. The dinner buffet was also amazing with perfectly cook eye fillets and lamb cutlets, worth the price. The only issue was the proximity to the station. Although close, the entrance to the Shilla is very steep.", "title": "Great Hotel", "user": "Amanda N", "date": "October 31, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "location": 3.0, "service": 5.0}, "id": 183108590}, {"rating": 5.0, "title": "great stay, best breakfast in Korea", "text": "Was in Korea for business, and was amazed at the room quality.", "user": "JAMES O", "date": "October 29, 2013", "id": 182878430}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "They recently renovated the rooms and the pool/sauna area, so everything was shiny new. The bedding was top notch also so I managed to get great sleep.", "title": "Great Hotel", "user": "Amanda N", "date": "October 24, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "location": 3.0, "service": 5.0}, "id": 182185102}, {"rating": 5.0, "title": "Good to be back", "text": "Their executive lounge \"happy hour\" provided about 5-6 hot dishes and 4-5 cold dishes, included beef, shrimp and pasta (if you've been to Hyatt RC Guam club floor, it's 2x better then Hyatt). If you have access to their executive lounge, you should definitely try - their lounge is kids free so it's quiet and relaxing.", "helpfulness": 1, "user": "Paradectral A", "date": "October 23, 2013", "id": 182149720}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Also, if you have access to their Sauna, you should try their \"experience shower\" its amazing.", "title": "Great Pool", "helpfulness": 1, "user": "Raeseok", "date": "October 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 180863925}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "The anniversary of 9-11 made me think again of the Shilla. For 10 years I regularly stayed at this hotel on business trips. Early on I happened to be on the back end of a 4 week around the world trip and at the Shilla. Coming home from dinner in Itaewon to pack abd go home in the morning, I happened to notice the World Trade Center burning on my rooms TV. As the night wore on, It became clear we'd not be going home anytime soon.", "title": "The most spectacular hotel in Seoul", "user": "Astrobuf", "date": "September 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177121854}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "The hotels GM met our group the following morning. The always exceptional service level of the Shilla ramped up even more for those of us trapped. Arrangements were made for us to keep our rooms indefinitely. A memorial service was arranged for hotel guests wishing to attend. Grief counselors were available for those who wished for counsel. A young lady on my floor lived in an apartment that she could see burning on the TV news and so benefited.", "title": "Awesome hotel in Seoul!", "user": "docnemie", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175431569}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "I've stayed a lot of places around the world and can confidently say the Shilla is my favorite. There are bigger, fancier hotels around, but none have the long standing commitment to service that the Shilla does. It's the only place I stay in Seoul. I must have lived there for the better part of a year over all of my trips!", "title": "Excellent", "user": "li_bj_paris", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 175408083}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "This hotel has a very grand feeling to it. The moment you enter the lobby, you cannot help but be awed by its crystal ceiling decor. The rooms are very spacious and the thing that will catch your attention at once is the huge television in the room and with very good HD channels. The toilet is unique with a warm seat and automatic flush. The bed is so comfortable with soft pillows. But they could improve on the food in the restaurant, though.", "title": "Great hotel - average breakfast", "helpfulness": 1, "user": "Isaiah_eu", "date": "August 29, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 174747538}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "I stayed here during three weeks end of 2008. The hotel is just ten minutes' walk from where I needed to go to work everyday. It is located on a small hill. Excellent service, excellent quality. Free afternoon tea when you stay on the business floors. Breakfast choices were large.", "title": "The Parkview Buffet was so-so", "helpfulness": 1, "user": "GANTAN", "date": "August 18, 2013", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 4.0}, "id": 172801609}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "The Shilla has always been one of the top hotels in Seoul for comfort and service, with this years renovation updating the rooms and room floors to a brighter more contemporary style.", "title": "Great hotel, recently renovated......", "user": "Ste M", "date": "October 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 180671322}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "Service is fantastic with a very high ratio of staff to guests.", "title": "Excellent Treatment to the guests", "user": "120JulianaG", "date": "October 3, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "rooms": 5.0, "service": 5.0}, "id": 179606370}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The main restaurant still provides one of the best breakfasts I have experienced with a large choice of western and eastern food including made to order eggs, pancakes, waffles, and coffee. The evening buffet remains of a high standard with a broad choice on offer including Korean, Japanese (sushi), Chinese (dumpling bar as well as ready prepared meals), and Western (Italian pasta dishes). There is also a good choice of food available in the Library Bar (which replicates the in room service menu). If you want to pay more, there are premium Japanese and French restaurants within the hotel.", "title": "love this hotel!", "user": "K L", "date": "September 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178375638}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled solo", "text": "The pool area seems to have benefited from the recent refurbishment and has pleasant covered seating areas or your own cabana if you want to pay for privacy.", "title": "one of the best", "user": "Kiyoshi_sf", "date": "September 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 178314768}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "I have no reservations in recommending the Shilla, but if I had to raise any minor issues it would be the cost (this is a premium hotel with a room and restaurant rate to match), and location. There is little of interest within walking distance of the hotel so taxi's (which are cheap by western standards) are a necessity.", "title": "Good but something is missing", "helpfulness": 3, "user": "Paul H", "date": "September 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 5.0, "location": 2.0}, "id": 177483723}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "This was my first visit and stay at the Shilla in Seoul, having been to the city for a few times now. I had always been staying at the Hyatt Regency (excellent and well located near to Itaewon) or the Grand Hilton (horribly located in the middle of nowhere and very very average convention type hotel). I decided to try The Shilla after having spoken to a few friends who had stayed here before. All the comments given by them were spot on, including the \"downsides\".", "title": "Heaven on earth, but at a steep price.", "user": "SingaporeGuy10", "date": "November 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 184853490}, {"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "The hotel location is near to the Dong-guk University Subway Station. There is a frequent hotel shuttle bus that takes you there. From there, there is easy access to all the important tourist areas. The Myeong-dong shopping belt is also not far off.", "title": "Very Good Hotel in Seoul - but....", "helpfulness": 2, "user": "MisterTravel1000", "date": "November 13, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 184604682}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "Upon entering the hotel's magnificent and admittedly ostentatious main lobby, you first notice that all the staff are impeccably and very formally dressed, extremely polite and attentive. Then the main showpiece of the hotel lobby strikes you - the boldly designed hanging crystals which sparkle like nothing you've ever seen. This is the first sign as to why The Shilla positions itself as THE premier hotel address in Seoul.", "title": "Amazing", "user": "lasslaby", "date": "November 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 184575035}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "The hotel itself is rather old and dated in terms of the external design. However, that should not matter much. It is an old hotel - owned by the Samsung Family no less. However, a recent and complete internal refurbishment has made it modern and updated. The décor is simple, sophisticated and understated. No glaringly stark furniture. Everything is high quality wood based, with very straight and clean edges and lines.", "title": "Upscale quality Buffet", "user": "glee604", "date": "November 10, 2013", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 184218996}, {"rating": 5.0, "title": "You get what you pay for", "text": "Check-in was highly efficient, if not a bit \"cold\". The swimming pool / sauna / fitness centre is extensive, to say the least. I can imagine it being over-crowded in summer. Fortunately, I stayed in late autumn, which is not peak tourist season for Seoul.", "helpfulness": 1, "user": "Oahu3", "date": "November 5, 2013", "id": 183622123}], "location": {"country": "South Korea", "continent": "Asia"}, "stars": 5, "variance": {"poor": 14, "average": 47, "very good": 225, "terrible": 11, "excellent": 400}, "aka": "The Shilla Seoul Hotel Seoul", "slim_ranking": 0.0286458333333, "description": "The Shilla Seoul represents the best hotel in Korea, with contemporary design blending well with traditional patterns and style used back in the Shilla Dynasty. Next to the main building stands the former guesthouse that was once used to welcome special guests from around the world. The main building is replete with restaurants offering outstanding international cuisine, a shopping arcade featuring global brand goods, a pool, and a luxurious spa while in a separate building within the property lies a grand duty-free shop."}