{"user_rating": 5.0, "review_count": 737, "name": "The Oberoi Udaivilas", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "Udaivilas is just plain wonderful in every aspect. From the reception, to the room to the food to the service, they get a 100%. And thge beauty of Udaipur and the lake just makes this resort magical.", "title": "pure paradise", "user": "DubaiMD", "date": "October 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45718796}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "This hotel is a truly amazing experience.", "title": "Amazing experience", "user": "Gosh13", "date": "October 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45572767}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Rooms, food, staff, spa, everything!", "title": "Go to leela palace instead", "helpfulness": 1, "user": "FrequentTravellerr", "date": "August 30, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 2.0, "service": 3.0, "rooms": 4.0}, "id": 39232154}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Reception was cold. Very average food. Staff not so professional, saw some signs of frustration(probabily low on morale for some reason). Evenings are very dull as the lighting is minimum to cut cost. Dont go if u r not in a group. Will get bored.Need i say more?", "title": "Heavenly Hallucinogenic Vision That Turns Out To Be Real", "helpfulness": 1, "user": "cmoorer1", "date": "August 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38471580}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "On the Oberai website Udavilas looks spectacular. In person it’s a dream. If you stand high up on the ramparts of Udaipur City Palace and look across Lake Pichola past the Lake Palace you see a very large creamy confection of soft golden domes set atop matching golden walls. Wait, now the domes and walls appear a gauzy pink. The sense is of a heavenly hallucinogenic vision or a CGI image out of Skywalker labs. This is Udavilas from a distance. Stepping inside the reality of the vision is a rare privilege.", "title": "Classy yet modern", "user": "AditiD", "date": "August 17, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 37884800, "likes": {"liked": "— Ambience"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "this is a special hotel. It is set in extensive grounds with luxuriant vegetation, moghul architecture and well equipped and attractive rooms. Restaurants are good but the outside dining is probably best", "title": "the best oberoi hotel in india", "user": "gorah123", "date": "June 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33004294}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "As we was on the litlle trip in India, I had a vision that Udaivillas would be the best hotel of all, regarding rewards, room with pool etc. But, unfortunately Udaivillas did not meet my expectations. To be honest, hotel is beatiful, room was great, spa also, but- service is not ao the same level as in Amarvillas, Vanyavillas, Rajvillas or Delhi. In fact, something missing. We asked for our pool towels- helou, theey should be already there, and housekeeper took our white towels from bathroom and gave ithem to us....At breakfast, my husband finished with the fruits and started ate eggs-waiter gave to him old knife and fork! This is the best hotel in Asia, and such mistake is out of mind. And spa, beatiful decorated, run by Banyaan tree, great treatmants, everything perfect but- in spa menu they offer waxing. I tried to do it, ( I was 2 weeks on my trip) but no waxing-at all. They sent me to Trident hotel,..... Overall, hotel is great, room with private pool is great and if you planning to go there definately choose room with pool, other rooms without pool look the same, but the difference worth money, but service is just on the same level we used to it at other Oberoi hotels.", "title": "not on the same level as other oberois", "user": "nes", "date": "June 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 31536320}, {"rating": 5.0, "title": "Supeb!", "text": "No words can sufficiently describe how beautiful this place is! The stay at a hotel by the lake and royal palaces is simply amazing. This place is undoubtably one of the best hotels in the world to stay at. Even though its highly expensive, the service and the stay is worth it.", "user": "aki076", "date": "June 3, 2009", "id": 31497802}, {"rating": 5.0, "stay_parameters": "Stayed January 2009", "text": "A stunning property that pampers you like royality.Staying here with family is like taking a walk down pages of history.everything is soo beautiful that its inspiring .", "title": "stunning property", "user": "Family74Bombay", "date": "June 2, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 31372381}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "We were here with afmily right after new year's and had oneof the best relaxing times.Some amazing family photos background too", "title": "Dream Hotel", "user": "ManishaK123", "date": "May 11, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 29739892, "likes": {"liked": "— Service & Accomodation", "disliked": "— Not Applicable"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled solo", "text": "The Oberoi Udaivilas is virtually without peer anywhere in the world and it deserves a prominent slot on your travel shortlist.", "title": "If You Appreciate the World's Finest Be Sure to Place Udaivilas on Your List", "helpfulness": 3, "user": "TurtleCreekTraveller", "date": "December 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50583488}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "I arrived at the Udaipur airport before 8:00 am, was met by two staffers, whisked to the hotel in a Benz SUV, complete with cool hand towels, bottled water, and a selection of music or conversation with the staff. Upon arrival to the hotel, I was personally greeted by Torsten, the affable and talented managing director, and quickly escorted to an upgraded room, even though I was hours ahead of standard check-in time.", "title": "complete heaven", "user": "Chutneywallah", "date": "November 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50343530}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Everything regarding my stay mirrored the excellence of the initial arrival. The facilities are utterly spotless, staff members well-trained and consummately gracious, the grounds manicured and relaxing, the Banyan Tree Spa facilities and services top-class, and the menus diverse and brilliantly prepared. The hotel also provides boat service, and no request is too big or too small.", "title": "Possibly the best hotel in the world", "helpfulness": 1, "user": "Don_J_London", "date": "November 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49784337}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "In planning the trip, I really vacillated between the Taj Lake Palace and the Oberoi, but after eating at the Taj Lake Palace and seeing the Leela Kempinski, I consider these properties to be very fine, but still a notch below the Oberoi, which also has a no-tipping policy, which is replaced with an opportunity to leave one gratuity amount at the end of the stay to be shared among the entire staff.", "title": "Would it be worth the price?", "user": "LSBurdett", "date": "November 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48769473}, {"rating": 5.0, "stay_parameters": "Stayed October 2009", "text": "Having traveled many countries and continents, I found the Rajasthanis to be among the kindest and most genuine people in the world, and both Jaipur and Udaipur have modern and efficient airports served by excellent carriers like Jet Airways and Kingfisher, so travel is not difficult and is of a high international standard.", "title": "A magical experience", "user": "Eyeforquality", "date": "October 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48180759}, {"rating": 5.0, "stay_parameters": "Stayed January 2006, traveled with family", "text": "the best place i ever seen", "title": "amazing", "user": "RomaNewyork", "date": "October 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 47070852}, {"rating": 5.0, "title": "Immaculate Hospitality at the Oberoi", "text": "room was beautiful", "user": "JillS1", "date": "October 14, 2009", "id": 46819513}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "charming place", "title": "Beautiful hotel, but mixed feelings", "user": "Sunjoy", "date": "October 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 46604812}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "the spa with its own swimming pool overlooks the lake", "title": "The best hotel I ever stay", "user": "philippe_maier", "date": "October 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46439649}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "This hotel is recently built, though has been so carefully designed to fit in with it's surroundings that it could easily be one of the old Maharana's palaces. A short boat ride across Lake Pichola began this magical experience and from entering to leaving we were made to feel like the most important people in the world! The staff are wonderful - nothing is too much trouble and they are superbly efficient, polite and friendly. The rooms are excellent, many with 'back' doors leading onto the area of the outside pool. Despite it's size, it was peaceful and we felt secluded. This is a romantic hotel in one of the most romantic destinations I have ever seen. Expensive, but we found a special deal - so keep looking! Even if it for only one night this is a place not to be missed.", "title": "Awesome", "user": "msdsman", "date": "October 8, 2009", "detail_rating": {"cleanliness": 1.0, "value": 5.0, "location": 5.0, "service": 1.0, "rooms": 5.0}, "id": 46251418}], "location": {"country": "India", "region": "Rajasthan", "continent": "Asia", "city": "Udaipur"}, "stars": 5, "variance": {"poor": 8, "average": 12, "very good": 56, "terrible": 4, "excellent": 657}, "aka": "The Oberoi Udaivilas Hotel Udaipur", "slim_ranking": 0.0185185185185, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "description": "In a city fabled for its palaces, The Oberoi Udaivilas can take its place with pride. With views over Lake Pichola to the spectacular City Palace, the hotel itself resembles a grand palace. Landscaped gardens and shady courtyards, decorative fountains and reflection pools, cool marble, ornate carving, inlay work and detailed interiors create a marvellous ambience of days gone by. Huge bedchambers with large private terraces, luxury suites with private swimming pools, marble bathrooms, walk-in closets, butler service and 24-hour in-room dining make you feel like royalty. The restaurants serve international and Indian cuisine including regional favourites. A gymnasium, two large swimming pools and a luxury spa offering a range of therapies, add to the ambience of total pampering. The facilities are particularly suited to meetings that might benefit from this exotic location."}