{"user_rating": 2.5, "review_count": 151, "name": "The Haven Inn Sydney", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed December 2005", "text": "I booked a room for 9 nights for my son and myself on the internet as the pictures of the hotel looked ok. In truth the hotel is terrible. The rooms are very noisy, there is no double glazing and you can hear every noise from outside. It is like being in an echo chamber as you can hear every noisy from other rooms and doors are continually banging. The breakfast is awful just stale cereal and toast. We had to check out after 2 nights without sleep and were refused a refund.", "title": "Do not stay at this hotel", "helpfulness": 9, "user": "caz1949", "date": "January 4, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "service": 2.0}, "id": 4325221}, {"rating": 5.0, "title": "Best Value in Sydney", "text": "Be Warned DO NOT STAY HERE", "helpfulness": 11, "user": "A TripAdvisor user", "date": "November 16, 2005", "id": 4119717}, {"rating": 2.0, "title": "Overpriced, poor for *** grade", "text": "We have just returned from a 3 month vacation in Australia and our last 5 days were spent at the Haven Inn.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "November 2, 2005", "id": 4082144}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "We had tried 3 other Sydney hotels in the similar price range as we were using Sydney as a base whilst we travelled up and down the coast and inland.", "title": "Great place", "helpfulness": 8, "user": "tbbaker", "date": "August 25, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 3806063}, {"rating": 2.0, "title": "Great Location but Noisy", "text": "The Haven Inn was by far the most comfortable and best located and in fact the only spotlessly clean hotel we stayed at not only in Sydney but all around Australia.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "August 12, 2005", "id": 3756763}, {"rating": 2.0, "title": "Concierge Kept Fondling Me - Is this part of the package?!", "text": "I'll be honest - the Haven Inn was recommended to me by my sister who'd stayed there not too long ago. The place itself is not too far from the city, actually I walked right into the city from the hotel (it takes about 30 minutes) so it is well located. There is a small pub across the street which is nice. and all sorts of places to grab some grub. Le Petit Tarte is a great place for breaky. its on the opposite side of the street about a 10 minute walk. The Haven Inn itself I give it really 3.5 stars. 4 if you can remember that you're staying at a \"one man show\" kind of cozy B&B. There are no elevators - so if you have heavy luggage - try and stay on the lower floors -(I think there are only 3 floors anyway) Anyhow, I'd probably stay again. BUT and this is the BIG BUT - The night time concierge took a \"liking to me\" I was in Austrailia on my HONEYMOON!!! which the guy knew - but everytime my new husband was not around this guy would try and get all over me - which I still intend to report to his manager (god - I hope he isn't the manager). Most of the staff is good - the Girl in the morning was very professional - but WATCH OUT for the night time guy from the philippines. It started out with just compliments which was nice, but by the time we went to check out of the Inn he tried to kiss me and fondled me by grabbing me from behind and \"hugging me\" and grabbing my rear all the way from the restaurant to the lobby. (which stopped again - right before my husband could see) - needless to say I was very uncomfortable and my husband was very angry. If the guy isn't working there by the time you choose to stay - then great - you'll like it. But if he is - PLEASE PLEASE PLEASE - Keep your daughters, Wives and Girlfriends with you at all times. I would hate for your vacation to have those memories too! What a honeymoon. (By the way - that's why I rated it a 2 star). Guess you'd agree with that.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "July 12, 2005", "id": 3660274}, {"rating": 5.0, "title": "Our Haven in Sydney!", "text": "Recently stayed at the Haven and loved it. The room had been completely refurbished and we were very impressed with the dvd and cd player, with loads of movies available at reception for free!", "helpfulness": 10, "user": "A TripAdvisor user", "date": "June 21, 2005", "id": 3598924}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 3, "variance": {"poor": 19, "average": 28, "very good": 27, "terrible": 62, "excellent": 15}, "aka": "The Haven Inn Sydney Hotel", "slim_ranking": 0.848648648649}