{"user_rating": 4.0, "review_count": 872, "name": "The Westin Ottawa", "reviews": [{"rating": 5.0, "title": "Nice Hotel, Great Location", "text": "We stayed at the Westin Ottawa for 5 days in July 05. Overall, it is a pretty good hotel. Great location - with access to probably the biggest shopping mall in Ottawa, and within walking distance (5 mins) to the Byward Market and the surrounding shops, cafes and restaurant. There is definitely no problem finding a nice meal. (Our pick: Zoe's in the Chateau Hotel across the street and Wasabi Japanese Restaurant). It is also very close to the Parliament Hill (5 mins or so) if you are interested in seeing the Changing of the Guards and the Laser Show at night.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "July 24, 2005", "id": 3696525}, {"rating": 5.0, "stay_parameters": "Stayed June 2005, traveled on business", "text": "Room wise, it is big, clean and with a very big desk if you need to do some work. The bed is HEAVENLY as they advertised.", "title": "A great stay!", "helpfulness": 2, "user": "YVRTraveller", "date": "June 16, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3564059}, {"rating": 2.0, "stay_parameters": "Stayed June 2005, traveled on business", "text": "As other reviews have indicated, there are quite a number of items for purchase in the room, like a $5.95 bottle of water that greets you at the desk the way complimentary bottled water does, and a $12 pack of toiletries with shaver, toothbrush and the likes which I found expensive. But then again, it is your choice to use that at your convenience or spend 10 mins max to purchase your own at the large Shoppers (Pharmacy) in the adjoining shopping mall. Just check if there is a price tag on the item before you use it.", "title": "disappointing", "helpfulness": 1, "user": "MontrealVoyager", "date": "June 4, 2005", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 3529220}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "In room dining was yummy, fast and at an acceptable price.", "title": "Mixed bag - mostly good but some bad", "helpfulness": 2, "user": "labelleprovince", "date": "June 3, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 2.0}, "id": 3523381}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "My husband and I were there for a wedding October 11 2008 and it was a holiday weekend in Canada (their Thanksgiving) which was great because everything was festive! The hotel was beautiful, clean and smelled nice. The beds were comfortable and the carpets seemed new. I just wish the lighting in the bathroom was a little better for makeup application, but Oh Well! The pool was closed for three days due to cleaning but we did swim in it the last day of our trip and it was nice. The staff was great, upgraded our room, and give some tips on restaurants. All in all a positive experience. PS GREAT location! Walking distance to most everything! Also connected to a great shopping mall.", "title": "Very Nice", "user": "FireFlyOjea", "date": "November 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 22333429, "likes": {"liked": "— Location", "disliked": "— Kinda pricey"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "I originally had booked for a long weekend at the Westin Ottawa but the first night due to overbooking had been moved to the Four Points Gatineau. Inconvenient? Very! In the Westin's defence however, they did comp my night and paid for my parking.", "title": "Nice, but it could've been better", "helpfulness": 1, "user": "Smashing2", "date": "November 23, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 22117612, "likes": {"liked": "— Great location in downtown Ottawa", "disliked": "— The service didn't live up to the Westin brand"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The Westin Ottawa is located in the heart of downtown Ottawa just footsteps away from Parliament, Byward Market, Rideau Canal (and its great jogging path) and above the Rideau Centre mall. I had chosen the Westin specifically for its location and also because of I wanted to make use of the indoor pool and workout room, both of which were good but not outstanding.", "title": "half decent", "helpfulness": 1, "user": "willy2003", "date": "October 19, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 21016256, "likes": {"liked": "— location of the hotel", "disliked": "— prices for every thing"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "Fortunately, the room was large and comfortable with its couch, CRT TV and business desk. The bathroom wasn't extraordinary but got the job done. Unfortunately, I didn't have the time to really try much else at the Westin as I was on a tight schedule. It would have been nice had the Westin informed me beforehand that I was being moved to a different hotel as I don't know the city (if I didn't happen to have a GPS with me this review would be a lot more negative) and we had been communicating by email all the time prior to my arrival. 24 hour parking is available via the Rideau Centre but with the one-way streets and traffic downtown it can get confusing, and also the parking lot is quite a ways away from the hotel entrance. If anything, it seemed like the Westin was shortstaffed as I was in line for 15+ minutes both to check-in (twice) and check-out.", "title": "great location", "user": "ravidel", "date": "September 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 20049160, "likes": {"liked": "— location and view", "disliked": "— no vegetables for breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "If you're not driving then I'd recommended the Westin Ottawa but the service didn't seem to live up to the Westin brand.", "title": "Superior Service", "user": "ruserene", "date": "August 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 19183675, "likes": {"liked": "— The service and the location", "disliked": "— Not a thing"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "The Westin chain consistently delivers high quality service and amazing heavenly beds and showers! This location is convenient as it is attached to the Rideau Centre. Lots of restaurants nearby and room service is great.", "title": "Great place to stay in the nation's capital", "user": "Larry J", "date": "December 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 147173116}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "You won't be disappointed if you book your next stay at the Westin in Ottawa!", "title": "Very Impressed", "user": "Vacationhugger", "date": "December 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 147128348}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "We chose this hotel because it is attached to the Rideau Centre, great for Christmas shopping. At check in we had the pleasure of dealing with Marc who was extremely helpful, friendly and informative. He explained right off the bat they were experiencing slow down with the elevators due to renovations. Because this was not explained at the time of the reservation, he upgraded our room. Nicely renovated room overlooking the NAC, Sparks Street and a angled view of the Parliament buildings. Spotlessly clean-(after seeing Marketplace)-this was a pure pleasure. Not a speck of dust, nothing. The bathroom was super clean, no water marks on the walls no dirt!! No hand prints on the headboard or windows!! Good all around!!", "title": "Amazing views", "user": "Jfk00", "date": "December 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147016889}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "The location of this hotel is amazing, one of the best in downtown Ottawa and we had an incredible view of the parliament buildings from our room. The hotel is attached to the Rideau shopping centre, which was very convenient and is a 5 minutes walk to the Byward Market, one of my favourite places in Ottawa. Others have said that the price is too high, but we found our room rates reasonable, possibly because we were attending a conference that had secured good room rates. My only complaint was that the coffee bar didn't do a good job of moving through people who needed to get to the conference, so we had to wait in a long line, which made us late.", "title": "Nice location, average room,", "user": "casper-sk", "date": "December 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 146953840}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Nice hotel, good location connected with the convention centre. I had a traditional room for two nights. Nice bed work area and wonderful view. Fairly high end, the only thing that looked out place was plastic and paper cups. Due to renovations the elevators were quite slow. Its not my favourite hotel in Ottawa, but very close. No problem deciding to stay here again in the future.", "title": "good stay", "user": "Human44", "date": "December 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 146654929}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "We only stayed one night and got a great deal through AAA. We were upgraded to a view of the parliment buildings - beautiful. Very nice room, clean, comfy bed/pillows, would definately stay there again. Only complaint was the DMF fee of 2.8% tagged onto our bill (and GST on that). Found out later that it is a MARKETING FEE charged to hotel patrons to increase tourism to Ottawa. How stupid is that? We the tourist pay to increase tourism?? Now who's stupid - my guess is me, the tourist! Oh well, attempting to get a refund.......", "title": "Really nice", "helpfulness": 4, "user": "torav", "date": "September 6, 2005", "detail_rating": {"cleanliness": 5.0, "rooms": 5.0, "value": 5.0}, "id": 3846121}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "We stayed at the Westin Ottawa for a Fri-Sun trip in Aug. and really enjoyed our stay.", "title": "Perfect Location", "helpfulness": 12, "user": "On_my_way", "date": "August 25, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3806045}, {"rating": 4.0, "stay_parameters": "Stayed August 2005, traveled on business", "text": "The location of the hotel is perfect, across the street is the Rideau Canal and if you go out to the right and up a couple blocks the Parliament Buildings are right there. Byward market is only a minute or two away and the Rideau shopping mall is attached to the hotel. The Westin and Chateau Laurier are pretty close in proximity... all the other hotels in the area look rather dumpy(Novotel, Marriott). Out of the four we were choosing from we were glad we chose the Westin.", "title": "Not your best Westin", "helpfulness": 1, "user": "fudy", "date": "August 23, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 3798571}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "GOOD THINGS:", "title": "Great Location", "helpfulness": 5, "user": "rich13", "date": "August 4, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3737331}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "1. Just minutes away from everything.", "title": "Nice Place, Friendly Staff", "helpfulness": 2, "user": "MichaelChristine", "date": "August 2, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3730691}, {"rating": 4.0, "title": "Christmas in Ottawa", "text": "Having used the Westin in Toronto we half knew what to expect from this hotel. Their web site and previous reviews were very helpful. The biggest plus has to go to their concierge, Patrick. I emailed prior to our visit enquiring about various things including upgrading our room to a junior suite. He had everything in hand upon our arrival and made our visit to Ottawa all the more enjoyable, a big thank you.", "helpfulness": 3, "user": "SL.123", "date": "January 4, 2013", "id": 148846067}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "The upgrade is well worth the extra if travelling with a teenager, separate bedroom with large tv. Large bathroom with double sinks, bath and very large walk in shower. The beds and pillows are extremely comfortable. I have to say the aircon is rather loud at night and we ended up switching it off then on again in the morning.", "title": "Very reasonable hotel - This review is from Multiple stays", "helpfulness": 2, "user": "VeryPickyLondon_UK", "date": "January 4, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 148811545}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "We had breakfast several mornings in the hotel and also Christmas Bunch, first class service from friendly staff and good quality.", "title": "Great Central Location Near Canal & Byward Market", "user": "Monica H", "date": "January 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148753147}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Go for a wifi package rather than the daily rate.", "title": "Good!", "helpfulness": 1, "user": "R L", "date": "January 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 148747375}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Linked to the Rideau Centre from the 3rd floor, very handy on cold winter days. Great location downtown for its bars restaurants. Parliament Hill is a short walk over the canal and well worth doing the tour.", "title": "Despite 3 fire alams at 3, 4 and 5am, a very nice stay - But no FNC!", "helpfulness": 2, "user": "StinkyandStinkpretty", "date": "January 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 148599131}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "This was the second stay at the Westin for my husband and I. We traveled to Ottawa to see Winterlude for the first time. The Westin's location is perfect. Not only was it right next to the Rideau Canal for ice skating but it's less than a block to the Byward Market AND it's connected to a HUGE mall with direct access through the hotel. Everything is within walking distance to the Westin (except Scotiabank Place, of course).", "title": "The Westin is in a PERFECT location!", "user": "DuffyDo", "date": "February 17, 2009", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 24663656, "likes": {"liked": "— Location", "disliked": "— Having to leave."}}, {"rating": 4.0, "stay_parameters": "Stayed January 2009", "text": "As always, the room and bathroom were quite large and very, very clean. Maid service seemed to come earlier in the day, which we appreciated as we get up early to get our day going.", "title": "Well located, great choice in winter", "user": "FTMac", "date": "February 17, 2009", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 24650082, "likes": {"liked": "— The location", "disliked": "— No free internet service"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "We will definately stay at the Westin for Winterlude 2010!", "title": "Theft at the Westin", "helpfulness": 4, "user": "LBBMexicoCity", "date": "January 26, 2009", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 23920116, "likes": {"liked": "— Good location, lovely rooms", "disliked": "— Having my jewelry stolen from the manager's office after the housekeeping staff was honest enough to turn it in"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "In the middle of the winter in Ottawa, Westin is the place to stay. It is located right at heart of Ottawa, across the street from Rideau Canal, and has an indoor walk way to get to the Rideau Center mall. We stayed in Westin in downtown Ottawa in January 2009 for a hockey tournament, the hotel proved to be a great choice. The kids enjoyed skating on the canal late at night, early in the morning, and we got to enjoy the beaver tails (an Ottawa special kind of donut) on the way back. The mall was a great place for us to get food, drinks and do some shopping, for kids to have some space to walk around (when outside is -25C). The hotel pool and exercise room was very popular with kids as well. The room was average size, but the beds are comfortable. I probably liked better if small stuff such as show cap and sleepers are provided for convenience. The parking charge was very expensive although the service was good. There is no free internet service; the charge was rather expensive and not flexible.", "title": "Best night of rest ive ever had!", "user": "rrosario2", "date": "January 9, 2009", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 23394859, "likes": {"liked": "— The room", "disliked": "— No currency exchange"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "First let me say that I find the Westin chain solid and reliable, and had stayed at this Ottawa Westin before (in May 2006) with an excellent experience. However, when I checked out after a 2-night business trip, I left a small bag of jewelry on the counter in the bathroom. By the time I realized my mistake, I was already in Quebec City. I called the hotel the day after checking out and as luck and honesty would have it, the cleaning personnel found the bag with all the items still in it (a diamond and emerald ring, pearl earrings, an amber bracelet and a silver necklace) and turned it in to the manager's office. Which is where things began to go terribly wrong. The manager on duty at the time told me he would immediately send the bag to my sister's home in Quebec (as I live in Mexico). When the bag never arrived, I called several times to follow up. The manager who finally gave me some answers (Rhonda McDougall) told me that the bag had been stored over the weekend in a locked container attached to a wall in the manager's office but that it became 'dislodged' over the weekend and all of the contents spilled out on the floor. When they went to collect the various items, they could no longer find the bag of jewelry. Ms. McDouglas apologized profusely for the 'loss' of the item, which appeared to me to be more of a 'theft' of the item. I suppose no hotel wants to admit that personnel with access to the manager's office would steal, but I was left to file a theft report with the Ottawa police on my own in the hopes that someone would make a proper investigation. I found the utter lack of concern from the Westin management for a probable thief within its own ranks to be quite troubling and would recommend that guests stay away from the Westin Ottawa until they sort out their internal issues.", "title": "Standard 4-Star Hotel", "user": "GIMD", "date": "December 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 22458086}, {"rating": 4.0, "title": "Centrally located; good choice for active people", "text": "We just returned from a two night stay with friends. The hotel is large and very nice. It is attached to a large shopping mall, which made it very convenient. Also it's just across from the Byward Market.", "helpfulness": 7, "user": "Snert41", "date": "May 23, 2005", "id": 3494188}, {"rating": 2.0, "title": "Only the bed was worth the stay...", "text": "Front desk staff was very kind and helpful. Only registered guests with room keys could access the 3rd floor level or higher, so we felt secure. There is a nice (and new) fitness center conveniently located next to a smaller-sized indoor pool and whirlpool on the 6th floor.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "March 18, 2005", "id": 3285802}, {"rating": 5.0, "title": "Wonderful Valentine's Day Stay", "text": "As far as the rooms, both of our rooms had huge picture windows which looked out over the city skyline (quite pretty, especially at night). The beds were extremely comfortable, with very luxurious bedding. Many soft, thick Egyptian towels and even a robe was provided. Our room had one king bed, our friends had two queen-sized beds. The room with the two queen beds was a bit larger, but both were good sized and comfortable. Each of our rooms had a large safe located in the closet.", "helpfulness": 3, "user": "annievee", "date": "March 8, 2005", "id": 3259701}, {"rating": 4.0, "title": "loved my stay/overall", "text": "Our only criticisms -- (1) the on-site parking garage was difficult to navigate, there were very few available spots, and at $14 CDN with no \"in-out\" prviledges was pricey; (2) there were many items \"for purchase\" in our room, to the point where it was annoying. For $13 CDN there was a clear box containing travel-sized toothbrush & toothpaste, shaving cream, razor and a comb. There were a lot of expensive snack items near the minibar which took up the entire counter space. Example: small bag of Famous Amos choc chip cookies that could be purchased in a store for .75 - $1 were there for $3.50 CDN. We were glad we didn't have children in our room, since those types of items were simply lying about for tempted hands.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "March 4, 2005", "id": 3251342}, {"rating": 2.0, "stay_parameters": "Stayed January 2005", "text": "Overall we did enjoy our stay. The hotel's location was ideal for our activities and we felt as though we got our money's worth. We would stay there again.", "title": "4 star rating, 2 star service", "helpfulness": 5, "user": "travelguy21", "date": "March 1, 2005", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "service": 1.0}, "id": 3238916}, {"rating": 4.0, "stay_parameters": "Stayed December 2005, traveled on business", "text": "I stayed here for three nights for a conference. The room was average-sized but faced the Canal and The Fairmont. Definitely request that side of the hotel - I heard from others at my conference that the view on the other side is no match. Great bed and attentive housekeeping and staff. The location can't be beat: The Parliament is a ten-minute walk (be sure to go up to the top of the Peace Tower) and Byward Market is on the other side of The Bay, a rather large department store connected to the Rideau Center. The Market has a large selection of great places to eat. I would definitely stay here again!", "title": "Great location!", "helpfulness": 6, "user": "ChristieBett", "date": "December 6, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4216856}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "WIthout doubt the star of this Westin is the \"Heavenly Sleeper\" bed. You'll feel like a bureaucrat on a government expense account after a night or two here. The Westin is connected to the large Rideau Centre Shopping Center and is just a few minutes walk from both Parliament Hill in one direction and the Byward Market in the other. Check-in and out were fast and easy and both the front desk and bell staff were helpful and courteous.", "title": "Comfortable & Well located", "helpfulness": 9, "user": "Kierkegaard", "date": "October 10, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4005580}, {"rating": 3.0, "stay_parameters": "Stayed September 2005, traveled on business", "text": "The room was a little larger than usual--in fact the distance from the foot of the bed to the TV was about 12-13 feet--a larger TV would have been nice.", "title": "Below average Westin", "helpfulness": 7, "user": "Londoner1974", "date": "September 27, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 3941923}, {"rating": 5.0, "title": "Every guest is the same", "text": "The bathroom was OK but nothing special--very similar to your typical Holiday Inn, in fact. I paid only $65US ($78 with fees & taxes) on Priceline for a one night stay. I would gladly have spent a week here at those rates!", "helpfulness": 8, "user": "A TripAdvisor user", "date": "September 16, 2005", "id": 3909065}, {"rating": 5.0, "title": "Wonderful", "text": "But it's the bed and the fine linens that made the room--easily one of the two or three most comfortable ones I have slept in. Unless you are accustommed to Buckingham Palace or the world's most luxurious hotels, you should feel very comfortable here. Recommended.", "helpfulness": 5, "user": "chasiubow", "date": "September 13, 2005", "id": 3899427}, {"rating": 5.0, "stay_parameters": "Stayed July 2008", "text": "Great location. Clean room, great bedding and beds.", "title": "great hotel in Ottawa", "user": "EstherD", "date": "July 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17837775, "likes": {"liked": "— comfortable beds, big rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "We had an amazing stay at the Westin. The hotel is in a wonderful location. It is right in the heart of the city. We walked everywhere, to Parliament Hill, Byward Market, the Canal, the Locks. Our room had a wonderful view of the Parliament buildings. The rooms were a good size and beds were comfy. We also enjoyed the pool and rooftop terrace.", "title": "Amazing Staff", "helpfulness": 2, "user": "weatherobsessed", "date": "June 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17035313, "likes": {"liked": "— staff, location", "disliked": "— there is nothing i could complaing about"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We were most impressed with Amber on the front desk. My 8 year old son had bought a small wooden bobble head turtle from the Byward Market as a souvneir. Unfortunately it fell 11 stories down the elevator shaft. He was heartbroken. We asked Amber if there was any way of retrieving it. Amber said there would be workers going down there the day we would be checking out and they could look for the turtle. In the meantime, Amber sent up milk and cookies and a stuffed turtle along with a very beautiful card to comfort our son. He was thrilled, we were impressed.", "title": "Location, Location, Location", "user": "fourwaystreet", "date": "May 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 16432778, "likes": {"liked": "— Location", "disliked": "— Nothing Really"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "The day after we got home, Amber called to say the turtle was rescued and she would fed ex him home. My son's turtle is now home safe and sound and we have one happy little boy who is truly grateful for the return of treasured toy. Thank you to Amber for going above and beyond the call of duty.", "title": "Amazing location!", "user": "the_traveller_from82", "date": "April 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15146959, "likes": {"liked": "— Location", "disliked": "— Parking $$$$"}}, {"rating": 3.0, "title": "great hotel deal", "text": "The location of the Westin Ottawa is Great!!!!", "user": "seahound", "date": "April 7, 2008", "id": 14868865}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled solo", "text": "Arrived for a 3 night stay using Starwood points with $60US per night in addition at 4pm and found the self parking to be \"closed for renovation\". I had to choose the $34+tax rate for valet or park down the street with no in and out. Then to the desk for a quick check in to a 6th floor room which was just ready for me… (1ts floor of actual rooms). Opened the door and the room wreaked with cigarette smoke...was a non smoking hotel....sure it is. Anyway, called and told them and with 10 min had an upgrade to a corner room on a higher floor. The view was wonderful BUT the furnishings are worn (carpet, drapes, tacky wall paper) all 80s and in need of a re-do. I also had a lot of problems with the shower which drained improperly. The bed however was great and so I did sleep well. All in all, not recommended ESPEAIALLY if you are paying to $200++ per night rate advertised.", "title": "OK but Tired and worn", "helpfulness": 1, "user": "eccewbd", "date": "August 14, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 18963785, "likes": {"liked": "— The Heavenly Bed", "disliked": "— The tired and worn room decoration"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007", "text": "The hotel was just nicely located in the heart of Ottawa, the indoor connection to the mall was such a convenience. The room was clean and the bed was comfortable. Our room was facing the Rideau Canal, on a higher floor, so it put us into a better mood when we dined in our room by room service.", "title": "Pricey but a nice stay", "user": "maxmiles", "date": "August 12, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18901111}, {"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "My wife and I stayed at the Westin for 2 nights in June, and were completely unimpressed by the place. It had the reputation as an excellent hotel.", "title": "Not impressed", "helpfulness": 3, "user": "gpcomd", "date": "August 8, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "location": 4.0, "rooms": 2.0}, "id": 18756028}, {"rating": 4.0, "stay_parameters": "Stayed July 2008", "text": "Pros", "title": "Great location, great amenities", "user": "markas101", "date": "July 22, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 18131831, "likes": {"liked": "— Pool area", "disliked": "— Overpriced valet parking"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "- fast elevator (even though it got confused and inexplicably kept going up and down before finally getting us to our floor)", "title": "Consistent Westin experience - great views!", "user": "Doug H", "date": "July 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 18016130, "likes": {"liked": "— Views of downtown Ottawa", "disliked": "— Dark hallways"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "This is an excellent hotel for Business or pleasure...it has a wonderful central location such that we could walk to all the attractions and museums we wanted to see. Great restaurants near by and direct entrance to the rideau shopping mall. The staff could not be more helpful...the best service I have had in a hotel for years....the rooms very modern, upgraded, and super clean. And the westin heavenly bed promise could not be more true,...seriously, the best nights sleep for months !!!! Pool and hot tub excellent. Thanks for a great stay !", "title": "Fantastic hotel", "user": "WNR_12", "date": "December 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147823251}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "I stayed here for 4 days in July 2012 and it was awesome. Check-in was fast and efficient. I'm a federal governement employee so I asked for the best rate and it happened to be the provincial government rate of $157/night (way cheaper than standard price). The front desk gave me that rate anyway. The room was wonderful (ending up getting a room with 2 beds). Very clean and big!", "title": "Best hotel in Ottawa", "user": "Michelle B", "date": "December 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147580525}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "There is a a green option for your towels and changing of your sheets. For each day that you don't require linens to be laundered you can either get extra Starwood points or a $5 off couplon for the hotel restaurant. Great deal! The gym, pool and sun deck are all excellent amenities and this hotel is connected to Rideau Centre, Ottawa's best mall. It is also walking distance to byward market (trendy bar/shopping neighbourhood) and downtown Ottawa (Parliament, museums, etc.).", "title": "Short stay- very convenient", "user": "MtlFam", "date": "December 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147541665}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We arrived late and left immediately after breakfast. Staff was very helpful. Room was really nice. Property was immaculate. Breakfast buffet was nice, but kind of pricey. I investigated, but didn't use the health club. Pool looks like a good family pool. If you don't want to spend a lot for breakfast, the Rideau Centre is practically part of the hotel. There are probably alternative eateries there- very convenient shopping.", "title": "Great Location, but....", "user": "GerryToronto_", "date": "December 14, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 147460111}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "Our family gathers in Ottawa every year in early December and we usually stay at the Westin because of location and its facilities. Ottawa has surprisingly limited selection if you want a central hotel with an indoor pool. The Westin offers these but it is looking increasingly tired and frayed. The lobby is shabby and the halls are worn and either too hot or too cold. The elevators ( all four of them) are in the midst of a two year re-do with poor service for all of that time or use the freight elevators! The bathrooms are lit so brightly you could do nano -surgery in them and the lights in there make for a lot of heat; bring your own night lights. Is this the best Westin can do in the country's capital directly across the street from Parliament?", "title": "Second to none", "user": "JFLND", "date": "December 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147276122}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "Great night at the Westin, quick & efficient check in, very clean room, great views from our room (1720) over parliament, extremely comfortable beds (we overslept!). We had dinner at the Shoreclub at the hotel which was amazing. We'll be back!", "title": "Excellent overnight stay!", "helpfulness": 2, "user": "RenataKirsch", "date": "December 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148199654}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "My overall experience with this hotel is very good. I came here with my family for a week-long March Break excursion to check out our national capital's history. When we checked in, the staff was extremely friendly and helpful, and they showed us to our room. We had a corner suite on a higher floor, and the room seemed oddly small, so we requested to be moved to a more different room. The room that we were given was larger, and very nice. The decor of the room (and hotel overall) was very well done. My first impression on the room was good, the room was clean, quiet, and spacious. At a Westin, it's no surprise that the beds were extremely comfortable. The location of the hotel is fairly good, it is close to most of the attractions, but you must be prepared to walk. Perhaps the most impressive part of the hotel was the restaurant, \"The Shore Club\". The restaurant staff was excellent, and the food was exquisite. I encourage you to try the the clam chowder, as it was creamy and delicious! (I also recommend the salmon, mmmm...).", "title": "Excellent Stay!", "helpfulness": 2, "user": "Chris W", "date": "December 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 148155361}, {"rating": 4.0, "stay_parameters": "Stayed May 2012", "text": "We always stay at the Westin when in Ottawa. The rooms are immaculate however the hotel is beginning to show it's age. Due for a renovation I think. The staff are most pleasant and helpful. The Westin is close to everything and connected to the Rideau centre mall. Very convenient especially on those rainy I don't know what to do days.", "title": "Excellent hotel I great location", "user": "Steve S", "date": "December 25, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 148027455}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "First when you arrive, there is valet service. I have a big SUV and they always take care of my vehicle for parking (downtown Ottawa).", "title": "Very nice hotel !", "user": "lyse b", "date": "December 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147954966}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "The lobby is beautiful and always room to sit and enjoy.", "title": "Average", "user": "CCS294229", "date": "December 23, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 147928913}], "location": {"country": "Canada"}, "stars": 4, "variance": {"poor": 52, "average": 108, "very good": 281, "terrible": 17, "excellent": 414}, "aka": "The Westin Ottawa Hotel Ottawa", "slim_ranking": 0.179104477612, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Located in the heart of the city, The Westin Ottawa is near Parliament Hill and the scenic Rideau Canal, historic sights and world-class shopping at the adjoining Rideau Centre."}