{"user_rating": 5.0, "review_count": 424, "name": "The Caves", "reviews": [{"rating": 5.0, "title": "LOVED THE CAVES!", "text": "Well, it's been about 1.5 months since our trip to Negril Jamaica, and still we dream, remember and wish we were still there. We were fortunate enough to stay @ The Caves Resort. There are 5 star hotels and then there is paradise, which is what we found @ The Caves, paradise. Very private and secluded, yet full of fun. Do go with a loved one for romance, or with friends for a chillin good time. My husband and I went for a nice romantic getaway and it succeeded our expectations by FAR! The scene and rooms were breath-taking, and I can be very hard to please. Food was gourmet great, and we found plenty to do without ever leaving. Swimming, jumping the cliffs, snorkeling, kyaking, chillin. Drinks (planters punch, my fav) were endless. WE WILL BE BACK next year FOR SURE! Be sure to book the jacuzzi @ sunset, get a massage, the best! Although, we also like to think of it as our paradise, our place. If you go, tell Brian hi for us, as he was VERY friendly and accomadating. ONE LOVE, YA MON!", "helpfulness": 15, "user": "A TripAdvisor user", "date": "March 23, 2006", "id": 4727313}, {"rating": 5.0, "title": "Truly unforgettable!", "text": "My husband and I stayed at the Caves for our honeymoon and were spellbound by the beauty! The room, food, sunsets, and service were the best of anywhere we have ever traveled. I couldn't believe what an amazing place this is and we can't wait to go back. It was so quiet and relaxing but also fun and friendly. The fresh fruit daiquiries were delicious and so were the incredible meals. This is the perfect place for a honeymoon and we will definitely return for an anniversary!", "helpfulness": 25, "user": "A TripAdvisor user", "date": "March 23, 2006", "id": 4727168}, {"rating": 5.0, "stay_parameters": "Stayed December 2004", "text": "We stayed at the Caves for Christmas 2004. We have been longing to go back ever since...I can't believe we are able to go back for Christmas 2006!", "title": "We get to go back!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "helpfulness": 20, "user": "D Bishop", "date": "February 21, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4477319}, {"rating": 5.0, "title": "Perfect Honeymoon in Negril", "text": "As firm believers in Trip Advisor we wanted to see what everyone had to say since we've been there last. First I want to say this IS the BEST place ever!!!!! I can't beleive someone would give this place less than a 5 star review.", "helpfulness": 35, "user": "A TripAdvisor user", "date": "February 8, 2006", "id": 4447475}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "My hubby and I went to The Caves and had our wedding there and spent the rest of the week there, as well. The Caves far exceeded our expectations!", "title": "Counting down the days to go back!", "helpfulness": 13, "user": "jamaicaboundin06", "date": "May 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5057941}, {"rating": 5.0, "title": "Nature's Beauty", "text": "All of the positive reviews on this site are correct: they (the staff) DO know your name as soon as you arrive, they DO try their best to make your stay as relaxing as possible, they DO accommodate any of your wishes to the best of their ability. This is our favorite vacation spot so far and we will return yearly happily to celebrate our anniversary. We were excited this was the place we chose so we 'had' to come back :)", "helpfulness": 14, "user": "A TripAdvisor user", "date": "May 11, 2006", "id": 5055357}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "Our wedding was perfect, Eileen, Sharlene, and the staff did their best to make it that way. It is a perfect place to have a wedding! There were several spots from which to choose for the ceremony, and the dinner afterwards was just fabulous. My family had stayed at an AI down the road and The Caves was a 'refreshing, quiet break from the hectic family resort' they had chosen.", "title": "Escape to Paradise!", "helpfulness": 5, "user": "lancelot916", "date": "May 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5039066}, {"rating": 5.0, "title": "10 year anniversary", "text": "The staff is far superior to any I have experienced. From the cleaning service to management, they are all excellent. I could not think of a negative thing to say about a single person I met working there. Even the groundskeepers were so pleasant! (Whom we only saw once or twice throughout our stay)", "helpfulness": 10, "user": "A TripAdvisor user", "date": "April 28, 2006", "id": 5017535}, {"rating": 5.0, "title": "The Caves - We have been renewed!", "text": "Each villa is unique, the spa service is phenominal, the food is unbelievable...we truly fell in love with this place. The reviews are correct, it's the perfect place to take someone you love. I see why this is a top (if not THE top) resort in Negril. They work very hard to please, and seem to succeed more than not.", "helpfulness": 18, "user": "A TripAdvisor user", "date": "March 29, 2006", "id": 4772924}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "My boyfriend and I and another couple stayed at the Caves this fourth of July weekend for 4 nights. First off, the drive from Montego Bay takes about 1 1/2 and the scenery isn't too great just to be warned; very poor people living along side of the road....however, when you pull up to the Caves, you really only see a gate and my first thought was \"Oh my God, what did I get us into.\" (since I booked the trip)....when the gate opens, the staff comes to greet you and you basically sit inside this tiny lobby area and fill out paperwork; they ask you if you have any feed allergies, because there are no menus. Basically it's whatever they are serving that day for lunch and dinner. Lot's of seafood, so if you don't like seafood, tell them immediately. The food was indeed excellent; very fresh, very healthy....we stayed in the Moon Shadow room and my boyfriend and I were upstairs and my friends were downstairs; big setback.....we didn't realize there was NO AIR CONDITIONING in many of the suites including ours. July in Jamaica is really HOT, even at nightime...there was no breeze at night; the staff brought us some extra fans, but we were dying at night; we had an outdoor shower too which I didn't mind, but my girlfriend hated it....because of no air conditioning, we had to leave the windows open and every night after dinner, there was a cochroach waiting for us in the bathroom....besides these huge bugs, there were lots of mosquitos everywhere (bring OFF) and other types of dragonfly's etc. If you don't like bugs or need air conditioning; I would not recommend this room.", "title": "Amazing property, but there are some things you should know", "helpfulness": 38, "user": "AngelinaChicago", "date": "July 8, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 5440129}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "There is also not much to do at the hotel activity wise; you can go on a day trip, which we didn't do, but at the hotel they could really use a small work out room or even a yoga studio; considering the whole theme is to relax your mind and your body.....", "title": "I feel really bad for people who have not stayed at the caves!", "helpfulness": 8, "user": "gooddave", "date": "July 4, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5424178}, {"rating": 2.0, "title": "overrated", "text": "The staff was very cool and very nice; whatever you needed, they were really willing to make you happy.....", "helpfulness": 16, "user": "RonsyRoo", "date": "July 3, 2006", "id": 5421361}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "The deep tissue massage was awesome!! Highly recommend getting one at lease twice on your trip.", "title": "Just Fabulous", "helpfulness": 6, "user": "silverbell783", "date": "June 29, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5411049}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "I would not recommend eating in the cave, especially if the tide was high like when we were there....water would crash along the coral and splash thru the entire cave...I would recommend requesting the lovely outdoor table right below our suite \"Moon Shadow\".....very romantic and they decorate it with rose pedals and candals and the moon sits right above you.....Spectacular!!", "title": "I love The Caves!", "helpfulness": 21, "user": "mimijohn", "date": "June 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5316408}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "You have heard it all from previous reviews. The accomodation, staff, landscaping is all tops. No stiff, here is your list of rules type of place ... per the bar tender \"If one of us is not here, just come behind the bar and get what you want, mon, it's no problem!\"", "title": "chill out in Negril", "helpfulness": 12, "user": "Beachfixture", "date": "May 24, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 5208357}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "We met really great folks from New York, LA, Vegas, Atlanta ...", "title": "50 feet from perfection...", "helpfulness": 33, "user": "Enachi", "date": "May 13, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5065735}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "If I had to \"reach\" to find something to complain about - we were a bit disappointed the water got a little rough for swimming and too rough for snorkeling (you have to get close to the rocks) after our first of 5 days. So the pool was the place for a water cool down - this is the only time I would say the place could feel a bit crowded - like I said I'm reaching because everyone there was cool.", "title": "The Caves is Paradise", "helpfulness": 5, "user": "Stevecation", "date": "May 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5064951}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "My husband found the Caves online and booked it for 5 nights of our 10 night honeymoon in Jamaica. I'd seen the pictures of the resort before we left, but my breath was taken away upon seeing it in person! The resort itself is gorgeous - my idea of tropical paradise times 1000 doesn't cover it.", "title": "Honeymoon at Caves was Incredible!", "helpfulness": 11, "user": "Alybyzrp", "date": "September 23, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5828462, "likes": {"liked": "— The room, the food, the drinks, the scenery, the water, the cliff jumping, the candlelit cave dinner, the private hot tub with champagne, the list goes on....", "disliked": "— Having to leave"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The food was excellent for breakfast, lunch, and dinner. The drinks were excellent - the best bloody mary I have ever consumed (dirty bananas, hummingbirds and cliff divers were also good!) They went above and beyond in making us conch fritters before we left, turning the van around to bring us back for them!", "title": "An Unforgettable Experience", "helpfulness": 11, "user": "sunseeker012", "date": "September 19, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5816748, "likes": {"liked": "— The people, food, drinks, location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We stayed in the Birds Nest and adored the room. We're both very tall (6'5\" and 5'10\"), and the tub was large enough for both of us to lie down in side by side. Views into the ocean were wonderful to wake up to, and we adored the CD's in the room!", "title": "Turquoise Tranquility at The Caves", "helpfulness": 14, "user": "memphisdln", "date": "September 15, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5804504, "likes": {"liked": "— With only 4 other guests there, this breathtaking resort seemed like ours alone.", "disliked": "— Not a lot of walking or strolling space; but we made up for that with swimming."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The water was wonderful, as well as the areas in the cliffs to lounge during the day.", "title": "Perfect Place, Perfect People", "helpfulness": 23, "user": "Sandra R", "date": "September 13, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5797424, "likes": {"disliked": "— Can't complain about a single thing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "I think that perhaps a comparison may help put things in perspective. We stayed at the Caves from Monday until Friday - they were booked for the weekend by the time we made our reservation, so the second half of our honeymoon was spent at Couples Negril. I was almost in tears upon arriving at Couples - also a good resort, but nothing at all like the Caves. The Caves gave us personalized attention when we wanted it, the special activities (hot tub at sunset and late night, candlelit dinner in the cave) were incredible and felt so special. Our honeymoon at the Caves was the perfect place to unwind from the stress of the wedding and enjoy just relaxing and being with each other. (Couples on the other hand, had so many activities that we almost felt guilty for staying in our room and hanging out with each other.) If you don't like the person you are going to the Caves with, then it probably isn't the resort for you. If on the other hand you are looking to spend some quality time, nothing on earth can top it.", "title": "It took our breath away", "helpfulness": 12, "user": "wlynno", "date": "August 28, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5717685, "likes": {"liked": "— everything was beautiful, the food was great, and the dinner in the cave was amazing!", "disliked": "— nothing"}}], "location": {"country": "Caribbean"}, "stars": 4, "variance": {"poor": 5, "average": 10, "very good": 33, "terrible": 1, "excellent": 375}, "aka": "The Caves Hotel", "slim_ranking": 0.0215053763441, "detail_rating": {"service": 5.0, "cleanliness": 4.5, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "The Caves sits along the limestone cliffs of the West End of Negril, right next to the famous Negril Lighthouse in Jamaica. Although situated only a few miles away from the bustling town center, this private enclave is a world apart. Eleven handcrafted wood and stone thatched-roof cottages, plus a 4-bedroom fully self-contained luxury villa, are interwoven between ten acres of lush vegetation and naturally formed volcanic caves. Quaint stone pathways wind through the limestone cliffs dotted with palm, sea grape and dogwood trees overlooking the Caribbean Sea. An arrangement of coral stairs and walkways lead to sundecks with uninterrupted views of the sea and sky, and grottos with turquoise water pools and fossilized marine life. A tropical reef system comes right up to the edge of the cliff, perfect for snorkeling. Guests can climb down ladders into the sea or take a leap from several “jump points,” the highest of which is 30 feet! An intimate, private and unique resort, The Caves is perfect for romance and relaxation.The Caves generally does not accept children under 16 years old. Exceptions must be cleared with the hotel management."}