{"user_rating": 4.5, "review_count": 3401, "name": "The Venetian Macao Resort Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "Part of an Eva Air package. The Venetian was definitely worth the money. There's enough in the hotel to keep you occupied--shopping, spa, pubs, bars, restaurants and of course the casino. It is truly the Vegas of Asia--however, it is a stand alone casino--a few years down the line with more hotels on the cotai strip, it will have more of the vegas strip feeling.", "title": "venice without the smelly canals", "helpfulness": 1, "user": "Taipeiworldlywise", "date": "December 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 22497045, "likes": {"liked": "— the sheer size", "disliked": "— too much walking;)"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "shopping: mall part of the hotel", "title": "Grand Grand Venetian Macau", "helpfulness": 2, "user": "rahul_the_traveller", "date": "November 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 22255978, "likes": {"liked": "— bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "food: definitely recommend the steak restaurant. The food was fantastic and service was great as well", "title": "Loved it-even though it was busy", "user": "raisinette", "date": "November 24, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 22144138, "likes": {"liked": "— everything!", "disliked": "— having to leave:("}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "fun: gondola ride is admittedly a little tacky but still super super fun with real italian gondoliers", "title": "The best hotel we have ever stayed", "user": "meshikhs", "date": "November 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 22059006, "likes": {"liked": "— grandeur", "disliked": "— none"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "rooms: huge suites with huge bathrooms", "title": "Surreal Experience", "user": "dadsasdasd", "date": "November 20, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 2.0, "cleanliness": 5.0, "value": 3.0, "location": 2.0, "rooms": 5.0}, "id": 22023753, "likes": {"liked": "— Unlike any other place in the Earth (expect Vegas)", "disliked": "— Service must be better if they want to present themselves as a true 5 star place"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "This hotel is absolutely one of Macau's newest tourist attraction. Yes, it is amazing how big this monstrosity is. The other reviewers have pretty much said it all really so I'm going to focus about things that are not covered by other reviewers.", "title": "Big room, too big, hard to get around (just because it's too big)", "helpfulness": 1, "user": "infernalman7", "date": "December 29, 2008", "detail_rating": {"business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 1.0}, "id": 23078134, "likes": {"liked": "— Shopping Mall (food)", "disliked": "— Location, Everything-artificial, Too big bad direction info"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "This hotel has a really big shopping mall which resembles Venice. It's all artificial from the canels up to the sky. It has all the mid to top tier shops and flagship stores. Many selections from the food court of-course, but there are some restaurants located on the 1st Fl to consider as well. Tried a couple of them, loved Blue Frog (steak house) but don't get the so-called \"bottled water\", each cost around HKD50 (yes, it's imported).", "title": "So over the top that it's a must-see", "user": "Shanghaisol", "date": "December 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 23069220, "likes": {"liked": "— Complimentary shuttle bus", "disliked": "— The food."}}, {"rating": 2.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "The room itself is good. But it was quite a walk from the closest elevator! Each floor has more than 110 rooms and there are so many sets of elevators that would take you to a completely different part. If you get lost, trust me, it's a whole lot easier to navigate if you use the right elevator from your own floor down. It's harder to find places around downstairs. 1st Fl might be a little big easier.", "title": "Too Big, Too Busy... Unpersonal", "helpfulness": 2, "user": "781elephant", "date": "December 16, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "rooms": 4.0, "location": 1.0}, "id": 22768567, "likes": {"liked": "— Rooms", "disliked": "— Service, Size, Quality of Food"}}, {"rating": 1.0, "title": "If hell exists, this is it", "text": "WARNING for those who have less than 18 y/o kids, this hotel may drive you crazy. The casino part is located right at the middle of 1st Fl. That means with your kids with you, you cannot walk through the casino at all. That means when you want to go from West Lobby to Main Lobby, you have to walk up to the 3rd Fl, find a little passage to Main Lobby (yes, VERY LITTLE passage for a hotel that size) then up a small escalator and down once again on an elevator.", "helpfulness": 1, "user": "FullOfGoodIdeas", "date": "December 15, 2008", "id": 22758045}, {"rating": 4.0, "stay_parameters": "Stayed November 2008", "text": "The room was big for a normal size room. Mine was a Bella suite (they name all rooms \"suite\") with 2 queen-size beds. The room has a very big sofa, a dining table and two separate TVs. Trust me on this, this hotel is so big that they will never know how many people you can fit into this room. It's your call. You can book this room and fit a family of 4 in there. (My family, four of us, booked 2 of the Bella rooms and we found them way too much for us)", "title": "Impressive", "user": "MagicianManchesterUK", "date": "December 7, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 22518130, "likes": {"liked": "— room", "disliked": "— all good"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Mega-mall of a hotel, but it's well run. 24 hour service, plenty of staff and facilities. However, because of size this makes it rather touristy. Also, hotel allows smoking inside the premises which can get irritating after a while. Hotel design very similar to Las Vegas one and many options for dining. While one can't complain, one can't feel that it was a very original experience either!", "title": "decent but touristy", "user": "islandhopper67", "date": "July 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 115148995}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "i went with friends to enjoy and play casino. This hotel is massive hotel with 3000 rooms and several casino, restros shopping etc. Its like a mini city in itself. Loved this place , would like to go again.", "title": "awesome hotel", "user": "hotelguru11", "date": "July 7, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 115127494}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "the day i reached here gave me a mixed reaction.", "title": "good and bad", "helpfulness": 2, "user": "choudharykaushik", "date": "July 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115110066}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "The hotel provided a free shuttle service to drop us from Ferry terminal to hotel.Well here is my experience.", "title": "Very nice room in very busy hotel", "user": "Kengkla", "date": "July 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 3.0}, "id": 115082065}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "1)It was like a market in hotel premises and inside lobby full of tourist. Outside guest came to visit hotel(as there are other attractions excluding hotels) added to chaos and made us feel like we are in wrong place.", "title": "Marvellous Hotel", "helpfulness": 1, "user": "findnsecure", "date": "July 4, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 115033496}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "Back again at the Venetian and must say the condition after 2 years is still perfect.Large rooms with great ammenities and the bathroom is also very comfortable.Check in takes some time but not too bad, only negative thing is the huge distances you have to go before entering your room.But ok you don,t need work out anymore.All by all a great quality place , will return for sure", "title": "Still very good", "user": "catman52", "date": "July 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 114924464}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "It was my daughter's first international trip and her first Rakhi(festival in India) in this world.My husband planned for a hongkong n Macau trip.He had stayed in Venetian Macau before and he was so impressed that he wanted us to enjoy the luxury &", "title": "The Royal touch", "helpfulness": 2, "user": "shiprajain", "date": "June 30, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 3.0}, "id": 114892332}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "ambience too.We(me , my husband and our 2 kids) stayed there for 2 days, first day we just wandered around the property.Its very well maintained.Hotel is really very beautiful.Those paintings on cielings are just awesome.Its a huge place and you", "title": "It was the most pathetic place to live in..No Piece of Mind", "helpfulness": 4, "user": "ntrehan8", "date": "June 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 114878498}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "need a seperate complete day to just look around the whole hotel without indulging into activities.Reaching Venetian was easy as their own pick n drop coaches are available at ferry terminals and service is really good.We enjoyed Gondola ride within the hotel,the man who was rowing the Gondola was from Italy but knew many languages.A mix of male and female smart people were hired directly from Italy for the Gondola rides.They were also singing the \"Do re me\" song and setting the perfect mood for the ride.I am from India so was quite surprised when the man who was rowing our Gondola told us many things about India.I felt like at home.There are 3 canals where they have arranged this ride for guests.Then you can do lots of shopping there.Name the top brand and you will get it there.In the mall (shopping area) you can have really good cafe where you can have snacks n drinks at your service.There are 3000 suites (as I have heard) and our room was very spacious.The golden touch given to the room enhanced its royal look.Casino was just amazing it is the largest casino in the world.Venetian macau casino is modelled on Venetian Vegas so if you have missed it there then you can enjoy it in Macau.Its really huge and one can spend months there playing provided you r not short of money..:-).Then there is a show called \"Zaia\" its simply amazing actually beyond words.The areal acts were so beautiful and breath taking.No one should miss it during their visit.There are couple of things which I didn't like about this hotel....As soon as we reach the hotel we had to carry our luggage till reception on our own..may be that time lots of people were arriving but they have 15000 employees as per the information.So i felt a lack of service right at the beginning.Then when we entered the hotel it looked very crowded.I understand that its a huge hotel and everyone who can afford will stay there but still when you expect some luxury and royalty you expect somewhat less crowd.Rest of the stay was simply superb.We enjoyed family golf,swimming,gambling,accomodation,shopping, gondola ride ,zaia show under one roof and I must say it was worth visiting n spending our hard earned money.", "title": "We loved it but...", "user": "Jamey23", "date": "June 27, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 114813627}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The Moment me and my family entered the Lobby, We felt like we have came to a fish market. There were long queue for the check IN, People standing with truck loads of there luggage. After waiting for an hour in the queue and thereafter a 20 minute tussle with the receptionist, we finally got a room and were told that we shall be getting the rest of the three rooms after 2 hours (i.e. 4PM). I must agree the suites were awesome and were decorated, Just a small problem that there were no locks at the bathroom and the toilet.", "title": "Will come back as many times as possible.", "helpfulness": 2, "user": "CouiceFleming", "date": "June 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 114795375}, {"rating": 3.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "The Venetian Hotel is certainly the most impressive, over the top, hotel we have ever visited. They certainly spared no expense in fitting it out with marble, and gold accents throughout, and don't forget the artwork. The Royale Suite, where we stayed, certainly met our expectations. Sadly, the service we received, did not. The welcome on arrival was non existent, which for a purportedly 5 star establishment, was less than satisfactory. We ended up taking our own luggage to our room, which turned out to be a signficant distance from the Reception area, due to the massive size of this hotel. The pool unfortunately was closed due to the winter season. Internet access was available for a fee. The location is a fair distance from the town of Macau where the historic beauty lies. To get there, we took the complimentary bus from the hotel to the Macau Ferry stop, then took a bus to the town. The trip to the town is well worthwhile, as that is where the 'real Macau' is experienced. A trip to a little restaurant called Fernandos is well worth it as the food is fantastic - true Portuguese. It was the highlight of the trip.", "title": "Wow factor for sure, but service left wanting", "user": "Wunderlust2008", "date": "January 19, 2009", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 5.0}, "id": 23686921, "likes": {"liked": "— Great suite, very spacious and well appointed", "disliked": "— Poor welcome, and porter service. Internet access not for free"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008", "text": "I booked 2 nights in a Rialto suite and was initially apprehensive after reading all the negative reviews. So before I left I wrote and asked about how best to avoid long queues at check-in and getting a hotel transfer. To my surprise I was accorded VIP status and told to check in at the VIP lounge and they would pick me up at the airport gratis. Everything went smoothly on arrival and I must say that the service was excellent (as good as the Concierge service in Venezia Tower, Venetian LV if not better). A butler walked me to my suite and helped me with my light luggage. The suite was gynormous and I didn't find the hotel too big. I was able to use the VIP lounge often. Booked the hotel limo for a tour around the city and again it was great service. I am really sorry that not every guest had my experience.", "title": "Treated like a VIP", "user": "Cilla T", "date": "January 19, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 23685468, "likes": {"liked": "— The size of the suite.", "disliked": "— Having to go through the casino to get to my suite."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "Zaia was very enjoyable. I rate it as one of the better Cirque shows, better than Varekai and Dralion but perhaps just below O.", "title": "Great Location", "user": "busterandalfie", "date": "January 15, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 23580261, "likes": {"liked": "— Very beautiful rooms and great service", "disliked": "— The hotel is so huge, you need to walk quite a bit here."}}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "Enjoyed a lovely dinner at Canton, the upmarket Chinese restaurant on the lobby level.", "title": "So amazingly tacky, it's wonderful!", "user": "studiodekadent", "date": "January 9, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 2.0, "rooms": 4.0}, "id": 23394852, "likes": {"liked": "— Wide variety of activities, bars and restaurants. Tacky (in the good way) and spectacular decor/atmosphere. Great entertainment.", "disliked": "— Some quality inconsistencies. Overpriced casino."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "My only gripe is that it was by chance that I found out that I am a VIP! If I had not asked I would have missed out. The shopping at the Canal Shoppes was below expectations.", "title": "At the end of the day, It was a delightful experience", "user": "cendut", "date": "December 30, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 3.0}, "id": 23092106}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "This place brings a new meaning to the term ‘Venice of the East’ – if you’ve never been to Venice you’ll love this place! If you have been to Venice, you’ll notice a difference (e.g. no St. Mark’s Cathedral in St. Mark’s Square, it is outside), but you’ll still love it anyway! Larger than its Las Vegas counterpart, this hotel is a destination in itself – much better than the Wynn Macau and MGM Grand. There is something to actually do here apart from gambling! The shops are not 100% high range (there is your Bvlgari’s and Cartier’s, but there are also lower end stores like G2000 and a Manchester United Experience store), all along the 4 separate canals making it much more interesting!", "title": "Excellent!", "user": "pungpui", "date": "January 20, 2009", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 23722226, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "This is a new hotel on the recently developed Cotai Strip, close to the Macau Airport and the Taipa ferry terminal. They have free shuttles from the Airport/Taipa Ferry/Central Ferry terminals, so it doesn't matter where you land in Macau - there'll be a bus waiting to take you to the hotel.", "title": "Wonderful rooms, crowded, fake, opulent hotel", "user": "sankar", "date": "January 28, 2009", "detail_rating": {"cleanliness": 5.0, "front_desk": 3.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 23967525, "likes": {"liked": "— rooms", "disliked": "— reception, crowded common areas"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "The hotel is huge and impressive from the outside. It has two lobbies, and the coaches drop you at the West Lobby, which is too small for a hotel this size and was hence totally packed even on a weekday. The main lobby is a lot nicer, so it may be worthwhile taking a cab and arriving there instead!", "title": "Venetian Macau - an experience", "user": "fatnchoi", "date": "January 23, 2009", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 23816324, "likes": {"liked": "— Quality of room", "disliked": "— Maybe just too big and expensive"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "The common areas around the lobby resembled Tokyo station at rush hour, and you need to take a short walk to the elevators to the guest rooms. There's security at the elevator area to ensure that only room guest get to use the elevators, and hence it's a lot quieter once you get to that area.", "title": "The word breathtaking comes to mind.", "user": "s0664501", "date": "January 22, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 23797454}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "After jostling through all this madness and reaching your floor, you'll probably have a pretty long walk to your room, as there are 120 suites on each floor! But once you finally get to your room, i dare say you'll feel it's worth it. Even the base category suite we stayed in was large and opulent, very well-designed, and quite tastefully decorated in spite of all the gilding everywhere. Comfortable bed, sunken living room, large bathroom with twin vanities and separate shower, etc.", "title": "Perfect Venetian Experience!", "helpfulness": 2, "user": "Bruno139", "date": "January 22, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 23776802, "likes": {"liked": "— The suites!", "disliked": "— The buffets!"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Venetian Resort Macau, It's A Full City In Itself, Having The Biggest Casino In The World. We Feel Like As If We Are A King A Staying In A Big Palace.", "title": "IT'S LIKE A CITY IN ITSELF", "user": "Saurabh13280", "date": "July 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 115009705}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "I Found No Problems In Any Department Of The Resort. Even We Had Some Indian Vegetarian Dishes. I Feel If Anybody Is Going To Macau He Should Definitely Stay At Venetian Resort For Atleast 3 Nights.", "title": "It shouldn't be called the Venetian, but rather...", "helpfulness": 5, "user": "wrmsairtw", "date": "July 3, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 4.0, "value": 3.0, "service": 2.0}, "id": 114996693}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "..the brothel. I don't even know where to start with this place...", "title": "Most probably will not go back...", "helpfulness": 2, "user": "SorinMihaescu", "date": "July 3, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 2.0, "service": 3.0}, "id": 114980626}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "1. The place is crowded and loud. There are tour groups everywhere and extremely rude tourists. One actually got into an argument with a family member and had to be settled by management. I felt like I was in a marketplace with tons of people and their noise.", "title": "Huge and very Comfortable room", "helpfulness": 1, "user": "staruiz", "date": "July 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114977844}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "2. The smell of smoke is so acrid. Walking in the front door, you could already smell the smoke. We visited other properties and none had this problem. Probably could be attributed to the large size.", "title": "treats you like a queen", "user": "sheytusi", "date": "July 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114969631}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled solo", "text": "I stayed in this hotel for one night and I loved it. The suite that I stayed in was just simply amazing.", "title": "Loved it, but a bit impersonal.", "user": "Brightrob", "date": "January 30, 2009", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 3.0}, "id": 24041812, "likes": {"liked": "— Cirque du Soleil show", "disliked": "— Location."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "What a place to be...Venetian makes Macau complete! It has a touch of Las Vegas, Venice, New York, Iceland and off course India..you just fall in love the moment you entre the lobby. Great gambling area, spread emaculately! Rooms are just much more than the value you pay for...truely a royal treatement. Candola ride and the charming singer who rows it, make the 30-minutes ride memorable. Shops are expensive but thats what you expect at such a place! Very friendly and courteous staff all around!", "title": "Loose money but get delight", "user": "Shalabh222", "date": "June 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114767828}, {"rating": 5.0, "title": "Great hotel - lots of fun!", "text": "We booked this hotel based on reviews on trip advisor and recommendations from friends. This hotel is the biggest hotel that we have ever stayed in – its enormous! This hotel has thousands of suites, a shopping centre – two concert arenas & casino. This would be the Disney would Florida if we were comparing theme parks.", "user": "asdfgqwertyzxcvb", "date": "June 26, 2011", "id": 114751914}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "The casino is located at the ground floor of the hotel and has a variety of different gambling tables.", "title": "WISH TO STAY THERE ONCE AGAIN !!", "user": "GOEL96", "date": "June 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114699908}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Pro’s", "title": "Brilliant resort...", "user": "Sohit_P_Kapoor", "date": "June 24, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 114699131}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "• Free bus transfer from the ferry port & airport to the hotel & back", "title": "A PLACE NOT TO BE CALLED FAMILY ORIENTED", "user": "Shreym", "date": "June 23, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 114676682}, {"rating": 3.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "Ok, so we got off to a bad start by having to wait over half an hour for the shutttle bus to take us from the ferry to the hotel. When you are paying a decent amount for a room at a well appointed hotel these are things that just annoy one intensely. Unfortunately this was pretty much the case for the whole of our stay that there were long queues for the shuttle buses from the hotel into town also. There were even 10-15 minute waits for taxis!! Notwithstanding I suspect the buses have been bought on cost because it certainly felt like the suspension was missing a few stabalising pieces. Given the location of the hotel in the centre of a large construction site then the buses are a necessity to get anywhere.", "title": "This Place has no Soul", "user": "HKPlum_Bum", "date": "February 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 2.0, "service": 4.0, "rooms": 5.0}, "id": 25220271}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "The rooms themselves were excellent and cannot be faulted. We had a suite and the space was excellent as was room service.", "title": "The largest building in the world", "helpfulness": 2, "user": "Scott603", "date": "February 16, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 24649434, "likes": {"liked": "— Mind blowing canals / shopping areas, incredibly spacious luxurious room, tasty food", "disliked": "— Location of hotel, zeal at which children are prohibited from casino"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "The hotel facilities were very good with a wide choice of restaurants, however the \"shoppes\" under a false sky painted onto the ceiling was just a weird experience, very \"Brave New World\". After a couple of hours you are desperate to get outside again just to feel natural light on your skin.", "title": "Priviledges of the Rialto Suite!", "helpfulness": 4, "user": "JChua", "date": "February 8, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 24359872, "likes": {"liked": "— Great value and huge sized Rialto Suites.", "disliked": "— Swimming pool too far away, bed not as comfy."}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We do not gamble so never tried the casino but if that was all you want to do then there are many other choices in MAcau and from the inside don't they all look the same?", "title": "The experience was great, no personal service.", "user": "philaveller", "date": "February 2, 2009", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 24097992, "likes": {"liked": "— room", "disliked": "— check-in"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Anyway, in summary excellent rooms and facilities, scary indoor shops and restaurants, crap bus service.", "title": "How much more can a person admire?", "user": "aj_chopra", "date": "February 2, 2009", "detail_rating": {"front_desk": 3.0, "service": 5.0, "business": 3.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 24096342, "likes": {"liked": "— Each and Everything", "disliked": "— Rare vegetarian food options"}}], "location": {"country": "China", "continent": "Asia"}, "stars": 5, "variance": {"poor": 104, "average": 331, "very good": 1073, "terrible": 57, "excellent": 1836}, "aka": "Venetian Macao Hotel Macau", "slim_ranking": 0.182926829268, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.0}}