{"user_rating": 4.0, "review_count": 210, "name": "The Unicorn Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We enjoyed our stay here, with a friendly, helpful staff a cozy room and great in town location.", "title": "Friendly Staff and Cozy Room", "user": "NrsMary", "date": "September 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 44118708}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "As with other people who have reviewed this hotel, we were a bit dubious about booking it due to the comments on road noise, creaking floors and the need for a make-over. However, when booking the hotel with booking.com we requested a quiet room away from the road and kept our fingers crossed. We were not disappointed. We had a charming room (Room 19) tucked away at the end of a corridor, up quiet a few steps! but overlooking the garden area and Church. It wasn't the biggest room we have ever had, but it was in keeping with the hotel - and just what we'd hoped for. Reception check-in was welcoming and the lounge/bar/restaurant areas were lovely. We did not dine in the hotel in the evening (we chose to eat at the White Hart on the square - which was great), and got back to the hotel looking forward to a good night's sleep. This was not the case and was NO fault of the hotel. The church which is right next door to the hotel, rang it's bells every 15 minutes and continued right through the night. If it hadnt been for the church - we would have had a lovely/comfortable sleep. We haven't noticed any other reviews concerning the church noise and don't know whether this was a one-off, but it would make us think twice about staying here again. It ruined what would otherwise have been a lovely stay.", "title": "Typical Old English Charming Hotel - shame about Church next door!", "user": "JoGra", "date": "August 17, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 37957051}, {"rating": 4.0, "title": "would go back", "text": "went to this hotel for an overnight break thursday-friday and to be honest from the first to last impression can only speak well of this place the staff were welcoming and helpful both in all areas, we did eat in the bar at night and the food was nice but not if you are on a bugdet I had dover sole delicious and fresh but at £17 it was a treat my friend had the fillet steak and it did melt in the mouth £18.", "user": "jylittle", "date": "March 22, 2009", "id": 26593128}, {"rating": 3.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "A word of warning the room we stayed (rm 12) in must have been over the generator it did kick in about every 20mins throughout the night and was quite noisy I would ask for a different room if I went again .", "title": "Nice location but too noisy", "user": "maidmarianSurrey", "date": "March 5, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 25659394}, {"rating": 1.0, "stay_parameters": "Stayed January 2009", "text": "We spent 2 nights here in the 4 poster room. The room was a good size and the carpet was clearly new. Other areas of the room were a little shabby - the chairs were past their best but serviceable! The bed itself was very comfortable.", "title": "Forget the food", "helpfulness": 2, "user": "Richard065", "date": "January 19, 2009", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "rooms": 3.0, "location": 3.0}, "id": 23686845, "likes": {"liked": "— Staff were friendly and doing best", "disliked": "— Food was very poor"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "I booled this hotel for a long weekend break for my husband and I. We were in a \"superior room\" number 10 and we were very dissapointed as it was not what we expected. As mentioned in a previous review ( wish I had read it before I booked) the room was small, dark and there was a lot of noise and petrol and diesel fumes. If you had the window open it was unbearable as the room was facing right on to the main road and our window was just above the traffic lights so we had to keep the window closed all week-end which was not good as it was a hot sunny weekend when we stayed here. The breakfast was not as good as it could have been and certainly we have had better and paid a lot less for it. The best part of this hotel is the comfortable Lounge area but apart from that we were not very impressed and would not stay here again. The staff were very good and we could not really find fault but all I can say is look around more as there are better hotels for the money.", "title": "Dissapointing and overpriced", "user": "MiltonKeynesNanna", "date": "June 13, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 16890541, "likes": {"liked": "— comfortable lounge area", "disliked": "— traffic noise and fumes"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "My husband and I love stow on the wold, it is not too far to travel from home, yet you feel a million miles away from city hussle and bussle.", "title": "not so superior room after all", "user": "AngelaCoventry", "date": "May 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "rooms": 1.0, "location": 5.0}, "id": 16384369, "likes": {"liked": "— Service was prompt, polite and of a high standard", "disliked": "— The room and the quality and value for money....a disapointment over all."}}, {"rating": 1.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "I chose The Unicorn Hotel as a suprise birthday treat for my husband, thus choosing the more expensive superior room. From the website photo's it was perceived to expect a four poster bed for £295 for 2 nights.", "title": "Oh dear", "user": "CaptainKingdom", "date": "May 2, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 1.0}, "id": 15571207, "likes": {"liked": "— Easy to check out of!", "disliked": "— Too easy to check in!"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "On our arrival the staff were very welcoming and offered to carry our bags. No concerns with the attitude of the staff.", "title": "Expensive and Disappointing!", "user": "j_mids", "date": "April 15, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 15047119, "likes": {"liked": "— Location", "disliked": "— Mould and mildew in the rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We were shown to our 'superior room; no.10' and we instantly felt an overwhelming feeling of shear dissapiontment. The room was small and the bed was made up from 2 individulas and it rocked on one side when you sat on it. The bed spread was filthy with lots of stains on it, (we took it off straight away). The room was directly above the traffic lights and on the main road but the niose level was solved via the double window closure. There were no other rooms available for the stay so a move was out of the question.", "title": "Lovely hotel", "user": "JoJo50", "date": "October 2, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 10030476, "likes": {"liked": "— The Food!", "disliked": "— Size of room"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We had read mixed reviews of this hotel so didn't know what to expect. However, our experience was one of great enjoyment. We had a very pleasant room, which was a fair size given that the hotel is an old converted building, and the en suite bathroom looked as if it had been recently refitted.", "title": "Lovely hotel with friendly staff", "user": "london20000", "date": "August 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 3.0}, "id": 19149446, "likes": {"liked": "— Friendly hotel with old-world character", "disliked": "— Car parking"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "We stayed for two nights and on both evenings we dined in the hotel. Food could either be eaten in the restaurant, which has a very stark, modern appearance, or else in the adjoining bar which is less formal - the menu and prices are the same for both places. The first night we ate in the restaurant and the second in the bar. Both meals were extremely good for both of us. (Had we not enjoyed it on the first night we would have gone elsewhere for the second so eating there on both occasions is a testimony to the quality of the food.) Breakfast was served in the restaurant and a full English breakfast was quickly delivered and was very tasty.", "title": "The Nightmare at Christmas", "user": "TracyBrent", "date": "August 10, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 3.0, "value": 1.0, "location": 3.0, "service": 1.0}, "id": 18805446}, {"rating": 1.0, "title": "very poor service", "text": "The staff we encountered were all very helpful and friendly. A problem we had one evening when the power tripped out on some of our sockets was addressed by the girl on reception who promptly reset the circuit breakers.", "user": "grahama", "date": "August 3, 2008", "id": 18563059}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We found only two potential problems with this hotel. The first was that it is located at a busy junction, which is traffic-light controlled. Consequently, some people may find it noisy. Our room was overlooking one of the traffic lights and although we slept with both the window open and the secondary double glazing slid back, we were not disturbed and slept soundly. However, others who are more sensitive to noise might be troubled by the traffic.", "title": "Lovely", "user": "003333", "date": "July 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18163482, "likes": {"liked": "— staff", "disliked": "— busy road"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The second potential problem is parking. We were lucky each time to grab a space directly outside the hotel but these spaces are limited and most people have to park over the road in an overflow car park. Crossing the busy road with luggage would not be easy.", "title": "A mixed experience - very expensive", "helpfulness": 1, "user": "happytraveller27", "date": "July 21, 2008", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 18091546}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 15, "average": 27, "very good": 78, "terrible": 13, "excellent": 77}, "aka": "The Unicorn Hotel Stow-On-The-Wold, Cotswolds", "slim_ranking": 0.5, "description": "The Unicorn is a beautiful Grade II listed building, standing alongside the Fosse Way in Stow- on-the-Wold. Situated in the heart of the Cotswolds, England's largest designated area of outstanding natural beauty, the Unicorn has 20 rooms, each with their own individual style and character. A fine choice of imaginative food is also available from our Á la carte menu in the elegant surroundings of our Georgian Restaurant."}