{"user_rating": 5.0, "review_count": 1311, "name": "The Twenty One", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "Well what can we say but a huge thank you to Matt & Andy of the The Twenty One for making our weekend in Brighton so fantastic. Having never visited Brighton before this wonderful place to stay has certainly made us want to return.", "title": "Spotless, welcoming & fabulous attention to detail.", "user": "CarlaJayne1975", "date": "May 16, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 160919638}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "From the moment we arrived and were offered a glass of New Zealand Sauvignon Blanc, the wonderful selection of goodies for breakfast, the spotless bedroom equipped with everything you could possibly need and owners who made us feel so welcome. What a real gem of a B&B.", "title": "Excellent better than any 5 star hotel", "user": "Lucyp22", "date": "May 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160705351}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Be warned though that you will need to do a lot of walking to work off their wonderful Sussex Breakfasts!", "title": "Fantastic!!", "user": "Erin E", "date": "May 13, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 160588709}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "We will be back.", "title": "Friendly and welcoming", "user": "fi78fi", "date": "May 13, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 160521138}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "I stayed with my boyfriend at the Twentyone at the start of May and we could not fault the place. Excellent B&B! Service was outstanding, breakfast was perfect and the added little extras such as the iPad and treat tray in your room and pre-dinner wine really did make it memorable. Both Matt and Andy could not have been more helpful and given that this is their home they must work really hard to make each guests stay as comfortable as possible. I have to come to Brighton in June so I'll definitely be looking to stay there again.", "title": "Couldn't of asked for more :)", "user": "Joeyjoey24", "date": "May 10, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 160288436}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "Just back from a very busy 4 days in Brighton and I was so glad that I chose the 21. This is what other b and b's aspire to be. There really is nothing to not like about this place. It's spotlessly clean, tastefully decorated, tons of little extras that make this place very comfy, homely and the best. I was in the single room, which the owners affectionately called the Broom cupboard. Yes, it's small, but perfectly formed. And as it was only myself in the single room, how much room did I need? It was perfect for me. Rooms are well stocked with tasty treats too. The Tunnocks tea cake and earle grey tea was most welcome! I will most certainly be back, if not with my husband, certainly if I'm back for conference again. So please, anyone reading this review, leave May free so I can go again!", "title": "If Carlsberg made B and B's, they'd make this one!", "user": "andare", "date": "May 24, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 161666255}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "A somewhat belated review, but nonetheless Matt & Andy deserve the praise for a fantastic 50th birthday weekend that we spent with friends in March. We booked all of the rooms and from start to finish we were made to feel at home. The birthday boy had a box of chocs left in his room, but who needs chocs with a tea tray in each rooms that's laden with so many goodies! Not to mention the soft drinks, beer and wine that you can help yourself to before an evening out. Matt & Andy also helped with recommendations of where to go for a special birthday meal (The Chilli Pickle - fantastic!). Everything was perfect, as ever - from arrival to departure. We traditionally stay in room 8 - the top floor at the front of the house. It's a lovely large room (the bed is to die for!) with a compact shower room with everything you need (hairdryer, iron/ironing board, tea/coffee/kettle, bathrobes, iPad!). We wouldn't stay anywhere else in Brighton!", "title": "Excellent....as always", "user": "NickyW71", "date": "May 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161485431}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We stayed at The Twenty One while in Brighton to celebrate my partner's birthday and we can't thank Matt and Andy enough for helping to make this trip as amazing as it was! From taking the time to give us information on where to go and what to do in Brighton to the thoughtful chocolates waiting for us in our room for my partners birthday! The room was faultless and the breakfast was lovely. So many extra touches that made this trip and the B&B one we will never forget. We can't wait to come back and won't hesitate in choosing to stay here again. Could not recommend enough! Thank you to Matt and Andy again! Gemma and Laura x", "title": "Can't Wait To Stay Again!", "user": "GemLau", "date": "May 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 161156787}, {"rating": 5.0, "title": "Consistently good", "text": "This was our second stay at The Twenty One and we enjoyed our time there as much as our first visit. It's not often you find accommodation that delivers a high and consistent quality experience.", "user": "Andrew W", "date": "May 18, 2013", "id": 161072906}, {"rating": 5.0, "title": "Lovely!", "text": "Matt and Andy have created a very successful formula for a bed and breakfast ; clean rooms, fantastic breakfasts and genuine friendliness.", "user": "SpainAngie", "date": "May 18, 2013", "id": 161069632}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We spent three nights at Matt and Andy's superb Bed and Breakfast! We were made to feel at home but with a three-star service : top quality English breakfasts, complimentary snacks and beverages, spacious, spotless and very comfortable bedroom, lots of details that made a true difference such as bathrobes, slippers... Plus helpful advice on what to see and what to do in Brighton! And as we were in Brighton to celebrate our 20th wedding anniversary, Andy and Matt had thought of putting in our room, a box of chocolates and a very special card. All in all a wonderful stay!", "title": "Fantastic B&B!", "user": "Edouard_Myriam_G", "date": "May 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160265384}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "This is the second time I have stayed, and its easily the loveliest B&B I have ever stayed in anywhere in the UK. Located in a great part of town, near enough to the centre that you can get everywhere but far enough away so that you can also have some quiet time. Matt & Andy look after their guests very well, make everyone feel at home, you'll feel like you have made new friends by the time you have to leave.", "title": "Top Banana!", "user": "Jensbobs", "date": "May 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160260185}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "Loving the addition of ipads and the fresh rocky road in the rooms, which made us all very very happy, and a tad plumper! Breakfast as always was delish, locally sourced produce, prepared and cooked exactly as you want it. The rooms are well decorated and maintained and the lovely little extras they have thought of make all the difference - fluffy robes, mini fridges, TV/DVDs, iPads, rocky road and more yummy snacks than you can shake a stick at, plus a communal fridge full of goodies as well. Matt & Andy wont let you go hungry thats for sure!", "title": "Supercalifragilisticexpialidocious", "user": "JacquelineGBG", "date": "May 9, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 160205238}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We will be going back - no doubt about it! Thanks guys, we were sad to leave!", "title": "A Quality Stay", "user": "Dianne", "date": "May 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160104601}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "This is one of the best B&Bs I've ever stayed in. Matt and Andy are the perfect hosts and will help with anything you need, as well as both being simply lovely! The rooms are stylish and comfortable, with everything you need and so much more. I've stayed twice and they are consistent with their impeccable standards. They now have iPads in their rooms, they leave freshly made cakes in your room as well as an abundance of other amazing snacks and treats. Their bathroom products are lovely as are the thick cozy robes in each room. The breakfast is outstanding, as is the service. I can't fault the beautiful B&B Andy and Matt have established and I will certainly be returning soon!", "title": "Amazing!", "user": "MrsLA_10", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159973101}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "An excellent stay at this Brighton B&B. Andy and Matt are great hosts and cater to your needs. There are so many free snacks, sweets, drinks and a great breakfast every morning available to all guests.", "title": "Excellent B&B", "user": "SteveRay21", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 159894061}, {"rating": 5.0, "title": "Believe the good reviews!", "text": "The rooms are clean, tidy and decorated to a high standard and the overall feel of the place is very homely.", "user": "Sdhiggy", "date": "May 5, 2013", "id": 159708448}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "Matt & Andy", "title": "The best bed and breakfast ever.", "user": "geoffbirchenall1979", "date": "May 4, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 159592681}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "What more can we say. Many thanks for the wonderful welcome and the update on Brighton since we last visited about 4 years ago. Your investments in room 3 have made it even more of a joy to stay in and I can only assume the rest of 21 Charlotte street has been subject to your same brilliant make over - it really didn't need it either folks, these people know what they are doing! Don't worry either, getting out of the bath was a breeze!", "title": "Warm hosts, excellent service", "user": "Dhiviya X", "date": "May 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 159536626}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Looking forward to our next visit already, keep up the amazing work and very best wishes to you both.", "title": "FANTASTIC", "helpfulness": 1, "user": "dianeb234", "date": "April 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159135525}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 0, "average": 1, "very good": 25, "terrible": 1, "excellent": 1284}, "aka": "The Twenty One Hotel Brighton", "slim_ranking": 0.010101010101, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "description": "Welcome to The Twenty One, we hope you will enjoy the fact that our well-maintained period property is located in a quiet residential side street, yet right at the heart of the lively and cosmopolitan Kemp Town area of Brighton. We are a few steps from the seafront (our principal rooms have the benefit of side sea views) and within easy walking distance of all the major attractions. All rooms have brand new en-suite facilities."}