{"user_rating": 4.5, "review_count": 544, "name": "The Westin Austin at The Domain", "reviews": [{"rating": 5.0, "title": "Awesome!", "text": "This is the best hotel I have ever stayed at. It is beautiful, fresh, hip, clean, etc. Every employee I met was friendly and helpful. The food in the restaurant is great and the bar was always hopping. Across the street is a really nice outdoor mall and it is not far from Downtown Austin so it is in a very convenient location. I will stay at this Westin the next time I come to Austin.", "helpfulness": 1, "user": "ops79", "date": "September 26, 2010", "id": 81049870}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "Travel a lot on business and come to Austin frequently. Love this hotel and its location. Great stores, nice movie theater and lots of good restaurants are all within walking distance. The restaurant and bar area within the hotel are great too. Nice staff!", "title": "Love this hotel....Convenient, clean and comfortable", "helpfulness": 1, "user": "mkc1022", "date": "September 15, 2010", "detail_rating": {"cleanliness": 5.0, "service": 5.0}, "id": 79700533}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "Spent a week here for work purposes and was everything you would expect from a Westin. Quite a few shops and restaurants nearby, no parking charges and easy to get to the main roads of Austin. Like others have said this is not in downtown Austin but is a relatively easy 20ish minute drive when there was little traffic", "title": "Nice and convenient", "helpfulness": 2, "user": "spongejim", "date": "September 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 78905637}, {"rating": 1.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We live in Round Rock and wanted a hotel to stay at for our honeymoon. We enjoy the Domain area, so we decided to visit this hotel in order to see if it is where we would like to stay. So we walk up to the desk and we are the only ones there. After a brief wait, we actually had to ask her if she could help us. She said she waould get to us in a minute. So right off the bat we were wondering about the service, but we let it go. When we were finally helped, we asked if we could see a room so that we could decide if we wanted to stay here on our honeymoon night. She called a guy to show us a room, and it wasn't anything spectacular, but the hotel seemed nice enough and we wanted to eat in the domain, so we went ahead and booked a room. So fast forward to the night of our stay, we arrive in a tux and wedding gown, and the valet didn't offer to help us, or to help us with our luggage, we had to actually go park our car ourselves, and walk in carrying the luggage, right passed the valet who, once again, did not acknowledge us. We approached the check-in desk, and stood there - you guessed it - after a brief time of the girl moving from monitor to monitor without acknowledging us, we asked her if she could help us. Of course, it was going to be a minute. Apparently whatever these girls do, checking people in is not their first priority. So once we get checked in, she doesn't ask us if we need help with our bags, she tells us about what apparently is a selling point on the room, which was a floor to ceiing window. Hold the excitement - I will get to that in a bit. So we lug our luggage to our room - btw, pet and mildew smells - yep. They need to rethink their pet policy. Anyways, we get in to the room and it was just like we had seen on our previous visit. Really nothing special, i could doctor some photos up for you, but really, any La Quinta ar Holiday Inn Express room looks the same, save the floor to ceiling window. So the first thing we want to do is email our family and let them know we made it ... blah blah ... but we then find out that the internet is not free! The Westin - Domain - proclaimed stylish - hip - great customer service advertised - floor to ceiling windows - but you have to pay to use the internet - an additional $15 a day. So no internet for us because we are already being gouched for the price of these windows. So we requested a room with a view. Well, come to find out, the only views these rooms have is either of a power plant or of the parking lot facing the west sun, which in Texas is over 100 degrees in the afternoon. So there we are staring at our parked car from our hotel room with the sun pouring in. Let's close this nifty sunscreen visor they have conveniently on the window ... close close ... eerk - it stops about 3/4 of the way down. Apparently the visor is not made for the much anticipated floor to ceiling windows. So we still have sun pouring through the lower 1/4 of the window. So we decide to close the heavy curtain, which just made it dark in the room. So much for the windows and the view. So it is late in the day and we want to take a bath... no bath... shower and realx from the long day. Well, save your towels, because one of them is going on the floor because the shower doors leave about a 1/8\" gap all the war around them and the shower leaks all over the floor. After my 10 minute shower i had to get out bec my towel could not hold more water. Also, the bathroom door is so wide, that when you open it up you can barely close it unless you step up in the shower or on the sink and I am not a fat guy - ridiculous planning. Refrigerator is actually a cooler, so it is basically useless. We wanted to get a soda out of the vening machine - $2.50 for a can - they must think a lot of their cans. The machine would not accept our perfectly flat dollar. A staff person was walking by - maybe a cleaning person - and we were obviously having problems with the machine, but she did not offer to help. We never did get the soda, which is fine bec we save what was going to be $5.00 for two cans. So how about that wonderful quiet room ... well, the door to the rooms is very heavy and slams shut behing you ... which is fine for us, but we could hear when anybody within a four room radius was leaving their rooms as well. The ac/heater unit tries to keep the room at a steady temp, so it would click on for 20 sec, then click off for 40 sec, on for 20, you get the idea - all night long. There was no option to turn just the fan on in order to cover up some of the noise it made when it went on and off. When we were checking out we had immediatley remembered that we had left a shirt on the back of the door, so we immediatley asked the girl if we could run up and get it. Well, since we had technically handed her our keys, she would have to send somebody up there without us to retrieve our item. Good thing we knew where it was ... guess she though we might steal one of their Starbucks coffee packets or something. So my wife fills out a survey on this place and gets contacted from a guy the next day. Instead of being apologetic of any of these things, everything he said was in defense of their crappy service. So we were starting to get annoyed further from this place and now this call (will the hotel memory ever die?!) and he offers us a free night, here at this hotel. We laughed and told him he could keep his free night. We didn't need the aggravation. He eneded up refunding us half the price of our hotel room. My recommendation, seriously, if you like this place, then you don't get out much. This is Austin and there a lot more hotel choices for you to choose from. This place was not worth half of what they charged us. The restaurant? I don't know, didnt eat there .. the bed? Yeah it was soft, but shouldn't it be? But what about the golf cart that drove you to the shopping .. are you serious? The shopping is a block away ... and I only saw one golf cart, so either walk a block or stand on the treeless parking lot in the sun and wait your turn. Ugh. Who needs that. No express checkout. This hotel tries to grab you with its location and plush lobby, but enjoy that part of it because it only goes downhill from there.", "title": "Total disappointment ; the good thing is we don't have to ever come back", "helpfulness": 6, "user": "carnold2", "date": "September 3, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 78128537}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We stayed here to celebrate our 19th wedding anniversary on 8/20/10 following some partying in Austin and because it's a new Westin and a very quite area. Parking spaces are very small; good quick check in; room was a king as requested with direct view of the Domain shops. Would have liked a suite since we were celebrating our wedding anniversary. Very clean room with good a/c, bed is excellent (it is a new hotel) but water will leak out of the all glass shower, (they need to fix that. feel sorry for the maids) the shower is really good size and good water pressure. no extra pillows and only one shower robe. We did not smell any odors as other reviewers have stated. Breakfast next morning was included in the rate plan an it was good. The Urban has a la carte and buffet for bfast. We opted for the buffet and it was quite good especially liked the OJ and the Coffee. Buffet consist of eggs, fruit, cereal, sausage, bacon oatmeal, etc. Very nice stay and would very much would consider returning.", "title": "Comfortable", "helpfulness": 1, "user": "cfsnco", "date": "August 22, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 76355881}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Nice hotel, except in the execution. The Domain is a good place to eat and shop. Isolated from the rest of Austin, though, and not at all typical of a fun, quirky town. Back to the hotel. Our room was damp. Really damp, and smelled of mildew. Even the carpet was damp. Not a good sign for a six month old hotel. Perhaps our experience was unusual. Seems very odd for a brand new hotel to be having this kind of problem on its \"preferred guest floor\". The staff was nice, and efficient. The restaurant and bar scene were completely dead. But, it is a business hotel and this was Friday night. There are things going on at the Domain shops and restaurants right down the street.", "title": "Dampness and Mildew Issues", "helpfulness": 1, "user": "jeff3545", "date": "July 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 2.0}, "id": 70543379}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "The hotel is stylish, the rooms are standard Westin size. The pool is nice but has a view of electrical towers. The hotel is close to lots of shopping and dining. It is about 20 min away from downtown Austin but close to where we were going. Service was usually good but we had a few waits for some requests. Overall a fine place to stay.", "title": "Brand new and pleasant", "helpfulness": 1, "user": "reallypickylady", "date": "June 29, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 69084199}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "If you're like me and travel a lot, I have to tell you these guys have the hotel room comfort down to the science.", "title": "The most comfortable restful hotel room in quite a while", "helpfulness": 1, "user": "AryanaToronto", "date": "June 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 67310813}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "The bed, pillows, duvet, mattress are truly heavenly..over and above comfortable.", "title": "Very pretty hotel...great addition to the Domain", "helpfulness": 1, "user": "BlissGirl1", "date": "June 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 66632482}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "The towels are plush, new, super white and soft.", "title": "Best Hotel Ever!!!", "helpfulness": 1, "user": "VirgoGirl333", "date": "June 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66446293}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We arrived in Austin planning to stay a couple of days and then drive on to San Antonio, but we loved Austin and this hotel so much we spent the rest of our trip here.", "title": "booked for two days - stayed for six!", "helpfulness": 1, "user": "Citydweller2", "date": "February 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97473624}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "In our opinion this hotel was just perfect and we will definitely stay here again when visiting Austin. There have been a number of comments about the sound of room doors slamming but we didn't hear them at all - not even once in six days. Best of all the service was excellent - we felt that our custom really was valued and that the employees genuinely cared about creating the best experience possible.", "title": "I loved every single thing about this hotel.", "helpfulness": 1, "user": "Talhas001", "date": "January 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94485362}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The Domain itself is a good place to stay, lots of shopping and dining options right on your doorstep. It's not beautiful (so don't expect great views!!).", "title": "Great for shoppers but less great if you want a long hot soak or have allergies", "helpfulness": 1, "user": "CultureTraveller13", "date": "December 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 88790342}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We'll be back!", "title": "Enjoyable Stay", "helpfulness": 1, "user": "tomatovine", "date": "October 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 84803830}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "I am in the hotel industry and I like to critique a hotel when I stay in one. Recently I had the chance to go stay at this hotel with some friends. When we arrived there, I was amused by the location of the hotel. Following that was a hip yet relaxing check in reception. I was checked in by Chris, I must tell you this guy knows what he is doing. The entire check in experience made the first impression of this hotel A+. We enjoyed our stay, loved the decor and had lots of fun.", "title": "Woof, Woof, Woof....dogs?!?!", "helpfulness": 3, "user": "SATgirlie", "date": "October 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 83843615}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "i go to Austin several times a quarter for business & always stay here. It is a wonderful hotel with a great staff and excellent location. Beds are great - rooms spacious - restaurant excellent. Glad we have this option as a place to stay for business. Nice to be able to get over to the Domain for a quick diversion.", "title": "Always a great place", "helpfulness": 1, "user": "SherriB1050", "date": "August 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75696914}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "I just stayed at the Westin Austin and had a wonderful time. From check-in to check-out the staff was amazing. The rooms and all the facilities were immaculate. Here's a little overview:", "title": "Highly Recommend!", "helpfulness": 1, "user": "AVargas3", "date": "August 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75096419}, {"rating": 5.0, "title": "AWESOME!", "text": "The lobby has an open plan with the check-in desk surrounded by a lot of comfy seating areas, a bar and access to Urban, their restaurant. This made it a perfect place to meet people. You can order food from Urban to the bar while you're having cocktails. We sat at the bar and talked with the bartenders for a bit. They're very familiar with the menu at Urban and made great recommendations...we ended up ordering some food to the bar!", "helpfulness": 1, "user": "MattAllard", "date": "August 9, 2010", "id": 74479332}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "Urban is a great restaurant. We were there for a couple days and ate there 3 times. One morning, we arrived after they stopped serving breakfast but they still allowed us breakfast....it was awesome! I especially love the way their kitchen is setup. You can see the cooks preparing your food, and they're all really nice...greeting customers as they walk in and out. A nice touch that you don't typically see at a hotel restaurant :)", "title": "Will Be Back", "helpfulness": 1, "user": "Seat28B", "date": "July 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 72830142}, {"rating": 2.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "The rooms were very nice and clean and the bed was really comfortable (makes it easier to be away from home). One thing that I especially liked is that they have a \"Green Stay\" program, but they actually reward you with it by giving you a $5 credit at the hotel!! This is really the way it should be at all hotels! Wifi works great throughout the building and I didn't have any issues with coverage.", "title": "Nice hotel, smelled bad.", "helpfulness": 1, "user": "cachaha", "date": "July 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72130554}], "location": {"country": "United States", "city": "Austin"}, "stars": 4, "variance": {"poor": 5, "average": 35, "very good": 160, "terrible": 8, "excellent": 336}, "aka": "The Westin Austin At The Domain Hotel", "slim_ranking": 0.060773480663, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "The Westin Austin at The Domain is located in the heart of The Domain, one of the premier locations in North Austin, featuring upscale shopping, dining, and entertainment. Downtown Austin is also just 15 minutes away, where travelers love the excitement of 6th Street where you can explore the best live music, great restaurants, and sophisticated shopping. This hotel also boasts a wide range of amenities inlcuding Spa Réveil, a resort-style Outdoor Pool, and a state-of-the-art fitness center. Guest rooms are highlighted by luxury bedding, large LCD TVs, and select rooms with stunning Austin views. The Westin at the Domain offers a premier location with luxurious amenities making it one of the best Austin, TX hotels."}