{"user_rating": 4.5, "review_count": 141, "name": "The Golden Hotel, an Ascend Collection hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "Not much can be said that hasn't been said already. My 2nd floor room was very clean and very comfortable. Sound-proofed windows opened with a view of the river. It's on the main road so there is some truck traffic. Lots of nice touches for the rate (bottled water, night light, robes) and staff was efficient and friendly. If you're bothered by foot traffic above your head, insist on a top floor room. The restaurant served a fast and fine breakfast. All in all - very nice for a Clarion and a pleasant place to stay in Golden.", "title": "The reviews are accurate", "user": "BeachChair", "date": "March 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6936627}, {"rating": 5.0, "title": "Great find!", "text": "On our 2 month trip to the United States I can truly say this was the best hotel we stayed in. We are a family of 6 and how refreshing it was not to have have interconnecting rooms and also not to be looked at funny when requiring bedding for 6. I booked this hotel sight unseen by phone in Australia prior to leaving as we spent Xmas Eve and Christmas Day there. Firstly we arrived earlier than check in time: \"No problem go straight to your room Sir\". Room was clean and extremely large. Hotel was well presented the staff could not do enough for you. Xmas day the restuarant was closed but the hotel had complemantary muffins, coffee, juice etc. Free internet access, for us to speak to relatives at home on Xmas day. Great location in the middle of town close to shops, restuarants and the Coor's brewery. The best thing about this hotel was it was also really cheap.", "helpfulness": 1, "user": "mrdigby", "date": "February 1, 2007", "id": 6726390}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "I was in Golden the week of OCT.7th thru. the 10th. I have never stayed here before, so when I saw the dark colored awning in the front with the words \"GOLDEN HOTEL\" printed on it, I was sure this was going to be a nice hotel, but nothing extra ordinary. Well was I surprised! The whole feel of the hotel is very welcoming,the staff treated me like I owned the place. Everything inside looked new and clean,as if I were the first guest after the grand opening. Now for more good stuff...all of the amenities, like tissue,shampoo,soap,coffee,etc. were all first rate brand name items. My computer worked the first try on the high speed service in my room. I played my iPod thru my radio CD player in my room, I had a real big china coffee mug, my windows opened, my view of the river was wonderful, I could go on and on,but I think the only way you can get the feel of this fine hotel, is to make sure you stay here if you ever go to Golden CO. Oh yeah,I almost forgot, you can bring your pet cat or dog with you, as they are pet friendly.I travel a lot every year,And I have stayed in some really nice,and some really bad places,but the golden has that certain something that makes you want to come back,again,and again. Thank you very much.", "title": "Simply the best!", "helpfulness": 1, "user": "Mr.Datsun", "date": "November 16, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6138217, "likes": {"liked": "— Felt like home. It was very relaxing.", "disliked": "— Plan to stay longer, this hotel and location should not be rushed."}}, {"rating": 5.0, "title": "Best Place to Stay ever", "text": "We've always been partial to this hotel. It treated us so well last year when my husband was hurt in a biking accident. They went above and beyond to make his recovery as pleasant as possible, giving us an extra frig; bought us a microwave to fix his blended foods; and gave us a suite for the price of a regular room. This year, I asked Crystal for directions to the Dinosaur Ridge Visitors Center near Morrison and the directions were perfect! I had no trouble getting there at all. Go to this hotel. You will love it. The Grill there is also terrific - wonderful food. Especially the fried green tomatoes! Diane Zollars", "helpfulness": 3, "user": "A TripAdvisor user", "date": "July 18, 2006", "id": 5480628}, {"rating": 5.0, "title": "A Paridise Within The Mountains", "text": "The Golden Hotel is a place were you can sit and relax to a summers evening, while watching the firework. I stayed at the Golden Hotel on July 4th, and I had one of the most enjoyable days and evening that I could ever imagine. From the moment I walk it the hotel I was greeted by Daniel, the banquet manager, and was offered help with my bags, and then he then suggested a lovely brunch in the hotels Bridgewater Grill. There I recieved top notch service, as well as tasty, hot, and fresh food in under 15 minutes. Not, to mention the beautiful rooms, were Eugene assisted me in ever aspect, with curtious check-in, to a check up on my room. The bed were so soft that I passed out instantly only to wake up to the fireworks off the mountians. I would recommend every aspect of this hotel to anyone, and a must see!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "July 5, 2006", "id": 5430987}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled on business", "text": "A couple months ago I stayed at the Boulder Quality Inn and Suites, and the owner there suggested that we visit their hotel in Golden. When I finally had a reason to come back to Colorado, I remembered the Golden Hotel. It wasn't quite what I expected -- it was more like a downtown resort than a hotel! The rooms are beautiful and astonishingly nice for how much I paid, the view of the creek outside was relaxing (and the creek was a great place to walk my beagle), and the in-hotel restaurant was delicious. I would definitely stay there again, especially if I can get that room with the creek view again.", "title": "Another great stay", "helpfulness": 1, "user": "mjlewis", "date": "July 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5426121}, {"rating": 5.0, "title": "Excellent Hotel", "text": "Excellent quality for the location and the price. I am a frequent business traveler and The Golden Hotel staff were friendly and efficient.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "May 12, 2006", "id": 5057513}, {"rating": 4.0, "title": "Really enjoyed my stay", "text": "I stayed at the Golden Hotel for a business trip and thought it was a great value for what they offer. I think what a previous reviewer wrote about the attention to detail is very true. A nice bathroom right off of the fitness center so you don't have to go back to yor room, free bottled water in the rooms (not $5!!), chocolate brown microsuede duvet covers, free high speed internet access in the room, an MP3 player hook up on the clock radio, and a fireplace in a cozy lobby with leather furniture for lounging. Staff are very nice and hospitable. One of the managers even asked me as I was leaving the fitness center if I was enjoying my stay and if there was anything I needed. And the hotel is in an excellent location, right in historic downtown. I don't think that the hotel should be dinged entirely for a poor restaurant (see two reviews ago). I had an omlette at breakfast and thought it was fine. But I also tend to avoid hotel restaurants like the plague, unless it's one that has a particularly stellar reputation. Try the Table Mountain Inn down the street.", "helpfulness": 3, "user": "reyorrenee", "date": "May 5, 2006", "id": 5034908}, {"rating": 5.0, "title": "Lots of attention to details.", "text": "We had a delightful Valentine's day stay at the Golden Hotel. Our 2 dogs were welcomed with treats and bandanas. The second story rooms make it really easy to slip out and walk them along Clear Creek, right next door to the hotel. We took a delightful walk along the creek; had a tasty dinner; slept in a wonderful bed with a fluffy comforter; and had breakfast in the room with FAST room service. The staff work hard to catch all those small details that make traveling easier and more pleasant.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "April 19, 2006", "id": 4989135}, {"rating": 5.0, "title": "Felt Like Home", "text": "My Husband and absolutely love this hotel. We travel the country extensively and frankly have a hard time finding a hotel that is as nice as the home we are leaving behind. That is why we love the Golden Hotel so much. From the moment we first walked into the Golden we were impressed and it only got better from there. Our room was beautiful, the setting was breath-taking and the staff was absolutely top notch. I have never written review of any hotel we have ever stayed in but felt compelled to write about the Golden since it was such an extrodinary hotel. We have been back several times and look forward to our next visit.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "March 12, 2006", "id": 4601065}, {"rating": 4.0, "title": "Great Value", "text": "Always good service, but great improvements in room decor and comfort. Nice blend of modern comfort and olde west atmosphere. Bar is good, restaurant getting better. For the price, a great value.", "user": "A TripAdvisor user", "date": "January 22, 2006", "id": 4368871}, {"rating": 4.0, "title": "The Perfect Getaway!", "text": "We booked a suite for two nights just after Christmas for our first \"getaway\" without the kids...and this room was PERFECT! Romantic fireplace, great seating, small fridge and sink (for Champagne!), giant jetted tub and a HUGE bed...not to mention a lovely view of the creek and the mountains. This room was the perfect getaway for two exhausted parents...and now we can't wait to go back! See you next year :-)", "helpfulness": 3, "user": "A TripAdvisor user", "date": "January 3, 2006", "id": 4320191}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "We stayed at the Golden Hotel on our trip to the Denver area at the end of August. The hotel was great. Perfect location for nearly everything in Golden. The room was very quiet, clean, comfortable, and offered a very nice view of the creek and the mountains. The staff was helpful and courteous. We only wish we would have stayed more than one night. While you're there make sure to visit the Old Capital Grill - Great Food.", "title": "Great Hotel - Can't wait to go back", "helpfulness": 3, "user": "vermagnuson", "date": "September 3, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3839915}, {"rating": 4.0, "stay_parameters": "Stayed February 2005, traveled on business", "text": "We stayed at the Golden while visiting the CSM. It was great. Friendly staff, computer with internet in lobby for guests, internet in rooms, free morning paper, rooms are very clean and nicely decorated. The hotel is within walking distance of antique shops, and you must visit the General Store for shopping. The restuarant is very good and rated very highly, worth the price at dinner, and reasonable for breakfast. There is underground parking (just in case it snows) and another lot on the side of the hotel. We attended a reception catered by the hotel and the food was excellent. The lobby is nice with a comfy sofa and fireplace. We stayed 5 nights and we really enjoyed it.", "title": "Great hotel, convenient location", "helpfulness": 4, "user": "QueenieWashington_DC", "date": "August 21, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 3794934}], "location": {"country": "United States", "city": "Golden"}, "stars": 3, "variance": {"poor": 3, "average": 9, "very good": 30, "terrible": 0, "excellent": 99}, "aka": "Golden Hotel", "slim_ranking": 0.125, "description": "The award-winning Golden Hotel is located in the heart of historic downtown Golden overlooking the foothills of the Rocky Mountains. Featuring over 6,500 square feet of meeting and event space, an in-house restaurant and lounge with creekside dining, this solar powered hotel offers guest amenities such as five star bedding and plush robes, flat panel televisions with HD programing and complimentary high speed internet access. 12 miles west of Denver."}