{"user_rating": 5.0, "review_count": 198, "name": "The Flying Pancake B&B Amsterdam", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "My husband and I stayed in the Cooks Suite of the Flying Pancake for a long weekend from 22nd August until 25th August. We had a fabulous time.", "title": "Excellent home from home in Amsterdam", "helpfulness": 3, "user": "Helen&John-Liverpool", "date": "August 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19385703, "likes": {"liked": "— Cleanliness and comfort, along with complimentary laptop with free internet usage!", "disliked": "— Nothing at all."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Claudia greeted us on arrival, showed us around the suite and handed over our keys. We didn't see her again until we were going home and this was perfect for us. We prefer to feel that we are living in a place, rather than constantly bumping into the owner every five minutes. At the Flying Pancake you have a separate front door and key, so you don't feel that you are getting in anyone's way.", "title": "Just perfect!", "helpfulness": 2, "user": "Naskali", "date": "August 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18973042, "likes": {"liked": "— Cleanliness, Claudia, space in the room"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "The room was very comfortable and the attention to detail was appreciated. We spent time in the steam room each morning before cooling down with a nice shower. There was a coffee machine in the room, a dishwasher, some complimentary spirits, Bang and Olfusen CD player along with a good selection of CD's, Ipod docking station, TV and DVD player and loads of DVD's to choose from. The couch was comfortable, the fireplace was lovely, and the fresh flowers were a lovely touch.", "title": "Absolutely Superb B&B!", "helpfulness": 3, "user": "sosmond", "date": "July 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18187197, "likes": {"liked": "— It was within a short walking distance to everything and only 2 blocks from the Amstel River", "disliked": "— Like all houses in Amsterdam, lugging my luggage up the stairs"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The bedroom was my favourite thing. It is literally in the eaves of the house, and it was one of the nicest places that I have ever laid my head. It was so relaxing. The bed is comfortable, but the actual 'space' was the thing that I loved. It was so cozy and welcoming. I know it sounds corny, but I really felt at peace there. It was a lovely place to fall asleep and wake up in.", "title": "Lovely", "helpfulness": 3, "user": "LESTrips", "date": "July 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17419870, "likes": {"liked": "— The design"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "Breakfast was a nice touch. It was served at 8.30 a.m. each day. This was a bit earlier than we would normally like, especially after a few drinks the night before, but Claudia has young children and is obviously very busy, so this was not really a problem for us. Put it this way, it got us out of bed each morning and we ate every scrap! It was nicely presented and left outside our door each morning in a cute little basket.", "title": "We were not very pleased with the experience.", "helpfulness": 5, "user": "rockwall-lady", "date": "April 25, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 15364665}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "I was having a terrible day of travel as I arrived in Amsterdam, but the Flying Pancake made it all better. Claudia, the owner, was gone on holiday but she chose a perfect person to fill in for her. Jarwo Gibson is a nice young man who was eager to help us weary travellers get settled in and get us out into Amsterdam to enjoy the city.", "title": "More of an Apartment than a B&B, in a Good Way", "helpfulness": 2, "user": "jimdrw", "date": "July 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35839316}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Jarwo fixed the internet, brought us a snack, loaned us a laptop, gave us restaurant tips, pointed us in the right direction to the bike rental shop, and brings us the best breakfast everyday. He completely changed my opinion of this city is about 5 minutes. I had a bad 1st experience, but Jarwo made it all better.", "title": "Fantastic and Memorable. We will never forget our stay.", "helpfulness": 1, "user": "angelchaos", "date": "June 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33505228}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "I hope Claudia reads this review and rewards him, he truly does deserve it.", "title": "Like a local living in luxury!", "helpfulness": 1, "user": "grayson08", "date": "June 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32604896}, {"rating": 5.0, "title": "If only there's a \"Flying Pancake\" in all the cities I go to!", "text": "Onto the suite, it is actually an apartment. The neighborhood is quiet and 10 minutes to everything via bike. The iPod dock, DVDs, and coffee maker are great. Being able to open the windows and having no street noise seems like a rarity here. This city really bustles.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "May 3, 2009", "id": 29231271}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "I arranged a trip to Amsterdam as a surprise for my partner's birthday, and had heard lots of good things about \"The Flying Pancake\". Luckily the week I wanted was free, and we stayed in the captain suite. From the moment we arrived Claudia was the perfect host, we felt welcome as though we were friends of the family. The suite itself has been wonderfully decorated, it basically covers the whole floor of the house and has it's own entrance via the street.", "title": "5 star", "helpfulness": 1, "user": "madrid_traveller09", "date": "March 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26258247}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "Imagine the space and amenities of the best of corporate hotels(steam shower, IPod+Loudspeakers, Bang&Olufsen Stereo/TV, remote light control), pair it with the style of a design hotel (colour scheme, bisazza tiles, stone wash basins...) and add the incredible friendlyness and care of a perfect private hostess - that is the Flying Pancake and Claudia. I stayed in the Cook suite, enjoyed my stay tremendously and will never ever choose another place on Amsterdam to stay.", "title": "Bliss!", "helpfulness": 3, "user": "ArteGentileschi", "date": "April 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15296859, "likes": {"liked": "— Allem! Everything! Tout!"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "PS: For the wary business travellers, who are sooo done with corporate chill as I am: Claudia even arranged for a meeting room in the private part of the house, served coffee, tea and cake and we had the most productive atmosphere and accomplished all tasks in time.", "title": "Fireplace and cognac", "helpfulness": 2, "user": "Jehinger", "date": "April 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15252513}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "A very good place to stay. Really excellent value for money. When I was searching for a place to stay, I browsed through numerous hotels, each and everyone of them far more expensive than this wonderful retreat and not offering half of the services you can get at the flying pancake.", "title": "Immaculate Retreat", "helpfulness": 2, "user": "happymama123", "date": "April 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15104209, "likes": {"liked": "— all that space :)", "disliked": "— a strong enough wi-fi signal was difficult to get at times"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Fireplace, big comfortable bed, Bang Olufsen TV and Hi-Fi set, ample space, free cognac, whisky and so on, perfect breakfast, excellent location (central but not noisy) and a very nice ambience. Everything you could ask for. Excellent value for the 145 E per night.", "title": "Great BB, well appointed, good value", "helpfulness": 2, "user": "rbosl", "date": "March 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 14516160, "likes": {"liked": "— Quality price and value"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "My husband and I stayed at the Flying Pancake in April 2008. We stayed in the Captain's Suite and had a wonderful time. Claudia was more than helpful and booking the room through her was very easy and convenient.", "title": "Superb B&B with character", "helpfulness": 1, "user": "Ian P", "date": "March 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14321470, "likes": {"liked": "— Interior", "disliked": "— Steep stairs"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "A perfect haven of calm, quiet, comfort and style. Claudia was an extremely kind, accommodating hostess. Loved the shower/bathroom and fresh flowers. Our suite was simply perfect for our 3-day stay... a little piece of affordable luxury. Definitely do not miss the Indonesian restaurant that Claudia recommends.", "title": "Wonderful", "helpfulness": 1, "user": "cinqetoiles", "date": "March 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 26077775}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled solo", "text": "The Flying Pancake's fireplaces attracted me for a cold January visit and Claudia's genuine warm welcome & helpfulness, fresh breakfast baskets didn't disappoint. Unfortunately, I arrived with a traveler's upset stomach, and Claudia offered some very helpful remedies that had me feeling better very quickly. I took advantage of the excellent location, 1+1/2 blocks, to the Carre Opera House and snagged last min. seats to sold-out \"Le Mis\" ! The grocery and tram stop are nearby, plenty restaurants, with the Artis Zoo and Botanical Garden just few blocks away . I found the apartment cozy and bright, and LOVED the decadent spa/steam-room shower and comfortable, restful bedding. The stairs can be a consideration, especially to the top sleeping loft. There was surprisingly good wine & beer available, other drinks, gourmet Illy espresso/capuccino maker, fridge, microwave, dishwasher, lite dining supplies, etc. Claudia obviously puts a great deal of care into her innkeeping reputation and it shows. I never felt neglected, always pampered, (even when personal tragedy, death of Claudia's father, suddenly and sadly occurred during my stay). Both units have the same features with the loft sleeping area at the top being the only significant difference. I enjoyed the privacy and convenient features of an apartment with the luxury of a breakfast basket full of fresh goodies left at the doorstep to enjoy whenever I decide to wake up. Bliss. IMHO. --Sandy", "title": "The Flying Pancake's Real Fireplaces Add To The Relaxed Cozy Stay", "helpfulness": 3, "user": "SandyHibiscus", "date": "January 23, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 23834602, "likes": {"liked": "— comfort and amenities", "disliked": "— the ubiquitous stairs"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "For the third time (unfortunately the rooms where both booked last year) I stayed for a business trip in The Flying Pancake and for the third time I was happy ;-). I really recommend this place for short and long stay because at the TFP you will feel like home...", "title": "3rd time visit and happy again!", "helpfulness": 1, "user": "Twinkle_Babyshop", "date": "January 16, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23598025, "likes": {"liked": "— Locations, good value for money, steam shower"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The only thing I miss a a good make up mirror ;-)", "title": "A Dream, Nothing but a Dream...So thank you GOD.", "helpfulness": 1, "user": "Itziadelga", "date": "January 7, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23349030, "likes": {"liked": "— Claudia, Fire place and steam shower", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "My fiancé and I had the pleasure of staying at the flying pancake. We found this truly amazing place looking for a fire place and steam shower. They offer both service and they offer it in a unique and charming atmosphere. Set in a wonderful Dutch house,the two magnificent suites are simply superbe. It feels like a five(5) Star Suite. I can Garantee that their is no better deal in Amsterdam. I can vouch for that because we had to look for other rooms since the Flying pancake was booked on the weekends. We stayed almost 3 weeks at the Flying Pancake and had to leave on the weekends. Waking up in the morning or sometime early afternoon and having our breakfast waiting by the door was heaven. I cannot forget to mention Caludia and her lovely Family who with their Grace and Kindness made our stay even more enjoyable. It was like Magic, like a honeymoon.....The Flying Pancake is truly the best place I've ever stayed in. Thank you Claudia.......Itzia.D.Aubut (Montreal Canada.)", "title": "Lovely Bed and Breakfast in Amsterdam", "helpfulness": 3, "user": "Scoobs83", "date": "December 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 23054208}], "location": {"country": "The Netherlands", "continent": "Europe", "city": "Amsterdam"}, "variance": {"poor": 3, "average": 3, "very good": 15, "terrible": 0, "excellent": 177}, "slim_ranking": 0.143369175627, "description": "For those who seek unlimited leisure or business in balance. Consider yourself found at The Flying Pancake B&B Amsterdam. We offer you the choice of two spacious suites: B&B the Business Class Way, in a monumental house from 1730 in the city centre of Amsterdam. At The Flying Pancake we have a bit of a legacy to live up to. It is not enough that you enjoy your stay with us. Our goal is to have you thinking more along the lines of \"I wish I could stay longer\"..."}