{"user_rating": 5.0, "review_count": 96, "name": "The Guest Room", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "My husband and I have stayed at the Guest Room twice, once in ~2005 and again this month (May 2010). This time we were in the upstairs double-room. The rooms are lovely, with fresh and homely decor and very clean. The bed was comfortable and we slept well all three nights. Katrina and Fergus are very welcoming and superb hosts. Breakfast is brought to you on a tray so you can enjoy it in peace and at your leisure. The Guest Room is a pleasant wander (or very short taxi ride) from the centre of Edinburgh and we enjoyed the walk back to the room each evening. We couldn't recommend them more highly and will hopefully stay with them again next time we are in Edinburgh.", "title": "We'd recommend the Guest Room without hesitation...", "user": "Cath_O_6", "date": "June 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66695025}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "One of our top B&B's!! Excellent, super convenient location as it is only a couple blocks away from the main city street. The walk to/from the main city attractions is a little hilly, but most of Edinburgh is like that anyway. Katrina and Fergus made us feel very welcomed and everything about the b&b is very clean. Also very spacious!! Highly recommended!!!", "title": "Excellent B&B!!", "user": "LauraHi808", "date": "May 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65913681}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "If you want to stay somewhere in the very heart of Edinburgh's New Town yet feel as if you are away from the rest of the world then look no further than The Guest Room. Its only a short walk from fabulous restaurants, shops and attractions, including the beautiful Royal Botanic Gardens, however its a really peaceful and romantic place to stay.", "title": "Hideaway in the Heart of Edinburgh", "user": "HelloGupi", "date": "May 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65406291}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "The large and comfortable room is more than spacious and clean and the same goes for the ensuite shower room. Every morning you are welcomed with an excellent breakfast tray containing porridge, fruit, fresh orange juice, croissants and pain au chocolat, just right for those not wanting huge breakfasts after a meal the night before. In addition there was some lovely shortbread, which was much appreciated!", "title": "Perfect spot, gorgeous room", "user": "jthrill", "date": "May 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65101302}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "Nothing was too much trouble and I believe if you are looking for somewhere to stay that is secluded and private (you have your own entrance in a little courtyard) yet close to Edinburgh's amenities then The Guest Room is perfect for you. Its much better than staying in a soulless hotel room.", "title": "Perfect hideaway", "user": "lmew", "date": "January 4, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 52550482}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "Our first visit to Edinburgh (from Dunedin, NZ) couldn't have started in a better place! Katrina and Fergus were there to meet us and did everything they could to make us feel at home and a part of the family. It was so nice being able to talk to them and find out things the tour guides don't mention about life in Edinburgh. We thoroughly enjoyed our stay, and would heartily recommend The Guest Room!", "title": "Wow! Ideal for first time visitors to Edinburgh!", "helpfulness": 1, "user": "JohnHDunedin", "date": "October 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46308054}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "This is by far the best B&B we have ever stayed in, and just a stone's throw from Prince's Street. From the wonderfully warm welcome, through to the delicious breakfast in bed, every little detail has been thought of to make your stay thoroughly enjoyable. The bed is divinely comfortable; the towels big and fluffy; the homemade shortbread melts in the mouth; a luscious breakfast of porridge, croissants, pain au chocolats, fresh fruits and more makes for a perfect start to the day. Situated in one of Edinburgh's beautiful Georgian terraces, the room is large, spacious, well appointed and tastefully decorated . In short, if you're looking for a fabulous B&B and fantastic hospitality in the heart of Edinburgh, 31a Nelson Street is the perfect place.", "title": "Fabulous B&B in the heart of Edinburgh", "helpfulness": 1, "user": "VirginiaShetland", "date": "September 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 40084553}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We've just completed our second stay/visit with Katrina and Fergus during the Tattoo.....Edinburgh is one of my favorite cities and there's no place I would rather stay while there than at \"The Guest Room\". The location is perfect for exploring the city, the room is separate/private and quite comfortable and well-appointed - perfect for a couple looking for a quiet corner of the New Town to base your visit to this wonderful city. You can easily walk to all attractions and there are some excellent restaurants and pubs in close proximity - unfortunately, never enough time to try them all!", "title": "A Home away from Home\"", "helpfulness": 1, "user": "thelens", "date": "September 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39769283}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The Macpherson's are the perfect hosts...always ready to take a few minutes to chat about things to see or do in Edinburgh or really anywhere in Scotland....the bottom line is that I'm torn between highly recommending \"The Guest Room\" or trying to keep it my little secret! Staying there is truly like staying with friends, making your visit all the more special.", "title": "An absolute gem of a place with wonderful hosts", "helpfulness": 1, "user": "Shippers", "date": "August 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39379012}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Well, reading through the previous reviews again prior to writing this, I must have stayed at a completely different place to everyone else! Our experience of The Guest Room was less favourable than other reviews, instead of feeling welcome, my wife and I felt more of an inconvenience and both commented that the B&B seemed to be just a sideline/hobby to the owners and experienced none of the touches that other guests have commented on. We were hurredly shown to our room (at the owners convenience, as we had to time our arrival to suit them, before they were off out again). The only other time we saw them was when breakfast was brought to our room and then when we left. There was no wardrobe in the room to hang our clothes, no water in the room, there were tea making facilities but at no point was there any milk to take advantage of them and at no point did any of the famous shortbread materialise (although it was promised)! The room was ice cold and we had to ask for the heating to be left on so that we didn’t freeze. Breakfast was hit and miss - porridge was nice, croissants (under cooked on two mornings), fruit for two (which only fed one!) and small glasses of orange juice. The nice big comfy bed was welcome at the end of the day, but our sleep was interrupted early morning by the owners children running around upstairs, so any chance of a lie in was out the window. What really annoyed me was that in our confirmation email, it stated that if there was no parking available near the B&B the owners would direct us to free parking a short while away and then bring us back to the B&B. Upon arrival, there was no assistance with this and we ended up having to pay for parking for a over a day, which wasn’t cheap! Although I was going to walk out within hours of our arrival and book into a hotel, my wife wanted to persevere and so wanted to like the place, the location was fantastic, but there were too many annoyances for us to truly enjoy our stay and we have stayed at more professional and welcoming B&B’s than this. I’d like to think that the owners were having a momentary lapse due to the other good reviews on here, but at the end of the day, my experience was not good so I am unable to recommend The Guest House and will seek alternative accomodation on my next visit to Edinburgh. To top it all off, I returned home to find an email from the owner stating that they had not received our deposit cheque and requesting that we sent them another cheque. Having checked my bank account, the cheque was debited from my account two months previous, I advised them of this and have still received no reply/confimation/apology for their oversight, to me this was another indication of the lack of attention that they pay to their business. Luckily for us, everything else about our trip to Edinburgh was excellent, just a shame about the B&B!", "title": "Very disappointing", "helpfulness": 5, "user": "adethomp", "date": "December 13, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 89764174}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We really enjoyed our stay at The Guest Room last week! The decor is serene, and Katrina and Ferguson are perfect hosts. They really made us feel welcome, and always made sure to ask how our day was. We actually went away for a few nights to the Highlands in the middle of our Scotland trip, and when we returned to Edinburgh on our last night, we stayed at The Guest Room again, and it was like returning to our Edinburgh home. The healthy and delicious breakfast each morning was perfect for us as well. Katrina makes wonderful homemade bread for toast, and there's yummy shortbread in the room as well. The location was also great, and only about a 5 minute walk from Princes Street. Walking toward Old Town from New Town provides a beautiful sight.", "title": "Perfect Spot! We hope to visit again.", "helpfulness": 1, "user": "amacweb", "date": "October 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 83062051}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We were very lucky to find this lovely place to stay on Trip Advisor. Very welcoming hosts, beautiful room, very comfortable bed, delicious breakfast served to the room, lovely toiletries and towels, great books to browse (both about Edinburgh and also general interest). Next time we visit Edinburgh we hope to stay with Katrina and Fergus again!", "title": "A hidden gem!", "helpfulness": 1, "user": "CatDog10", "date": "July 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 72906767}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Beautiful Room , Excellent Location To Everything , Good Hearty Breakfast Every Day , Wonderful Advice From Fergus And Katrina On Where To Go And What To See , Definately Coming Back", "title": "Beautiful Place To Rest And Recover After A Full Day Of Exploring", "helpfulness": 1, "user": "johno1966", "date": "July 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71861510}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Fantastic bed and breakfast, a refreshing change to the hideous tartan clad bed and breakfasts that we have stayed in before.", "title": "excellent!", "user": "evelyn82", "date": "June 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 67207047}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 0, "average": 1, "very good": 6, "terrible": 0, "excellent": 89}, "aka": "The Guest Room Edinburgh, Scotland", "slim_ranking": 0.0563063063063, "description": "The Guest Room B&B is situated right in the centre of Edinburgh's historic New Town of Edinburgh. Just a few minutes walk from art galleries, shops, restaurants and historic sites, it is the perfect and peaceful location from which to explore Edinburgh. The Courtyard Guest Room has its own private entrance, and is nestled at the end of a pretty courtyard, offering quiet and comfortable accommodation with en-suite facilities and a super kingsize bed/twin. The Guest Room overlooking the Courtyard is a large and airy double bedroom found at the end of your own private hallway, with private shower room. The large double sofa is the ideal place to relax with a cup of tea after a busy day exploring the city. Our meusli is homemade as is our bread and Fergus makes the best porridge - try it with maple syrup and blueberries. Breakfast is delivered to your room at a time that suits you. You will be looked after very well - we promise!"}