{"user_rating": 4.5, "review_count": 1492, "name": "The Laguna, a Luxury Collection Resort & Spa", "reviews": [{"rating": 5.0, "title": "Earthly paradise", "text": "I really enjoyed my stay in Laguna.", "user": "HP86", "date": "December 10, 2009", "id": 50987005}, {"rating": 5.0, "title": "Unforgetable Birthday at The Laguna~", "text": "Because all of hotel people are very kind and warm.", "user": "FMouMou", "date": "December 7, 2009", "id": 50841858}, {"rating": 5.0, "title": "Amazing Honeymoon, all one could ask for.", "text": "I was so impressed by the hospitality of this great hotel!", "user": "mike080381", "date": "December 6, 2009", "id": 50743094}, {"rating": 5.0, "title": "An amazing resort and a fantastic stay", "text": "In addition, I could ate delicious food at the restaurants in the hotel.", "user": "elevandrae", "date": "December 4, 2009", "id": 50605376}, {"rating": 5.0, "title": "Fabulous", "text": "I stayed some of famouse hotels at south east asia, Europe and United States in past times, I assure that Laguna resort & Spa is the best hotel.", "user": "rini47", "date": "December 3, 2009", "id": 50597050}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "The Laguna resort and spa' provides the most remarkable combination of perfect location, magical interior design, excellent and heartwarmingly friendly service. The hotel was just fantastic with excellent staff, excellent interior. The SPG floor rooms are of very high standards. Our room was very modern and very spacious as well as very clean and comfortable. The breakfast was beyond any comments...just the best.", "title": "A beautiful, quiet, hotel with a great location and service-oriented staff", "user": "bushan", "date": "May 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65442211}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Everyone (without exception) from bell captain, travel desk, reception, poolside, butler service on SPG floor, doctor and restaurants took care of my wife and self very well. We were touched by their hospitality.", "title": "The perfect honeymoon get-away", "user": "Sapphire0805", "date": "May 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 65386817}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "Whenever I am on holiday with my family, I have heard people talking about “People make holidays” but I never experienced it. It was only at Laguna that I did experience this and every moment we stayed there we thoroughly enjoyed. We loved the hotel and will definitely stay there again when we revisit Bali which we loved. P.S. Security was excellent too....", "title": "We STILL talk about how great this place was. We love it!", "user": "llphiluk", "date": "May 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65370129}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "This was the pefect start to the most amazing 12 night stay in Bali.", "title": "An excellent experience in paradise", "user": "wwtravlerAsia", "date": "May 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 65242892}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "Arriving at the laguna takes away all the usual stresses of checking in at the majority of \"5 star\" hotels. You are greeting by the sounding of a gong and a balinese dance, followed by ice tea and cold towels (much appreciated in the humidity!)", "title": "Thought The Laguna was great. Then we stayed at the Grand Hyatt. That made the Laguna seem EVEN BETTER!", "user": "Springstreet77", "date": "May 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 65122321}, {"rating": 5.0, "title": "Relaxing, quiet, resort experience!", "text": "We stayed here with our 6 year old son in December. The hotel grounds were sprawling and gorgeous! For a small fee, we were upgraded to a junior suite, which was very spacious and lovely. The hotel staff was incredible - very kind and helpful. We were going back and forth between reserving a room at the Laguna or the Westin (next door) and chose this one based on reviews. The Westin was very nice, and had perhaps a more modern decor. I'm sure we would have been very happy there, too, but we're glad we were at the Laguna. It's a bit more sprawling, and with the lagoon pools winding throughout the grounds, we often times felt like we were the only ones there.", "user": "mckenzie99", "date": "January 8, 2010", "id": 52989053}, {"rating": 5.0, "title": "Paradise!", "text": "The food in the hotel was delicious, but pretty pricey. We ate at the breakfast buffet each morning (amazing amount of choices!) but had dinner at the nearby Bali Collection mall, which has several restaurant choices for a quarter of the price of the Laguna restaurants.", "user": "StinkyWhippet", "date": "January 5, 2010", "id": 52698216}, {"rating": 5.0, "title": "a taste of heaven on earth", "text": "The hotel is rather secluded from the rest of the island, but this was OK for us as we only stayed there for 3 days to relax and get over jet lag before heading up to Ubud. I don't know if I would recommend staying here the entire time in Bali as it's just part of a resort complex, but for a quiet beach/pool experience, it was perfect!", "user": "globetrekker3", "date": "January 5, 2010", "id": 52627414}, {"rating": 5.0, "title": "SANCTUARY IN THE FACE OF ADVERSITY", "text": "I would absolutely return to this hotel. The gorgeous grounds, clean and comfy rooms, and excellent staff makes this a top hotel in my book!", "user": "SingaporeDoc", "date": "January 2, 2010", "id": 52347347}, {"rating": 5.0, "title": "great hotel", "text": "This hotel is simply amazing! There are numerous lagoon pools, which is great as you can have a change of scenery. We were also lucky as we were on our honeymoon and were upgraded to a pool access room and as not many people went into these pools it was like having our own private pool. It is a great place to have a relaxing luxurious holiday.", "user": "Matt_Dina", "date": "January 2, 2010", "id": 52346214}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "Sheraton first attracted me with a picture of its beautiful lagoon-view guest rooms and that was more than 2 years ago. When I went to Sanya in Vacation this March, I chose Sheraton Sanya Resort without hesitation. Now I've finally stayed in the Sheraton Bali and love it!!!", "title": "I love Sheraton!", "helpfulness": 4, "user": "microchen", "date": "November 16, 2006", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6136669, "likes": {"liked": "— Garden view", "disliked": "— Check-out is not quick enough."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We stayed for 3 nights at the neighboring Westin and 2 nights at Sheraton. It proved later that we should spend all 5 nights in Sheraton only. Westin is not bad, but older and, ants were often found in our room. Sheraton is almost perfect with new and clean facilities, beautiful lagoons around the guest rooms, 42-inch plasma TV in the room, courteous staff, and everything else I expect. The only defect maybe the towels are not as clean as they should be, although warm and fragrant.", "title": "Welcome to Paradise", "helpfulness": 4, "user": "cliffandjules", "date": "November 1, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6036419, "likes": {"liked": "— Lagoons, setting, butler service", "disliked": "— Sound insulation"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The hotel grounds are absolutely stunning, with a superb ocean front position.", "title": "Pure paradise", "helpfulness": 2, "user": "charlotteandoscar", "date": "November 1, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6035821, "likes": {"liked": "— the bales you can lie in all day", "disliked": "— the restaurants were expensive for bali"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "Fabulous lagoons surround most of the accomodation and I would highly recommend either booking or upgrading when you arrive to a lagoon access room, means you can take a dip as soon as you get out of bed!", "title": "Absolute paradise", "helpfulness": 4, "user": "emskinat", "date": "October 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6015708, "likes": {"liked": "— Everything!", "disliked": "— Nothing!"}}, {"rating": 2.0, "title": "Very disappointing", "text": "We had a deluxe studio with lagoon access. This was a large room, with nice sitting area, large bathroom/dressing area.", "helpfulness": 8, "user": "culturallattice", "date": "October 8, 2006", "id": 5926653}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Everything about this hotel was wonderful. I cannot possibly understand the complaints of other reviewers.", "title": "An Amazing Escape", "helpfulness": 9, "user": "GQSurfer8", "date": "August 22, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5700385, "likes": {"liked": "— The hotel grounds, rooms, and service", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The sound of a gong announced our arrival at the hotel and three gentlemen began to play traditional Indonesian music as we walked in between two rows of beautiful Balinese dancers on our way into the lobby. Once in the lobby, we were greeted by a friendly clerk who instantly brought us over to a couch where we were given chilled scented towels and a delicious flavored iced tea to refresh us from our journey to the resort. My girlfriend and I were quite impressed by this entrance!", "title": "Fantastic experience", "helpfulness": 3, "user": "ElaineCat", "date": "August 22, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5694152, "likes": {"liked": "— the fantastic pool", "disliked": "— no problematic areas"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2006, traveled with family", "text": "We had a Deluxe Studio Room which was very large and equipped with a plush couch and a large plasma screen TV. The bathroom was done in marble and has a large two person soaking tub with complimentary bath salts that any couple will enjoy after a late night.", "title": "Heaven on Earth", "helpfulness": 4, "user": "teltaz", "date": "August 20, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5627740, "likes": {"liked": "— Excellence in service, accomodation and the best pools ever.", "disliked": "— Lack of patronage of hotel restaurants by others."}}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "All of the rooms are also served by butlers, which was a nice treat. Upon arrival your butler will press three items of clothing for free and delivered to us a complimentary platter of delicious tropical fruit. In addition, the butlers will deliver to your room complimentary tea or coffee served on a silver tray anytime day or night. We frequently took advantage of this and enjoyed tea on our adequately sized balcony that looked over the lagoons that snake throughout the property. (Be sure to book a room that overlooks the beautiful lagoons).", "title": "Sheraton Laguna Nusa Dora - Spend your money elsewhere", "helpfulness": 6, "user": "waddesdon", "date": "August 17, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 2.0, "rooms": 4.0}, "id": 5621477, "likes": {"liked": "— modern refit and the lagoon pools", "disliked": "— overpriced in areas"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The rooms are situated across 4 floors. Rooms on the first floor that face the lagoon have direct access from the room deck into the lagoon. While this is a nice little treat, these rooms cost a bit more and do not seem to justify the increased cost.", "title": "Luxurious Paradise with beautiful landscaping", "helpfulness": 4, "user": "Saurabh2709", "date": "August 13, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5604940, "likes": {"liked": "— Lagoons, Landscaping", "disliked": "— Beach"}}, {"rating": 4.0, "title": "Beautiful resort but away from everything", "text": "Stayed here for 7 nights and had a wonderful experience. Really beautifully manicured grounds and resort semed well maintained.", "helpfulness": 2, "user": "PLKAustin", "date": "March 10, 2007", "id": 7008430}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "I was in a suite and have no complaints on the room and its furnishing.", "title": "Lovely hotel and rooms, pity about the food and service", "helpfulness": 6, "user": "melhj", "date": "February 19, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "location": 2.0}, "id": 6814105, "likes": {"liked": "— the rooms, pool and location on beach", "disliked": "— food and service"}}, {"rating": 5.0, "title": "Simply Stunning", "text": "The food was good for the most part and excellant in the Indonesian high end resturant (ate there twice). Room service for breakfast well done. You really need to go to Kuta/Seminyak for great meals and there are many places, Ku De Ta, Cafe Warisan, The Living Room to name three excellant ones.", "helpfulness": 6, "user": "work2travel", "date": "January 22, 2007", "id": 6642630}, {"rating": 5.0, "title": "Excellent all round", "text": "Fitness center is small and equipment is limited. Had to wait a few times to get on one of the two bikes.", "helpfulness": 3, "user": "TravellerUK77", "date": "November 21, 2006", "id": 6160521}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Evening outdoor lounge with a night club singer, piano and sax was nice and relaxing. Only problem was they shut down at 10:30/p?.?", "title": "Paradise LOST", "helpfulness": 7, "user": "P&SSmith", "date": "November 19, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 2.0, "rooms": 4.0}, "id": 6151987, "likes": {"liked": "— Hotel room"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "This place has everything I want in a resort but the highlight is absolutely the lagoons. They're huge, and some have with sandy \"beaches,\" others have waterfalls and all are beautifully landscaped. I walked along the beach and saw a number of other resorts - none of the other pools come close. If you're more of a beach person, the beach at the Laguna is wonderful as well; there's a reef a couple hundred meters so the waves are pretty gentle. Besides the lounge chairs on the beach, there are also a number of cabanas you can reserve - sooo nice. There's a big cabana where you can get Balinese massage or foot massage. There are a number of picturesque bars located strategically around the resort. Drinks are good, not watered down. I was satisfied with the food - which was pretty good, not amazing, but what you'd expect for resort food. One very pleasant surprise was Mayang Sari restaurant serving \"modern Indonesian\" food which was truly excellent. We had a delicious meal of perfectly grilled and marinated meats, and very tasty sides.", "title": "Amazing lagoons, beautiful beach, everything you'd want in a resort", "user": "esheng", "date": "July 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 70035565}, {"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We had a room overlooking one of the lagoons. It was nicely decorated and everything was new and clean. The TV was huge and there was a DVD player as well, which we didn't end up using. One of my few complains about the place revolve around the room. It seemed a bit ludicrous for a good sized room to have only 3 very small drawers for clothing. Also, the air conditioning is a bit quirky. Air con usually dries out the air a bit but here, the sheets would start out dry and warm dryer but then they'd be hopelessly damp the next day. The towels would be just as wet 12 hours later as after you finished using it and all the upholstry is a tad damp. I complained about it, and management was very gracious in checking out the airconditioning and offering to change rooms but I checked out another room and it was equally damp.", "title": "A 4 star hotel", "user": "TomNorway", "date": "July 6, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 1.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 69884585}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "But otherwise, it was perfect. The resort was a mix of couples and families with children. Nusa Dua seems to attrract a lot of Europeans, there seemed to be a lot of Dutch folks around when I was there, but also some Aussies, North Americans and a few Chinese here and there. Service was friendly and pretty prompt. (room service within half an hour) I'd go back in a heartbeat!", "title": "A First Class Hotel With Top Quality Service", "user": "Travellers052", "date": "July 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 69426160}, {"rating": 2.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "After reading so much positive review on this hotel we decided to stay here for 12 days.", "title": "Not 5 stars", "user": "aecasey", "date": "June 27, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 68811960}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "Our first impression was positive. It was an impressive lobby, with good service. We had a sort of sweet tea, all guests received. After a mistake from our office in Norway, we got our room a luxurious suites, with separate bedrooms. The rooms were nice, but it smelled strange, a kind of mildew smell. We had a nice butler, but I have not yet fully understood the task to that person, except to show us the room. Besides that our suites was spacious, lacked the cupboard space. We were three people, and only a double closet, which was placed in the bathroom.", "title": "Nusa Dua is the best place to stay at BALI!", "user": "DaoMind", "date": "June 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68620184}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "I stay with the Laguna at least 3 times a year. I work in Bali ,quite a distance away from Nusa Dua. I silently grizzle about the distance that the Laguna is away from my work.... but on arrival the greeting of the staff and their understanding of my needs simply overrides my thoughts on location.", "title": "simply perfect service and an atmosphere thats serene", "helpfulness": 1, "user": "SydneyJud", "date": "November 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49933486}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "The team at Laguna are quietly confident, they are happy to help with anything no matter how small a detail.", "title": "Perfection", "helpfulness": 1, "user": "LianeAustralia", "date": "November 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49720727}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "I consider them all to be my Bali family and look forward to each stay with them.", "title": "the wonderful Balinese people take this place over the top!", "helpfulness": 1, "user": "canuck000", "date": "November 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 49716493}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "I take my own family to holiday there at least once a year. It gets the top vote every time, they love it !!!! The beach is safe, the hotel is spotless, the staff are so friendly that you want to take them all home with you........ its just a perfect combination, safe, friendly and so very relaxing.", "title": "Fantastic Honeymoon Hotel", "helpfulness": 1, "user": "NewlywedsEngland", "date": "November 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49590325}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "What more can you say about a hotel other than they invented the phrase \" attention to detail \" ???", "title": "Blissful lazing by the pool experience, highly recommended", "helpfulness": 1, "user": "TrixyPo_Oz", "date": "November 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 49530237}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We stayed at this hotel 4 nights and had an amazing time. The staff were very courteous and willing to please. Everyone was so wonderful and helpful, from the driver that picked us up from the airport to the housekeepers. Nusa Dua is a bit sterile, but if you need the peace of mind with the added security, it is the place to go. The beach is nice and it seems they have only certain hawkers that are allowed on different points. The food and alcohol are a bit expensive, but we didn't have a bad meal the entire stay. The breakfast buffet was massive and crowded. If you are an early riser, go early. We also visited the spa for 3 hours of treatments and it was wonderful. Very peaceful and relaxing.", "title": "Wonderful service", "user": "rbmacg", "date": "May 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 64449016}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "When I first arrived at the hotels, I was wowed by the number of lagoons this hotel is surrounded by. It seems there are at least ten lagoons and almost all rooms on the ground floor have some kind of lagoon access. Our room was a junior suite without lagoon access, but that did not matter, as I prefer swimming in the main pool, which i thought was cleaner. There are many restaurants to choose from and you can also dine at one of the Westin restaurants right across from the property and charge to your room. While it is tempting to just stay in the hotel, it is also nice to check out the beach where people sit outside and have their seafood dinners during sunset.", "title": "Nice Relaxing Hotel Surrounded by Lagoons", "user": "kalikidd05", "date": "May 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 64306366}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Prior to departure i read other reviews and they indicated 5 star luxury and i have to agree totally.", "title": "Pure Luxury", "user": "YorkshireDarren", "date": "May 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64138171}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "I have stopped in The Shangri - La Hotels in different countrys and this is comparable if not better.", "title": "Good hotel but disappointed by Nusa Dua", "user": "jsg27", "date": "May 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 63936347}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "The hotel entrance is well laid out and the service from the staff as soon as you step out from your taxi is second to non. They are waiting with cold towels and ice cold drink, with the check in completed by efficient staff while you relax. Luggage swifty taken up to your room there for when you arrive.", "title": "Lovely resort with friendly,helpful staff", "user": "allaPerthWA", "date": "May 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63824414}, {"rating": 5.0, "stay_parameters": "Stayed May 2005, traveled as a couple", "text": "This place is just the best in service and atmosphere. The rooms are beautiful.. 5 star! The people there are top notch. The spa is amazing. The pools are spectacular. I have nothing bad to say about our experience there. We plan to go back next month!", "title": "AMAZING PLACE ! Excellent Service", "helpfulness": 3, "user": "ksnyc", "date": "October 8, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5926464, "likes": {"liked": "— Service", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "As you enter the Hotel you will see a sign that says \" Wecome to Paradise\" This is exactly what you are entering.... From your arrival at Paradise we where made feel like you are the only guest in the Hotel. The Staff couldn't have done more for myself or my partner on our 3 week stay.", "title": "Welcome to Paradise", "helpfulness": 7, "user": "leon&Kevin", "date": "September 29, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5889947, "likes": {"liked": "— Couldn't What was Best everthing was Fab", "disliked": "— Having to leave"}}, {"rating": 3.0, "title": "Neutral", "text": "The small little touches in the hotel and our very spacious and comfortable room. From Cool towels on arrival to the flowers left on our bed a night. This Hotel is just in a whole new league of making you feel welcome.", "helpfulness": 5, "user": "plantripnow", "date": "September 20, 2006", "id": 5824539}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "My Partner organised a Romantic meal on the Hotels Special Table, This I would highly recommend, for a really nice romantic evening and a fantastic meal with superb service.", "title": "The sign reads Welcome to Paradise (It's true)", "helpfulness": 9, "user": "Terrytri", "date": "September 15, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5803909, "likes": {"liked": "— Comfort,service,facilities,food.", "disliked": "— Nil"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "You can be at a different pool every day, from a little lively to pools that are very quite and relaxing and you also have a beach to choose from. The pools however have sand as you walk in to give the beach effect :-).", "title": "Beautiful hotel", "helpfulness": 2, "user": "TravelinMonty", "date": "September 6, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 5774781, "likes": {"liked": "— pool and room", "disliked": "— lack of beach service"}}, {"rating": 5.0, "title": "Too good to be true", "text": "I have just finished a wonderful 11 night stay here with the family that was simply too good to be true.", "user": "ctraveltheworld", "date": "December 29, 2009", "id": 52061438}, {"rating": 5.0, "title": "WOW, WOW AND WOW! Feel like a VIP!", "text": "This was clearly my best stay of 2009. A magnificent Hotel that is well managed with superbly trained staff that are pleased to spoil you with whatever it takes.I am simply blown away with the care and attention to detail that my family received from the moment we landed at Denpasar airport to the moment we left.", "user": "AkashaStar", "date": "December 28, 2009", "id": 52052731}, {"rating": 5.0, "title": "Best vacation ever!", "text": "We had arranged for the 4 of us to be met by the Bali Concierge upon landing and as we came down the stairs after arrival he was waiting for us with a big sign that I could spot while I was still on the stairs. Cost was USD35/person but it is well worth it.While you are having a welcome drink and a snack in the Lounge your bags are being fetched,Visas arranged and then you are sped thru Customs to where the Hotel driver was waiting and away we went.", "user": "JRSpore", "date": "December 23, 2009", "id": 51778826}, {"rating": 5.0, "title": "The Best Place in the world I have ever been on Holiday.", "text": "Check In was pleasant and quick and we were notified of the many benefits (some published and some unpublished) that as Platinum guests we could enjoy.We were allocated an upgrade to an Executive Suite with adjoining Deluxe twin room for the children.", "user": "marcusba_555", "date": "December 19, 2009", "id": 51507384}, {"rating": 3.0, "title": "Good food, but very much out of fashion", "text": "The Hotel had given us benefits beyond those published which included Airport transfers and free Buffet breakfast.I can confirm that free Internet is now a stated Platinum benefit. No Lounge exists in this LC property but a highly recommended complimentary afternoon tea occurs at 3 PM daily in Mayang Sari. This is not to be missed and Putri and Dayu are superb hosts.", "user": "schoao", "date": "December 11, 2009", "id": 51051229}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "We had a wonderful 2 nights stay at Laguna Resort and Spa, Nusa Dua. It's an amazing place - outstanding location on the beach, wonderful rooms, exotic pools with sandy beaches and waterfalls, great restaurants, extraordinary service - but the very best was the lagoon running around the rooms. We had booked a lagoon access room and the experience of jumping from our porch into the lagoon was indescribable : worth any extra money we paid for it. Another memorable experience was the special Balinese buffet organised on Sundays - we were really lucky to stumble upon it.", "title": "In the lap of luxury . . .", "user": "IndianBirder", "date": "June 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68544024}, {"rating": 5.0, "stay_parameters": "Stayed June 2010", "text": "Right from the amazingly warm, cheerful and personal welcome we got on entering the resort, to the efficient check-out at 6.30am, every member of the staff seemed genuinely happy to have us with them..", "title": "best service ever in paradise", "user": "jihyun", "date": "June 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68496905}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "An added attraction for us was playing golf at the nearby Bali Golf and Country Club - efficiently organised by the concierge.", "title": "Absolutely love the Laguna", "user": "Warren29", "date": "June 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 68424610}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We're glad to have started our Bali trip in the lap of luxury!", "title": "Pleasant, cookie-cutter resort in a gated community", "user": "Nuffster", "date": "June 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 67662266}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Group of 16 people stayed in Laguna after our medical charity mission in Manado. Although we had major clashes with the travel agency that booked us to this resort, the hotel staffs helped us avoid all the tourist traps and saved us from further financial bleeding. Check everything with the friendly hotel staffs and it will work out to save you lots of money. For instance, our group saved 130$ on transfers to the airport from the hotel (one way) by directly contacting the concierge. Instead of venturing outside, restaurants within the hotel might work out far better as the food is delicious and more hygienic. I will definately tell those around me to go to Laguna when visiting Bali.", "title": "Our Wedding Day was perfect - I would'nt have changed a thing... almost", "user": "sjfraser", "date": "June 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66278429}], "location": {}, "stars": 5, "variance": {"poor": 41, "average": 109, "very good": 300, "terrible": 22, "excellent": 1020}, "aka": "The Laguna, a Luxury Collection Resort And Spa", "slim_ranking": 0.225, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Located in the exclusive Nusa Dua resort area, on Bali's most beautiful beach, the Laguna Resort & Spa boast panoramic view of Indian Ocean. The 257 guest rooms and 19 suites combine modern Balinese style with evocative tropical garden or lagoon views, the resort’s unique Lagoon Access Rooms allow you to step from your private balcony directly into crystal-clear lagoon waters while the 11 pool villas feature expansive private pools. Enjoy our seven swimmable lagoons, the first swimmable lagoon in the world, stretching over 5,000-square-metres though the resort. The Lagoon Spa promises unforgettable activities while our 24-hour Butler Service ensures a matchless experience. The Laguna Resort & Spa offers a wide range of dining options featuring cuisines from around the world. Banyubiru featuring pan-Asian and International cuisines. Arwana, a beachfront restaurant, offers an extensive and unparalled premium coastal cuisine with fresh and live seafood as well as an oyster and sushi bar. Cornerstone features a wine room with a unique setting for private dining and a deli highlighting a sambal corner, a variety of homemade ice creams, chocolates, cakes and daily specialties from the rotisserie oven. In addition, our poolside Kul Kul Bar, Cascade Garden Lounge and Bar, and Sapphire Lagoon Bar offer signature cocktails, wine, spirits and light bites."}