{"user_rating": 4.5, "review_count": 202, "name": "The St. Regis Mardavall Mallorca Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "I have just returned from a conference here, and the room, facilities, service and location are faultless. Having been booked into the Junior Suite, I had a fantastic three days. Would definately recommend to others.", "title": "Fantastic Hotel", "user": "debsedo", "date": "March 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57852764}, {"rating": 5.0, "title": "I will never forget!", "text": "This Hotel was so great. Full service with a fantastic SPA. Beside the perfect arragend rooms, there are very obliging employees.", "user": "IsabellG4", "date": "January 31, 2010", "id": 54823559}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "PS: I guess the showerrooms were for 10 people:-) very nice!", "title": "Good family hotel", "helpfulness": 1, "user": "willcarling", "date": "September 6, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 39887292}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We came here with four of our children, two little ones and two teenagers and they all had a great time. The pools are very good, plenty of space/ grass around them to play, and the spa was very good.", "title": "Best I've ever stayed. Simply Beautiful", "helpfulness": 1, "user": "BlackCenturion", "date": "August 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37503982}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The little kids have there own tea time, and the food was great - amazing how many parents were in there helping their kids to eat!!!", "title": "Everything it was meant to be...", "helpfulness": 1, "user": "imperiallwizard", "date": "July 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34294638}, {"rating": 4.0, "title": "Class without character", "text": "We stayed at the St. Regis for a weekend break in March. There is not much, if anything we could complain about. The hotel is fitted out to a very high standard, is impeccably clean, the rooms are large, the bath is full sized and the beds very comfortable.", "user": "RallyMonkey", "date": "March 24, 2011", "id": 101443895}, {"rating": 5.0, "title": "A mezmerizing Experience!!!", "text": "The spa is excellent, and a usable base (with two pools) even if you are not visiting for a specific treatment.", "user": "Ashish1983", "date": "March 24, 2011", "id": 101402486}, {"rating": 5.0, "title": "Heaven", "text": "The location just outside Palma is fine. It is quiet and well away from resorts such as Magaluf. There is a marina a short stroll (15 mins) away, which has a choice of alternative restaurants.", "user": "Pattycakec", "date": "March 4, 2011", "id": 98946770}, {"rating": 5.0, "title": "truly excellent hotel", "text": "And yet we would not return.", "user": "TimChesney", "date": "November 5, 2010", "id": 86094710}, {"rating": 5.0, "title": "Very Nice Hotel.....especially if money is no object", "text": "The hotel has a strong bias toward the German corporate market, for instance we were greeted in German at breakfast. The restaurant (only one restaurant open out of the season) serves food with good ingredients, well cooked, by lacking in invention and flair. Such a pity to serve German food in Spain. The setting of the hotel is reasonable, but not attractive. The staff efficient and polite, but with little of their character allowed to show through.", "user": "chadp1", "date": "October 9, 2010", "id": 82740268}, {"rating": 1.0, "title": "Shoddy Service, poor food, and £25.00 burgers don't mix", "text": "The Mardavall Hotel is perhaps the most bizarre construct I have ever encountered. The building is fine , good 4* standard , the Rooms are comfortable but have antique air con systems that are unable to chill the room. If you are prepared to wait half an hour the pool bar will prepare you a stale burger for £25.00 or sell you a flat glass of beer for £8.00, the room rate is equivalent to two suites in the Peninsula HK , or Three suites in the Oriental Bangkok, and far more than a suite at the Hotel de Paris in Monte Carlo , at 1100 euro/ night. This surely is a sick joke , the service is terrible, the food is poor - average at best, there is no beach access- if you want the spa to paint your fingernails they will do so for the reasonable price of euro 90!!!!!! am I going nuts or is this organisation taking the micky ??? an average room with three star spanish service levels at three times the price of the Bangkok Oriental (multiple winner of the worlds best hotel) no no no no no ...... don't waste your money , no matter how much you have , this place will get under your skin and will fall way below expectations , for far above expected cost.", "user": "Rachelbuckley1974", "date": "September 6, 2010", "id": 78455961}, {"rating": 3.0, "title": "Should be Amazing - But Isn't!", "text": "Hotel location is undoubtedly lovely and the rooms are also undoubtedly lovely and spotless - but that is about all there is. The staff are pleasant enough but service is nothing near 5 star and having sne back a baked potato due to te hfact is wasnt cooked through and a milkshake bacj as it wasn't cold; it really annoyed me to have to pay 6 Euro for a draft coke every time at the poolside and made us doubt the value of at least 80 Euro per head to eat dinner at either of the main restaurants, one of which is no less than 160 Euro per head for a menu I couldn't even have eaten from as it was so specialised and fussy. The poolside lunch menu is totally restricted and the highlight is a burger or a pizza, and the pizza didn't even appear written down anyhwere so we didn't know it was available till we saw everyone else ordering them - I guess everyone else was struggling with the menus too! If the highlight at lunch round the stunning pool at a luxury 5 star hotel is a pizza something is very wrong! Breakfast buffet is very continental in selection which is ok but pastry selection is pretty rubbish and the cooked food is a total disgrace - all frozen mass produced items deep fried to within an inch of their life. Really really disappointing and again after one day I was bored with the choice on offer. It was just a really bad standard.", "user": "Flychick747", "date": "September 1, 2010", "id": 77854943}, {"rating": 5.0, "title": "Beautiful Location, Wonderful Staff", "text": "This hotel should be amazing - but somehow it just isn't. It's seriously overpriced and I didn't feel we got any value from the food/beverage side at all. It's a place I would love to go back again and again - but I couldn't because I couldn't actually face seeing the breakfast buffet every morning and I just would not pay for the rubbish food. Aqua restaurant was nicer but it took us longer than 3 hours to be served the whole meal. And that was two courses.", "user": "clsmit", "date": "August 11, 2010", "id": 74843321}, {"rating": 4.0, "title": "Nice stay but nothing more", "text": "For 1000 Euro a day which is roughly what this place cost us - you can go pretty much anywhere and have a great time. So we aren't going back here again. We don't mind paying the money but this wasn't value - it was just flushing money away.", "user": "CNielsen", "date": "July 25, 2010", "id": 72218117}, {"rating": 5.0, "title": "Luxurious family hotel", "text": "We stayed at the St Regis Mardavall in Mallorca on vacation with our 11 and 14 year old children. We got 2 rooms, each large one-bedrooms with a balcony. Our rooms overlooked the bar, which wasn't too bad as it was good for people-watching and enjoying the night music. The rooms on the outer buildings would be quieter. This is a hotel that, like many hotels in Mallorca, has a lot of German tourists and caters to European tastes. If you want a \"true\" Spanish or Mallorcan experience this is not your place. Rooms: Large, huge bathrooms, tons of bath amenities, twice a day service, tons of storage space. TV: Not the best, but you're not supposed to be hanging in your room. Spa: Huge, lots of services, a variety of pools, very nice workout area. Many kids activities for younger kids. Nothing for teens. We had 2 meals at the hotel -- bar food while watching the World Cup (Spain v. Germany, kind of awkward); and pasta and sauce as room service. The food was very good. The room service prices were not jacked up as they are in the US, so our pasta was not outrageously priced. The food prices were higher, but the food quality was good and this is a St Regis. If you want cheap food there are plenty of restaurants nearby. The concierge staff was very helpful recommending places to eat, where to go to the beach, and coordinating tennis times. There's a Sheraton nearby on a golf course -- we don't golf so we didn't take advantage of that shuttle or services. We would go back to the St Regis should our travels take us to Mallorca another time.", "user": "SaskiaSarratt", "date": "July 22, 2010", "id": 71949903}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Excellent in all respects. Stayed for one week in a Butler junior suite and the whole stay was excellent.", "title": "Really,really top Hotel", "user": "allgone", "date": "June 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68716988}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "Restaurants very high standard, breakfast especially good serving until 11.30 in the week and 12.00 at week-ends which made for a very relaxed day.", "title": "World class service, great for families, rooms and food average", "helpfulness": 1, "user": "Globaltaster", "date": "June 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 68200001}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "Gardens beautifull and plenty of room for sunbathing,never feeling crowded and had a felling of a private club rather than a hotel.", "title": "Top class hotel with great service", "user": "HerefordRitzy", "date": "May 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65700592}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "Magnificent spa.", "title": "luxurious rooms and great setting", "helpfulness": 1, "user": "Lambos", "date": "May 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64376830}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "Expensive but at this standard that is to be expected.", "title": "Fantastic lovely hotel", "user": "Giny", "date": "March 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59334023}], "location": {"country": "Spain", "continent": "Europe"}, "stars": 5, "variance": {"poor": 10, "average": 14, "very good": 30, "terrible": 3, "excellent": 145}, "aka": "The St. Regis Mardavall Mallorca Hotel", "slim_ranking": 0.5, "description": "The St. Regis Mardavall Mallorca Resort is one of the most prestigious resorts of the Mediterranean. Located near the exclusive area of Puerto Portals between the Tramuntana Mountains and the sea this hotel offers to its guest a unique experience of luxury and tradition. The tailored and personalized St. Regis butler service, along with the captivating views from the rooms and the exceptional restaurants will create an extraordinary experience impossible to forget."}