{"user_rating": 4.0, "review_count": 398, "name": "The Parkside Hotel & Spa", "reviews": [{"rating": 2.0, "title": "Hotel is pretty good, except that they...", "text": "Hotel is pretty good, except that they don't have airconditioning. The temperatures inside were unbearably hot, which many of the guests were complaining about. Don't book this place for a stay when it's warm! We called the front desk several times asking for a fan, which we were told was on it's way - it never arrived. Spent as much time outside the hotel as possible to avoid the heat, but didn't get a lot of sleep because it was so hot inside even at night. It's a shame, but can't recommend this hotel as a result.", "helpfulness": 4, "user": "BCBouncer", "date": "August 17, 2010", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 75600366}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "What a fabulous hotel, just like the pictures show, clean, upscale, modern, 3 flatscreen televisions, all the appliances, super thick towels, fluffy fat bathrobes, patio, etc.", "title": "Absolutely beautiful but...", "helpfulness": 1, "user": "Heeter", "date": "August 16, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 75376021}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "I was totally impressed until we discovered that there is no air conditioning! Visiting in August the temperature was in the high 80's, and with no air conditioning I thought I would suffocate. Even with all the windows and doors open all night in our 2 bedroom suite, the temperature hovered in the 80's. I slept on the sofa one night and left the refridgerator/freezer door open in a frugal attempt to cool off.", "title": "Great hotel, fantatic location", "helpfulness": 1, "user": "isema", "date": "August 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75311747}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "When I called the front desk they advised that there was NO air conditioning but they would put us on the \"wait list\" for a fan. WAIT LIST??! Not acceptable. If I'm paying over $300 a night for a swanky suite (#A509) I EXPECT to be comfortable in this most basic way.", "title": "Beautiful New Hotel - great location!", "user": "kpart", "date": "August 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73508226}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Yes, I would stay here again, but not in the summer time.", "title": "Environmentally Friendly Luxury", "user": "pjack53", "date": "August 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73507229}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We stayed at the Parkside 3 nights at the start of our trip to Vancouver Island and 3 nights at the end, in different 1-bedroom units and we couldn't have been happier. Both times we had views on gardens/courtyards and I didn't find it at all noisy. We slept with the doors to the balcony open. We loved the space and the decor of the suites, the free wifi and free local calls, the pool, the gym, the 2 flat screen tvs, the full size fridge. The weather was not too hot while we were there but I can imagine that the lack of a/c might be a problem on those rare days when the temperatures top 30C. I understand that there is an air flow system that makes this more comfortable and that, in order to be classified as a LEED building, A/C would not qualify. However, fans could perhaps be made available for guests who request them on hot days, as this seems to be a concern for some reviewers. While there is no restaurant on site, it is a very short walk to a great coffee shop for lattes and muffins (near the Marriot hotel). The Parkside is walking distance to all the tourist sites of the inner harbour and, around the other way, to markets and local restaurants and bakeries. If you are going to be touring the island and away most of the day, you can make do with street parking (free all night but only 2 hours parking between 8am and 6 pm and they are very assiduous about ticketing). We got a very reasonable summer mid-week rate. I would definately recommend this hotel to anyone visiting Victoria.", "title": "Truly a home away from home", "user": "mirey", "date": "August 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73489939}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "our first choice since it was a suite w/kitchen. Stayed in two bed suite, two bath. Really nicely finished, near all of the attractions-within walking distance of everything. It was nice to have a kitchen and living area rather than just a hotel room and only 30.00 more per night. So if you are going to stay in downtown Victoria, this is the place to stay. The pool was really nice and since the resort is so new, everything is very nice. Coffee provided in the suite was very good. Front staff was fantastic, very helpful. Room service staff was very friendly. Heated bathroom floors and a tub to relax in. Only two negative. No airconditioning in the suite, but the windows open in all the rooms made for a very nice cross breeze, but you could not leave them open at night since there is a bit of noise, being on a main street. The other small item was the quality of the toilet paper-lol. I know because they are being ecological aware, but there must be a better quality eco paper out there. The finish is high end and the comfort factor is there. We will definately stay here again vs the Marriott down the road simply for the luxury of a suite over a room, I look forward to them having a restaurant in the hotel soon. However we ordered in food from the dine-in menu provided (greek) and it was great. The front staff called when it arrived and let the delivery person come up to bring to our door. Again the service of all the stafff in great and makes the finishing touch on a really great mini holiday. The garage was secured, well lit and warm with plugins for the hybrid cars. I would have no hesitation in recommending this residence to anyone coming over for a visit. My son loved his king sized bed in his own room with his own tv. Master suite had a tv, fire place and the huge tub. Dining in the dining area was really nice and all of the appliances are new and functioning well. The bed was super comfy and the sheets are of high quality. The free wi-fi in the suite was a bonus and we did not have any lag time with our computer. Every morning there was a message from the front desk saying what the movie showing in the theatre in the hotel was playing! The photos on their website are true and not fudged at all.", "title": "VERY VERY NICE", "helpfulness": 2, "user": "mickeyfamily", "date": "July 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71297831}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We are planning to come back within the next few months to see more attractions and we will be staying here for sure. This is a great hotel and we loved it. And yes, I will do the spa thing when we come back.", "title": "Worth it when traveling with family", "user": "FuryIII", "date": "July 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 71197228}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "As others have noted, there are a few drawbacks to staying at this condo/hotel. There is no restaurant (though they claim to be opening one this summer), nor very close grocery stores. There is also no air conditioning, which is probably not generally a problem, but it happened to be quite warm when we visited, and there was enough street noise that we didn't want to leave windows open at night. Noise from construction at the building across the street was a bit much, but fortunately, we are early risers.", "title": "Well worth it - wiht minor drawbacks", "helpfulness": 1, "user": "Two_Aggies", "date": "July 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 69679795}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "On the upside, the Parkside is very upscale, and the building and condos are attractively and comfortably furnished. The beds in our two-bedroom condo were great, and our daughter even found the pull out couch pretty nice to sleep on. Our teens were pleased that they had some room to spread out. Although there were numerous other families with very young children staying on the same floor, we never heard any noise from them while we were in our condo. It's a quick walk to the Inner Harbor, where there are plenty of bars and restaurants, as well as street entertainment. We had minimal interaction with staff, but check in and check out were pleasant and professional. Definitely a good choice for families who don't want to be cooped up in a small hotel room.", "title": "Impressive with some qualifications", "helpfulness": 3, "user": "EdmTraveller2", "date": "July 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 69500081}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "stayed at this hotel for 3 nights i wish i cauld have stayed longer the staff where so help full like a home away from home if there is only one complaint is that in a 2 bed there was 2 big beds would have liked 1 room to have been a twin i i had had my children thay would have had to share a bed", "title": "one of the best", "user": "sodafeet", "date": "September 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80931961}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "This hotel/condo is a wonderful place to stay. We felt like the room had everything we could want in a hotel with one exception. No Air conditioning. They say it's because they are trying to go green. Room ammenties included 2 fireplaces, kitchenette, dinning table, sofa, 2 large flat panel tv's, king sized bed, heated tile floor in the bathrooms, Aveda Products in the bathrooms, balcony, highspeed internet, hot-tub, pool, gym, spa. It was like our own little condo for the weekend. When we checked into the hotel they were somehow missing our reservation. Thankfully I had brought a copy with us from our booking through Expedia. We could not check into our room until 4pm so they held our bags and we came back later in the afternoon. Overall we were fairly pleased with our stay, but we do wish they had AC. I wouldn't want to stay here in the dead heat of summer.", "title": "Wonderful Getaway!", "user": "jyong_35", "date": "September 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 78825460}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Forget about the Empress - the Parkside Victoria is the most perfect place to stay in Victoria! We spent three wonderful days in this brand-new downtown hotel and cannot praise it enough. The four of us shared a two bedroom deluxe suite (they even have higher-end ones which are called luxury suites) and it was perfect. Very nicely decorated and plenty of room, most importantly a large living room with a well-equipped kitchen. There is even a washer/dryer appliance in the room! Two bathrooms, one with a shower and one with a free-standing design bath-tub (no door to this one though, takes a bit of getting used to...). Best thing: A terrace with enough room for four people to have breakfast, weather permitting (not always the case in Victoria...). The fitness room is good and the 25m pool is just marvelous. The hotel is within 5 minute walking distance from the Inner Harbour, so you are close to where the action is, yet it is in a quiter part of downtown close to Beacon Hill Park which is great for a morning jog. We would not want to stay anywhere else on our next visit to Victoria!", "title": "The Perfect Place to Stay in Victoria", "helpfulness": 1, "user": "TripGuido", "date": "September 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 77827755}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Fine hotel. Beautiful well appointed suites. Nicely located. Felt more like a residential condo than a hotel. Pool is amazing. Staff was pleasant and helpful. I would recommend this hotel but be aware that there is a concerted effort made by the management to sell you partial or full shares of the hotel suites. They offered spa discounts if you were willing to listen to the sales pitch. We didn't take them up on the offer. Enjoyed our stay overall.", "title": "Upscale accommodations", "user": "lasenna45", "date": "August 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 77509757}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "My wife and I, along with my brother-in-law and his wife shared a two bedroom suite. The hotel looked very modern and clean from the outside. The water ways leading to the entrance outside and the very impressive lobby were very nice touches. We arrived to Victoria on the heels of them having several 30c plus days, so the lobby was a bit humid and stuffy although quite beautiful. The air was very heavy in the lobby and the smell of chlorine followed us into the elevator and it was that way for the 2 nights we stayed at the hotel.", "title": "Looks great but lacks a proper air flow.", "helpfulness": 2, "user": "spacement", "date": "August 24, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 76588729}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "As I was coming to Victoria for 3 days on business, I thought it would be the perfect time to check out the new Parkside Victoria which offers one bedroom suites and is in a great location. The room was very nice as were the amenities. All new and top quality. Internet access easy and free. Only thing missing in the suite was a full length mirror and the bathroom is on the small side. In terms of service, I was treated professionally and with courtesy. I think they missed a chance to make a big impression by not offering an upgrade when the hotel was obviously practically empty. I don't think the staff are empowered or experienced enough to know how to really make a statement yet. Hopefully that will come. All in all, a nice additional to Victoria and I will likely stay again. ps - it would be good to be able to \"opt out\" of the daily voice mails announcing the programs. I felt a bit like being on a cruise ship. Nice touch but opting out is a good idea.", "title": "A nice addition to the hotel community in Victoria", "helpfulness": 1, "user": "mmccormi", "date": "October 8, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 82615038}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "As someone who managed to grab a deal on this hotel at only $130/night, there isn't much complaining I could do that would be valid.", "title": "A few quirks but would stay again", "helpfulness": 1, "user": "MUhrblock", "date": "October 3, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 81884203}, {"rating": 2.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The hotel is in a great location for walking to the Inner Harbor area and near major arteries for getting around. The rooms are obviously all very new and we always find it nice to travel with a small kitchen and a separate bedroom. There is a nice indoor pool and a cool rooftop patio although we were not able to take advantage of it because of weather.", "title": "Better not go for your Honeymoon...Customer service wasn't great.", "helpfulness": 4, "user": "JSGD09", "date": "September 30, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 81651567}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "The service seemed indifferent, we didn't ask for much, and we didn't get much.", "title": "Nice new hotel with great access to downtown Victoria", "user": "Darcy9463", "date": "September 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 81215861}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "As mentioned previously, the airflow in the hotel is awful, I can't imagine staying here in the summer as it sort of has that type of air that you find when you step into your community swimming pool throughout the property. I appreciate the effort to be environmentally responsible but there are some people who this is not going to appeal to.", "title": "I like them being Environmentally friendly", "user": "casper888", "date": "September 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 81082303}], "location": {"country": "Canada"}, "stars": 3.5, "variance": {"poor": 25, "average": 42, "very good": 103, "terrible": 17, "excellent": 211}, "aka": "Parkside Victoria Resort And Spa", "slim_ranking": 0.333333333333, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.5, "location": 4.5}, "description": "The Parkside Hotel & Spa is Victoria's newest all-suite downtown hotel. Convenient located three blocks from the world famous Inner Harbour, Tourism Victoria Visitor Centre and the Victoria Conference Centre, The Parkside Hotel & Spa is the ideal choice whether you're traveling on business or pleasure. The Parkside's spacious one and two bedroom suites feature kitchenettes or full kitchens, separate living/dining areas, and bedrooms. All suites have furnished balconies and operable windows. Enjoy LCD TV's in bedrooms and living areas, electric fireplaces to create cozy ambiance and heated limestone tile bathroom floors. Enjoy local flavours, ingredients and produce at Tre Fantastico - the on-site caffe, a local favourite, with seating spilling out onto the Humboldt Valley streetscape. Complimentary wifi is available throughout the hotel."}