{"user_rating": 5.0, "review_count": 538, "name": "The Mermaid & The Alligator", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "I only wish the innkeepers, Dean and Paul, would create inns all over the world so I could stay in them everywhere I go! They have done a wonderful job with The Mermaid & The Alligator; truly, I did not want to leave. We took their every recommendation from restaurants to boat charters, and each one was just perfect. The concierges, Geri and Rebecca, were extremely helpful with activity arrangements. I can not imagine that there is a better place to stay when visiting Key West. If you love art, flowers, sweet (mellow) dogs and birds (in the garden), you will love The Mermaid & The Alligator.", "title": "A truly wonderful place to stay!", "user": "MaryHamm", "date": "March 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100295288}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We loved this place! The room was beautifully decorated and immaculately clean. Breakfast was wonderful each day and the service was outstanding. The location on Truman Ave was great -- away from the rowdiness but close enough to walk just about anywhere. Paul and Dean are very gracious hosts and their staff, especially Rebecca and Geri, helped make our stay the perfect birthday getaway. Key West has tons of B&Bs, some of them very nice, but on our next trip, I would change our vacation dates if this place were booked just to be sure to be able to stay there again.", "title": "Can't wait to go back", "user": "AuntCake", "date": "March 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100138043}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "this small inn is in a class by itself -- it's incredibly private feeling and magical. the proprietors are wonderful and suggested restaurants and excursions which all turned out to be exceptional! it's a perfect spot for couples -- very romantic! i wouldn't recommend it for kids (not sure they even allow kids), because the atmosphere is \"quiet and serene\". i can't imagine there's a better place in key west to wind down from it all.", "title": "peaceful paradise", "user": "lhalaska", "date": "March 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 100131445}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "My husband and I travelled from Pennsylvania to fabulous Key West and the Mermaid and the Alligator. I was so impressed with the photos I saw on their website, but no photo can capture the beautiful essence of this B&B. We truly felt as if we had arrived in paradise. Our hosts, Dean and Paul, were so wonderful, friendly, helpful with reservations, always nearby if you needed anything. Geri and Rebecca were very helpful in setting up reservations before we arrived (which I would recommend if you are travelling during busy season) for dinner and also massaages in their garden oasis. We stayed in the Sun Room, which was so beautiful (all of the rooms are beautiful) with a private deck. Caya and Havana, the M&A mascots, are so precious, and like their hosts, are very attentive to the guests! We missed our dogs a little less having them around each day. The gardens at the Mermaid and the Alligator are the most breathtaking I have ever seen. A delicious breakfast is served in the gardens each morning, where we met such great people who were staying there. The best part is after your day and evening, coming back to the heated pool in the gardens. Can't get better than that! If you want gorgeous, relaxing, friendly, immaculate, accomodating -- paradise -- the Mermaid and the Alligator is the place for you! We will be back next year -- can't wait!", "title": "Paradise Found!", "user": "CMay6", "date": "March 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99728590}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "I surprised my wife with a trip to Key West for her 40th Birthday. We stayed at The Mermaid & The Alligator B&B at the recommendation of my father-in-law who stays there annually. We absolutely loved it!! The house is beautifully decorated and the service is first-class. The breakfast each morning was delicious. The location is conveniently within walking distance to most everything in Key West. The concierge was able to secure us nightly dinner reservations on short-notice at some of the best restaurants (Seven Fish was our fav!) on the island. We will definitely go back - highly, highly recommend the Mermaid & Alligator!!", "title": "Mermaid & Alligator - the best B&B in Key West!", "user": "dswartz10165", "date": "March 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99396361}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We could only spend one night but this would be our choice if we'd return to Key West. Relaxing, beautiful gardens in a community that can be nerve racking at times and a staff that was very helpful in booking a sailing/snorkling activity as well as recommendations on local restaurants. I loved our room that was on the top floor and very private. And the dogs give it that homey touch if you're a dog person. I also forgot to mention the breakfast was pancakes, delicious! The staff serves a wonderful full breakfast that rotates everyday, we were told. All in all this was a wonderful but short stay.", "title": "Beautiful Gardens and Exceptional Service", "user": "kaceyeyes", "date": "February 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98147717}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled solo", "text": "Dean, Paul and Geri are the best. What a great atmosphere, thoughtfulness, laid back, private. Chose it to get me walking though neighborhoods in Old Town and not be the middle of the tourist area. A great refuge. They are fast to set up any reservation or event that you want to check out. Dean, I am coming back...a lot!!!", "title": "The Best", "user": "MaryAAAA", "date": "February 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98023919}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We took this trip to celebrate our 20th wedding anniversary and wanted a romantic place to stay. This was perfect for us. The inn is located in a nice area of Key West. Easy walking distance to everything. Our room was cozy. Breakfast was fabulous. The gardens peaceful and relaxing. The staff was terrific! Concierge's Rebecca and Geri helped us with plans prior to and during our stay. All of their recommendations were great. Dean and Paul were gracious hosts plus Caya and Havanna made us miss our own pooch that much less. We would definitely choose the inn again.", "title": "It was delightful", "user": "saxwoman63", "date": "February 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97374072}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Good location for all that Key West has to offer. Tropical garden and spa area is beautiful setting for morning coffee and breakfast (vegetarian). Walking distance to places of interest and restaurants. Staff is very helpful. We would definitely stay there again and recommend to others.", "title": "Ideal Key West Setting", "user": "JimD112", "date": "February 16, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 96887862}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Our recent stay was our second at the Mermaid & Alligator. One of the nicest features is the free parking on site. In Key West parking is often difficult. The breakfast offerings changed daily and were always tasty. I'm sure we will return many times. We were able to walk everywhere we wanted to go in Key West. We only drove our car to travel up the Keys to fish.", "title": "We love the Mermaid & Alligator!", "user": "Kathy11786", "date": "February 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 96755658}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Our second visit to this wonderful home was just as amazing as we remembered. The room was spotless and charming while Rebecca and Geri's concierge service was 5 star. We met both owners, Dean and Paul, who create an intimate and relaxing environment for their guests. Nothing is too much trouble for any of the staff who are able to provide numerous recommendations for activities and dining options before securing any reservations you may require. The layout of the poolside breakfast area allows you to meet fellow guests while enjoying delicious food but there is plenty of space for quiet relaxation if that is what you choose. We cannot speak highly enough of this fabulous place and encourage anyone wanting to discover Key West to stay at this lovely B&B. We will be returning soon!", "title": "Paradise - it's that simple!", "user": "EvanAndChrissie", "date": "March 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 99128366}, {"rating": 5.0, "title": "What and Outstanding Bed & Breakfast!!!", "text": "My wife spent a lot of time investigating beautiful accomodations for our winter vacation in Key West - and nailed it. The innkeepers (Paul and Dean) and their wonderful staff made sure that we received the best service imaginable in the idyllic setting of the Mermaid and the Alligator. The gardens, the house, the flora, the ambiance, the food, the atmosphere, the attention to details ALL made this the best choice for us. The location was ideal for us too - within very easy walking distance of the action of Key West without being disturbed by it when we wanted to sleep. Their knowledge of attractions was fantastic. The access to the attractions were made easy because of the staff's willingness to help immediately. We could go on ... but suffice to say, when we visit Key West again, we will stay at this Inn again.", "user": "Clint071", "date": "March 6, 2011", "id": 99109161}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We stayed at Mermaid and Alligator for 4 nights. The Caribbean Queen Suite was fabulous! Our room was spacious, well appointed and comfortable. The balcony that led out to the front, overlooking Truman Ave,was a great place to relax and drink our morning coffee. The staff/owners were so great! It was almost like they appeared when you needed something, We loved our stay! We highly recommend it!!", "title": "Magical place", "user": "Netplay61", "date": "March 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 98869343}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "My husband and I stayed in the Treetop Suite for our honeymoon. Everything about our stay was fantastic. The room was well decorated and very private. The breakfasts in the garden were delicious and the 5:00 wine hour was a nice touch. The staff at the Mermaid and the Alligator have thought of everything. We can't wait for our next stay!", "title": "Private getaway in the middle of Key West", "user": "kschou", "date": "March 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98714853}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The Mermaid & The Alligator was perfect, with Dean and Paul having mastered the art of giving their guests what they need, even before the guest knows they need it. They pay great attention to detail in every respect, from a tastefully decorated environment, to complimentary sunscreen (for a fishing trip they arranged for us), to a delicious breakfast to start each day. For those guests going through \"pet withdrawl\", they provided those too - with their two adorable labs, Havana and Caya. When we return to Key West, we'll be returning to this B&B. Keep up the good work, guys.", "title": "Exceeded Expectations", "user": "Cliff31", "date": "February 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98309277}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Our stay at this B & B was exactly what was needed to escape the ever present cold, snow cover and ice of the Northeast. The Mermaid and The Alligator is a private oasis in itself. The foliage, shady palms and private sitting areas in the back yard area were a wonderful retreat including lounge chairs, plentiful cushioned seating, a screened-in tent or porch area, all with beautiful flowering plants, fountains and chirping birds.", "title": "Eased the Winter Blues", "user": "kasey363", "date": "March 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101557186}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We stayed for a week in the Bamboo room – which is its own separate cottage. We really enjoyed the seclusion, we had our own covered private porch with chairs and tables and a private entrance. The room itself was extremely spacious, with a good size “living room” and the bedroom off to the side. The eclectic furnishings were great, with polished wood floors and bamboo ceiling. It was all tastefully decorated with plenty of closet and drawer space. Bedding and towels were high quality, very comfortable and daily housekeeping was excellent. Lots of details in decorating and nice features such as CD players and a noise/sleep sound unit (although nothing is needed, very quiet since cottage is on side street of property). Bathroom was small ( to some I guess) but entirely adequate, with a large two person tiled shower, slate floors, a pedestal sink , cabinet for toiletries and really plenty of space to move around (some people are just used to enormous bathrooms nowadays). Mentioned in other reviews were thin walls – but we there were other guests staying in the other two rooms connected in the rear side of this cottage (they have own entrances but share a common wall) and were never heard them at all.", "title": "Great place for a honeymoon (or any time).", "user": "Jsb2011", "date": "March 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 101320328}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "The main house was very nice, we never really had much use since we had our own cottage, but they do have a comfortable living room with large screen TV, plenty of touristy info available on hallway walls and menu books etc. This B & B had a lot of little nice touches (we stay in B & B’s quite often). Extra toilettes if some forgotten, plush beach towels for use in the backyard plunge pool and for taking to the beach; beach bags, mats, umbrella’s. There is off the street parking and a bike rack also (pick up great bikes two blocks away on Truman Ave – the best way to get around - $35.00 for 4 days!) There is a plunge pool and available internet/computer for all guests. They will also arrange massages in the screened in garden area. Staff was very pleasant and helpful our entire stay.", "title": "Retreat to a garden oasis...", "helpfulness": 1, "user": "SandyandMike131", "date": "March 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 101182136}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "The breakfasts provided were very good, not many still provide a hot entrée, and the weekly choices of various egg omelets or French toast type choices were excellent. Always hot coffee, teas, muffins with choices of jams and jellies, cereal, juices and fresh fruit. The late afternoon wine (red and white) set out along with snacks (chips, sometimes breads) was a welcoming touch to unwind in some peace and quiet in the outdoor “living room” area or various gardens. There was always an area of privacy to relax.", "title": "We felt as though we were at a spa.....", "user": "blakey25_11", "date": "March 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101162779}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We were very happy with The Mermaid and The Alligator, even in seeing and passing by the numerous accommodations choices as we explored Old Town Key West, I would certainly stay here for all of the reason noted above, as well as the fact that it only a few blocks away from the center of it all, and yet so far away from all the crowds and noise. Key West is small enough that you are really close to everything anyway, but places like this are an oasis in themselves.", "title": "I will definitely be back", "user": "Rosso27", "date": "March 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 100550413}], "location": {"country": "United States"}, "variance": {"poor": 4, "average": 9, "very good": 29, "terrible": 2, "excellent": 494}, "aka": "The Mermaid & The Alligator Hotel", "slim_ranking": 0.0412371134021, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "description": "Welcome to the casual elegance and style of a more relaxed age. Our beautiful circa 1904 Victorian Home, located in the heart of Old Town Key West, offers the warm hospitality of a traditional bed & breakfast while providing our guest a place to relax, enjoy the ambiance, and even shut out the rest of the world if you choose. Join us and feel at home."}