{"user_rating": 4.5, "review_count": 176, "name": "The Royal Hop Pole", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Can't fault this place. Got a great internet deal, and even though the wrong price was on the system reception honoured what I had been quoted without even asking for the print out.", "title": "Super little spot.", "helpfulness": 2, "user": "BillyMcBeard", "date": "January 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92099035}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Room was lovely with a tidy modern look, nice firm bed (a little on the small side) and the bathroom was spotless.", "title": "Good value & central location", "helpfulness": 1, "user": "AndyTaylor27", "date": "December 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 90511449}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Right in the middle of Tewkesbury, attached to the pub but with no disruption or noise. Garden is long and I imaginestunning on a sunny day, with the river backdrop. Tewkesbury abbey bells peel away across the way adding to the rural English idyl.", "title": "Nice hotel in centre of Tewkesbury", "helpfulness": 1, "user": "smurfett11", "date": "December 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 88743663}, {"rating": 4.0, "stay_parameters": "Stayed September 2010", "text": "The breakfasts in the bar room are cheap and fine. Brill little find.", "title": "Great Value Quirky Hotel which was ideal for us", "helpfulness": 1, "user": "Amberley46", "date": "October 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 84094717}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Have mixed views about Wetherspoons but having never stayed in one of their hotels and looking for somewhere after a long drive was pleasantly surprised.", "title": "Wonderful blend of old and new", "helpfulness": 1, "user": "lulubellcornwall", "date": "October 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 82743245}, {"rating": 4.0, "title": "Nice hotel in pleasant location, generally good value all round..", "text": "We stayed here as a last minute stop off on our way home from Somerset to Newcastle, as we have a 6 month old, to break up the trip. Booking process was easy and good price of £39 for double room ensuite. Hotel gardens and grounds very good, well kept and pleasant, very family friendly, we stayed on the night of the England/Germany world cup match and were apprehensive that the bar may be full of drunk fans etc - but quite the opposite, beer garden is large enough to have space to sit alone and bar was quiet and clean given the hot weather and how busy it must have been that day.", "helpfulness": 1, "user": "RMPNewcastle", "date": "June 29, 2010", "id": 69114609}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "Room was lovely, very large, travel cot already up as requested, fans going in the room (it was the hottest day of the year so far) which were appreciated but this point leads me to our one criticism - the room window was enormous, and did not open at all (as it led out on to a roof) which we understood - for Health and Safety etc. However on the hottest day and night of the year, it was almost unbearably hot, even with fans going. It made it difficult for us all to sleep, especially our baby son. We did not have a good night's rest because of the heat - given that the rest of the hotel had Air Con, it would seem reasonable to expect that if windows cannot be opened, that A/C be available in the rooms. It really was boiling!", "title": "Cheap and kinda cheerful but............................", "user": "Bothyman", "date": "June 7, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 66731814}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "Other than that, this was a great find, lovely room, comfy bed, clean, all as you would expect, but at a bargain price. Staff very friendly and helpful, communal areas clean and tidy. Lots of stairs though, which might not suit everyone, but we just carried our buggy and bits up stairs, it wasn't too bad, after all it is a very old building, and that is part of the charm, so can't really expect anything else.", "title": "Good budget accomodation", "helpfulness": 1, "user": "Lewis_England_9", "date": "June 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 66283314}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Lovely place to visit and would stay here again!", "title": "As good as expected", "helpfulness": 1, "user": "kateshill", "date": "June 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 66231640}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "On first impression it's well, impressive! Ancient hotel, recently refurbished, remarkable value for money, food varied and served at a time to suit oneself. Good Wetherspoon choice of cask ales but corners have been cut in the rooms, certainly in ours.", "title": "Excellent Value at a Historic Hotel", "helpfulness": 1, "user": "taf100", "date": "January 3, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52483060}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Stopped on a Saturday night. We have stopped at this hotel several times in the past before it became a Wetherspoons and we wondered what it would be like now they have taken it over. They have done an excellent job refurbishing it. Our room was spotlessly clean with everything we needed, bed and pillows comfy and room nice and warm all night. Staff were helpful and friendly. No-one was manning reception when we checked in/checked out but someone arrived within minutes and checking both in/out were carried out efficiently. Fortunately we had booked an evening meal at another hotel just down the road (The Bell - highly recommended) because we knew getting a table in a Wetherspoons on a Saturday night would be near impossible. (No problem if you are eating early, plenty of tables at around 5.00 pm). We did want to have a couple of drinks before retiring to bed but no chance of getting near the bar, by 8.30 pm the pub was heaving. We were worried that there would be no chance of having an early night with all the noise from the bar but our room was surprising quiet and we had no problems at all. Had breakfast the following morning, my husband has what he calls the \"big boy\" breakfast and boy was it big, huge plateful of food, all well cooked for just under £5. I had a toasted tea cake and cup of tea for £1.79. Food, drinks and room price all fantastic value for money. We will definitely stop here again, we were extremely impressed by the standard of our room, but if it is on a Friday/Saturday night we will book a table for an evening meal elsewhere.", "title": "Fantastic Value for Money", "helpfulness": 3, "user": "Cakesy", "date": "March 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101754782}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "I've stayed in Tewkesbury several times whilst down for the races at Cheltenham but none of the hotels have offered such good value for money!! Although our room was a bit on the small side it was clean and comfortable.", "title": "Great Value for Money", "helpfulness": 1, "user": "Lynne S", "date": "March 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 99045402}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The fact that you can choose as little or much as you want for breakfast has got to be a plus point.", "title": "Fantastic value", "helpfulness": 1, "user": "Paul-Suzanne", "date": "February 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98285097}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "As with all Wetherspoon pubs the choice of food and drink is endless.", "title": "Variable At The Hop Pole", "helpfulness": 3, "user": "TimASurrey.", "date": "February 8, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 95941209}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with friends", "text": "We stayed here for 2 nights, after a business trip. What excellent value for money. The staff were wonderful. We had originally booked in for 1night but decided to stay for second night, but there were no rooms left. The manager went out of his way to get a recently refurbished room finished for us that day and even went out and bought a new quilt for our bed. The room was furnished beautifully, and there was lots of hot water.", "title": "Great value for money, one of the best in Tewkesbury", "helpfulness": 1, "user": "keng810", "date": "January 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 93831294}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "stayed at the royal hop pole for two nights in august. booked two rooms - one a single and one double. both rooms were nicely furnished, with decor and furnishings that complimented the buildings age but still with all the mod cons (including large lcd tv). the single room was quite dark and had a very very small bathroom with a tiny shower but overall was very pleasant. the double room was alot bigger and brighter with a lovely bright bathroom.", "title": "beautiful historic building", "helpfulness": 2, "user": "kesandj", "date": "September 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 79554271}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "as with all wetherspoons both food and drinks are reasonably priced. the vegetarian in our party was extremely pleased with the menu. some of the bar staff were a little unfriendly but all of the staff associated with the hotel side were extremely helpful.", "title": "Good value accommodation", "helpfulness": 1, "user": "CraigJarvis", "date": "September 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 79189731}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "the hotel is ideally situated on one of the main streets in tewkesbury and is very close to the abbey. the free on site parking is a real bonus.", "title": "Historic Pub and Hotel!!", "helpfulness": 1, "user": "lala_tink2008", "date": "September 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 78637168}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "all in all a lovely place to stay.", "title": "Good value & suited us", "helpfulness": 2, "user": "Andychance", "date": "August 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 76009945}, {"rating": 5.0, "title": "Excellent value,excellent location,excellent staff", "text": "Stayed here for one night whilst visiting Worcestershire - nice place, steeped in history in a central location in the town.", "user": "gill3", "date": "July 7, 2010", "id": 70043935}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 2, "average": 16, "very good": 83, "terrible": 2, "excellent": 73}, "aka": "The Royal Hop Pole Hotel Tewkesbury", "slim_ranking": 0.285714285714, "description": "This well-known landmark is an amalgamation of historic buildings dating from the 15th and 18th centuries, known as a number of names, including The Crown during King Henry VIII's reign. However, eventually it was named The Royal Hop Pole when Queen Mary stayed in 1937 and gave it the official 'Royal.' Charles Dickens even mentions The Royal Hop Pole in his first novel, The Pickwick Papers. Other interesting information and pictures are located all over the hotel, including information on how the Medieval Banqueting Hall was discovered when the hotel was recently refurbished. The Royal Hop Pole has its own beautiful garden which leads to the banks of The River; there you can see picturesque views of the surrounding countryside and the Malverns."}