{"user_rating": 4.5, "review_count": 214, "name": "The Inn at Mill Falls", "reviews": [{"rating": 4.0, "title": "inn at mills falls", "text": "We went to the InnOct 4th &5th. We had been there before and really enjoyed it. We stayed in the new Church Landing building in the Harbor View room. It was absolutely beautiful. We had a birch canopy bed,window seat,fireplace,pull out sofa and balcony with a great view. We had dinner the first night at the Lakehouse Grill in Church Landing. The menu was limited, but the duck was very good. We had breakfast both mornings there for the convience. It was just Ok. The second night we had dinner at the Italian restaurant in the Boathouse. We had preferred seating at the window because we were guests at the Inn. It was very nice. The food at both restaurants was good, but not of gourmet quality. All the grounds are beautiful and a lot of detail. Great place to go to relax. We hope to go back for the New year's weekend package.", "user": "claudiale", "date": "October 17, 2006", "id": 5965000}, {"rating": 3.0, "title": "Nothing special", "text": "claudia", "helpfulness": 2, "user": "Heslomonik", "date": "September 19, 2006", "id": 5817309}, {"rating": 4.0, "title": "Very pleasant stay", "text": "somerset, mass.", "helpfulness": 6, "user": "brittaboo", "date": "August 11, 2006", "id": 5600340}, {"rating": 2.0, "title": "Don't complain about the housekeepers.", "text": "We spent 2 nights here towards the end of a 2-week trip around New England and New York. We decided to splash out a bit and book in here as we thought it would be worth it to stay somewhere nice like Meredith. The hotel staff were friendly, but the hotel itself is a bit outdated. Our room was full of floral decoration! The room was clean, but the shower was pretty old and there was a damp patch on our carpet. The room also smelt a bit of smoke despite being non-smoking. There was no coffee maker in our room, but you could get coffee from the lobby. Our air conditioning unit was really noisy which made it a bit diffcult to get a good night's sleep. Meredith itself is pretty to look at, but there's absolutely nothing else to recommend it. It has very few eating establishments, and they don't serve food very late (we struggled to find somewhere at 9pm that would serve us).", "helpfulness": 5, "user": "A TripAdvisor user", "date": "July 12, 2006", "id": 5458551}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The Inn at Mills Falls is actually four different inns around the town. Much of the village of Meredith is some how affiliated with the Inn, so it almost seems like a little Disney Land... The room was nice. Close to everything. Pretty clean.", "title": "Nice Inn...", "user": "Leaudemiel", "date": "August 28, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8522490, "likes": {"liked": "— Location", "disliked": "— We were the youngest people there (we are 30!)"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Just by lake Winnipesawkee, lots of shops and things to do from the Inn. We took the Mount Washington Full Moon Cruise at Weirs Beach (recommended) just a short drive away. We visited the Castle in the Clouds (tourist trap, but interesting) from this location. Very scenic views from Conway to Lincoln.", "title": "Wonderful location, right by the lake", "helpfulness": 2, "user": "GlobalTerrain", "date": "August 15, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 8429324, "likes": {"liked": "— Lots to do in walking distance", "disliked": "— you still have to drive to Weirs Beach"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We have our best breakfasts here at the Waterfall Cafe (small, busy, outstanding food and service). The first breakfast was quiet, few people, super nice. We decided after that meal to go there the next day (as the Inn offers on breakfast). The next meal was equally excellent, but they had a staff crisis (which they quickly fixed), and the place was at capacity with demanding tourist. Still highly recommended (go early!)", "title": "Want to go back", "helpfulness": 1, "user": "Momofpreteens", "date": "August 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8392465, "likes": {"liked": "— Proximity with shopping and dining", "disliked": "— That we were not able to get our reservations extended"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "Mill Falls is one of several large Inns that is part of a tourist network, composing of a system of Inns, resturaunts and shops. Focused on Lake Activities. It took us a about a full day to experience this strip of local memorabilia shops, etc. During checkin they gave us a card that you can present to most any business and have your purchases charged to your room. On our way out we just mentioned this to the local gas station and they have us a discount on the gas.", "title": "Not what it used to be", "helpfulness": 4, "user": "jl", "date": "August 2, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 8279678}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "This is a very polished, tourist district that does what it says it does, very well.", "title": "Great place to stay", "helpfulness": 1, "user": "darkrider", "date": "March 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7214412, "likes": {"liked": "— cleam room, helpful staff, nice place", "disliked": "— nothing"}}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 8, "average": 15, "very good": 61, "terrible": 1, "excellent": 129}, "aka": "The Inn At Mill Falls Hotel Meredith", "slim_ranking": 1.0, "description": "At the heart of Meredith Village the Inn at Mill Falls awaits you. A restored nineteenth century linen mill and a tumbling forty-foot waterfall create a setting that envelops guests in an atmosphere of warmth, comfort and easy relaxation. By combining old-world charm, a crackling fireplace, cozy nooks, an indoor pool and sauna, and affordable accommodations, Mill Falls redefines the traditional country Inn. Stay at The Inn and enjoy all of the amenities that Mill Falls at the Lake has to offer."}