{"user_rating": 3.5, "review_count": 259, "name": "The Garden Vista Hotel Palm Springs", "reviews": [{"rating": 4.0, "title": "Gorgeous grounds, updated rooms", "text": "The biggest perk about this hotel are the grounds. The courtyard is absolutely gorgeous, with a jawdropping view of the San Jacinto mountains, and impeccably maintained gardens. Two big pools and two hot tubs, one set adult only, and one for families with children. Very lush!", "helpfulness": 1, "user": "palapi", "date": "February 18, 2007", "id": 6810049}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled solo", "text": "The rooms are also fairly recently renovated, in tip tpo shape, super cozy beds, very spacious and clean.", "title": "Hotel in the shadow of Mt San Jacinto", "helpfulness": 7, "user": "LadyTravel", "date": "November 20, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6157951, "likes": {"liked": "— Separate adult and family pools; complimentary breakfast available", "disliked": "— Outside cooridors, no elevators."}}, {"rating": 2.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "Although the location is not good if you want to be able to walk anywhere, it is convnient for getting around the city via car. It's a five minute drive to downtown, a 10 minute drive to the indian canyons, 5 minutes to the tram.", "title": "Fine if you have no neighbors...", "helpfulness": 5, "user": "dmc10662", "date": "November 18, 2006", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 6150317, "likes": {"liked": "— The Bakers Square restaurant across the street", "disliked": "— ratty beddings, tile floors, thin walls, noise, not a good neighborhood for walking,"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "I arrived at the Shilo Inn Palm Springs (Nov. 14th) after a flight from the east coast to LAX, and a drive out to Palm Springs. The hotel was relatively easy to find. It was dark when I arrived. The front desk person was friendly and gave me a map of the property where parking and my room would be located. Parking was not a problem.", "title": "Enjoyed our stay", "helpfulness": 12, "user": "Gioia1976", "date": "May 30, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 5235749}, {"rating": 5.0, "title": "Outstanding!", "text": "The room was very clean. It was almost a \"U\" shape to it... with the door, bathroom door/area, bedroom, TV on one side; breakfast nook and kitchenette on the other. The balcony door was at the end of the U. The air conditioning seemed to work very well. The view from my balcony was a wall, and the view from my front door was the parking lot and the place next door. But the view didn't matter as much to me as room cleanliness did. And I found it very clean.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "April 28, 2006", "id": 5016989}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "My boyfriend and I stayed here after reading the reviews. The grounds are beatiful, it is close to the downtown area, they provide continental breakfast, they have a fitness room with sauna and steam room, they have a quiet adult pool and a \"loud\" pool for kids, the rooms are clean and big....What else could you ask for??? Since it is spring break the rate was $150 which is still reasonable. The pool even provides large towels for lounging. I don't have any complaints. I love the tiled floors in the room and the decor is nice. We got the room with the \"pool patio\". Some of the patios have grass out front, unfortunately our patio has rocks in front of it and we really do not have a view of the pool. Personally, that does not matter to me, and I like being on the ground level with a few chairs to sit on outside. I would reccomend the ground floor, but ask for a room with grass outside the patio. Also, make sure your patio does not face the kid pool. Especially if you want some peace and quiet.", "title": "We will be back!!", "helpfulness": 8, "user": "egen", "date": "April 22, 2006", "detail_rating": {"cleanliness": 4.0, "rooms": 4.0, "value": 4.0}, "id": 4995241}, {"rating": 4.0, "title": "Great place at a good price", "text": "The grounds are beautiful, the rooms are nice and the service is good. The hotel is on the north end of town, so it's less noisy. Great for families.", "helpfulness": 7, "user": "MplsDon", "date": "April 9, 2006", "id": 4953342}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "I booked a room at Shilo Inn based on reviews and location. We were stopping overnight on the way back from Arizona and wanted to take the kids up the tramway. Location was great and Billy Reeds across the street was very good for dinner (nothing overly fancy, but good food at good prices)", "title": "Not what I expected", "helpfulness": 1, "user": "juxie", "date": "April 11, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 7331420, "likes": {"liked": "— quiet large room, good family pool", "disliked": "— smoking every where"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "When we went to check in - there were 5 people in line checking in / checking out, one frowning lady working and four employees standing behind her talking to each other not acknowledging a single guest. Eventually another employee came out to help. We check in to our room - it was \"okay\" - very. very dated, had a funny smell to it, dents in the door (obviously a spring breakers fist fight or something), the bath room was \"clean???\" it was old and discolored, but I think it was overall clean).", "title": "Great", "helpfulness": 1, "user": "sewinginny", "date": "April 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7271990, "likes": {"liked": "— location"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "We had to ask for the roll-away bed 3 times before it arrived and they brought it without a pillow (another 2 calls) - and they do charge $15 a night for it so it isn't a free service. bed okay - a little on the firm side, a little lumpy too, pillows typical hotel pillows, towels for the pool a joke (bring your own), it wasn't even big enough to wrap my 1 year old in and they were worn thin in many places.", "title": "Great Family Place", "user": "SoccerMom1059", "date": "March 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 6936556, "likes": {"liked": "— that no one in our group complained!", "disliked": "— The tile floor in the room"}}, {"rating": 3.0, "title": "Only one problem . . .", "text": "Complimentary breakfast - it's free so I won't complain and it worked for the kids. The had bagels, mini apple danishes, cream cheese, butter, jam (that they ran out of), a juice machine, milk and yuban coffee. There was only one couch, two chair and a window bench area to eat at", "user": "BirdOnTheGo", "date": "March 4, 2007", "id": 6911578}, {"rating": 4.0, "stay_parameters": "Stayed February 2007", "text": "MAIN COMPLAINT", "title": "Definitely would go back again", "helpfulness": 1, "user": "Chrisaf", "date": "February 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 6819860}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 23, "average": 31, "very good": 101, "terrible": 29, "excellent": 75}, "aka": "Shilo Inn Palm Springs Hotel", "slim_ranking": 0.742857142857, "description": "The Garden Vista Hotel Palm Springs, a 100 percent smoke free hotel, offers affordable rooms and suites in Palm Springs, home of over 100 golf courses. For onsite recreation, guests will find an outdoor adults only pool, outdoor family pool, two whirlpools, a sauna, steam room, and fitness room. Guests receive a complimentary continental breakfast with their room rate. While there is not a full service restaurant inside the hotel, there are dining destinations nearby. Guests will find Billy Reeds Restaurant and Lounge across the street, Bakers Square in one block, and many more restaurants within a short drive. Conveniently located on Highway 111 close to downtown Palm Springs and the aerial tramway. You will find yourself surrounded by luxury in each of the 124 exquisitely appointed suites at this lovely hotel situated amidst beautifully landscaped courtyards and pools. Children 12 and under stay free with an adult. Dogs welcome with nominal fee. The Palm Springs airport is approximately four miles from the hotel. There are 124 rooms, including suites, on two floors. Standard amenities include air conditioning, alarm clock radio, microwave, mini refrigerator, coffeemaker, hairdryer, iron, ironing board, telephone, free local calls, and television with ShowTime"}