{"user_rating": 4.5, "review_count": 259, "name": "The Captain's Club Hotel", "reviews": [{"rating": 3.0, "title": "Review of Spa & Restaurant", "text": "As I live locally I have been able to frequent this establishment on several occasions. I have seen the rooms - they are beautiful, fresh and new, as is the rest of the building. It really is something special to look at both in and outside. The atmosphere is perfect; refined but not too stuffy.", "helpfulness": 7, "user": "LisaMJ", "date": "December 6, 2007", "id": 11281938, "likes": {"liked": "— Restaurant", "disliked": "— Spa"}}, {"rating": 5.0, "title": "captains club fantastic", "text": "Lets get the negatives out of the way. My husband and I used the spa after receiving gift vouchers. We both booked a one hour treatment. I'd say it's pretty fair to expect about 50 mins worth of actual work when booking a one hour treatment.We used the jacuzzi prior to the treatment which with it's black, slate type tilings and serene atmosphere was lovely. The young girl said there was something wrong with the sauna and it was running quite cool (for a sauna anyway). My husband's treatment was a 4.15pm. When he hadn't been called for at 4.25pm he asked if he'd got the time right. He was told he had and that they were running a little behind. No problem. At 4.35pm he was called and after the usual de-robing etc the treatment started at 4.40pm. After resurfacing to the pool area, he realised his 1 hr (and very half-hearted massage lasted 35 minutes, \"The worst I've had\" he said). Thinking perhaps they'd thought he had booked a 30 min treatment he left it until we came to pay to see what he was charged. My 'wrap' was nothing short of pathetic. I was basically lightly rubbed in lotion for 15 mins, not even all over, and then loosely wrapped and left for another 25 mins. It really was dismal, and dare I say it, most likely due to the young, fresh of out beauty college, dis-interested staff they had. They really did look like they didn't want to be there. When charged for the full 60 min massage, my husband complained that it was 35 min. She tried to deny it at first, but upon asking for the supervisor was offered £20 off. Pro-rata it was still a rip off but at that point we just paid and vowed never to visit the spa again.", "helpfulness": 5, "user": "lovethebeach43", "date": "November 23, 2007", "id": 10997109}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The restaurant however is their shining star in my opinion. Of the several dinners I have had there, I have never been disappointed with the quality and presentation of the food. A wonderful atmosphere, superb decor, quality cuts of meat, imaginative creations AND generous portions - I'm in heaven when dining at the Captain's Club. Their desserts are to die for, with particular mention going to a '3 part' dessert I had last week consisting of an iced butterscotch torte, sticky toffee pudding and crispy banana filo parcels as one dessert, yet somehow each marrying together wonderfully. The food, along with a great selection of wine and Taittinger as their house Champagne really puts them as the best fine dining in the area in my opinion. There are a couple of very, very small things that I noticed that wouldn't happen in, say, a top London restaurant. That is, having to chase wine after the meal was served. The wine or water has never once been topped up by the wait staff during any meals we've had there, and you usually have to ask them to take your coat or jacket. As I said, these are minor things and do not detract from the overall dining experience, but to someone who loves fine dining and service that bowls you over, it was noticeable.", "title": "Great location & views", "helpfulness": 4, "user": "juanberto", "date": "November 21, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "business": 3.0, "cleanliness": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10964622, "likes": {"liked": "— good service and hotel position", "disliked": "— air con noise!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "If looking for something better than the rest, be it for a stay or for dining, I whole-heartedley recommend the Captain's Club hotel and/or restaurant. I can't say the same for the spa, but perhaps we were unlucky. 5 stars for the hotel & restarant, 1 star for the spa, hence the 3 star average rating.", "title": "Modern Hotel, Great Location", "helpfulness": 3, "user": "Miller123", "date": "October 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10382631}, {"rating": 5.0, "title": "Lovely location", "text": "We booked to stay at this hotel for an overnight stay, the greeting when we arrived was great we felt really special, after being shown to our room and it was not ready, we was taken to the lounge and bought a drink whilst we waited. On going into our room we found we was in a suite, we had booked a double room, I rang reception and they said you have been upgraded because we have no doubles left and there will be no extra charge. The suite was brilliant, the furnishings and the finishing", "helpfulness": 2, "user": "PassingCloud", "date": "October 24, 2007", "id": 10295981}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "My wife and I stayed 4 nights at the Captains Club Hotel in September 2007. It is a modern hotel (opened November 2006) located beside the River Stour about a 10 minute riverside walk from the centre of Christchurch. Our booking was for dinner, bed and breakfast which we found to be good value.", "title": "Modern hotel in lovely riverside location", "helpfulness": 1, "user": "Pinner Traveller", "date": "October 1, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10025931, "likes": {"liked": "— River views from the hotel, restaurant food and location in relation to the centre of Christchurch."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Our stay started with us requesting another room as the one initially offered didn’t have the frontal river view we were expecting. This request was dealt with very efficiently and we were offered the room next door which had both great views of the river and was much bigger. We did have a few minor problems with the room (couldn’t make phone calls externally and desk lamp not working) which we reported but they were never resolved during our stay much to the embarrassment of the hotel reception staff who were very apologetic.", "title": "fantastic", "helpfulness": 2, "user": "adedonnelly", "date": "September 23, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8864829, "likes": {"liked": "— The bedroom size and view", "disliked": "— the flushing toilet"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The ground floor of the hotel is mainly ‘open plan’ with the reception area leading into the bar / lounge and then through to the restaurant most of which looked out onto a large patio area overlooking the river. On two of our evenings we struggled to find anywhere to sit before dinner which was disappointing and a lounge for residents would be a useful addition to the hotel.", "title": "Outstand Hotel in every way", "helpfulness": 3, "user": "loobys", "date": "September 10, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8687015, "likes": {"liked": "— The cleanliness andspacious rooms", "disliked": "— The pool being Hydro therapy and not always available to use"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We had very enjoyable dinners all four nights and the standard of cooking is high. The menu has an emphasis on fish and local produce all of which is well prepared and presented plus there is a reasonable selection of affordable wines. Most of the restaurant staff were young and enthusiastic with their keenness to please making up for their relative inexperience. Every evening the restaurant was busy with many of the diners being non residents.", "title": "Family stay with 2 kids and a dog!", "helpfulness": 2, "user": "Jim_Windsor", "date": "August 15, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 8425749, "likes": {"liked": "— Loads of room, and the electric blinds over the porthole window entertained my 3 year old!"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Lovely restful weekend spent at this hotel , wealking distance into christchurch and fab views onto the river! The rooms were immaculate nothing was too much trouble for the staff. Food was beautiful. My only gripe was that we could not book into the restuarant and had not been warned on booking- make sure you book- it is very popular with the locals. We did manage dinner in the bar which was nearly as good", "title": "Fab Atmosphere- chilled out", "helpfulness": 1, "user": "surreysarahjk", "date": "August 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 19107525, "likes": {"liked": "— everything", "disliked": "— air condition a bit cold but soon sorted"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Booked this hotel on last minute.com and what can i say apart from perfect in each and every way, from the moment we walked through the door we were greated by the nicest staff ever who couldnt do enough for us. The room was spotless and modern with a plasma tv and a fantastic bathroom, and lovely views over the river through the 3 floor to ceiling windows. This is a must go to hotel excellent.", "title": "excellent hotel", "helpfulness": 1, "user": "mattbowers80", "date": "August 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18855369, "likes": {"liked": "— everything", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "After reading great reviews expectations were high.", "title": "love the Captains Club", "helpfulness": 2, "user": "dexterBucks", "date": "June 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "rooms": 5.0, "location": 5.0}, "id": 17358024, "likes": {"liked": "— High quality and Chic", "disliked": "— no complaints"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Check in was a breeze and we were shown to our suite. This is a proper suite. 2 bedrooms 2 bathrooms lounger/diner/kitchen. All high tech and contemporary chic. Actually we spoke to a local who said the original plan was to sell these suites as apartments.", "title": "Almost perfect", "helpfulness": 3, "user": "BobandAnnie", "date": "April 14, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 15021416, "likes": {"liked": "— Modern luxury", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The windows are floor to ceiling glass with great views over the river. we had free use of the pool/sauna area. this is best described as a small pool or giant jacuzzi. Although small it is perfectly formed. There is very little seating area (4 beds to be precise) this wasn't a problem as it was empty but could be a frustration at busier times.", "title": "Nice modern hotel", "helpfulness": 4, "user": "corstan", "date": "April 7, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 14866007, "likes": {"liked": "— clean modern hotel", "disliked": "— nothing"}}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 16, "average": 17, "very good": 54, "terrible": 5, "excellent": 167}, "aka": "Captains Hotel Christchurch", "slim_ranking": 0.4}