{"user_rating": 4.0, "review_count": 272, "name": "The Tides Inn", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We had a room with a view, it was nicely furnished and laid out. Breakfast was self-serve, cereal, yogourt, fruit, etc. We stayed two nights and were quite satisfied. We did a short drive to Rocky Harbour for evening meals.", "title": "Nice room, simple breakfast", "user": "rnathan", "date": "October 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 180074234}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Tides Inn was a great place to call home for our 3 day visit to Gros Morne. Room was very new and clean. Beautiful views of Tablelands and the surrounding area. Norris Point is a quiet area - one could sleep with the window open.", "title": "Clean, spacious - great location", "user": "Onyx65", "date": "August 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 170618128}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We were a little taken aback when we drove up to this place as it sits right on the side of the road. The tide was out in the cove, so that view wasn't too lovely at the time, either, but once we opened the door, we were pleasantly surprised.", "title": "Like brand new!", "helpfulness": 1, "user": "mcconnellboys", "date": "August 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 170367534}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "I don't know whether or not this is a new or recently renovated property, but it was certainly in good condition when we visited. We had a deck overlooking the cove with a lovely view (once the tide came in). Across the street there are a couple of churches and their cemeteries. A short walk in that direction allows you to view another cove and the tableland area of the park, complete with snow fields still present in summer.", "title": "Beautiful view.", "user": "inukshuk108", "date": "July 16, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 167795198}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "The room was beautifully appointed and the dining area gave our family of four room to spread out (a small love seat might be nice to sit on, too, since the room is certainly large enough to accommodate it). The fold away bed my younger son used was very comfortable (not always the case with such beds - a couch that makes a bed might be useful).", "title": "Beautiful rooms and calm location", "helpfulness": 2, "user": "Brittany T", "date": "October 28, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 4.0, "service": 3.0, "rooms": 5.0}, "id": 143916685}], "location": {}, "stars": 4, "variance": {"poor": 18, "average": 27, "very good": 75, "terrible": 8, "excellent": 144}, "aka": "The Tides Hotel Irvington", "slim_ranking": 1.0, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "On a lush peninsula in Virginia’s historic Northern Neck, the waterfront Tides Inn has welcomed generations of friends and families who cherish the relaxed pace of local life and the Southern hospitality of our staff. Guests can learn to sail at the on-site sailing school, or explore the calm waterways via kayaks, canoes and paddleboats, frequently spotting bald eagles, osprey and herons. The 18-hole Golden Eagle golf course is a pleasantly challenging wooded course with water hazards, and there is also a Par-3 course, tennis, croquet, and spa, plus bicycles for pedaling into town. Our farm-to-table cuisine highlights oysters from the nearby Rappahannock River, and we’re located on the Chesapeake Bay Wine Trail with several Virginia wineries nearby."}