{"user_rating": 4.5, "review_count": 414, "name": "The Beaufort Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Fabulous location- around the corner from Harrods,within walking distance to other major attractions(Buckingham Palace,Museum of Natural History. Staff were extremely helpful & pleasant.Rooms were very comfortable.", "title": "Wonderful", "user": "Jeffshak", "date": "August 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 73912063}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "After a 9+ hour flight , we were greeted with a tray of tea and still warm scones. Everyone could not have been more helpful- from making dinner reservations,getting theatre tickets to suggesting guides for our excursions. We stayed in a jr suite which was perfect for us as we were 2 adults and 1 child. The location was great for shopping and connecting to the underground. We will definitely come back to this charming, small hotel. By the waym Racines restaurant (2 blocks from hotel) is lovely and wonderful food.", "title": "Absolutely Fabulous", "user": "mimimutt", "date": "August 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 73748703}, {"rating": 5.0, "title": "Fabulous service and location", "text": "Travellers can sleep anywhere---to stay at the Beaufort is to be on vacation. The charming hotel is in Knightsbridge on a quiet street but close to tube, bus, Harrod's and museums. A perfect location for the solo traveller---secure but not remote. What sets the Beaufort apart is the gracious staff who respond to every request---directions, recommendations, booking tours...whatever assistance is needed is immediately taken care of. I found them to be helpful by phone and email before I arrived and equally responsive while I was there. The rooms are small but there are nice lounge areas available; room service breakfast is a great way to start the day. I can't wait to return!", "user": "MaryC70", "date": "July 31, 2010", "id": 73172310}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "On a spontaneous trip to London during Wimbledon and World Cup, during the peak of the tourist season, we selected the Beaufort Hotel due to its central and quiet location in Knightsbridge, where we typically like to be whilst in London. Past visits have included stays at well rated hotels including the Draycott and Egerton, and our research on the Beaufort made us comfortable enough to book directly. Out total stay was to be eight nights, so we were concerned that the hotel and the service had to be to a standard which would make us comfortable without being overly fussy. The Beaufort fit the bill nicely, and overall, we had a nice experience at this intimate hotel.", "title": "EXCEPTIONAL LOCATION AND SERVICE IN THE HEART OF LONDON", "helpfulness": 1, "user": "George R", "date": "July 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 70352683}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "The main positives included the exceptional location on a quiet, dead-end tree lined street just off Brompton Road and very close to everything, yet maintaining a true residential feel. There were once three or four hotels on this cul-de-sac, but due to conversions to high end flats, there is only one remaining, and that is the Beaufort. All cabbies know where it is, so the location is proven and ideal. Another plus was the staff - they really worked hard to please us, but were not officious or affected in any way. Most of them – like almost all London hotels - are from Eastern Europe, and they are always trying to make your stay as enjoyable as possible. On more than one occasion, they obliged with a smile when asked if we could still have the complimentary afternoon tea with hot scones at 7:30 P.M. – together with complimentary champagne brought up to our room. While there is no restaurant, the hotel serves daily breakfasts in your room if you like, or in a small breakfast area in a nicely appointed below grade room that doubles as a meeting room and business centre. The lady who makes and delivers the breakfast has been doing so for over 12 years, so she has it down pretty pat – it is a nice offering with adequate variety at a reasonable price.", "title": "Excellent quiet location only yards from Harrods", "user": "x8mca", "date": "July 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 70260823}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "I ended up booking this hotel online at the very last minute as the hotel I'd been booked at mysteriously failed to have my booking, were full and this was the only alternative that was walking distance from my office.", "title": "Really delightful", "user": "MatthewGreen", "date": "October 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 85242934}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Turns out that fate was on my side as it was completely charming. Essentially a large smart Knightsbridge townhouse which has been converted into a charming boutique hotel with a real feel of home away from home and friendly helpful staff.", "title": "great big city hotel", "user": "skyislandf", "date": "October 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 85225021}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The room was very spacious, elegant in a homely way, clean and comfortable although mine was in the basement and with the lobby above sadly resulted in a bit of noise coming through from people walking above. The only other dissappointment was the lack of TV channels and when travelling alone on business you do tend to watch a bit of TV!", "title": "Well located with great service and amenties.", "user": "Petal7000", "date": "October 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84159781}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled solo", "text": "Be aware there is no restaurant but they do offer room service in the form of meals which are delivered from local restaurants. It's an arrangement which seems to work well and I had a lovely Thai dinner in my room one evening.", "title": "Wonderful staff, wonderful location, wonderful experience!", "user": "jules12367", "date": "October 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83975726}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "To summarise, it was pretty close to perfect and I'd definitely stay again.", "title": "Great Location.", "user": "Aloonak", "date": "October 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 83765893}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Hubby & I booked this hotel for six nights in early October. We arrived early in the morning, jet-lagged and tired. The hotel had arranged for a driver to pick us up, which was a wonderful & relaxing way to enter London. We were offered tea & croissants in the lounge downstairs, where we relaxed for an hour or two until our room was ready (early, which, again, much appreciated). Our room was absolutely lovely - high ceilings, beautiful 12-foot windows which opened out on to a gorgeous little terrace. When we asked if staff could find us some chairs so we could sit on the balcony, they quickly did. The room was large (by European standards), brightly decorated and clean. Bathroom had a lovely deep tub, perfect for relaxing after a day of sightseeing. Breakfast is served in the rooms, and was varied and always on time, if not early. Staff was friendly, efficient and always went the extra mile, whether it was for ice or information. The 24-hour complimentary juice, water, soda, tea & coffee were also much appreciated. Loved the neighbourhood, near many pubs, shops, and restaurants, and within easy walking distance from both Knightsbrige & South Kensington tube stations. On the whole, a wonderful hotel, we will definitely return (and stay in the same room!).", "title": "Wonderful hotel", "user": "ice_rider", "date": "October 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83516305}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "We were 3 women spending a weekend together in London. The Beaufort Hotel was an excellent choice. The location is fantastic. Only a few steps away from Knightsbridge, Kings Road and Sloane Street. A busy area, but once you turn into Beaufort Garden you feel like having arrived in an quiet oasis. We had a Junior Suite for the three of us where we had plenty of room for us and our shopping bags...", "title": "Small boutique hotel with great service", "user": "superflo_ch", "date": "October 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 83286149}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "But the thing which makes the real difference is the staff. Everybody was extremely friendly and helpful. We will definitely return.", "title": "Beautiful boutique hotel - charming, home-like atmosphere. Heaven.", "user": "londonreview2010", "date": "September 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 81167366}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Gorgeous little hotel in a peaceful, tree-lined street yet in a very convenient location. Excellent service, great rooms. All in all, a wonderful hotel that felt like home away from home rather than a hotel.", "title": "Wonderful location with the best front office staff.", "user": "NielStellenbosch", "date": "September 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 80920660}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "This was our 4th stay and once again a wonderful experience..The location is very good and Beaufort Gardens is very quiet. Everyone is exceptionally friendly and helpful and a stay there feels like home from home. Scilla is a great asset to the Beaufort.", "title": "Luxurious, comfortable, great service and perfect location", "user": "bellalouise1", "date": "September 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80367760}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "I booked the hotel as a special treat for my fiance's birthday. It cost £200 for one night, which is what it cost me the week before for 6 nights in an extremely good 4* in Milan.", "title": "Nice with quite a few disappointments...", "user": "traveller_lou", "date": "September 2, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 78020876}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Positives:", "title": "Teriffic hotel, staff & location!", "user": "nyknicksfanatic", "date": "August 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76988865}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "Lovely design, spotlessly clean, trendy.", "title": "Great Hotel Experience", "user": "Phil_Planidin", "date": "August 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 76708325}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Ideal position in Knightsbridge, nice restaurants nearby etc.", "title": "Pleasant, with reservations", "user": "CharlieCB", "date": "August 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 74072768}, {"rating": 5.0, "stay_parameters": "Stayed July 2010", "text": "free drinks between 3-11", "title": "A wonderful stay with hospitable staff.", "user": "couple186338", "date": "August 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74035825}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 4, "variance": {"poor": 16, "average": 27, "very good": 109, "terrible": 18, "excellent": 244}, "aka": "Beaufort Hotel London", "slim_ranking": 0.148698884758, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "This friendly, attractive boutique hotel enjoys a peaceful location in a tree-lined cul-de-sac just a few minutes walk from the famous department store Harrods and Hyde Park. Direct link from Heathrow airport. All 29 bedrooms have air-conditioning and have been thoughtfully furnished. Wifi complimentary, and 24 hours soft drinks available free of charge together with afternoon cream tea with home baked scones."}