{"user_rating": 3.5, "review_count": 304, "name": "The Oxford Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Staying at the Oxford takes the sting out of being away from home.This was my second stay. It's more like being in a grand old house -- the intimate feel of the lobby, plush carpet in the hallway that cushions your feet, the real doorknobs with tassels on the keys, and the wonderful robe and cushy bed to relax in after a busy day. The staff instantly greet you with a smile and a familiar greeting. Having room service is like being treated on a special occasion. I appreciate the Oxford's uniqueness --putting it miles ahead of the cookie-cutter look and feel of the chain hotels. The location is ideal. Easy walking to Coors Field and the myriad of restaurants and shops on the pedestrian mall. The surrounding blocks are filled with restaurants and bars that could suit many tastes. Whether I want to stay in and unwind or join the life in the city, the Oxford is perfectly situated to deliver.", "title": "Soothes the savage beast of business travel", "helpfulness": 1, "user": "JulesMN", "date": "September 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118469246}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "From the minute you check in you feel welcome, our room was very large but it was hot and then cold never just right, the only thing we did not like was how much they charge for parking $28.00 that is nuts, the rooms cost a good penny so I feel parking should be free or a small fee..", "title": "nice but the parking cost", "user": "btaylorFla", "date": "September 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 118465557}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "great location lots to eat and drink around the hotel.", "title": "best of downtown", "helpfulness": 1, "user": "aspenron", "date": "September 13, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 118076886}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "The Oxford is a very historic hotel in the heart of downtown Denver. With in walking distance of the fillmore, coors field, Pepsi Center, and Elitch Gardens, oh don't forget Lo-Do(lower downtown. All within 5 blocks, and if you choose not to walk,they will provide limosine transportation.", "title": "A Great Place To Stay (For Business or Pleasure)", "user": "Dstory", "date": "September 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117797516}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Great amenities, elegant, great restaurant in Mccormicks, and a great bar, this is a don't miss igf you are in downtown Denver.", "title": "We fell in love with The Oxford", "user": "KimberlyP67", "date": "September 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117662052}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "We stayed at the Oxford Hotel for 2 nights and found it to be a very comfortable and pleasant place to stay. The staff were friendly and efficient and the room was well appointed and spotlessly clean. The beds and pillows were especially good and if the pillows didn't suite you there was a pillow 'menu' in the room so that you could get something more suitable! The hotel is in a great location for Coors Field and also the16th Street Mall which is a great place to walk, shop and eat and there is a free shuttle bus that runs the length of 16th so you can hop on and off. There is a nice feeling of calm when you step into the lobby and although the hotel has a reasonable amount of rooms it doesn't feel too big. My only gripe is that for us English people not used to driving in Denver we found it hard to find-this may have been made more tricky by road works and road closures due to Labor Day celebrations.", "title": "Lovely hotel in a prime location", "helpfulness": 1, "user": "jennilewes", "date": "September 3, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 117641473}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "First of all, the hotel was in a great \"central\" location in downtown Denver. We went to a Colorado Rockies game and the ballpark was only a few blocks away. In the other direction was the 16th street mall which was a pretty cool street open only to pedestrians for quite a few blocks. There were also many restaurants and shops nearby. The hotel itself was older but still very nice. Coffee was served on every floor every morning. The bed was very comfy. We had 2 flat screen TV's. The bathroom was updated but the showerhead was kinda funky, it just rained down on your head without a lot of pressure. The only negative things about the room were: no safe, poor view out the window, and the entry door was old and thin with an old lock. Overall the hotel was very nice and I would definitely recommend it. The staff was excellent.", "title": "Prime Location Downtown", "user": "tageo", "date": "September 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117564029}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "The Oxford Hotel in Denver , CO, is a gem of a hotel. It's an old boutique hotel that has charm and a staff that caters to guests unlike most larger chain hotels that are more like vertical urban malls that just happen to have bedrooms. The rooms are spotless and beautifully decorated. The lobby is small, warm and welcoming. Both desk staff and bellmen actually care about you individually, getting to know your name and recognize your preferences. Whether it's getting you beverages late at night in the lobby or making sure that you have a complementary ride to the car rental office, the employees at the Oxford reflect a systemic concern for customer service. We will certainly be back. Worthy of mention--Heather, Stewart and James.", "title": "What a find!", "user": "Positano75", "date": "September 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117554600}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "We stayed in this hotel for the annual ATS conference in May. After a long trip from the UK we were pleasantly welcomed by the very polite reception staff and an exeedingly polite doorman. We were shown into our large sumptious rooms, beautifully furnished with excellent decor. The en-suite bathroom was also large and very well maintained. The small library on the landing halfway up to the rooms was a very nice touch (especially for a bookworm like me) as were the computer stations (very handy for people who don't carry thier laptops half way round the world).", "title": "Luxurious period Hotel in the heart of Denver", "user": "Ike1985", "date": "August 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 117510870}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "My only complaint would be that breakfast service in the restaurant was a tad slow, but the food is so good it is well worth the wait.", "title": "Old style elegance, with modern standards", "user": "kayak-atitlan", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117246158}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Stayed in room #502 for two nights. King bed.", "title": "Great staff, nice hotel, free wifi, great bed", "user": "MaineIzzy", "date": "October 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119075588}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Good", "title": "Lovely hotel and truly wonderful staff", "helpfulness": 2, "user": "TeamTurnerTravels", "date": "September 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118783012}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Room is spacious with plenty of closet space.", "title": "Love the Oxford", "helpfulness": 1, "user": "mcatgirl", "date": "September 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118670477}, {"rating": 5.0, "title": "Nice hotel in a great location", "text": "Small work desk with Bose stereo and free wifi.", "helpfulness": 1, "user": "rockymtnsky", "date": "September 24, 2011", "id": 118545280}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Natural light with a street view – not much to look at but fine.", "title": "Great Staff", "helpfulness": 1, "user": "CrystalCove_96", "date": "September 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 118542744}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The hotel is on the outskirts of Oxford, the room and staff were all excellent. Especially Patrick, the waiter, who had us laughing all through the two evening meals we had in the restaurant. I disagree with some of the comments, we came as a couple and did not feel we had landed in a standard business hotel. It is a modern hotel with good facilities, the room was clean and quiet,all staff were courteous and the food prices are about average. It is very close to the bus stop so going into Oxford wasn't a hassle. I would definitely use this hotel again.", "title": "Lovely Hotel", "user": "Voyager33", "date": "September 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 177052179}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "I had stayed at The Oxford Hotel before and has significantly improved. You have to remember there are not many hotels in Oxford and those along with the bed and breakfasts are expensive. Check in good, hotel very clean, room good with nice shower, decent bed and linen and LCD TV in the room. Breakfast is not vast but plentiful and good quality. Overall if you have a car or even want to explore Oxfordshire including Woodstock, Oxford, etc it's good as it's on a bus route on the edge of the city. Would definitely stay again", "title": "Excellent value for money hotel for exploring Oxford", "user": "Bourneman1971", "date": "September 13, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 177025629}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "The hotel was clean and pretty spacious but they were really the only good points. I was there on a hen do - fairly sedate (we were all back in bed by midnight). When we arrived our rooms weren't ready (at 3:45) so we had lunch in the bar - the food was overpriced and took sooooo long to come out. They only had one bar tender who served the drinks and the food. So my friends ordered a coke and a coffee and it must have taken 30minutes to come out. The food took about 40 minutes and we'd only ordered sandwiches.", "title": "Below average", "user": "VJ1212", "date": "September 11, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 176700545}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "The spa facilities are a joke - they're not really spa facilities, it's just an oversized paddling pool and the sauna, steam room were not at the right temperature and not big enough.", "title": "A business and coach trip hotel", "user": "scranny", "date": "September 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 176315463}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We had afternoon tea on the Sunday and this was not very good. The sandwiches are poor and not enough of them, usually you have a pastry but we got a chocolate cake - no choice and it wasn't the best. The scone was not fresh but probably bought in a supermarket. I suppose it was cheap so maybe we should have expected it.", "title": "Faultless", "user": "MikeFH", "date": "September 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175903103}, {"rating": 1.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "This place is disgusting, not fit for human to stay, the beds are so small and sinking, the tv has only 5 channels, the toilet is so small, considering i'm only 5'3 and my elbows keep on brushing the walls of the toilet, the sink is only one palm long,. The towels and bed sheets are dirty, the reception are all rude, i overheard them asking the chambermaid to clean 3 rooms in just 2 hours. the breakfast is only bread and cereals and nothing else. we booked the double room for 68 pounds, if you just add another 10 pounds you see a big difference in the elysee hotel just at the corner of craven terrace and its even closer to the lancaster station. the reception even said that that's what we get for our money in london, he's such a liar, im sure you get better ones at the same price. the locks are also not safe. the heater not working well, we were freezing most of the time. we were forced to stay for 2 nights because they won't refund the money to us. Dont ever come near this hotel. i think somehow I felt better spending my money there because i feel that the chambermaids and breakfast server are friendly people.", "title": "Disgusting", "helpfulness": 2, "user": "JCO725", "date": "April 13, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "business": 1.0, "cleanliness": 1.0, "rooms": 1.0, "location": 3.0}, "id": 15011782, "likes": {"liked": "— going away", "disliked": "— all!"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "I Stayed here with two friends on a Saturday night in February 2007. It was a bargain: Triple-Ensuite £65 (£22 each!). We had a Double and two singles which were clean and tidy. A small but adequate toilet and shower room. And a kettle, fridge and microwave which were very useful, and a small tv. The room had two large single glazed sash windows and two large radiators and was very comfortable. The stairs were narrow and noisy and some female guests arrived very noisily at 2.30 in the morning. For the price it was an absolute bargain with two local uderground stations and Hyde park a 5 minute walk away. Across which are the kensington museums (Natural History, Science, Victoria & Albert)", "title": "Bargain Price for London", "user": "K9ine", "date": "March 19, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 14387050, "likes": {"liked": "— Price, Microwave, Fridge and Kettle", "disliked": "— Noisy Stairs"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "Sadly we didn't try breakfast as we were too lazy.", "title": "Provided the basics, friendly and clean.", "user": "nagemx", "date": "February 1, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 4.0}, "id": 13176199, "likes": {"liked": "— Location and price.", "disliked": "— Luggage struggle up the narrow stairwell."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "I would definitely stay there again as it was such a good price. I believe some rooms are in a better condition than others but ours seemed clean and in good decorative order, the stairs were a bit dark, victorian, narrow and noisy but most rooms have two doors between the stairs to try and minimise noise a fraction.", "title": "pleasant staying at The Oxford Hotel", "helpfulness": 3, "user": "steff69it", "date": "January 12, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12541635, "likes": {"liked": "— location and price", "disliked": "— breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Just to confirm this reveiw is of the Oxford Hotel in Craven Terrace Lancaster Gate London W2 3QD", "title": "Great value in expensive London", "helpfulness": 2, "user": "jennnee", "date": "December 28, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 12007959, "likes": {"liked": "— value for money", "disliked": "— nothing in particular"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We stayed at the Oxford Hotel for two nights while enjoying London. Our room (#43) was clean, with three single beds, a small but functional bath (great water pressure!) along with a microwave, coffee/tea set up, and a small refrigerator. Pack light because there’s no lift and the stairs are steep. If it’s sunny and warm the room can get stuffy. Breakfast in the morning was a good assortment of cereals, rolls, coffee, tea, and watery orange juice. The breakfast room in the basement can get a bit crowded, but the staff was very efficient in clearing tables and restocking items. The hotel is just a 5 minute or so walk away from the Lancaster Gate tube stop on the central line. The Italian restaurant next door is wonderful, drawing a mix of locals and tourists, and a good value compared to what you will find in the theater district. The front desk staff was very helpful and was happy to store our bags after we checked out so that we could squeeze in a few more sights before we caught our train out of London. For an expensive city like London, the Oxford Hotel provides a reasonable level of service for the price charged.", "title": "Good stay", "helpfulness": 2, "user": "JohninDC", "date": "July 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 17620736, "likes": {"liked": "— Great location for seeing London.", "disliked": "— 78 steps up to our room."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "The first thing that comes up for me is the kind and helpful staff, every one of them. They were so friendly and willing to help with anything we asked. The rooms were cute, cozy and very clean (and I am picky) and since this is a budget hotel, I thought we got a lot for our money. There were three of us in a triple and we all loved it there. We stayed somewhere else for a few days and were so happy to come back to the Oxford! It was by far the best. The hotel is in a great location in a quiet neighborhood. I will definitely stay again during my next visit to London. I can't understand how anyone could be unhappy with this hotel considering the price and value when it comes to cleanliness and comfort in a great location. By the way, the hotel pictures look exactly like the rooms. Very cute.", "title": "I LOVED IT!", "helpfulness": 1, "user": "daytripper1022", "date": "July 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17495472, "likes": {"liked": "— Location, cute building and rooms, friendly staff", "disliked": "— No lift, but that's okay"}}, {"rating": 2.0, "title": "Budget but Adequate", "text": "Given the price, not a bad deal. Don't expect luxury. Clean. Small bathroom but at least it was en suite. Staff were friendly. The maid kept leaving the windows open and, with no screens, bugs got in. We had a family room on the first floor (second, to Americans) - one double and two singles. My single bed squeaked every time I moved. Noisy at night - pedestrians talking loudly, cars racing down the otherwise quiet street. Still, good location and reasonable price for London. No lift and narrow staircase but if you are prepared for that, it's okay.", "user": "Wendiness", "date": "June 18, 2008", "id": 17022969}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled solo", "text": "I stayed at The Oxford Hotel from 2/24 until 3/9 and I had a very pleasant stay. They had a room available for me on the ground floor which was a very pleasant surprise in this non-elevator hotel. Staff was friendly and helpful; room was large enough for me. I mean, you just sleep there so why bother the bathroom size? My bed was very comfortable. Also, I had a small fridge and microwave available to me. This has really saved me money! This clean, convenient hotel is situated just a block away from the subway (Lancaster Gate) and the 148 bus stop that takes you to Victoria Station in 20 minutes. I would definitely stay here again and probably will later this year.", "title": "I had a great stay", "user": "banglagirl", "date": "April 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15450725, "likes": {"liked": "— The location and the comfortable feeling the hotel gave me.", "disliked": "— They have no elevators. I was on the ground floor, but wouldn't want to go up..."}}, {"rating": 1.0, "title": "didn't get through the door!!", "text": "we informed the oxford that we were arriving at 6am. They said this was fine if the room was not ready we could leave luggage with them. We arrived just after 7am when they are ment to be open but the door was locked and no one inside. After knocking and calling for 15mins in the cold after a 20 hour flight we decided to go to a hotel across the road. When we rang after settling in to the other hotel the person I spoke to told me that he was there at 6.45am and said that he was not away from the desk. So he was saying that we were not there at that time if not at all. We where still charged one night even though they where not there to give us our booked room instead they accused us of lieing. Would never think of staying here again as the hotel across the road was much better and the customer service was excellent.", "helpfulness": 1, "user": "cypher2008", "date": "April 15, 2008", "id": 15059208}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We came to the hotel for a weekend get-away and loved it. The staff was wonderful. The history of the hotel just added to its ambiance. We were up-graded at check-in and loved the room which was on the Wazee St. side of the building.", "title": "Weekend Get-Away", "user": "Azdwf", "date": "August 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 5.0, "service": 5.0}, "id": 117153488}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "Our only complaint was the noise at night, which the hotel has no control over. Perhaps, in the future, they might invest in new windows with noise-reduction features.", "title": "Best room I've ever stayed at in my entire life", "user": "shinxiah", "date": "August 18, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 116919208}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "I had missed my connection at the greyhound station and the next one wasn't for 24 hours later. My parents put me up at the Oxford Hotel last night. The service was amazing!!!! They picked me up at the station to bring me to the hotel so I didn't have to haul all my heavy luggage alone there. The room was gorgeous!!! Best ever. They allowed me to stay until 2pm and even held my luggage while I roamed the area until my bus came. A driver took me back to the station and even carried my bags inside to where I needed to be instead of just dropping me off at the location. Now that's customer service!!!! The only thing I would have to comment on is that there isn't a complimentary breakfast, which I would have loved or perhaps a slight discount at McCormicks for being a guest at the Oxford Hotel. I will definitely stay here again if I am ever in Denver again!", "title": "Excellent Art Deco Hotel", "user": "Bob15431", "date": "August 15, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 116763943}, {"rating": 1.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "We enjoyed our 2 night stay. The staff was wonderful. Don't miss a visit to the original bar which was the first one opened after prohibition.", "title": "DO NOT SLEEP ON PULL OUT SOFA IN PARLOR SUITE", "helpfulness": 2, "user": "rounsley", "date": "August 13, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 1.0, "value": 2.0, "service": 2.0}, "id": 116666863}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "I statyed at the Oxford for the Sade concert at the Pepsi Center. I spent the night on the pull out sofa in what the hotel calls their parlor suite. The mattress is NOT a mattress but a thin", "title": "Perfect base for exploring downtown Denver", "user": "xyztravel", "date": "August 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116321475}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Stayed on a Great Little Breaks offer. The hotel is located close to a large roundabout on the north side of Oxford but the traffic noise made barely any intrusion. The car park is large. The lobby is quite classy with a reception and coffee bar and was welcomingly air conditioned on the two very warm days we spent here.", "title": "Handy for seeing the city and good value.", "user": "nataliatiyad", "date": "September 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 179221476}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "There was a bit of a hiatus over the booking when we arrived and initially we were offered accommodation in another hotel but once the computer system had received a severe smacking we were given an upgraded room which was very nice, light and large with a good en-suite. Linen and towels were good. This is, essentially, a conference hotel and it's a very nice one. The food at breakfast (with a very extensive choice in the buffet) was excellent and the evening meal was much better than we had expected for this type of hotel. The receptionists were unfailingly polite and helpful. A great plus for the hotel is that a frequent bus service just around the corner drops you off in the centre of town after a journey of 10 mins or so (except in the rush hour, double that). We'd stay again without any hesitation.", "title": "Great Value, Average Location", "user": "BC_HowLin", "date": "September 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 179124416}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Arrived in Oxford around 2pm (from Heathrow) and proceeded to the Oxford Hotel via a local bus (S3) which saved us significantly from a cab fare. (Nice to be travelling light!). Hotel appears to be quite nice (3-4 star?), seems to be often used as a convention centre and was priced reasonably (when booked 2 months in advance)! Very nice lobby; had to navigate a long way down the corridors (ground floor rooms), but we found the room clean and reasonably well appointed. Above average breakfast facilities. It is a 10 minute bus ride from the town centre (and then you have a 2 block walk to the hotel); but for us it was fair value for what we experienced.", "title": "Good hotel, nothing fancy", "user": "Elli P", "date": "September 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 179103197}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "This is a very nice hotel and everything was incredibly clean and tidy upon arrival - as you would expect from a hotel. I was visiting a very dear friend and his family and it was a good location to venture out to see him and the rest of oxford. Good facilities and overall a very good stay.", "title": "Very Pleasant Stay", "user": "Travelonmeown", "date": "September 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 179098924}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "I've just returned from a one night stay at The Oxford Hotel. The reception staff were very helpful and accommodated my request for a quiet room. Our room was very comfortable, spacious and very clean. Breakfast was a bit chaotic and unfortunately we had a long wait for bacon, eggs and the tomatoes to be replenished. I would have thought the chef would know the peak times to ensure that food was replenished more speedily. However, this didn't effect our overall experience and I would definitely return.", "title": "Very nice, modern hotel", "user": "Antonia1958", "date": "September 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178682223}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "This is a modern hotel and everything looks fairly new. The rooms are pleasant and meet my standards- tea making facilities, good shower, and clean. There wasn't a great deal of space to move around in but think this is probably a reflection of the enormous bed rather than the room size.", "title": "Good base just outside Oxford.", "user": "Kate N", "date": "September 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 178389343}, {"rating": 2.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Location wise it was fine for us- about 5-10 minutes drive from Oxford and there is a bus that goes direction from just outside but it is definitely too far to walk in so it's worth bearing this in mind if you don't want to have to get extra transport when you're here.", "title": "Leisure facilities disgusting", "user": "MK4948", "date": "September 23, 2013", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 178292184}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "We had dinner included in our package but as we wanted to explore Oxford we only had a starter and the free bottle of wine to sustain us before venturing out but this was delicious and there was a lot of choice- especially considering it was included. The only downside is that the restaurant for the evening meal was a little corporate. Would be great if you were just looking for nice food after a busy day but it isn't particularly romantic...", "title": "Not sure this is really a 4 star hotel, maybe a 3?", "user": "LaraZH007", "date": "September 23, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 178292053}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "Breakfast was sufficient- lots of it and of an average standard, not as good quality as the food the previous evening.", "title": "Good location for a trip to oxford", "user": "nnwj", "date": "September 20, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 177870826}, {"rating": 4.0, "title": "Handy for Oxford", "text": "Stayed at the Oxford hotel for one night. Checked in mid afternoon and thought we would make use of the spa & leisure facilities. I have to say I have never experienced such dirty facilities in a leisure club anywhere. The floor in the ladies changing rooms was filthy, the legs of the benches had left rust marks all over the floor, the shower was filthy, the tiles had clearly not been cleaned for months. The carpets on the walk to the \"pool\" were filthy, the pool itself was dirty the surrounding floor & tiles, the steam room had left over \"hairs\" all over the floor, to say this made my skin crawl is an understatement I couldn't wait to get out of there!! I don't know if the leisure facilities are independent from the hotel but they are by far the worst I have ever encountered. The hotel itself wasn't to bad, although breakfast was a bit shambolic. To sum up I won't be rushing back to this hotel or be recommending it to friends & family!", "user": "A TripAdvisor user", "date": "September 18, 2013", "id": 177680290}, {"rating": 2.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "I don't believe the Oxford Hotel deserves its four stars. I stayed there five nights in September 2013. My room was cold and I asked for a heater. On the first night they could only supply a blanket, until I complained more stridently and a heater was put in my room on the second night. My room was tiny, barely big enough for the bed, and the upholstery on the only chair was torn. There were long queues for reception as there was usually only one receptionist on duty. Other staff coming and going around the reception area noticed guests waiting, but did not bother to assist. Breakfast was dull, served on dirty plates and accompanied by weak, machine-made coffee: I asked if it could be made stronger, but nothing was done to improve it. On one evening I made the mistake of ordering room service and was served a very unpleasant vegetable curry, drowned in cream. With a glass of very ordinary wine the meal cost me £23 due to the unreasonable £5 tray charge. I hope I will not need to stay at The Oxford Hotel again.", "title": "Cold rooms, diappointing food and unhelpful staff", "helpfulness": 1, "user": "Peter D", "date": "September 17, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 177512939}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "stayed one night en route to Heathrow. Good car parking. Reception staff fairly disinterested but that was offset by the friendly and helpful staff elsewhere throughout the hotel.", "title": "good chef", "user": "Lorraine M", "date": "September 17, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 177487163}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Room was clean and comfortable, but the hotel is like a rabbit warren, and just finding your room is a triumph. Was the architect drunk? I got lost more than once, and even staff couldn't tell me with any certainty how to find my way back to my room.", "title": "Good Location and Value", "user": "gastronaut_11", "date": "September 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 177160342}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "One complaint about the facilities in the room-the hairdryer is wired in and must have been designed for children to use as I who am very short, could not use it effectively.", "title": "A good stay", "user": "FairGB", "date": "September 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 177112864}, {"rating": 4.0, "stay_parameters": "Stayed September 2013", "text": "Ate at the hotel restaurant-an excellent meal with very friendly and helpful wait staff. Breakfast very good- better than most British offerings, except the porridge, which was appallingly overcooked and gluggy and refused to leave serving spoon.", "title": "Great location", "user": "Budeastbourne", "date": "September 14, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 177099451}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 3, "variance": {"poor": 47, "average": 70, "very good": 127, "terrible": 25, "excellent": 35}, "aka": "Oxford Hotel London", "slim_ranking": 0.621747211896}