{"user_rating": 4.0, "review_count": 1582, "name": "The Fairmont Southampton", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "I recently stayed at the Southhampton Fairmont for a business trip and would definitely return here. The hotel is upscale with a private beach, 2 nice pools and plenty of restaurants on site. Our room had an ocean view with a balcony and was wonderful to wake up to in the mornings. It was a large room with a large bathroom and walk-in closet. Check-in & out was fast and easy. The hotel is about 30 minutes from the airport and a $30 taxi ride. While the hotel is a little far removed from other restaurants/bars there are always taxi’s pulling up and the taxi line moves fast. Most taxi rides were about $10. There is a private beach and tennis courts – you can hop on a shuttle to take you down there. It’s less than a 5-min ride or an easy walk downhill – the shuttle is mostly useful for the walk back to the hotel. There is a golf course on site that I didn’t use so I can’t provide an opinion. The private beach is nice but if you ask how to get to Horseshoe bay it’s a 3 min-walk from the private beach, much larger, better sand/water & great caves to explore – you’d be doing yourself a disservice if you only check out the hotels private beach. The outside of the hotel structure itself looks like it was built in the 1950’s and could use an updated look but inside it’s very elegant & upscale.", "title": "Beautiful location although a little removed", "helpfulness": 6, "user": "lolomojo", "date": "October 27, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6017717, "likes": {"liked": "— The View, The pools, The nearby ocean", "disliked": "— The location is a little removed but bermuda seems to be spread out."}}, {"rating": 4.0, "title": "Very nice hotel", "text": "We stayed at the Fairmont Southampton last week for 4 days.", "helpfulness": 10, "user": "jeez", "date": "October 20, 2006", "id": 5975875}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "It was a very fast check in, lobby area was beautiful. We booked thru Cheap Caribbean also and had a view of the top of the lower level roof :( but didn't bother to ask to be moved because we weren't spending lot of time in the room anyway. Otherwise the room was nice, but don't think it was a newly renovated room.", "title": "Bermuda Beware!", "helpfulness": 9, "user": "CoralGrief", "date": "October 14, 2006", "detail_rating": {"front_desk": 1.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 2.0, "location": 2.0, "rooms": 5.0}, "id": 5955141, "likes": {"liked": "— room", "disliked": "— negative attitude"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "It was very clean. I did have issues with the bathroom though. If you were taking a shower, there wasn't enough light, so when you pulled the curtain closed you felt like you were in the dark.", "title": "Just Returned Home, Want to Go Back!!!", "helpfulness": 20, "user": "Joe-Concierge", "date": "October 3, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5904005, "likes": {"liked": "— room", "disliked": "— Doors between connecting rooms thin, can be an issue."}}, {"rating": 4.0, "title": "Pay more, be happier", "text": "The exhaust fan didn't work either.", "helpfulness": 11, "user": "Karen-in-DE", "date": "September 27, 2006", "id": 5882133}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Bermuda is a beautiful island with wonderful scenery, great snorkelling in clear blue seas and friendly people. I used to visit family resident in Bermuda many years ago, and know what to expect. I also have the benefit of knowing how to get around and where to eat so I do advise finding out a few things beforehand. I truly love the island and chose the Fairmont because they let us book 2 adults and 2 kids in one room, and because I remember it being very pleasant years ago. It still is and is pretty well maintained in all areas. Its true the pool is small and not that clean looking, but what do you expect? with lots of kids running in, people eating around it and entering without showering. We would never go to Bermuda to use a hotel pool. Our room was very nice, with an upgrade to an ocean view. It was spectacular. Whilst the 2 double beds were too small for us (an issue I mentioned to management and I believe is being dealt with by the arrival of new queen beds), we managed with a rollaway. We go out all the time and just sleep in our hotel rooms so we had no major issues here. Cleaning was more than adequate, but the balcony was not touched during our stay. We did ask and I think it received a cursory sweep. Service can be a little variable, the concierges are overworked but many people spend hours at the desk, draining their time when they could find out a few simple things themselves. I always went when I knew there would be no queues. Afterall, this is a very large hotel. We booked some of our own restaurants but we always found the concierge desk very friendly and helpful. Same for front desk who rushed our check in as our little girl was exhausted and if I had a problem, I managed to resolve it, sometimes with a little persistence (a phone problem and a blocked bath took 2 days at least to sort out). Service was slow one night in Jasmine and the guest relations manager was very receptive to having a chat with me and offered a small gesture. Generally wait staff were very professional. Overall we were very happy with what we got for the price (breakfast package), the food we had - Waterlot is very nice and the setting of the Whaler is gorgeous - the universally kind staff and our stay in general which was memorable. The band in the evenings with Lance on drums was great. The beach is quite nice and I agree it is much more sheltered than Elbow. It gets crowded but we always managed to find a sunbed. You are right next to Horseshoe or you can try out Church for snorkelling or Astwood Cove area. They are all acessible. Insiders have told me that all Bermuda hotels can be a little up and down. I am sure this is true, and the Fairmont Southampton is still one of the better bets, unless you want a simple holiday( go self catering) or a romantic getaway (try boutique).", "title": "The Fairmont was Fine", "helpfulness": 13, "user": "DollyDreamer", "date": "August 30, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5728031, "likes": {"liked": "— Many facilities", "disliked": "— All ok for us"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "We are residents of Bermuda and recently indulged in a weekend at the Fairmont Southampton. The problems started at check-in which was chaotic at best. The lack of service and attention to detail and the general confusion on the part of the front desk staff caused us grave misgivings. Room service breakfast was incorrect and delivered an hour early. The housekeeping person was rude and totally disregarded the do not disturb sign. When calling switchboard to book tables in the hotel restaurants, spa treatments etc, we were placed on hold for long periods and in one instance told \"I'm busy\" and disconnected! The Willowstream Spa was overbooked, and despite charging a $29 admission to hotel guests, we were told no lockers were available. Following discussion we were provided with a locker in a lavatory cubicle located a distance from the spa. A broken coffee pot could not be replaced until other guests had checked out as there were no spares anywhere in the hotel. Checkout was as chaotic as check-in and our bill was grossly over-calculated to the tune of $996. This took ten days to resolve, necessitating repeated telephone calls and a visit to the hotel manager. An apology was offered for our experience, but we felt that our concerns were not taken seriously, rather they were passed off as \"bad luck\". There are numerous excellent hotels, bed and breakfast and self-catering establishments on the island. My advice is STAY ELSEWHERE!", "title": "Ghastly", "helpfulness": 28, "user": "overseaslass", "date": "August 26, 2006", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "rooms": 3.0, "location": 5.0}, "id": 5712185, "likes": {"liked": "— The restaurants", "disliked": "— Poor service and poor value for money"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We stayed at the Fairmont for 5 days/4 nights in mid August. I had read some good reviews on Trip Advisor in the earlier part of the year and booked in the Spring. Then I read some not so good reviews just before we left that got me pretty worried on the flight. Overall, despite every day having the only rain Bermuda saw in 2 months, we had a great time and learned a lot about Bermuda and the Fairmont:", "title": "How about a little perspective...", "helpfulness": 26, "user": "virginiamike", "date": "August 22, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 5700227, "likes": {"liked": "— Gold Level accomodations", "disliked": "— Size of beach"}}, {"rating": 3.0, "title": "This ain't no 5-stars....", "text": "The Fairmont:", "helpfulness": 12, "user": "NJAdviseor", "date": "August 18, 2006", "id": 5622720}, {"rating": 3.0, "title": "Bermuda is For Your Grandmother, unless She's Hip Then Forget It", "text": "- Physically, it's like everyone has described: high on a hill, big resort, beautiful lobby, beach below.", "helpfulness": 21, "user": "ElTrippy", "date": "August 15, 2006", "id": 5615345}, {"rating": 3.0, "title": "Overall OK", "text": "We stayed 3 nights Sep 27-30, and my stay is similar to what others have stated before, both good and bad. I can't say I was fully disappointed because I expected an average (+) experience, and that's basically what I got. But the price was right for a long weekend off-season special, so took advantage, and most of my expectations were met with a couple of discouragements.", "helpfulness": 1, "user": "aphanna25", "date": "October 2, 2013", "id": 179407344}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The good: The grounds, especially the private beach, are what make this place really special on the exterior. The beach experience is one-of-a-kind and a home run for convenience. The inter-resort transportation (trolley/ferry) are also top notch. The people are incredibly friendly, and welcoming, and an answer to your questions isn't hard to find. The whole staff is very methodical, and efficiently run, and always looking busy. Extra kudos for the champagne to celebrate my wedding anniversary, which was a nice unexpected touch. The rooms were large, with comfortable beds and a nice assortment of global TV channels. The private terraces were a plus with a nice view of the surrounding area.", "title": "If you want service this is the place!", "user": "Lori B", "date": "October 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 179393813}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The bad: We were given an upgraded room upon check-in, and while the size and overall cleanliness were good, there was a fairly substantial patch of black mold on the bathroom ceiling. It was hanging down to the top of the mirror. While this is common in tropical locales, I let the housekeeper know on the first day. She called maintenance, but they never came during my stay. I didn't escalate the issue, which maybe I should have, but I sort of assumed it would be taken care of. It was obvious enough to anyone that it should've been dealt with prior to my stay, in my opinion.", "title": "Mix of business and pleasure - outstanding attention to details", "helpfulness": 1, "user": "RH_Travellors", "date": "October 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179359465}, {"rating": 4.0, "stay_parameters": "Stayed September 2013", "text": "The disappointing: At times, the service was slow, and while I'm fairly laid back, waiting an hour (no exaggeration) for a server mid-afternoon in the Jasmine Lounge is sort of ridiculous, especially when the end result is going to be a $125-$150 meal tab for a light lunch and a couple of drinks (for two people). Additionally, the long wait times for service weren't really isolated...we experienced this a couple of times, and one would think with high food/drink costs perhaps it would be a little tighter and move a little quicker. Yes Bermuda is expensive and caters to a higher-end crowd, which I don't mind, but certainly some aspects of the resort feel like a cash grab. I didn't feel the quality of the food product (it was average, in my opinion) warranted such a high price point, for one.", "title": "Great location, restaurants are so so", "user": "kpierfelice", "date": "September 30, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 179247703}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Overall: I think it hits all the right notes on what others have said: the resort amenities are great, and the people couldn't be friendlier. We unfortunately hit a patch of poor weather, so had to spend a bit more time inside, which is obviously no fault of the FSH, and perhaps skewed my view a bit. I can't imagine a scenario where I'd pay much of a premium to come back here. I think it's a solid 3.5 stars, but since that's not an option, I'll downgrade to a \"3\" on account of the mold and slow service. I can see the justification on others giving it higher praise, perhaps their experience was better. There's a lot to like here.", "title": "Best birthday", "user": "Mallison922", "date": "September 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179158100}, {"rating": 4.0, "title": "Really Great Vacation", "text": "I must admit I was a little nervous about staying at the Fairmont Southampton after reading some of the reviews. I would say I consider myself and family very well travelled, routinely staying at luxury resorts (i.e., Ritz Carlton, Four Seasons) and I have to say we had a great experience from start to finish - very comparable to the other hotels mentioned. We arrived early (hours before check in) but were extremely pleased to find that both of our rooms were ready. I know some of the other reviews mentioned the poor room quality and cleanliness and I have to say our experience couldn't have been more different. Our rooms were beautiful - very big, very clean with an amazing view, I guess we were fortunate in getting one of the renovated rooms. In one of our rooms however, the air conditioning did not seem to be working too well, it was not nearly as cool as the one room and had a slightly musty smell to it. Fortunately, this was the kids room and they didn't seem to mind or complain. I also need to mention the hotel staff - everyone we came in contact with could not have been more friendly or more polite. From the housekeepers, to the pool and beach staff and the restaurant staff - they all went out of their way to be friendly and accomodating especially to our 2 small children ages 5 and 2. They made ourselves and children feel welcome and special. I was especialy impressed with the maitre'd at the Newport Room who went completely out of his way to get us reservations for the following day at the Waterlot when he found out our reservations got mixed up prior to arriving (the reservationist booked us at the Newport Room and Waterlot for the same night in error) leaving us with our last night with no reservations and no openings anywhere. The maitre'd made some phone calls while we were there and said he would get back to us by the end of the night to let us know if he was able to get us a reservation. Sure enough not an hour after we left the restaurant he called with the news that he was able to \"call in a favor\" to the Waterlot maitre'd and got us in at the time and place we wanted. Now that is what I call service! The food was very good at the Waterlot, excellent at the Newport room and fair to below average at Bacci. My only real complaint with the stay besides the food at Bacci, is it is difficult to find chairs and umbreallas at the beach and the pool - unless you are there really early or late is about the only time you'll get to be selective about where you sit. Our vacation at the Fairmont Southampton was extremely relaxing and enjoyable - they are very family friendly without it being or feeling like Disney World. We're already looking to book another vacation there next year.", "helpfulness": 4, "user": "rhlp11129", "date": "August 11, 2006", "id": 5600816}, {"rating": 1.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Just to inform you all, this is a BIG CONVENTION HOTEL!", "title": "*** LOOK ELSEWHERE IMMEDIATELY***", "helpfulness": 22, "user": "RBBboston", "date": "August 11, 2006", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 3.0}, "id": 5600428, "likes": {"liked": "— I was in Bermuda", "disliked": "— Convention Hotel"}}, {"rating": 4.0, "title": "Had a Very Nice Stay", "text": "I stayed with my family in a two bedroom suite [the $2000+/night suite turned out to be two connecting rooms with a parlor room!] on the 'concierge' level for 5 nights in July. Regretfully the hotel convention's hospitality suite was on the same floor at the end of the hallway. Thus throughout the ENTIRE night until 3AM there would be loud, obnoxious and drunk people walking, laughing, partying in that very same hall-way. Needless to say that you did NOT get any sleep and were exhausted the next morning. I have never heard of any hotel concierge level being open to the general public and in particular promoting the access by placing a hospitality suite on the floor. Management was unresponsive to complaints and were incompetent with handling the guests coming to and from.", "helpfulness": 11, "user": "MarlaD521", "date": "August 10, 2006", "id": 5594637}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled solo", "text": "The above is just ONE of the bad experiences that we had to endure. I will not waste my [or your] time to describe the rest.", "title": "Beautiful setting; crowded, noisy hotel", "helpfulness": 6, "user": "BBolling", "date": "August 9, 2006", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 5592595, "likes": {"liked": "— views; spa", "disliked": "— noise through bedroom walls;"}}, {"rating": 5.0, "title": "better than expected", "text": "Sincerely,", "helpfulness": 6, "user": "par4golf", "date": "August 1, 2006", "id": 5537131}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "My wife and I stayed there for 4 nights in September, 2013. The hotel and staff are very nice. The restaurants are good as well. they have a trolley to take you to the private beach. I would suggest walking a short distance to the less crowded beaches as the private beach can be very crowded. I have no problem with the hotel. However, I did not care for Bermuda very much (water and beaches beautiful). Very pricey and lacking in a local character as the residents will explain that they eat where tourists eat and do what tourists do. so, you end out with a sanitized experience.", "title": "Very Nice Hotel", "user": "dpvatty", "date": "September 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 177893714}, {"rating": 4.0, "title": "Family Holiday", "text": "So my in laws, husband and I recently stayed here for our first family vacation. The grounds are very nice, the guest services are wonderful and I LOVED the private beach. The trolley takes you to the beach where they have towels, beach chairs with awnings and food/beverage service. My favorite part about the beach was that it absolutely cleared out around 5pm and we literally had it all to ourselves. I stayed there all day many days in a row. I also enjoyed that every night there was live entertainment, not just on the weekends. I visited the spa and the small touches were what made the difference-for example I was provided a loofah for one of my treatments. I had every intention to take it with me-why just use it once? Well when I got ready to leave, my therapist had a fresh one for me...I didn't even have to ask. Also in the Jasmine Lounge big KUDOS to Robert the bartender. My husband was terribly sick and he made him an AMAZING hot toddie. I know why they call him \"The Doctor\"!", "user": "Eljayen", "date": "September 19, 2013", "id": 177839399}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The only reason I'm not giving 5 stars-I'm allergic to feathers and although I called and housekeeping promptly changed out my pillows, the first night they did not give me a new duvet so I had to sleep with a ratty blanket. And then we bought a rum cake that came with sauce, housekeeping threw away our sauce-there were at least 5 little containers right next to the cake--all dumped out. So we had to eat our homemade cake dry-that was disappointing. Other than those to little things, we really enjoyed our stay.", "title": "Choose for the location", "user": "wate8091", "date": "September 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 177729876}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "This is a top tier hotel with just a few slight warts, but the location is perfect for anyone wanting to visit the beach in Bermuda. You need to take a shuttle to the beach, but it is a good one, and Horseshoe Bay is a very short walk from the shuttle stop. Beautiful beaches, and you can swim or snorkel around the rocks a short distance from shore. As far as the hotel goes, we paid extra for the ocean view and the concierge level. I question whether the extra is worth it, although it does include afternoon tea, breakfast and evening snacks, which, given the prices in Bermuda, is probably worth quite a bit. The concierge experience was mixed, and note that there is also a concierge desk in the main lobby, in that we tried to arrange a tour at the upper floor desk, and they sent us to the lobby anyway. We happened to see the exchange between the young lady working the desk and an older woman working in the lounge, and it was clear that the older woman was not interested in helping us, although at checkin, we were advised we could book at this desk. One other interesting experience. We went down to the lounge to have a drink, thinking lounge meant bar, and were advised to seat ourselves by the hostess. We picked a comfortable couch (interesting seating in that part of the lounge), and found ourselves across from a family with a young child having dinner on the couch across from us, eating from the coffee table like you might do in your own living room. Not sure what to make of that, but overall, this is an excellent hotel and the experience was very enjoyable. We would stay there again.", "title": "Great stay and excellent staff", "helpfulness": 1, "user": "Maahk", "date": "September 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 177590087}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Great resort if you want to get away and relax. Free trolley's to the beach, dock or golf every 10 min. Free ferry into Hamilton if you want to see the city and shop. Not cheap but worth it for the great service and amenities. The private beach is excellent and right next to Horseshoe Bay. We stayed in a tropical storm and still had a great time in the hotel. The spa staff is very professional and friendly as well and made our rainy day a great time.", "title": "A pleasant - albiet expensive - stay with some needed improvements", "helpfulness": 7, "user": "Snells", "date": "September 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 177568391}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "My husband and I spent four nights recently at the Fairmont Southampton and we were incredibly pleased with our stay. The service -- specifically from the Concierge and in the Jasmine Lounge -- was top notch.", "title": "Fantastic", "helpfulness": 1, "user": "Diane S", "date": "September 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 178425613}, {"rating": 5.0, "title": "My Opinion Has Changed - AMAZING", "text": "We're both vegetarians and had delicious meals at all the restaurant locations on the Southampton's property (except for the Waterlot, which we did not go to), which is not always the case when we travel. Bacci, their Italian restaurant was delicious and our favorite.", "helpfulness": 1, "user": "Angela L", "date": "September 23, 2013", "id": 178284200}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "Other highlights were afternoon tea at the Jasmine Lounge and breakfast at Windows on the Sound.", "title": "Nice hotel, problems with communication", "helpfulness": 1, "user": "jujanlor", "date": "September 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 178275343}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "Incredibly convenient private beach location with towels, showers and changing room, and nice to have the hotel shuttle to use. It's also incredibly easy to walk over to Horseshoe Bay next to the private beach. We also used the complimentary ferry to Hamilton, which was another great perk.", "title": "Welcoming Paradise", "helpfulness": 1, "user": "Marie N", "date": "September 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 178036372}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "If you're not used to Bermuda prices, the cost of the hotel and food there can be a bit of a shock, but considering the service and all the little perks included, you more than get your money's worth at the Fairmont Southampton.", "title": "Top-tier hotel with all the amenities", "user": "Rajan_Munshi", "date": "September 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178007392}, {"rating": 4.0, "title": "6th Floor is great", "text": "Just returned from a 3 night golfing trip. We were on the \"gold\" level - which is the entire 6th floor. If price is not an issue (these rooms are significantly more expensive) then stay here. A separate check-in desk and concierge there - very nice and accomodating (they even let me make a call to the US for no charge) and always at your service. The rooms on this level are large, newly renovated and short of a 4 Seasons as nice as they come. The lounge upstairs has a good comp. breakfast, lots of snacks in the afternoon and comp. beverages all day. Also 2 computers in the lounge for use. View from all rooms are spectacular on this floor. Getting to the beach is a bit of work - and doen't inspire spontaneity - but quite beautiful once there. The pool is small and not terrific.", "helpfulness": 4, "user": "travhound", "date": "September 25, 2006", "id": 5835756}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We just returned from a stay at the Southampton Princess for our 10th wedding anniversary and were quite pleased with the property overall. The hotel and grounds are beautiful and well kept, the hotel beach is excellent and the location is relatively central.", "title": "Inconsistent Extravagance", "helpfulness": 14, "user": "MikeRay", "date": "September 24, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5833447, "likes": {"liked": "— Location, amenities", "disliked": "— Price, Concierge"}}, {"rating": 4.0, "title": "Pleasantly Surprised!", "text": "We did have some problems with our reservation on check-in and the desk clerk was utterly unable to help but the manager quickly stepped in and was very competent.", "helpfulness": 17, "user": "wvsista", "date": "September 7, 2006", "id": 5777941}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We stayed on the concierge or \"gold\" floor (top/6th) and found that the complimentary breakfast, afternoon tea/snacks, internet access, and honor bar were quite convenient and a relatively good deal.", "title": "Nice hotel, but not ideal for an island vacation", "helpfulness": 30, "user": "Rglow", "date": "September 4, 2006", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5767379, "likes": {"liked": "— The beach was very nice", "disliked": "— The hotel was too large, and not located on the beach"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled on business", "text": "We did not find the concierge staff very helpful or knowledgeable (neither on the gold floor nor at the main desk). They had a propensity to recommend the hotel restaurants and sponsored activities and did not seem as if they had actually tried many of the restaurants/activities themselves. In contrast, the doorman/bellman, the taxi drivers, and many of the more experienced workers at the hotel had great recommendations.", "title": "Great Vacation Spot", "helpfulness": 15, "user": "1cutemom", "date": "September 1, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 5761252, "likes": {"liked": "— Private beach", "disliked": "— Cost of food"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "I stayed here for 4 nights in September. The Fairmont Southampton (formerly The Southampton Princess) is a fantastic hotel. From when the bell captain meets you to when you walk into the lobby, you know you are at someplace special. Management has covered all bases. The food is great, the service is second to none, and the rooms a large and the mattress is very comfortable. Bermuda is a beautiful place. The locals are very helpful and understand the value of tourism. The concierge was exceptionally helpful answering all questions and making dinner reservation. They were very happy to make my stay go smoothly. I played golf for 3 days. If you want to play golf at Mid Ocean Club (a must for serious golfers), they allow non members to play on Monday, Wednesday, and Friday, I was told the concierge will set you up. I was lucky and played Mid Ocean but thru a golf connection. Be sure to join their \"President's Club\". That will get you complementary internet and no charge to the exercise room. I did use www.golfnow.com to make my tee times at Port Royal Golf Club. Port Royal is a beautiful place and the site of the Grand Slam of Golf this year. Needless to say, the course was in great condition and the greens were smooth and fast with no noticeable grain. GolfNow will get you a big discount on golf there. A fellow I shared the taxi with to the golf course made his tee time the same day and paid $100. I made my tee time 4 days early and my fee was $80. It all depends on the weather forecast. I would wait till 1 or 2 days before to make sure the weather is OK. I got caught out in the rain one day and got wet.. All and all, this is a special place.", "title": "magnificant hotel", "user": "CTCurt", "date": "September 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 178948028}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "We chose Bermuda to take our 7mo old on his first (airplane) trip. (The two hour flight from NYC was an easy call.) The Fairmont is a huge property w everything we needed for our wkend including strollers, babysitters, kid friendly restaurants, etc. The pool was decent and the private beach was very nice and not terribly crowded (many reviews suggested otherwise, but perhaps because we weren't there during high season it was alright). And the spa was pretty amazing - in fact it was a pretty substantial step up from the rest of the hotel, which could probably use an update.", "title": "Solid megaresort for a long family weekend", "user": "dslevy", "date": "September 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 178849256}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "I've stayed here a few times now, and really enjoy my time at the Fairmont Southampton. The big attraction for me is the amazing private beach, it really is one of my favourite beaches in the world. A great place to chill out, have a swim and be served Dark and Stormies at your sun lounger!", "title": "Relaxing stay, fabulous beach", "user": "BAMaracas", "date": "September 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 178815378}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Like everywhere on Bermuda, it is quite pricey, especially with obligatory service charges added. The rooms are all of a decent size, and it's really only the view that is the distingushing feature. My only negative is that it can be quite a noisy hotel as room doors don't offer much sound proofing, and for some reason you can always hear your neighbours and upstairs walking around. Having said this, if you avoid interconnecting rooms, you should be fine.", "title": "Something special!", "helpfulness": 1, "user": "lesley l", "date": "September 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178687065}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "I would happily go back.", "title": "great hotel, but...", "helpfulness": 1, "user": "andre j", "date": "September 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 178501633}], "location": {"country": "Caribbean"}, "stars": 4.5, "variance": {"poor": 103, "average": 225, "very good": 478, "terrible": 51, "excellent": 725}, "aka": "The Fairmont Southampton Hotel", "slim_ranking": 0.75, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "The Fairmont Southampton, Bermuda is a luxury resort perched on Bermuda's stunning south shore with miles of pink sand beaches. Conveniently located in the mid-Atlantic, less than a two-hour flight from most east coast gateways, this hotel is perfect for getaways year-round. Sitting on nearly 100 gorgeous acres dotted with lush bougainvillea and towering coconut palms, The Fairmont Southampton is Bermuda's largest full-service luxury beach resort boasting 593 rooms and 6 floors with amazing views of ocean and sound. Unparalleled amenities are offered throughout the property. Spend your days relaxing at the resort pool, or pull up a chaise lounge at the sprawling private oceanfront beach club with Dive Centre, 11 tennis courts, jet ski rentals, and more. Unwind in the luxurious Willow Stream Spa with indoor spa pool & fitness facility, or tee off at the Turtle Hill Golf Club, an award-winning 18-hole par-three championship golf course. The Fairmont Southampton has dining covered for even the most discerning palates with an impressive range of restaurant options. Family-friendly, the hotel offers a kids camp for day & evening. Free round-trip ferry service is available to the Fairmont Hamilton Princess, located in the island's downtown district. Guest rooms feature AC, 42\" flat screen TV with multimedia panel, spacious work desk, 2 telephones with voicemail, dataport, Keurig coffeemaker, tea kettle, mini bar, large walk-in closet, iron & ironing board, personal digital safe, private bathroom, hairdryer & bathrobes, and WiFi Internet access is available (fee). The Fairmont Southampton is a AAA Four-Diamond award-winning resort. The Turtle Hill Golf Club was named one of the top 5 par-3 courses in the world by Golf Magazine. The Willow Stream Spa won the 2012 Conde Nast Readers Choice Award for best hotel spa in the Caribbean. In 2012, Conde Nast called The Fairmont Southampton one of the top hotels in the Atlantic & one of the best golf hotels in the world."}