{"user_rating": 4.0, "review_count": 268, "name": "The Jesselton Hotel", "reviews": [{"rating": 4.0, "title": "Really nice heritage-styled hotel", "text": "The Jesselton is designed with its heritage in mind when it comes to architecture and decor. It's a very pretty little place, the rooms are quite big and very comfortable. Location is excellent on Jalan Gaya, easy to walk everywhere. The staff were very very helpful and attentive. Breakfast was included which was fine if you prefer a western style breakfast but you don't get much of a choice. But there's lots of other places to eat nearby. All in all a very comfortable stay and service was excellent.", "user": "emypie", "date": "July 3, 2010", "id": 69586628}, {"rating": 4.0, "title": "Colonial spendor in the middle of the city", "text": "We loved the Jesselton Hotel with its slightly faded colonial spendor, and were very comfortable there. Staff were charming and helpful from the doorman in his tropical whites with pith helmet to the maids in their frilly caps and aprons. It's situated right in the middle of Kotakinabalu, so one steps out right into the fascinating streets and markets. In fact, the big Sunday Street market is outside its door. It has become a little shabby - the marble tiling in the bathroom, for example, could have done with a bit of grout whitening, but this was minor and, for us, did not detract from its unusual charm, and it is very clean. I wished I'd packed my sweeping skirt and lace parasol to be in tune with its ambience.", "user": "MaryFremantle", "date": "June 19, 2010", "id": 68006095}, {"rating": 1.0, "title": "Avoid the Bella Italia restaurant on the ground floor", "text": "It was a Sunday afternoon, and friends and I wanted to have a quick and good lunch on the way to the airport.", "user": "GJaga", "date": "June 10, 2010", "id": 67034450}, {"rating": 3.0, "title": "No idea why it is a 4 star hotel?", "text": "And boy, were we dead (very nearly too) wrong when we went to the Bella Italia rest. on the ground floor of Jeselton Hotel in KK. It was quiet for a Sunday lunch - always a good rule to follow: if its empty, there is a reason.", "user": "RuthThomson", "date": "June 2, 2010", "id": 66231135}, {"rating": 4.0, "title": "They have maids in proper uniforms", "text": "Three out of four were down with food poisoning after the lunch there. It was the seafood there: fish &/or the calamari.", "user": "caravandetta", "date": "May 29, 2010", "id": 65774254}, {"rating": 3.0, "title": "A disappointing stay at the Jesselton.", "text": "We stayed here for four nights, and were quite disappointed in our stay.", "user": "backtoback", "date": "September 5, 2010", "id": 78331871}, {"rating": 1.0, "title": "This hotel has bed bugs. Do not stay!", "text": "The room was ok, nice bed, bathroom has that mouldy smell. Outside though was alot of noise from the air con and our room was connected to the room next door which was quite unpleasant as it was not very soundproof and on the first night we could here the guy next door snoring like he was in a bad next to us.", "user": "kmp101", "date": "August 31, 2010", "id": 77659071}, {"rating": 5.0, "title": "friendly, helpful staff and well appointed room", "text": "Breakfast was very odd. Each morning we would be given a menu which had several items on it, however, before even looking at the menu we were told that our breakfast was to be the American one. Given that my husband and I don't eat eggs, beans or fried breakfasts in general we felt this to be quite disappointing as we were left with toast (their chicken sausages were revolting). The staff seemed to work all through the day and night too and at breakfast they seemed not at all together.", "user": "HelsBells_9", "date": "August 29, 2010", "id": 77320186}, {"rating": 4.0, "title": "Excellent stop over location which is very central to KK", "text": "There was also quite a distinctive smell in the lobby area and on the corridors which I found nauseating after the 2nd day.", "user": "Surrey 13", "date": "August 14, 2010", "id": 75118144}, {"rating": 4.0, "title": "Dated but still charming", "text": "For a 4 star colonial hotel, we were left disappointed and regretted staying there, especially as there were so many other choices in KK.", "user": "SwedishMagnus", "date": "July 30, 2010", "id": 72964571}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The Jesselton was built in the 1950s and was probably the best hotel in town at the time. Its doubtful it still holds that title though it may not be far off. Its situated in the city centre though not on a main road so isn’t noisy. It tries, and succeeds, to achieve a feeling of colonial elegance-the pith helmeted bell hop at the door is a nice touch. Our room was classed as ‘de luxe’ was of a nice size and was well decorated, very clean and with tasteful decor. It had fridge, TV and mini bar and I would say it was a nicer room than the one we had at the Hyatt, though the Hyatt benefitted from a sea view.", "title": "A Touch of Class", "helpfulness": 1, "user": "LS13", "date": "February 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 56668991}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Negative points were that the bath was somewhat scratched and looked a little shabby though the rest of the bathroom was fine. There were also a few mosquitos in the room, probably due to a preview guest leaving the window open. We informed reception and they sprayed the room while were were out and left a plug in mosquito repellent which was good customer service. Breakfast was included in the price but we had an early start so didn’t have this.", "title": "Small independent hotel in the center of town", "user": "rpennie37", "date": "February 20, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 56599508}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled solo", "text": "I happened to look in the guest book and the comments were all complimentary with a number of people describing the Jesselton as the best hotel in KK. If you’re looking for good quality, with a bit of individual style, this is a good choice.", "title": "Luxury and location", "user": "webofwine", "date": "February 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 54963045}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We stayed 2 nights in the Jessleton, having been in Sandakan for 3 days in the Rainforest. It was Ok but just needs some little touches, no internet and breakfast is average. However Internet cafe across the road and handy for the shops", "title": "Time is standing still in the Jesselton", "user": "kink01", "date": "January 31, 2010", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 2.0, "service": 3.0, "rooms": 2.0}, "id": 54878709}, {"rating": 4.0, "title": "Very pleasant.", "text": "The hotel was very pleasant, clean, comfortable, with all the right amenities. WiFi in the lounge but no business center, so you have to have your own computer. But there are internet cafés just one block away which are at a very reasonable price. Service was satisfactory. Breakfast, which is part of the price, is also satisfactory, but the order in which the fruit/eggs/toast/coffee-tea come is erratic. But go with the flow. The front office can organize day tours and tours to other parts of Borneo. Found the tours all very efficient and on time. Hotel is central to town which is key to be able to get around without public transport. Best to have rooms away from the back side of the hotel which is located on a main street (though relatively well insulated, you still hear the hum of traffic).", "user": "Traveller_forever61", "date": "April 14, 2010", "id": 61292515}, {"rating": 3.0, "title": "good value", "text": "this hotel was good value. Clean and comfortable., not frills. Good location. Restaurant was lacking in atmosphere, but it is near to lots of really good place to eat. We used the hotel between trips, turtle island,river trips and climbing kinabalu. The hotel kept our excess lugage and did our laundry.", "user": "lakedistriktgardener", "date": "March 29, 2010", "id": 59861021}, {"rating": 2.0, "title": "Keep valuables with you at all times", "text": "This hotel is cheap and I guess you get what you pay for. The room was quite large and they provided a cot for my son, as requested. We were thankfully only staying for 1 night but it served a purpose.", "user": "Osric", "date": "March 18, 2010", "id": 58914551}, {"rating": 5.0, "title": "Classy Boutique", "text": "The doorman was very attentive but that's about the best thing I can say about the staff. Reception staff were ok; restaurant staff were terrible - they had to be asked about 3 times for almost everything and their English was fine so they were just disinterested.", "user": "chiumt", "date": "March 5, 2010", "id": 57837238}, {"rating": 4.0, "title": "Spacious rooms, friendly service", "text": "We believe we had money stolen from our room - very difficult to be sure but it's the one time we didn't lock everything away all the time - this is our fault - however, be very careful if you decide to stay here.", "user": "semi-detached", "date": "March 5, 2010", "id": 57772465}], "location": {}, "stars": 3.5, "variance": {"poor": 7, "average": 31, "very good": 142, "terrible": 8, "excellent": 80}, "aka": "Jesselton Hotel Kota Kinabalu", "slim_ranking": 0.125, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}