{"user_rating": 4.0, "review_count": 112, "name": "The Milestone", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We are from Tempe, AZ and this was our 4th year in row vacationing in Ogunquit. We have stayed at the Milestone all four years and had a enjoyable experience each year. The staff have become more like friends, but continue to treat us like the customer. The rooms are clean/roomy and the location is perfect. We didn't have the best weather this year, but with managements knowledge of the area, they were able to suggest new ideas and areas we had not yet seen the previous three years. Very friendly and customer focused team at the Milestone. Had a wonderful time...again!", "title": "4th Enjoyable year in a row!!", "user": "atruss1", "date": "July 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 34436602}, {"rating": 5.0, "title": "Milestone-Best deal in Ogunquit", "text": "Henry-Newton, Ma.", "helpfulness": 1, "user": "grampysmurf", "date": "November 15, 2008", "id": 21879121}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The Milestone is one of my favorite places to stay. I go there frequently, spring, late summer, early fall or as often as I can make it. The place reflects its management which is excellent. It is very clean and well priced. They have an expanded continental breakfast also. It is in a highly competetive resort area, but I think it is the best deal in town. I am a frequent traveler, and this is one of my favorite places to stay.", "title": "Great Time Three Years Running", "helpfulness": 1, "user": "Elvis123Tempe_AZ", "date": "July 26, 2008", "detail_rating": {"business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18275602}, {"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We have stayed at the Milestone for three straight years and all have been very enjoyable. The staff is personable and very knowledgeable of the area. They always seem to point us in the right direction. The rooms are very clean and the entire site is well maintained. They offer many amenities such as the fitness room, continental breakfast, well equipped rooms, and much more. I look forward to my visit each year!", "title": "Dissapointed", "helpfulness": 4, "user": "johnnymcc722", "date": "July 8, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 17675994, "likes": {"liked": "— Nothing", "disliked": "— No HBO or on demand to maybe rent movies at night very basic room"}}, {"rating": 5.0, "title": "Great place to stay!", "text": "I could not believe that this hotel charges $236 per night. I equate to a fleabag motel in my hometown. They have a lot of nerve. Its wasnt worth $100. The rooms are basic and nothing special. Management was less than accomodating and somewhat rude. We were going to stay for 3 nights but we ran from there after two nights and found a much better hotel and cheaper for $120. My advice do your homework before you go to Ogonquit there is plenty of loging to go around. At the milestone there were probably four people total. Now I know why. The room was loaded with insects and wife woke up with bites form something all over her legs. We were so dissapointed how do they get away with this?", "user": "hollys_sam", "date": "October 6, 2007", "id": 10046454}, {"rating": 5.0, "title": "Moon Over Milestone", "text": "For a quick unplanned get-a-way during the height of leaf peeper season The Milestone was an extremely affordable and pleasant choice. Considering the in-season rates still applying to the Ogunquit/Kennebunkport areas, this was a exceptional value for a very very competitive price.", "user": "kasey363", "date": "October 26, 2010", "id": 84927819}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We had a queen size bed room in one of the front buildings, the room was very spacious, with a over-sized counter refer and ample counter space. Table and two living room style chairs, large desk and bureau. Large flat screen TV, updated furnishings, flooring and a good size bath. Property is extremely clean, rooms are spotless. Housekeeping was excellent.", "title": "Great for a basic stay", "user": "Persnickety62", "date": "October 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 83964612}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "A continental breakfast is offered (coffee, bagels, muffins and the like) but there are too many local breakfast places to enjoy - so we didn't partake. The property itself is large with multiple buildings, all with ample front door parking and your own provate entrance/porch/chairs to sit in outside. This would be a good summer location also due to it's proximity to Footbridge Beach which the road to is practically across the street. Good size outdoor pool also for those that don't the like bone chilling waters of the Maine Coast!", "title": "We loved our stay at the Milestone.", "user": "Maryweather", "date": "September 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 79971822}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "It is in a good location to go south to the charming town of Ogunquit with all it's shops, restaurant choices and coastal strolling. A quick 20 minute ride to the shopping outlets of Kittery, or in the opposite direction to quaint Kennebunkport. Good access to Maine Turnpike (approx 1 mile) - and plenty of antique shopping all along RT 1 (in both directions - York to Wells).", "title": "A great motel for your Maine vacation", "user": "Familyof5_CT", "date": "August 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 76452032}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "There are also many good local restaurants within walking distance of this property, or many, many within minutes in either direction. From diners to white table cloth it can be found here. This is a great area no matter the season, a charming section of the New England coast. Fun to explore all the local shops, walk the beautiful town beaches, enjoy some good food, wine and local craft brews.", "title": "Nice place to stay", "user": "skinc51", "date": "August 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 76095453}, {"rating": 2.0, "title": "i expected more", "text": "i expected a more understanding attitude from the desk person when at 2 o'clock in the afternoon,we explain that we had to go back home(quebec city)because of a burglary...they charge us for the night to come anyway...no discussion possible...as a customer for many many years,i expected more than: sorry,i have to charge you...", "helpfulness": 2, "user": "trav", "date": "September 21, 2007", "id": 8841434}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "My husband and I stayed at The Milestone for one week in August, 2007. Having been in Ogunquit before, we were fairly familiar with the area, but this was our first stay at The Milestone and it was great.", "title": "Great Motel, Wonderful Location, A Must Stay!", "user": "lauramoclara", "date": "September 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8712124, "likes": {"liked": "— Great location, friendly staff, affordable", "disliked": "— Nothing, perfect"}}, {"rating": 3.0, "title": "Further out than represented", "text": "The motel is one of three properties owned by the same company - they own The Milestone, a motel with more reasonable prices; Juniper Hill and Gorges Grant, both higher end, more luxurious establishments. We were looking for a place to stay that was affordable (a tough thing to find in Ogunquit in August!), but not overly expensive since we didn't plan to spend too much time at the hotel. This place was perfect.", "helpfulness": 1, "user": "gascolator", "date": "September 4, 2007", "id": 8618454}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "The staff was friendly and welcoming, the room was clean, bright, big, and included a fairly large fridge, coffee maker and a nice bathroom. I am not a fan of motels in general, I prefer to stay in hotels, but this is a place I would stay again. The soap, lotion, shampoo and condition they leave you are Bath and Body Works products! They also offer a continental breakfast with includes donuts, cereal, coffee, tea, hot chocolate, juices, and muffins. It's simple, but everything tasted great. It was perfect because we aren't big breakfast people and we were more interested in just grabbing something quick and starting our day. Each room also comes with a tray so you can grab breakfast and eat in your room, or on the porches offered for rooms on the second floor of higher. (the first floor rooms seem to all have patios. All have a few chairs so you can sit and relax.", "title": "You Can't beat this Place", "helpfulness": 3, "user": "TRAVELINGWIL", "date": "July 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8193542, "likes": {"liked": "— IT'S ALL THE BEST", "disliked": "— LEAVING TO GO HOME"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "It's in a safe location, with easy access to Footbridge Beach (a five minute walk down a quaint side street), which is a lovely stretch of soft white sand; and great restaurants, check out Napoli Pizzeria (just next door) for awesome pizza, and the Beach Fire Restaurant (across the street) for delicious dinners. I suggest the crab cakes with roasted red pepper cream sauce. The motel is on Rt. 1, the main thoroughfare that runs north to south and gets you to Ogunquit, York, Wells and Kennebunkport, but it's located slightly away from the main congestion of town -- a plus in that it was central but seemed much quieter and there were fewer people wandering about.", "title": "Most Disappointing Experience", "helpfulness": 7, "user": "NENative", "date": "September 21, 2006", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 1.0, "location": 2.0, "rooms": 3.0}, "id": 5822155, "likes": {"liked": "— Maid service was reliable and efficient", "disliked": "— Terrible breakfast; lack of any amenities or service"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "I was hesitant at first with this being our first trip to Ogunquit area and not staying at a hotel chain, but upon arriving, we all loved it! I have a 6 and 8 year old and there was enough room for the 4 of us in a standard room. We were on an end and didn't have any one above or below us. We never heard the family next door. The view and pool was great along with the staff. The walk to the beach was convienent and the trolley was just as easy to take to get to Perkins Cove and Marginal Way. We would definitely stay here again. Very close to many restaurants.", "title": "great location and perfect for family of four", "user": "tripFamily_10", "date": "August 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 74373974}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Never having been to Ogunquit before, I booked our motel based on the reviews I read here on tripadvisor. I was pleasantly surprised! We stayed in the deluxe room (I think they are further back from the road and more updated) and the room was very nice. Extremely clean - updated and large. The motel came with wireless internet, hbo and had a pool/hot tub (which we did not use). The trolly stops right in front of the motel which is nice too. I would stay at this motel again!", "title": "Great motel - would stay again!", "user": "boltec23", "date": "July 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71642034}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "At the last minute we called on a Friday and booked a room for an overnight. We were told the rate would be $149.00. When we arrived, we asked if there was an AAA discount and was told there was, and they didn't know what the exact discount would be, but they'd let us know.", "title": "Should have been better for the misleading price...", "helpfulness": 2, "user": "hollybloom24", "date": "July 2, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 69486135}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The room was very mediocre, although it was clean and quiet. We were on the first floor, across from the pool. They have decent bath products by Bath and Body Works and small fridges. I thought the pool area was very nice, and you can walk to the beach from the hotel in about 15 minutes, although it is a long walk when you are dragging beach chairs and young kids. Bring a cart or a wagon if you have lots of stuff. I thought the continental breakfast was terrible, consisting of stale baked goods and breads, make your own oatmeal, some cereal, some beat up fruit, and weak coffee.", "title": "A nice place to stay in a great area", "helpfulness": 1, "user": "rslacx", "date": "September 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 40646199}, {"rating": 5.0, "title": "Wonderful", "text": "The staff at the front desk when we checked in was very nice. When we went to check out, they could not have been ruder. I ended up asking what my AAA rate was, and it went from $149 to $119, but then they charged me $15 per child (2 kids) which brought my rate back to $149! Of course they never mentioned charging for children when I booked the room. That's what you get for being honest. And yes, they ate a stale bagel each at the buffet, - hardly worth $15! Checkout time was at 11 am - my kids were in the pool at checkout time and I asked if they could stay a bit longer in the pool and was told no (even though the pool was empty. We were even using our own towels.)", "user": "Bonbon62", "date": "August 12, 2009", "id": 37514599}], "location": {"country": "United States", "city": "Ogunquit"}, "variance": {"poor": 5, "average": 8, "very good": 39, "terrible": 4, "excellent": 56}, "aka": "The Milestone Hotel", "slim_ranking": 0.540540540541, "description": "The Milestone is a perfect combination hustle and bustle and relaxation. Our rooms are close to the beach, restaurants and shops, while being set far enough away so you feel like you can enjoy the peace and quiet. Lush grounds, affordable rooms and excellent service will make you feel like you're at a five star resort without the expensive price tag. Hang around the property and enjoy our top notch facilities like the fitness center and heated pool, or venture out and take a quick stroll to the village and restaurants. If you want to enjoy the scenery along the way, simply hop on the seasonal shuttle bus for a quick, easy ride."}