{"user_rating": 4.5, "review_count": 128, "name": "The Savaiian Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "I completely agree with all the excellent reviews. You can stay in your own bungalow, dont need ac because the fans they have are so strong you will shiver. Quiet relaxing spot. Laze in the hammock in the beach side fale all day long. Play chess, checkers, monopoly or table tennis, kayak, snorkel and enjoy the excellent food and great service. They dont have a beach, but neither do most of the places that charge you about 5 times more. If you are a beach person, take a 10 minute ride up to Siufaga beach (1 tala per person by bus each way). You can even go and use the awesome facilities at the Siufaga Beach resort (they have a great swimming pool with a pool bar and spa) for the price of a drink without paying for accomodation in the most expensive resort on Savaii. You have nothing to lose and everything to gain by staying at the Savaiian.", "title": "Definitely go there.", "helpfulness": 1, "user": "Austen29", "date": "June 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66661867}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "Me and my friend have totally enjoyed the stay at Savaiian Hotel, not as pretty as a resort, not as classy as a hotel, it really is a motel, is above standard for the price. Its not a beach, remember to bring swimming shoes, its rocky shoreline, great and safe for kayaking which we did almost everyday! The food is good, relax at the bar, dont expect too much of the swimming pool, its small and chest high only, but its so hot there that you just enjoy and relax anyway. Its close enough to the main town of Savaii, go to the market and walk about, take the bus for a ride. Tried to eat out one night, it was disaster, so learn my lesson to stay in for dinner, Poi is a good cook. My best time in Savaii is the day tour with Poi, up to the vocanic crater, dream of gaint creatures and little people settlement within the wild unseen forest inside the crater; to the seashore with powerful force of nature, the blowholes and the coral little fish on the rock pool, where did they come from? Finally to the waterfall and swim in its pool to cool down for the day. A tour is a must do when go to Savaii, you just can not get to these places on your own, a guide is needed. Savaiian Hotel is highly recommended for a buget and comfortable holiday.", "title": "value for money, good, clean and comfortable with extra", "user": "micarmen", "date": "May 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 64607600}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "we were not disappointed one bit. learning from the reviews on tripadvisor web and actrually experiencing the place, it was a very comfortable and rewarding trip for me and wife. Poi and Nola and the family and staff were very helpful and caring. wish all the places in samoa were like the savaiian staff and management. they would go out of their way to please you and provide with whatever you asked for. it is truly an excellent example this family has set for samoa's tourism experience. as for Poi and Nola, we take our hats off to you for going out of your way to please your guests and assist in whatever their needs are. the food was excellent and the prizes were very reasonable. that's promoting honesty and care for your guests and promoting a good name not only for your hotel but for samoa itself. we could go on forever in details of our trip, although its a bit short, we did enjoy every minute of it. thanks for everything, we will sure be back hopefully soon. we pray for Nola's situation and hope she will deliver a healthy additional to your good family. we thank your good family as well, your parents and brothers. again, Poi and Nola, keep up the excellent work. phil and aloma", "title": "value of excellence", "helpfulness": 1, "user": "phil1450", "date": "May 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 63894144}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "My daughter and I spent 6 nights at Savaiian Hotel, It has basic rooms with hot water, shower and toilet. Very clean and bug free. And a must A/C I am sure there are flashier places to stay but for value for money it was great.", "title": "Fantastic Holiday", "helpfulness": 1, "user": "kiwitrav72", "date": "May 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 63781798}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "The food was first class, we eat at places like Aggie Greys paying twice the price for meals we had at Savaiin hotel and they were a lot nicer here.", "title": "Definitely worth it!", "user": "adrian0476", "date": "April 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61137031}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We highly recommend a stay at the Savaiian Hotel, when visiting Savaii. It was a great base to see the island from (we rented a car). This hotel is good value: clean, basic, but really has everything that you would need. Don't expect a luxury hotel (they don't ever claim to be this!) but do expect a pleasant stay, friendly service, and a basic, but tasty, restaurant menu. We loved the little pool!", "title": "Excellent Value", "helpfulness": 1, "user": "ShazzOkanaganValley", "date": "April 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 60596412}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Savaii is such a beautiful island and our stay at the Savaiian Hotel allowed us to see Samoa at its very best. Poi and his wife Nola made us feel so welcome and the staff were extremely polite and helpful. We enjoyed the tours of the island that we arranged through the Saviaan and felt we were seeing 'the real Samoa' rather than 'a performance'. Each day we felt more and more relaxed. The meals in the evening were so enjoyable – with the highlight being ‘Poi’s Orca” ... we have never tasted fish prepared in such a beautiful way ... we requested it every night! We would definitely recommend this hotel to anyone - when our holiday was over we left the Savaiian feeling like we had experienced something very very special. Thank you. Anne & Barry", "title": "A wonderful stay where we felt we experienced the 'real' Samoa", "helpfulness": 1, "user": "KiwisWellington", "date": "April 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60229011}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We had a wonderful stay at the Savaiian hotel during our trip to Samoa in January. I think many people who travel to Samoa miss out by not visiting the beautiful island of Savaii, which is an easy ferry trip from the port, which is located just 10 mins from Apia airport. I would highly recommend staying at the Savaiian hotel. It is close to the ferry arrival point, in the village of Lalomalava. Our room was spacious and clean, with all important air-conditioning. As we visited in the quiet season, we really felt like we got special service, with personalised tours and our own waitress who called to our room to take our dinner order, and ask us what time we would like it served ! The food was delicious and very reasonably priced, as was proven by the fact that guests from another hotel came to the Savaiian for dinner as they felt the food was better value than at their own hotel. The hotel rooms look out over the water, as does the restaurant / main building. There is a pool and Kayaks are available for guests. The location is also within walking distance of several of the local villages and shops, which is a good way to soak up the friendly atmosphere and see a bit of the Samoan culture. But the absolute highlight has to be the tours. We did two tours and between the two, we covered most of the island, taking in waterfalls, blowholes, markets, coastline, lava caves, volcanoes, lava-covered landscape, and also swam with turtles. We really felt at home during our stay, and would definintely recommend this hotel to anyone visiting Samoa. Thanks Poi and Nola !!", "title": "Fantastic service in a beautiful location", "helpfulness": 1, "user": "passengerd", "date": "April 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60211108}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled solo", "text": "Staying at the Savaiian was everything I expected and a whole lot more. My room was just fine with some spectacular views. The owners, Poi and Nola, were terrific......always so approachable and helpful. The food in their restaurant was just incredible. My main reason for coming to Savaii was to visit an ancient site called Pulemelei. It's not one of the most accessible sites on the island, it involved a long tortuous hike. I nearly passed out in the heat but Poi and a friend took me there and brought me back safely. The hotel staff alone make you want to return, together with the comfortable rooms, quiet and peaceful surroundings make this an excellent choice!", "title": "Excellent choice!", "helpfulness": 1, "user": "N747PA", "date": "February 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 55783592}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "A fantastic place to stay, beautiful place and definitely value for money. The host Poi is very helpful and planned a few days activities for us, including a sightseeing day with Warren who was basically a walking encyclopedia, just full of knowledge. The food at the hotel was second to none, the price and the portions were unbeatable and the taste was even better.", "title": "Fantastic!", "helpfulness": 1, "user": "reganol", "date": "November 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 50312646}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We stayed at the Savaiian Hotel for one night on our way to the beaches on the northern coast. The hotel is not too far from the wharf where the ferry docks. It is not located on a beach, but there is a pool to cool down in. The Savaiian was well priced and clean. We ate dinner and breakfast at the restaurant. The food was of a reasonable standard and very well priced for Samoa. I don't know if I'd stay there for an extended period of time, but it was great for one night.", "title": "Good accommodation choice in Savaii", "user": "Angelco", "date": "July 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 71171136}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Self-contained rooms are available but we had a 'budget fale' - double bed + two singles - set amid a tropical garden running down to the shore with chickens roaming free and a myriad of birds and butterflies in the trees. Fale had screened louvred windows, ceiling fan and a floor fan for ventilation. Simple 'ensuite' toilet and shower room. Not a swimming beach but there is a pleasant pool by the shore. Bar, lounge and dining area open to view of the lagoon and reef beyond. Delicious food, charming owners and staff - would love to stay there again.", "title": "Away From It All - Perfect Relaxation", "user": "FoxtonCarl", "date": "July 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 70870636}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Great hosts. Poi is doing everything: manager, cook, tourist guide, taxi...", "title": "Great value - Perfect for a family", "user": "magai", "date": "July 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 70549845}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Plenty of space for kids. Safe and secure.", "title": "quiet,peaceful.good value", "user": "amysmum578", "date": "July 11, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 70526392}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "They provide a cot and a high chair for our little one.", "title": "A true experience of Samoa, I'll be returning for sure!", "helpfulness": 1, "user": "travelnurse69", "date": "June 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 67758339}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "My Partner & I, had recently got married, we were on our honeymoon, because we stayed with family in the villages, we decided to spoil ourselves, by staying at a resort, what better place to stay in Savaii, than The Savaiian Hotel, it was a hot day, when we arrived in Savaii, after booking in & meeting the owners & staff, we settled in to a self contain fale, located infront of the water,even jumped in the above ground pool.", "title": "HONEYMOON EXPERIENCE", "user": "SAINTV77", "date": "November 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 49436678}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "The owners were great, Poi & Nola, always there for assistance, whether it'd be for breakfast, lunch or tea, including an evening Vailima to whine down & deep & meaningful chats. The staff were more than helpful, we can't express our much our stay at The Savaiian Hotel, meant to us enough, we even hired the hotel's car, so we got to explore the beauty of Savaii, swimming with the turtles & at the Mu Pagoa Waterfall as well, was a highlight. We will pass on our experiences to all our friends & family in Australia, already planning on heading back to Samoa for a friend's gathering in 2010.", "title": "Exemplary Service, Friendly, you feel like one of the Family", "user": "Grimaz", "date": "October 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 46140341}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Upon driving into the Savaiian, the relaxing setting starts to take the stress away immediately. A warm friendly welcome from the Manager Poi with a beaming smile tells you this is going to be a stay to remember.", "title": "An excellent choice for anyone visiting Samoa and Savaii", "user": "Swansonian", "date": "September 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 43515522}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The main reception / dining hall is absolute waterfront, you could skip rocks over the smooth glassy water from your table if you wish, but that would just ripple the surface. The outlook is an uninterrupted view directly back to the main island of Upolu, out across a lagoon and reef.", "title": "Simply Beautiful.", "helpfulness": 1, "user": "dragonflyaus", "date": "July 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36007322}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "The rooms are simple, but add perfectly to the whole feeling of the hotel. We stayed in a bungalow which was totally open style, basically a hut with a Queen bed, 2 single beds and a table and chairs in the main room, and a bathroom off the back seperated by a door. That was it, but it was ideal. Our room had a ceiling fan and a pedestal fan, and the beds were very comfortable. There were louvre windows all round for ample ventilation as well. I could see that these bungalows have the potential to get quite hot in the middle of summer, however there is also an air conditioned option if you want it at a slightly higher rate. Our bungalows were spaced around a huge open grassed area, with a massive beautiful tree as its central point. You drive right to your front door no matter which room you are in. The waterfront bungalows are lined on the other side of the grassed area (you could play a game of Kirikiti in here quite comfortably!!) along the edge of the lagoon, with a fresh water pool at one end. Dont dive in the pool!!!!", "title": "Awesome, Fantastic.... 11 out of 10.. Very very happy...", "helpfulness": 2, "user": "blossom13", "date": "July 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35985440}], "location": {"country": "Samoa", "continent": "South Pacific", "city": "Salelologa"}, "stars": 3.5, "variance": {"poor": 1, "average": 10, "very good": 48, "terrible": 2, "excellent": 67}, "aka": "Savaiian Hotel Salelologa", "slim_ranking": 0.5, "description": "The Savaiian hotel offers comfortable affordable accommodation in 6 self contained units with aircon/en suite bathroom/hotwater/fridge/tea coffee/patio/kitchen facilities available as well as 5 traditional styled fales for those on a tighter budget-all fully screened with ceiling fan and en suite. We provide haven to those wanting to get away from the busy city life and you will not forget your stay in the tranquil village of Lalomalva."}