{"user_rating": 3.5, "review_count": 2142, "name": "The Tower", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "this hotel has wonderful views of the Tower Bridge and River Thames. Rooms are well maintained and comfortable even the bathroom has underfloor heating. Staff are friendly and very helpful. Breakfast has a wide variety of choice and the evening carvery is good value. We have been coming back to this hotel for four years now and the high standard has remained the same.", "title": "Great hotel", "user": "snookiebear4699", "date": "September 12, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118030356}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "We stayed here during de holiday season and we had a great time. The hotel is situated on theRiver Thames with a nice vieuw and is in the vicinity of some mayor historical sites which is a bonus. The hotel itself is clean and the service is good. The quality of the beds is a bit of a probleme, they could do with new matresses. The bar has a great vieuw over the Tower Bridge and thethe River Thames. I'm suere there are better hotels in London, but price quality it's worth its money.", "title": "Nice hotel, great location.", "user": "festos", "date": "September 10, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 117890624}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I had booked through my company for a deluxe double room, however was provided a single room. When I was hesitant during check-in, the lady at the reception said that the room size will be the same as the double, just that they have a single bed put in and gave me a BT internet voucher as a compliment. However, on entering the room, I understood that it is just a standard single room. and as I had to leave immediately for work, I did not get the time to complain and get the room changed. After getting back late from work around 11 PM, I tried to make tea and found that the kettle did not work. So had to get that changed. Even though the room service menu had quite a lot of 24 hr options, the kitchen staff said that some of them were not available. And when the food I had ordered did come, I realised that the room service charges were exorbitant. This should have been highlighted somewhere in the menu. The bath was not quite clean and the shower did not work. Only the hand shower worked. This is definitely worse overall presentation than some of the standard 2 or 3* hotels. I expected 4* quality. Except for the location, there is no reason why anyone should opt for this hotel.", "title": "Disappointing, will try to avoid if I can", "helpfulness": 1, "user": "Priya N", "date": "September 9, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 2.0, "value": 2.0, "service": 3.0}, "id": 117882782}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "Stayed overnight on Sunday 28th August on bed and breakfast basis. The hotel is situated in St Catherines dock admist lovely views of the Thames and Tower bridge.It is within easy reach of central London by tube. We found the rooms and food to be of very good quality and the staff both polite and very helpful . Overall good value thanks for a lovely time", "title": "Great Hotel will be coming back", "user": "RonnieNorwich", "date": "September 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117752771}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "Karen, Joy, Teresa and Lesley", "title": "Very good hotel central and lovely terrace views", "user": "Anne9920", "date": "September 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 117688236}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Just come back from a one night stay as a present for my sister. Not the prettiest building but once inside it makes up for it. Reception very helpful but more interested in trying to get me to upgrade the room. The concierge very helpful and polite when needed to ask for a small item that we had forgotten", "title": "Lovely location, shame about the rooms", "user": "CrystalMiltonKeynes", "date": "October 29, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 10419178, "likes": {"liked": "— The view from the bar", "disliked": "— Scruffiness of the room"}}, {"rating": 3.0, "title": "Great location - poor service", "text": "The room was a very basic 3 star in my opinion, nice view of St Katherines dock (shame not the bridge), bed clean and comfortable. The rest of the room was very shabby, armchairs threadbare, furniture all chipped and tired. Bathroom very dated but saying that overall did not hinder our stay as everything we needed was in the room. Room service was quick when requested also.", "helpfulness": 1, "user": "jaybee111", "date": "October 26, 2007", "id": 10349226}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Breakfast was a farce. We thought we had made it quite early at 9am but even though they use to different locations for breakfast over 3 hour period, we had to queue to get in for 20 mins! Once inside there appeared to be numerous empty tables. The queues continued for much of the breakfast period and cannot understand why all the tables were not in use. Breakfast very fresh and clean and waiters quick to serve so again not a problem.", "title": "Location, Location, Location", "helpfulness": 1, "user": "NogUk", "date": "October 24, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10276699, "likes": {"liked": "— Location and comfortable room", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "Overall though the hotel's location sells it, we had a pleasant stay and as long as you are not expecting 4 star accommodation, it is generally a clean, tidy hotel with pleasant staff.", "title": "Hit and miss I fear!", "helpfulness": 2, "user": "Bob1949", "date": "October 19, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 10129413, "likes": {"liked": "— We eventually got a reasonable room", "disliked": "— we could have been subjected to a smoking, rather tatty room on the 5th floor!"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "My partner and I had a great 2-night stay at the Tower. The location is one of the best in the world surely but the hotel service needs improving. We had to queue for 15 minutes to check-in, we had to queue on morning one for breakfast for 15 minutes. On both mornings we had to ask for tea, tea spoons and toast due to the fact the toaster was not working. The communication by the staff leaves a lot to be desired - not a smile, not a \"Good morning\", no question re. tea, coffee or toast.", "title": "Not a bad hotel - But needs some improvements", "user": "TheGirth", "date": "October 14, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 10076888, "likes": {"liked": "— Location", "disliked": "— Poor service at reception"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "This must be the worst so called \"good\" hotel I have stayed in for years.", "title": "awful", "helpfulness": 1, "user": "kevinlee", "date": "October 13, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 10074674}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "I had stayed here @ 5 years ago and it was bad and so was apprehensive when I was told it was the only place I could get a room in London last week by my firms travel dept.", "title": "Good hotel in great location", "helpfulness": 2, "user": "willdc1", "date": "October 11, 2007", "detail_rating": {"front_desk": 1.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 10068718, "likes": {"liked": "— Large, quiet room. No banging of doors. Great power. Great breakfast", "disliked": "— Very poor front desk service. Hotel stay can feel an a bit impersonal"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "I was charged £286 for a tiny boxroom with a single bed that stank of cigarrette smoke. I was called by a wrong number at 5am and at 6.20 the fire alarm went off and we were told to evacuate the hotel. When we worked out for ourselves how to find the fire escape we were told it was a false alarm, by which time it was 7am and so time to get up.", "title": "Good hotel", "user": "EamonnC", "date": "October 9, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "location": 5.0}, "id": 10058665, "likes": {"liked": "— Location", "disliked": "— Bed quality"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "The hotel is old and dirty and is only used by unfotrtunate business people whose corporate travel departments are non ethe wiser. This hotel stinks. Avoid at all costs.", "title": "Not worth the money hotel very dated", "user": "LuxTraveller", "date": "October 6, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 10046317, "likes": {"liked": "— location", "disliked": "— dated room, very high price"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled solo", "text": "I was booked in here for an overnight stay as I was in London for work and thought I’d look at tripadvisor before heading off to London and was shocked to find the hotel had a rating of only 2.5 and was therefore slightly concerned about staying there, however all turned out to be ok and would definitely stay at thehotel again.", "title": "They can lock me up in the Tower anytime", "helpfulness": 3, "user": "Mamoose13", "date": "October 2, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10028777, "likes": {"liked": "— Great rooms, good food", "disliked": "— N/A"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We initially booked for just one night, left our bags after checking out, after a long day, decided to stay here for a second night. The first night we were upgraded for free to a deluxe room, the view was very nice over looking the thames, found the room really nice. The second night we were just in a standard room, and was told that this room doesnt have a view. I dont think there was actually any difference in the rooms, room size, bed, bathroom all looked the same, and the no view, was a lovely view of the mariner which we actually preferred. The room service we ordered was excellent, the food was great, and service was excellent. My only complaint would be that the pillows in the standard room were very flat and not as comfortable as the deluxe room. I would be happy to say here again, it is in a great location, and well priced.", "title": "Very nice hotel, good location", "helpfulness": 1, "user": "Raymond W", "date": "August 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 117398478}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "I'm in London each year for one weekend, always in July and pretty much change hotel every time depending on the deals I can get. Usually I try to get hotels that are a bit more central but the prices for those went up this year. I found a good deal on this hotel, we needed two doubles and one triple room. Triple rooms are hard to find in London (3 adults at least, so this narrowed our possibilities)", "title": "Good location, altogether good value", "user": "Vinceroundtheworld", "date": "August 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 2.0}, "id": 117397701}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I have to say that even if this hotel is not as central as some others, location is great, great view of the tower bridge (not from all rooms, you can always try and ask but none of our 3 rooms had a tower view), this wasn't as important to us we still got a quiet relaxing view of the back harbour. Tube station is not far and easy to get to everywhere in London, rooms are of a good size for a London hotel (we had a deluxe), clean and comfortable, so is the hotel in general.", "title": "FANTASIC HOTEL THAT MADE MY BIRTHADY EXTRA SPECIAL", "helpfulness": 1, "user": "Joanne G", "date": "August 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117388265}, {"rating": 1.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "You've got two choices for breakfast (front restaurant with view over the bridge and upper restaurant situated on the back of the hotel) English breakfast is pretty good even if I had better, still good.", "title": "The worst hotel we have ever experienced, will never return!! A birthday experience to be forgotten.", "user": "Anna T", "date": "August 28, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 2.0, "value": 1.0, "service": 1.0}, "id": 117350550}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The only downside is personnel, I haven't had to interact alot with personnel but checkin was enough, no rudeness of any kind but, they do not seems the be the sharpest tools ...", "title": "Spot on!", "user": "c870262", "date": "August 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117347654}, {"rating": 2.0, "stay_parameters": "Stayed April 2006, traveled on business", "text": "We stayed here for 10 days in April 2006 on a business trip. First night - we check in after a long flight and find we've been given a queen size room (we had reservations for a king bed). I pointed this out, only to be told that \"that's considered a king size here\". Huh? Then we found that the internet access in the room was not working - this is crucial to our business and a reason we were booked at this hotel. We complained until we were moved the next morning into another room - this time with a king bed, facing St. Katharine's Docks. The internet still did not work - hotel was completely unhelpful as was the barely comprehensible help line. We were happier to be on the St. Katherine's side of the hotel - it's quieter than the side facing the Thames. It took another day or two for the internet access to work (one day it was miraculously connected). In the meantime we'd been given a pass to the \"business center\". This consisted of a hotel room with an old computer and a printer with no printer cables. But it did have internet access.", "title": "Mediocre at best with great view", "user": "PrincessKatja", "date": "November 20, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 10944981, "likes": {"liked": "— View of Tower Bridge, proximity to Tower, St. Katharine's Docks", "disliked": "— Unhelpful, unfriendly staff, terrible beds, few restaurant choices on weekends"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "The room: Nice bathroom and overall nice enough room but the beds were HORRIBLE. A thin mattress on top of a wooden platform. The king sized bed had two thin mattresses on top of a wooden platform and they both sagged in the middle so there was a ridge in the middle of the bed. Very nice view.", "title": "The worst service & appaling security I have ever seen.", "helpfulness": 4, "user": "welshglobetrotters", "date": "November 18, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 2.0, "rooms": 3.0}, "id": 10886860, "likes": {"liked": "— Checking-out", "disliked": "— Complete lack of service, terrible security, like a bunch of amateurs."}}, {"rating": 1.0, "title": "Rescue Me from the Tower!!!!", "text": "Make sure you turn on the \"Do Not Disturb\" switch (it's like a light switch located next to the door) when you go to bed or else Housekeeping will be banging on your door at 7:00am or earlier!", "helpfulness": 4, "user": "NYC-Canuck", "date": "November 16, 2007", "id": 10854466}, {"rating": 3.0, "stay_parameters": "Stayed October 2007", "text": "My family had last stayed at The Tower around 6 years ago on on a weekend break to London. The hotel was then administered by Thistle Hotels and was excellent. There are some plus point about the location in that your room will either overlook the Thames, The Tower of London, Tower Bridge or the touristy St Katherine Docks (these being former spice docks that now house expensive apartments, speciality shops and restaurants in a marina-style environment). The rooms are well furnished and the buffet breakfast very good. The windows are however a 1970's design and single glazed. Unless your room faces the Thames, traffic noise and revellers late at night in St Katherine Docks will be a disturbance. Be aware however that the location is in the business-district of London and the West End with it's theatres, shops and all other attractions are a £4 tube ride away or a 20 minute taxi ride. My visit this month to the Tower was a business trip. The hotel is now part of the Gouman Chain. What a disaster! On arriving at the lobby I was confronted by a huge queue. I elected to leave my bags with the Concierge and check in later in the day. When I returned mid-afternoon the queue was equally as long. I joined the line and 20 minutes later was at the desk. The clerk apologised for the delay and cited a computer failure. I was asked to fill out a registration form and the clerk disappeared for around 3 to 4 minutes. When she returned, she greeted me and asked how she could help. She had clearly forgotten my face or that she had left me at the counter for several minutes. I explained that I had just completed a registration form and gave her my surname again. She again disappeared and returned to explain that the registration form which I had completed minutes earlier was lost and invited me to repeat the process! Eventually I was given a room key to room 228, which overlooked the St Katherine Docks, with a side window to the Thames. I undressed and ran a bath. As the bath was running I heard a noise at my door and on peering through the spy-hole noted a middle-aged gentleman repeatedly trying his key-card in my door. I remained silent and he left. I returned to the bathroom only to find my room door suddenly spring open and a bell-boy usher the same middle-aged gentleman into MY room. The gentleman looked at me in a bathrobe and asked \"who's that guy in my room?\". The bell boy apologised to me for the intrusion and ushered the guest back out into the corridor. I resumed running my bath and then there was a knock on my door. I opened it to find another man who introduced himself to me as \"hotel security\". He enquired as to MY surname. He then wrote it on a piece of paper and walked away. On turning on my TV, the opening screen welcomed \"Mr Possewhite\" to the hotel. I have no idea who that may be. Perhaps it was the gentleman whom the bellboy had escorted in earlier. I tried to contact reception repeatedly, but despite ringing their number for 20 minutes, with no answer I rang the alternative Guest Services number. Again no answer, despite ringing for 5 minutes. In desperation I rang the hotel operator and asked to speak with the duty manager. She indicated that he was busy and would return my call immediately. 30 minutes later, with no returned call, I rang the hotel operator again. She repeated that the Manager would get back to me. After 30 minutes I tried again. Once more I was told that the manager would return my call. After a further 30 minutes, I rang reception, the Guest services numbers and also the Concierge. No-one was picking up the calls, despite my holding for minute after minute. I then decided to go and get a drink in the bar. Afterwards, when I returned to my room, my key-card had been invalidated and I could not get back in!! I went to reception and noticed a lady with a name badge walking around with a walkie-talkie. I asked if she was a supervisor and when I explained my repeated problems, she escorted me to my room, used a pass key to open the door and asked me to check my luggage and belongings to see if they were still there! Fortunately nothing was missing. She arranged for me to have a replacement key. As a reader of this review, you may wish to look at some of our other hotel reviews on Trip Advisor. You will see that we try to make them well-balanced and helpful. We do not go 'looking for problems to report'. This review is I hope a well-balanced and complete appraisal of the Tower Hotel. Unless you simply must stay at ths establishment, I would suggest that you look at any one of the hundreds of other excellent hotels in London, which generally have excellent service. Avoid the Gouman Tower Hotel.", "title": "Great location, ok hotel", "helpfulness": 1, "user": "maht", "date": "November 14, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 10811784, "likes": {"liked": "— Location", "disliked": "— Price"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "Alas, no knight in shining armor arrived and I had to stay for the full 4 nights at The Tower, one of the Guoman hotel sites, in November 2007. I was on the last bit of my honeymoon and was told I was needed in London the following week. As my usual spot - the Marriott at Canary Wharf - was fully booked I asked the company travel agent to arrange something so they booked me here.", "title": "Dissapointing and overpriced", "helpfulness": 1, "user": "LauraWill", "date": "November 5, 2007", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 10606523}, {"rating": 4.0, "title": "What a great location", "text": "My husband and I have just come back from weekend in london and stayed in the Tower Hotel. We were a bit concerned after reading some of the reviews but we found the whole weekend was great. Check in was quick and we were not pestered at all about upgrading. Our room, 449 was very clean with a huge bed, although 2 singles together. Even so it was very comfortable.", "user": "shazza1Fareham_Hants", "date": "November 4, 2007", "id": 10596118}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "The only down side was the view. We could see a small part of St Katherine's dock. But to be fair, why look out the window when you have lovely views outside like the Tower Bridge and the Thames. Everything was only a short walk away, we walked everywhere.", "title": "View? What gets a better view than this", "helpfulness": 1, "user": "williamc", "date": "November 2, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 10530683, "likes": {"liked": "— Location", "disliked": "— Shower"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The staff were all very friendly, nothing was too much trouble. Breakfast was very nice, we did have to wait a little while but the choice was worth waiting for. The breakfast staff did come across as a bit abrupt, but they were all foreigners so that is just their way.", "title": "Service would need to improve before i would go back", "user": "highlandlassie", "date": "November 2, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 2.0}, "id": 10527171, "likes": {"liked": "— clean comfortable room", "disliked": "— location and service in dining area"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "Stayed at the Tower 1st November for one night.", "title": "Poor all round", "user": "annaboyd", "date": "October 30, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 5.0}, "id": 10442828, "likes": {"liked": "— location", "disliked": "— everything else"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007", "text": "Stayed here before and I must complement the group on a enjoyable stay.", "title": "Not bad at all", "user": "dlcm", "date": "October 29, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 10425262}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "As a very frequent business traveller to London, I have stayed at many hotels in the Tower Hill area. My first Guoman experience will likely be my last, unless it's the only option. I had booked a Standard room through my company travel agency, figuring it would be a typical double room. I did not realise that at the Guoman, this meant a tiny single bed crammed into the corner of a microscopic room. The bed was touching the small nightstand which touched the arm of a small fabric-covered chair - which touched the window wall. Literally, that was the size of the room. For the price charged, £200/night when I booked, this seemed absurd. There was a single drinking glass, a single teacup, a single towel. I would have appreciated a second glass - one for drinking from, one for my toothbrush, and a second towel. Small things, but in a hotel that rates itself as the height of luxury... ummm, not with this type of room. Good points were that there was a window that opened overlooking the harbour. (Unfortunately people had thrown rubbish into the window well, which had clearly been there awhile and was unpleasant). The room was clean, although the grout in the bathroom floor held a lot of trapped dirt. Housekeeping team members whom I met in the hall were quite pleasant, although front desk staff were just OK and seemed mildly annoyed that I did not like my room assignment. I have colleagues who have stayed here at other times and had a more \"normal\" size of doube room, but when I asked about having this option, I was told it would be an extra £50/night for a non-refurbished room or £100/night for a refurbished room... which was not in my company travel budget. BTW, only shower gel and shampoo are provided. No hair conditioner or moisturiser, so bring your own if required.", "title": "Just barely average, not impressed", "helpfulness": 1, "user": "SW10UK", "date": "September 18, 2011", "detail_rating": {"value": 1.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 118261040}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "I stay here occasionally for business, and always find the rooms to be clean, spacious and comfortable. There is also often a good view of the Thames and the Bridge, or alternatively St Katharine's dock, which is a great place 5 minutes away to eat. No complaints about this hotel at all.", "title": "Very comfortable", "user": "mervalino", "date": "September 16, 2011", "detail_rating": {"value": 4.0, "location": 4.0, "service": 3.0, "rooms": 5.0}, "id": 118187805}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Before I went to UK, I checked the reviews on this hotel. There are many negative reviews and I was prepared, however my experience there was very good.", "title": "Good Hotel", "user": "Helen S", "date": "September 16, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 118180916}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "The Tower Hotel has a beautiful view of the famous Tower Bridge and the River Thames. I opened my window and the bridge is right there outside like a postcard. My room is not even called a room with views. You may pay a little more and get a room with better views. The location is convenient to the Tube(subway) and london Tower.", "title": "Great location but that's about it!", "user": "PaulandKim_10", "date": "September 15, 2011", "detail_rating": {"value": 2.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 118153180}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The building looks old from outside but inside is clean and spacious( compared with the five star hotel we lived in Paris). The breakfast has a wide variety of choices.", "title": "Fantastic Weekend", "user": "Anne T", "date": "September 13, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 118053727}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "This was one of the cheapest 4* hotels we found when booking thats why we booked this one", "title": "Great Hotel no problembe with it", "user": "JohnCas123", "date": "September 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117676459}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Check in was quick the staff was polite was was great the view of tower bridge was excelent all the staff said hello to you the restraumt is a bit expenxive £14 for a burger and chips but it tasted great there are other restraunts just behind the hotel the bathroom in the room was spotless the bed was nice and comfy better than mine at home so got a good nights sleep the doorman on checkout was very helpfull he run up the road to get a taxi for us so would deffintly stay here again and recomend it I read on here some people have had problembs but we had none the breakfast was ok just like I would have at home", "title": "Great Location and we will be back", "user": "hazdaz", "date": "September 1, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 117530472}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The only problembe was we booked a standard room and on arrivial was told there was not any available but would we like to upgrade to a better room with a better view which we decided to do was only a bit more and got a great view of tower bridge rearly a hotel should not take a booking if they cant gaurantee the room type you booked but I was not botherd as the room we upgraded to we was thinking of booking anyway.", "title": "NICE COMFORTABLE HOTEL WITH LOVELY VIEWS", "helpfulness": 1, "user": "6hikers", "date": "August 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117492476}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "For location this is a great hotel right next to tower of london the tube was closed the weekend we was there but plenty of buses", "title": "Excellent stay 100% recommend to stay at this hotel.", "user": "LeeLeicester28", "date": "August 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117492075}, {"rating": 3.0, "stay_parameters": "Stayed August 2011", "text": "Great location with easy walk to the bus stop and the tube.", "title": "Lack of service", "user": "JONBAX", "date": "August 29, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 117415002}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 4, "variance": {"poor": 185, "average": 436, "very good": 816, "terrible": 139, "excellent": 566}, "aka": "The Tower Hotel", "slim_ranking": 0.298327137546, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Large Contemporary Hotel located at St. Katharine's Dock on banks of the Thames, overlooking Tower Bridge, the Tower of London and the Shard."}