{"user_rating": 4.5, "review_count": 340, "name": "The Mere Golf Resort and Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Popped in again for a return visit to The Mere and wasn't disappointed in the slightest. We had a drink in the spa lounge before heading to their club lounge for dinner. We were instantly seen and welcomed by Duncan who is always so friendly whenever we pop in. They happily put up with my food substitutions, so much so that I felt I had created my own meal completely off the menu. The food was amazing and there was plenty of it- we would especially recommend their fish and chips meal which was easily the money!", "title": "Great food and friendly service", "user": "Sara D", "date": "February 10, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 151822595}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Great service, great food and such a friendly atmosphere. Will definitely be returning as soon as we can.", "title": "Cheshire Spa stay", "user": "nwspm", "date": "February 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151806763}, {"rating": 1.0, "stay_parameters": "Stayed November 2012", "text": "We had a wonderful time at Mere. The staff made us feel very welcome in all areas of the hotel. We loved the stylish decor in the public areas and our Mere view room. The Spa was one of the best we have experienced, large pool and luxury steam rooms etc. My husband used the gym, very well equipped. I had two treatments, a back massage, then a break in the relaxation room before an excellent facial, both therapists were very friendly and caring. We dined in Browns, a great seasonal menu, my dessert of ginger and passionfruit alaska was memorable!", "title": "A calamity", "helpfulness": 2, "user": "LisaAnn1972", "date": "February 6, 2013", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 151515419}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "We enjoyed our breakfast then sadly had to check out, we would have been very happy to stay longer, this hotel is well worth a visit for a luxury break.", "title": "A great hotel", "user": "lisawill", "date": "February 3, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 151292732}, {"rating": 5.0, "title": "A wonderful 1 night away", "text": "Having looked forward to visiting mere for some time I was dismayed at the service, food and hotel TV - only the pool was a slight reprieve. Upon being checked in I decided to visit the leisure club or rather a leisure club with a prison desk. The blond haired lady was incredibly intimidating and her her colleague was flicking her bobble around! The changing rooms and spectacular poolside made me feel better especially the heated pool and jets. This uplift was short lived, no one was manning the leisure bar and after asking for service, scary blond haired lady tried her best to get staff but then giggled with her colleague while looking at me -fantastic service! Her colleague was short with dark hair and ponytail just in case management read this. The hotel rooms are nice but the teles channels only had half working. Club lounge restaurant is a beautiful setting but food and service were poor. 50min wait and confusion amongst the staff respectively. If the owners of this resort live away from it I suggest they come for a closer look, as the setting and facilities give this place potential but whoever is in charge either doesn't care or doesn't know what there doing", "user": "Adam H", "date": "February 3, 2013", "id": 151288561}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Just spent 2 nights at the Mere Hotel and could not fault the hotel in any way. The pool are is spotless and steam room and sauna was great for chilling out after a hard day. Food was excellent and staff are very helpful through out our stay. The room was well equipped with good quality tv and fantastic bathroom. I will certainly stay here again.", "title": "Fabulous Hotel", "helpfulness": 1, "user": "ScottMotherwell", "date": "February 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151193095}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "My wife and I took advantage of a special offer for a night's stay as we were travelling back from the Lake District and we thought we would try out the Mere and use the the spa facilities. Wonderfully comfortable and spacious bedroom with all the facilities you would expect of a quality hotel. A light bulb had blown in the bathroom and this was replaced within about five minutes of my call so it would appear that they value service. Excellent spa facility on site with very large swimming pool and five different spa rooms to test out as well as bracing cold and aromatherapy showers. You could spend hours in there! Even though this is a golf resort hotel we didn't see any golfers around (a plus even though I play golf!) so I presume the resort does its utmost to keep separate areas for leisure visitors and golfers. Very good buffet style breakfast in the morning and you could order eggs any way you like (so much better than the powdered scrambled eggs you get in a lot of establishments)", "title": "Very comfortable stay", "helpfulness": 1, "user": "Throp54", "date": "January 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 150951071}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "This Hotel deserves a real praise and it was a great find in our opinion. Beautiful building, beautifully kept- immaculate throughout, fabulous rooms, friendly staff, wonderful spa- It really does have the WOW factor. It has a real feel of elegance and we would definitely recommend it. Oh and the beds have to be the most comfortable we have ever slept in.", "title": "Brilliant find ....", "user": "skiathostown", "date": "January 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150950752}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "Stayed at the mere again for one night in January. As previously, a great stay, a pity it was only for the one night. The mere gold in the bar was very good, the room comfortable and the breakfast very enjoyable.", "title": "Another great stay", "user": "Arnage_T", "date": "January 26, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 150665156}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "My friend and I were booked to stay at the Mere Golf Resort and Spa. After spending the day in the spa. turned on our phones to find that my husband had left messages all over the place because my daughter had been taken ill and I was required to get back home el pronto to take care of 4 grandchildren,furthermore, for some reason, the car wouldn't start. We were so looking forward to our luxury evening, night and breakfast at the Mere but it just wasn't going to happen. It was very cold and the AA 2 hours away.", "title": "Thank You", "user": "MelodyKez", "date": "January 25, 2013", "detail_rating": {"cleanliness": 5.0, "service": 5.0}, "id": 150620638}, {"rating": 4.0, "stay_parameters": "Stayed January 2013", "text": "Just been treated to a wee spontaneous night away at The Mere by Knutsford.", "title": "Night away in the snow", "user": "ForeignScot", "date": "January 23, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 150347871}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "From the ease of a simplistic booking - a simple phone call which could not have been more helpful or pleasant or friendly.", "title": "Better than an American Sit-Com", "helpfulness": 2, "user": "David W", "date": "January 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150255650}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "The location is stunning, close to Knutsford and set in a beautiful golf course, next door to Tatton Park.", "title": "Highly recommended for the business traveller", "user": "Ztarfizh", "date": "January 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150244788}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "The rooms were sizeable and modern and elagant. The only down point being a fab bed, actually being 2 single be pushed together, with a horrendous firm ridge down the middle!", "title": "a brilliant find", "user": "lovethegoodthings", "date": "January 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 149937460}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "The restaurant had a simple open aspect with fresh local produce and freindly efficient service. Sadly being in the atrium, it could have been warmer!", "title": "Spa retreat was a real treat", "user": "Wannabe1day", "date": "January 15, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0}, "id": 149730870}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We spent one night B and B at the Mere and got a very good rate (£84) through Secret Escapes. It is a little tricky to find the entrance if you come in from the M6 side, and our sat nav directed us to the delivery entrance first of all. The refurbishment work on this place has been carried out to a very high standard, and the new buildings blend well with the old. Judging by the number of Range Rovers in the car park, it seems to be the venue of choice for the Cheshire set. Staff were friendly and helpful throughout our stay. We ate in the golf clubhouse bar in the evening as it was less formal than Brown's restaurant (and cheaper) and the service was very good. Entertainment was briefly provided by a woman screeching at the top of her voice about her partner's soup being served cold, followed by her storming out demanding to see the manager, as her mortified partner tried to calm her down! Breakfast was a more relaxing experience than at other places we have been to and although it was self service, it was quiet and it was nice that they brought the toast to your table, rather than having queue at a slow browning toaster. We enjoyed using the spa, and it was good to see that under 16s were banned from the hydrotherapy pool and there were restricted swimming times for children. The room was a decent size, and it was furnished to a high standard with a spotless bathroom and good quality toiletries. Everything was clean and tidy throughout and it was just a nice peaceful place to be. I think it would be particularly nice to come in the summer when you are able to sit outside and enjoy the view over the lake. It's obviously aimed at golfers, but you don't need to be one to enjoy it.", "title": "Excellent night's stay", "user": "Peejdj", "date": "February 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152427160}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "we stayed at the hotel on friday and saturday night as we were attending a wedding there that weekend, the room was a good size and the bed very comfy. We ate at the hotel restaurant on our first night, the food was fantastic. The hotel staff were very attentive and polite. Breakfast was a buffet style and there was plenty to chose from. we enjoyed a lovely stroll around the grounds before the wedding and the views of the lake were great. All the staff involved in the wedding were excellent and overall we had a lovely weekend.", "title": "lovely setting", "helpfulness": 1, "user": "couple038", "date": "February 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152294044}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "Me and my girlfriend stayed here, for two nights b & b, for a valentines break, everything we could of wished for and much more, superb food in club lounge and browns restaurant, the spa facilities are a must, drinks by the pool, and afternoon tea, were very pleasant , all members of staff were so friendly, and helpful, nothing was a problem, that serve a brilliant latte , for coffee fans, and the seared tuna niscoise, in the club lounge was Devine. A must stay........ You won't be disappointed", "title": "Fantastic service, excellent getaway, defiantly revisit", "helpfulness": 2, "user": "Jakeo2319", "date": "February 15, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 152169937}, {"rating": 2.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "I booked this hotel for what should have been a last minute one night stay for 15/2/13 for 2 adults and 1 child(aged 9) through booking.com. Whilst proceeding through the booking it confirmed number of people & the small print confirmed children under 12 stayed free, child o/12 £ etc. The following morning I received a call stating there was a charge of £35 for the child - no welcome hello or introduction of who the caller was - I had to ask who was calling! I advised of above but was told it was policy for the hotel to ring to confirm the extra fee. I questioned this as the small print stated child free & I was advised that is only if the existing beds were used and as this was a double room there was a charge for an extra bed. From a customer perspective and past experience with booking.com by entering the number of guests I assumed we would all have a bed to sleep? I was advised that if the child slept in the double bed with us there wouldn't be a charge. The young lady stated she would speak with her manager & call me back. Two minutes later I received a return call, no introduction again. She had spoken with her supervisor the fee stood & she then explained how I should have interpreted the small print (I'm not sure that is what trading standards would have expected of me.) She then stated it wasn't the hotels error it was booking.com and they would be contacting them later that day. I may have considered paying the additional fee had the small print not have been so misleading and if I had been treated with some courtesy. Very disappointing service. Perhaps some customer service training is required.", "title": "“Extra fee of £35 for child. Disappointing service - cancelled booking”", "helpfulness": 1, "user": "liza10", "date": "February 12, 2013", "detail_rating": {"service": 2.0}, "id": 151990830}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "My husband and I booked into the Mere for an overnight stay (sat 9th feb) as we were attending a wedding that was being held here. On arrival we were greeted with friendly staff. The wedding itself was fantastic, from ceremony ,wedding breakfast through to the evening Buffett . The staff were very helpfull . On entering our room I thought it had the wow factor, the bed was so comfortable, there were fresh towels ample space in the shower and the whole decor of our room was lovely.The following morning when I pulled back the curtains I was greeted with a fantastic view of the lake. Breakfast was lovely, there was so much to choose from and we could not fault it at all, the staff were very prompt on showing us to our table and providing us with tea/coffee and toast.my only regret is we didn't have time to use the spa but maybe we may get the chance to visit again. IDE like to say a big thank you and well done to all the staff at the Mere hotel for making our time a pleasant stay .", "title": "Great venue.", "user": "p18tey", "date": "February 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 151884550}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 13, "average": 24, "very good": 69, "terrible": 3, "excellent": 231}, "slim_ranking": 0.111111111111, "description": "The Mere Golf Resort & Spa in the heart of the Cheshire countryside is famous for its extensive conference, weddings, spa and golf facilities.The resort's historic main Victorian building inspires feelings of classic charm, accompanied by modern, luxury accommodation and amenities.Located alongside The Mere Lake and close to the picturesque town of Knutsford as well as the bustling cities of Manchester and Liverpool and the historic city of Chester.There are excellent transport links with Manchester International Airport only ten minutes away, a frequent two hour train service to London from Manchester Piccadilly and the M6 and M56 motorways close by."}