{"user_rating": 4.5, "review_count": 619, "name": "The Reefs", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "Just returned on April 13 from a 3 night stay at the Reef's with 5 girlfriends for a weekend away from kids and husbands! We had a wonderful time and we were blessed by warm and sunny days. Since I didn't see any other reviews here on Tripadvisor since the Reef's reopened in early April '08, thought I'd comment on what's going on there.", "title": "Wonderful Girls' Weekend at the Reef's", "helpfulness": 6, "user": "blondfromBeantown", "date": "April 17, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 15094055, "likes": {"liked": "— Views, beach, Longtail Suite", "disliked": "— Pushy spa staff, inattentive, at times. staff at Coconuts during breakfast and lunch"}}, {"rating": 5.0, "title": "The Reefs is Fabulous", "text": "The Reef's, as other reviews have captured, is a special small hotel on an unbeatable location on a lovely small beach. EVERY room has a stunning ocean view. All the rooms (I saw 3 of them) were very clean, with excellent mattresses and linens. Flat screen TV's and ihomes (little clocks w/ speakers that you can nest you Ipod in for music) in our room. Some of the furniture was a little tired as well as some of the bathrooms. However, our Longtail Suite bathroom, which was huge with a jacuzzi tub, separate shower, two sinks and separate W.C. seemed to have new tile and some new fixtures. And we could see that other rooms were being renovated while we were there.", "helpfulness": 6, "user": "PSCMarblehead_MA", "date": "April 15, 2008", "id": 15065936}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The grounds, pool area and beach were impeccable and tasteful. Friendly service on the beach.", "title": "We love the Reefs!", "helpfulness": 5, "user": "Eric22", "date": "April 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15064395, "likes": {"liked": "— The view from our room", "disliked": "— construction"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2005, traveled as a couple", "text": "The new and improved lobby and clubhouse are lovely. While we were there, only Coconuts was opened serving breakfast, lunch and dinner. Dinner was outstanding both in quality of food and in service. Breakfast and lunch were solid, but service is a little slow and inattentive at times (shouldn't have to wait and wait and wave down a waitress for water or more coffee).", "title": "Great Honeymoon Spot", "helpfulness": 4, "user": "SSSNES", "date": "March 17, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 5.0, "location": 4.0, "value": 4.0, "rooms": 3.0}, "id": 14342519, "likes": {"liked": "— VIEWS/BEACH/POOL", "disliked": "— DECOR OF ROOM/DISTANCE FROM ATTRACTIONS"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "I'm not sure when the other restaurants will reopen, but the clubhouse did have a lounge open on Fri and Sat. nights with live music (pianist or guitarist). We ate in Hamilton at Astor's one night (very good) and at the Waterlot Inn (over-the-top excellent!). We partied a litte at Elbow Beach Hotel since the Reef's was soooo quiet at night.", "title": "Loved it!", "helpfulness": 2, "user": "rmfog1", "date": "December 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 11656980, "likes": {"liked": "— Staff, Beach, Room views", "disliked": "— room decor"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "I have just had a wonderful 6 night Easter break in Bermuda, staying at the Reefs in Southampton.", "title": "Fantastic Hotel, Amazing Island", "helpfulness": 4, "user": "jb812", "date": "April 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 128287286}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "This hotel is a relatively small independent hotel where everything is about quality and high levels of customer service(if you are looking for a large resort style hotel, with lots of guests and a huge range of services / laid on entertainment - this is probably not for you). I was lucky enough to stay in a newly renovated (so recently done you could still smell the paint in the corridor) cliff side room (under the terrace). The room was spacious even when the sofa bed was down for my daughter. The room is of a good standard, with a lovely modern shower room, huge comfy bed and a flat screen tv with a huge variety of cable channels. The room also has a large balcony, looking over the beach and sea (probably one of the best views of any ocean view rooms I have stayed in previously.", "title": "Excellent vacation destination", "helpfulness": 3, "user": "S L", "date": "April 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128122886}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The hotel public areas are well maintained, and the swimming pool and hot tub is clean spacious. We spent some time at the beach which was cleaned daily and had fantastic beach attendants who made sure you were enjoying yourself as well as providing drinks / snacks as required.", "title": "Get Away from it all at The Reefs, Bermuda", "helpfulness": 4, "user": "5StarBermuda", "date": "April 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 128067612}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "During our stay we eat each night and had breakfast at Ocean Echo which had a great range of high quality food, however it was the staff in the restaurant that particularly made it such a pleasure. I can not commend them all enough for their friendly professional service, the way they looked after my daughter Georgina was brilliant and made our stay so much more relaxed.", "title": "Highly recommend - 2nd visit", "helpfulness": 2, "user": "Valerie B", "date": "April 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127767496}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The Island of Bermuda is also very impressive, very friendly locals, beautiful sights, and great public transport that will take you anywhere in the island quickly and cheaply.", "title": "An excellent choice.", "helpfulness": 2, "user": "DavidIanFoster", "date": "April 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127629684}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Can't think of one bad thing to say about The Reefs. We just returned from our honeymoon - 8 fantastic nights at the Reefs. The staff, food, service, location, beach are all fanitastic. I'm normally ready to come home after a few weeks away from home (had been away somewhere else the two previous weeks), but really did not want to leave The Reefs. We will definately be going back as much as we can!!", "title": "Absolutely Fantastic!", "helpfulness": 3, "user": "freq_flyers", "date": "July 30, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 8260936}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "My husband and I just returned from a week's stay at The Reefs, our fifth visit to the property. While this is one of the best small hotels in Bermuda as far as location and service, it does not compare with five-star accommodations in the US, Caribbean or other vacation destinations. Anyone expecting a Ritz-Carlton, Peninsula or Four Seasons experience will be sorely disappointed. However, if you like the more casual and less pretentious charm of Bermuda, The Reefs is an excellent choice.", "title": "Repeat visitor enjoyed another stay at The Reefs", "helpfulness": 7, "user": "Br00klynTraveler", "date": "July 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8254974, "likes": {"liked": "— Beautiful setting", "disliked": "— Construction noise, small rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Front Desk: we've found the front desk staff to be friendly and helpful but not always overly competent. They seem to be younger and more inexperienced every year we go. Expect a wait for your room when you check in - guest check-out time is noon, check-in time is 3PM and most flights arrive on the island between 11AM and 1PM. Bring your beachwear and expect to spend a couple of hours on the beach before your room is ready.", "title": "Reef Repeater", "helpfulness": 6, "user": "witchcity", "date": "July 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8079263}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "Rooms: we stay in Premier accommodations (second floor of the two-story accommodations) and the rooms range from average-small to small. Our room this year, Oleander #345, was one of the smallest we've stayed in. The Reefs has overhauled their tired furniture and now boasts dark wood furniture, simple contemporary bed linens and flatscreen TVs in all rooms. We've never had an updated bathroom at any of our rooms, though some of the rooms allegedly have changed the current tile to marble.", "title": "Best place to get married and honeymoon", "helpfulness": 9, "user": "0808", "date": "June 13, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7844909}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Dining: all three restaurants require reservations, though guests are always guaranteed a seating at the indoor dining room Grill 56. Make your dinner reservations at least two weeks before you arrive or you'll regret it. Grill 56 and Coconuts have the more sophisticated menus, with Ocean Echo a more straightforward grilled fish/meats menu. Coconuts is open for lunch and there is a bar above the beach for drinks throughout the day. Beach drinks service can be painfully slow, though it's the fault of the single overworked bartender, not the wonderfully attentive beach staff. Overall, food service is slow and not always professional (multiple attempts to get wait staff's attention, multiple requests for bread/water refills, some inaccuracy in explaining the dishes on the menu, little knowledge of wine) but friendly.", "title": "Not a Resort Honeymoon Spot But Cozy", "helpfulness": 7, "user": "Dlphin3", "date": "June 6, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 7795628, "likes": {"liked": "— Pool and View", "disliked": "— Totally an older crowd"}}, {"rating": 5.0, "title": "Wish I Was Still There", "text": "As I sit here at my desk answering e-mail and generally living the daily grind, my mind wanders to my wonderful trip to Bermuda, and my fantastic stay at The Reefs. I was there attending a friend's wedding, which was an intimate and polished affair. I was completely charmed by the general atmosphere and had a total blast the entire time. It's a lovely little hotel, very intimate and Bermuda-authentic. The staff is friendly and attentive. The private beach is quiet and relaxing. And dinner at Coconuts on a clear night is a real treat. It's a bit of a haul to get into some of the more touristy haunts, but the staff is ready and willing to set you up with a bus map or a taxi, and it's pretty easy after that. I suggest a taxi-- most of the drivers are good for a bit of trivia and a laugh.", "helpfulness": 4, "user": "chinook211", "date": "November 30, 2007", "id": 11174600}, {"rating": 5.0, "title": "Cannot wait to return", "text": "What a great place to stay, the beach is breathtaking the rooms although a little small are very tastefully decorated besides who spends much time in the room. My husband and I loved sitting each night eating our dinner and listening to the waves crashing and the tree frogs singing. The staff is lovely and very friendly. We both cannot wait to return (we hear they have great repeaters parties).", "helpfulness": 5, "user": "Cassava6", "date": "November 29, 2007", "id": 11147349}, {"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "I was married at The Reefs in late May, 2007. I would NOT recommend this as a wedding location to any bride-to-be.", "title": "HATED The Reefs", "helpfulness": 23, "user": "MJ26", "date": "October 22, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 10231592, "likes": {"liked": "— Location & Views", "disliked": "— Everything else"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "This hotel is repeatedly splashed all over magazines for its magnificent service, attention to detail, and has been ranked as high as the 4th best hotel in Carribean. Having experienced it first-hand (as a VIP guest, no less) I have NO idea why? I found the hotel rooms and facilities to be below average and the staff to be nothing but utterly rude and totally un-accommodating", "title": "can't wait to go back!!", "helpfulness": 4, "user": "Veronica4", "date": "October 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 10030979, "likes": {"liked": "— beautiful beach and great food.", "disliked": "— rooms are basic."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "My (now) husband and I are very laid back people. We come from very two humble and gracious families, whose goal was to find a first-class wedding venue with first-class service for the guests who traveled great lengths to be present for our destination wedding. You will not find this at The Reefs. The hotel's \"wedding planner\" is entirely worthless. When it was nearly too late, I realized that I would have to be the one making every last arrangement for my ceremony, on my own, from 600 miles away, without any direction or guidance from the planner. She could barely find the time to return my very simple emails, asking for vendor recommendations (for florists, photographers, etc.) The actions and the utter disregard of the entire staff at this hotel completely ruined my wedding day. Our head waitress was too lazy to even give me a piece of my own wedding cake. Instead, she snapped at me as if I were asking for her first-born child. I could go on and on with the shocking details.", "title": "still love the reefs after all these years!", "helpfulness": 8, "user": "WhiteDiamondScoot", "date": "September 25, 2007", "detail_rating": {"business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 10001582, "likes": {"liked": "— everything, that is why we return so often", "disliked": "— if you have a leg/foot/back problem this is not an easy place to get around. Especially from the Terrace level down to the pool and back up. Many stairs and all uphill from the beach."}}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The beach and the views of it from the rooms are fantastic. Plenty of recreational activities on site. A 20 minute bus ride (I mean a clean & safe ride) to shopping in Hamilton and a 30 minute ride to the dockyard (bus stops in both directions right out front of the hotel). Will go there again soon", "title": "Fantastic", "helpfulness": 6, "user": "Beachesarethebest", "date": "March 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125724467}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Excellent accomodations that make you feel like you are in a home with amenities and not a large hotel. This is a relatively small property that feels spacious because the number of rooms is low and the common area space is large, hence you do not feel crowded. An awesome staff, accomodations, pristine beach with service, complimentary snorkeling and kayak, and the food is gourmet and generally breakfast and dinner are included - you don't need more than that! They do not nickel and dime you and even if you order room service it is the same price as if you ordered it in the restaurant! Up front cost is high but after all is added up you will not spend any more money here than if you stayed somewhere else that is not as good. You will not be disappointed. All rooms face west with balconies and a great view. Our favorite place, we have been there twice.", "title": "The Best", "helpfulness": 6, "user": "HEB986", "date": "March 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125479013}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "The condos are open at the Reefs -- and are discounted while the hotel is closed for renovations and the restaurants are closed. We had the time of our life for one weekend. So beautiful - so wonderful. Not sure I could afford it though at regular prices! The weather happened to be fabulous too (late February). The fact that the hotel is closed means also that the place is almost empty (wonderful for us -- not so much for the owners, I guess). Service was wonderful too -- great people, with great suggestions on where to go and how to get there. Snap this place up while its still good value!", "title": "Fantastic location (and great value until March)", "helpfulness": 4, "user": "ParisAugust2008", "date": "February 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125317418}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "we went to the reefs in february a few years ago. this hotels is perfection. if you can afford it, don't hesitate. the food was amazing , gourmet dining every night. bermuda is absolutely beautiful. beach at hotel small but beautiful. i can't say one bad thing about it, other than pricey but so WORTH it!!!!!!!!!!!!!!!!!!!!!!!!!", "title": "amazing", "helpfulness": 2, "user": "ashley1508", "date": "February 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125106382}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "We had a wonderful time. The room was magnificent...as was the view out the windows. Your staff was friendly and responsive.", "title": "Fabulous.", "helpfulness": 2, "user": "Jomram", "date": "February 20, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 124871049}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "My wife and I returned to The Reefs for our 2nd visit and the trip was very good (3/25-3/31/12). The staff is excellent and the food is absolutely outstanding. There was remodeling activity going on in the original (pool/beach) section of the hotel. Unfortunately, we weren't assigned a newly remodeled room! If you are considering staying there within the next 30 days (4/12), it would be best to wait for this to be completed, or ensure with the front desk that you will not be impacted by the noise as we were. The Reefs is a classy place, and David Dodwell Jr handled this issue for us very nicely. I would highly recommend this location if you're looking for serenity and a great beach. Just try to avoid the construction.", "title": "A return visit", "helpfulness": 1, "user": "mpav7985", "date": "April 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 2.0, "location": 5.0}, "id": 127243241}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "My wife and I spent the third week of March in one of the newly remodeled rooms in the main part of the resort. Sunny and 70 for our 5 day stay. We used the pool and hot tub everyday. Private beach with kayaks, fins and snorkels, and the reefs are less than 150 feet from shore. It was off season so the restaurant on the beach and one of the other restaurants wasn't open, but the food and service at the Ocean Echo was great. Nice location on a bus line, but be prepared for a $40-45 cab ride from the airport. Hope to go back next year.", "title": "First of Many Visits", "helpfulness": 2, "user": "NapperDoc", "date": "March 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126804069}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Over the years I've stayed at most of the hotels in Bermuda, some now sadly gone. But mercifully The Reefs is going strong and as good as ever. The views are among the best in Bermuda and they make a real effort to have a varied, imaginative menu. And there's nothing stuffy about The Reefs - it's always been a welcoming place including those of us who aren't the typical married couple. The management keeps the hotel fresh looking with understated luxury that doesn't feel intimidating or overdone. The international wait staff is first rate and very friendly.", "title": "Still The Best in Bermuda", "helpfulness": 1, "user": "James S", "date": "March 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126788249}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "My daughter, her boyfriend, and I spent the first week of December 2011 at The Reefs. This was my ninth visit to Bermuda but my first at The Reefs (all previous stays were at Elbow Beach before they changed hands and went downhill), and I wasn't disappointed. Although small, especially at high tide, the private beach is lovely and sheltered. In addition to the beach, there's a good-size hot tub and a horizon pool near the main building. The grounds are filled with flowers and kept immaculately clean. The main building is elegantly \"old school\" Bermuda, and where else do you get served a complimentary rum swizzle while checking in?", "title": "First Visit, but Not My Last", "helpfulness": 10, "user": "plet39", "date": "March 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126193344}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We stayed in the two-bedroom Sandpiper Cottage, about 300 yards from the main building and on the other side of the condo section. The bedroom on the ocean side has a very comfortable king bed. The landside bedroom contains two twin beds that can be joined to create a king. Both bedrooms have separate access to the large, nicely appointed bathroom. The furniture in the large sitting area was comfortable, with satellite TV and a desk area with books. There's also a fireplace for cooler nights. The \"kitchen\" area at the other end of the cottage contained a minifridge, microwave, and Keurig coffeemaker with pods, plus complimentary Barritt's Ginger Beer and Gosling's Black Seal Rum for Dark 'n' Stormy cocktails.", "title": "Pure Bliss", "helpfulness": 7, "user": "Merenneito06", "date": "March 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125759992}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We spent a long weekend in late October at the Reefs. It was our first visit to Bermuda and we were not sure what to expect. Our room had a beautiful view of the cliffs and the beach. There are three restaurants with varying levels of formality but all serving excellent food, a nice surprise for us having spent quite some time in poor Carribean restaurants. We did not stray far from the property - between the beautiful beach, the pool, the terrace and our balcony we were very happy. The room, especially the bathroom, could do with some refurbishment given the price of the stay.", "title": "Beautiful location for intimate hotel", "helpfulness": 4, "user": "Max827", "date": "January 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 123863120}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "I stayed at the Reefs for a girls weekend .Thiis hotel is one of the Best i have ever stayed in on Island the scenery the views not too mention the room i stayed in was amazing!!!! The staff also is very helpful and nice they make you feel comfortable. I would recommend the hotel to any one its an experiance of a life time. Like i said it was a girls weekend but would have been even better with a spouse lol.", "title": "The Best Hotel on Island", "helpfulness": 2, "user": "chemeekia w", "date": "January 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123564514}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Thanks again Reefs for a lovely Weekend!!!", "title": "Thirty Five Years of Great Times", "helpfulness": 1, "user": "Luv2Travel93536", "date": "January 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123450590}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "Our first visit to The Reefs was for our honeymoon in 1976. We just made our tenth visit to celebrate our 35th anniversary. Over the years, of course, there have been changes; luckily, the level of commitment to personalized, professional service has never wavered. We are looking forward to our next stay in Tuckaway!", "title": "A New Year's Getaway", "helpfulness": 1, "user": "2LoveToTravel", "date": "January 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 123312497}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "We stayed at The Reefs over the New Year holiday. This was the 6th time we have stayed at this time of the year and we enjoyed the time with 12 of our close friends. The staff of the Reefs went out of their way to provide us with every amenity including housing us for an extra day because of a flight cancellation. They provided a great New Year's Eve party with entertainment and excellent food and drinks.We stayed as always in the cliffside rooms (we understand the bathrooms are going to be redone while they are closed) The view from our room, as in most of the rooms is breathtaking. The food is wonderful, and we welcomed seeing many of the wait staff from previous years. Some in our group played golf, and the rest of us enjoyed just relaxing. We took the ferry boats and buses and traveled about during the day. Bermuda has changed a lot over the years with most of the wonderful stores gone, but still a few left, mostly at the Dockyard. The weather at this time of the year is a llittle iffey, temperature 70 degrees, a little rain and not a lot of sun. But again, we enjoyed being among friends, including everyone at The Reefs.", "title": "Most Memorable Hotel Stay in Bermuda", "helpfulness": 2, "user": "BermudianFlavor", "date": "January 19, 2012", "detail_rating": {"cleanliness": 3.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 123311032}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "If you do not like it here...you cannot be satisfied. If you are looking for a new fancy hotel with a big lobby that nickel and dimes you and the staff wishes you were some where else....don't stay here!!!.. True the Reefs is not brand new and it shows in some areas, but this is by far a great resort hotel. The rooms have neen updated and the beds are very comfy. The views....second to none. The beach is fantastic. And activities on the beach are included. Snorkeling gear, kyaks, chairs and unbrellas all included. We were on MAP plan and ate all our meals at the hotel. Food is fantastic. Service is not at the speed we are used to stateside, but nobody is in hurry on Bermuda. And that is the whole point. This is a place to relax and slow down. Concierge will set up whatever you need. Diving, Horseback ridring. We rode the beach at Spicelands on horseback...awesome!. We just got home yesterday and can't wait to go back. My only word of advise to not book a room directly over the pool. Not much privacy. But, the rooms south of the pool are very private and all have great decks with awesome views. There is a reason this place has been in business for 60 years and has a high rate of return customers. We can certainly be added to list of people who will be back!!", "title": "Awesome!", "helpfulness": 2, "user": "abelgolf", "date": "September 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8693013, "likes": {"liked": "— The Location and Service", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "My husband and I just returned from a wonderful 5 night stay at the Reefs Resort. This was the first trip we took without our daughter and we picked the perfect place. There was a nice mix of couples young and old and some families as well - a perfect blend of vacationers. The staff were all very professional and accomodating - from the front office, bellhop, beach, restaurant and housekeeping staffs. The grounds and rooms were very clean and the staff referred to you as a name, not a room number - a real nice bonus that I appreciated. The #7 bus stopped right in front of the hotel and we used it to get to the Dockyard and Hamilton-very convenient. The infinity pool was beautiful but a bit small to really swim in - more for cooling off and enjoying the view. We were able to snorkel right from the beach and used the hotels complimentary equipment. You can also use complimentary kyacks that the hotel provides but we never did. Because the hotel is built into a cliff you have remarkable views. However, there are a lot of steps to the the beach and Coconuts-defn. not the place for someone with bad knees or hips but perfect if you want to work off your dinner at Coconuts! We ate onsite all but one night and have very good meals. We ate at Pompano one night and felt that The Reefs was a bit superior. The only reason I didn't give my review an 'excellent' is because I thought the bathroom in the room was a bit outdated and at times the restaurant service was a bit slow. But certainly nothing that would force me to complain to management about. Furthermore, if anyone is worried about the construction noise there was none. They are currently excavating in order to addon to the property but construction has not begun yet. I was informed by management prior to my arrival that they will be posting information on their website when construction begins.", "title": "Wonderful Vacation Experience", "helpfulness": 3, "user": "cathycomfort", "date": "August 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 8580278}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We had a absolutely fabulous time at The Reefs in August, 2007. We have been to Bermuda over 50 times, but this was our first stay at The Reefs. The staff was great, the food very good, the room had a gorgeous view, the beach and the pool were wonderful. We will definitely be back.", "title": "We loved The Reefs, we will be back again", "helpfulness": 4, "user": "PhilipWeston_CT", "date": "August 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8508189, "likes": {"liked": "— The staff, the property and the location", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Great getaway from New York. Staff was excellent and helpful room was beautiful with amazing view of ocean, food outstanding, beach and facilities great. Really - we've been a lot of places and this was a great 5 day trip. MAP program worked well - and food at Reefs was better than Pompano.", "title": "Outstanding getaway", "helpfulness": 5, "user": "rubifuNewYork", "date": "August 20, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8459537, "likes": {"liked": "— Incredible views, great beach, staff and food", "disliked": "— not for budget conscious"}}, {"rating": 3.0, "title": "Reefs not the Same", "text": "We just returned from a 6-night stay at The Reefs (our 4th visit). I have to say, we were a bit disappointed. The overall ambience of The Reefs has changed. For one thing, too may children and parents who choose to disregard dining room rules set forth by The Reefs. Also, each night from 5:00 to 7:00 is designated as \"adult swim\" time at the pool. Just about every night, there were kids swimming between the hours of 5:00 & 7:00. On our last night, we were looking forward to a quiet, romantic dinner at Grill 56, however, there was a small baby crying. No one from the dining room staff would address the parents and offered no consolation to the patrons who were complaining.", "helpfulness": 13, "user": "NJTravelGirl_7", "date": "July 31, 2007", "id": 8266261}], "location": {"country": "Caribbean"}, "stars": 3.5, "variance": {"poor": 15, "average": 53, "very good": 111, "terrible": 16, "excellent": 424}, "aka": "The Reefs Hotel Southampton", "slim_ranking": 0.5, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "Widely recognized as the best hotel in Bermuda, this award-winning and intimate hotel offers spectacular ocean views from every room. Perched along limestone cliffs overlooking its own private beach you'll enjoy legendary Bermudian hospitality and gourmet dining at three different restaurants. The Reefs is one place where you will feel perfectly at ease."}