{"user_rating": 4.5, "review_count": 223, "name": "The Westin Abu Dhabi Golf Resort & Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "I spent six nights at the Westin Abu Dhabi and could not have been happier with my stay. From the moment I arrived at the reception desk until I left the hotel, the service was absolutely top notch. When I had occasion to ask for help with directions within the hotel, I was escorted to my destination, rather than just being pointed in the right direction. The room was luxurious and quite comfortable, and it looked out on a beautiful golf course.", "title": "Wonderful Service and Food", "user": "joeb1249", "date": "October 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 179401593}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "I was especially impressed with the food at the Westin and looked forward to dinner each night. Due to a busy schedule, I ordered from room service most nights, but it would be an insult to call the cuisine \"hotel food\" - it was that good. Buffet restaurants are usually the bane of my existence when I travel, but on the two occasions that I patronized the Westin buffet, I came away very impressed. The Wednesday night seafood buffet (\"The Claw\") provided an abundance of fresh seafood and other culinary treats. I have already booked The Westin for my next trip to Abu Dhabi.", "title": "Great Friday Brunch", "user": "Alex186534", "date": "September 29, 2013", "detail_rating": {"value": 5.0, "location": 4.0, "service": 4.0}, "id": 179058888}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "I just had a party of 5 people and a child who attended Brunch at the Westin Abu Dhabi on the Friday 13th September 2013. We were celebrating a birthday and our return trip to Abu Dhabi. We had very high expectations of the brunch as we have been to Westin in Dubai, St Regis Abu Dhabi to mention a few. Working in the hospitality industry and being part of many of the loyalty programmes as a Gold SPG, Platinum Ambassor IHG Rewards and a Diamond Hilton HHonors we know exactly what to expect from service and facilities. The food set up was absolutely fantastic and also tasted great however the service was not up to the standards we expected however this has been addressed with management to a great resolution. I am sure this was just a bleep and we will give another try upon our return to Abu Dhabi for sure. We love the Emirates and the great service and standards delivered by all 5 star hotel. The Westin has great settings and overall it was a great experience. The porter at the entrance of the hotel was a plus as he was friendly and welcoming. The offerings for the children was also great and the magician going around every table was certainly a plus entertainment wise making all adults engaging and not just the children. We also received a small complimentary slice of cake to celebrate the birthday with a candle however please request to buy a birthday cake not to feel left out should someone else have one next to your table. I would have got one if I knew we could buy one. The champagne was of great quality and the chefs and cooks by the buffet were friendly and attentive to food requests. Although it was busy, there was never too much waiting to get food and a highly recommend the Westin Abu Dhabi.", "title": "Love this place", "user": "Eglzfn", "date": "September 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179037354}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Just stayed here for a total of seven nights and we loved it. I was in town on business and we picked this hotel for its convenient location to several of our meetings. This hotel is absolutely gorgeous from the moment you pull up to the rooms, the dining areas, the lounges and restaurants, everything was thought through and just beautiful to look at and enjoy. I was upgraded upon arrival and the Exec Suite was huge, kitchen area, living room, bedroom and large bathroom with separate bath and shower. The Westin bed is everything its rumored to be, it was hard to get out of bed each morning. I loved the two big TV's with easy connection for my laptop to work on presentations or watch a movie. The closet was large and out of the way. The bathroom was large, well laid out and very comfortable. I had a massive balcony and if it wasnt so hot during our stay we would have used it more. My views were over the practice range of the Abu Dhabi Golf Club, just perfect. The food here was good, we ate everywhere from the Moroccan restaurant to the various specialized buffet dinners they served in the main dining area. We at their breakfast and at each of the lounges and we were impressed with all of them. The only negative I could even think of was the service in the Lemon and Lime lounge, it was always nearly empty and they seemed to avoid you. It didn't matter thought because everyone else in the place was extremely helpful, polite and friendly, especially Sylvia at the front desk who always had a smile on her face. We played golf at ADGC and if you're into golf, this is as good as it gets.", "title": "FANTASTIC HOLIDAY", "helpfulness": 1, "user": "mark649", "date": "September 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 178455729}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "I could go on and on but whether you're on a business trip or on vacation with the family, this place is perfection.", "title": "Fantastic !!", "helpfulness": 1, "user": "Faisalbkn", "date": "September 23, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 178297527}, {"rating": 2.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "Booking experience awful, seems employes get bonus by hiding offers and promotions especially for SPG members.", "title": "Worse of Westins", "user": "ElaFerrari", "date": "September 10, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 176551146}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "Breakfast of inconsistent quality, one day excellent, the next really poor. Food selection could be better.", "title": "Lovely rooms, good location for Yas island/ airport/ Dubai", "user": "natalieabudhabi", "date": "September 6, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 176096983}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "F&B staff and room service nice.", "title": "Excellent Stay", "user": "kmhontravel", "date": "September 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 176055475}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "No gym in the hotel, need to use Abu Dhabi golf club facilities which are really not nice.", "title": "Five Star luxury and Service", "helpfulness": 1, "user": "Peter N", "date": "September 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 175183705}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "Pool under renovation, not opened when promised.", "title": "Excellent hotel for business or leisure", "user": "Nick D", "date": "August 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 174511715}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "My husband and I went to The Westin for business and highly enjoyed our stay. The location was easy to get to (little bit of construction), but you could say the Abu Dhabi Golf Club and we didn't have any issues with taxis finding the location. It is a little set back from the city but it was only a 10 minute taxi ride to Grand Mosque. The staff couldn't have been nicer. Whenever we needed something they over delivered. Everything from our room service breakfast (which they doubled because they though it took too long, to offer great pool side service. I would definitely come back to this location.", "title": "Fantastic Service, beautiful room, decent location", "user": "JenPuru", "date": "September 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 177856791}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "They say it's never too late for a compliment, so here goes. Last spring I planned a gathering for friends to help us celebrate my husband's 60th birthday, at Agadir Restaurant at the Westin. We also stayed there for the weekend. I can only shout superlatives about the amazing meal, served family style for a dozen of us of a similar age. Each course a total delight and so interesting and full of flavor that everyone raved throughout the meal, which lasted for about three hours of relaxed fun. As far as service went, it was impeccable: great timing, smiling servers, excellent wines refilled with politeness and sensitivity to conversation, and I can't say enough about the kitchen's work. The chef deserved a medal it was all such impeccable food, so truly ethnic. And there was live music. The atmosphere was totally Morrocan, very stylish and unique. We also enjoyed our stay in an executive room this time, with lovely appetizers and drinks in the early evening included, as well as an award-winning buffet breakfast each day. The views over the golf course were simply lovely! Special thanks to Simon, the Head Concierge, for the beautiful flowers and special treats and excellent assistance in planning for the birthday celebration. Thank you, Abu Dhabi Westin! Well done, indeed. We'll be back and so will every one of our friends who enjoyed our time together there so very much.", "title": "Incredible Hotel to Host 60th Birthday Bash!", "user": "Bamak0", "date": "September 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177146384}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "Have just spent my last day in Abu Dhabi and I have to say The Westin is truly a nice hotel. Staff are friendly, the room are just so inviting. I would like to say that i have hard so much about the brunch however the next time I'm in AD i will try it. Thank you Westin, you guys really know a little thing or too about keep people happy! Westin Dubai was good but Westin AD is special. even got a round of golf in!", "title": "Happy", "user": "brianwp2000", "date": "September 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 177100476}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We have just returned from a fabulous 6 night stay at the Westin Abu Dhabi and loved it! We felt completely relaxed from the moment of our arrival and we were immediately wishing we could have stayed for longer than what we did.", "title": "EXCELLENT!", "user": "TBBGermany", "date": "September 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 176586078}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "-The location is not very central, and therefore when coming back from the hustle and bustle from down town Abu Dhabi, you can have a really chilled out time and enjoy the beautiful view of the golf course.", "title": "Wonderful service and rooms for business travelers", "helpfulness": 1, "user": "rwbradford", "date": "September 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 176571139}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We were there with our 2 young children for four nights. Great open greenery view with balcony. We enjoyed the pool, the bath tub, spacious room n toilet..etc the bed were so comfortable that we had hard time waking up in the morning. the breakfast was really great. The staff were mostly friendly but not all... Hope to see more smiles. We met a Chinese receptionist Qian who was extremely helpful and friendly. Westin really live up its five stars standard.", "title": "Great holiday because of great hotel", "user": "Lee Y", "date": "August 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174352099}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Overall I had a very enjoyable experience and the hotel itself especially being quite new is very nice with all rooms offering golf course views. Although I have to confess the very good rate during summer meant the value for money was much better, if I was paying full rate I would have been less impressed.", "title": "Good but not yet great", "helpfulness": 1, "user": "RobertK_66", "date": "August 26, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 174054493}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The rooms are nice and all have golf course views so you can't go too far wrong there. The pool is nice but not a highlight and it would benefit from nicer landscaping and grassed areas. However there is a separate lap pool that was under renovation which would be a nice addition for those who want to exercise. On that note the only gym is a buggy ride away at the golf club and is quite small. I believe they will build one but that will be some time off. The only other complaint in terms of amenities is that there is really only the all day dining room, a Moroccan restaurant and a sports bar with casual food which would be limiting if there for a few days (although you could visit the golf clubhouse). The cafe lounge in the foyer serves sandwiches and salads but these seem pre made and are poorly presented in cling wrap and plastic containers in a display cabinet (not at all 5 star except for the prices).", "title": "Abu Dhabi's Secret Gem", "user": "Kero_P", "date": "August 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173381618}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The real area for improvement though is in staff training and knowledge. A few quick examples - front reception staff informing me twice that breakfast finished at 11.30 when it finished very promptly at 11 leaving me little time for breakfast which like all hotels is not cheap. To their credit however this complaint was handled well and reasonable compensation offered. The technician who came to the room to connect a DVD player seemed to have little idea and needed my assistance. Concierge nearly left my luggage behind when I collected my car - thankfully I thought to look. Pool attendants don't assist with setting up beds and no offer of cool towels complimentary drinks etc that other very good hotels do. All day dining room seems under staffed and many don't know answers to simple questions ie what certain dishes on buffet were given many were not labelled. Generally I felt like an inconvenience.", "title": "Short stay for Ferrari world", "user": "Zub7", "date": "August 18, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 172851223}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "These may seem like minor issues and they did not ruin the stay but they certainly need improving if The Westin is to live up to expectations of a 5 star hotel especially during peak periods when staff are under more pressure and guests are paying higher prices.", "title": "This is the best forget the rest", "helpfulness": 1, "user": "KnightRC", "date": "August 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170351581}], "location": {"country": "United Arab Emirates", "continent": "Middle East", "city": "Abu Dhabi"}, "stars": 5, "variance": {"poor": 8, "average": 20, "very good": 52, "terrible": 1, "excellent": 142}, "slim_ranking": 0.165217391304, "description": "The Westin Abu Dhabi Golf Resort & Spa is the hospitality heart of the Abu Dhabi Golf Club - a 27 hole championship course, home to the PGA European Tour Abu Dhabi Golf Championship.This urban retreat is a refreshing addition to a city sprawling with glass and steel structures and will put the focus back on the outdoors and natural surroundings.Our restaurants and bars will offer you the finest cuisine in exceptional surroundings.All our 172 guestrooms feature the Westin Heavenly furnishings and amenities and are facing the golf course with private balconies to soak in the atmosphere and rejuvenateThis is how it should feel. A renewing sleep, energizing workout, relaxing spa, nourishing foods, and clean, fresh air - all enable Westin guests to preserve wellness during travel.Celebrate your special day whether its an engagement or wedding in style with beautiful surroundings at Westin Abu Dhabi Golf Resort & Spa."}