{"user_rating": 4.5, "review_count": 1095, "name": "The Westin Bund Center Shanghai", "reviews": [{"rating": 5.0, "title": "We got upgraded", "text": "We arrived at 2PM on Wed. but were told that they did not have a king sized bed for my wife and me. To compensate us as Starwood members, they gave us an upgraded room on the 15th floor, complete with a separate sitting area, 2 TVs, a desk with FAX, and a deluxe large marbeled bathroom. Everything was in working order after we figured out the complex lighting system. The staff was friendly, but their English was spotty - some passable while others were minimal. It seems that English speaking skills found in hotel staffs in mainland China remain a weakness... in comparison to other tourist cities and especially Hong Kong.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "September 1, 2005", "id": 3835724}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "This is a beautiful, immaculate, ultramodern hotel, however our room had very little storage/closet space. The bathroom was gorgeous, but no counter space and very poor lighting. The one outlet in the bathroom is for \"shavers only\", making it almost impossible to use the blow dryer provided. The room appears well suited for male business travelers, and ill-suited for females who want to put on make up and blow dry their hair!", "title": "A very lovely hotel, however", "helpfulness": 7, "user": "Pisces53", "date": "August 9, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "service": 5.0}, "id": 3750694}, {"rating": 4.0, "stay_parameters": "Stayed March 2005, traveled on business", "text": "The spa is outstanding. Service throughout the hotel is outstanding.", "title": "Great Hotel & Great SPA", "helpfulness": 12, "user": "Mr_X_Traveler", "date": "July 22, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3691739}, {"rating": 5.0, "stay_parameters": "Stayed July 2005, traveled on business", "text": "Hi,", "title": "The Westin Shanghai is Fantastic!", "helpfulness": 4, "user": "Mark C", "date": "July 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3684196}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "I have been on the road a lot lately and one thing I must say is key for a great hotel stay is a _great_ spa in the hotel... Yes, the Westin has a great spa... Check it out when you go.", "title": "The Westin Shanghai Surprise", "helpfulness": 8, "user": "JuliaVanderbilt", "date": "July 11, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "service": 2.0}, "id": 3655742}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "The Westin is conveniently located within walking distance to the Bund, the Yu Garden and Chenghuang Temple (around 15-20 min), and the Nanjing Road shopping district (10-15 min). Although it was built 10 years ago and shows some age in terms of its conditions, it has remained one landmark building along the Bund and can be easily identified from distance. The golden lotus on top is quite visible at night. Room is relatively small, but comfortable enough and adequate for one person. Staff is polite and efficient, but not particularly warm. Breakfast buffet is ok in terms of variety and quality. Have to be careful with water in the room - the small free bottles are located in a bathroom corner, and the big visible one with a tag in the room (mine was on TV stand) actually costs around USD14.", "title": "Convenient location", "user": "lizzylizzy", "date": "July 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133952108}, {"rating": 5.0, "title": "open, airy building with Western/Asian breakfast buffet", "text": "Not too far from the heart of the Bund. The rooms were comfortable - everything was exactly what you'd expect from a Westin. The breakfast buffet was plentiful and fresh. The bar was relaxing although over AC'd in the 95 degree temp outside.", "user": "HC-Chicago", "date": "July 9, 2012", "id": 133879752}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "From the car that met me at the airport to the room upgrade, my arrival experience was excellent. The suite was beautifully done - lots of marble with tiger eye maple paneling, rain forest shower head, enough counter space for my things and the Heavenly bed. Breakfast was included and was Western/Asian buffet with the chef cooking omelets. Sliced bananas in an orange juice were a standout. Location is a couple blocks away from the river promenade, historical area and markets. A quiet oasis in a city that is anything but quiet.", "title": "Service Taken Seriously Here", "user": "goodnamesaretaken", "date": "July 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133515674}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "I've been living in China for the past 10 years, and travel a lot. As such, I am not especially fond of living in hotels, no matter how nice they happen to be. However, during the past of the course two weeks, I've been impressed enough my 2 properties to return to this website (in addition to the Westin, I loved the GH in HK, and plan on reviewing it shortly).", "title": "fabulous", "user": "slumberfrog", "date": "July 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 133488701}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Getting back on the Westin topic, I stayed there during the Shanghai International Film Festival (at a reasonable rate), and was thoroughly impressed. I'm sure all you guys know that Westins have nice rooms as a general rule, and all are equipped with awesome bedding. But, there is only one Westin in the world that features views of the Pudong skyline, which is honestly breathtaking.", "title": "If you want to reward yourself", "user": "RamiH-10", "date": "July 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 133487859}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "I recently stayed at The Westin in Shanghai. It was incredible. The staff was very helpful with great suggestions for sightseeing and transportation issues. The location was fantastic. Only blocks from the river front, The Bund, and Yuyuan Gardens. I could not have been happier. Also, the breakfast buffet was great, with great Asian, as well as western selections on the buffett.", "title": "Great Hotel - Great Location", "user": "GClay59", "date": "June 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131751611}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "It makes a lot of difference if the hoteliers appear to love their jobs by offering the best service possible to the guests, with a smiley face of course. More so for a solo and female business traveler. I moved into Westin after enduring 2 weeks of mediocre breakfasts and customer services in a local hotel (which I shall review separately). One could not imagine how delighted I was to firstly, meet a friendly face at the reception; and thereafter, check into a clean, cozy and pleasantly decorated deluxe room in Westin. As always, I fancy the gourmet coffee, as well as the abundance of white tea toiletries. The Heavenly Bed did not offer the same comfort level as that in The Westin Kuala Lumpur, but I was able to sleep really well through the nights.The concierge officers were kind and informative enough to assist a lost sheep like me. Unfortunately, the set lunch in Prego was rather disappointing. Save for the slightly palatable bread and buns, the fish as my main dish was tastelessly bland whilst the dessert was a total disaster. The dessert was something resembled to vanilla ice-cream, served with an unimaginable concoction of berry sauce, sun-dried tomato and chili bits. No offence, but that could be the worst Italian fine dining meal I ever had in my life. This is not the best Starwood/Westin property (in fact certain in-room furnishings did look a little aged) but everything therein is an upgrade after an uninviting prior experience.", "title": "Everything was perfect (for a business trip) until...", "user": "Sylviattl", "date": "June 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 131618037}, {"rating": 4.0, "title": "Very good but not excellent", "text": "First of all the location: the hotel is only 5 min walking from the bund.", "user": "Paolo_Yle", "date": "June 9, 2012", "id": 131587367}, {"rating": 1.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "The standard level is very high and all the featires are in typical Westin style.", "title": "Smoking is just a suggestion,false advertisement!!!!", "user": "Marc F", "date": "June 8, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 131580903}, {"rating": 3.0, "stay_parameters": "Stayed May 2012", "text": "When i arrived i was upgraded foc to a suite room with a fantastic view on te bund.", "title": "Beautiful lobby but it was all downhill from there.", "user": "RGuileW", "date": "June 8, 2012", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 4.0}, "id": 131571575}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "I stayed at an upper floor and the room had a great view toward the Bund direction. The bathroom, its spectacular view and its rain-fall shower were very impressive. The room was nicely decorated and the ambiance was refine. It had a separate living area but it was on the smaller side. Then again, this is the city of Shanghai.", "title": "Excellent Experience", "helpfulness": 11, "user": "BostonMassachusetts", "date": "January 8, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4330872}, {"rating": 5.0, "title": "Service and stay at the Westin was divine!", "text": "In my opinion, this hotel came across as a hotel for business travelers with a more polite functional style of services as compared to the attentiveness of other five-star hotels in Asia. I actually found the location of this hotel not as convenient unless you have business nearby or you wish to be able to walk to the Bund. The massage at the SPA was fine but I think it was overpriced for what it has to offer.", "helpfulness": 10, "user": "LGuo", "date": "January 3, 2006", "id": 4319169}, {"rating": 4.0, "title": "very good hotel, but still needs some improvment", "text": "Overall wise, it was an excellent experience for its room and the service was commendable. I'd consider this hotel again for my next visit.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "November 25, 2005", "id": 4144097}, {"rating": 5.0, "title": "almost perfect", "text": "Just returned from a three night stay at the Westin in Shanghai.Was bowled over by the fantastic service of the staff.Everyone , from the porter, the concierge , the receptionist took pains to make our stay truly a home away from home. Beds in the guestroom were comfatable, and the toilet was extremely clean.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "October 18, 2005", "id": 4032618}, {"rating": 5.0, "stay_parameters": "Stayed August 2005, traveled on business", "text": "Ambiance at the hotel was bright , cheery and modern. Avoid this hotel if you like old-style decor and ambiance. There's a very good gym and spa on the third floor of the hotel.", "title": "Its good", "helpfulness": 3, "user": "raikesend", "date": "September 2, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3838375}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Stayed at the Westin Bund for a total of about 8 hours on a business trip.", "title": "Insects! - Otherwise Good", "user": "BlueGT", "date": "July 3, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 133339347}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "Pros:", "title": "Stayed at Westin Many Times with No Regrets!", "user": "TFan1", "date": "June 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132665267}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "- Nice and new room: The room I was staying in was clean and looked relatively new.", "title": "Great and comfortable stay again...", "helpfulness": 1, "user": "Ian L", "date": "June 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132358863}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "- Above average fitness facilities: They have separate areas for stretching/yoga, cardio, and weights, relatively spacious and the machines in the cardio area were fairly modern.", "title": "First time in this hotel", "user": "Littlewormmy", "date": "June 18, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 132248819}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "- Very good buffet breakfast: They have a Western and Asian buffet, excellent selection of foods and all delicious.", "title": "Very good!", "user": "gardenlily81", "date": "June 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132211363}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "Pros: Great location, great service, very comfortable and clean room.", "title": "Pros and cons", "user": "Davidnbm", "date": "June 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132190675}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Cons: Expensive room service meals.", "title": "A little dated!", "helpfulness": 1, "user": "Reaganspopy", "date": "June 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 132076368}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled solo", "text": "Spent a couple of days in Shanghai and this Hotel was suggested by friends. Very nice location near shopping and plenty to do. The Hotel staff was a little slow, seemed like they could use a few more hands.", "title": "First Trip", "user": "EwBarr", "date": "June 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 132053341}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "The room was a little run down and could use some new everything but not the worst place i have stayed.", "title": "second trip as good as the first", "user": "Mr&MrsWilko", "date": "June 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131938590}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "On Sunday this Hotel has one heck of a brunch. it covers two floors and has the most food I have ever seen in one place. Everything was good. But be warned, you need reservations and the cost will floor you, about USD80 per person....OUCH!", "title": "Great place to stay in Shanghai", "user": "Barglox", "date": "June 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131759335}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "Loved this hotel! My husband and I visited Shanghai with our two children and this is the only hotel that would guarantee us connecting rooms. Our two suites (each with it's own living room) were beautifully decorated in a contemporary Asian theme. The bedroom portion of the suite was somewhat small, but the overall layout was spacious. The bathroom was great! Beautiful marble, glass and lighting fixtures. Plenty of amenities. The staff was very courteous and helpful with the exception of the concierge. He spoke very little English and did not know anything about the new Circus/Acrobatic show in town. The breakfast buffet was plentiful, and the lunch menu had a good selection of Asian and Western items. Overall it was a great experience, and I wouldn't hesitate to stay here again.", "title": "Loved this hotel", "helpfulness": 7, "user": "KCKansasCity", "date": "March 20, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4695174}, {"rating": 3.0, "stay_parameters": "Stayed August 2005, traveled on business", "text": "I chose the Westin because it was one of the newer hotels and also because I usually like the Westin decor. The general fitout was kooky to say the least - palm trees (fake? real?), weird lobby layout and really garish stairs that lit up in different neon colours.", "title": "Kooky lights & Palms", "helpfulness": 3, "user": "Cerentha", "date": "February 13, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 4.0}, "id": 4456033}, {"rating": 4.0, "title": "Surprise in Shanghai", "text": "The rooms was fine, although the water was disgusting - it stunk of mud and dirt. The first night I tried to have a shower, the bathroom flooded and water was everywhere.", "helpfulness": 9, "user": "JC0816", "date": "January 25, 2006", "id": 4386197}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "Beds were great, as usual.", "title": "Best Hotel in Shanghai", "helpfulness": 16, "user": "tequilatamm", "date": "January 11, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4345341}, {"rating": 3.0, "stay_parameters": "Stayed December 2005", "text": "For a 5 star hotel, I expect more, particularly more subtlety.", "title": "Not worth the price", "helpfulness": 7, "user": "shoemaker", "date": "January 11, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 4345266}], "location": {"country": "China", "continent": "Asia"}, "stars": 5, "variance": {"poor": 21, "average": 89, "very good": 425, "terrible": 11, "excellent": 549}, "aka": "The Westin Bund Center Shanghai Hotel", "slim_ranking": 0.00656392694064, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Shanghai is a city with a colorful past, a fast-paced present and a promising future. It is a fascinating city for every visitor. The Bund is a collection of relics of the past that imbues Shanghai with its vigorous energy today. In the middle of this all is our hotel, The Westin Bund Center, Shanghai.On level one, we have our lobby lounge, Heavenlies, serving fresh coffee and beverages all day, and The Stage offering an all international buffet. Also located on level one is our fresh deli shop, Treats, which features delicious sandwiches and take-away beverages. On level two, we have our sleek bar, Niche, open in evenings, and our Italian restaurant, Prego, open for lunch and dinner. Finally, we have our specialty restaurant, Crystal Garden, on level five serving Chinese, Japanese and Thai specialties. Our Spa & Fitness facilities are spread out over level three and five, combined by a beautiful spiral staircase. For secretarial services, you can visit our business center on level three. We provide guests with complimentary high-speed Internet access throughout the hotel."}