{"user_rating": 4.0, "review_count": 378, "name": "The Charles Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "This is a wonderful hotel.The staff was super friendly and accommodating. It has so much charm, but is also perfectly modern. My bathroom was enormous, and had a huge bathtub to warm up in after days spent touring around in February.The breakfast was great! Cappuccino was superb. There is an amazing Italian restaurant across the street with a wood fired pizza oven that we went to twice since it was so good! The hotel is a short walk to the Charles Bridge, and everything you wish to see. I would absolutely stay at The Charles Hotel again!", "title": "charming and convenient!", "helpfulness": 1, "user": "802onthego", "date": "January 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 122922474}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The hotel is in a great location a few steps away from Charles Bridge close to Kampa (lots of restaurants and pubs there).", "title": "Great location, not exactly a 4-star service", "user": "antoniobonanno", "date": "January 5, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 122557399}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "What struck me negatively is mainly the staff: unfriendly, uninterested, totally in their own world like if they were there forced.", "title": "Over booking?", "helpfulness": 3, "user": "PaulineW209938", "date": "December 27, 2011", "detail_rating": {"location": 5.0, "service": 2.0}, "id": 122157546}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The room (104) was quite big, the bathroom fairly small but newish, all in all good for 65 euros per night.", "title": "wonderful place", "user": "Nadeyka", "date": "December 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 121979074}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We arrived at this hotel for a short break for the Christmas markets, chosen for its location close to markets. We were told there was a problem with water and we were being moved, we had to seek compensation which was eventually given as a taxi to the sister hotel and one to the airport and a spa treatment each in the new hotel. Very dissappointed about the whole thing.", "title": "Great location", "user": "kevyt", "date": "December 11, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 121642453}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "The hotel may not strike for having an imposing lobby or some specific high level architecture. But is is nice, comfortable, efficient, with a great restaurant, and just few minutes walk from the heart of the town. Rooms are spacious, the bar in the lobby is good, and it has very nice spa and gym facilities. You can't go wrong with this one.", "title": "Nice hotel close to the heart of Munich", "user": "GPS001", "date": "January 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122512225}, {"rating": 4.0, "title": "A bit hit or miss.", "text": "Stayed with a friend at this hotel for four nights while we visited the holiday markets. The room was excellent and the non-restaurant staff outstanding. Because it was the holiday season we ate in the hotel all four nights, 3 in the restaurant, one room service. It was as if we were at three different restaurants. The first night was excellent in every regard including value. The second night we both agreed we would never return had it been our only experience there--everything was good but overpriced and service was more that of a struggling neighborhod bistro than of a fine restaurant. The third night we had a good main course, but for some reason the bread and chef's plate we had been given the prior nights were omitted and the service was hurried, though pleasant-- perhaps because they were very busy. These experiences made it easy to see how the hotel would receive a wide range of assessments from its patrons.", "helpfulness": 2, "user": "hkwAtlanta_Georgia", "date": "December 27, 2011", "id": 122153426}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "We stayed just prior to the Christmas holiday as a family with 2 adult children. Our request for connecting rooms was honored, making it just that much easier to coordinate things with the kids. The hallways leading to the rooms have toned-down lighting which perhaps sets the mood for a very, very quiet room. No doors slamming in the middle of the night/early am, and never a peep heard from other rooms. It must be the quietest hotel room we have ever occupied! Our kids did not want to stay at one of the more vintage, luxury boutique offerings, and they chose this hotel. It could not have been better located for our trips outside and around the city (Salzburg, Dachau, Bayern Munchen match) via train or urban subway, as it is a mere 1 1/2 blocks from the main train station, and just 1/2 block from the U Line subway. We also had a very short walk to the Christmas markets in and around the city, especially at Marienplatz square. We took advantage of the hotel's room service for breakfast many of the mornings we needed to get away quickly, and were always greeted with friendly service. When milk for coffee was forgotten, it was brought quickly, and with a flower for my daughter as an apology. The concierge staff, under the tutelage of wonderful Heidi, was efficient and very helpful. She was able to secure tickets for the very popular Bayern Munchen/Cologne match at the beautiful Allianz Arena, with our request several weeks in advance, as well as arrange for a private tour of the historical city with a knowledgeable local graduate student. My daughter and I visited the wellness spa almost every evening to take advantage of the sauna and steam room, and made quick friends with Stefan, manning the desk with such charm and flair. We did not know the spa had a beautiful pool, or we would have been certain to bring our suits (although not required). The sauna/steam area has individual showers that are grouped side-by-side, without doors, so do be aware of the mingling of the sexes sans clothing. For those more modest, there are single-sex showers and changing facilities. There is a sign in the sauna/steam area that explains the circulatory benefits of foot bath/sauna/steam/swim and in what order. This fact explains the difference between the German and American spas. In America, it is all about relaxation. Even though the Charles has a Relaxation Room as part of it's facilities where one goes to sip hot and cold infusions and lie on lounge chairs, we were a bit off-put by the upbeat holiday music piped into all areas, even playing while we were enjoying a reflexology session. Melinda offered a superb massage on another occasion. Again, the music did not match the tone of the moment. Other areas to touch upon- the lobby bar had a nice jazz ensemble on the weekend, and our son, a bigger eater than the rest of us, enjoyed a very nice full buffet breakfast a couple of mornings with a selection that was superior. Our dinner at the hotel restaurant was very good, too...I could suggest that the room's ambiance would be enhanced with dimmer lighting. I must agree with others that thought the linens a bit too stiff. I read something in the room that the hotel uses linen instead of cotton for the superior breathability of its sheets....I don't know if it is worth the trade off. The only serious complaint all four of us had is that internet service is not free. Having to pay a daily rate of 20 Euros was just not right.", "title": "Everything You Want....and More", "helpfulness": 3, "user": "nlpNorthernNJ", "date": "December 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122120560}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "A wonderful hotel that is set apart from its peers by its two incredible concierges – Heidi and Jochen – who were absolutely instrumental in helping us have a relaxing and great time in Munich. Great location, comfortable rooms, fantastic service and a great bar/lounge in the lobby – thank you for making our time in Munich memorable.", "title": "Incredible service", "helpfulness": 3, "user": "jamesjen25", "date": "December 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121964197}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "+++:", "title": "Excellent standard of service.", "helpfulness": 2, "user": "v4nnm", "date": "December 18, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 121844336}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "This hotel made a wonderful base for exploring Prague. The Charles Bridge was only steps away, and the start of the walk up to Prague Castle was also very close. The streets adjacent to the hotel had interesting shops and restaurants. Our room was very large and quite clean and quiet. Breakfast was ample and attractive. The internet connection worked well. The staff at the front desk spoke excellent English and were very helpful on the few questions we had.", "title": "Reasonable, Comfortable, and Very Close to Charles Bridge", "helpfulness": 2, "user": "johnscasler", "date": "February 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124194264}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "You could not get a better location for a hotel it is only yards from the main bridge, it was a very clean, quiet, quaint hotel. Staff were nice and pleasant. Main door is on a side street so need to look carefully for the entrance.", "title": "A great location", "user": "VanMook", "date": "February 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123963074}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We were really impressed by the hotel, which was in one of the better locations in Prague, metres from Charles Bridge and within walking distance of all the major attractions. The hotel was surprisingly quiet, when taking into consideration the desirable location.", "title": "Great hotel, great location", "helpfulness": 1, "user": "BristolDeeDee", "date": "January 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 123743485}, {"rating": 1.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Our room was small but perfectly suited to us. It was beautifully decorated and had everything we required. We were also happy with the breakfast, which was pleasing. Staff were really helpful.", "title": "Terrible treatment at this hotel", "helpfulness": 18, "user": "J T", "date": "January 12, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 122995106}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "On the whole, this was a great hotel, and we would be happy to stay there again.", "title": "Booked highly recommend this hotel also hotel transfer from the airport.", "helpfulness": 1, "user": "Thomas T", "date": "January 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 122966484}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "Was offered really good price and decided why not to try this experience. There are only good things to say about this hotel. Excellent location close to main station, spacious rooms and bathrooms, beautiful interiors and one of the reachest breakfasts I've ever seen, very nice lobby bar. Staff are all very helpful, all processes like check-in or check-out run smoothly. Stayed in The Charles for just 2 nights, but even this was enough to understand what does Rocco Forte mean. Will definitely come back again!", "title": "It's Rocco Forte", "user": "Lexx_Naxxx", "date": "January 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123588093}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "We booked our room through Leading Hotels of the World promotion Stay 4 nights, get the 5th night free. Since we are members we also anticipated a room upgrade. We arrived at the hotel which is designed in a beautiful neoclassic style overlooking the Botanical garden. We were greeted at reception by staff bearing hot towels to refresh ourselves after our journey--which we felt was a little pretentious. Check-in was smooth and we were escorted to our junior suite upgrade. We were disappointed with the view of an adjacent office building located across a pretty courtyard and shocked when night fell exposing our room to view. Our choice was to keep the draperies closed or ask for another room. We then discovered that the airconditioning didn't work and notified the front desk. An engineer was promptly dispatched but he was unable to fix the problem. The following day we were moved to a beautiful large suite, with two balconies, overlooking the garden. A lovely floral arrangement and bottle of wine were gifts from management due to our problems with the first room. The balance of our stay was perfect in every way. Since there were only 4 suites on our floor, with only one other suite occupied for one night only, it was very quiet. The staff was extremely helpful. We had friends in the city living on a very short obscure street cab drivers had difficulty finding. The concierge printed a map and came with us to the taxi giving directions to the driver. The breakfast buffet, which was included in our rate, displayed food choices for every ethnicity plus eggs, pancakes could be made to order. We will definitely stay at The Charles again or any other property owned by Rocco Forte.", "title": "Top Notch in all respects", "helpfulness": 1, "user": "fififlies", "date": "January 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123301088}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "The Charles Hotel in Munich was absolutely amazing. Stayed for three nights with family on a recent trip there, and found it extremely hard to even leave the hotel each morning! The staff were top-class as soon as we arrived, asking us how our flight had been and helping us with what we wanted to see and do in Munich, and one of the staff took us up to our room and explained every single part of the room that we'd need to know - including the bed-side controls to set the room as 'Do Not Disturb', which was very useful for sleep-ins! They were able to answer any question we had throughout the entire trip, and consistently asked us if everything was OK - really could not ask for better service. The Spa, pool and fitness area is absolutely brilliant - a big enough pool for the amount of guests with tonnes of lounges, a gym area with about 11/12 machines (always empty when I was in it), and massage treatments available even within a few hours' notice. The restaurant had a nice view into the small outside courtyard (equipped with outdoor heaters and chairs and tables, but as it was snowing when we were here, these weren't used), and having breakfast in here is a must if you can get it included (the amount and quality of food on offer is crazy!!). Location is great - a very very short walk from the train station, and very much central to any attractions in Munich. Nothing is more than a good walk away - we barely used public transport or taxis. Need a 10-minute walk to find good restaurants, but just ask the concierge at the front desk and they'll point you in the direction of some brilliant restaurants in the surrounding areas. And the best part of the hotel - the bar. Wow. Open-plan in the lobby with many great comfortable chairs, great drinks, and live music every night we were there (a three-man band with a piano, viola and saxophone, as well as some magnificent singing from the pianist). Best atmosphere you could ask for - come down from 8-10pm and you will not be disappointed. Couldn't find a single fault in this hotel. Do not hesitate to book! We got a deal so the value for us was amazing, but this truly is a luxury 5-star hotel, so do not be put off by expensive prices - you'll get what you pay for, without any doubt at all.", "title": "\"Wow,", "user": "Lexx_Naxxx", "date": "January 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123256850}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "The hotel was really amazing, your typical large modern hotel with the usual staples that you'd come to expect from first class hotels there .Outstanding international buffet, outstanding staff, great security and rooms that are very clean and spacious. The location was great with many scenery outside especially at night. It was a perfect stay for a stunning hotel ever. Highly recommended. ...", "title": "reasonable price for a perfect stay", "user": "dannyforth", "date": "January 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123197606}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Hotel itself is amazing, one of the best I've seen in Europe (rooms are really large and service is great, and the room includes coffee-maker, which is not typical for Europe) Can not comment on the value for money since I stayed there for business.", "title": "Great hotel, but no free WiFi", "user": "libushe", "date": "January 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123099466}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The experience at the hotel was really amazing.", "title": "Extreme luxury for a reasonable price", "user": "max_prox", "date": "January 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122942468}, {"rating": 1.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Location is amazing, right at the city centre 10 minutes walking from the main square, e few steps from the underground and train station.", "title": "Great expectations misplaced", "helpfulness": 3, "user": "Kevin A", "date": "January 8, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 122767964}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Hotel as whole is amazing, the room is really big both the sleeping area, which has also a small sofa, and the bathroom.", "title": "Wonderful for business and pleasure", "user": "Nienke08", "date": "January 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122755997}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "The hotel has a very nice spa, with sauna and steam bath facility and also a big pool. The entrance is complimentary for the hotel guests.", "title": "Room Restaurant Bar Service All Great", "user": "gvtraveler", "date": "January 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122705072}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The breakfast is amazing: a lot of choice to the buffet, and during the weekend is served until 2 pm!!!", "title": "Great room!", "helpfulness": 1, "user": "travelhagPerth", "date": "January 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 122568947}, {"rating": 3.0, "stay_parameters": "Stayed December 2011", "text": "I stayed in this hotel twice in Dec. First stay is extremely wonderful, nice garden view and everything were good, no complian, all positive comments are same as those listed below.", "title": "second time to stay, not good as the first", "user": "Tracy1486", "date": "December 13, 2011", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 121700427}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "However, my second stay (only one night after) was terrible. The room changed to face a building and I found a dirty sock in my room... a luxury hotel but with a sock in the guess room, I really want to say fxxk!!! Also, I did request baby cot in the room, but as my son got seriouse skin problem before we left, we have no time to inform the hotel. Hence, my first stay, all the facilities for baby were well fixed. However, during my second stay, no staff checked with us whether the baby was with us or not, and all baby facilities was gone without being informed although ordered. Moreover, I was waiting an urgent email from my colleague, and different staff told me different status of my email, one said none was received, one said I used an old and wrong email address which was provided by the hotel staff, one said sending to me now (& finally waited for 30 mins)... how come I got these replies within 30 mins from different staff, poor......", "title": "superb hotel in a great location", "user": "alexshulman", "date": "December 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121629645}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "I would suggest if u will travel with child, this hotel is a very good choice. For other purposes, pls think of what you need before booking. Juz for sleep and relax, this is not a good choice.", "title": "Beautiful hotel in heart of Munich", "user": "gndchicago", "date": "December 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 121624066}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Stayed for 3 nights in July during european delivery my new BMW", "title": "Wonderful hotel!", "user": "lesliec17", "date": "December 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 121593510}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Excellent , very upscale hotel located just 10 min leisurely walk to Marienplatz", "title": "Fantastic food! So good we ate all our meals here but one.", "user": "susanmccallum", "date": "December 9, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121569572}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "This hotel is just a few steps from The Charles Bridge in The Lesser Quater, it is small and charming the rooms are quirky with painted ceilings and refurbished bathrooms.There is a fantastic jazz club next door which can be rather noisy if your room is above it! The rooms are clean and fresh towels mini bar,tea coffee renewed daily.Top tip book a taxi on line with Prague airport transfers they provide a meet and greet service and were cheaper than the taxis outside the airport. They also provide a guide book and maps.", "title": "Third time at the Charles.", "helpfulness": 1, "user": "raphiel8", "date": "December 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121618925}, {"rating": 1.0, "stay_parameters": "Stayed December 2011", "text": "Arrived at the Charles hotel late Thursday evening to be told that there was a problem with the heating and we would be transferred to another hotel on the other side of the city. I believe that this isn't the first time this hotel has done this to guests (from looking at previous reviews). We were sent to the Eurostars David Hotel which, in my opinion, was a far superior hotel to the Charles.", "title": "Don't bother!!!", "helpfulness": 5, "user": "TheLoveBug", "date": "December 11, 2011", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 121613898}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with friends", "text": "From the 10 minutes we were kept waiting in the reception area, all we could hear was loud music coming from the neighbouring bar.", "title": "Loved everything about it", "helpfulness": 1, "user": "Traveling_Chuck_2011", "date": "December 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121451688}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Don't bother wasting time with the Charles, book into the Eurostars first - it will save you a lot of bother in the long run!!!", "title": "Lovely Hotel - Suberb Location", "helpfulness": 1, "user": "triptuptap", "date": "December 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121412131}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Fantastic location, great size rooms, beautiful decoration and attention to detail", "title": "great but noisy location, nice rooms", "helpfulness": 1, "user": "Clunytunes", "date": "December 3, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 121344901}, {"rating": 4.0, "stay_parameters": "Stayed March 2012", "text": "We had two rooms on the third floor of this hotel and I just loved the decoration and cozy feel of both of them. They were impeccably clean and had all we needed including tea making facilities. It was a pity there wasn't a stand-up shower, but the general niceness of the bathroom and room made up for that.", "title": "Cozy rooms, excellent location, variable staff", "user": "asmile", "date": "March 21, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 126459053}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Breakfast was excellent and all but one member of staff very friendly and helpful.", "title": "Great Location!", "user": "AndreVz", "date": "March 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 125861737}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Unfortunatly this one man at the reception seemed to be allergic to guests. Maybe he should find a different career? Polite enquiries on our side during check-out were met with angry and off hand replies by this person. We kept our calm but felt offended. During our stay we heard the same man argue with other guests. What a pity, as the rest of our stay was so nice.", "title": "booking issues", "helpfulness": 2, "user": "Jennifer N", "date": "March 5, 2012", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 125671568}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "As mentioned in other reviews, the location of the Charles hotel is just perfect for all sightseeing in Prague. There are some excellent and inexpensive restaurants nearby (recommended to us by one of the nice receptionists), and despite our irritation after the treatment we received at check-out, we would not hesitate to stay at the Charles again.", "title": "Romantic trip to Prague", "user": "Bart T", "date": "February 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 125094427}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We stayed at this hotel in one of the rooms on the top floor. The room was in a converted attic, super spacy, very cosy and if you lean outside the window, you could actually see the Charles Bridge down the street, which means that the location of this hotel is extremelly good, right inbetween Prague old center and Prague's Castle. Heating was working perfectly (we stayed there during this winter's big chill!). The bed was comfortable, bathroom was clean and with modern appliances. By the lobby, there's one computer with internet access and a small kitchen bay where you can make your own coffee and tea, which was very pleasant after a day walking in Prague. If you're bringing your own computer or smartphone, you can just ask in the reception for the internet password which has good reception in the rooms. Breakfast is served in the basement of the hotel which is also a thai restaurant otherwise. Even though its not the best i've ever had, it's pretty satisfactory with great croissants! The only negative aspects I can point is the staff, some were friendly, others not so much. And when it comes to pay, make your payment in Euros or they'll make you a really bad convertion to kroners and you'll pay way more than you booked. Other than that, this hotel is the whole package one can ask for in a prague citytrip: great location, nice breakfast and a nice room ambiance, making stay a joy.", "title": "Good hotel in a great location.", "helpfulness": 2, "user": "Brecon4", "date": "February 20, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124900170}], "location": {"country": "Czech Republic", "region": "Bohemia", "continent": "Europe", "city": "Prague"}, "stars": 4, "variance": {"poor": 23, "average": 44, "very good": 161, "terrible": 28, "excellent": 122}, "aka": "Charles Hotel Prague", "slim_ranking": 0.39880952381}