{"user_rating": 4.0, "review_count": 1822, "name": "The May Fair Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Booked via Last minute.com as a Secret Hotel (you can guess it by the detail they give you ) Fantastic hotel , just finishing a £70m refit so the rooms and public areas are all new and very modern.Great value at £99 and 2 mins walk from Green Park Tube .No complaints - would recommend.", "title": "Great location", "helpfulness": 3, "user": "Sandridge", "date": "October 15, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5958582, "likes": {"liked": "— Location , clean and modern", "disliked": "— nothing- my TV did not work but they soon fixed it"}}, {"rating": 4.0, "title": "Fashionable", "text": "The refurbishment gives this hotel a luxurious feel. The room was very attractive and comfortable, although it is true, as other reviewers noted, that the attention to design comes at the expense of some practical requirements, such as a clock and an accessible bureau. (Mine was black and squeezed into the unlighted closet, making it impossible to see where to open the drawers). The staff was helpful and the atmosphere lively, but without excessive noise. Internet access in the business center was free and immediate. With an ideal location and competitive pricing, this was a good choice.", "helpfulness": 4, "user": "Xamb", "date": "October 11, 2006", "id": 5937574}, {"rating": 3.0, "title": "Beware of building work", "text": "I just spent one night at this hotel to celebrate a friend's upcoming wedding.", "helpfulness": 2, "user": "SG99999", "date": "October 9, 2006", "id": 5931029}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "The hotel's common areas are fine. The rooms are a little impersonal and painted an unpleasant shade of brown.", "title": "Excellent location, very good hotel, with some caveats", "helpfulness": 6, "user": "tengohambre", "date": "September 9, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5785218, "likes": {"liked": "— Location; newly renovated; large room and modern bathrooms.", "disliked": "— Need some shaking out better thought out amenities."}}, {"rating": 1.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "The staff were friendly and efficient.", "title": "Poor Choice", "helpfulness": 3, "user": "Compote", "date": "August 26, 2006", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 5711038, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 1.0, "title": "Poor Customer service", "text": "We arrived at 2pm to check in to the hotel, we were told the room was not quite ready yet, and offered a soft drink in the bar, Fine. Half a hour passed and still no word about the room, upon investigation i was informed the room was still being cleaned! 2 hours later we were finally able to check in!.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 20, 2006", "id": 5363825}, {"rating": 2.0, "title": "smiley staff but incompetent", "text": "Be warned at the weekend there is a limited menu available, and the bar tender, poor man seemed very harssed and unsure whether the kitchen could mannage bar snacks.", "helpfulness": 2, "user": "theatregoer002", "date": "June 9, 2006", "id": 5326731}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "After a spending an evening out in the city, we returned to our room, it was the hottest day of the week and neither myself or my friend could get the Air-Con to work. We phoned Reception twice and were told someone would be up to assist us. 3 hours passed and still no help. Unable to open the windows due to the scafolding that lay outside our room, we sweltered the night away.We rang down for Water, as there was none avaible in the room, although the room directory did state each room had mineral water, again no water turned up.", "title": "Luxurious Room", "helpfulness": 2, "user": "SunSan", "date": "May 28, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 5228535}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "Don't even get me started on the refurb and clealiness of the rooms!", "title": "With eyes open, this is a great deal!", "helpfulness": 5, "user": "cowlid", "date": "May 23, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 5192396}, {"rating": 2.0, "stay_parameters": "Stayed May 2006", "text": "Upon check out i informed the receptionist of our dificulties, very discreetly i might add, in return all i got was a vacant look and a feeble responce of: Sorry! Here is your Bill.", "title": "Ripped off! Should not be 5 star", "helpfulness": 3, "user": "Scootles", "date": "May 22, 2006", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 3.0, "service": 3.0}, "id": 5187761}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "Every thing in this hotel exudes with excellence, class, and functionality. Its central location make it easy to access any important land mark in London. Free wi fi makes it even better. Friendly staff, ready to help.", "title": "Excellent Hotel, Excellent location. Really top class.", "user": "nouta1", "date": "November 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49914596}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "I stayed at this hotel with my partner and can honestly say... you get what you pay for. From the fittings in reception (Fendi sofa's etc). The rooms are beautiful with you own B&O (Bang & Olufsen) t.v., phone, desk and a dressing room fitted in marble which leads you into the marble bathroom. The quality and luxury will leave you speechless. Did I also mention the t.v. in the bathroom? I fell in love with this hotel. There is a local (small) sainsbury's supermarket facing the hotel. Go in there for drinks etc as the hotel is very pricey. The location is excellent. You can walk to Oxford road (shopping) 5 mins away. It is 10 mins walk from the Ritz Hotel. Around the corner there is Starbucks coffee shop and a cafe 2 doors up the street on the other side which does a excellent English breakfast a quarter of the price of the hotel. If you want to be spoiled and live in luxury, you've found it!! Enjoy yourself we did", "title": "The most up market hotel! Excellent", "user": "Hayley87", "date": "November 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49635418}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "First time I have criticised a hotel as I usually stay 4 or 5 star when travelling the world. So let me give you a truthful and honest assessment of this hotel.", "title": "Good hotel but sooooo noisey!!!!", "user": "littlegmbhoy", "date": "November 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 1.0}, "id": 49479622}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Let me get one or two things straight before I say the word \"but\".", "title": "A top class hotel with excellent,very friendly,very efficient and warm service", "user": "Libero8", "date": "November 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49365137}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "This hotel is in an excellent location. Next to shops on Oxford Street as well as Bond Street. The staff are excellent & the general atmosphere in the place is good. I stayed her for 3 nights and was put into room 124. This is where it took a downturn!!!", "title": "Nice, but some minor annoyances - terrible Internet connection", "user": "PDLJ", "date": "November 10, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 48916489}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "I would have to start by saying The Mayfair is overall a decent hotel however after staying in many great hotels across the world I feel The Mayfair maybe thinks it is more exclusive and offers more than it actually does.", "title": "Not 5Star!", "user": "darren74", "date": "December 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 51221446}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The hotel was busy when we arrived and the person checking us in certainly did not make us feel welcome and seemed more concerned on getting to the next person, we were not advised on any of the amenities within the hotel or where breakfast was served or the fact that the lifts are operated by your roomkey.", "title": "Good Hotel in an amazing location", "helpfulness": 1, "user": "S6_OWL", "date": "December 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 51150031}, {"rating": 2.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "We had booked a King Deluxe and were given 715 which was right at the start of the corridor adjacent to what apperaed to be a service staircase...( I had my reservations but decided to accept the room).As previous guests had mentioned because the floor was tiled we had people coming in at all hours tramping past the door, waking us up on several occasions.The service stair case which worried me when we arrived, proved to be exactly that with noise at all different times day and night.Also the door handle looked as though it would soon be falling off.......some of these things are minor but as I said earlier,just not what you would expect from a five star hotel.Would have to rate the room and bathroom as .......average!", "title": "Heavy on the noise and bad attitude", "user": "schnauzernyc", "date": "December 10, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 51007578}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Keeping with the five star theme - If i stay in a hotel with five stars and I feel like having a beer (instead of Champagne ,spirit or cocktail then I think I should be able to order one....NOT in The Mayfair Bar.....Is this because they find beer the drink of a \"working man\" and not the type of customer The Mayfair wants........As I said having stayed in some amazing hotels in my travels I find it rather poor when I cannot order what I want.", "title": "Beautiful hotel, shame about complacent staff", "user": "englishrose1981", "date": "November 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 50329013}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Breakfast was served in the same room as the bar..( Bar by night, turned into breakfast room for morning).Most definately dissappointed by the breakfast on offer, very poor selection which lies out until empty.When we had breakfast the floor was sticky as you made your way to the buffet (obviously hadnt been cleaned since the night before", "title": "Ask before you confirm your booking", "user": "goodmankl", "date": "November 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 49936534}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "stayed 3 nights, room ok good size bathroom, busy hotel great buzzing bar area but not 5*", "title": "average great location", "user": "nanrosemar", "date": "May 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 129648810}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "my wife and i stayed on Sunday 6th May in a Junior suite . We have stayed at this hotel over the years quite a few times so know all about it . Its location is superb but recently i felt the hotel was on the down ward slide , that was until we stayed on Sunday .", "title": "Huge Improvement", "user": "quorny", "date": "May 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129607626}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The check in was faultless with very pleasant staff throughout the whole hotel. The Doorman were much better at greeting the concierge was efficient . The room was amazing lovely big room very clean and beautifully decorated. We had theatre tickets for a show and really fancied eating in Quince but unfortunately it didnt open until 18:30 but the restaurant staff the next morning explained to us that they are seriously thinking about a pre theatre menu which was a really great touch that she remembered to say something about it to her boss. So we had some room service when we came back from the show which was superb.Breakfast was excellent as were the restaurant staff very cheerful and nothing was too much trouble.", "title": "Great Location. Good Staff", "user": "RafainLA", "date": "May 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 129535145}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Overall our stay was excellent and are very much looking forward to our next stay.", "title": "Great Location--Nice Stay", "user": "SpaGirl007", "date": "May 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 129429739}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "We stayed in London for a 3 day tour. It happened we got there while Gas pipes had burst in the Mayfair area. The hotel staff was very helpful in trying to accommodate all our needs. The next day the problem was corrected and it was great ...", "title": "Excellent hotel!", "user": "KellyCVS", "date": "May 5, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 129410646}, {"rating": 3.0, "title": "Watch out for the Air Con!", "text": "Stayed in the Radisson Edwardian for two of the hottest days and nights in London.", "helpfulness": 3, "user": "member_Dublin", "date": "August 1, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 5536601}, {"rating": 4.0, "title": "great rooms, bad service", "text": "Probably wouldn't go back at full price (slightly too corporate without being 'special') but the room was lovely, clean, refurbished and the fridge worked (unlike some other reviews). However, the Air Conditioning shut off at quater past midnight each night. Completely unnacceptable as it was so warm. Maybe they thought everyone would be asleep! Thankfully it was sorted after a phonecall to reception and someone arriving to query the 'problem' after half an hour. If you want to stay cool...stay awake...", "helpfulness": 1, "user": "Dhahran", "date": "August 1, 2006", "id": 5536233}, {"rating": 1.0, "title": "Not an acceptable experience", "text": "The Edwardian May Fair rooms are by far one of the best i've seen in london and i've seen alot. great location, contemporary/oriental decor and one of the best places to have breakfast (Amba restaurant in the main loby). now the flip side, their costumer service is bad to say the least. You some times get the feeling that you're actually imposing on their staff. Change (£5-10 in coins) were stolen from my room and when i complained it was to deaf ears. elevators were not working during the first 3weeks of July weeks which was a b... i even had to use the stairs to get to my room on the 7th floor several times. their fire alarm went off 7 times during my stay for no apparent reson. construction ongoing work will wake you up by 8:30am, no excuses made. No swimming pool and their GYM...well its okay. In breif: Great room + great location + poor management.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "July 17, 2006", "id": 5477015}, {"rating": 3.0, "stay_parameters": "Stayed June 2006", "text": "Was very dissatsified with this hotel during my last stay in London. People expect more from Radisson. I was encouraged to send the following letter, along with photos, to management.", "title": "Okay, but give it time.....", "helpfulness": 1, "user": "berta8888", "date": "June 30, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "service": 3.0}, "id": 5412881}, {"rating": 4.0, "title": "Nice central location, modern hotel", "text": "Dear Sir,", "user": "sirius99", "date": "June 24, 2006", "id": 5378611}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We stayed here for my husbands birthday - check in excellent but please whoever decided on the exceptional highly perfumed aroma in reception - NO - it is just far too much and slightly nauseous, and even though there was no hot water we chose to stay as it was convenient for the other plans we had and luckily the hot water was restored. Had a lovely large room with two bathrooms - excellent. The spa was very good as well.", "title": "Very nice but watch the the sting in the tail.", "user": "lucyvegas", "date": "May 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129372669}, {"rating": 1.0, "title": "Very Disapointing", "text": "Went for drinks at the Mayfair bar lunchtime and very late evening service very good as were the drinks but watch out for the service charge and then they also want a TIP!!!!", "helpfulness": 1, "user": "rover116", "date": "May 2, 2012", "id": 129245573}, {"rating": 2.0, "title": "Poor service. and disturbing views of \"birds on a wire\"", "text": "All staff very courteous and helpful with getting taxis, looking after luggage and check in /check out.", "user": "A TripAdvisor user", "date": "May 2, 2012", "id": 129224042}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Checked in after long flight and was informed that there had been no hot water in the entire hotel for the previous 24 hours, and that they were not sure when the problem might be resolved. I was offered alternative accommodation, but I chose to chance it as was keen to experience the hotel. Unfortunately, I wished that I took the offer. After being told that my room was 'a very good one' I was disappointed to find that it was very small with a bathroom that emit a foul odour. My bags were left with the doorman, and didn't arrive in my room until I rang twice to chase them - after traveling for 24 hours I was keen to unpack and shower... Even though I knew it would be a cold one. After a shower, I went for breakfast where service was pleasant, food ordinary (but I do understand that the gas in kitchen was affected so this is accepted) I complained to front desk about the smell in the room... Assured somebody would take a look... Needless to say and to cut a long story short... After a day of meetings and numerous requests nobody had got back to me on the smell problem. Hot water still not working, so decided to check out. Obviously no charge for room, but hotel didn't offer to pay for my 20 quid breakfast for inconvenience. I wouldn't have accepted but the gesture would have been appreciated. At the end of the day - I understand that he hotel had problems with water out of their control, but the whole experience and service was ordinarary. Nobody was outstanding and for over 500 AUD (same price as the mandarin oriental in hong kong to put in perspective) the hotel was forgettable and staff indifferent.", "title": "Great location, beautiful bathrooms!", "user": "MLH07", "date": "May 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 129201138}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We stayed for 4 nights at this hotel from 27 April 2102 til 1 May 2012 - I am a frequent traveller to London and this was my first time and LAST TIME at the May Fair Hotel.", "title": "Location Location", "user": "J0el_K", "date": "May 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 129167311}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We stayed on The Mayfar on last october (21-28) and I have nothing to complain! The room was very big, very comfortable and clean! We stayed first in a room with no view and in the second day we changed for other with a view of the street.. The rooms with no view are excellent too and are more silent. But they gave us an upgrade and we accepted. The bathrooms are big too and very, very comfortable. Everything are beautiful and planned. The staff were very friendly . The breakfast is excellent , specially the ones in the front desk, but near the hotel are many places were you can take breakfast too. The hotel´s bar is full of beautiful people night and day. The location is perfect! Near all the major atractions and in a wonderful neighbordhood. It´s possible to walk to Buckingam Palace, Hyde Park, Oxford Street, Picadilly Circus. Also, the metro station (Green Park) is one block and a half from the hotel. We loved the hotel and I woudl recommend to my friends as a excellent place to stay with an affordable price. Thanks to internet !", "title": "Excellent hotel, perfect location\"", "user": "Luciana_LS", "date": "November 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48627065}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Simply great place for a London shopping/Theatre treat. I like staying in Mayfair, and this place (second trip here) doesn't dissapoint. It is glamorous and rooms are decent size, service great, and not too snobby. After a great mohito and martini at the hotel bar we walked around aimlessly for a restaurant (there were plenty, we are just useless at deciding), could not decide where to go, and ended up back at the Amber restaurant in the hotel - great meal. Its a very good place to treat the missus, and you won't feel out of place. OK, the bar is not cheap (£9 for a good cocktail) and restaurant isnt bdget (£90 for two with wine and 2 courses) but it was very good value, especially for London. If you can get a room for £200 then its value, less stuffy than the Westbury (still v good) and the restaurant and service are better.", "title": "Good value, Even at this price", "user": "goodjudge", "date": "November 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 48443205}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "My partner and i stayed at The Mayfair last sunday the first of november 2009.We chose one of their allergy friendly rooms.The reception staff were very friendly and welcoming.", "title": "Definately five star", "user": "westgirlnrbath", "date": "November 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48422808}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Our room was very nice indeed,not much of a view but clean and fresh.We had a drink at the bar which was great,even on a sunday evening it had real atmosphere.", "title": "Contemporary, Comfortable, Convenient.", "user": "Snaddy", "date": "November 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48364824}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "The hotel is in a lovely location,handy for just about everything.We both had a very comfortable and pleasant night's sleep.A real delight.The mayfair is definately a five star", "title": "Highly Recommend", "user": "RichBlackman", "date": "October 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48041712}, {"rating": 1.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "Previous writers have complained about the noise. Well, despite what they tell you, you will still find people walking on the scaffolds outside your room (mine was on the third floor) and as there are no net curtains, you have to pull the blinds in the daytime, which is no fun for a smallish room which has cost me over 350 pounds for the night, breakfast included.The pillows are terrible and you have a hard time getting a soft one from roomservice (which you will have trouble getting as there is no list of the phone numbers). The TV has neither CNBC nor Bloomberg, the shaving mirror and hairdryer are in the wrong place. Bathtub very slippery and water not strong enough in the shower, and there is a smell of the drains in the room. The breakfast room is too small and the fried eggs come completely dried out.", "title": "The scaffolding is still up", "helpfulness": 1, "user": "blacklab", "date": "November 3, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 6052571, "likes": {"liked": "— Location", "disliked": "— Room"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006", "text": "Anything good at this place? Yes - the bed is very comfortable, the lighting for reading in bed is good, the staff at reception are friendly and the location could not be better, Green Park tube station only two minutes on foot.", "title": "FABULOUS!!!!!", "helpfulness": 2, "user": "HolAngel", "date": "November 3, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6051891}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "I came here because my usual hotel was full up (the Chesterfield in Mayfair) but will NEVER return.", "title": "5 star room, 2 star service", "helpfulness": 1, "user": "Deborah42", "date": "November 2, 2006", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 4.0, "location": 3.0}, "id": 6049109, "likes": {"liked": "— Large confortable bed", "disliked": "— Expensive hotel, charged for all extras normally provided in cost, poor staff attitude & closed bar"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The refurbishment is now complete and the results are stunning.", "title": "Noisy!!", "helpfulness": 1, "user": "cmcr", "date": "October 31, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 6031643, "likes": {"liked": "— Very convenient and central location.", "disliked": "— Poor customer service."}}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "This is an Uber-Cool hotel in possibly the best location in London. Its near EVERYTHING you want to see, however, its in a quiet street, set back from Picadilly. So you get the fabulous location without the noise.", "title": "It is so LOUD. The construction is AWFUL", "helpfulness": 4, "user": "JLTRIP1", "date": "October 16, 2006", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 5961374, "likes": {"liked": "— Modern style", "disliked": "— loud noise"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Definitely stay for overall standards and location. The downsides are no pool or proper spa with jacuzzi. The staff are very good and the hotel is very welcoming. We had stayed before and had a great room with large bathroom including bath and shower.", "title": "An overall good hotel in a central location", "user": "RMHH", "date": "April 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 128258567}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "This time we only got a shower which was disappointing and there were inconsistencies with service. First night we had turn down and complimentary water - the second neither. Either do it or don't. My expectations were set and so we were disappointed on the second night.", "title": "Gorgeous Hotel!! Fab location!! LOVED IT!!", "user": "MsMuhit", "date": "April 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128121082}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Breakfast is good. We felt since last time the breakfast had gone a little down hill but overall it was still good compared to others.", "title": "Beautiful Hotel. Very Chic. Uber Cool!", "user": "Olivia M", "date": "April 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127982815}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "Where do i start! I booked a superior room as a surprise for my partner following our engagement BUT it was myself that got the bigger surprise from the hotel!!", "title": "Excellent in every way.", "user": "MarkMarije", "date": "April 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 127805414}, {"rating": 2.0, "title": "Not 5 star standard", "text": "We were warmly greeted and shown up to our room which appeared to be a lot bigger and a lot more beautiful than what 'I' had expected!? My partner ofcourse was thrilled and pleasantly impressed thinking I booked this super cool room:D It was a gorgeously large Junior suite and the decor was so classy. It was perfect. We also were greeted with a bowl of strawberries dipped in chocolate Mmmm :D We were so grateful and overwhelmed with their kind gesture and would most certainly return. The hotel staff/management went out of their way and helped make it a very enjoyable and beautiful experience which we won't forget anytime soon..so THANK YOU. I would certainly recommend the hotel, it's so lush! :D", "user": "HelenaD", "date": "April 10, 2012", "id": 127613365}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled solo", "text": "This hotel seems to appeal to those who want to be seen (including the obligatory C-list 'celebrities'), which means people-watching in the bar is a great form of entertainment. That, combined with its location means it could be a fun base for a weekend in London. The rooms are a generous size, with lovely bathrooms but with some disappointments - the room lighting was poor (a bug bear of mine), the only table in the room wasn't the best for a business traveller and I was a bit surprised at the old-fashioned telly! I wouldn't rate the room service (tried it once and the food was awful) and I had to go out of the hotel to get a decent cup of coffee. Given it's not a cheap stay, I would expect more from a five-star hotel, and would suggest staying somewhere else and going there for a drink or two instead...", "title": "Over-rated", "user": "KiwiInPimlico", "date": "May 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129148234}, {"rating": 1.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Booked a room for Friday night in order to attend a friend's 40th Birthday party in WC2. My husband and another friend were to meet me after work at the hotel for a drink before the party.", "title": "Disaster", "helpfulness": 1, "user": "GlennM_20", "date": "April 30, 2012", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 1.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 129124473}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "To cut a long story short, I checked in on Friday evening but owing to issues with the internal communications at the hotel, when my husband and friend enquired after me at the reception desk (having bumped into each other in the foyer), they were told several times that I was not in the hotel. This led to a very anxious hour and a half for them worrying about me going 'missing'. Meanwhile, oblivious to my apparent 'disappearance', I was sitting in my hotel room getting worried about where my husband and friend were. Eventually they made contact from outside the hotel via the hotel operator. Without wishing this to sound like some west-end farce (which, in fact, it was), the ripple effect of the 'lost' hour and a half meant that the evening started off on the wrong foot and never caught up. Stressed and behind schedule, our night out turned into a disaster, for which I really hold the hotel responsible. For want of a nail, and all that.", "title": "Excellent location, rooms need better cleaning", "user": "Meeyankee", "date": "April 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 129099397}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Whilst booked through lastminute.com 'top secret' hotels, I didn't expect the third rate service provided. I had to queue for ten minutes in order to check-in and the bar turned out to be tacky, overpriced and too loud.", "title": "For this price I'm sure there would be a much better hotel.", "helpfulness": 1, "user": "Gazza316", "date": "April 30, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 129084963}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Perhaps next time I'll just book a budget hotel and at least I will know where I stand.", "title": "Great hotel in great location!", "user": "Dlira", "date": "April 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128601754}, {"rating": 1.0, "title": "Drab faulty towers !!!", "text": "My husband and i stayed at the Mayfair for two nights over new year. As i had to work over xmas we decided to treat ourselves to what we thought was going to be a luxury well deserved new year eve break. How wrong and disappointed were we. The hotel was very drab and dark with no real decorations to say it was christmas. This really disappointed me as the Ritz and the Meridian nearby were all decked out. (Only 2 small trees on the first floor which unless you went up there you wouldn't see.) Our room was obviously designed by a man as it had no dressing table to get ready or do your hair at. There was a hairdryer in the bathroom but nowhere to plug a hair straightener into near a mirror as the only mirror was in the bathroom. On the first night i discovered our bedspread as having what appeared to be stains on it when i unfolded it and as it was late i left it on the floor and reported it to reception the following morning only to find it back on our bed the following night. This was really disgusting. The shower head fell off when i tried to adjust it and to top the stay off when we ordered breakfast in bed on our final morning hoping it would make ammends for our terrible stay it arrived with no toast, no fruit salad and wait for this, two of the preserve pots had been opened and used !!! This was the final straw. Nearly £50 for breakfast that was only half a breakfast and appeared to be someones left overs !!! I think the previous review of the hotel only really making an effort with the excecutve guests is very true. So unless you have money to throw away go elsewhere. In my opinion i have had better service in a premier lodge for 1/4 of the price.", "user": "Derbyshire-MrsS", "date": "January 5, 2010", "id": 52676297}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "I was really looking foward to my stay in the may fair but was a little dissapointed when i got in and seen my room it was average to say the least it says something about a room when u get excited by the bathroom but believe me that was the best bit about the rooms they are small by comparsion to other hotels i stayed in london i upgraded to a deluxe room and they state on the website that selected rooms have walk in wardrobe and balcony i had neither would have expected at least one of these because otherwise what are you paying extra for?", "title": "Okay but nothing special", "user": "Glasg0w-traveller", "date": "January 2, 2010", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 5.0, "service": 5.0, "rooms": 2.0}, "id": 52379613}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We stayed at the May Fair hotel for one night just before Christmas 2009. We arrived at the hotel very early (10am) as we had an early flight to London. The staff in the lobby were very helpful on arrival. Our bags were taken immediately for delivery to our room. Best of all, we were immediately given a room even though it was well before the check-in time.", "title": "Excellent hotel - would stay there again", "helpfulness": 1, "user": "Liam023", "date": "December 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51989764}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Our room was large and modern with a great bathroom. The room was at the rear of the hotel and was extremely quiet. Throughout our stay the staff were always courteous and helpful.", "title": "Nice hotel but cleaning needs help", "user": "rakibey", "date": "December 21, 2009", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 51608418}, {"rating": 2.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The position of the hotel is also excellent. It is only a few metres walk from Green Park tube station and is also walking distance to Piccadilly, Oxford Street and the West End theatres. We would definitely go back.", "title": "Very disappointing", "user": "Hepburn42", "date": "December 14, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 3.0}, "id": 51226987}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 5, "variance": {"poor": 178, "average": 278, "very good": 506, "terrible": 133, "excellent": 727}, "aka": "May Fair London", "slim_ranking": 0.282527881041, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "description": "The luxurious May Fair Hotel is located in sophisticated Mayfair, resurgent again as London's true luxury quarter. The May Fair puts you in a peaceful spot right in the heart of the West End, between all the great parks, theatres, galleries and attractions of London and with direct underground links to Canary Wharf."}