{"user_rating": 4.0, "review_count": 87, "name": "The Lawns Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We visited The Lawns to eat on their terrace as it was a beautiful sunny day. As usual the bar man was a man of few words. He never smiles and certainly doesn't make you feel welcome. We always leave it a few months between visits in the hope that he may have gone to pastures new and they will have employed someone who smiles and makes you feel your custom is wanted.", "title": "Smiles would be nice!", "user": "Crocus20", "date": "August 20, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 3.0}, "id": 137737009}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "The food was good as always and the young man who served us was very pleasant. The older man's surliness means there is never a convivial atmosphere. We have met the lady owner who is a delight and so it is a shame that her barman/manager lets her down so badly.", "title": "Excellent location - pleasant stay", "helpfulness": 2, "user": "Pipsqueaker30", "date": "July 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 133852256}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Ideal location for the town of Holt and easy distance of Cromer and Sheringham. Good for cycling and walking. Comfortable hotel with good size rooms and ensuite facilities - shame about the hand held showers! Pleasant helpful staff, good breakfast choice and reasonably priced dinner menu.", "title": "Very welcome haven", "helpfulness": 1, "user": "Farseer", "date": "July 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 133426653}, {"rating": 1.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "A group of us stayed here in mid June, and had a super visit. Staff were welcoming and helpful, the reception rooms, including the conservatory, and the gardens, are lovely. The sun was shining, which helped, but it really was very pleasant to sit and look out onto the lawns and garden.", "title": "Sunday roast gone wrong", "helpfulness": 1, "user": "tuire w", "date": "July 2, 2012", "detail_rating": {"service": 1.0}, "id": 133270640}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We had a 'medium' room, high in the eaves, which was plenty large enough and had a very comfortable bed - essential for collapsing into after a hard day's walking. I loved the large, white, enamel bath, and the lavender seeds which fragranced it, although my husband was less impressed with the over-bath hand shower. We did have slight problems with the washbasin tap whilst we were there, but it was sorted out immediately.", "title": "Just a drink...", "user": "FrenchConnection92", "date": "June 25, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0}, "id": 132722042}, {"rating": 4.0, "title": "Good quality evening meal", "text": "We were staying for a long weekend near Holt and looking for somewhere to get a pleasant meal on a Sunday evening, not just the usual roast which my wife would cook much better. The Lawns was recommended as reliable and so it proved. We reserved a table which may not have been necessary, but the dining room was popular. The staff were friendy and attentive and went out of their way to locate us in a quiet pleasant spot. The choice was reasonable and the prices were fair. I had a tasty duck egg in cream sauce with chorizo for a starter and chicken breast with dauphinoise potatoes for main course. My wife had sea food for starter and a generous portion of pork belly for main. All were well cooked and tasty. Service was efficient if not rapid, but we were happy to take a bit of time. Two of us paid £50 in total for two courses each plus large glass of wine and coffee. the restaurant/ hotel is very near the centre of Holt with its own good sized car park behind, so it makes for a relaxing and agreeable dinner venue.", "helpfulness": 2, "user": "ChrisRugby", "date": "April 3, 2013", "id": 156517057}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We stayed at the Lawns in October last year and believe it or not the weather was fantastic.The Hotel is situated in the perfect position in this lovely town with great parking and close to all the shops pubs and restaurants,but as the best wine bar and restaurant are at the Lawns you don't have to move too far.", "title": "Happy in Holt", "helpfulness": 1, "user": "Andrew R", "date": "March 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154967403}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The hotel staff are very efficient and friendly.The breakfast was fantastic and if you wanted extra helpings they were with you very quickly.", "title": "nothing was too much trouble at this lovely village hotel.", "helpfulness": 1, "user": "Mike B", "date": "March 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153622683}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Holt is situated very close to the best walks in Norfolk so you can always work up an appetite for the great food at the Hotel.", "title": "A great place to stay", "helpfulness": 1, "user": "ianpip", "date": "February 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 152922107}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "We stayed in the large double rooms and they were huge and at £95 per night for the room very good value.", "title": "Table service for beverages would have been appreciated", "helpfulness": 5, "user": "TraLonW", "date": "January 7, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0}, "id": 149062347}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "I have stayed in this hotel quite a few times this year. I think it's well worth a visit, great fresh food, the rooms are good value and I found all the staff very helpful. The gardens are a great place to relax and the whole place feels like home, well done you guys someone at last has got it right!!!", "title": "Great Norfolk hotel", "helpfulness": 3, "user": "Stephen G", "date": "December 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 147357470}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We were drawn in for lunch on Saturday by the A-board outside proclaiming fresh locally-caught mussels, and they were truly delicious. We sat in the lovely sunny conservatory, and asked the young waitress for menus as she passed, having had no welcome from the uncommunicative barman. (My husband, having spent 43 years in the US, is still astounded that no one seems to want his money when we go into restaurants!) The waitress disappeared so my husband went to the bar to order our food. We waited too long for our meal, given that the restaurant was not at all busy. We were served silently by the waitress. What is needed is a \"presence\" or at least personable staff, and the prices whilst not hugely expensive require a much better level of service and customer care than currently available.", "title": "Lovely food - shame about the lack of service!", "user": "felicitybaker", "date": "December 10, 2012", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 1.0}, "id": 147154310}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "Nice hotel, clean and nice breakfast but attitude of owner leaves a bit to be desired had an argument at checkout, shame as it spoilt the weekend. We ordered some food and it came wrong would go back if the owner cheered up a bit !", "title": "Nice hotel but poor service", "helpfulness": 3, "user": "3Jonn3", "date": "December 9, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147086620}, {"rating": 2.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "The reviews and description of the hotel were fair and at £105 per night bed and breakfast we were expecting good things. We were disappointed. There was no proper shower, the shower was attached to the taps on the bath but no shower screen. The toilet did not flush properly. The toiletries were pathetic. The radiator was cold but when this was reported it was rectified immediately. The room was dusty and whilst the bed was comfortable, a normal double not a king size the duvet cover was torn and did not cover the duvet. The carpet needed both vacuuming and cleaning. We stayed two nights and ate in the hotel on one night. The meal was nothing nothing special. The breakfasts were adequate but whilst there was fresh fruit it was not cut up, digs and prunes were available. The information in the room was out of date as the milk was not fresh but small tubs. The best thing was the wifi availability. My husband thought it was good value but had not taken into account the £50 deposit and thought we had paid £80 per night.", "title": "Not up to expectations", "user": "Yorkengland", "date": "November 18, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 145684473}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "we spent two nights at The Lawns in October and enjoyed our stay. Room was good (room6); large, good double bed, good en-suite, good tea making facilities & biscuits and all in all a good standard. We requested non-allergenic bedding which was offered and provided. Heating in room was very good and hot water was hot! Breakfasts were excellent. Hotel is in centre of Holt so very handy indeed and carpark therefore very useful,", "title": "No hesitation in recommending this hotel", "helpfulness": 3, "user": "Nelsenn", "date": "October 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 143660408}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We were lucky enough that The Lawns Hotel had had a last-minute cancellation and therefore a room available when we wished to book for an impromptu trip to Norfolk. It was an excellent choice! The hotel is ideally situated in the [up]market town of Holt and a perfect base for exploring the north Norfolk coastline. We received a warm welcome from reception upon our arrival (the hotel has a private car-park) and they were more than happy to help with accommodating us and our little one.", "title": "The Lovely Lawns", "user": "Baba-Waga", "date": "October 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 143040135}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Our room was number 3 on the first floor, I believe this is one of the smaller rooms in the hotel but it was perfectly adequate for our needs and we managed to fit our standard-sized travel cot without problem. The room had a lovely modern bathroom, complimentary tea-and-coffee making facilities and pretty view of the gardens from the window. On the first floor corridor guests could help themselves to a bookshelf stacked with a small book and DVD library as well as further free biscuits & beverage sachets. We asked for extra linens for our baby's travel cot and these were promptly produced. We had a good night's sleep, however it is worth noting that the room is located fairly close to the staircase and some downstairs noise could be heard before the establishment closed up for the night. The restaurant is popular and the menu using local ingredients a definite draw so there were a number of diners in the bar and restaurant below, hence the background noise although this was by no means too intrusive.", "title": "Great location and cute hotel", "user": "2Goodies", "date": "October 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 142428765}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The next morning we had a leisurely cooked breakfast downstairs in the restaurant (veggie option for husband available), a high chair was provided for baby boy and the kitchen kindly kept a carton of formula for us in the fridge overnight. The staff were really helpful in assisting us with our trip to Blakeney and printed out materials for us to take on our journey. Afterwards we took a stroll in the hotel's gardens and those eponymous 'lawns', it was a lovely autumn morning and a shame we had to leave as I would have happily stayed longer for an al fresco lunch and a glass of the locale's home-made cordial! The terrace and gardens must be stunning in the summer-time.", "title": "Excellent room and food", "helpfulness": 2, "user": "barpet41", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141115254}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "Overall, I would most definitely recommend The Lawns for a break in Norfolk, the hotel provides a comfortable relaxing stay and Holt is a gem of a town offering artsy boutiques and the not-to-be-missed Byford's deli and restaurant. I would welcome a repeat visit!", "title": "Delicious food in a good setting", "user": "gusabus", "date": "August 28, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0}, "id": 138629486}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We've stayed here previously for four nights and then recently another three nights as we have family nearby. The rooms are very spacious and comfortable, (apart from the floor in room 4 is very squeeky and the traffic noise quite obvious). The proprietors are friendly and the breakfast is cooked fresh, the bar and lunch food is great. We were disappointed to be turned away for dinner one night when actually it appeared very quiet and the the bartender also wasn't sure why we had not been able to get a table, it meant we drove out to another restaurant which wasn't as relaxing as dining in. Otherwise, this place is very central, less than a minute into the lovely township of Holt. We would recommend it and we will be back.", "title": "Restaurant at The Lawns", "helpfulness": 1, "user": "Paul B", "date": "August 22, 2012", "detail_rating": {"value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 137999532}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 3, "average": 10, "very good": 29, "terrible": 2, "excellent": 43}, "aka": "Lawns Hotel Holt", "slim_ranking": 0.5, "description": "The Lawns Hotel and Wine Bar is a privately owned hotel that offers a high standard of hospitality and service. An ideal place to relax and stay while discovering the joys of the surrounding countryside and coastline.All the 10 bedrooms are en-suite, with freeview televisions and DVD players and tea making facilities.Enjoy the AA rosette restaurant and bar, offering a menu that reflects locally sourced seasonal ingredients in a range of delicious dishes. Relax in the Lawns fully licensed informal bar, with local beers and a wide range of wines and spirits. Coffee, tea and homemade cakes are available all day and can be enjoyed in the conservatory or our large south facing garden – ideal for relaxing in when the sun shines.There is a car park at the rear of the hotel and free wi-fi."}