{"user_rating": 4.5, "review_count": 1192, "name": "The Broadmoor", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "First, I love old, historic hotels and was looking forward to our stay at the Broadmoor, but that ended as soon as we entered our room. We were almost knocked out by the smell of some heavy-duty cleanser which was intended to counteract the strong dog stench. It didn't work. The dog stench was so great that all the cleaning agent did was make bad matters worse, i.e., two unpleasant odors instead of one. We immediately requested another room. The second room wasn't quite as bad, although one could tell dogs had been in that room also and, as another reviewer observed, there was HAIR, HAIR, HAIR everywhere--dog hair, that is. Another member of our group also had dog hair in his room. Note: If you plan on staying at the Broadmoor, make sure you pack a lint roller and plenty of refills!", "title": "Unless you have 4 legs, avoid the Broadmoor!", "helpfulness": 8, "user": "lavenderlady77", "date": "March 6, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 57904823}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Then, there was the whining, whimpering dog next door that we had to call the desk about--TWICE! Apparently, the guests had left the animal in the room and although we were told that was \"against the rules,\" the fact it was against the rules didn't make the dog shut up! After other guests also complained, someone finally removed the animal from the room.", "title": "Excellent to highly problematical", "user": "ToothFortCollins", "date": "February 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 57023016}, {"rating": 5.0, "title": "Amazing!!!!!!!!", "text": "The hotel staff seemed grouchy and unhappy and two of them told us they were just biding their time until they found other jobs. The reason? DOGS! No surprise there! One young member of staff said guests who consider themselves celebrities break all the pet rules and management says and does nothing, and if a staff member offends the pseudo-celebrity by attempting to enforce the rules, he or she is strongly reprimanded and sometimes even fired.", "user": "DeborahN4", "date": "February 23, 2010", "id": 56882889}, {"rating": 5.0, "title": "Majestic getaway", "text": "If the Broadmoor intends to remain in business, it's time it started catering to its two-legged guests because those of the four-legged variety don't have credit cards!", "user": "AnnetteBFerri", "date": "February 23, 2010", "id": 56843517}, {"rating": 5.0, "title": "Amazing!", "text": "I wouldn't recommd the Broadmoor to anyone unless the person was looking for a kennel!", "user": "ErikR3", "date": "February 20, 2010", "id": 56599486}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "My husband and I were given a gift of two nights at the Broadmoor over the Valentine's Day weekend. Neither of us had heard of The Broadmoor! Living a 7 hour drive away, we generally don't have a need to stay in hotels while in the state of Colorado, since we live here so, I have to say that we were absolutely suprised to find, when we arrived, that the Broadmoor truly was/is a five star hotel/resort! I am generally turned off by historic hotels because of the usual 'historic' problems with heating, lack of TV's or phones, etc but, the Broadmoor was a continuing delight throughout our short stay. There was nothing that I encountered, ate or drank that was not of the highest quality. The service was outstanding in every shop, restaurant, with every bellboy/girl and food service representative. Our entire weekend was a delight at every turn. We never knew there was such quality in the state of Colorado! This hotel/resort is every bit as accomodating as any 5 star resort we've ever visited in any other state or country with the exception being, there are no huge masses of people and the majestic mountain back drop is unparalleled in it's beauty. We were treated like royalty there, just like everyone else. We very much regretted not making reservations! Generally, I don't think getting a reservation is a problem but, we visited over the Valentine holiday and we were unable to get into any restaurant on Saturday night. This was our fault as we did not know we were going to be staying there until a few hours before we checked in. We did have a fun and fabulous meal at 'Summit' on Friday night. Oysters are not something I generally order out here in the middle of nowhere but, they were scrumptious! So firm & crisp tasting...! The foie gras was goose not duck and there again was another surprise; real foie gras from goose! Usually, upon asking whether it's goose or duck, it's duck at the price of goose or the waiter doesn't even know so, that made me VERY happy & it was easily some of the best I've ever eaten... pure silk. YUM. The meal was so fun! The decor was edgy & top notch as was the service. There was nothing snooty or pretentious about this restaurant whatsoever. If you need that, snootiness & pretense, go somewhere else. We had the perfect dining experience at 'Summit'. There is not one negative aspect that I could report. We wanted to dine at their 5-star (really!)restaurant 'The Penrose Room' but there was no way we could have gotten in with but a few hours notice. They were kind enough to tell us that they would call if there was a cancellation and just out of kindness they printed out a copy of their menu for us. We will absolutely make it back to the Broadmoor, with such items on The Penrose Room's menu such as Oscetra caviar, Colorado lamb tenderloin, Butter Poached Dover Sole with Tiger Prawn mousse, every kind of French cheese you could ask for, desserts such as Roasted Apple Napoleon... oh, and the hand made cocktails, freshly made and also all available as a non-alcoholic. Oh, yes, we will be back & next time we'll have a plan! (Oh, I can't forget Yarid's shoes... any shoe lovin' woman will not miss Yarid's).", "title": "A Wonderful Surprise", "user": "whymilikethis", "date": "February 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56140725}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled solo", "text": "First, this is probably the most luxurious European-style hotel in all of the United States. Everything about it speaks class, from the moment you pull up into either of the entrances to the moment you leave.", "title": "World Class", "user": "badcamaro", "date": "January 31, 2010", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54836437}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "Where you enter depends upon the tower in which you are staying. The main tower (the original structure) and the south tower (newly remodeled) require that you enter from the east entrance. This is a great experience, especially if it is the holiday season and the place is tastefully lit with lots of Christmas decor. If you are staying in the west tower (directly across from the main and south towers, with Lake Broadmoor right in the center), you enter from the west. This side is actually a bit less congested but no less stunning.", "title": "Service and Accomodations are second to none!", "user": "Texspike", "date": "January 25, 2010", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54360563}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "The front desk on either side is professional to a fault. While several of the employees seem to be in their early 20's, their level of attention and sophistication is outstanding. All rates and charges are explained to you (and you pay for everything - the place isn't cheap). That being said, it's worth every penny.", "title": "Truly the lapof luxuary! I wish I coudl stay forever!", "user": "emanon256", "date": "January 21, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54039364}, {"rating": 5.0, "title": "Mountain Retreat", "text": "The rooms are phenomenal - spacious, clean, tastefully decorated. Don't be afraid to choose one of the smaller or less expensive ones. Even these are large by most hotel standards. In fact, the small rooms are about on par in size with a suite at a La Quinta. The bathrooms have it all - marble shower, tub, sink, luxurious bathrobes. Beds are unbelievably comfortable. Views (when you check in, ask the front desk to show you a building map and the location of your room. They are happy to do it, and they will explain what view you will have. If you're not satisfied, they'll tell you what's available for the same rate with a better view) are beyond anything anywhere else. If you can, try for a mountain view (but a view of the lake is nice as well).", "user": "jeffkristy1", "date": "January 2, 2010", "id": 52395176}, {"rating": 5.0, "title": "Fantastic!", "text": "Though a bit pricey, this property is an absolute delight and the staff is almost too kind and helpful to believe. Went there for two days to get away from the rat race and spent about half my time in the spa, which was wonderful. Being Christmastime, throughout the resort, everything was magnificently decorated. White lights, Christmas trees, gingerbread village, fireplaces... just what I was looking for. Pleasant little shops right on the property. So much on the property, I never left the two days I was there! (well... I'd see other bits of C. Springs before I arrived). Room was a bit smaller than I expected, but quite nice with a beautiful view. And the whole property is so wonderful, doesn't make sense to spend too much time in your room anyway. Summit Restaurant was lovely. Great food. Again, staff throughout the place was amazing. Where did they find some natural nice, friendly, and helpful people? :) Superb. I'd definitely like to go back... and would recommend this to others who have the cash to spend. Plan on at least $200 per night for room, $50-80+ per person for dinners, $30 for smaller meals (breakfasts/lunch), and then whatever money you want to spend on excursions and/or shopping (half day in spa = about $300+ depending on what services you pick). But great for singles, couples, or groups. May be great for families in the summer (when pool and lake are open), but not much for kids to do in winter.", "user": "acflemming", "date": "December 21, 2009", "id": 51608526}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "A few visits to the Broadmoor just to see it lead me to want to stay there as a guest. This fall I got my chance. We booked a package for three nights; I requested a room in the older main building. From the moment we pulled up to the hotel from the airport until we pulled away headed back to the airport the Broadmoor did not disappoint. Our room was small but beautiful like staying in a jewel box. The grounds of the hotel are endless and very spectacular. We soon found rocking chairs by the large outdoor fireplace... having drinks looking out at the mountains and visiting with other guests was so enjoyable. The staff is outstanding. I left a very nice ring on the sink counter one morning.. I called the hotel...security got my ring and got it back to me much to my relief. Everyone we encountered seemed to want to make our visit as good as it could be. There are,of course, less costly hotels in Colorado Springs ..if, however, you are looking for a 5-star experience, great beauty, a historic building, and attention to your very request or need try the Broadmoor it will not disappoint you.", "title": "The Broadmoor Does Not Disappoint", "user": "southtripper", "date": "November 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 50095817}, {"rating": 5.0, "title": "The BEST!", "text": "I absolutely LOVE The Broadmoor. The location is beautiful beyond description and the staff is impeccable ... I can't wait to go back!", "user": "Blazergrad", "date": "November 20, 2009", "id": 49628112}, {"rating": 5.0, "title": "Conference venue", "text": "Although I only stayed one evening, it was a beautiful place to be. This resort had the feel of a small town college campus. The food in the pub was great, and service spectacular.", "user": "Ellengk", "date": "November 18, 2009", "id": 49461085}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "The setting of The Broadmoor is impressive, the staff is well trained but they tend to ask the same question over and over \"Is this your first time at The Broadmoor?\" \"Well , welcome back\". This was anoying but minor. Our main criticism was with the maintainance of our rooms. The mini bar was broken(it had been broken for a month we were told)and thus the contents were hot, spoiled and melted. We had a broken dining room chair, a broken light over the mini bar, silverfish in the bathroom and in one bedroom there was a cord stretched over a rug with tape over it that was curling up and was a tripping hazard. We have traveled alot and this was NOT a 5 Star quality experience.", "title": "Overrated and overpriced", "helpfulness": 1, "user": "travelokie", "date": "November 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 49356012}, {"rating": 2.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "--When you arrive at a hotel like the Broadmoor and have to wait 5 minutes at the check-in desk.", "title": "things that don't make you feel special", "helpfulness": 6, "user": "holly049", "date": "April 11, 2010", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 61002601}, {"rating": 5.0, "title": "Great Hotel and Resort", "text": "--When, upon checking in at 7 p.m., they tell you that yes, they're glad to report that they have a room that's been cleaned and is, in fact, ready for you. At 7 p.m. Really?", "user": "realtorbrenda", "date": "April 8, 2010", "id": 60783819}, {"rating": 1.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "--When they make you feel more like a number than a guest.", "title": "Unauthorized charges to my corporate card after I left to increase room rate.", "helpfulness": 16, "user": "AK_Professional", "date": "April 7, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 1.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 60672727}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "--When the bar starts zipping up at 11:30 p.m. on a Saturday night w/ a hard closing at midnight. I mean, I know it's an older demographic here, but c'mon.", "title": "A Lovely Hotel", "helpfulness": 1, "user": "Diamond00", "date": "March 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 59551129}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled solo", "text": "--When you schedule brunch for 11 a.m. on their grounds (actually, get that reservation after being told they pulled some strings but made it happen for you) have a noon checkout, ask if you can extend it to 12:30 or 1 p.m., and are told, point blank, `No. We're just too busy.'", "title": "If you are attracted to classic, historic hotels, featuring exceptional service...look no further.", "user": "cornell1984", "date": "March 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 59501027}], "location": {"country": "United States"}, "stars": 5, "variance": {"poor": 40, "average": 54, "very good": 166, "terrible": 22, "excellent": 910}, "aka": "The Broadmoor Hotel", "slim_ranking": 0.0285714285714, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "The BROADMOOR is the longest-running consecutive winner of both the AAA Five-Diamond and Forbes Travel Guide Five-Star awards. Our Colorado Springs resort is located on 3,000 lush acres under the shadow of the Rocky Mountains and offers an award-winning day spa, fitness center, two swimming pools, three outdoor hot tubs, one lap pool; 54 holes of championship golf, six tennis courts with tennis camps; children's programs; 24-hour room service, valet parking, 24 specialty retail shops, 19 distinct dining options; and we are pet friendly."}