{"user_rating": 4.0, "review_count": 1201, "name": "The Morgan", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Very cool hotel, definitely a unique experience. We loved the room, especially the bathroom. Excellent free drinks the first night. Hotel becomes a club on the weekends so the lobby is loud at night, but you can't hear it in the rooms. The location is ideal!", "title": "We had a great stay", "user": "hatchbackking09", "date": "October 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119570975}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Second visit to this great hotel ideally located in the heart of Dublin. The rooms decor is modern and spacious, and very comfortable. The staff are friendly, knowlegdable and helpful. Previous visits have been for business and will be returning shortly for a personal trip.", "title": "The Morgan, Dublin", "user": "James H", "date": "October 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119550941}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Our fourth stay at The Morgan, and as good as ever. Ideal location, really nice rooms and very friendly and helpful reception staff. Looking forward to staying again soon.", "title": "The Morgan, Dublin", "user": "James H", "date": "October 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119526748}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "I would reccommend this Hotel to anyone on business or pleasure. The hotel is very chic and stylish. The rooms themselves are modern and well designed and also extremeley spacious. The staff are very helpful and polite. They are also knowledgeable of the surrounding area if you are unfamiliar which can make sure your stay in Dublin is the best it can be. Although I was there on business I'm already planning a trip back to Dublin with friends and will definately be staying here. Its also very good value for money which is important in this climate, you get a top class night for a very reasonable price.", "title": "A night spent in style", "user": "Louise H", "date": "October 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119514990}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "This is a great hotel with a modern vibe yet with comfortable decor, easy walking distance to many of Dublin's sights and on the edge of the Temple Bar pub district. I stayed in a deluxe room which was a 20Euro upgrade over a standard room but was available for checkin at 0800 hrs after an overnight flight - the upgrade was well worth it. High-speed internet worked flawlessly and was fast. The room had Individualized heat/cooling air control - not a staple in Ireland. I would definitely stay here again. My only warning would be to people who have mobility problems - there are stairs to get to the elevator and getting into the bathtub/shower is a pretty interesting leg stretch.", "title": "Surprisingly Quiet in a Loud (& Fun) Dublin Neighborhood", "user": "HikerAndRunner", "date": "October 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119474100}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Myself and my partner checked into The Morgan last saturday as a treat, as we often go there on a saturday for drinkies!!, on arrival we were greeted by a chatty , friendly and extremely helpful receptionist.W were offered an upgrade for a great price, our room was beautiful. My partner is in the hotel business and even he was so impressed. we spent The evening having some cocktails and people watching! We were kept amused by the various characters we chatted to throughout the evening!! all ages and nationalities!...we will definately be returning soon for another great night....PS: the bed was so comfy it was like home away from home.xxjayne", "title": "What a Fantastic night!", "user": "Jayne R", "date": "October 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119467517}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Recently stayed in The Morgan hotel in Dublin for the first time. Having stayed in many hotels in Dublin and around the World this was one to remember. Everything from arrival to departure was above par and exceeded recommendations in every respect. I would recommend this to anyone thinking of Dublin for a trip and I know where I will be staying the next time I am there. 5 Stars all the way.", "title": "The Morgan gives More Than", "user": "JOR213", "date": "October 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119439171}, {"rating": 1.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We spent several nights here in July. The first room had so many easy-to-remove carpet stains, and it smelled bad. They upgraded us to a different room that was cleaner, but the grout was black when it's original color was tan, and there was a smear of toothpaste left behind by the last guest on the sink.", "title": "Over-priced and filthy", "user": "JSharpFamily", "date": "October 17, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 119380057}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "This is not a hotel for the easily offended; the \"Mona Lisa elevator\" is showing her bare behind at you.", "title": "Fantastic Service", "user": "Patrick H", "date": "October 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119286802}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "The Internet access is expensive. Their business office is sparse, and the one red chair in there was disgustingly filthy.", "title": "As 'cool' as a drunk uncle at a wedding; in the heart of Dublin", "helpfulness": 1, "user": "RobbertOhio", "date": "October 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 1.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 119253968}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "The Morgan is a trendy hotel centrally located in Dublin. A sort of hipper and more unique local form of a \"W\" type hotel. friend had recommended it and said it was in the center of all the action and they were right. By night, the bar was had awesome music and a great crowd. There were plenty of areas to enjoy friends and the crowd but also small nooks for an intimate drink and an outside terrace. If you decide to venture out at night, there are many great spots along Fleet Street to enjoy a drink and live music including the famous Temple Bar. By day the hotel offers a great full Irish breakfast buffet that is only 10 euro and allows you easy access to many tourist spots (Dublin Castle, Trinity College, various museums, and the river) all with blocks. During the day check out the \"hop on, hop off\" green buses for only 16 euro for a tour of Dublin with over 20 stops. You can't beat it as a way to see the city and learn about the history- plus the stop is only 3 blocks from the hotel. Net you can't go wrong with The Morgan.", "title": "Hip hotel and bar in the middle of the action (Temple Bar area) and close to key tourist sites", "user": "WorldTravelerCS", "date": "September 24, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118544532}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "My usual hotel in Dublin was full so I had to go elsewhere. I was apprehensive about choosing the Morgan. It's a busy street, lots of noise, parties all night, and I knew nothing about the hotel. Was it a dive? Nope… not at all.", "title": "Pleasantly Surprised", "user": "Bingbangboing", "date": "September 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 118525555}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "My room was spacious and clean. The bathroom was modern and roomy. Water gushes from the shower. The finish and furnishings were modern and minimal. There isn’t any clutter, but the room doesn’t feel empty. Slick, and to the point.", "title": "One of my favourites", "user": "dandelionco", "date": "September 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 118445977}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "The bar is busy at night. I had a room at the back of the hotel overlooking a courtyard and it was quiet. Never heard a thing. I had dinner one night and the food was good - pasta with chicken.", "title": "Reasonable Hotel but a little tired. Excellent location.", "user": "John_from_Stafford", "date": "September 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 118440427}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "My only negative observation is that the sheets & pillow cases smelled pretty strongly of laundry detergent on the first night. It wasn’t so obvious afterwards. Maybe they need another rinse?", "title": "Great Dublin Hotel - In the heart of the action", "user": "peter g", "date": "September 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118404181}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "This was probably a very cool, sexy hotel at one time. Today, it feels uncared for (my room wasn't vacuumed, the heated towel rack had long since had its power cord severed, cracks in the ceiling/walls, king bed was just two twins pushed together, etc).", "title": "Strictly a party hotel, albeit past its glory days", "helpfulness": 1, "user": "D K", "date": "October 12, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 4.0, "location": 3.0}, "id": 119237909}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Significantly, it is located in the center of the party action in Temple Bar, and hosts a happening, clubby bar itself. This meant thumping Eurodisco that we definitely heard (and felt) until it after 2am each morning. This is not the place for a family looking to get a wholesome rest. Staff did not seem too enthused about their jobs, either.", "title": "Stunning chic boutique Hotel", "helpfulness": 1, "user": "Pamela F", "date": "October 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 119136437}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "On the positive side, breakfast was good. But for my money, I'd have been happier elsewhere.", "title": "Modern hotel in great location for centre of Dublin", "user": "PJordy", "date": "October 7, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 119032589}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "The Morgan Hotel without doubt is my favourite Hotel whilst in the Capital & have stayed on numerous occasions. Having got engaged in the Morgan we actually booked in for the first night of our honeymoon!", "title": "Female traveller in her mid 20s.", "user": "Neha P", "date": "September 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 118640134}, {"rating": 2.0, "stay_parameters": "Stayed September 2011", "text": "A stunning chic Boutique Hotel with an excellent location & never fails to impress!", "title": "Am afraid the negative reviews are correct !!!", "user": "Heffstar", "date": "September 26, 2011", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 118590720}], "location": {"country": "Ireland", "continent": "Europe"}, "stars": 4, "variance": {"poor": 88, "average": 159, "very good": 334, "terrible": 75, "excellent": 545}, "aka": "The Morgan Hotel Dublin", "slim_ranking": 0.122905027933, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Immerse yourself in The Morgan Hotel, in the heart of Temple Bar. The Morgan holds host to chic guestrooms, a funky cocktail bar, crazy outdoor spaces, cool meeting rooms & an amazing Penthouse with rooftop garden. Sophisticated fun, ultra stylish, modern chic and Dublin’s best loved boutique hotel The Morgan has 120 deluxe guest rooms, offering a celebration of contemporary design, clean, simple lines, uncluttered elegance."}