{"user_rating": 4.5, "review_count": 1066, "name": "The Bloomsbury Hotel", "reviews": [{"rating": 5.0, "title": "on business", "text": "I stayed at this hotel for 1 night only. service was second to none , all the staff from cleaners to managers were exceptionally helpful and polite. they couldn't do enough for me and made my busy stay enjoyable. I will definitely stay there again. well done", "user": "Lisaflinders", "date": "November 29, 2012", "id": 146451209}, {"rating": 5.0, "title": "fantastic hotel", "text": "we stayed at the bloomsbury hotel on 25/11/12 and were delighted with the room and the service the staff provided. we were particularly pleased with the service we received from the concierge for whom no request was too much trouble and who's knowledge of the area and recommendations were perfect.", "user": "mylesmirror", "date": "November 29, 2012", "id": 146436947}, {"rating": 5.0, "title": "Excellent hotel", "text": "I spent 3 nights in the hotel and it was wonderful. The rooms were very comfortable, good bathroom, and very friendly and helpful service. The price for the room might have been a little too high, but everything in London is expensive.", "user": "McRae2011", "date": "November 27, 2012", "id": 146315185}, {"rating": 4.0, "title": "Quality decor and service but perhaps a bit too atmospheric", "text": "The location was superb. Tube is only 100 meters away. Covent garden and Soho in a 2 minute walk. Picadilli 10 blocks away....", "user": "Mike M", "date": "November 27, 2012", "id": 146314400}, {"rating": 5.0, "title": "Fantastic weekend", "text": "I would definitely go back again and recommend it to a friend.", "user": "ColeandFletcher", "date": "November 25, 2012", "id": 146147696}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "5 mins walk to Tottenham Court Rd tube station. Beautifully decorated hotel, nice bar, rooms well appointed if a little cold. Concierge friendly and helpful. However we were disatissfied by the cold manner of the reception staff. On checking in, one receptionist was on the phone to her bank checking her account in full view of guests. The lady who served us did not smile once and barely looked at us whilst taking our credit card. I work in the customer service industry, so poor service always effects my choice of hotel. Great location let down by service.", "title": "Great location and lovely hotel let down by front desk", "user": "Ashley321", "date": "January 22, 2010", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 1.0, "rooms": 4.0}, "id": 54114740}, {"rating": 1.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We have stayed here before and were impressed, however after the last stay just before Christmas I think we’ll be going elsewhere in future. The room had been booked for 2 months and was lovely – even if the view was just down one of the tiny side streets. We had trudged up from Southwark in torrential sleet so we thought we would have a bit of a relax and a nap after check-in before going out for something to eat. My wife and I awoke after about half an hour and the room was very chilly – which wasn’t great because she was coming down with a cold. I checked the heating controls and there was an ominous spanner flashing on the display. A call to reception led to an engineer eventually arriving and then disappearing again. After another half an hour of waiting and we finally decided to give up and hit the town. At reception, they told us that they were still trying to fix the heating in that section of the hotel and if, when we got back, they had failed they would move us to another room as “ we’ve got plenty available.“", "title": "Messed about and then downgraded !", "helpfulness": 3, "user": "puffpod", "date": "January 22, 2010", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 54081540}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We got back at about 10.30pm and were allocated another room. So we had to grab all of our stuff and trudge up 4 floors to the new one. This room was considerably different to our first one. Much smaller, it appeared to be located in the very innards of the hotel as the view wasn’t even to the outside, just some grim interior service courtyard. And to make matters worse, although the heating certainly worked, it sounded like a jumbo jet taking off and we had to turn it off once we went to bed. We were so tired, we couldn’t be bothered to complain. To add insult to injury, the room opposite ours acquired it’s occupants at about 2.30am and they weren’t your shy retiring types lets put it that way. With their room service supper as well the din didn’t die down until about 4am.", "title": "Nice Hotel but Deluxe room very Small", "user": "Fionacarol", "date": "January 16, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 53627545}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "So in a nutshell, messed about and then shunted off to an inferior box room opposite a couple of big mouths in an apparently largely empty hotel. How nice it would have to have been upgraded, just so the nasty taste left our mouths. Never mind – one votes with one’s feet as they say.", "title": "Great Location, Lovely Rooms", "user": "6622p", "date": "January 12, 2010", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 53272421}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We booked a deluxe and while the room was decorated lovely we felt it was very small for a deluxe room in general. Would hate to see a standard size room! It was advertised on their website as a totally different room and a lot bigger. The bathroom was very cold with no means of heating it. In general our stay was good. Fantastic location for shopping in Oxford street and close to Leister Square and Soho. Tube Station right at the end of the road which took us everywhere within minutes.", "title": "An absolute cracker of a hotel", "user": "Baldychops", "date": "January 10, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53106972}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Our 2nd time here and once again a very pleasant stay. A hot hand towel and a welcoming drink were offered at check in. I had mentioned that it was our anniversary and we were given an upgraded room upon arrival and then 1/2 hour later there was a knock at the door and a lovely chilled bottle of prosecco along with a card arrived! All very nice touches that will ensure we would not hesitate to stay here again. The room was lovely and the hotel is perfectly situated for a night out in the West End. All the staff we came across were charming and friendly.", "title": "Lovely Hotel", "user": "LisaUKUk", "date": "November 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 185787654}, {"rating": 5.0, "title": "Lovely stay. ", "text": "Just returned from a three night stay at this great hotel. The staff really make this a lovely place to stay. It is fabulously located for theatre and shopping. The room was lovely especially as we were up graded. Very comfortable and well appointed on the sixth floor. No problem with any noise and I'm a light sleeper. Didn't eat breakfast but the pre theatre meal was lovely.", "user": "jenniwren10", "date": "November 24, 2013", "id": 185702486}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "We stayed at the bloomsbury this month on a shopping trip! The hotel is well maintained, clean and very well organised. The check in was great, hot towel and a drink on arrival is such a nice touch. Our room was beautiful and immaculate, breakfast excellent although the coffee taste could be better. Nice buffet! Dinner is lovely, beautiful ambience and the phillipino barman was fun, we had to wait in the bar to get a table but we probably should have booked! Thanks!!!", "title": "Fantastic stay", "user": "Mike G", "date": "November 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 185688701}, {"rating": 5.0, "title": "Bloom-intastic!", "text": "Stayed at the Bloomsbury Hotel two weeks in a row for business. A very warm reception by Ben on the desk, hot towel offered and lovely festive cinnamon drink too which were lovely touches. The room was tastefully decorated and bed very comfy for a great night's rest. Breakfast has a great continental selection. I enjoyed the fruit salad, as nice choice of fruit including few types of melon, pineapple and papaya, yum! Coffee/Tea, toast and fresh juice is brought to you by order which is good service. Also dined in the hotels restaurant. I opted for two 'small plates' of squid and seafood noodles which were very tasty however they were bigger than expected so I probably could have been satisfied with one, however I'm sure those with larger appetites would have been more than happy. Really love this hotel, keep it up!", "user": "Raksha B", "date": "November 23, 2013", "id": 185606633}, {"rating": 4.0, "title": "Very good.", "text": "My wife and I decided to return to the bloomsbury as we were on a shopping trip. As usual the reception staff were excellent, couldn't do enough for you. I requested low floor which we were given. The restaurant food was very good with very good service! The room was very clean and bed comfortable. Breakfast was ok but the service was not!! We felt we were being rushed to finish our breakfast on the first morning of our stay as the manager on duty constantly was looking at his watch and looking towards our table. On the second morning we asked for toast to be better toasted and it was as if we were asking them to cut their arm off for us. Not too good considering the price we paid for our two night stay. Overall this hotel is beautiful and would return but without paying to have breakfast", "user": "Sjm250985", "date": "November 22, 2013", "id": 185468279}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Have just returned after a 3 night stay with my wife. We are both able bodied. We booked a superior room and were allocated room 319. The bathroom is kitted out for disabled guests (good point generally) which means the bathroom is a wet room for ease of access (good point again). Unfortunately, when you use the shower it is difficult to contain the water within a reasonable area (bad point). There is also no view as the room looks into a small inner courtyard (bad point again - why should disabled people not have a view too?). However, what really killed this room was that there is some sort of air duct/vent that runs directly above the ceiling and it is very noisy. We rang reception just before midnight and they sent someone up who told us it would eventually switch-off - it didn't, which made for a very sleepless night (very bad point). On the other hand, by the time we went to reception the next morning we had already been allocated a new room (422) and were offered many apologies (but nothing else - even a complimentary glass of wine would have been appreciated ). Our new room was much better (although even here there was another noise coming from something mechanical in the ceiling but which was less intrusive and only intermittent). Great Russell St is not in itself a pretty street but the overall location is excellent for West End theatres, shops and restaurants as well as accessing all that Marylebone, Camden etc have to offer. Generally, everyone at the hotel was very polite. There is an elegant reception/foyer that exudes a real \"upmarket\" feel (as good as, for example, the Goring Hotel). Although there was a Christams party being held on Saturday night we heard nothing of it from our room. Breakfast is not cheap (£15 for continental and £21 for English) but what you expect to pay in this location. The rooms were clean and the beds comfortable. Would I stay again? Despite the problems I have described the answer is yes. We may have just been a little unlucky but next time I will definitely not just make an internet booking but will also phone ahead and insist on not being allocated room 319.", "title": "Excellent location and good service", "user": "BigMac58", "date": "December 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147077234}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The location is excellent and the rooms are nice. The staff is usually helpful, but not always. Thus, the sink in the bathroom was half clogged, but during the whole week of our stay nobody tried to fix it. Apparently the cleaning lady did not bother to alert the maintenance about it. Also, the \"Reception Team\" is too quick in charging the dredit card given at check in, when your account rises to more than 750 pounds.", "title": "Good but not perfect", "helpfulness": 1, "user": "Raffi_9", "date": "December 9, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 147047334}, {"rating": 4.0, "title": "Blooming lovely staff", "text": "The breakfast is excellent.", "helpfulness": 2, "user": "hattamr", "date": "December 7, 2012", "id": 146965781}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "This is a Lovely boutique hotel close to British museum and close to shops. Great foyer area.", "title": "Great staff, horrible food.", "helpfulness": 1, "user": "Laura F", "date": "December 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 146847187}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "Staff could not be more helpful and courteous. Very good service.", "title": "With our thanks", "user": "Kiwigirl74", "date": "December 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146744003}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "First impressions count for a lot. From the moment the doors are opened for you by 2 doormen on your arrival you know you have arrived somewhere you want to stay. Reception was friendly and efficient and offered to help with theatre bookings, dinner bookings etc. Incredibly we were offered a smoking room which we took. This turned out to be on the top floor of the hotel but the speedy lifts made light work of that.", "title": "Excellent Hotel in Central London", "helpfulness": 1, "user": "RussBrighouse_UK", "date": "November 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 50090512}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Stunning views from the window over the rooftops towards the BT Tower made me glad I am a smoker. The room was not large but was certainly adequate for our needs, after all how much time do you actually spend in your room when you are a tourist in London.", "title": "The Bloomsbury gets it right", "user": "suffolk2", "date": "November 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49737786}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The room was clean and was cleaned every day of our stay, the bathroom had heated floor and heated mirror which is a godsend for shavers!", "title": "Looks beautiful but we had some problems", "helpfulness": 2, "user": "Lucy_Jones", "date": "November 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 49511945}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "All the staff we met during our stay were friendly and approachable.", "title": "Beautiful place to stay", "user": "Abovity", "date": "November 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 49141060}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The location is excellent, within 2 minutes walk you can be in the British Museum or Oxford Street.", "title": "Amazing room -decor, lighting, comfort!!!", "user": "lamethley", "date": "November 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 5.0}, "id": 49138642}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled solo", "text": "I was born in London well over seventy years ago but have lived in North America for 44 years. I return to the city every few years and have generally been disappointed at the low standards of hotel keeping in relation to the price.", "title": "An oasis in the London hotel desert", "user": "Nicolaman", "date": "November 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 48720011}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The Bloomsbury was outstandingly good, and good value.", "title": "almost right", "user": "Stormbel", "date": "November 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 48684056}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Check-in was easy after booking on the excellent website. The room was clean, and looked new, and was large by London hotel standards.", "title": "The perfect hotel, the perfect/classy spot in London.", "user": "KatePow", "date": "November 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48532479}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The 32\" LCD TV worked properly (sometimes they don't) and the room was quiet.", "title": "Classy", "user": "ComberBoy", "date": "November 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48241171}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The bathroom (always a good criterion) was the most modern I have encountered in Britain, but I was unaccustomed to the taps which were, I think, German, and I would have appreciated an instruction diagram in the room brochure. Once I figured out the shower and the bathtub settings they worked perfectly.", "title": "Recommended place to stay in London", "user": "Sara W", "date": "October 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47631550}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "I stayed here with my two children Tuesday 29th and Wednesday 30th October. We had to amend our booking due to trains not traveling into London the previous day, the hotel kindly amended our booking and did not charge us for the Monday evening that we where original booked. The staff at the hotel we extremely helpful and made the children feel very welcome. The rooms where well furnished, clean and comfortable.", "title": "Fun in london", "user": "Joanne S", "date": "November 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 186041766}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "We did not eat breakfast at the hotel as I thought that paying the £15 charge for children was excessive considering they are 8 and 4 considering I had to upgrade the room to accommodate one adult and two children.", "title": "Lovely Hotel", "user": "Charlotte0501", "date": "November 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 185942251}, {"rating": 4.0, "title": "Very impressed", "text": "Cost of hotel not cheap but not excessive for London. Location great.", "user": "Barbara T", "date": "November 25, 2013", "id": 185877633}, {"rating": 5.0, "title": "Can't wait to go back!", "text": "Children loved the concierge Brian he had loads of time for them a credit to the hotel", "user": "lola186336", "date": "November 25, 2013", "id": 185842515}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "I would return to the hotel again very enjoyable visit.", "title": "Lovely hotel", "user": "sarah s", "date": "November 25, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 185788357}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Great Qualtiy:Price for a nice hotel that is extreemly well located. We booked our weekend on the web and there was an excellent package that we took. I would recommend it any time and will defineitely go back if I am back in London.", "title": "Beautiful and well located hotel", "user": "Knight_Forever", "date": "January 2, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 52393773}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled with friends", "text": "The hotel is ideal for walking to covent garden, shaftesbury ave etc. We stayed for one night and paid £133 plus VAT for a double room. The room was nice and clean but quite dark. There was tea/coffee making facilities, bath and shower. There is a nice bar and restaurant, large lobby area where you can order drinks etc. when the bar is closed. Staff were friendly and helpful.", "title": "Excellent Location", "user": "2aspen", "date": "December 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 51274644}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with friends", "text": "Fab hotel, would return again! Great location for Covent Garden, Soho, Oxford street. Excellent rooms - comfiest bed I've ever slept in. Plenty of bars and restaurants in area.", "title": "excellent standard and location", "user": "welshblonde", "date": "December 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51070258}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "This hotel is beautiful, warm and stylish and the staff are very friendly. You enter the hotel to be greeted with a gorgeous huge reception area with lovely decor and beautiful fitments.", "title": "LOVED IT!!!!!!!!!!!!", "user": "Adisgruntledcustomer", "date": "December 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 50612318}, {"rating": 2.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Our room was lovely and clean and well fitted. They kept our party together so we were in adjoining rooms.", "title": "Overbooked - Disapointed", "helpfulness": 4, "user": "Seat24A", "date": "December 2, 2009", "detail_rating": {"location": 5.0, "service": 1.0}, "id": 50468466}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "After a slightly disappointing experience last year the hotel contacted me and offered a free upgrade and breakfast if we returned. We did go back exactly 12 months later and they honoured that commitment throughout our 3 night stay. Given that breakfast is over £20 each, my wife and I recognised that was a fairly substantial offer on their part and it was therefore appreciated. This is a good hotel and we like it and although there is the odd thing that niggles we will likely be back again next year.", "title": "As good as their word", "user": "BigMac58", "date": "December 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 187108753}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Ok, so this review is backdated quite a bit, though hopefully it'll still be of use.", "title": "Amazing Stay at the Bloomsbury", "user": "Mr-Mrs-Explorer", "date": "December 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 187098776}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "My husband & I stayed at the Bloomsbury in April 2012 for 3 nights. We decided to book the bloomsbury at the time due to its trip advisor ranking - it came within the top 10 in London at that time, though as our trip drew nearer there were quite a number of not so good reviews. It was a special break for us, and we didn't want to risk being let down, we debated cancelling and changing hotel to one of our original contenders, though we opted to contacted the hotel directly, the GM at the time was Becky, who replied offering us a good deal of reassurance about our forthcoming trip.", "title": "Lovely staff", "user": "sarah_duffield", "date": "December 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186859470}, {"rating": 4.0, "title": "Great Hotel, Great Location", "text": "We had the most amazing stay, on arriving our room was not ready, though the receptionist advised we had been upgraded to the middle room category which was a lovely added bonus, we were advised to come back at 2pm. We arrived back and our room was still not ready, and we were asked to take a seat for a few minutes, the assistance manager then came over to speak to us and he had upgraded us to a suite for the entire stay!!!", "user": "faarias", "date": "December 4, 2013", "id": 186787350}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "We were shown to our huge room, with an entrance seating area, a huge bed, a seperate seating area with 2 chaise's, a massive flatscreen tv, and to top it off a massive bathroom, with seperate room for WC, seperate area for shower, 2 wash hand basins and a beautiful roll top bath - with TV mounted in the wall!!!! And to top it all off - a bottle of Moet was delivered to our room - i thought the waitress had brought it to the wrong room at first, then she advised it was courtesy of the manager!!!", "title": "2 night stay bloomsbury great russel street", "user": "Steven R", "date": "December 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 186607078}, {"rating": 3.0, "title": "Very good location", "text": "Spent 4 nights for business at the Bloomsbury Hotel. Another average 4-star London hotel, neither great not poor. On the positives: Very good location, just next to Tottenham Court Road station and a few minutes by cab from Covent Garden, the Strand, Oxford Street or London St Pancras station. The bed is fine and clean. Good eggs Benedict at breakfast. Free WiFi and newspaper including the Financial Times. On the less positives: Small room, no view, noisy room fridge, clogged sink in the bathroom (as reported in a previous comment - that is just unacceptable). The bar and breakfast room are located on the lower ground floor, meaning no window / natural light. Staff is OK (95% international, mostly from Eastern Europe), but not exceptional and not passionate: just doing what they need to do. I could have put 4 stars not 3, but at £250/night + tax, it deserves an average rating.", "user": "pierre_mathilde", "date": "November 17, 2012", "id": 145603466}, {"rating": 5.0, "title": "A wonderful hotel", "text": "Stayed here for a week in early November, and loved it. From the moment we stepped out of the cab we were greeted with a very friendly staff. Check-in was easy and flawless, and room 623 very welcoming. Plenty of room to put all belonging away, including suitcases, and a roll away if required. The bath and amenities are superb. Location can not be beat. We enjoyed champagne in our room prior to stepping out to watch the theater ... only steps away. Shopping is also just minutes away in Covent Garden and Oxford Street. Can't wait to get back to London again and stay here.", "user": "RandyRively", "date": "November 17, 2012", "id": 145586048}, {"rating": 4.0, "title": "My return trip!", "text": "I stayed here a second time exactly one year from my last visit. It's a great hotel! Excellent service, comfortable beds, breakfast included, fitness center and free wifi. Oh yeah and great value and location.", "user": "Beth B", "date": "November 14, 2012", "id": 145361832}, {"rating": 5.0, "title": "I've stayed in a whole lot worse, for a whole lot more!", "text": "I very much enjoy my visits to the Bloomsbury and expect I will stay here again in the future.", "user": "SharonRooney", "date": "November 11, 2012", "id": 145158784}, {"rating": 5.0, "title": "Should be a 5 star", "text": "Having stayed here three times now I have to say its one of my favourite in the city! After a day of filming and travelling im always made to feel VERY welcome! From the reception staff to the maids everyone seems to smile as they pass!", "user": "Instructdrive", "date": "November 11, 2012", "id": 145134601}, {"rating": 5.0, "stay_parameters": "Stayed November 2012", "text": "Only stayed here for one night but had a lovely time. Hotel excellently located for central London. The room was spacious. Good sized bathroom with power shower and luxury toiletries. Fab breakfast. The staff are this hote's best asset. Really friendly and helpful. Will definitely come back. Oh and Jonathan in the bar makes a fab martini!", "title": "Excellent hotel with friendly staff", "user": "BossyCrossy", "date": "November 25, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 146127805}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "First, it's a great hotel, from all aspects.The location is right near the British Museum, Oxford st. and transportation.", "title": "An exceptional place", "user": "Tami S", "date": "November 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146121271}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "The rooms are clean, beds and bathroom are great.", "title": "Exceptional Service", "user": "Kevin K", "date": "November 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 146112503}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "breakfast is very rich and tasty.", "title": "Excellent stay in a great hotel", "user": "Sigurdsson1962", "date": "November 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145740422}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "But above all - we had a medicel emergancy while staying and the staff was exceptionally supportive, caring and encouraging.", "title": "Average I guess", "helpfulness": 1, "user": "CasaMurguia", "date": "November 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 145723771}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "A really nice hotel in an amazingly convenient location", "title": "Short Stay for 50th Party", "user": "Markallaa", "date": "December 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 186512648}, {"rating": 4.0, "title": "Enjoyable", "text": "All the staff were friendly & very helpful", "user": "Umpycook", "date": "December 1, 2013", "id": 186407427}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "The 2 course pre dinner meal was very good value", "title": "'Amazing'", "helpfulness": 1, "user": "paula c", "date": "November 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186360830}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "The complimentry bottle of water on departure is a nice touch too", "title": "Wonderful", "helpfulness": 1, "user": "Marie S", "date": "November 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186191180}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "My partner and I got here on 29th of November and stayed for 2 nights. The location is amazing. We were upgraded and received pressco as it was my birthday which was lovely! The room was clean and quiet. The few niggles were that the water pressure was not so good, the drinks were very expensive, and upon check in we were not told where anything was or times of breakfast etc. was just given our key. Also at lunch time we wanted to sit in the bar for drinks and nibbles but it did not open until 4pm? So sat in the lobby which We was not happy with so we went out.", "title": "great service, super hotel", "helpfulness": 1, "user": "john p", "date": "November 27, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 186079329}], "location": {}, "stars": 4, "variance": {"poor": 14, "average": 85, "very good": 312, "terrible": 10, "excellent": 645}, "aka": "Bloomsbury Hotel London", "slim_ranking": 0.0501858736059, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Just a few minutes’ walk from Oxford Street, Leicester Square and Covent Garden, The Bloomsbury Hotel (formerly Jurys Great Russell Street Hotel) is a fabulous fusion of London design styles. Its Superior and Deluxe bedrooms, modern restaurant, bar and conference centre blend old world grandeur with contemporary comfort and new technology, offering everything for the discerning visitor in a London setting of immense charm."}