{"user_rating": 4.5, "review_count": 722, "name": "The Oberoi Bali", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Our fourth stay (for our 10th anniversay), our third in a hard to beat ocean view private pool villa with beach view across the lawns from the front terrace and a large truly private Balinese pool in the rear along with a raised dining deck with views to the ocean. Each villa and its surrounding walls are beautifully built of coral with a very royal Balinese style and feel. It may be 30 years old but you'd never know it as it is maintained in pristine condition, we think it is the most under rated of the 5+ star hotels in Bali and we have stayed at most. It is unassuming and understated from the road but once inside it is just a wonderful haven with personal service at your fingertips. Service is not frenetic and over the top like the Ritz Carlton it is just unobtrusively there when and as you want it. The beachfront breakfast is a highlight as is the fine dining restaurant. You can walk out into Seminyak to cheap eating if you want & the hip Ku de Ta is next door etc. Granted it is not cheap but by comparison it offers fantastic luxury, quality & value against the others.", "title": "Always outstanding", "helpfulness": 5, "user": "oztraveller123", "date": "November 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10847274, "likes": {"liked": "— private pool, garden & service", "disliked": "— leaving"}}, {"rating": 5.0, "title": "A really lovely hotel", "text": "We went onto the serene Oberoi Lombok for a second stay (see our review) then back to the Ritz Carlton in Bali for a couple of days (huge, isolated from Jimbaran so you are captive, expensive, and nice enough but definitely not in the same class as the Oberois).", "helpfulness": 5, "user": "mizzgem", "date": "November 12, 2007", "id": 10777814}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "This was our 9th visit to Bali and our first to Seminyak. The Oberoi is a lovely classy hotel with an old fashioned feel. I enjoyed having my sunglasses cleaned each day! We were surprised on arrival to be told we were entilted to a free buffet meal with Balinese dancing - we went to the Barbecue buffet and it was one of the best buffets ever - the quality of the food was exceptional (I had to try 3 different desserts!). The hotel restaurant was very expensive and a bottle of wine was about £40 minimum so we ate in Seminyak at night (the Greek restaurant was very lively). Alternatively the restaurant 5 minutes along the beach - Gado Gado - has exceptional food at both lunch and dinner (different menus at each) and you can take your own wine - bought at very reasonable prices from the wine shop in Seminyak - and pay corkage. The horse riding on the beach was fantastic. Be warned about swimming in the sea though - there are serious rip tides. People were ignoring the warning flags and swimming anyway and sadly we saw 2 people drown.", "title": "Fantastic Stay... Minakshi & Sunil Goil , Noida", "helpfulness": 6, "user": "goiltraveler", "date": "November 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10630410, "likes": {"liked": "— traditional balinese architecture"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "My husband and I have just come back from a wonderful holiday ( 6 nights ) at Oberoi Bali to celebrate our 25th anniversary. The Oberoi hospitality is not unknown to us but this place overshadowed the others. Since the time we entered the gates till the time of departure , we felt truly welcome all the time. We have travelled globally and I must confess that we could not find any fault during our stay. We rented an ocean view villa ( without pool ) which was a fantastic place to stay . The whole place has been built in traditional Balinese architecture which was a good change. A very special mention to the staff , always friendly , pleasant and hard working and always remembered to address us by name. The restaurants , poolside etc. is all overlooking the ocean . Had superb breakfast every morning. Had a wonderful surprise Romantic dinner on the beach as a gift from our children but ofcourse with the help of the hotel. Situated on the Seminyak beach ,there are lots of interesting restaurants closeby serving the international cuisine. A must go place ....", "title": "Sophisticated and elegant", "helpfulness": 2, "user": "guydebalham", "date": "November 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10538029}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Stayed at the Oberoi as part of our honeymoon for 5 nights in August. Great hotel - very classy but understated. We would highly recommend it.", "title": "The Oberoi is amazing!!", "helpfulness": 5, "user": "Finchley_7", "date": "October 4, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10038286, "likes": {"liked": "— the room and the staff", "disliked": "— loved it all!"}}, {"rating": 5.0, "title": "Beautiful. Never let's you down.", "text": "Timeless elegance with old world service that you don't often experience anymore.", "helpfulness": 2, "user": "zedmeister", "date": "March 17, 2013", "id": 154898745}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The property always looks and feels immaculate despite it being one of the oldest luxury properties in Bali.", "title": "A really memorable experience!", "user": "yojussy", "date": "March 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154418655}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "The attention to detail is incredible and therein is their secret.", "title": "Magnifique Oberoi Seminyak", "user": "Jeanjakarta", "date": "March 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 154387013}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Every hotel seems to want to show off the latest gadget to shiny big tv and stainless steel fixtures and fittings. This place shows off its staff.", "title": "bali oberoi", "helpfulness": 2, "user": "william2021", "date": "March 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 153800012}, {"rating": 5.0, "title": "Perfection", "text": "This place sticks to traditional Bali.", "user": "RobB4", "date": "March 4, 2013", "id": 153681611}, {"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "Once in a while you find a pure diamond..", "title": "Perfection in every way. Truly the most amazing service by truly incredible staff you will ever experience. SPECTACULAR!", "helpfulness": 3, "user": "zedmeister", "date": "June 28, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 132948005}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The Oberoi Seminyak is truly perfect in every way.", "title": "Wonderful", "helpfulness": 2, "user": "RubyAustralia", "date": "June 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132565631}, {"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "The location is perfect for the best restaurants and cafes all within walking distance or a very short taxi ride.", "title": "Amazing!", "user": "Analoren", "date": "June 21, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 132414896}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "The hotel and the grounds are maintained to the highest standard.", "title": "Excellent Hotel - Especially the service", "helpfulness": 1, "user": "PeteAbroad", "date": "June 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132407921}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The rooms are spacious, bathrooms are beautifully appointed. The rooms are attended to twice daily and small touches like bottles of water and glasses placed on the bedside tables at night are a nice touch.", "title": "We'll come again", "user": "AirconditionedNation", "date": "June 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 132283368}, {"rating": 5.0, "stay_parameters": "Stayed April 2006, traveled solo", "text": "I was originally booked by my travel agent in a property down the beach. When I passed the Oberoi, however, I realised I had been cheated. I immediately went to the front desk and booked myself in. I never regretted it. The Oberoi Seminyak is more traditional and conventional than some of the more design hotels on the beach -- which I usually prefer. But what I do like about this hotel is its absolue lack of pretention, the simplicity and classic elegance. It's light yet simple décor focuses on quality and comfort, which is perfect after a long flight. it is also on the end of a stretch of very crowded, popular beach, and has the best beach chairs and umbrellas. I loved it. Sure, Bulgari and Nusa Dua and others are down the beach, and I checked them all out. I love a good hotel and am happy to splurge on my holidays. But this has a particular steady charm the others dont. If I want to stay at a trendy property, I would stay at my own private villa in town (I found one, but won't tell you where), which comes with its own private pool. Now THAT's cool. But if I want to be pampered on the beach, this is the hotel. I always kick off my stay at this hotel which provides a reliable \"soft landing\". From here, I move on to the ultra modern sophisticated hotels in Ubud, or chill out in one of my remote Villa finds elsewhere (my secrets), but this property never lets me down. Minutes by taxi anywhere in Seminyak, if you can be bothered to leave.", "title": "Loved Oberoi in Seminyak", "helpfulness": 4, "user": "travelfashionista", "date": "January 27, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 13043422, "likes": {"liked": "— Centrally located, but still private and exclusive and calm. Great beach views, pool, food, villas.", "disliked": "— Cant think of anything in particular. i liked it!"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Stayed here in December during an awful rain storm. However, the room was wonderful, food was great and the hotel was just well run. An example-- during a break in the rain, a bunch of people were leaving the hotel to head out. It ends up they put us with the wrong driver due to the rush. The driver was very nice and so was the car. Nonetheless, the hotel did not charge us and apologized twice. The front desk was great at helping with dinner and excursions. Although the first top hotel in Bali, it does not feel dated. Free computer room, nice gym, nice pool and the room was perfect. The location is great, on the beach and walking distance to the shops of Seminayak. Would stay here again in a heart beat.", "title": "Great Hotel", "helpfulness": 6, "user": "ediggidy", "date": "January 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12921992}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We spent 2 nights here at the start of our Honeymoon in October after our wedding in Kuala Lumpur. From the airport pickup to checkout, we couldn't have asked for a better start.", "title": "Idyllic and Relaxing", "helpfulness": 8, "user": "telmacbrit", "date": "December 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 11952834}, {"rating": 5.0, "title": "Awesome", "text": "We arranged for the hotel to collect us from the airport. The car was waiting with iced towels and bottled water, which was most welcome after the busy flight from KL.", "helpfulness": 6, "user": "Grubber22", "date": "December 11, 2007", "id": 11485574}, {"rating": 5.0, "title": "gorgeous Oberoi", "text": "Upon arriving at the property, we felt like royalty. We were given orchid leys and guided to some armchairs on the veranda overlooking the sea. This is not your average check in process. One of the staff then escorted us to our private villa, making sure to point out the amenities such as the restaurants, pools and spa. The villa was amazing, with it's huge private pool and outdoor dining area. Inside was a nicely decorated bedroom and huge bathroom.", "helpfulness": 7, "user": "lilly6", "date": "November 19, 2007", "id": 10916610}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "The Oberoi has the reputation of being one of the best hotels in Seminyak. We'd been to Bali a number of times in the past, but had never stayed at the Oberoi. Given the strength and breadth of the 5 star resorts in Bali, our expectations were very high. We left disappointed.", "title": "Quality is slipping", "helpfulness": 5, "user": "Tomroadshow", "date": "June 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 131239657}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "On the plus side the grounds are fantastic...beautifully manicured and facing out on the beach towards the sunset. The pool setting too was a lovely place to sit and relax. The location is great, close to shopping and next door to Ku De Ta on the beach. In the evenings, our children were surprised to come back to the room to find milk and cookies set out for them.", "title": "It really doesn't get better than this!", "user": "Redhead2405", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130879830}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "However the negatives outweighed the positives. When we first arrived, we were given a room that smelled heavily of mildew. We told this to the staff as soon as we entered the room. At first she denied the odor saying that the room smelled fine. When we asked to see/smell another room, she then replied that all of the rooms would smell the same as the same cleaning products were used. Finally she and my wife went off to look for other rooms, but my wife was sent back 30 minutes later having not seen any other rooms. We gave up and went for lunch outside of the hotel. Luckily when we came back they had found another room for us that didn't smell. The decor of the room wasn't spectacular either. While the bathroom was beautiful with a sunken tub and a shower that opened to the outside, the bedroom itself was a bit tatty. It had a woven, rattan like ceiling and furniture made from thick bamboo. Very Balinese, but not luxurious. The last straw for us was the food. The food and drink prices in the hotel are extremely high - higher than one would pay next door at Ku De Ta, and much higher than one would pay at other establishments in Bali. Given the reputation of the hotel, and the prices, we expected the food to be outstanding. It wasn't. Despite a full hotel, there was only one table occupied in the formal dining restaurant. We took this as a sign and instead went for a casual meal in the bar. We went for standard hotel fare - a pizza, a club sandwich, salad and a soup. Unfortunately it was worse than what you'd get a business hotel in other parts of Asia. After one spoonful of soup, my wife stopped eating it. The pizza was essentially a frozen pizza. Given the other, far better and less expensive options nearby, we were very disappointed.", "title": "Wonderful place", "helpfulness": 1, "user": "jassing", "date": "May 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 130652350}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We won't be coming back as the experience didn't match the price.", "title": "Wonderful", "helpfulness": 1, "user": "MegHogan", "date": "May 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130453859}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "Wow, what a fantastic hotel. It's on a huge plot of land and right on the beach. The rooms are in villas, the bedroom was huge and the bathroom spotlessly clean. The service in the hotel was second to none, we loved the sunglasses cleaning service and being offered a lift in a golf buggy whenever we were walking around. A relaxed breakfast overlooking the ocean was memorable. All in all this was a perfect short break and \"decompression stop\" en route to Australia.", "title": "Just lovely", "helpfulness": 1, "user": "Mantell", "date": "May 22, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 130435212}, {"rating": 2.0, "title": "Its OK...but", "text": "Stayed 7 nights ending 23 March 08. Well travelled mid age Aussie couple. Summary: The Oberoi Bali is ok, but only that. You can do much better for what is a top dollar proposition. (i.e we stuffed up mildly!). The staff are great. The setting is great. The standard rooms (called Lanais) are - for the $ - only just 'ok'. Most are garden view and some actually face walls! Some ocean view lanais lack privacy. These rooms - like the whole establishment - are a tad on the tired side, with stupid beds and awkward sunken baths. The villas are as usual a different world altogether....if you must stay there be in a villa. The breakfast setting and food/service was good; the main restuarant service & food was excellent and expensive. Heaps of good quality & value eateries and shops within minutes for ~$2 taxi fares in any event. The clientele were a mixed bunch (nationality, age, & sexual preference) but no sweaty secretaries from Birmingham thanks be. Nice little gym, 3 terminal free internet room, pool is tired & basic (what no swim up bar!?), boogie boards for low beach surf and thats about it mate.", "user": "DebJD", "date": "March 29, 2008", "id": 14621767}, {"rating": 5.0, "title": "old fashioned luxury", "text": "Stayed in this hotel after fleeing from the philipines because of the rain. Did not do any checking of the hotel since it was a last minute thing but thought that it being an Oberoi it would be fine.", "user": "gijsl", "date": "March 23, 2008", "id": 14460045}, {"rating": 5.0, "title": "Reasons to be cheerful...", "text": "And indeed it is a great place, no over the top luxury rooms, old fashioned tv's, no trendy interior etc. as you have in soo many of the resorts nowadays but overall feeling of old fashioned luxury and service. Great gardens, lovely swimming pool, very good Spa (book in advance) and small but fine gym. Service was fantastic as you would expect, but you never know. Did not have dinner in the restaurant since we like to go out and see other places as wel, especially with so many nice restaurants in the area (La Luciola, Gado Gado, Ku De Ta, Living Room, Warisan, Hu'u etc.) but lunch and breakfast was very good.", "user": "Wotski", "date": "March 5, 2008", "id": 14060392}, {"rating": 5.0, "title": "Unbeatable in Bali", "text": "Location is amazing with so many resorts not having direct beach acces, besides it is on a great part of the beach.", "user": "TimmyTraveller", "date": "March 2, 2008", "id": 13989483}, {"rating": 5.0, "title": "Heaven on Earth", "text": "Loved our stay, will probably not go back there since we always like to try new places/destinations but this is one that could \"break\" that habit", "user": "katsdublin", "date": "February 1, 2008", "id": 13169045}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The Oberoi Bali is clearly a very superior Hotel with well maintained beautiful surrounds and lovely well appointed rooms. we stayed 6 nights in a private villa with a large pool. It was very private with high walls and lovely outdoor and indoor areas. Service was constant, but if you wanted privacy and left the sign on the gate, then no-one bothered you.", "title": "New Years in Bali", "helpfulness": 4, "user": "RealDogLover", "date": "January 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 148965211}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The main pool is large enough given the limited rooms in the place and the beach is clean and patrolled. Water was clear and waves were big enough.", "title": "Great location", "helpfulness": 2, "user": "mmhsydney", "date": "January 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148950805}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We had breakfast included in our deal, and we ate at the restaurant each morning, either outside or inside depending on the weather. Good food choices, good service and beautiful surroundings.", "title": "A classic", "helpfulness": 1, "user": "SarahVH1982", "date": "January 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 148943048}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Lots of wildlife with large lizards, we had one living in our roof, small squirrels and many birds. All added to the experience.", "title": "Oasis in mist of crowds", "user": "Linda R", "date": "January 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 148936917}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "Hotel is close, 5 minute walk to some very good restaurants and bars, and lots of shopping opportunities. Be careful of money changers, as we got ripped off twice, and I thought I was very being very careful!", "title": "Service at a higher level.", "user": "Kitman911", "date": "January 3, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 148681252}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "This is one of the most lovely hotels we have stayed at.", "title": "Fabulous holiday - great service", "helpfulness": 6, "user": "Sniggers", "date": "December 1, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6314909, "likes": {"liked": "— Very private", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The staff were just so attentive. Nothing was too much trouble.", "title": "Wonderful stay-again!", "helpfulness": 4, "user": "5holidays", "date": "November 30, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 6307774, "likes": {"liked": "— Location and price", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "At the pool we were brought sun cream, water and cool towels. The whole place was so peaceful and tranquil but at the same time so professional and slick.", "title": "A beautiful haven", "helpfulness": 5, "user": "Kim M", "date": "November 18, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6149698, "likes": {"liked": "— peace & quiet"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Breakfast facing over the ocean was a real treat, as were sundowners lying on a 4 poster day bed on the beach. The stuff that we all dream about.", "title": "Magic", "helpfulness": 2, "user": "Sauvarin", "date": "November 16, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6138104, "likes": {"liked": "— 100% luxury", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Our bedroom was very very comfortable and relaxing. The highlight for me was the huge marble sunken bath. What can I say?", "title": "great honeymoon", "helpfulness": 7, "user": "torontofriend", "date": "September 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5881010}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The Oberoi is absolutely wonderful. It was the original Luxury hotel in Seminyak, so it is older but that is half the charm as its set on acres of beachfront land and the villas and lanais are all one level. It is so old world that the moment you get there you are relaxed. The rooms are spacious and modern with. the g best beds and pillows.", "title": "Loved this hotel", "helpfulness": 3, "user": "tigerbeer", "date": "January 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151068167}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "They have a shuttle service to Legian several times a day but really you hardly need to leave the hotel. The breakfast is al'carte which is a nice change from the usual Buffett. We had room service one night so we could stay and watch the tennis finals and it was delicious and very reasonable", "title": "Excellent Hospitality and Wonderful service", "helpfulness": 4, "user": "JKC05", "date": "January 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 151064753}, {"rating": 5.0, "title": "Luxury with a smile", "text": "The service around the pool is great, they put a towel over the hot cover on the sunbed then tuck it all in, place your beach towel at end of sunbed then give you a tray with cold towels cold water bottles, suncream, and water spray . They come around the pool with fresh fruit on a stick and ice cream . There is an afternoon tea every day and lots of other entertainment going all the time.", "user": "Sonal K", "date": "January 28, 2013", "id": 150800787}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The staff are truly. Amazing , typical of Oberoi staff, so friendly , always a smile and hello and nothing ever to much trouble for them", "title": "They make up with extra things for their older grounds.", "helpfulness": 4, "user": "Helen34438", "date": "January 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 149772583}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "We loved it.", "title": "beatiful hotel with great location", "user": "Kev E", "date": "January 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 149607459}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We have just returned from a 12 night stay at the Oberoi Bali and cannot praise it highly enough. Throughout our stay we felt well looked after and valued.", "title": "Wonderul hotel and staff", "helpfulness": 4, "user": "markandlan", "date": "June 24, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 17188000, "likes": {"liked": "— space available", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The setting is beautiful, the hotel itself wonderfully quiet calm and relaxing and the staff and attention to detail truly wonderful.", "title": "One of the best", "helpfulness": 2, "user": "SiWoking", "date": "June 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16961657}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We stayed in a garden view lanai towards the back of the hotel and whilst this is the standard room type it was a good size, fully equipped and well maintained. With nice little touches. The veranda area felt private and we didn’t have any reservations about sitting out in our robes for morning coffee. We even had a pair of birds we fed fresh fruit to each morning!!", "title": "Perfect!", "helpfulness": 1, "user": "traveltonsEdmonton", "date": "June 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16927188, "likes": {"liked": "— everything was nearby", "disliked": "— price"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Our stay was from 9th June to 21st June and during the second week I believe the hotel was fully booked. The public areas never felt overly busy and there was always a high ratio of staff to guests, plenty of sunbeds to choose from around the pool and on the beach. The majority of the guests were young to middle aged couples although there were a few families with young children.", "title": "Best on Bali Beach", "helpfulness": 3, "user": "profgjay", "date": "June 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16745765, "likes": {"liked": "— Location, quality of the rooms and restaurant, pool", "disliked": "— that I couldn't stay longer"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We stayed on a room only basis so ate and drank at various places throughout our stay. The food and cocktails served in the hotel were great if a little pricey in comparison to other bars and restaurants a short walk away, however, unlike in other hotels we have stayed at (eg Anantara Spa, Koh Samui) we did not feel that we were being totally ripped off by paying the hotel prices, the standard and quality was definitely superior. We would opt for the bed and breakfast option next time though as the Oberoi breakfast was mammoth and the views from restaurant wonderful!", "title": "Perfect place for Honeymooners", "helpfulness": 3, "user": "ashton_dave", "date": "May 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16403003, "likes": {"liked": "— Friendly and couldnt do enough for you", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "I just came back from a one week stay at the Oberoi and I have to say that it was probably the best vacation in my whole life. Altough we are frequent travellers and stayed many times in deluxe hotels in Asia and other places, the Oberoi in Bali is definitely one of our favourites.", "title": "The Best Ever", "helpfulness": 2, "user": "Swiss77", "date": "April 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7340914, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Of course, the location of the hotel is amazing, you get the see the most incredible sunsets and the hotel infrastructure is very upscale. But the best of all was certainly the professionalism and friendliness of the hotel’s employees, very attentive but not too much around either. We loved every single second of our stay and will surely choose to Oberoi again when back to Bali.", "title": "scary", "helpfulness": 15, "user": "enjoyingit", "date": "April 8, 2007", "detail_rating": {"value": 1.0}, "id": 7292247}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "Finally I’d like to add a tiny remark to the last comment: it is unfair and excessive to advise not to stay there because of insecurity. My husband and I can confirm that I never felt insecure during our stay.", "title": "Loved the Oberoi", "helpfulness": 2, "user": "ozintokyo", "date": "February 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6840207, "likes": {"liked": "— The location and feel of the hotel", "disliked": "— the food"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "It was THE perfect holiday in THE perfect hotel.", "title": "Luxury stay in a top location", "helpfulness": 6, "user": "DebbieReading", "date": "January 16, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6604671, "likes": {"liked": "— Location", "disliked": "— Price of drinks - but there are plenty of places nearby that it doesn't matter"}}, {"rating": 5.0, "title": "Wonderful, low-key, classic", "text": "We only stayed at the Oberoi for 2 nights because on the third day the villa next to the one my children and parents were staying in burnt to the ground. i understand that having a thatched roof will increase the chances of fire, however the fact of there being NO smoke detectors or ANY fire alarms is quite unacceptable.", "helpfulness": 4, "user": "inspiteof", "date": "December 26, 2006", "id": 6500255}, {"rating": 5.0, "stay_parameters": "Stayed September 2005, traveled as a couple", "text": "Neither my girlfriend or I could fault the Oberoi for the 13 days we stayed there. Our memories remain of the most amazing hoilday (from quite a list) we have ever had.", "title": "Absolutely world class relaxation", "helpfulness": 7, "user": "pugwash4x4", "date": "July 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8203619, "likes": {"liked": "— The staff and service", "disliked": "— price of in house food"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Things we loved:", "title": "Yes, indeed, it's wonderful", "helpfulness": 13, "user": "Bert-Fred", "date": "July 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8203279, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Staff- invariably gracious, friendly, hard working open and pleasant. Could not have been nicer.", "title": "Honeymoon in Oberoi", "helpfulness": 5, "user": "Manon34", "date": "July 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8061632, "likes": {"liked": "— The private villa and pool", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Service- Absolutely perfect- neither other the top nor understated- that perfect point between the two", "title": "Wonderful stay", "helpfulness": 3, "user": "Mazworldtraveller", "date": "June 25, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7987691}, {"rating": 5.0, "stay_parameters": "Stayed May 2007", "text": "Hotel- Rooms were beautiful and very very comfy. Barthrooms were just as you'd expect. We got a free upgrade after 3 days to a pool villa which are heartily recommended- these are truly beautifl villas. Breakfast outside your room is well worth it.", "title": "Heaven on Earth", "helpfulness": 4, "user": "Phil+Katie", "date": "June 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7952569, "likes": {"liked": "— serene lxury", "disliked": "— nothing at all"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2012", "text": "Booked hotel for our honeymoon and were not disappointed. On arrival we were upgraded to the pool villa with a partial sea view which was amazing. Villa was spacious and very clean. Wonderful pool and outdoor hut. Service was exceptional and the staff excellent. They made our stay welcoming and comfortable. Food was very good but on the pricy side. Overall amazing hotel and would recommend it.", "title": "Wonderful experience", "user": "Chigyp", "date": "May 22, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 130394607}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The staff here are amazing always greeting you with a smile and getting to know a little about your holiday expectations. Set among beautiful villas which are not facing your neighbours and give you a feeling of privacy. Surrounded by tropical grounds and beach you have the taste of paradise only a foot step away!", "title": "Luxury 5* Hotel", "helpfulness": 3, "user": "MagnetikRob18", "date": "May 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129508436}, {"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "You can be as sociable as you like meeting other guests at afternoon tea served by the pool area, at the bar area (light snacks) or at the a la carte restaurant or taking a walk outside the hotel where there more restaurants (Ku de ta international cuisine, Potato head huge trendy bar or Sardine which is a short drive by taxi incredible seafood overlooking a rice paddy fields). If you like a good massage try Bodyworks short walk from the hotel.", "title": "A piece of heaven!!", "user": "Skrooobz", "date": "May 3, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 129328827}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "If you are keen on Scuba Diving, i can recommend the Nautilus Diving School (PADI) run by a german national called Werner who is very patient and i passed my Open Water with him and his team. There are some great dive locations such as the US Liberty (wreck) in Tulamben.", "title": "A little disappointing after all the hype...", "helpfulness": 1, "user": "Temeaux", "date": "May 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 129276632}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We love this hotel so much after staying here in October last year that we are now going back this June 2012", "title": "Like the movies . . .", "helpfulness": 4, "user": "marina1979", "date": "April 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128545394}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We are regular Bali-hoppers and decided to try out The Oberoi Bali over the weekend. The property is lovely, in traditional Balinese style, with low-rise cottages situated right smack on a nice private strip of Seminyak beach.", "title": "No-beroi", "helpfulness": 9, "user": "Tris10", "date": "July 6, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 17580741, "likes": {"liked": "— Location, well-appointed rooms", "disliked": "— Front desk staff"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "However, given the warmth and hospitality of the island of the gods, we were in for a nasty surprise. The Oberoi Bali is the most no-can-do hotel we've ever stayed at.", "title": "Tranquil Oberoi", "user": "turnjac", "date": "July 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 17564153, "likes": {"liked": "— tranquil surrounding", "disliked": "— pricey food choices"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We stayed at the garden-view Lanai, which is the cheaper option to the Villas. Given that my partner was 6-months pregnant, we couldn't understand why we were placed in a room at the furthest edge of the property. Can we change to another lanai, closer to the reception? No can do. Full occupancy. Oh, so that explains all the dark, empty cottages we pass on our trek back every evening.", "title": "Good, but not the best", "helpfulness": 1, "user": "toneer", "date": "July 4, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 17512648, "likes": {"liked": "— The grounds", "disliked": "— the room"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The room rate comes packaged with a Continental breakfast. Can we change this to a full American? No can do. Please order ala carte.", "title": "Great location, Impressive staff", "helpfulness": 2, "user": "thedoodlegirl", "date": "June 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17322127, "likes": {"liked": "— The pool area"}}, {"rating": 5.0, "title": "Serenity in Bali", "text": "Our flight home was at 8 pm. Can we extend check-out by one hour? No can do. We're full, remember?", "helpfulness": 3, "user": "ellelle", "date": "June 24, 2008", "id": 17189145}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Our stay at the Oberoi was the first between the 3 hotels we tried in Bali. We chose to stay in it first because it seemed like the quitest and most private hotel between them, since we were going on our honeymoon. The pavilions (huts) were really set up nicely. The beach of the hotel was really nice and the service there was fantastic. Few minutes after arriving at the beach, someone would come to you with a tray that has cold water bottles, water spray bottle, and a sun protection. Oh, and a cold fresh face towel. We stayed there for 4 nights. The service is extremely impressive as everyone get to know you there by first name basis very quick.", "title": "Honeymooners hotel", "helpfulness": 3, "user": "halloul23", "date": "May 24, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 16359647, "likes": {"liked": "— Daily fruits, Friendly service, Beach", "disliked": "— Restaurant, No activities"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "My advice is, only go there if you want to be isolated and relaxed. The restaurant there was not our top choice and is quiet pricey. Although the hotel was full when we went (beginning of April) but we hardly saw anyone most of our stay.", "title": "Tranquil Bliss", "helpfulness": 3, "user": "Meathman", "date": "May 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 15857164, "likes": {"liked": "— Service, Beach front location", "disliked": "— Pricey Bar & Restaraunt considering what is available down the road"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "I would only recommend this hotel to a couple going on honeymoon and don't mind being alone together most of the time. Do not depend on hotel events for entertainment or at the hotel restaurant. Would I go to the same hotel next time I go to Bali? Probably not. But that's only because we like hotels that are more lively and have more variety of restaurants.", "title": "Definitely the Oberoi!!!", "helpfulness": 5, "user": "ReddersTL", "date": "April 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15453412, "likes": {"liked": "— The grounds, the rooms, the service!!! Everything!", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "Stayed here on the second leg of our honeymoon and would go back tomorrow given half the chance!", "title": "Oberoi - very very good", "helpfulness": 11, "user": "lynton1", "date": "April 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15118713, "likes": {"liked": "— simple & stylish", "disliked": "— no view of sea"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The Oberio is set on the beach at Seminyak which is about 10 minutes drive from Kuta. The setting is soooo peaceful and the hotel itself is set out in a village style on the beach.", "title": "Honeymoon Bliss", "helpfulness": 2, "user": "DMJ110979", "date": "April 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15099860, "likes": {"liked": "— The individual rooms with private facilities", "disliked": "— Cant think of a down side - too many pillows on the bed ha ha ha!!!"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Beautiful. Peaceful. I advise you to get the full breakfast in advance, it's amazing. Seminyak is not Ubud, the people here are clearly more 'professional' but hey, it's still amazing", "title": "Loved it!", "helpfulness": 3, "user": "Caoimhin", "date": "June 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 131980383}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "By far the best hotel we have stated at in Bali. The staff are so very helpful and always make you feel welcome, nothing is an issue. The hotel is stunning, poolside and the gardens are amazing. They have hammocks by the ocean and free use of body boards and flippers when required. They make sure you always have fresh water when laying by the pool and often bring sorbet around while you relax. Will be staying there again for sure!", "title": "Our best stay in Bali", "user": "mariothetraveller", "date": "June 11, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 131714815}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We stayed here for 4 days and from the moment we entered the perfectly manicured grounds we knew we were going to have a truly memorable experience.", "title": "Outstanding Oberoi", "user": "julesten10", "date": "June 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131650914}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "The hotel is styled in traditional balinese fashion but with akk the mordern facilities. Our room 262 was located in the middle which was great.", "title": "Celebrating anniversary with friends", "user": "millymillymoo", "date": "June 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131598016}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The staff here were amazing always smiling greeting us by our first names and always available.", "title": "Pure bliss", "helpfulness": 1, "user": "mayaron", "date": "June 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 131515752}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled solo", "text": "I have just spent 5 nights at this wonderful hotel, and absolutely loved it. The rooms are superb, clean and very traditional - I especially loved the bathroom, and couldn't choose which to use, the sunken bath or the shower, so used the both. All the staff are wonderful, and I loved having my sunglasses cleaned by the pool, and the complimentary fruit and ice creams throughout the day. The restaurants are great, and breakfast at the Frangipani Cafe is a wonderful experience, with a superb choice of fruits, eggs, wonderful coffee and too much choice. Location is wonderful, with some great restaurants nearby. The Living Room and Ku De Ta are especially good, but don't miss a meal in the a la carte restaurant at the hotel. I could not fault this hotel, and would definitely go back again. We stayed at the Oberoi in Cairo last year, and absolutely loved the experience there too, as the Oberoi Group are synonomous with excellence. An absolute treat.", "title": "Opulent Luxury", "helpfulness": 7, "user": "SoloTravellerLondon", "date": "October 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10029890, "likes": {"liked": "— I can't single anything out"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We just came back from a 8 day stay at the Oberoi Bali and I have to say that it was probably one of the best vacation in my whole life.", "title": "Absolutely Beautiful hotel", "helpfulness": 6, "user": "battersaweib", "date": "September 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8755491}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The hotel staff was incredibly helpful and friendly, from the gentleman who picked us up at the airport to the concierge who arranged our departure. The size of the hotel is perfect and was not over-crowded, and there was no problem getting sunbeds by the pool or the beach each day. They even provided chilled water, sunscreen, cool towels, and ice-creams complimentary!", "title": "The BEST Hotel I have ever stayed at!", "helpfulness": 9, "user": "MD11", "date": "September 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8722480}, {"rating": 4.0, "title": "Slice of heaven in crazy Seminyak", "text": "Enjoying a few days in this majestic hotel. Wonderful grounds, service is perfect and the accommodation very comfortable. The pool area by the ocean is nicely located, with breakfast area and amphitheater for special events.", "user": "Max R", "date": "March 3, 2013", "id": 153575625}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Meals also up to the standard required of such a prestigious resort.", "title": "The place to stay in Bali!", "helpfulness": 1, "user": "BallyfinAbu", "date": "February 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153370149}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Some of the reviews I had read before I stayed there said that the Oberoi in Seminyak was showing its age. If so, it's ageing very well. It would be difficult to find any fault with this hotel. The rooms and villas are a delight. The location is excellent: right on a stretch of beautiful beach and within 10-15 minutes walking distance of restaurants and shops. The staff is well trained, friendly and helpful. When you stay here try the restaurant Sate Bali; it's just outside the entrance to the hotel, although somewhat hidden behind a market.", "title": "An extraordinary experience in Bali", "user": "m123178", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153008289}, {"rating": 5.0, "title": "Excellent wedding venue", "text": "What is special about this resort is the timeless quality of the resort. For a resort, age is usually a bad thing, at the Oberoi it has the opposite effect for two reasons. One, the resort was built at a time and place when the land prices were not what they are today. Therefore the resort can afford to spread itself out far more than the newer neighbors, more space = more peace. Second, the resort is built of timeless natural materials that look better with age. I heard the resort has not even been renovated once in 30 years - amazing. Having traveled to Bali many times, staying here is truly a special one of a kind experience and one of the best on the entire island.", "user": "stoty", "date": "February 24, 2013", "id": 152961240}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "My wife and I had visited this hotel on a number of occasions before we got married (Nov 2011) and loved it so much we chose it as our venue to get married. The hotel staff were all fantastic and they made the day and our entire stay fantastic and we could not fault them at all. We stayed in a garden lanai in the build up to our ceremony which was all arranged through the hotel with Studio 5 and upgraded to a pool villa on the day of our wedding!", "title": "Best service i have ever received.", "user": "lwdigby", "date": "February 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152758504}, {"rating": 5.0, "stay_parameters": "Stayed March 2008", "text": "This holiday took place over late March 2008 for 4 nights and was for two adults only in their late twenties.", "title": "The best choice in Seminyak", "helpfulness": 5, "user": "TravelBug79", "date": "March 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14632637, "likes": {"liked": "— The stunning gardens and very cute villa", "disliked": "— Villa 201 is noisy as it is close to the road"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We loved the Oberoi...............I could write a huge review but would only be repeating everything everyone else has already said!", "title": "Paradise", "helpfulness": 1, "user": "northern_rose34", "date": "June 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7839366, "likes": {"liked": "— It felt like we were in Bali - some hotels could be anywhere in the world!", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The only down side was that we felt breakfast in the hotel was expensive - we usually walked next door to Kudeta where the quality was as good for 1/4 the price.", "title": "A piece of paradise", "helpfulness": 4, "user": "philcarter", "date": "June 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7780425, "likes": {"liked": "— The beachfront location", "disliked": "— Business center"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We were spoilt for 11 nights - they even surprised us with a cake, card and flowers in our room for each of the celebrations we had while staying (anniversary and birthday)", "title": "Impressive in all ways", "helpfulness": 3, "user": "Purim", "date": "June 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7762935}, {"rating": 5.0, "title": "Greta hotel", "text": "We stayed at the Oberoi from Monday night to Friday night during the week after the U.S. Memorial Day holiday. It was absolutely outstanding in nearly every respect. The hotel staff was incredibly courteous and helpful, from the gentleman who picked us up at the airport to the concierge who arranged our departure. We loved our ocean-view lanai, which felt luxurious by U.S. standards and had an incredibly wonderful, peaceful, romantic feel to it. One tiny quibble was that the wifi/internet was expensive, and not that easy to use, but who really wants to surf the net when you're in Bali? The Oberoi pool and beachfront is fantastic -- the kind of place you can lie for hours (we did) and enjoy their drinks and food. The Oberoi sits on one of Bali's most fabled beaches, and it is quite spectacular. Definintely try to attend one of the dances or performances they put on -- they're well-done and fun. We also took advantage of the Oberoi Spa for a couple of treatments and a yoga class, and used the gym there as well. All were first-rate. We also booked a tour of Ubud through the hotel which wasn't that great; next time, we'll book our own cab and explore on our own. The restaurant was excellent too, especially the breakfasts and lunches, although don't forget to walk around Seminyak to try some of the other places. Bottom line -- you will have an unforgettable and luxurious vacation if you stay at the Oberoi.", "helpfulness": 6, "user": "petekendall", "date": "April 25, 2007", "id": 7431491}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We stayed at the Oberoi in Bali for 5 nights before heading up to Uma", "title": "Class and understatment", "helpfulness": 3, "user": "thombrug", "date": "April 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7346704}], "location": {"country": "Indonesia", "continent": "Asia", "city": "Seminyak"}, "stars": 5, "variance": {"poor": 12, "average": 36, "very good": 92, "terrible": 5, "excellent": 577}, "aka": "The Oberoi Bali Hotel", "slim_ranking": 0.0789473684211, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}