{"user_rating": 3.0, "review_count": 88, "name": "The Fairmount", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "this hotel would have gotten a full 4-5 stars for me, but when i booked the room they stated that the valet parking was free for bookings in the presidential suite (which i booked in part to take advantage of that amenity). when we were checking out, they refused to honor what the staff had said and i ended up being charged $84 extra for valet. it's really a shame when businesses refuse to honor these kinds of statements, implying that the customer fabricated it somehow. it ruined an otherwise wonderful trip.", "title": "poor business practices for an otherwise lovely hotel", "helpfulness": 3, "user": "kestrel k", "date": "November 9, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120390948}, {"rating": 1.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "The title says it all. I knew the Fairmount had a great reputation, having lived in San Antonio previously. We booked three rooms for a business stay. First, they lost our reservation, which wasn't an issue because they booked other rooms at the same rate. It was just the first of many disappointing surprises. While the hotel has loads of charm, it is in desperate need of renovation. The room smelled very musty. I stayed in a junior suite which was decorated with antiques. Paint on the walls was peeling, the vents were completely covered in dust and/or mold, the carpet was very worn and dirty. The tiny bathroom had a toilet seat that looked like it hadn't been switched out in years and the water pressure was terrible. The shampoo and soap provided by the hotel had a very flowery, 'grandmother' smell to them, which stuck with me all day. Yuck! The floors of the entire room were slanted, which can add to the charm, but in this case, it just added to the overall nastiness of the stay. My business associates and I noticed that upon checkout, no one really asked how the room was, or how our stay was...I'm sure they don't want to open that can of worms! This is a shame, because the Fairmount is charming and quaint. Hopefully, they can get it together and renovate at some point. Until then, avoid at all cost.", "title": "Musty, dusty and disgusting", "helpfulness": 4, "user": "BigBusiness2010", "date": "October 29, 2011", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 3.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 119879500}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "My friend and I went to San Antonio for a three-day girls' getaway weekend and stayed at the Fairmount. We both agreed we would happily stay there again. I will be returning in February and fully intend to make my reservations there. We were graciously allowed to check in two hours earlier than the stated 3:00 check in time. We had a double queen with a sitting area and a large bathroom. Our room overlooked the courtyard. The room was very comfortable and did not have the sterile feeling of some larger hotel chains. I have read other reviews and have seen a variety of experiences reported. I can only report our experience, and that is: our room was clean and smelled completely fresh for the entire three day stay. There were some stains on the carpet, but the carpet was light-colored, whereas most hotels have a darker carpet so you don't see stains. **If you go to the hotel website, you will see that this is a pet friendly hotel, so let that factor into your expectations. We very much enjoyed the historical building and the personal, small-hotel charm. That said, this is indeed a small hotel with a small staff. Most employees perform multiple duties. The person checking you in may also valet your car, and bring up your ice. If you are looking for a full service, uber efficient, multi-amenity hotel you might want to look at a more expensive hotel, of which there are plenty in this area from which to choose. If you are looking for a location with historical ambiance and a relaxed, low-key elegance, you'll enjoy the Fairmount. For our purposes, it was perfect. My friend and I are writers, so we enjoyed sitting in the courtyard with our laptops. We loved Luke the resident dog, and a special thanks to Abel the bellhop. As far as location, the hotel is right next to La Villita and the Riverwalk. If you want to avoid the Riverwalk restaurants, there is a trattoria in the hotel, a wonderful cantina a block away, with very reasonable prices, or you can go south on S. Alamo and find numerous wondeful Mexican restaurants that have been featured in Texas Monthly. The Alamo is a short distance away. We used our room coffee maker, but also made our way a few blocks over to a Starbucks several times. If you are looking for an ATM, there is one off the lobby of a neighboring hotel about one block south. Regarding parking, we used the valet parking, but there are a number of open lots very close by. We never felt that there was an expectation that we should use the hotel's valet services, it was presented as completely optional.", "title": "Wonderful Stay", "user": "TexWriter", "date": "October 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119449703}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The hotel advertises itself well and has an interesting history. We were sold, but having spent the previous week travelling from Los Angeles, staying at lots of hotels en route, this hotel was our first disappointment. The hotel is in desperate need of updating. It's clear no expense was spared when it was originally done, but it appears to have had no investment in it since. Our room was grubby, the bathroom was dirty, the carpet was filthy (I kept my shoes on) and there was an awful smell everywhere. It's clear the owner loves his dog, having put photographs and press cuttings etc of him on the walls - but a dog bed and dog food bowls in the reception area ?? Dare I say it, but not everyone loves dogs. The 'valet' parking was unnecessary - if they allowed guests to park their own car, it would save them and us a lot of time spent waiting around. This was also the only hotel I'd been in that charged you for a coffee in the reception area. Thankfully, there is a nice restaurant downstairs serving good food and the location is good with most things within walking distance.", "title": "Wish I'd done more research !", "helpfulness": 2, "user": "ahowe10", "date": "October 17, 2011", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 119407608}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We go to San Antonio twice a year as a quick get a way. Each time we try a new Hotel. We loved the location of The Fairmount and everythign about our room. We had a small patio on the second floor that looked out to the street, which was nice to just sit and relax after walking on the riverwalk. The A/C was the BEST we have every had in San Antonio. If you are looking for somethign different and has a little Character this is you plac.e", "title": "We loved the character of the Hotel", "user": "jkrowan", "date": "September 12, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 117999290}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Booked hotel for event, it was cancelled due to weather. We arrive and room not ready. We walk into room is smaller and no balcony as booked but only one available. Room is really stuffy a/c not working. Advise front desk clerk sounds lost on what to do but calls maintenance. we sight see for three hours to give chance for repairs. We return and have to wait a bit more. Finally get to settle in room. No frig, after paying $295 before tax, need to pay extra $25 if we want little frig. We were traveling with two kids so we paid. Horrible lighting used flaslight most of the evening. Room was still stuffy slept with door kept open with trash can. Hotel does not offer breakfast does have attached restaurant but already felt we overpaid for room didn't want to gamble anymore. Hotel was pretty, kind of outdated but pretty. Other than having a dog who lives in lobby who serves as mascot nothing special. Informed front desk of my unpleasant stay and was given a reluctant apology. Asked for manager clerk handed me business card. (Found out later she was a mgr, think assistant) Called number provided for 1 week straight, always got voicemail left messages. Never contacted me. I would not recommend this overpriced hotel. With our busy schedule, hard to get away and was very disappointed.", "title": "Disappointed and overpriced", "helpfulness": 2, "user": "deeherr", "date": "July 22, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 135029878}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "This hotel is a beautiful building great location, but desperately needs upkeep. We had a suite (350 a night) and upon checking in our bathroom was still dirty, the room was a pet room (which we had no pets) the carpets were very heavily stained and soiled. The wallpaper was peeling off the walls. The manager came in to change sheets and bring towels (all staff was very nice and tried their best). For some reason they do not keep housekeeping on staff all day (and it shows).", "title": "Beautiful building in deperate need of upkeep", "helpfulness": 1, "user": "austinames", "date": "February 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 124969537}, {"rating": 3.0, "stay_parameters": "Stayed August 2011", "text": "They upgraded us to Veranda Suite, after our designated room and every other room we looked at was infested with huge crickets. All the furniture was old, like going to grandma's house, ill fitting doors sunken cushions etc. Had to run water to dissipate rust. Nice robes, ok service, bed lumpy. Luke the mascot was charming.", "title": "Charming boutique, but everything is old.", "helpfulness": 1, "user": "Noclmt", "date": "January 27, 2012", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 5.0, "rooms": 2.0}, "id": 123702481}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "This is an old historical hotel. I came to the hotel with 2 friends and it was a very pleasant experience. A brief problem with the toilet flushing but soon corrected. Ordered wine and it was delivered within 30 minutes of our arrival and was on ice. Extra towels ordered and they were delivered within 30 minutes. The second night we ordered ice to our room and it never came.", "title": "Beautiful hotel", "user": "FortWorthNative", "date": "December 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 122206576}, {"rating": 1.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The rooms were clean, wonderful pillows. Robes are provided. When our car was ordered it was promptly brought in.", "title": "Will never return to this hotel", "helpfulness": 4, "user": "KMW663", "date": "November 19, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 120784777}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "All the mixed reviews on this site and others really had me worried. I got a great deal on a room via expedia and ultimately decided to keep it even though the reviews were scaring me a bit. I arrived late on a Monday evening - check-in took about 5 minutes - no problem with my reservation. The lobby is imaculate and the whole property, in general, looks like it was recently renovated. FYI - it appears the Fairmount mascot - a dog - has passed; I had been looking forward to that unique aspect of this property.", "title": "Really a 3.5; Better than all the mixed reviews suggest", "user": "PhillyCityGal", "date": "November 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 146180794}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "My room was on the second floor - streetside. San Antonio is pretty quiet after-hours, though I still had a bit of trouble getting to sleep because of a loud car/truck every once in a while. The room is spacious; reminded me of a room that would be in a rich grandparent's house. The room appeared recently renovated - new linens, curtains, everything but the carpet was new. The bathroom was \"spruced\" up, but definately was definately showing its age - great water pressure though and high quality shampoo/soap/etc.", "title": "I understand why the reviews are so mixed …", "helpfulness": 3, "user": "Tracy S", "date": "November 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 145925371}, {"rating": 2.0, "stay_parameters": "Stayed September 2012", "text": "I never saw another hotel guest while I was there for 3 nights/4 days - during the week; that concerned me a bit as a single female traveler. On the other hand, I never felt concerned for my safety at this property. There was always someone at the front desk - one of whom kept my key while I went for an early morning run. Another of whom called a cab for me and gave me directions to another hotel where I had a meeting.", "title": "Average", "helpfulness": 3, "user": "Brittfeeney2124", "date": "October 2, 2012", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 141869229}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "This hotel's location is execellent for getting onto the riverwalk - half a block from a set of riverwalk stairs. The restaurant at the property looked great - I never had the opportunity to enjoy it - and there is zero pressure to go there for breakfast.", "title": "Jewel of San Antonio - Slightly Faded", "helpfulness": 2, "user": "Bill M", "date": "September 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 140506061}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "I would come here again if I got a good deal and if I was on a business trip. It is close to the convention center and other hotels/meeting/conference places and near the Riverwalk.", "title": "old school style", "helpfulness": 2, "user": "Margaret B", "date": "August 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138161713}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "...but needs some work. This is a small, boutique hotel, so don't expect a big, fancy chain. We had a great room - the nautical theme room - but a lot of the hotel is beginning to show some wear and tear. It has an interesting history, having been picked up and moved several blocks to its current location. The staff was very helpful and friendly. The location is great - right across the street from the convention center and an easy walk to downtown.", "title": "Intersting history and great location...", "user": "SusanD55", "date": "May 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 161207391}, {"rating": 1.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "I read a lot of online reviews and made our reservation online. Unfortunately my room did not look like one from all the pretty pictures here. It was dirty with very dirty carpets, sheets and drapes. The toilet wouldn't flush and the door wouldn't close. I was very disappointing that I shelled out 200$ for a very very bad room. Beware of online bookings, they don't do returns.", "title": "Dirty Room", "helpfulness": 4, "user": "Jordana C", "date": "May 2, 2013", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 159472116}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Great location. Staff was great. The Hotel has a piano in the lobby that my kids were thrilled to play. The suite was spacious but had an old musty smell. We liked the historic old charm of the hotel but I have to say if we were to visit San Antonio again I wouldn't stay here until they freshen up the rooms with new carpet/wall paper/paint .", "title": "Looks charming smells musty.", "user": "Tripping123_11", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 157050884}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "This hotel was a real disappointment for our family trip. To be fair, I was expecting this to be a FairMONT (my husband booked it :)), so it was definitely a surprise when we checked in. The hotel is quite old and historic (it's even in the Guinness Book of World Records, which impressed my kids since we had just been to the Guinness Museum). Because I usually like old hotels with character, I really wanted to like this hotel. I did enjoy the quirky and mostly elegant common rooms where you could sit and have a drink or read a book.", "title": "Not what we expected", "user": "DawnM160", "date": "April 2, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 156335754}, {"rating": 3.0, "stay_parameters": "Stayed March 2013", "text": "Our room, however, was not great. The windows were small (understandable in an old building) but there was barely any lighting provided so at night it was almost impossible to read. The bathroom windows didn't open and there wasn't a fan so the bathroom got quite steamed up and was moldy around parts of the ceiling. In fact, the whole room smelled a bit musty (or like someone's grandma, as my tween daughter uncharitably described it). With better care and some thoughtful upgrading to wiring, lighting and bathrooms, this hotel could be a real gem. As is, it seemed to be sinking into inelegant disrepair.", "title": "Oh, I wanted to Love this Hotel...!", "helpfulness": 1, "user": "cdh713", "date": "March 20, 2013", "detail_rating": {"cleanliness": 1.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 155210461}], "location": {"country": "United States", "city": "San Antonio"}, "stars": 4, "variance": {"poor": 11, "average": 12, "very good": 17, "terrible": 22, "excellent": 26}, "aka": "The Fairmount Hotel San Antonio", "slim_ranking": 0.654178674352, "description": "Intimate, European-style hotel built in 1906 and located on San Antonio's River Walk."}