{"user_rating": 4.5, "review_count": 1219, "name": "The Kahala Hotel & Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "I always have loved this hotel, mostly because I love dolphins, however the service, room, and location has always been great. My bf's parents live in Oahu, they live in Hawaii Kai, so this hotel is close to driving distance to them. Plus I love the east side of Oahu.", "title": "Most the time I stay here when in Oahu", "helpfulness": 2, "user": "adogartnoe", "date": "June 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7779989}, {"rating": 5.0, "title": "Superior service, gorgeous property, excellent location, uncomfortable mattress", "text": "In reading some of the other reviews, it is true that the Kahala is a little \"dated\" but I think that can be said of most of the hotels on the island. Hawaii resorts all seem to be stuck in that 70's style era and we think it's cool in a retro kind of way. But the Kahala is in no way \"run down\" or dumpy. The style itself may not have changed in 30 years but this is DEFINITELY a 5 star hotel all the way. It's a gorgeous hotel with breathtaking views of the ocean (it is one of the few hotels that is actually right on the water, with its own private beach) and the service is outstanding. You are pampered from the moment you walk in and that's what we were looking for on this particular trip--to be spoiled rotten. If you are cheap then this is defintely not the place for you because it is expensive. Some great rates can be found on their rooms (starting at $295 for a garden room during the off-season, for example) but the food and amenities are going to cost you. But if you are looking to stay where the celebrities stay when they are in Oahu (we saw three very famous people out at the pool during our week-long stay) then it's worth the cost! To be fair, I should mention some cons in my review. Our only complaint really was with the room. Because it's humid here and also probably because it's on the water our room had a slight odor to it--like a musty-ness. I can't be sure if all the rooms smelled like this or not--perhaps it was just ours--but it wasn't overpowering or anything. But it was noticeable. Also, the mattresses are hard as a rock and lumpy. We did not sleep well at all and woke up with a back ache every morning, which for me was a real bummer because I'm six months pregnant and was so looking forward to a good-night's sleep on this trip. But alas, we did not let that spoil our fun! Regardless of a little lumpy mattress, the Kahala is without a doubt the only place we will ever stay if we return to Oahu again.", "helpfulness": 5, "user": "jems1304", "date": "June 2, 2007", "id": 7741104}, {"rating": 1.0, "title": "Five star prices, one star hotel", "text": "I went to this hotel in 1978, I've changed but the hotel hasn't changed at all, same carpet same furnishings, same everything. It is inconceivable to me that after thirty years the Kahala has not spent a dime to upgrade the facility. If you are looking for a time warp to the 70's, by all means book a trip. If not go someplace else.", "helpfulness": 9, "user": "busterboybay", "date": "May 28, 2007", "id": 7709939}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Some buildings that were built in the '60s and '70s can be updated with style - but they will always be easily recognized as structures from that era. The Kahala is a nice hotel and it looks to be recently refurbished. What the hotel lacks in modern architecture is made up for by having an excellent hotel staff.", "title": "Great staff, dated buildings", "helpfulness": 7, "user": "Matt2540", "date": "May 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 7615494, "likes": {"liked": "— Location and beach activities.", "disliked": "— Dated architecture."}}, {"rating": 5.0, "title": "The Kahala Hotel", "text": "I am still baffled as to why they would put the entryway and parking garage on the beach-side of the property which forces 80% of the ocean-view rooms and suites to look over this mess before seeing the ocean and beach. Somebody dropped the ball on that decision.", "helpfulness": 7, "user": "palmspringsdecorator", "date": "May 8, 2007", "id": 7565650}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "After spending many years visiting Hawaii and staying with my aunt in Hawaii Kai, my honeymoon was my first stay in a hotel, (other than Turtle Bay), in Oahu. It was a lovely experience, beautiful beach, nice room - with comfy king size bed and gorgeous view over the golf course. Plus we were upgraded on arrival due to it being our honeymoon - and knowing our travel agent had connections there!! I was apprehensive about the hotel due to many 'bad reviews' on trip advisor, but i knew the Kahala was set in a gorgeous area and on its own private beach. My fiancee chose the Kahala after learning we could swim with dolphins there..", "title": "Lovely Honeymoon, but intimidating..", "helpfulness": 4, "user": "MPAussie", "date": "May 7, 2007", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7553914, "likes": {"liked": "— Dolphin Experience", "disliked": "— Expensive extras"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Overall, we loved the hotel - especially the dolphins and the experience of swimming with them - but felt quite intimidated by the restaurant prices, price of hiring equipment, internet etc.... We were treated to our honeymoon accomodation at the Kahala as a gift from family, and felt deserving of the experience, but sometimes felt like we were out of our league due to intimidating prices and patrons. We were thankful to have our car in which we could drive to local restaurants, the Kalaha Mall, and even up to Koko Marina in Hawaii Kai...", "title": "Kahala one of my favorites now!", "helpfulness": 7, "user": "MelissaMcCoy", "date": "May 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7541252, "likes": {"liked": "— The location, close to but away from Waikiki"}}, {"rating": 5.0, "title": "Wonderful Birthday", "text": "I also struggled to make it to the lobby by 8:30am for my free cup of tea or coffee! The lack of coffee/tea making facilities in our room was disappointing.", "helpfulness": 3, "user": "sylis", "date": "May 1, 2007", "id": 7491871}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "All in all we loved our time at the Kahala, and would recommend it.. But as a relaxed, young Aussie couple not wanting to spend hundred's of $$$$$$$$ each day, maybe only spend a night or two here before moving onto another island or resort.. We headed to Turtle Bay and relaxed completely once there...", "title": "Better when it was a Mandarin Oriental", "helpfulness": 11, "user": "jycnyc", "date": "April 12, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 7341812}, {"rating": 1.0, "title": "Lawn Mowers at 5 a.m.", "text": "We recently stayed at the Kahala Resort & Spa in an oceanview room with balcony in the Koko Head wing. It was a romantic weekend getaway and far exceeded our hopes and desires. The room was spacious, gorgeous 4 poster style bed with soft material draped over (delicious sheets/pillows/duvet) , lovely bathroom (the most comfortable hotel bathrobes on the planet) and a view to die for. What we loved most especially was that there were no other hotels in the area, the beach was soft sand and easy to walk on, the barrier reef just off shore created a calm lagoon good for snorkeling AND there were enough palm trees around that the soft sound of the wind rustling in the fronds created a sense of tropical calm. The food and service were outstanding and the general feel of the hotel was of casual elegance with a true sense of Hawaiiana. The staff acknowledged you by name (how do they remember everyone?).", "helpfulness": 6, "user": "David_Spee", "date": "April 9, 2007", "id": 7301041}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "My husband and I definitely needed a luxurious and relaxing vacation getaway and the Kahala Resort delivered way beyond our expectations.", "title": "Wonderful Hawaiian spirit", "helpfulness": 6, "user": "nvnorm", "date": "July 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8065498, "likes": {"liked": "— The Kahala Resort is a beautiful traditional Hawaiian hotel. Elegant and relaxing.", "disliked": "— Nothing. I did not want to leave."}}, {"rating": 5.0, "title": "Loved the Kahala", "text": "We loved the traditional elegance of the hotel and the welcoming and friendly attitude of the staff. Truly, we so enjoyed hanging out on the property, especially down at the beach, we never felt a need to leave the resort.", "helpfulness": 3, "user": "champ27", "date": "July 3, 2007", "id": 8050721}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The beach was outstanding, the oceanfront restaurant was top-notch, and the spa was fabulous.", "title": "Loved IT!!!!", "helpfulness": 3, "user": "HIgirl", "date": "June 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7927458}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "If you need a great, pampering getaway with everything in one location and without the hassles of a huge, over-populated time-share complex, this is definitely the place to come in Hawaii.", "title": "Great Wedding Location", "helpfulness": 2, "user": "ctucker33", "date": "June 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 7853465, "likes": {"liked": "— The staff", "disliked": "— The price :)"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We loved it so much, we have already booked out trip for next May!", "title": "beautiful resort & wonderful staff", "user": "travelgirlmedeiros", "date": "June 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7780668, "likes": {"liked": "— The Beds", "disliked": "— No coffemaker"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "I stayed here for my two nights on Oahu as a part of my honeymoon. Everything was top-notch. We were upgraded upon arrival to a top-floor suite. The room clearly was a bit older, but still very nice, and very classy. Service was impeccable, grounds are beautiful. I highly recommend. I believe they're in the process of updating the hotel.", "title": "Kahala offers top notch everything", "helpfulness": 1, "user": "Jacks1019", "date": "April 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 7289678, "likes": {"liked": "— Incredible service and beautiful everything", "disliked": "— not applicable"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Stayed from March 26-28 and it was fabulous. Upgraded from a courtyard view with no balcony to a mtn view with a lanai and a view of KoKo Head. Treated very well here, and dinner at Hoku's is a must! Spa was out of this world as well. Found on their website a spring internet special promo offering room and full breakfast for $295.. try to book it soon. The hotel is currently doing 3 floors of renovaton. Our room was very nice and clean, but it does need a decor upgrading.", "title": "Great Getaway for a couple of days!", "helpfulness": 3, "user": "CCCSF", "date": "April 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7264926}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "I can't begin to describe how wonderful of a stay my family and I had over Presiden't Day week. From check-in to check-out, we were treated to the best possible service and the accomodations were beyond expectation. We booked the trip late 2006 and decided to go with the standard garden room. Upon arrival and after mention of the celebration of a birthday, we were instantly upgraded to an oceanfront lanai room! Imagine my surprise when after being in the room for less than 10 minutes, a special birthday cake was sent over especially for me. My 5 year old daughter adored the property. From the fun-filled Keiki Club to the DolphinQuest swim to the awesome pool and beach - she was definitely happy! My husband and I spent many leisure days by the beach and/or pool. The environment was very relaxing and calm - a huge difference from our last stau at the Outrigger on the Beach. It felt very private and secluded. There was always an attendant to help us set-up our chairs and towels and the pool-side serice was quick and efficient. Employees referred to us by our names by the 3rd day. The concierge was wonderful. She assisted my husband in planning an unforgettable birthday celebration. Breakfast at Plumeria's was an awesome way to start each day. The buffet had a great selection and the service was friendly and prompt. Dinner at Hoku's was exceptional. The seafood tower is a must! Excellent presentation! I realy enjoyed the Veranda's Lounge in the evening - listening to the piano play - who had an amazing voice. The only disadvatage is that since you are away from Waikiki, it is tough to grab a few snacks and a cheap drink - as there are no ABC stores in the area. Otherwise, I would rate our vacation to the Kahala an A++ and are looking forward to our rip back in December.", "title": "Can't wait to go back!", "helpfulness": 6, "user": "jdilla", "date": "March 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6925470, "likes": {"liked": "— Hotel grounds", "disliked": "— Convenience of walking around Waikiki"}}, {"rating": 1.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "The Hotel has not one redeeming Quality except for the location!", "title": "Hotel has become a Motel 6 with FOUR SEASON PRICES", "helpfulness": 16, "user": "roomsafe", "date": "March 5, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 6917340, "likes": {"liked": "— Location", "disliked": "— Management, food, staff, cleanliness SECURITY"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "Under new ownership returning guests don't want to return! We will return when they sell the hotel to someone else.The people who bought it knew how to ruin a hotel in less than a year. Every restaurant, every service was a disaster. Bad!", "title": "Best option close to honolulu", "helpfulness": 7, "user": "matupatu", "date": "March 1, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6898952, "likes": {"liked": "— location and very fast valet parking", "disliked": "— few people at front desk"}}], "location": {"country": "United States"}, "stars": 5, "variance": {"poor": 45, "average": 91, "very good": 233, "terrible": 41, "excellent": 809}, "aka": "The Kahala Hotel Honolulu", "slim_ranking": 0.10843373494, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "The Kahala Hotel & Resort is Hawaii's reigning luxury resort, set on a secluded beach just ten minutes from the world class shopping and entertainment of Waikiki. This legendary hideaway resort in Honolulu's plush Kahala district is a favorite with presidents, international royalty and celebrities. From the moment you arrive, you will know that you are truly somewhere special."}