{"user_rating": 4.0, "review_count": 165, "name": "The Old Court Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We have stayed in this hotel now 3 times, once in 2008, then in 2010 and lastly in 2012. From our first visit in 2008, we were upgraded and given a bottle of wine as it was our first stay. We felt like the staff genuinely were friendly and cared. We had dinner in the dining room and the food was gorgeous, as was the atmosphere- was a bit pricey but worth it for a special occassion. We found our upgraded room nice and comfy, clean and pleasant.", "title": "Used to be fabulous, now not as good", "helpfulness": 1, "user": "kezbarz", "date": "January 6, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 149011817}, {"rating": 1.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "In 2010 we stayed again because we'd been so impressed the first time. Our room was a standard, not as nice as the upgraded room but that was to be expected. Again the staff were nice and the breakfast was very nice. We enjoyed our stay, but not as nice as the first experience.", "title": "Do not stay hrere!!!", "helpfulness": 1, "user": "SamW237", "date": "November 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 146087244}, {"rating": 3.0, "stay_parameters": "Stayed November 2012", "text": "In 2012 we returned, this time with our dog in tow, which we had to pay an extra £10 a night for. Our room, a standard, was OK, a bit old fashioned. The staff weren't half as friendly as the first time, but were alright. We had dinner in the dining room, it was not as good as the first time and I can only imagine they have changed their chef in this time. I didn't feel this time that it justified the price. Our server was pleasant and the girl serving the bar after was nice. Breakfast was nice.", "title": "Relaxed", "user": "Canadianlil", "date": "November 11, 2012", "detail_rating": {"cleanliness": 4.0, "location": 5.0}, "id": 145155754}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The area is nice and has good links to Ross-On-Wye and the various walks.", "title": "Fantastic hotel.", "user": "Sydney F", "date": "November 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144910022}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "I just feel that the place is lacking what it used to have back in 2008, I don't know what it is, but back then it felt like you arrived and were looked after, this year, I just felt like a number.", "title": "Not the easiest hotel to find.", "user": "Ashlee K", "date": "November 7, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 144851873}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "I booked this hotel the night before I stayed there. It was a last minute booking for a business trip. I stayed one night only.", "title": "A real hidden gem.", "user": "Match A", "date": "January 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 151038573}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Where do I start?", "title": "Great food and drink and very friendly staff", "user": "WyeCanoes", "date": "January 24, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 150480139}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Considering I booked my room the night before at very short notice, value for money was excellent. Breakfast was included in the deal. All of the staff are very friendly and nothing seems too much for them which really makes a nice change.", "title": "I love the old court and we keep coming back", "helpfulness": 1, "user": "Nicole B", "date": "January 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149607100}, {"rating": 4.0, "stay_parameters": "Stayed December 2012", "text": "My room was clean and had everything I needed - tea making facilities being one of the most important! Toiletries are provided and the room was well heated (not too cold). The bed was comfortable and the hotel was quiet in my rooms vicinity.", "title": "The hotel you tell your friends about and want to return to", "user": "Hepsebar", "date": "January 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 149533650}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "There are two restaraunts, an a la carte and a bar menu is available to the tired traveller. I chose to have a bar meal from a very extensive and well priced menu. I did not look at the a la carte menu. My Beer battered cod and chips was served quickly and was nice and warm. The servings were good and very tasty. Try the the real ales if you get the opportunity I had a lovely pint of BOB I think! The breakfast was superb in every single element. I had the full english of course!", "title": "A great weekend away", "user": "Peter H", "date": "January 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 149111648}, {"rating": 2.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We popped across the road from the Wye Valley Butterfly Zoo for some lunch, and after opening the huge door and peering inside, had some good expectations set about what lunch would be like. The pub is great, lots and lots of old world charm and history. Browsing the menu, I thought it seemed a little pricey, especially as we were just after a light lunch. However, it is also a hotel and weddding venue, so I could understand why we might need to pay a little more. We both ordered the steak sandwich which came at a pricey £7.95. I opted for it as a panini and my husband had it as a regular sandwich. He had no issues with his at all, but mine was really disappointing. The meat was fatty and gristly in places. I ended up having to remove all of the slices of steaks and trimming off the inedible bits before rebuilding my panini. At almost £8, which in other pubs would buy you a filling full size lunch, I expected more. I didn't complain as compared to the other sandwich, it seemed like I had just been unlucky, but I still felt disappointed. I hope that if you were eating here for a special occasion, the standards would be less hit and miss.", "title": "Beautiful pub but disappointing food", "helpfulness": 1, "user": "katherinious", "date": "March 20, 2013", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "service": 4.0}, "id": 155196040}, {"rating": 3.0, "stay_parameters": "Stayed February 2013", "text": "Popped in here for a little bite to eat and a drink while visiting the area, thought was very overprice, the panini in the bar was £7.50 and came with no extra, had a ham and cheese one and was disgusting! One slice of ham if that and cheese very poor, the chessy chips were very nice but over priced for the amount we got, would not recommend...", "title": "Not good..", "helpfulness": 1, "user": "Toyah1", "date": "March 18, 2013", "detail_rating": {"cleanliness": 3.0, "location": 4.0}, "id": 154955366}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "I'm not often moved enough to write reviews, but we had such a great stay at the Old Court that I wanted to give them due praise. Like other people have written the service was friendly, faultless, and we had an incredibly relaxed time. We had taken our dog with us, by prior arrangement, and we were moved to one of the self catering apartments in the barn so that she had access to garden space and we didn't have to negotiate stairs etc.", "title": "Excellent hotel", "user": "NickNocks", "date": "March 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 154933192}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The apartment was exceedingly well equipped and whilst we ate in the hotel, it would have been extremely easy to stay in this room for a week and be able to look after ourselves. The food in the hotel was excellent and there was a really good wine list.", "title": "Olde world charm", "user": "littlemissred41", "date": "March 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 154285676}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Over and above, the log burner in the apartment made it so cosy, and the staff printed out details of a fab walk all along the river with the experience of the hand ferry across from the Saracens Head.", "title": "Lovely stay at the Old Court", "user": "Madrongirl", "date": "March 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 154259044}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The moment we walked in we realised how friendly the staff were,this continued for the whole weekend be it the bar staff, reception, or the restaurant. The food was great, in the restaurant my wife had roast shoulder of lamb and I do mean a whole shoulder, which she could'nt finish. I had slow roast belly pork stuffed with apple and herbs, to be recommended. We also had bar meals on 3 occasions duck wraps as a snack and full meals of fish and chips and scampy and chips.", "title": "excellent weekend break", "user": "Peter W", "date": "March 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153937406}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We could not fault our standard room although we would upgrade next time at a very reasonable cost. We were impressed by having a cafetiere in the room not just instant coffee.", "title": "Old court hotel", "user": "amelia022", "date": "March 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 153536872}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "The Old Court is in a lovely position, we took advantage of this with a walk along the river Wye. Ross on Wye is only a few miles away.There are many other things tro do and places to visit so we'll be back", "title": "A bit of a mixture", "user": "Samiel79", "date": "February 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 153361737}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Just stayed for two nights on a leisure break with my husband. A lovely old hotel set in a rural location. The staff were very efficient and friendly, nothing was too much trouble. Rooms were clean and quiet. Food was lovely although perhaps a little over priced. The menu for the restaurant looked very appetising although we didn't eat there. Bar food was good and lots of choice. We would definitely recommend a visit and wouldn't hesitate to go back.", "title": "Beautiful accomodation, beautiful countryside on the border with Wales", "user": "Georgeann E", "date": "February 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 153033539}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled solo", "text": "We stayed here a few weeks ago. There seems to be an old and then a new bit. We stayed in the new bit. The room was ok, bit small (a double) and the bathroom was a little run down. But it was clean and the matress was divine. The room was really hot though and had to scrabble with the storage heater to turn it off at 2am and then there was no heating at all in the bathroom which was freezing.The staff were amazing though and were so welcoming and accomodating. The breakfast was a little dissapointing, had to send mine back as it was stone cold. If I was to return I would ask to stay in the older part of the building.", "title": "A well established and bomb proof country inn", "user": "treecutter", "date": "February 8, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 151646968}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 10, "average": 23, "very good": 42, "terrible": 4, "excellent": 86}, "aka": "Old Court Hotel", "slim_ranking": 0.545454545455}