{"user_rating": 4.0, "review_count": 415, "name": "The Lord Nelson Hotel & Suites", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "It's a very nice hotel, seems to have been recently renovated. Beds are very comfortable, love the bathroom amenities (Aveda). Free inroom wifi. Staff are generally friendly. And location is superb, very close to downtown, and facing a large park. One drawback is that the hotel does not have a gym, so guest needs to call front desk first, and they will let the local Y know you are going to their gym facilities (lots of treadmill and bikes, but lacking weight equipment), which is 2 buildings down the street. Makes it quite inconvenient, especially winter time. Other than that, I have nothing to complain about this property.", "title": "Very satisfactory stay, but no gym", "user": "AKLVancouver_Canada_", "date": "March 2, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 57497050}, {"rating": 1.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "I have stayed in many high end hotels and this was by far the worst. Staff were rude to not only myself and my business colleagues but to another business group we met while there. Rooms definately leave something to be desired. Our rooms were very dated and dusty. The bed was comfortable and the location was ok but that was about it. On our first night it was -12 outside and we had NO HEAT and not one employee would help us. I had to flag down a maintenance man in the hall the next morning! With the lovely choices available in downtown Halifax I would advise all to spend their money at ANY other option but this one!", "title": "Worst hotel I have ever stayed in", "helpfulness": 2, "user": "stefany82", "date": "February 16, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 56120918}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We don't find it necessary to stay overnight in Halifax too often .", "title": "Elegant and stately with a superb staff.", "user": "WarrenJLunenburg", "date": "January 30, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54760121}, {"rating": 1.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "When we do, The Lord Nelson is our first choice. This time we were upgraded ( once previously too ), and treated like long lost relatives. The location and proximity to shops, cultural activities, fine dining and the world-famous and ever beautiful Public Gardens is a welcome bonus. The best in its class. ( Warren Jollimore, Lunenburg, N.S. )", "title": "Nice until something goes wrong.", "helpfulness": 1, "user": "Flyonyourwall", "date": "January 28, 2010", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 2.0}, "id": 54615695}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "The hotel is fine, the staff are friendly, the rooms are comfortable and clean.", "title": "Not A Bad Alternative..............", "helpfulness": 1, "user": "martythemonkey", "date": "January 25, 2010", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 54343213}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "If you are visiting Halifax for business or leisure, and don't have a need to be right on the water, stay at the Lord Nelson. It is a beautiful, stately hotel that has endured the test of time (obviously with some careful restoration). The rooms are very nice (though the pull out sofa in my suite needed replacement) and the bathrooms are very spacious and well stocked. The staff were very friendly and accommodating, and were happy to arrange restaurant and limo reservations (ask fro John, the limo driver - what a great guy!). The hotel is right across from the Public Gardens in Halifax. and even though it was late November, the weather was sunny and warm and the gardens were still open - a beautiful place for a relaxing stroll. I will definitely return to the Lord Nelson at the first opportunity.", "title": "Enjoyed The Lord Nelson", "user": "OttawaNYFan", "date": "December 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 52028129}, {"rating": 5.0, "title": "TRUE TO ITS NAME...", "text": "I was invited to dalhousie university to participate in the post \"world fisheries congress\" meeting and a workshop. The organizers sent me couple of options for the stay and i chose the lord nelson hotel. Although the meeting and workshop took up most of my five days stay at the hotel, whatever time i have had at the hotel was very memorable. Rooms were elegant and detailed to the need of the guests. Apart from the comfort they offer, courtesy of the staff is the best so far among all my hotel stays across canada. Complimentary breakfast itself is a treat with a huge selection of fruits and six fresh juices to chose from, an array of cheese, different kinds of bread and fresh brewed coffee and three kinds of pastries.", "user": "Magus4", "date": "December 9, 2009", "id": 50592818}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Gym, pool and other facilities are excellent and most of all, the hotel is located right in the centre of the city, an absolute advantage.", "title": "Great Hotel", "user": "5Queen5", "date": "November 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49856425}, {"rating": 5.0, "title": "Great Room", "text": "We stayed at the hotel for our anniversary. Enjoyed our time at the hotel. The room", "user": "Seeka84", "date": "October 18, 2009", "id": 47192367}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "was great, bed was comfortable, new bedding. Bathroom is a littel small but well", "title": "A Good Option", "user": "Trav1964", "date": "October 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 46190409}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Very satisfied with the location and accommodations with this hotel", "title": "Wonderful hotel", "user": "roxy1031", "date": "October 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 46137347}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "We all enjoyed our stay in this very well maintained character hotel in a perfect location. Service was very good and friendly. We'd definately recommend and stay again.", "title": "Very good hotel for this price range", "user": "LittleMissRhythm", "date": "September 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 43799161}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "I loved this hotel!", "title": "This Hotel has Location, Location, Location!", "user": "LeaHB333", "date": "September 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 42851901}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We were across the street from Public Garden (it's beautiful) and within three blocks of The Bengal Lancer Horses ( a passion of mine) world class shopping (were talking Valentino, Elie Tahari, and Hugo Boss just to name a few), and Fine Dining for every imaginable taste.", "title": "Great location but disappointed overall.", "user": "Superfrog94", "date": "September 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 2.0}, "id": 42487301}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The hotel staff was both incredibly friendly and efficient, which always makes for a better stay. My room was really well appointed and the Aveda products were wonderful. Even though the hotel was fully booked, or appeared to be anyway, I was always well taken care of, and felt my room to be private and quiet.", "title": "Enjoyed our stay at Lord Nelson", "user": "cruiser2b", "date": "September 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 40473052}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "My boyfriend and I were passing through Halifax while moving me to Cape Breton, and we stayed at the Lord Nelson for one night. It was a bit expensive ($183 incl tax for the room, parking and breakfast), but it's a local business and is in a good location, so we thought we'd splurge after camping. The room was a bit small after experiencing the bigger hotel chains, but it was all we needed. The place was clean, with Aveda products in the bathroom. There was no fridge in the room, so we hunted down an ice machine to chill the wine we had picked up in New Brunswick.", "title": "Nice place", "user": "aryka11", "date": "August 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 38627922}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled solo", "text": "I'd heard that there are some noise issues from various reviews, so I requested a quieter room. We were assigned a room on the top floor (9th) facing the street and public gardens - there was some traffic noise, but nothing bothersome. They don't appear to have AC in the lobby or hallways, so it was a bit sticky given the heat wave at the time, but the units in the rooms were quite effective and drowned out any residual street noise.", "title": "Great Stay at Amazing Hotel In Halifax", "user": "teeber1964", "date": "August 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38295091}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Downtown was a 7-minute walk downhill, with most major banks and some useful stores along the way - Running Room, Shopper's Drug Mart, Subway, McDonald's, Booster Juice, an Aveda salon and some pubs/clothing shops. Citadel Hill is just around the corner, on the other side of the public gardens.", "title": "Superb location, wonderful staff, fabulous room", "user": "mama_in_vegas", "date": "August 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38203087}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled solo", "text": "The continental breakfast was standard fare, if a little fancier - various-grained baguettes, fresh-cut fruits, individual jam jars (from California for some reason), deli ham, a variety of cheeses including some I'd never heard of, cereals and yogurts. Underground parking was spacious and easily accessible. The staff was friendly and courteous. I'd come back, when I have a steadier job!", "title": "Amazing Customer Service", "user": "kayakattack23", "date": "August 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 38195438}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "I had to write in and tell you about an amazing hotel I experienced last month in Halifax . I went to school in Halifax years ago and remembered staying at the Lord Nelson back then. Wow what a change . The whole hotel has been transformed and it is in such a great location. Paul McCartney had just stayed in their presidential suite so the buzz was still in the air. I just had to write in because I usually stay at a chain hotel that I find on line and because of points but had never thought of staying at the Lord Nelson. I am really glad I did. It reminds me of The Royal York in Toronto.", "title": "Lovely Hotel", "user": "Odot_Lady", "date": "August 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 37285915}], "location": {"country": "Canada"}, "stars": 3.5, "variance": {"poor": 27, "average": 55, "very good": 166, "terrible": 19, "excellent": 148}, "aka": "The Lord Nelson Hotel Halifax", "slim_ranking": 0.576923076923, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Originally built in October 1928, the Lord Nelson Hotel is a legendary landmark in downtown Halifax located at the corner of Spring Garden Road and South Park Street across from the beautiful Public Gardens."}