{"user_rating": 4.5, "review_count": 837, "name": "The Pfister Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2012", "text": "Stayed for two nights with family members attending a wedding held at the Fister. I'm a Milwaukee residence and avoids been proud of the Fister. However, something has taken place which is causing the Pfister to slip both an appearance and service. Andrew not prepared on time. The carpeting looked matted and worn. The bed was uncomfortable and was tilted forward to make me feel I was sleeping on a bouncy incline. I didn't think the room was worth what we paid nor does it compare with the many hotels I have stayed in over the last couple of years. I am a frequent travelers have experienced many different levels and brands of hotel. Said to say the Pfister is definitely not what it once was. there are certainly better values in Milwaukee. On a positive note we loved meeting in the lobby every morning for coffee and enjoying the comfort of the lobby. However, I do not understand being served coffee and a paper cup at a high-end allegedly five-star hotel.", "title": "The once proud icon in Milwaukee is slipping", "user": "maltafaz", "date": "July 21, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 134989501}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We stayed at a different hotel but walked to the Pfister lobby bar to start each day with their world famous Bloody Mary's! They are expensive, but worth it! They serve them with a meal on top...shrimp, cheese, pepperoni, celery, olives, etc.", "title": "Best Bloody Mary's in Milwaukee", "user": "Dori M", "date": "July 11, 2012", "detail_rating": {"value": 4.0, "location": 5.0, "service": 5.0}, "id": 134100950}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Also, the lobby bar is a great place to people watch! We were in town for Summerfest and it was great seeing Aerosmith and other band members in the lobby!", "title": "Too expensive for what you get.", "helpfulness": 1, "user": "fellowtravelerIowa", "date": "July 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 133999859}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Either stay here or visit the lobby bar whenever you are in Milwaukee!", "title": "Nice cheese fondue, with a view", "user": "Simone C", "date": "July 9, 2012", "detail_rating": {"value": 4.0, "location": 4.0, "service": 4.0}, "id": 133923390}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "We stayed at the Pfister Hotel in Milwaukee from July 4 - July 8. We had a king bed in the tower portion of the hotel. Our room had a nice view of the city and the hotel lobby was amazingly beautiful, but let's face it - the lobby is not where you spend most of your time. Our room had old carpeting that had not been cleaned in awhile - dirt and fingernail clippings on the carpets (gross!). The window in the room is a large bay window however the ceiling above the window was crumbling down on to the bay window seating area. There is no mini fridge in the room, which would have been nice since the temperatures outside were in the 100's for most of our stay. The bed had a pillow top that was wearing out because all of the stuffing was relocated to the foot of the bed causing you to sleep at a slant with your head slightly lower. The bathrooms are small but the granite was pretty. Overall, for the kind of money we were paying ($200+/night) I would recommend staying somewhere else. Not as impressive as what I had expected from previous reviews.", "title": "The Pfister is a Great Place to Stay in Milwaukee", "user": "EthelYork_PA", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 133879575}, {"rating": 4.0, "stay_parameters": "Stayed August 2012", "text": "We spent two nights at the Pfister and were very pleased with everything except the breakfast service at the cafe, which was ok until our server had to be asked twice about my hudbands beverage and wasnt brought to him until he was close to finishing his food. Our room was very clean and spacious. The turndown service was a nice perk at the end of the day.", "title": "Delightful stay!", "helpfulness": 1, "user": "N0nni", "date": "August 8, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 136580979}, {"rating": 1.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "The Pfister is old. The \"new\" tower is better than the old section. The one good thing about the Pfister as compared to all other hotels in MILW is the gym. It's clean and new. Equipment is well maintained.", "title": "Pfister...old Milwaukee (and not in the charming way)", "helpfulness": 2, "user": "Matt K", "date": "August 8, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 136572855}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "The service was great and I felt well attended to. Check in and check out was quick and easy. The lobby was very nice, but had a faint odd smell similar to stale cigarette smoke.", "title": "In need of updating, service was above average", "helpfulness": 1, "user": "acswift", "date": "August 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 136230627}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "I stayed for two nights in room 1716, a standard room with two double beds. The first thing I noticed upon entering the room is that the carpet was terribly warn in high traffic areas. The furniture and bedding were all in decent condition, and the bathroom was much larger than those in similarly classed hotels that I have stayed at (though this is my first stay in the Milwaukee area). There were no obvious electrical outlets at the desk, and the two accessible outlets were next to the beds, making it difficult to plug in electronic devices or use the iron and ironing board.", "title": "Beautiful and romantic", "helpfulness": 1, "user": "Rochelle78", "date": "August 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 136103916}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "I had requested a down-free room in advance due to a feather allergy but somehow one feather pillow remained. There were plenty of poly pillows so I just tossed that one aside and didn't use it. The iron had a bent prong and went from not working at all to getting too hot, which they replaced for me.", "title": "Give the spa a try!", "helpfulness": 2, "user": "jbewje", "date": "August 2, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 136092280}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "My husband and I stayed here while in Milwaukee for a wedding. It is a lovely hotel with good service. Our room was clean and comfortable. I loved the high ceilings. Our bathroom was very clean and had excellent water pressure. We ordered room service for breakfast. It was perfect every time. We enjoyed cocktails in the bar on the top floor. The staff was friendly and helpful.", "title": "Great Stay in Milwaukee", "helpfulness": 1, "user": "LizzChicago", "date": "August 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 138414208}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Beautiful hotel. Location is just outside the centre. A lot of the area to the west and south not that attractive though. We had booked a suite, which was very tastefully done up in two rooms. Very comfortable beds and big TV. We had an apperatif AND digestif in the BLU, a bar at the 22nd floor. Very nicely done, good view (although mostly of a freeway and parking lots). As everywhere in the US, too cold though. We ate in the Mason Grill. Despite having booked, they did not have our reservation, but there was space anyway. Very good atmosphere, and quite a buzz. Excellent service and a great meal.", "title": "Beautiful hotel, great room and restaurant. OK location.", "helpfulness": 2, "user": "vanturnhout", "date": "August 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 138262440}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "I was in town for business and luckily this is where the company put us up. This is a beautiful building down town. It is near the lake and has a great view from the blu bar on the 23rd floor. The lobby is a creams old lobby and the staff is very attentive. Five downtown Milwaukee a try in this gem.", "title": "Historic Gem", "helpfulness": 1, "user": "SheriBobLove2Travel", "date": "August 24, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 138195178}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "This is our 2nd year staying at the Pfister for Irish Fest but it won't be the last. Everyone is treated like royalty. The room rates may be higher than some other hotels but it is worth every cent. This hotel is within walking distance of the festival grounds but if you don't want to walk there are shuttle buses that run continually. We have stayed in the older section of the hotel both times and we all loved it. The food at the hotel cafe was very good and reasonable. Can't wait until next year!", "title": "We'll Definitely be Back!", "helpfulness": 2, "user": "dalady", "date": "August 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137927451}, {"rating": 4.0, "stay_parameters": "Stayed August 2012", "text": "Coming into the hotel, one cannot help but be impressed by the gorgeous lobby. Absolutely stunning! The reception is quick and friendly. There are 2 different parts of the hotel. The older side and the newer side. The older side is accessible by it's own elevator, and gives the guest the feeling you might be staying at a more special type of room...not so much. Rooms are pretty regular, and aren't worth paying additional dollars for. The hotel does have a nice location. It is convenient to many nice restaraunts and a short cab reuse to most downtown locations. The downside is knowing where to request a room. I'd you'd like to have an undisturbed and bit of sleep in, request room facing away from where garbage gets picked up. I believe it was between 7-8am. Fine if you have business meetings and have to be up early, not great if looking forward to a little more rest. The food in lobby restaurant in morning is ok, but service can be a bit slow. There is a pretty lounge on top of building, Blue, which serves this, Blue, as a signature cocktail. Fun spot, and request some cashews, yummy snack and free. The downside of this place is it's fairly small and if you sit near musicians or piano player, hard to have a conversation. The hotel has many amenities and history. It is a nice spot to stay in Milwaukee, but pretty pricey. I enjoyed our stay, but might try another hotel next time, just to see what else Milwaukee has to offer in terms of sleeping accommodations.", "title": "Living up to the hype", "helpfulness": 2, "user": "Tadr1", "date": "August 14, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 137178268}, {"rating": 5.0, "title": "Is there a word for \"better than perfect\"?", "text": "We chose the Pfister as our wedding night hotel and will NEVER regret it. It was everything we hoped it would be. From our pre-stay communication to our check-out, we were overwhelmed by how kindly we were greeted and treated.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "August 2, 2012", "id": 136057965}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The suite we were assigned was extremely elegant, yet comfortable and inviting. The bathroom was amazing...huge walk in shower, spectacular jetted tub, and enough space for two to get ready. The walk in closet had comfy robes waiting for us. The fridge kept our beverages cool and the distant view of Lake Michigan was delightful.", "title": "Getting noisier with each visit", "helpfulness": 1, "user": "mjhill1004", "date": "August 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 136002495}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "We also enjoyed just meandering through the hotel itself, marveling at the artwork and people watching in the incredible lobby (the Miami Marlins were also guests that evening). It's also just a few blocks to the Riverwalk...a lovely place for a morning or evening stroll.", "title": "Great for all Ages!", "helpfulness": 1, "user": "MikeMMonte", "date": "July 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135448931}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "The only regret is that we didn't book a longer stay. Make no mistake...this is THE place to stay if you are looking for a truly memorable experience.", "title": "No Better Place to Stay when in Milwaukee", "helpfulness": 2, "user": "mock_my_beans", "date": "July 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135390719}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We live close to Milwaukee and stay at the Pfister quite a bit. We like to stay in the historic section and last time we had requested that if there was a suite available at check-in, that we would like it. I believe it's like a $25.00 fee. Worth it as the suites seem to have been refurbished. The room was clean but we had a slow draining tub and sink this time. We only stayed two nights so it didn't seem worth it to complain. Bathroom sizes seem to be the same in both the suites and the regular rooms. Nice to have a separate TV and couch area. The one negative thing we keep encountering here is the noise level both in the hallways and out on the street. We have stayed both on the weekends and mid-week and this seems to the be the reoccuring theme. Slamming doors at all hours and so much hall noise! We are not crazy picky but some of this needs to be controlled.", "title": "Passion", "helpfulness": 1, "user": "James S", "date": "July 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135026530}], "location": {"country": "United States", "city": "Milwaukee"}, "stars": 4, "variance": {"poor": 18, "average": 41, "very good": 169, "terrible": 8, "excellent": 601}, "aka": "Pfister Hotel Milwaukee", "slim_ranking": 0.0961538461538, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "The Pfister Hotel, built in 1893 has been the premier downtown Milwaukee hotel for over a century, and continues to celebrate a tradition of gracious service and impeccable style. From the moment you arrive, you’ll notice the extraordinary architecture, and a welcoming ambiance marked by a priceless Victorian art collection which rivals that of any hotel in the world.Renovated in 2008, The Pfister Hotel in Milwaukee has received accolades as being the best of downtown Milwaukee hotels since it opened. We are proud of our AAA Four-Diamond Award and membership in two of our industry's leading organizations: Historic Hotels of America and Preferred Hotels & Resorts Worldwide."}