{"user_rating": 4.0, "review_count": 1863, "name": "The Convent Hotel Amsterdam - MGallery Collection", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "we arrived in schipol from bangkok and needed a early checkin hotel at around 9.30am.we booked it at the airport and as soon as we arrived they had a room available.great location in the city rooms are a bit pricy but i think amsterdam in general is a lot more expensive than it used to be,could not fault the room slept like a baby which is what we needed.didnt eat here.will be heading back over to amsterdam in feb and will stay agin.it has great character as if you like that you will love this hotel if you like big modern hotels with no feel to them then you prob wont like it.", "title": "comfy beds great loacation.", "user": "travelbugTipp", "date": "December 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 89003191}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "My husband and I stayed at The Convent for 6 nights, and it was just right . It is centrally located, a few minutes walk from various restaurants, touristic attractions, and best of all, the tram stopped right in front of it. It is 10 minutes away from Central Station, and river boat trips, a definite asset. The hotel has style, and the staff are friendly, informative and very helpful. My only comment is that we booked a Classic room and that was a bit small for 2 people. However the beds were wonderfully comfortable, and the room very clean. We didn't eat there as we thought breakfast was a bit steep. But pancake places and sandwich shops are all around, so no problem. Amsterdam is a beautiful city, most definitely worth another visit, in a bigger room.", "title": "Best Beds Ever, In Excellent Location", "user": "ZuzuGiza_Egypt", "date": "October 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 84282832}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We stayed here for 4 days in s superior king room which was located in the old convent part of the building. Noise from the road, including human merriment made for sleepless nights but the room was comfortable and clean, well located and staff were very helpful Would recommend but try to obtain a room in the modern part of the hotel..", "title": "Great location but noisy", "user": "Brava2", "date": "October 18, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 84001451}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled solo", "text": "Stayed here before, great location close to Dam Square and Centraal Station. Lovely king size bed , only gripe is no room safe - a hotel of this class needs safes in the rooms, having to wait at reception to gain access to the safes there can be time consuming .", "title": "Great location, all in all worth a visit.", "helpfulness": 1, "user": "ALLWRIGHTY", "date": "October 18, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 83972519}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Some areas of the hotel, (lifts and hallways) are in need of attention , as was my sink, but all in all i'd recommend this hotel.", "title": "Conveniently Located", "user": "bagg10", "date": "October 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 83120517}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "our first ever visit to amsterdam, and we were both very impressed with the city. it was not in the least bit small, as i have read from other people. it's a place that you can return to time and again.", "title": "Decent hotel in great location!", "helpfulness": 1, "user": "ibizaH", "date": "October 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83112458}, {"rating": 5.0, "stay_parameters": "Stayed November 2010", "text": "My girlfriend Treated us 2 a trip 2 the dam and we stayed here last week. Very short walk from central station. We arrived before midday and check in wasn't till 2 but man on front desk said wasn't a problem so signed a couple of forms then gave us our room key. He was very nice and helpful as were all the hotel staff. Room was very nice. View wasn't great but very tidy and plenty big enough for 2 people. Bed was huge and could have slept in it all day. Wish my own bed was as nice. As u walk out hotel and to the left your only a 5 minute walk 2 dam square and town centre. Didn't have breakfast as was very expensive (£20 per person per day) but there r plenty of cafes or fresh bakerys nearby. Also found a lovely restaurant nearby ( turn right out hotel and walk about 5 mins) called humphreys which had excellent food and good value. Would advise this hotel 2 anyone especially couples and would definitely stay here again.", "title": "Great hotel very central", "user": "Pete4liv", "date": "November 12, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 86876916}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Very good location, although everything seems to be walking distance. My husband and I were only here 3 nights but we other than to and from the airport, we walked the whole time. Close to shopping, restaurants, beautiful scenery and upbeat city life. The room was bigger than I had expected, having come from Paris earlier in my trip where the room was way smaller. The room seems to be a little bit dated but I didn't care. The bed was comfortable, we prefer other types of pillows, though. However, we still both slept great.", "title": "Good Value", "helpfulness": 1, "user": "abct77", "date": "October 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 84963083}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Nice building conveniently located. Was obviously once a great hotel - communal areas are lovely, bar is like an old fashioned railway carriage. Rooms are quite chintzy and could do with updating. We had breakfast included and it was good quality. Our room was at the back so no probs with road noise.", "title": "Okay!", "helpfulness": 1, "user": "jo.el.jo", "date": "October 24, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 84615482}, {"rating": 5.0, "title": "Another good weekend", "text": "Returned to The Convent after a good stay same time last year. Still impressed. Reception and concierge extremely helpfull. Nothing better than a couple of drinks in The Duke of Windsor Bar. Very comfortable beds. Will return next year.", "user": "A TripAdvisor user", "date": "December 2, 2010", "id": 88826272}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "My wife and I stayed here for a weekend and we thoroughly enjoyed our stay. The hotel has this 19th centry manour house feel to it which we realy like. We had a room towards the back(read - away from the street) which meant that it was nice and quite. Looking around the room you could see a bit of wear and tear but that did not make the room any less nicer than it was.", "title": "Hotel with manour house feel", "user": "MCZedeler", "date": "November 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 87384221}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Breakfast was not included in our rate but the hotel had plenty of options. We however opted for a canal side cafe a short walk away instead.", "title": "Great Hotel!", "user": "PCsGirl", "date": "November 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87138314}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The only bad thing that can be said is that the internet was not free and in-room entertainment system was a bit unstable. I don't know if it would have helped to by the upgrade package that was available. I dared not do it.", "title": "excellent!", "user": "Bombordina", "date": "November 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87126677}], "location": {"country": "The Netherlands", "continent": "Europe", "city": "Amsterdam"}, "stars": 4, "variance": {"poor": 60, "average": 242, "very good": 898, "terrible": 16, "excellent": 647}, "aka": "Sofitel Amsterdam", "slim_ranking": 0.173529411765, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "This 100 % non-smoking hotel is located in the lively heart of Amsterdam between the Central Station and the Royal Palace (on the Dam). Also within easy reach of Schiphol Airport. Housed in three historic buildings - 13th and 14th century monasteries anda 19th century printing factory - the hotel offers 148 non-smoking rooms. For a cozy lunch or dinner try our \"Duke of Windsor\" Bar & Brasserie. Public parking (200 cars) under our street."}