{"user_rating": 4.5, "review_count": 2023, "name": "The Langham, Melbourne", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "This place is amazing, they take care of every single little detail, the amenities in the room are everywhere! and the Spa pool overlooking the city is just breath taking, stay here you will not be disappointed, great location too.", "title": "The best hotel I have stayed in!", "user": "AlanSussex", "date": "December 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187541916}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled on business", "text": "I nearly forgot the breakfast, not only is this the best hotel I have ever stayed at but the breakfast is the most impressive I have seen too, they even have a chocolate fountain!!!!", "title": "recent stay review", "helpfulness": 1, "user": "audrey w", "date": "December 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 187491239}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled on business", "text": "I recently stayed here for business for three nights. I travel a lot for business and this is one of the few hotels that I have found that gives me comfort, cleanliness and a sense of safety. As a lone female I was never made to feel out of place. I truly felt like a guest in someones home rather than a paying patron of a business.", "title": "nice location and service", "user": "amrwahab", "date": "December 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 187462649}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled on business", "text": "a very nice location and very helpful staff , I advice visitors of Melbourne to stay in this hotel and walk by the nearby yarra river promenade , fabulous restaurants , just cross the bridge to train station and Collins street.", "title": "Great Place in a Great Location", "helpfulness": 1, "user": "Treetops_56", "date": "December 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187397691}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Enjoyed my stay here during a brief business trip. The service was first class and the room was spacious, clean and well set out. I will definitely stay here again - next time bringing my wife who will appreciate the high end toiletries, slippers by the bed and the great location on Southbank's doorstep.", "title": "Two nights including our wedding night", "user": "3172Melbourne", "date": "December 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187389031}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We stayed here in March 2013,just moments away from Melbourne's major attractions .All the staff were very helpful.Beautiful location on the river .Gorgeous restaurant. The room we had was lovely the bed was so comftable and the bathroom beautiful. Outside on the river you can get a boat to Williamstown.If you get a chance visit the Spiegal Tent, attached to the theatre Brilliant", "title": "Superb hotel", "user": "newzealandqaza", "date": "December 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187918523}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "This is a late review as we did not arrive back to the uk until october and then had family issues to deal with. A really pleasant stay at a very nice hotel. All the staff were very friendly and extremely helpful, and nothing was too much trouble for them. They went out of there way to help us, when we had problems with skype, when we wanted to book restaurants, assisting us with local knowledge about the area. We were celebrating our 40th wedding anniversary and they made the time special, but we feel that the level of service and attentiveness would have been the same if we had not been, because not everyone knew. keep up the good work. I would certainly recommend this hotel.", "title": "Brilliant Hotel and Location", "user": "Susan C", "date": "December 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187700814}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "We stayed here for 8 nights while attending Wagner`s ring cycle. Great to be able to walk easily to Opera for so many sessions as the Ring Cycle. Hotel is very pleasant and comfortable, staff are efficient and friendly. I was however amazed that I could not get espresso coffee ( I think after 10.30pm one night)..Not satisfactory. I was also annoyed that I had to pay for Internet ( particularly since I was staying 8 night and a member of their 1865 club )", "title": "Perfect location for State Theatre", "user": "Russ1625", "date": "December 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 187648317}, {"rating": 5.0, "title": "Melbourne's best luxury hotel", "text": "The range of room types, amenities in each, superior service and its central Cbd riverfront location makes it a fantastic stay! I have stayed here for work and holidays and trialled most room options. My 3yo son loves the rooms, staff, club lounge, breakfast, car service and pool, so I can only recommend all the extra features for a working or fun stay. It's my first choice for Melbourne and the staff are incredibly helpful.", "user": "Grismans", "date": "December 14, 2013", "id": 187591019}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "I've spent many nights away from home for business, The Langham made me feel relaxed and not as though I was actually staying in a hotel, as if I was staying with friends. Really helpful staff, willing to have a chat and say hello, genuine interest in helping. Pleasant and cheerful good mornings from housekeeping to the chefs who remembered what I like for breakfast. Close enough to walk to everything Melbourne has to offer. A genuine reception on check in, I was earlier than normal check in times was able to go for a walk and texted when the room was ready.", "title": "Home away from home", "user": "MissMolly73", "date": "December 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187578861}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "We have just spent a wonderful 8 days at the Langham while attending the Ring Cycle, and I have to say it is one of the loveliest hotels I have stayed in. The lobby with its marble, water features, chandeliers and grand staircase is spectacular, the rooms are large and comfortable, and the bathrooms and amenities five star standard all the way. The service, from the doormen to the porters to the concierges and reception staff, was faultless. Each time we returned to the hotel, we were made to feel we were coming \"home\".We have been to Melbourne many times but the first time we have stayed at the Langham, and definitely not the last. Hazel P. Sydney.", "title": "Lovely Langham", "user": "Hazel P", "date": "December 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 187236214}, {"rating": 5.0, "title": "Almost perfect", "text": "This is a lovely place to stay. Beautiful comfortable room and bed. Very pleasant ambience throughout the hotel. The staff were very helpful: finding a desk chair for me as I had to work all day in my room and even posting back a pair of valuable earrings I had left behind. These things count for a lot. Other reviewers have picked up on service issues. For me the Langham greatly exceeded general Australian standards but the general standard is not terribly high to begin with.For those of us who travel in Asia and the U.S. it can be difficult to deal with Australian service which, even at the higher levels, doesn't come close to what one will experience elsewhere.", "user": "atgkc", "date": "December 9, 2013", "id": 187215222}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "Great hotel. Beautiful room with beautiful amenities equal to the Crown Tower Suite which cost us over $1400. This was half the price. Check out is midday which is far more humane ;)", "title": "Good stay", "user": "HaleyMelbourne", "date": "December 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 187163056}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We couldn't quite wake up to go up to the 24th floor for the included breakfast. Valet parking was also included for the $700 odd dollars.", "title": "Dreamy... and very very impressed!", "helpfulness": 1, "user": "madarame_baby", "date": "December 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187149207}, {"rating": 2.0, "title": "Far from 5* customer service", "text": "The only downside, the room service was just passable. For $200 odd dollars (without alcohol) I would have expected better quality and presentation of food.", "user": "ProfW", "date": "December 9, 2013", "id": 187126344}, {"rating": 5.0, "title": "Wonderful Experience", "text": "We stayed at the Langham for 3 nights in a river view room - well worth the extra cost as the view is even more spectacular than i imagined it would be.", "user": "Billy31", "date": "July 15, 2007", "id": 8120905}, {"rating": 2.0, "title": "Rooms are not 5 star", "text": "The rooms are gorgeous, beautifully decorated and in excellent condition.", "user": "travel35", "date": "July 5, 2007", "id": 8060427}, {"rating": 5.0, "title": "one of the best hotels Ive stayed in!", "text": "The location cannot be bettered - right in Southbank itself, just across a foot bridge to the city and a scenic stroll to the casino.", "user": "kiwinurse", "date": "July 1, 2007", "id": 8031961}, {"rating": 4.0, "title": "Excellent Weekend in Melbourne", "text": "My only quibble would be that the roooms are too warm. We had to have the air con on high the whole time and it was about 26 degrees outside.", "user": "jaz09", "date": "June 25, 2007", "id": 7985592}, {"rating": 5.0, "title": "Holiday in Luxury", "text": "We would definitely stay there again.", "user": "Bunburyite", "date": "June 23, 2007", "id": 7969535}, {"rating": 5.0, "title": "Great 'classic' hotel", "text": "superb elegant hotel for the slightly more mature discerning guest. great location, service, food and leisure facilites.", "user": "qprjames", "date": "December 26, 2007", "id": 11973111}, {"rating": 5.0, "title": "Forget the outside - the view from inside is amazing!", "text": "If you're young and flush for cash then to head to crown towers instead wheres its a lot more modern, big and flashy!", "user": "Tandarook", "date": "December 13, 2007", "id": 11535073}, {"rating": 5.0, "title": "Lovely is the Langham!", "text": "THE GOOD", "user": "Sticks1977", "date": "December 12, 2007", "id": 11509810}, {"rating": 5.0, "title": "It's all about the location!!!", "text": "The Langham is gorgeous inside. The lobby is truly breath taking - marble, brass and a water feature as well as seasonal decorations really make it something special. The Christmas decorations are gorgeous!", "user": "Man_U_canuck", "date": "December 9, 2007", "id": 11424556}, {"rating": 4.0, "title": "Best Melbourne hotel by Yarra river", "text": "The staff are very attentive and courteous (although there's the usual bad apple amongst the bunch).", "user": "World Passport", "date": "November 28, 2007", "id": 11110218}, {"rating": 5.0, "title": "Classy hotel", "text": "We stayed at the Langham because of its location and because of other readers comments.", "user": "mintie", "date": "June 12, 2007", "id": 7841813}, {"rating": 4.0, "title": "Definitely stay again", "text": "We were not disappointed - a spectacular foyer entry, helpful check-in staff and superbly clean rooms. The beds - two doubles were great.", "user": "PerthiteOZ", "date": "June 4, 2007", "id": 7769309}, {"rating": 5.0, "title": "A classy hotel", "text": "We din't eat in the hotel as we went out on the way to the Pink! concert - but would absolutely recommend the hotel especially as the room rate was less than AUD200 - which we were able to obtain on a last minute internet site!", "user": "lea321", "date": "April 30, 2007", "id": 7484449}, {"rating": 4.0, "title": "great hotel", "text": "Have just returned from a 3 night stay at the Langham. We had a King Corner Room with views over the river which was lovely. Room was spotlessly clean and the bed very comfortable. Pillows were way too soft but that may not be a problem for some. Small lounge and chairs were very comfortable. Room had everything we required - iron/ironing board & tea/coffee making facilities including coffee percolator as well as a kettle, which we have not always had in a 5 star hotel. Had complimentary late check out which was offered on arrival. This hotel is well positioned for a short walk into the City for shopping and an easy stroll to the MCG, to the Casino complex or to catch trams in any direction. We did not eat at the Hotel although we did partake of some late night beverages at the Aria lounge which had a reasonable wine list. We would have tried the Melba Restauarant if we did not already have other arrangements. We will definitely stay here again.", "user": "RexVictoriaAustralia", "date": "April 22, 2007", "id": 7416295}, {"rating": 5.0, "title": "Excellent location", "text": "Stayed at The Langham for 2 nights at the end of our tour around Oz. On arrival we were asked our flight time and immediately offered a late check out without even asking for it! We were given a river view room which was very spacious and tastefully furnished with an amazing bed. The hotel’s location is second to none being right on the river and next to some lovely restaurants and shopping on the Southbank. Concierge very helpful and offer some really good restaurant recommendations. The public areas are all very impressive especially the wonderful entrance. Spa looked lovely with a great pool and sunbathing area but unfortunately, we had no spare time to use it. All in all a wonderful stay and a great place to end an unforgettable trip!", "user": "Joan2006", "date": "April 21, 2007", "id": 7407382}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "We stayed at the Langham earlier this month while visiting our son at university in Melbourne. We had a corner suite and the rooms were spacious and delightful. The bathroom was fantastic. The staff was incredibly helpful (we had a labourious iten which they helped with). The spa was great. The Club room was excellent. I read past reviews with interest. One mentioned looking out at blocks of building -- you are in the middle of a city --what do you expect to see? (Actually the view of the city was beautiful -- we had both the river and the buildings). My daughter had a roll out in the living room, where it took up little space. Breakfast was an excellent buffet. It was close to the train station, and lovely restaurants along the Yarra river. By comparison to many luxury hotels in other cities, NY, London, Paris, etc., it was as good if not better. We will definitely go back on our next trip. We found the Langham to be totally worth every penny spent and were not looking for freebies, just upscale comfort. It fit the bill without any complaints.", "title": "Great hotel, Excellent Service", "helpfulness": 1, "user": "Retrip", "date": "April 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7391462, "likes": {"liked": "— Comfort, Service, Location", "disliked": "— Having to leave Melbourne"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We stayed for 1 night in easter and couldn't be more happy.The service from checkin to checkout was first class.We booked our stay over the hotel website and found it very easy to navigate.We had the \"wish upon a star package\" and upgraded to a corner king delux room with river view.Buffet breakfast as part of the package ,plenty of choice.", "title": "Great Hotel", "helpfulness": 1, "user": "broggo14", "date": "April 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7382446, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Location to city centre and sports arenas excellant.", "title": "Nice Place to stay", "helpfulness": 3, "user": "wendymark", "date": "April 8, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7292274, "likes": {"liked": "— location"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "I've lived in this hotel for 4 nights with my family. It was elegant and beautiful but the front dest staff didn't have the same quality as their decoration. When checking in the staff didn't smile at all and just keep looking at his computer screen even when talking. His atitute was not really friendly. Th room was fine( to what it costs) the docoration was gorgeous and the mini bar was very prepared.( with lots \" JUST IN CASE\" little stuff in there) I've used the internet for 2 nights in the room, at first the hub was totally broken and I've called 9 for help. The stuff was friendly but she just asked me to dial another no. to connect with the outsource company responsible for the internet business. Well, I've self-helped for 1hrs and have asked for a new cable to change with( it was very late at the time therefore i just quited after) since i was not the professional person of the eletronic products. I've called again the next morning, the one picked up the phone was friendly but still, asked me to self-help again, and at last it was me asking them to send someone up to see what was going on here. After everything was fixed, the staff who came to fix promised that the bill and all the things costs will be cancelled and he would take care of it since I havnt used it. However it was me again found that the thing havnt been done and need to deal with the hotel again. Good thing was they did react soon and that would be just fine.", "title": "elegant hotel quality deco with fair staff", "helpfulness": 5, "user": "Zu Y", "date": "September 13, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8707124, "likes": {"liked": "— decoration", "disliked": "— room cleaning service"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "And the other thing was I've found the cleaning wasnt done very carefully that they didnt really clean the tub, the sink and the toilet properly, It was like they just came in and replace the towels with the new one, and that's all. Although hotel's quality was without doubts, it should still be awared of the tiny things like this.", "title": "Room for improvement", "helpfulness": 2, "user": "JodieTravel01", "date": "July 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 8139940, "likes": {"liked": "— Welcome and departure service; room service breakfast", "disliked": "— Room decor and TV"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "The Langham Melbourne is a 5 star hotel... service and ambience of the hotel is of the highest standard... Its also situated in the heart of the Melbourne night life and restaurant living... close to all ame..nities and lots of local places to go visit.", "title": "Grand Stay", "user": "serenity5552013", "date": "December 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187357774}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled solo", "text": "This is a quality hotel right above the river on the Southbank. The rooms are top notch, and the whole hotel has that quality feel to it. I spent two nights in the hotel, and it really is a good place to stay... very close to the shops, visitor center, train station.", "title": "No wonder this hotel is the number 1 hotel in Melbourne", "user": "Dave9960", "date": "December 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187349873}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "I had the good fortune of staying at this amazing hotel for a conference that I attended in Aprli 2011. Two words that I can use again and again to describe this beautiful gem are: Opulent Elegance. The grand sweeping stairway and fountains at the entrance to the hotel is breathtaking. You cant help but feel like royalty at The Langham. Especially when you're on the roof top enjoying the view of this beautiful city: that's when you truly feel like a King! The rooms were perfectly put together with every little extra you could possibly imagine, all beautifully packaged in the sigature Langham pink - from tooth brushes to toothpaste to hair combs to sewing kits! I would have been happy just relaxing in my room all day! Absolutely stunning and breathtaking.", "title": "Opulence!", "user": "MamtaMithal", "date": "December 11, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 187335430}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "I can't say how impressed I was with this hotel. The people were fabulous, the room was superb (who can resist a room with a balcony), the in room dining was fresh and healthy with plenty of options and to top it off the decorations (Xmas) are the best I've seen in the Southern Hemisphere (and I've travelled!).", "title": "simply perfect", "user": "DDTravellerSydney", "date": "December 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187325812}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "Thank you so much and I will definitely stay with you again when next I venture south.", "title": "Fantastic location, mixed girly feelings", "helpfulness": 1, "user": "edisondownunder", "date": "December 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 187314358}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "We stayed at the Langham Hotel in Melbourne for three nights from March 2nd 2007, as part of our Australian Tour. It was fabulous from start to finish. We were met on arrival by an efficient doorman, whisked up to reception and could only marvel at the luxury of the interior. Fountains, marble staircases and chandeliers. It is gorgeous.", "title": "Luxury at the Langham", "helpfulness": 5, "user": "Reviewer23", "date": "April 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7270499, "likes": {"liked": "— The luxury and standard of service from everyone there", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "The staff are all superb, especially the concierge who arranged our Harley Davidson tour of the city. Our room was large and very clean with a marble bathroom and was serviced twice a day. The breakfasts were the best I have ever tasted. The quality of the food and service was excellent and there was even a chocolate fountain! The views of the Melbourne riverfront from the dining room are marvellous.", "title": "Loved this hotel", "helpfulness": 2, "user": "Esquire", "date": "March 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7195184, "likes": {"liked": "— Location and comfy rooms", "disliked": "— it was perfect"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "We loved everything about Melbourne and the Langham made our stay an unforgettable experience.", "title": "great hotel", "helpfulness": 4, "user": "tweedybird", "date": "February 23, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6831924, "likes": {"liked": "— the room", "disliked": "— expensive food"}}, {"rating": 5.0, "title": "Best Melbourne 5*", "text": "We stayed here for 3 nights before taking a cruise of Australia and New Zealand. Fantastic location. Right on the river walk with lots of cafes and restaurants. Very friendly and helpful staff. This was the most comfortable hotel bed I have ever slept on! Biggest draw back was I didnt want to get out of it! Great hotel.", "helpfulness": 6, "user": "fasta", "date": "February 12, 2007", "id": 6783627}, {"rating": 4.0, "title": "Value for money", "text": "Stayed at this hotel on a Saturday night following a function at Crown Casino. Booked directly with hotel website 30 days in advance and received an excellent rate. We booked a king room with the most comfortable and enormous king size bed ever. We even thought about buying the bed as it is available on the minibar list!!! The room was not as large as I expected from their onsite information, but was more than comfortable with a desk and chair, easy chair and ottoman, tv cabinet, baggage rack, wardrobe with courtesy slippers and robes, and the largest minibar and servery I have seen anywhere around the world. The bathroom and minibar area had mirrors everywhere. The bathroom had a separate bath and large shower, large vanity and loads of bench space for toiletry bags. The provided shampoo/conditioner/soaps etc were of a very high quality. Didn't hear any noises from adjoining rooms or the hallway. The only problem was the room was rather stuffy without ensuring the aircon was on low. And the very warm quilt got too warm without the aircon on all night. We didn't have breakfast at the hotel so I cannot comment on that. Valet parking was an extra charge but well worth the expense.", "user": "mep01", "date": "October 27, 2007", "id": 10381862}, {"rating": 3.0, "title": "It's Okay - Definitely Overpriced Given the Lack of Quality", "text": "Given the price in regards to other hotels in the Melbourne market, I was expecting Four Seasons-like quality and service - boy was I wrong. Basic things like the towels and furnishings are average to low budget - simply inexcusable. To this day, I wince at the thought of toweling off in the shower with the sandpaper that passes for a towel at the Langham. I stayed four (4) nights (9/24 - 9/27), so I was present long enough to make a proper assessment (the towels never got better). The bed is great and everything else, including the food, is medicore at best - but expensive relative to the Melbourne market - definitely not worth AUD 300 / night considering the other options available such as the Westin and Crown properties. In general, the staff is unusually young, naive, and in need of some immediate training/polish. Stayed an additonal night down the river at the Crown Promenade - definitely nicer (larger, more comfortable room with modern furnishings) and slightly cheaper. Don't waste your time at the Langham.", "user": "GolfBiz", "date": "October 7, 2007", "id": 10047845}, {"rating": 5.0, "title": "What an expereience", "text": "This Hotel has it all, the views are fantastic ask for a room that over looks the River. The Reception is lovely. When you are in the Room you feel like you could stay for quite some time. The BED is so comfortable, and massive pillows that you just sink into. The only downfall I have for this Hotel is that it is extremely expensive and you are on the other side of the River so it does have a good 10 to 15 minute walk across the bridge to the main shopping streets and theatres etc. This is a Hotel that if you want to indulge stay here.", "user": "colin65Melbourne", "date": "September 28, 2007", "id": 10014024}], "location": {"country": "Australia", "continent": "South Pacific", "city": "Melbourne"}, "stars": 5, "variance": {"poor": 36, "average": 110, "very good": 360, "terrible": 27, "excellent": 1490}, "aka": "The Langham, Melbourne Hotel", "slim_ranking": 0.00561797752809, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}}