{"user_rating": 4.5, "review_count": 2436, "name": "The View Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "We booked the top floor star room for the sunrise and were not disapointed. The view took our breath away. The hotel is very clean, rooms are well decorated with nice furnishings but watch the lift as the doors shut VERY quickly. Being a dry reservation means no bar and everyone seemed to go to bed early. If you drive the trail yourselves make sure you have an appropriate vehicle as it is very bumpy, better still take the guided tour and let someone else drive! The food at the restaurant is very good with lots of choice and the soup/salad starters are very filling.", "title": "Mother nature at its best!", "user": "Alison E", "date": "September 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140476209}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Stayed at the view on Sept 5th 2012. Monument valley looked quite impressive driving up to the hotel.", "title": "Amazing views and experience", "user": "dsvep1", "date": "September 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140464835}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Opening the curtains and the sliding patio door in room was the most amazing experience - wow - what a view that was before you - something to die for.", "title": "worth a journey", "helpfulness": 2, "user": "raygo", "date": "September 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140450117}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "The hotel was very good - the restaurant at night served a mixture of american style favourites together with navajo style cooking - the standard was quite good. Lunch next day was also good.", "title": "Like everyone says....it's the View!", "helpfulness": 2, "user": "travel2011xx", "date": "September 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140445976}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The hotel showed the film 'Stagecoach' in the evening outside by the verandah - another great experience.", "title": "2nd stay & better than the first!", "helpfulness": 1, "user": "irish_captain", "date": "September 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140407388}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Very good hotel, clean and professionnal. The view from the rooms is really incredible, you can see the red mountains from your bed. A bad point : the restaurant is not at the same level as the food is pretty much too simple for an hotel with this standard. Do not miss to book a room there very early.", "title": "Wonderful, incredible view on the mountains", "user": "malotyph", "date": "August 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 2.0}, "id": 117159982}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We had such a wonderful time at The View! The room is wonderful. Food excellent! The movie on the patio that night 'The Searchers' was just a great way to spend the evening. My husband said it was one of the highlights of our trip to Arizona. The view from the room was awe inspiring and we woke up at dawn to see the sunrise which was soooo beautiful... The only constructive criticism I would give to management is to look at the serving time in the restaurant. It seemed like initial contact with waitress was after a very long wait and also we waited when we needed refills, etc. The staff was friendly especially those at the front desk! The gift shop was nice to browse through. Internet is touchy and difficult to get a good signal, but who really needs Internet when you are in monument valley?", "title": "Loved it!", "user": "manyhatwomantraveler", "date": "August 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 3.0}, "id": 117054226}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We really enjoyed our stay here, stayed 2 nights. It was full and they were turning people away so felt lucky to be here. Booked direct months earlier. Rooms spotless and view, well that's what it's named after. Got vouchers for breakfast when we checked in so kids ate free ( age 9 and under). Not bad value with voucher but expensive without. Restaurant not too bad considering that is all that's here eating wise. Enjoyed a John Wayne film under the starts at night. Very relaxing stay. Well worth visiting.", "title": "Amazing hotel for such a remote location, very high standard and VIEW!", "user": "latham_10", "date": "August 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 117032848}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "My wife & I stayed three nights at The View hotel in a star view room, whilst exspensive it was worth it for the fantastic view of the mittens and the unbelievable sunrise.", "title": "Great location", "user": "cambo2910", "date": "August 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 117020536}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "The room was comfortable and clean with car parking just below landing stairs.", "title": "Great view and loved it", "helpfulness": 1, "user": "Tom50207", "date": "August 17, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116862452}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "The best thing is the VIEW, we had a large room overlooking the Valley with its own little terrace to watch the sunrise/sunset. Memorable", "title": "Monumental experience!", "user": "VillaMagnoliaItaly", "date": "August 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116857203}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We stayed here for one night as part of a road trip. Undoubtely the view from the rooms and restaurant are great. If you are on a budget, you can stay further away, and just come to the restaurant and terrace for the view. I guess the only advantage is if you stay there, that you get the sunrise view more easily, since you just have to step out of your room.", "title": "Great View - Expensive", "helpfulness": 2, "user": "didaisy", "date": "August 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 116651802}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "The hotel is somewhat charming, but some of the layout is strange. Some design choices feel like in a 1980s hotel. It is a non-smoking hotel. However, on each balcony is an ashtray, and while getting up at 5:30am to get the sunrise views, I smelled cigarette smoke wafting from the next balcony. When I mentioned that the hotel is non-smoking, the neighbors reminded me that the balconies are smoking areas. So I had to endure the sunrise with cigarette smoke making me feel sick in the early morning.", "title": "Great internior design, friendly staff, amazing location.", "user": "Mellby", "date": "August 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 116593604}, {"rating": 4.0, "stay_parameters": "Stayed July 2011", "text": "This is a very belated review, but I stayed back in November 2009 after visiting previously back in the 90's and staying at Gouldings Lodge. The View blends into the majestic scenery very well. The rooms and interior were furnished in a way I'd love to furnish my own home. Rustic with a lot of the local Navajo and Hopi decorations. Free Wi-Fi only in the reception area, but this was very comfortable as well. The restaurant was nice (as was the service) and the gift shop has reasonable pricing as well. Make sure you are there for Sunset and Sunrise as the views 'ARE' amazing!", "title": "The VIEW !!! and a good hotel", "user": "legoutdesautres", "date": "August 10, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 116536005}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Obviously you would choose this hotel for the view it offers : so unique and extraordinary...at 6am everyone is on his balcony, taking pictures of the sunrise !! But the hotel itself is also good, rooms are big and very clean, lobby is beautifully decorated, people are nice. Restaurant and breakfast average", "title": "See Monument Valley and Die", "user": "Foodhero", "date": "August 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 116510800}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "This hotel had really friendly staff and we had a very tasty Navajo meal in the adjoining restaurant. Slightly thin walls meant we didn't have a perfect night's sleep during our stay. Lovely furnishings in the room, comfy beds and great large bathroom, but really it's all about the view! There are no words - spectacular at any time but breathtaking at sunrise and sunset - just go and see it for yourself!", "title": "It's all about the view!", "helpfulness": 1, "user": "hannypops", "date": "September 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 140398282}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The main photo shows a serene setting but the hotel is actually attached to a restaurant and visitors' center with many tourists so it's a little more hectic than I expected. Our room was very large and nice--huge bathroom with a nice bathtub. The best part was looking at the stars at 1 am. however. Spectacular. We took a must-do tour during the day with Harry from Navajo Spirit Tours. The restaurant's food is pretty good considering the volumes of people. And the food is more than plentiful=too much.", "title": "The best place to stay in Monument Valley", "helpfulness": 1, "user": "LindaAZ2", "date": "September 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140358827}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The views are to remember for the rest of your life, especially sunrise and sunset, rooms on the smaller size, but with balconies that have such a view.", "title": "Just the best sunsets and sunrises you can imagine", "helpfulness": 1, "user": "IanofCF", "date": "September 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140295993}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Restaurant is OK, but only a limited range, fine for a night , but there is only so much you can do with beans, nachos , etc. Good Navaho music the night we were there.", "title": "Just couldn't get enough of that view", "helpfulness": 1, "user": "Jan P", "date": "September 14, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 140272727}, {"rating": 5.0, "title": "Breathtaking!", "text": "Spent 2 nights at The View hotel and it was well worth the cost. We had a room on the top floor and the night skies were something to see. Got up early to see the sun rise over the Mittens - truly a sight we will never ever forget.Front desk service was a little poor but the only negative about our whole stay.", "helpfulness": 1, "user": "lynneharvey", "date": "September 14, 2012", "id": 140243910}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We stayed one night in a big, very comfortable, spotlessly clean double queen. The furnishings were tasteful, the beds heavenly and the bath products a treat. We even had free WIFI in the room, and a fridge to cool the beer we had brought with us in anticipation of the 'dry' rule.", "title": "Great hotel, fantastic views!", "user": "fraire", "date": "September 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 117536113}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The best part, of course, is the private balcony overlooking Monument Valley. WOW!! What a magical, mythical place right there in front of you. This was the absolute highlight of our trip. We set our alarm clock to take in the sunrise in the quiet of the desert. This is what you should come here for, and is worth every penny. You can even watch the stars from the ground floor rooms, there is no major overhang from the floors above.", "title": "Fantastic location, great room, but restaurant service poor.", "user": "kentishmayde", "date": "August 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 3.0}, "id": 117496570}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We found all of the staff to be pleasant and efficient. We ate in the restaurant the evening we arrived and found the food to be quite good and well-priced.Plus, you again have the wonderful view to look at ! Breakfast the next morning ( not included, but they gave us coupons) was well above average, with a lovely spread available.", "title": "Wonderful", "user": "stevemof", "date": "August 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 117294087}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Parking was free and abundant and we used our rented Jeep to drive around the main trail through the park in the clear blue skies of the next morning.( The light was declining and the weather somewhat inclement when we arrived the evening before) This is a definite must-do, but try to do it early before the trail gets clogged with cars.", "title": "What a great place to stay!", "helpfulness": 1, "user": "colbuck", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 3.0}, "id": 117249027}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Finally, if you want to be right there where it matters, in an extremely comfortable hotel, this is the place for you.", "title": "Loved it - stay here for the view and you won't be disappointed", "user": "HellsBells2010", "date": "August 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 117173254}, {"rating": 5.0, "title": "Amazing", "text": "great room, unbelievable view. Couldn't ask for more.", "helpfulness": 1, "user": "Anon198425", "date": "September 13, 2012", "id": 140179534}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The local foods on the menu are ok. Doesn't need more than one night at this hotel as you can see the valley in one day trip. Do not miss out on the opportunity to see Monument Valley and this is the hotel to see it from.", "title": "The View, of course, but enjoyed the food too", "user": "Chris B", "date": "September 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 140123000}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "You don't need us to tell you that that Monument Valley is magical - it's pretty much everything we hoped for. However, we were pleasantly surpised by the restaurant food. We had various Navajo specials 2 nights and they were good & excellent value. Don't imagine that everything is expensive here. Service was mostly quick & always friendly.", "title": "Exceeded expectations", "helpfulness": 1, "user": "Margot01", "date": "September 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139966183}, {"rating": 4.0, "title": "Fab view", "text": "When planning the trip, I really wasn't sure if it was necessary to stay inside Monument Valley and wondered if it would be worth it as is very expensive. It definitely was worth it, both location wise and quality wise. This is a very modern, clean, tastefully decorated, comfortable hotel. The room was spacious and immaculate and the views from the balcony and the common rooms of the hotel were spectacular. The staff were very friendly. I was concerned that the restaurant might take advantage of its position as the only place to eat to serve low quality food at high prices but in fact the food was good, the service excellent and the prices reasonable.", "helpfulness": 1, "user": "Lilies68", "date": "September 7, 2012", "id": 139671573}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The noisy aircon units detract a bit from the balcony atmosphere, but I don't know what can be done about that. Wouldn't want to stay there without aircon!", "title": "WOW...loved it", "helpfulness": 1, "user": "sandyinhgs", "date": "September 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 139657042}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "As everyone says, the views are absolutely stunning and for that reason alone we chose to stay here. The price is mighty high so you are paying for that. We made the most of our balcony, sitting out with our own alcohol until sundown and then watching the moon rising behind the Left Mitten...absolutely stunning. We were up before dawn the following day to watch the sunrise from behind the buttes, Again, a fantastic picture unfolded before us.", "title": "If it wasn't for the location you wouldn't touch this hotel", "helpfulness": 2, "user": "nataliatiyad", "date": "September 20, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 140763813}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We took the car around the 17 mile dirt road and that was great fun, even when a sudden downpour threaten to swamp us!", "title": "They are very kind!", "helpfulness": 1, "user": "swisshiker52", "date": "September 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 140735374}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The room was on the top floor and was OK if rather rather sparsely furnished. It was clean and the bed was comfortable.", "title": "Beautiful Facility with Magnificent Views", "user": "GrandmaAudrey", "date": "September 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140679005}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Where The View hotel falls down is in the attitude of the staff. The reception staff aside (who gave us a very nice welcome ... though it pays not to blow bubbles with bubble gum when you think that no one can see you in such a public place!), the attitude of all the other hotel staff was one listlessness, desultory service, unsmiling and with barely concealed resentment at having to undertake such tasks for tourists. There's twice as many working the restaurant as any other establishment would need and none of them had any sense of pace or pleasant personality but they had the effrontery to demand an 18% tip. Well you get that for good service, maybe more but no one deserved that in the restaurant, the cook perhaps least of all. The whole place lacks polish, style, class, spirit ...call it what you like. Such a shame and no advert for Navajo hospitality.", "title": "Beyond expectations.", "helpfulness": 1, "user": "HowlnBubba", "date": "September 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140640169}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "This August, we stayed in this hotel one night, and we had a big problem here.", "title": "Excellent Views and Rooms, As Well As Price", "user": "patricia M", "date": "September 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140612405}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Just as other reviewers have written, the view from each balcony is exceptional, especially at sunset. The beds were comfortable, and the room was reasonably quiet. At night the hotel shows movies filmed in Monument Valley, such as John Wayne westerns. Hiking the wildcat trail was fun but very hot. The trail covers almost 4 miles around the left mitten. It was about 100 degrees at 10 a.m. at the beginning of August. Take plenty of water! The restaurant was very good for both breakfast and dinner. At the breakfast buffet, you have to ask the server for bacon or sausage, but it's included in the price of the buffet. We really enjoyed the blue corn fry bread and posole for dinner. We are from the U.S. and felt like the minority at the hotel. It seemed that most of the other guests spoke other languages.", "title": "Gorgeous view and international mix of people", "user": "HB7117", "date": "August 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 116448909}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We spent one night at The View on our trip to Monument Valley. The location of the hotel cannot be beat! We arrived early and were able to check into a room with only a 30 minute delay -- this was great, because it allowed us to drop our things, change and get ready for our tour of the valley.", "title": "Outstanding location -- reasonable amenities", "user": "Gundi", "date": "August 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 116404060}, {"rating": 4.0, "title": "Fantastic View", "text": "The room -- which was on the top floor contained two decent beds with good bedding, a small balcony with a table and two chairs, fridge, reading light, chair etc. Pretty much standard motel accommodations -- but of course there is the wall to wall view of the valley!", "helpfulness": 1, "user": "cowboys", "date": "August 6, 2011", "id": 116353822}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The bathroom is a good size and is well laid our although the counter could be larger. Towels are good, shower pressure is good. Rooms are quiet and we slept well.", "title": "Definitely the View", "helpfulness": 1, "user": "kel1812", "date": "August 6, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116328037}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We ate at the restaurant, which is uninspiring, but has the amazing views. We were delighted with the number of vegetarian options for us (a plus in our books). Service was good and helpful. Breakfast featured a mediocre buffet. The cost of the buffet is off-set by $5. coupons which you get on check-in.", "title": "Timeless and Otherworldly", "user": "WildflowerMama", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116270227}], "location": {"country": "United States", "city": "Monument Valley"}, "stars": 3, "variance": {"poor": 45, "average": 193, "very good": 743, "terrible": 14, "excellent": 1441}, "aka": "View Hotel Monument Valley", "slim_ranking": 0.5, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "The View is the only hotel inside the Monument Valley Tribal Park. Every guestroom has a private balcony with a view of the iconic formations of Monument Valley - so close that you feel like you can reach out and touch The Mittens! Guestrooms feature flat screen TVs, coffee makers, refrigerator, microwave, and wireless Internet. Enjoy the panorama of Monument Valley while dining in The View restaurant with views to the rising sun and the sunset as well."}