{"user_rating": 4.0, "review_count": 177, "name": "The Eltermere Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "We had a one night 'special treat' stay.", "title": "Exceptional Lakeland country house hotel.", "helpfulness": 1, "user": "Mark J", "date": "March 20, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 126407041}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We were planned late arrivals and hotel phoned us en route for an ETA and then made sure our room was homely for us. A nice touch.", "title": "Outstanding", "helpfulness": 1, "user": "carolyn h", "date": "March 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125984883}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "A great room, cost and comfortable with nice views.", "title": "A memorably good break, stunning room + view", "helpfulness": 2, "user": "Ian D", "date": "February 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124830131}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Exceptional breakfast in the morning.", "title": "Wonderful weekend for a proposal", "helpfulness": 2, "user": "clairebrookes1980", "date": "January 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123478817}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Lovely art work and furnishings everywhere.", "title": "top class in every way", "helpfulness": 2, "user": "jbwade", "date": "November 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121020036}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "My wife and I recently stayed a couple of nights at The Eltermere Inn and really enjoyed our stay. We had the \"Deer Bields\" room on the top floor, this is one of their superior plus rooms and was very spacious and well appointed apart from the bathroom. The toilet / basin room was extremely compact with a low ceiling under the eaves and the freestanding bath tub whilst looking very impressive was a bit of a pain, nowhere to attach the shower head, nowhere to put shampoo etc. Everything else about the hotel was really lovely, the various sitting rooms where the attentive staff would serve coffee, and the dining room were all beautifully furnished. We ate in the bar one night (same menu) as we were only 1 of 2 couples dining and the food was delicious as was the breakfast. We also ate out at the local pub, The Britannia Inn, which is just a short walk and this is also good. Traditional lakeland pub with good bar food.", "title": "Lovely hotel", "user": "nlm999", "date": "May 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129687534}, {"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "Overall, a really lovely place to base yourself in The Lakes and we'll definitely return but to a room with a shower!", "title": "Beautiful location, would love to return", "user": "alexnkev", "date": "May 5, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 129415767}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Gorgeous hotel. Rooms are nicely spaced out so feel very private. Location is just gorgeous. The owners' son is an amazing cook and we couldn't wait for dinner everynight!", "title": "Great hotel in lovely setting", "user": "Kendallady", "date": "May 3, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 129307024}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "My husband decided to have lunch out this Saturday and discovered the lovely Eltermere Inn in the Langdale are of the Lake District. It was a delightful find, the place itself is in a great location so we tied it in with a walk first. We were the only ones having lunch when we arrived and got a warm welcome from the person in charge of the bar. We chose pea & ham soup for me, Club sandich for my husband. Both were truly delicious. The best pea & ham soup I've ever had, with an excellent selection of artisan bread to go with it. My husband is still raving about his club sandwith, filled with plenty of bacon, chicken and salad and a handful of chips to go with it.", "title": "Very Beautiful Hotel", "user": "kopelia", "date": "April 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128598021}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We stayed for only one night at the eltermere inn over the easter weekend. Having booked in a rush we didn't know what to expect as I had barely read the reviews. We were very pleasantly surprised. From entering the hotel we were well impressed by the decor. Everything looked beautiful and the reception rooms and restaurant/bar area were stanning. The staff was very friendly.", "title": "Gem in Eltermere", "user": "shropshireboots", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128398886}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Spent a very enjoyable few days here,despite the dreadful weather ! A stunning room (Lingmoor) with a fabulous view. Plush and cosy lounges and bar area. Attentive and friendly staff .The Evening meals were of a good standard with daily specials enhancing the menu choice . The breakfast seemed a little ordinary for such a fine establishment and the coffee was also a bit of a let down..., rather weak cafetiere. However ,overall ,much to recommend and would most definately return.", "title": "sumptuous comfort", "helpfulness": 1, "user": "montymuffin", "date": "June 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 132672718}, {"rating": 4.0, "title": "Great lunch", "text": "Popped in here after reading about it in Lonely Planet.", "user": "Peter I", "date": "June 10, 2012", "id": 131676537}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Not disappointed.excellent food in a lovely location.", "title": "Relaxing weekend with family (adult)", "helpfulness": 1, "user": "leigh b", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 130915905}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The most incredible view from the front garden. Its a must to sit and have a cream tea, lunch or drink if weather permits. The food at the hotel is excellent. The owners are lovely. Lots of hot water, great amenities. Bed could have been a bit more comfy.", "title": "I wish we had found this place earlier", "user": "Aqualymm", "date": "May 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130000872}, {"rating": 5.0, "title": "Beautiful food in a stunning location.", "text": "When I first went in, I expected it to be a bit more lux, but the understated approach to a great hotel grew on me.", "user": "WiccanWondering", "date": "May 10, 2012", "id": 129717060}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We just got back from a 1 night stay at the Eltermere Inn and it really was 'perfect in every sense'. We arrived early on Sunday and was pleased to find our room was ready. After quickly depositing our bags in the delightful Superior Plus 'Cockly Moss' room, (we'd actually booked and paid for a Superior room) we asked for help with directions for our walk. Mark, one of the owners, quickly produced a guide book which he highlighted our route, gave us his personal insight and even let us borrow the book for our hike. Away from the spectacular private grounds of the Hotel we made the short hike to Little Langdale where we found the charming Slaters Bridge and onto the Cathedral Caves. I would strongly recommend the cave, you enter it through a tunnel before coming to a 80 ft high cave roof broken in two by a huge gorge that floods in light. The sound of dripping water from on high makes this a spectacular spot. We learned from Mark later on that it had recently been used in the making of the film 'Snow White & the Huntsman'. Back to the Hotel and to our perfectly spacious room, complete with complementary Grasmere Gingerbread. Dinner was tremendous - top notch food with excellent service. We certainly wasn't rushed but there certainly wasn't any kind of wait. The bar is well stocked with local ales, fine wine and an extensive spirits collection. We were lucky enough to sample the last of their home-made Damson gin which was out of this world (it only lasts for 4 months from Jan-Apr so think on)....Many residents were using wireless devices of one kind or other, laptops, phones, iPads, but we found the WiFi signal still strong enough to watch a 90 minute TV programme on iPlayer from one of the beautiful lounges. At the end of the night we was asked by the Bar tender whether we'd like a last drink before he closed the bar. I thought this was a really nice touch as he knew we'd been enjoying our programme from the Lounge and weren't to know the bar was closing. All in all this Hotel is wonderful. It oozes class and taste, food & service are flawless. Breakfast was a choice of about 4 cooked options with cereals, fruit, yoghurts and pastry beforehand if you want it. I think what makes this Hotel stand out is the service and individuality. We will definitely be going back and I'd strongly recommend it to anyone else.", "title": "Perfect in every sense", "user": "elimeleumas", "date": "April 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127978254}, {"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "We booked this break only a week ago and I searched the web for a high quality but reasonably priced hotel to take my partner away for Easter.... The website just does not do this hotel justice - the views are stunning from our room and from the various 'public' areas around the hotel. The rooms appear to have struck that balance between retaining the charm of an old place with the modern convienience required to enjoy a short break of this type. What swung it for me was that you also get access to the Langdale hotel spa and gym facilities, which is just up the road. We eat at the hotel last night and it was superb. Breakfast is taken in a room with stunning views of the lake and is just fabulous -", "title": "The best hotel in the lake district!", "helpfulness": 2, "user": "FortyEngland", "date": "April 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 127583092}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "I've traveled quite a bit and stayed in hotels across the country because of work - I just can't speak highly enough about this very special place. What a find! We will be back and will recommend this to all our friends - just book it, you won't regret it!", "title": "Fantastic Stay at an Exceptional Country Hotel", "helpfulness": 1, "user": "Ann B", "date": "April 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 127309308}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We have just returned from a couple of nights stay at The Eltermere Inn. We were in the \"Stone Arthur\" Room which was on the ground floor near the bar and dining room. Fantastic Room, very cosy with a Fabulous Shower Room.", "title": "Fantastic gem of an hotel in a beautiful location", "helpfulness": 1, "user": "riclouard", "date": "March 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 126921317}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Staff were extremely pleasant and very helpful....Absolutley no faults! Surrounding scenery, fabulous.....", "title": "Exceptional Hotel In a Beautiful Location", "helpfulness": 1, "user": "Joyce C", "date": "March 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126918044}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 12, "average": 13, "very good": 32, "terrible": 12, "excellent": 108}, "aka": "The Eltermere Hotel", "slim_ranking": 1.0}