{"user_rating": 3.0, "review_count": 37, "name": "The Virginian", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "Winthrop is such a beatiful area, and this place with quaint natural wood log-style rooms has potential to be charming in it's environment. The problem with it though is that he's being presented like a motel with ammenities when the lack of quality of the ammenities calls out \"old summer cabins\" - which these are not supposed to be.", "title": "Just 12 channels because they have dial TVs hooked to Cable?", "helpfulness": 1, "user": "Jimboatwork", "date": "September 23, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 5.0, "rooms": 2.0}, "id": 8861704, "likes": {"liked": "— The area", "disliked": "— Old dial TV couldn't get more than 12 channels, pool nasty, internet not working."}}, {"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "First off, digital TV;s are less than $200 in the big city now, so why advertise you have cable TV and then put a guest into a room with an hand-crank rotary tV tuner from the 1970's and no cable box. The best you can do is turn the knob to dial in channels 2-13. We went to the office to ask if there was a way to get the dozens of other channels and they acted like they didn't know we couldn't get all the channels and nobody else ever had a problem with it. Then it turns out they offer wireless internet, but said you have to go down to their \"Saloon\" building to pick it up. Not too handy for our teenagers who aren't old enough to go into a saloon anyway, but then it looked like they closed that building down early so having failed to get enough signal in the room we gave up. The restaurant had been closed for some unspecified reason which wasn't a big problem. A new pizza place opened right next door a week before which had SPECTACULAR gourmet pizza, and the young owner was REALLY friendly and helpful. Their New York quality menu was totally unexpected for the area. . The swimming pool was nice and warm when I dipped my foot in, but after diving in we all immediately noticed the water smelled and felt like the old back-yard above ground pools you had as a kid... which didn't have filters or chlorination... after about a week. There wasn't even a noticable trace smell of chlorine so we all felt dirty after we got in. The room was spacious and quaint inside. Not dirty, not spotless, just cabin-like. Furnishings were older, but I don't have any complaints other than it was a bit pricy for something with a 1970's TV and no internet. We had a little dog, so there weren't a lot of options in town. Gratefully they do take dogs. We had a kitchen too but didn't need or use it. It's a beautiful area, and not a bad place. Maybe the price tag and the fact that we didn't stay in one of the cabins caused me to expect something a step above an old-fashioned cabin.", "title": "to much $ for to little", "helpfulness": 2, "user": "wcfan24", "date": "May 29, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 7710429, "likes": {"liked": "— pet friendly", "disliked": "— price of room, the fact they would leave a pee stainded broken down couch in a room that they charged so much for. Pool not ready. Kitchen that had nothing in it including a stove."}}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Ordered room with a kitchen. It had small fridg one cup, 5 mismatched plates., no pots no pans. Pool was not ready this is Memorial day 87 degrees. Couch was hide a bed and was a broken down pile with pee stains, no springs to support the bottom of the matress. I paid $182.50 a night. It was cabin #7. It had a single hot plate for a stove. No glasses not even paper. a little silver wear. Loilet ran 24 hours straight.. I sent pictures have a look. If your looking for a nice place to stay skip this one. There are much better ones in town or Twisp.", "title": "Unable to Sleep", "helpfulness": 1, "user": "Suzette_Maravilla", "date": "September 21, 2006", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 5822859, "likes": {"liked": "— theme", "disliked": "— unable to sleep"}}, {"rating": 5.0, "title": "Can't wait to go back!", "text": "The mattress was very poor and the walls extremely thin (we heard everything and I mean EVERYTHING). Since my main requirement in a hotel is that I be able to get a good night's sleep, this hotel was not acceptable. We had to get up at 6:00 a.m. from a fitful sleep whether we wanted to or not (I am ordinarily a heavy sleeper). We were in a bottom unit overlooking the river. I liked the decor and ambiance very much. There was no coffeepot in the room (or microwave or frig. and the TV was extremely small). The restaurant was open late - that was good - but they charged $1.75 for a cup of coffee in the hotel, then another $1.75 for take-out, $7.00 between the 2 of us for 4 cups of coffee for guests who paid $100/room. If we had been on the top level, or had a private cabin, or the place had been empty - with a new mattress - our experience would have been far better. I imagine the upper floor has a nice balconey view as well. I wish that the staff had recommended a better choice in a room when I made the reservation.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "June 28, 2006", "id": 5405587}, {"rating": 2.0, "title": "Not much to talk about", "text": "This has to be the best kept secret in Winthrop. Park directly in front of your door; coffee maker, fridge, microwave, blender! The room was very clean, neat and tidy. Very cabin like. My husband and I had the entire pool to ourselves both days. Gas BBQ's available in the park like setting beside the pool. Cozy beach towels provided for your pool use. Full grocery store, convenience store and gas station within walking distance. Downtown Winthrop just a mile away! We can't wait to return with lots of friends to share how much we enjoyed our stay! Rent a variety of types of rooms; we had the Honcho room but are looking forward to renting a Cabin next to the pool on our next visit.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 23, 2005", "id": 3694338}, {"rating": 1.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "We stayed here in 2006, It was old but was clean and looked like an effort was made to be a respectable place. 2008 very different experience, pool area was filthy utensils in kitchenette rusty. The bathrooms look like an after thought addition. Thought I would just live with it and treat it as a learning experience to never go back. Turns out my credit card was charged twice when I contacted Sunspots resorts who operate this place I was told they are working on it. I was not satisfied with my stay here and this has compounded my un-happiness. Winthrop and the Methow area are great Do not stay here and ruin your experience.", "title": "Never Again", "user": "greatwhitenorth27", "date": "September 15, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 20105926, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "No Sheets, No toilet paper - we had to raid the supply cupboard - left open - as there was no staff at the resort!!!", "title": "Dirty - No Sheets!!!", "user": "emily32", "date": "August 15, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 3.0}, "id": 18980550, "likes": {"liked": "— location", "disliked": "— No staff"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Dirty, smelled as if it had not been rented in months.", "title": "Worst place I have ever almost stayed!", "helpfulness": 1, "user": "VWright11", "date": "August 4, 2008", "detail_rating": {"cleanliness": 1.0, "front_desk": 2.0, "location": 3.0, "value": 1.0, "rooms": 1.0}, "id": 18603672, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 2.0, "title": "No Loyalty to long time Costomers", "text": "The Staircase was falling down", "user": "DAJB", "date": "June 19, 2008", "id": 17058032}, {"rating": 2.0, "title": "Dazed and Confused But an Okay Value", "text": "The smoke alarm beeped all night, as there were no batteries in it.", "user": "ElizabethKSeattle", "date": "September 25, 2007", "id": 10000455}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We spent a night at one of the two story units of this motel. The noise levels are comparable to regular budget motels (i.e. you can hear the sound of TV from the room next door etc.) The room was spacious, with queen size bed, TV (old style), coffee table (just large enough for coffee maker), and two small wooden chairs. The furniture was quite dated, and the mattress was not very comfortable, but the room and bathroom is kept clean. I was satisfied with the cleanliness of the bathroom in particular. The shower head of the bathroom is somewhat low, so it could be uncomfortable for tall individuals. The water pressure of the shower was somewhat weak as well. The continental breakfast starts at 8 am, and it includes coffee, bagels, donuts, yogurt and fresh fruit. Nothing fancy, but it's standard fare for this type of motel. Although this is not the best place we stayed in Winthrop, we would definitely consider this place as one of the choices when visiting Winthrop in the future.", "title": "Fair value and relatively clean place to stay", "helpfulness": 1, "user": "Fortwood", "date": "September 14, 2011", "detail_rating": {"value": 4.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 118112039}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We just spent a week at the Virginian - It was great!!", "title": "Great Value ! Clean and comfortable- Under new management !!", "helpfulness": 3, "user": "Christy S", "date": "August 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117319504}, {"rating": 1.0, "stay_parameters": "Stayed July 2011", "text": "The first night we were in one of the lower rooms and could hear people walking around upstairs but it was not overwhelming. After the first night we were able to get a room with micro and fridge. It was roomier and WONDERFUL!!", "title": "Worst customer service ,dirty unfriendly people", "user": "jen24t", "date": "July 28, 2011", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 1.0}, "id": 115937180}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Everything was clean and kept that way, beds were comfortable, if we needed anything the people there bent over backwards to help!", "title": "Good value for a rustic spot in Winthrop", "helpfulness": 1, "user": "gripnrip2011", "date": "July 25, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 115761315}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We even lost some money close to our room and they picked it up and returned it along with sunglasses left in the first room. There were more than enough dishes and silverware in our room to get us by for the week . I would highly recommend this place !!", "title": "Good rustic value", "helpfulness": 2, "user": "budgetfreak", "date": "July 4, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 3.0}, "id": 115002141}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "Staff very friendly and accommodating.", "title": "Perfect Spot", "user": "elhide", "date": "August 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75175735}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Dark sky to see stars and meteor showers'", "title": "Fun, Quirky Slice of Americana", "user": "C0pita", "date": "May 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 65959163}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Even had a fire pit going.", "title": "It's SUPPOSED to be rustic!!", "helpfulness": 1, "user": "grollett", "date": "September 1, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 39525396}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "We were looking for a clean, casual, reasonably-priced, place to stay and the Virginian Resort did not disappoint. When we arrived with our friends and their dog, we were immediately greeted with coffee by the friendly property manager. Our log-cabin style room was basic but very clean. If we hadn't known it was a \"pet-friendly\" room we never would have guessed. Our room faced the river and we had a picnic table outside that provided a great place for us to grill, enjoy a glass of wine, and play cards after a day of hiking.", "title": "best deal in the valley", "user": "oldnumber9", "date": "July 6, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 34058841}, {"rating": 1.0, "title": "Don't get suckered because it looks nice and cabin-y from the road.", "text": "For anyone looking for a high-end hotel experiencee or lodging with all the modern conveniences this is probably the wrong place to stay. The atmosphere is a lot like spending the weekend at the family cabin on the lake.", "user": "lostleaf", "date": "May 19, 2009", "id": 30312947}], "location": {"country": "United States", "city": "Winthrop"}, "variance": {"poor": 9, "average": 8, "very good": 12, "terrible": 5, "excellent": 3}, "aka": "The Virginian Hotel", "slim_ranking": 0.6, "description": "Under new management since 2009"}