{"user_rating": 4.5, "review_count": 247, "name": "The Pines Lodge, A RockResort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We had a perfect 3 day and night ski vacation at Beaver Creek and The Pines Lodge. This was our second stay at a Rock Resort; the first having been the Lodge at Vail. At Rock Resorts, they do a lot of little things that make for a very enjoyable stay. Valet parking by very friendly and helpful staff, a concierge who handled dinner reservations exactly as requested, a small ski shop that stored our skis at the end of each day, a small but perfectly charming pool and hot tub with beautiful views, an exellent on-site restaurant for breakfast every morning with an assortment of daily newspapers, very efficient turndown service every night before bed, boot warmers in the room to dry your skiboots at the end of the day and even a small humidifier in the room to use at night. We stayed in a beautiful King Deluxe room, which was perfectly suited for a ski lodge, with pine finishings, french doors to a step-out balcony and a beautiful view of the mountains. The room was quite large, with lots of built-in storage and a very comfortable kingsize bed. Our only complaint. The doors between the rooms are far too thin, making noise between the rooms a definite annoyance.", "title": "A lot of little things done right", "helpfulness": 3, "user": "prose01", "date": "April 9, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7300308}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "The charm and appeal of The Pines Lodge is its ability to offer a full service and personable stay without the size and anonymity of most larger hotels. We would highly recommend this hotel for anyone seeking the perfect ski holiday.", "title": "Stayed here twice, never again", "helpfulness": 3, "user": "Beatentraveler", "date": "March 14, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 7162474, "likes": {"liked": "— The staff was generally friendly", "disliked": "— The cheap design of the facility"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "This is our second time staying at The Pines. I have no idea how Conde Nast and others have rated this a luxury resort. The staff is in fact pleasant except in the overrated dining room. We had stayed 3 nights at the Park Hyatt which is also overpriced although somewhat worth the money but could not extend our stay for a fourth night. Therefore we were forced to move to the Pines for our final evening in Beaver Creek.", "title": "Phenomenal experience at The Pines!!!", "helpfulness": 6, "user": "mtlongon", "date": "March 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7147779, "likes": {"liked": "— Views, Room, Staff", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "I had made reservations at the restaurant where they insisted on a credit card to hold the reservation. I mentioned we would be staying at the Hotel and they could care less; how tacky. When making the dinner reservation I told them we did not want to sit in the bar but in the main dining room. You guessed it, we were led directly to the bar. When I complained they said that was all they could do, our desserts were comped but I would have rather sat in the dining room.", "title": "Good Overall Experience!!!", "helpfulness": 4, "user": "phiflyers", "date": "January 3, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 6546837, "likes": {"liked": "— The location in proximity to the mountain.", "disliked": "— The price paid for the size of the room."}}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 12, "average": 12, "very good": 58, "terrible": 3, "excellent": 162}, "aka": "The Pines Lodge, a Rock Hotel Beaver Creek", "slim_ranking": 0.047619047619, "description": "Slope side at Beaver Creek, The Pines Lodge is a luxurious yet intimate lodge that features ski-in access, exceptional accommodations, and remarkable views throughout the year. Nestled between aspens and pines and overlooking the majestic beauty of The Rockies, The Pines Lodge offers the luxury ski resort experience of a lifetime. While staying at The Pines Lodge you, your guests, and your family will be mere steps away from the ski slopes and the Grouse Mountain Grill, a AAA Four Diamond Award-winning restaurant, where you’ll be treated to some of the finest fare in all of Colorado.The Pines Lodge was recently awarded the #3 in Top Resort in the Continental United States by the 2012 Travel + Leisure World's Best Awards readers survey."}