{"user_rating": 4.0, "review_count": 2196, "name": "The Westin Resort & Casino, Aruba", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Let me start off with the fact that my husband and I stayed at the Westin in Saint Maarten and fell in love with the hotel and its staff. We were sooooo excited to stay at the Westin again...maybe our expectations were too high. Our first room did smell like mildew, so they changed our room. That was nice. We asked to be upgraded but it was a no go, they said they were too booked (we are starwood members). I am a little annoyed as I write this and see that someone else was upgraded. Regardless, bed and shower were amazing. Pool was nice, beach is beautiful. When we arrived, unlike other guests, we did not receive the activity guide. Luckily, we bumped into a lady on the beach who told us how to get a hut so we could have some shade. The towel lady has absolutely no customer service and the concierge was not that great either. My husband tried to book a trip on the Black Pearl and concierge said they were not allowed to assist because they could only book through De Palm. Do you work for the hotel or De Palm a total conflict of interest!!! Do not eat at Cafe Baci $20 all you can eat pizza and pasta, it was disgusting!!! I read reviews about this Chef Sebastian but he must be in Italy for the month of August and he clearly did not leave his recIpes. During our stay the elevator broke so they gave out some free food which was gobbled up in about 45 minutes they needed to replace some of the food. Also on the beach there are like no servers, only 1-2, they need like 10 people out there to see if people want food or drink. Overall, I think they are understaffed. We will not stay there again if we return to Aruba.", "title": "Not the Westin's best", "helpfulness": 2, "user": "littledphie", "date": "August 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 171968816}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "My family and I stayed at the Westin for a week in July for my cousins wedding. We were a group of 35-40 people staying at the hotel, where the wedding and reception were also held. Location is decent, pool mediocre (no swim up bar as some of the other properties along Palm Beach) The process and price for the Palpalas ridiculous, such a raquet.", "title": "Hotel Lacking/Customer Service Not", "helpfulness": 2, "user": "Lauren D", "date": "August 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 171924821}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "There seems to be a cavern in which all communications fall. The arrangements for family in the wedding party , though guarateed by the wedding planner were not what was promised upon arrival. Not much was done to correct this. We reserved a one bedroom suite.", "title": "Lovely vacation. Will definitely be back!!", "helpfulness": 1, "user": "lalena88", "date": "August 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 171818516}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "On my first night in the room there were huge puddles underneath our bed, the T.V. did not work in the bedroom, and the promised oceanview suite was not that . But ,this is not as dangerous as sitting on the balcony on the 18th floor, going to return to the room & have the handle snap off in your hands. Luckily my husband had been inside the room at that time. Scarier still, an employee said it was the 3rd time it happened that week, this is a highrise hotel folks ! Things were fixed the next day, I believe due to the excellent customer service I received from the front desk associate Dany Nieto. Dany seemed appropriately appalled by the very dangerouse situation we were put in. I ran into Dany off site from the hotel at a wedding event, and he approached both my husband & I on his free time to let us know where everything stood. The wedding planner was also responsive, but we felt that her hands were tied with the unfulfilled promises made at booking, and not followed thru with by the Hotel Management . Westin, these were the only stars in our stay with you. I hope you realize the value of these associates, it is their performances that lent any help to this review.", "title": "Nice bed!", "helpfulness": 2, "user": "Nancy M", "date": "August 10, 2013", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 171649948}, {"rating": 5.0, "title": "Fantastic hotel", "text": "My family and I stayed at the Westin in Aruba for a week and we had an absolutely amazing time. I was a bit concerned staying there because of some of the reviews I read, but we were pleasantly surprised. ROOM/SERVICE: We are SPG platinum members and as soon as we arrived we were upgraded to a junior suit. The room was nice and clean, no mildew smell as other reviews suggested (we were in room 1200, which had 2 balconies and the best ocean view). The room was cleaned well everyday and yes there may have been a chip on the tile floor and some chips in the paint on the wall but that definitely didn’t out way all of the positives with our stay. Other reviews mentioned the hotel’s elevators being slow. This was true and in fact one day the hotel’s elevators went down for a few hours forcing everyone to used the service elevators, or if you didn’t want to wait take the stairs. The hotel made up for this inconvenience by giving each guest a personal letter apologizing for the incident, as well as extending happy hour by another hour the next day, making it 3 hour. They also handed out free hors d’oeuvres during the happy hour and also passed out coupons for a $50 credit that could be used at the hotel casino. The hotel definitely did their job and made up for the elevator issue. If possible definitely request a room not facing the Riu so that you can get an ocean view. BEACH: The beach was great and very clean. We never rented the palapas but we placed our chair under the trees on the left side of the beach (when facing the ocean) for shade. POOL: The pool was nice, but since it is very windy in Aruba, there may be a lot of leaves in the pool depending on the day. Also some of the cushions on the pool area beach chair were a bit gross since if someone was sitting there before you the cushions would be wet, therefore thet definitely needed to be covered with a towel before sitting down. FOOD: We ate at The Terrace almost everyday for lunch, since it was so convenient being so close to the beach. The food was good and they had decent prices, $13-$15 for a sandwich/ burger with fries, and a bit more for a full meal. We also ate at Café Baci at the hotel on our first night. We arrived late and weren’t that hungry so we just grabbed a few appetizers (the food and service was good. We never ate breakfast at the hotel, it was too expensive for what they were offering ($14 for continental breakfast). If you want a good breakfast I would suggest going to a place down the street called 5 burgers. They have eggs, toast and coffee combo starting at $4.99 and they have everything else including pancakes, french toast, bacon, sausage and breakfast potatoes. The owner is very nice and friendly and will greet you warmly everyday. It is about 5 minute walk from the hotel in the direction of the Riu. I would definitely suggest going to Amore Mio Pizzeria. The food and service was so amazing there we ate there twice on our trip. They serve gourmet style pizzas and you can definitely share 1 pizza and an appetizer for 2 people. Amore Mio is a definite must. Also right beside the Pizzeria is a Gelato place called Gelatissimo. They had amazingly delicious and fresh gelato flavors and without fail we went there every night after dinner. One more suggestion if you are interested in going into town you can take the bus for $2.25 or if you are more people it is better and cheaper to take a taxi which was $11 to go into town. When we went into town we ate at Iguana joes, which was sports bar type food with a Caribbean twist, everything we ate there was great. All in all I had a great vacation, as other reviews said, it may not be the Westin's best property around the world,but we had a great experience there and i would definitely return to the Westin Aruba.", "user": "dpgesq97", "date": "August 10, 2013", "id": 171622047}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We just returned from a week in Aruba and the Westin was the perfect choice for my family. from the moment we arrived we were welcomed by the staff and began to enjoy our stay. Check in was seemless and our room was perfect.", "title": "If you want a great vacation then stay at the Westin", "helpfulness": 1, "user": "Peter f", "date": "August 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170324974}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "The beach was clean and you never felt overcrowded. if you wanted a quiet space you could find one and if you wanted a game of volleyball you could find that as well.", "title": "Nice hotel, need customer service training", "helpfulness": 4, "user": "DJWalker27", "date": "July 31, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 170150564}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "The pool was the same, large enough to float around and not worry about bumping into anyone.", "title": "Best vacation ever!", "user": "Jill M", "date": "July 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170128037}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Lounge chairs were accessible, and the staff was more than happy to set you up with a few more if/as needed.", "title": "Needs improvement", "helpfulness": 1, "user": "Amanda M", "date": "July 30, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 170040998}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Some people in past reviews made mention of slow elevators, but we did not find this to be an issue. I have travelled to enough hotels to know that at particualr times(breakfast and dinner) you are apt to have to wait for an elevator at times. in the entire time of our stay we must have used the elevators 50 times, and i would say there was one there within 30 seconds or less about 90% of the time, so this is NO ISSUE.", "title": "What a surprise!", "helpfulness": 1, "user": "beaniecoll", "date": "July 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170027525}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "It is big and it is a Westin. The beach is terrific. The beds are the best in business. We have two rooms and as SPG Gold both were upgraded and are spacious and comfortable. Regular guest rooms lack a refrigerator Our upgraded suite has one but no microwave probably because there are so many on property restaurants. Staff is friendly and helpful - expect good service worthy of a world wide chain. For example, our rooms were not ready at 2:45 for check-in and we were given a generous lunch voucher. Travelers wanting Starpoints, excellent beach, good location, service, and comfort should consider Westin. Guests are mixed internationally, family, couples, groups, and party seekers. Westin style luxury with some sexy thrown in.", "title": "Hey, It's a Westin", "helpfulness": 1, "user": "DrSGPrice", "date": "August 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172205625}, {"rating": 3.0, "title": "Overall 3.5 stars. Some good some bad", "text": "Hotel outside looked old and needed paint. Could use an upgrade on paint and carpet. Pretty decent shape but not for a Westin. I have to say that the pool area and beach were great and clean. Our room was big and comfortable and the partial ocean view was excellent!!! I just felt like the hotel was comparable to an old hotel in Panama City Beach or Myrtle Beach. The Aruba Ocean though made up for that. Wow beautiful beach. Location was pretty good too. Go out walk 700 yards and you are at all the best places to eat. Going to beach or pool your first day very frustrating because all the umbrellas have been sold or given away the day before so there is no chance to get shade first day. Nice lady filled us in on how to get one free by waiting in line day before at 3. Not that bad to do this but I ended up paying for our spot. Service was okay. More nice people then indifferent people but close. We enjoyed our visit because Aruba is so safe and you can walk around most places and that was so fun. We will visit again but will probably stay elsewhere and pay a little more to be away from crowd even in the off season. Recommend room service breakfast bc its cheaper and you don't have to fight crazy lines at the breakfast place. You get same food just not all you can eat. Elevators were very very slow so if you stay here you will want to be on a lower floor so your wait is not as long and I do mean long waits for the elevators. Weird.", "helpfulness": 1, "user": "John H", "date": "August 14, 2013", "id": 172177837}, {"rating": 2.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "My family and I stayed at the Westing this past April for my cousins wedding and it was definitely not what we expected(especially for the price of this hotel). First they gave us a room on a lower level floor(if I remember correctly it was on the 4th floor) and it had a really bad mildew smell. We went back down to the front desk and they gave us a room on the 11th floor while there was slightly less odor it still smelled like mildew, at that point I didn't want to back down and complain again. You basically have to keep the A/C at about 60-65 to minimize the mildew smell and we all ended up sick at the end of our stay and went back home with a horrible nasal congestion. The only good thing about the room was the bed, it was very comfortable. The last night(or maybe it was the morning before, I can't remember correctly) before check-out they slipped the final bill under our room door and we learned we were being charged all sorts of extra fees, from the daily maid cleaning(we didn't even get our room cleaned every day while we were there) to the bellhop(we took our own luggages to our room). We went to the front desk to speak to someone and they told us these were fees we had agreed to upon check-in and had signed a contract. I stated that upon check-in I never was told of these fees, nor was I given anything stating these fees would be applied and that I had never even signed a contract with the hotel(I booked through the wedding planner, and she never informed me of these fees as well). I asked them to show me the contract, which of course didn't exist. At this point I was so upset and asked to speak to a manager, the front desk person went to a back room and came back a few minutes later(the manager didn't even show) he said the charges would be taken off our bill. Good thing we payed cash for our stay and we didn't have to deal with credit card charges. We've traveled to many different places(a lot less expensive than the Westin) and we've always been very satisfied but we left with a very bad taste from our experience here. The Westin just doesn't cut it(I'm still wondering where they have the 480+ heavenly guest rooms they claim on their website), we definitely wouldn't stay here again and wouldn't recommend it to friends and family.", "title": "Not Impressed", "helpfulness": 2, "user": "KIG13", "date": "August 13, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 3.0}, "id": 172122737}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "What would otherwise have been a pleasant stay was by an issue I am currently trying to resolve with the hotel. The hotel staff was a mixed bag, some went out of there way to assist and others didn't have a clue as to what they were doing. I was charged for my room twice despite me telling the lady at the front desk my room was already paid for.", "title": "It was almost great.", "user": "cancun123455870", "date": "August 13, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 172117631}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "The rooms were updated, clean and had everything one would need. The pools were well kept and relaxing and the Huts on the beach were perfect to relax under, the location is the best right in the middle of everything.", "title": "Decent hotel, cleanliness/Central beach location", "helpfulness": 1, "user": "OklahomaMomOf3", "date": "August 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 172043398}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We stayed recently at the Westin for 7 nights. We had a great week. Here are some experiences/tips which I hope are useful if you have not been to the hotel:", "title": "Much Better than Expected!", "helpfulness": 2, "user": "SonofBen", "date": "August 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 171598783}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "- At the airport at baggage claim area one can buy 1 bottle of alcohol per person duty free. Go for it since the prices are a bargain!", "title": "Westin vacation", "user": "947Darrell", "date": "August 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171454489}, {"rating": 3.0, "stay_parameters": "Stayed July 2013", "text": "- No hassles at the airport. Taxis are well regulated. 'Short' $25 -$30 trip to the hotel at Palm beach.", "title": "It's just ok", "helpfulness": 3, "user": "DeenaAbbe", "date": "August 3, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 170633565}, {"rating": 3.0, "stay_parameters": "Stayed July 2013", "text": "- Taxis only accept $'s! Throughout the stay we just paid in Dollars. The exchange rate they give is reasonable; not worth the hassle to go to a bank.", "title": "Not Westin's best property....", "helpfulness": 2, "user": "Arnsgrl", "date": "August 3, 2013", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 170607990}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "- The view from our balcony (looking South) was fantastic (see picture).", "title": "Amazing!!", "helpfulness": 2, "user": "Donna P", "date": "August 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170564985}], "location": {"country": "Caribbean", "city": "Palm - Eagle Beach"}, "stars": 4, "variance": {"poor": 140, "average": 369, "very good": 781, "terrible": 74, "excellent": 832}, "aka": "The Westin Resort & Casino, Aruba Hotel Palm/Eagle Beach", "slim_ranking": 0.791666666667, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Located on a beautiful strip of Palm Beach, The Westin Resort & Casino, Aruba features 481 guest rooms and suites for guests looking to sail, deep sea fish, golf, or test out their luck at the casino."}