{"user_rating": 4.0, "review_count": 554, "name": "The Omni Royal Crescent", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "The hotel was very quiet and the staff was friendly. Location was very good. 2 blocks from the French Quarter, Streetcar, and Harrahs. Rooms were a little on the small side. The pool is not much more that a soaking tub. But there is a hot tub and very nice roof top patio. I would stay here again.", "title": "We liked the Omni Royal", "helpfulness": 6, "user": "Hope2CItAll", "date": "June 15, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3558072}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "I stayed at the Onmi Berkshire in Manhattan this spring, and was very excited to stay at another Omni. My room was quite pretty, with large windows, and was booked for only $89 at the hotel website.", "title": "Didn't meet my expectations", "helpfulness": 1, "user": "jelaurenzi", "date": "July 28, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 8247427, "likes": {"liked": "— The location was wonderful"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The front desk was friendly at check-in, and provided me with a city map marked with suggested walking routes on my first afternoon. However, on the first morning, beverage service was late and was only provided for 1 person, not the 2 requested. The cup of coffee was accompanied by packets of non-dairy creamer and sweeteners. I went downstairs and got another coffee from the continental breakfast, and took a milk for the coffees. (The breakfast was more attractive than most, with fruits and cheeses and petits-fours, along with the typical cereals and breads.)", "title": "It's ok, but nothing special !", "helpfulness": 1, "user": "queeni814", "date": "July 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 8076495, "likes": {"liked": "— room rate", "disliked": "— needs to be updated"}}, {"rating": 5.0, "title": "What a find!", "text": "When we came in on the second evening, about 9 pm, I wanted to stop at the desk to get a beverage card for the next morning, but no employee was present in the lobby or behind the desk. We called out \"hello\" a few times, but got no response. We decided to call down from our room phone, but our keys would not work. Back downstairs, and still no employees. We called the hotel on our cell phone, and on about the 15th ring, 2 people emerged. There was no apology or explanation for the inconvenience, but the employees were still friendly. Our keys were reset and we got a beverage card.", "helpfulness": 2, "user": "Apydazes", "date": "September 12, 2005", "id": 3895881}, {"rating": 3.0, "title": "comfortable", "text": "Beverage service the 2nd morning was at the time requested, made for 2 people, and they included liquid cream and creamer. (I wrote a request on our beverage card).", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 14, 2005", "id": 3665343}, {"rating": 4.0, "title": "Loved the value, service was friendly but not accurate", "text": "I wouldn't stay at this hotel again, and if I hadn't had such a wonderful experience at the Berkshire, I wouldn't stay at another Omni.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 13, 2005", "id": 3663820}], "location": {"country": "United States", "city": "New Orleans"}, "stars": 4, "variance": {"poor": 23, "average": 50, "very good": 204, "terrible": 11, "excellent": 266}, "aka": "The Omni Royal Crescent Hotel New Orleans", "slim_ranking": 0.140939597315, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Residential-style Boutique Hotel located in the heart of downtown New Orleans business district, 2 blocks from French Quarter."}