{"user_rating": 4.0, "review_count": 585, "name": "The Pig", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "On arrival to The Pig we were all very impressed by the setting and the building itself. There were 10 of us in all including 4 children,we were shown to the Green room which was also very impressive, which had been booked many months before, a must as it seems to be very popular. We had a very nice young man attending to us for the majority of our time there. We had a set menu with three choices of starter, main and dessert which I consider a little limited but we all managed to choose something. We ordered all three courses at the begining, a little odd as one would normally peruse the dessert menu upon completion of the main but not a problem to us. There was a slight mix up with the wine as we had ordered a sparkling wine to come first so we could make a toast being a celebration but the other wines came first, very quickly sorted out though. We all enjoyed our food without feeling too rushed. At the end of the meal we had arranged a birthday cake to be brought in which was a great surprise to my mother whose birthday it was. We enjoyed this with plentiful cafetiers of coffee. After this we all decided we needed a little fresh air so we headed outside and looked around the gardens, kitchen garden and animal enclosures which the children thought was great. All in all we all we had a great afternoon at The Pig, even though it is a tad on the expensive side it is worth it for the quality of the food and the service. Great place if your celebrating.", "title": "A very enjoyable celebration lunch", "helpfulness": 1, "user": "minkey_8", "date": "September 15, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 177215762}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "There’s an old saying about going from the sublime to the ridiculous. That doesn’t quite fit our experience of The Pig – it’s a case of the sublime to pockets of the sub-standard.", "title": "From the sublime to the sub-standard", "helpfulness": 2, "user": "DenLaz", "date": "September 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 177099284}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "First the sublime. An idyllic setting. Superb food served for dinner in the evening, accompanied by first class service. Add to this, excellent service in the bar for pre-dinner drinks, with a good range of premium quality brands.", "title": "Outstanding!", "helpfulness": 1, "user": "Simon L", "date": "September 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177045585}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "But then, the problems. The Pig claims it’s a restaurant with rooms. The Times featured it as being family friendly, which many other organisations also pick up on, such as Baby Friendly Boltholes which describes the Pig as a boutique hotel and gastro pub, which – no surprises - is a “baby friendly bolthole”. And therein lay the problems.", "title": "Indulgent 24 hours in a very relaxing environment", "helpfulness": 1, "user": "SingaporeRedDot", "date": "September 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 176965987}, {"rating": 1.0, "title": "Didn't get passed the booking!", "text": "Check-in: Check-in time is 3 pm. We arrived at 3.20 to find our room was not ready – problem 1. We were told it would be ready in 20 minutes and they would come and collect us. We were shown to the library and told we would be given a complimentary tea and coffee while waiting, but 15 minutes later, it had not arrived, and we had to chase service – problem 2. At 4.15 pm, 55 minutes after arrival, nobody had contacted us, so we inquired at reception to be told that indeed our room was now ready – problem 3. We were told that our luggage would be delivered in advance to our room, but that proved not to be the case and the receptionist that showed us to our room had to make two trips, because our luggage had not been labelled properly – problem 4.", "helpfulness": 1, "user": "AGreen34", "date": "September 11, 2013", "id": 176734578}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "I had visited The Pig during its renovation and was disappointed I could not stay as it was still in full swing with builders.", "title": "Spot on", "helpfulness": 1, "user": "DuquesaLondon", "date": "August 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174512331}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Having seen the location, I promised I would return. So glad I did. From the booking onwards it was \"SPOT ON\" in all respects. The welcome at the reception was polite, friendly and professional. Not all places can get all three correct at the same time.", "title": "Wonderful gem of a place", "user": "vwalms", "date": "August 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 174456734}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "we took a tour of the gardens where all the Vegetables and herbs are grown, it was beautiful. The gardens the lawn and surroundings of the hotel immaculate.", "title": "Rest, relax and unwind in beautiful surroundings.", "user": "Robyn B", "date": "August 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 174445405}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "We were early and chose to leave our personal things with reception and return later in the afternoon. When we returned all our things were already in the room. so no need to waste any time.", "title": "Wow! What a great place!", "helpfulness": 1, "user": "jaxmorgan", "date": "August 26, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 174186887}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The room lovely, spacious very well decorated with its own outside area.", "title": "Simply the best", "helpfulness": 4, "user": "richard d", "date": "August 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174053404}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Stayed here for 1 night, room very comfy, food excellent with most food home growm from kitchen garden and hotel in lovly surroundings. Will most definately stay here again. Lovly comfy bar and lounge and snacks can be eaten in conservatory, friendly welcome.", "title": "\"excellent home cooked food\"", "user": "pamela b", "date": "September 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 175762635}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "We live in the New Forest and visit the Pig regularly. The place has so got it right, it is truly unique. The decoration is inspired and original, the staff welcoming and friendly. They have log fires whenever it is a little on the chilly side. We visit just for a bottle of wine by the fire as well as for lunch, for dinner and for flat breads in the courtyard, yes we love this place! We are vegetarian and are glad to see the vegetarian menu developing! As there are no veggie wine bites we have the chips in a flower pot which are Devine! We love everything about this place and The Pig in the Wall and Limewood........", "title": "Not to be missed!", "user": "VictoriaCarole", "date": "September 1, 2013", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "service": 5.0}, "id": 175137470}, {"rating": 5.0, "title": "We love this place!", "text": "Our second visit to this great little place and definitely not our last! Very relaxed, great location and incredibly homely. We have eaten dinner in the restaurant, had flat breads in the court yard, drinks in the bar and breakfast in the stunning kitchen garden style conservatory, all of which are well presented, tasty and don't break the bank. This time round we had dinner at the Limewood, about 10 minutes drive away, which we would highly recommend. Looking forward to returning, planning a visit this winter to see just how cosy they can make it! The New Forest is on your door step and its great to know that you can return to The Pig as a perfect home away from home.", "user": "Fortheloveoftravel10", "date": "August 31, 2013", "id": 174970649}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We had a wonderfully relaxed short break here during the summer holidays. Family room/suite (Old Spot) was superb, plenty of space and privacy for everyone. Grounds are great, with croquet and boules on the lawn to keep the little ones occupied. Lovely relaxed bar and drawing room. The food in the restaurant was mostly excellent, breakfast could be slicker - mispriced twice (though amended without fuss when queried) and painfully long wait for cooked items at times - it really can't take 30 minutes to rustle up scrambled eggs. Wine list contains some gems, but is almost impossible to decipher, being arranged apparently at random, without reference to price, country, style, alphabet....!", "title": "Excellent", "helpfulness": 1, "user": "sandy_abstentia", "date": "August 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 174780444}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Nonetheless wholly recommended and would like to try it again for a cosy winter weekend", "title": "Wonderful stay but the room was very warm", "user": "beckki", "date": "August 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 174634591}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "Four of us went for lunch, one a repeat customer from Studland way. Service from all the young staff was friendly and efficient but not over obtrusive. We were told they were all part of one happy family and their obvious exuberance shone through. The food was good and unusual in parts and subtle. The menu was a 25 mile menu which meant everything was sourced within 25 miles. Most original. The kitchen garden (where the vegetables come from) was amazing and well worth a visit. We can't wait for them to open their Pig on the Beach in Studland next spring.", "title": "Fun lunch", "helpfulness": 1, "user": "TimPamRay", "date": "September 8, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0}, "id": 176360052}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "The Pig was the most wonderful night away from it all. We had the best weather but I think it would be great to snuggle up in front of the fire with a brandy or hot chocolate. The rooms were so cosy. The food was great. The atmosphere is friendly and welcoming. I could have stayed in the hammock all day and night. I look forward to going back in the winter some night. Not cheap when it all added up but it was worth it.", "title": "Bliss!", "user": "BRIGHTONBLONDE", "date": "September 5, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 175890921}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The Pig in the New Forest was beautiful but well over priced. We spent £800 in two nights for two of us; 1 lunch, 2 breakfasts and 2 evening meals (only two bottles of wine plus a few other drinks) - the rooms were well presented with good showers but really nothing special and small - certainly not worth the £190 / night excluding breakfast and the drinks were generally also very overpriced. Oh yes, and for some bizarre reason they give you what they describe as an extra large towel to share between 2 - looked like a normal bath towel to us - 2 people need 2 towels please! Service too pushy / overly attentive - there is a balance between being ignored and smothering your guests. The staff appeared to be too busy trying to follow a process and push you through the restaurant rather than delivering a personal service - and at times they simply did not listen e.g. on the second night having been pushed through on the first night we asked not to be asked to our table until the food was ready ... completely ignored. However on the up side, the food on the whole was very good, great kitchen garden, non-alcholic cocktails were delicious and the setting was lovely. In summary we felt that they were milking the money out of it the whole 'Pig' thing. Glad we went, love The New Forest but would not go back to the Pig.", "title": "Two Night Stay - Overpriced & too Processed", "helpfulness": 1, "user": "WineBore2013", "date": "September 5, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 175851049}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "I reviewed this hotel a couple of years ago when we went there for lunch to celebrate my husband's Birthday. This time, we went for mine and spent the night there after a delicious dinner, leaving after an equally good breakfast. We had a courtyard room which is described as \"comfy deluxe\" so I expected a small room. I was therefore delighted to discover it was nothing of the sort! The bedroom area had a desk, fireplace, large comfy bed (although a bit creaky, like the floorboards!), cabinet containing a mini bar and Nespresso coffee machine and of course a television. This led through to a dressing area with a large wardrobe and chest of drawers. The bathroom was really big with \"his and hers\" sinks, large shower and free standing bath. Very comfortable with everything one would need. As the weather was so lovely, we ate outside on the terrace and as before, the staff were very attentive and friendly. After dinner, we sat in the back courtyard where there was a log fire and heaters in the biggest umbrella I have ever seen! Overall, this is a great place to go for a mini break with a comfortable room, good service and fantastic food. I have given 4 out of 5 merely because there is always room for improvement and in this case my only small niggle would be that it would be good to have reading lights by the bed that don't disturb your partner. That is of course a tiny niggle and in no way detracts from what was a very enjoyable stay. We will be back!", "title": "Relaxing and casual stay in the New Forest", "user": "LynneGosport", "date": "September 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 175844654}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Yes there if definitely a theme here. You will love this old hunting Lodge, which is beautifully shabby chic.", "title": "Go the whole HOG - they do", "user": "Hereford59", "date": "September 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175839640}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 33, "average": 83, "very good": 156, "terrible": 22, "excellent": 291}, "aka": "The Pig Hotel", "slim_ranking": 0.7, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "The Pig is the baby sister of Lime Wood – with a little attitude! It is a bang up to date take on a new style of home grown, 26 bedroom country house hotel and what that needs to be today - original, relaxed and sitting comfortably within its environment.......It’s really a restaurant with rooms. This is a place that is all about the walled garden.... everything is driven by the gardener/forager and chef – they grow and find the food – the chef then makes the menu. Our style is home grown in every way – breaking the mold of designed hotels, daring to be comfortable in its own skin, working with what it has and recognising what is good about that. It won’t be perfect, it will be warm, relaxed, comfy, interesting, and homely with muted colours, a bit shabby chic and evolved rather than interior designed."}