{"user_rating": 4.0, "review_count": 423, "name": "The Founders Inn and Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "Booked this through priceline for $60 for one night. In town for funeral. We had a king room very clean and roomy. The bed was very comfortable slept well. I did use the fitness center and it was also very large and clean. Would stay here again. The only think I didn't like was the $11.00 charge for two bottles of water and inernet that wasn't an option added to our bill when we checked in. Overall a good night.", "title": "One night stay very nice.", "helpfulness": 1, "user": "AHLMOM", "date": "April 12, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 127750170}, {"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "The staff was great and pleasantly proactive. I was often asked if i needed help and I was always greeted with a smile. Food was excellent! Definately try the meatloaf! Beds were comfy. The hotel decor wasn't thrilling. I just can't get into the old country/colonial look. The $11 fee per day should just be added in the price of the room upfront. My husband booked the room on Priceline and didn't notice anything about the fee. Because I read these reviews I was aware. At any rate, it seems sneaky. Being charged that per day can get expensive. I'd prefer the option to purchase wifi if I need it and I can purchase my own water in the vending machine. At the end of the day, I'd pay the fee again but I don't like getting surprises during check out......unless it's a discount.", "title": "Enjoyed my stay!", "user": "On2thenex", "date": "April 11, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 127669138}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "I recently stayed the weekend at The Founders Inn to prepare for my wedding there! We could have not selected any where else that was perfect! Everyone was supportive and helpful to us! We felt truly thankful to have had such wonderful people, especially Lisa, to make this special day in our lives great! We hope to come back for our first anniversary to stay! Thank you for one of the best weekends with our family and friends!", "title": "Great Experience", "user": "sheshe2u", "date": "April 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127635816}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The good parts are: the property is in very good repair; everything is clean; the restaurants are adequate; the staff really tries hard. If you are worried about the creepiness of the religious right just next door, there is no sign of it here.", "title": "We will return", "helpfulness": 1, "user": "Tedgo", "date": "April 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 127435879}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We went on a getaway package (night, breakfast, massage) which was a good deal and as we live nearby will do it again.", "title": "Impressed Beyond Expectations!", "user": "PJones2012", "date": "April 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127387506}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We found this hotel to be very clean and well maintained. We had a great 42 inch flat screen TV, a refrigerator and real glasses to drink out of. It was colonial style and very nicely decorated. Our paperwork said they may charge an additional $15.00 per room resort fee when we got there above what we paid to Hotwire, but we were happily surprised when they did not. This made the difference on how we felt about the resort and Hotwire. Breakfast did not come with the room. Unlike other reviews that we read on this hotel, we found all of the staff to be very friendly and helpful. One guy helped us with their unusual key system and the lady at the front desk printed out menus for us and gave us printed directions to the beach. The beach was 25 minutes away. Our sleep experience was good here, though I prefer a firmer mattress.", "title": "Nice Property Above Average Room", "user": "meeta4", "date": "April 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 127271538}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We had a lovely room - except the bathroom was atrocious. The hotel's ground floor was majestic - except the entire second floor was closed due to maintenance work and the toxic fumes made breathing difficult. The sprawling garden surrounding the hotel is pleasing - except it is overwhelmed by highway noise. There is an appealing spa - but even if you are a guest at the hotel you can't use it for free. The only unqualified thumbs up I'd give is for the restaurant. The food was delicious, much like the food in Williamsburg, another example of how southern cooking is superior to the \"nouveau cuisine\" in the north. With a bit more work this place could be quite a gem, especially considering that there is nothing like it in the Norfolk area.", "title": "Yes and No", "helpfulness": 1, "user": "bkrider9", "date": "March 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 127018397}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Found this place after finding a Groupon for about half price for a standard queen. When booking my reservation they no longer had any standard rooms available, so I upgraded to a king suite for $50 more. We checked in around 8:30 am on Saturday; check-in was a breeze. We got to our room which was well kept and had a gas fireplace which made the room feel wonderful-then hurried off to try the breakfast. (Which was absolutely delightful-at $15 a plate) Soon after we left to Busch Gardens, we returned around 7pm and started to get comfortable in the room. We turned on the fireplace but after using it twice it all of a sudden no longer worked. I called the front desk who transferred me to the maintenance department-who didn't answer. We decided to let it be.", "title": "Nice stay, a couple of issues.", "helpfulness": 2, "user": "Wherethecorpssendsus", "date": "March 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 126643701}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "I have horrible allergies in the spring and cannot breathe well in my sleep without the temperature being below 70, so I turned the A/C down to 60 and drifted off. I woke up around midnight not being able to sleep. I was so hot I was almost sweating. I checked the A/C to see if possibly my husband had changed the thermostat, however it was still set to 60. It was more than 70 degrees in the room. I tried to go back to sleep but my allergies kept me up so my husband called the front desk and gave us the option of switching to a standard-which we did; she even gave us a complimentary breakfast for our troubles.", "title": "\"A Little Heaven On Earth\"", "user": "Deborah S", "date": "March 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126386183}, {"rating": 1.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Around 2am we got to the other room. The A/C worked fine so we settled down for bed. I slept comfortably through the night. When we woke up the bill had been slipped under the door which accurately listed the king room price taken off. Had the buffet once again and it was wonderful. Check-out was quick and easy.", "title": "Don't stay here!!", "helpfulness": 5, "user": "Tim K", "date": "March 19, 2012", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 126365230}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We booked this through an online special and were so pleased. The rooms, though not big, were lovely. Very comfy beds and very quiet. The staff was very helpful and friendly. The grounds are gorgeous!", "title": "What a wonderful place to stay!", "user": "Malcolmsmom", "date": "May 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129209545}, {"rating": 3.0, "stay_parameters": "Stayed April 2012", "text": "Although we didn't get a chance to take advantage of the spa area it seems wonderful. The best part was the dinner! The night we were there they had a pasta buffet where you could choose your ingredients and they prepare it for you. Superb!", "title": "Ok but not worth the price...a bit disappointed overall", "helpfulness": 1, "user": "Emoore217", "date": "April 29, 2012", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 129035445}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "There's nothing bad we found here and would gladly return for a longer stay.", "title": "Overall Very, Very Nice...", "user": "Halla74", "date": "April 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128221341}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Stayed for a night with a Spa package...overall I understand the prestige of the colonial feel but I still feel like it deserves some updates and service did not feel like a five star resort. Dirty carpets, food on the floor in hallways, many foul odors throughout the property. On a positive note, the spa was great; no complaints at all from our spa package. Would recommend going with a high end bed n breakfast on the beach next time or just sticking with a Marriott.", "title": "Like it better than Courtyard", "user": "Tellme S", "date": "April 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 128174152}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The Founders Inn and Spa has alot to offer. I stayed here for a week after relocating to VA Beach for a new job. The rooms are HUGE and CLEAN, which I appreciated. The TV in my room was a very large LCD set with a great picture. The furniture was sufficient to house my clothing, my only wish for improvement was the desk in the room was a bit small. The bed was OK, I would have preferred it a little firmer. The pillows were a bit soft too, but not a showstopper.", "title": "under par", "helpfulness": 2, "user": "worldtraveler_1037", "date": "April 17, 2012", "detail_rating": {"service": 3.0}, "id": 128089540}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Nestled front and center on the lovely campus of Regent's University, the Founders Inn met and exceeded every expectation. The staff was very professional, yet friendly and appropriately engaged in making our stay pleasant. The room was tastefully decorated in \"Virginia Traditional\" and the halls were clean and quiet.", "title": "A hidden gem", "user": "nigel'smom", "date": "March 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 126300216}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We were looking for a quiet and relaxing visit, with time to visit the beach and enjoy a bit of couple time. We travel (almost always) with our two terriers, and the staff put us as close as possible to the pet exercise area on the first floor. Since this was at the end of a hallway with an outside exit close by, it made the trip even more relaxing...no long trips down multiple hallways if we had to make a quick dash outside!", "title": "Pretty Venue, Ugly Price", "helpfulness": 3, "user": "Tylerml", "date": "March 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 125799895}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Because we were not right \"at\" the beach, we saw a bit more of the town and surroundings than we would have at one of the major hotels right on the beach. Had lunch in a local fish place, but ate our dinner and breakfast at the hotel.", "title": "Excellent!!", "helpfulness": 1, "user": "BM7", "date": "March 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125766847}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "All in all, a lovely experience at a great little hotel.", "title": "Interesting concept of a conference center vs weekend place", "user": "Katherine B", "date": "March 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 125638204}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Upon arrival at the Founders Inn, we were so thrilled. The outside of the Inn is lovely. The gardens are beautiful. When you enter to check in, it is large, the hardwood floors are beautiful and the staff is pretty decent (the women, all of the men besides one really didn't say as much as \"hello\"). We were on the third floor of the main building. The room itself was small and pretty sub-par for the price. The bed was nice and tall and comfy. The television was large, however, we couldn't watch it without pulling in out from the wall (really heavy) because the poles from our huge bed cut the screen in half. The carpet looked old and outdated and the bathroom was super small. The deep windows were pretty nice, though. We got the $99/night deal and stayed for three nights. Our final cost on our check out slip was around $370...however, when i checked my bank account today it was nearly $420? There was also an $11/night facility fee....why? We are already paying $100+ for the hotel, and we had no room service or cleaning what so ever. Same towels every night. Will be contacting someone about this. I would probably not stay here again unless it was free.", "title": "Disappointing. Historic means OLD.", "helpfulness": 3, "user": "RailroadRuth", "date": "March 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 125498380}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "I stayed at this hotel with my family during the Eastern weekend. The Founders Inn and Spa is definitely not a four stars hotel. It might have been at some point of time but, currently, this hotel really needs to get some maintenance work. The hallways and elevators carpets look old and dirty. The room floors are little better but still do not appear to be that clean. The room we stayed was spacious but not that big for a suite. The bed was decent but the sofa bed for the kids could be better. The room was pretty standard overall. The indoor pool was nice and there were clean towels available to the guests. We did not explore the other amenities of the hotel, neither had any meals there.", "title": "Not a four stars hotel", "helpfulness": 1, "user": "Gremio", "date": "May 3, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 129307338}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "The hotel location is pretty bad. The neighborhood doesn't look nice and it is far from the beach. Even using a Groupon coupon, I believe that our stay was still overpriced. I wouldn't go back to this hotel.", "title": "Founders Inn lacking", "helpfulness": 2, "user": "BusinessOwner0513", "date": "May 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 129269928}], "location": {"country": "United States", "city": "Virginia Beach"}, "stars": 3.5, "variance": {"poor": 25, "average": 59, "very good": 118, "terrible": 36, "excellent": 185}, "aka": "The Founders Hotel Virginia Beach", "slim_ranking": 0.210526315789, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}}