{"user_rating": 4.5, "review_count": 2073, "name": "The Westin Kaanapali Ocean Resort Villas", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We just returned from the Westin Kaanapali Villas and I must admit, I was a bit nervous after reading a few TA reviews. We arrived to a bustling entrance where the guard is apparently there for mere decoration, but always gives a friendly wave. We proceeded to the first entrance which is the South. A very helpful drive attendant immediately radioed someone somewhere and found out that we were booked in the North Villas which was comforting since this is the newer building. At the end of the drive, we found a well marked North entrance and were also immediately assisted by friendly valet and bellmen. Check in was a breeze even though it was a busy day (Sat.)", "title": "No Worries!", "helpfulness": 1, "user": "MauiHI", "date": "April 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27207176}, {"rating": 1.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "We found ample parking and our room fairly easily and were pleased to find a parking deck very close our room.", "title": "Way below expectations based on Tripadvisor feedback", "helpfulness": 3, "user": "FamilyoffiveBC", "date": "March 27, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 26903109}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "The room was beautiful, clean, and well equipped for a lengthy stay.....washer/dryer, full size kitchen, two tvs, huge entrance closet, and a large lanai. The furnishings are tastefully Hawaiian and not tacky tapa cloth everywhere. We felt right at home.", "title": "A Wonder in Paradise!", "user": "preciousgemcrystal", "date": "March 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26761254}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "As we ventured out and about, we could see how the property could be confusing, but we marked our trail and payed attention to the well placed signage. The pool was very nice and we particularly enjoyed the coi (koi) fish pond with the abundance of Hawaiian flora. We never had a problem finding a lounge chair and the literature states that after 60 minutes, towels can be removed from the chairs, but I doubt the staff would intervene since they did not pay one bit of attention to all the kids running about and hopping in the jacuzzi. They should just take down the 16 and older signs for the jacuzzi's because this is a joke. The adult pool was too windy and near the grilling area so we dealt with the kids and still enjoyed the pool area each day.", "title": "Very nice resort, devoid of anything Hawaiian...", "helpfulness": 1, "user": "AllisonNNH", "date": "March 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 26589097}, {"rating": 3.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Overall, my impression was one of a well run property with genuinely kind caring staff. We enjoyed our stay and will visit again soon.", "title": "Enjoyed, but needs attention to detail...", "helpfulness": 2, "user": "Illy1108", "date": "March 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 26179843}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "Maui is a hidden Gem and I love it. This property is a Gem if your traveling with kids. If you have kids, is the place to be, except for the fact that kids aren't allowed in the hot tub. Very, very stupid and unreasonable.", "title": "I love the Westin", "helpfulness": 1, "user": "aragon44", "date": "May 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 29270676}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "However, the service won me over. Sonya is the best. I repeat, Sonya is the best. Very helpful, we wanted to change rooms,no problem. Every time we came down to the front desk, she was helpful with everyone. That told me that she treats each customer that same. You can't train customer service.", "title": "Amazing resort, didn't want to leave!", "helpfulness": 1, "user": "LpLoLo", "date": "April 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28527741}, {"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We stayed at the Villas from Mar 19-Mar 28th, 2009 and enjoyed every minute of our stay....the service was excellent, staff ALL extremely friendly and helpful, especially on the front desk and valet/front door staff (we rented road bikes and kept them in their storage area) we got to know the guys pretty well. Only used the concierge service once, but was at the front desk everyday for something or other! mostly to get the business office (2 computers) key ..they were always helpful and smiling. There was no pressure ever about buying property there and it was actually only mentioned once (by the concierge). We used the shuttle service several times to Lahaina and that was great as well, ran once an hour. Taxis to Lahaina are expensive, but we did use taxis as well.", "title": "Housekeeping was poor and not to be trusted!", "helpfulness": 2, "user": "Optoko", "date": "April 21, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 28446690}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We loved the room, clean, spacious, Heavenly bed was so comfy! nice big bathroom with walk in shower and separate toilet room, kitchen with fridge, stove, dishwasher (we didn't use it however!) and a small washer/dryer we did use- fabulous!... (ocean view in bldg 2). They originally put us in bldg 4 with an 'ocean view' of a parking lot! so we were pretty insistent on getting another room and got a similar room in bldg 2 which we loved, overlooking the pool area........Only used the fitness room once as weather was amazing and did lots of power walking and beach walking, as well as some great road rides up to Honalua Bay....", "title": "What a treat!", "helpfulness": 1, "user": "EdmontonKath", "date": "April 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 28438753}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The best best thing for me was power walking early morning on the boardwalk and seeing whales right offshore.....simply amazing, it is so BEAUTIFUL there and all along that boardwalk/beach. Would see people walking along smiling just so happy to be there, you could tell who had just arrived!", "title": "Great Ka'anapali Beach location and resort", "helpfulness": 2, "user": "beachtraveler16", "date": "April 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 28155472}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We went for 11 nights and it cost between $300 to $450 a night for an ocean view (which is a clear view of the ocean in my opinion). The prices are not cheap in the current market conditions. Don’t forget you are paying for a shell not any food etc. Well where do I start I arrived to someone smiling on reception who gave me a key. We walked for nearly 20 minutes to the room and man was it bad. You could see the ocean like a pinprick in the distance and the view was looking over a building site and it was dirty I felt sick. I went back to reception to go through to assistant manager then manager of desk blah blah and after 3 hours of arguing and viewing rooms I got the room I thought I had paid for. The actual manager of the hotel said that the people with he timeshares have the ocean front not ocean view what I had??? I believe in being upfront and that the website should be correct so beware as you dont get what you think your paying for. I feel if you are a guest the staff try to treat you like a second-class citizen but allow you to pay Ritz Carlton prices.", "title": "Beware before you Visit", "helpfulness": 1, "user": "leeabbey", "date": "May 19, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 4.0}, "id": 30318592}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "An \"OWNER\" time share person was rude enough to remove my towels when I went back to my room for 20 minutes to grab lunch when I came back down she told me that I was obviously new and did not know the rules as you can imagine I was not happy. I though I was staying in a 5 star hotel paying for luxury not a 3 star in Spain. To be honest there were to many of the Americans that dont leave America the ones without passports not necessary the most sophisticated. I kept thinking how could they afford this. There were no Europeans and I like Cosmopolitan hotels with all nationalities. The staff in general were ok but the managers had a big attitude problem with a cant do attitude. On the plus side the views were amazing it was like being in Lost the series. The sea was lovely and the hotels had BBQ's that guest could use for free. Once I had sorted my problems I stayed away from reception as did not want to be screwed up the rest of my holiday. Would not recommend the hotel for non owners as its not worth it. Any questions please ask.", "title": "2nd Visit - Won't be back", "helpfulness": 4, "user": "Tigerlight206", "date": "May 18, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 1.0, "rooms": 4.0}, "id": 30187936}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We stayed here last year and found the staff to be less than charming but the rest of the facility quite wonderful. Thanks to a good SPG rate we decided to go back....", "title": "Wonderful hotel", "user": "bking00", "date": "May 7, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 29548738}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We found it about the same - not quite as good as last time actually - and wound up checking out early and into the other Westin (there are TWO Westins on Maui) to complete our vacation. Glad we did.", "title": "You're going to shell out some bucks, but this place is paradise", "helpfulness": 2, "user": "jhawks1510", "date": "May 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29492689}, {"rating": 5.0, "title": "Great Stay- Fabulous location, clean rooms", "text": "A few things have changed for the worse since we last visited the resort.... the food has gotten more expensive (breakfast was about $15 last fall... a decent value for Maui - it's $20 now... and it's the exact same spread) and they've introduced these stupid little \"towel cards\" you must exchange for a towel at the pool. The cards are something else to remember when you go to the pool - chintzy if you ask me. At the other Westin they distribute pool towels the old fashioned way and I appreciated it after fuddling with the cards...", "helpfulness": 2, "user": "azlodaro", "date": "May 4, 2009", "id": 29333603}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "Maui is my favorite Hawaiian Island, and after a week there, I can say the Westin Kaanapali Ocean Resort is an ideal place for families. The pluses are beachfront with ocean views, a cool minimalist design, well appointed suites (all with kitchens, DVD/CD players, bose stereo, washer/dryer), luxurious bathrooms, great clientele (this is not party central), friendly non-obtrusive staff, a small but functional gym, a concierge who can refer you to restaurants and activities, and free shuttle service to the mall (Whaler's Village) for your teenagers. It's not uncommon to see 3 generations travelling together. There is a really nice poolside bar with TVs. People say the pool is chilly, but I didn't find that at all. If you'd like, you can rent you own poolside cabana. The studio suites are an enormous value compared to smaller, older hotel rooms in Kaanapali that don't have kitchens or washer/dryers.", "title": "Westin Kaanapali Villas Take Shape", "helpfulness": 14, "user": "UnbiasedReviewer", "date": "June 30, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 5414067}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "Westin keeps this place IMMACULATE, as they should because they are successfully selling interval ownership units (timeshares) in this resort and its Phase II next door, which is 80% completed. We attended their timeshare presentation, which was professional and informative, without any hard-sell guilt trips. If you're in the market for an interval ownership, Westin is a great operator.", "title": "VERY pleased with the Villas!", "helpfulness": 18, "user": "atfred", "date": "June 24, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5378768}, {"rating": 4.0, "title": "After a rocky start...it was a great stay!", "text": "What's the downside? If you're not paying top dollar, you may only have a sliver of an ocean view, or be looking across the way into another building or into the parking lot, but that's only fair. Freebie upgrades to the best units went out with the 1990's. Currently, you're not within walking distance of shops and restaurants. The on-site general store and restaurant are okay in a pinch, but pricey. There are plans to add more shops and restaurants within walking distance, along with the Phase II Westin Villas and an adjacent condo project. Finally, traffic has become more of an issue in West Maui, but is bearable.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "June 19, 2006", "id": 5361315}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "If you buy here or stay here, I strongly recommend getting out to see other parts of Maui. We toured the volcano in the afternoon and it was great (have breakfast at the Kula Lodge on the way up). Swimming with fish and seeing an occasional sea turtle is something I'll never get tired of (we snorkeled). If you can, spend a night or two in Hana (the hotel Hana-Maui is very romantic and has a nice spa). It's a scenic drive and it's really like visiting another island (have breakfast in the town of Paia and check out the stores on Baldwin Ave.). Stop along the way to check out some of the funky places on the road to Hana. Go to the 7 sacred pools at the state park and the other beaches in Hana, or go horseback riding. Another good excursion is Makena beach in Wailea or the Winery near Wailea; bring a book, a cooler, and have a picnic lunch--heaven. Enjoy your trip!", "title": "Wonderful resort", "helpfulness": 5, "user": "OandO", "date": "June 18, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5357160}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "We, too, read all the reviews and were a little nervous about what to expect. When we arrived, the place was just gorgeous. We loved the lobby, pool area, beach area, garage parking, etc. The staff were so so nice, very laid back, friendly and helpful! Our room, as we expected, faced the construction, but was also an \"ocean view\". We had read on the reviews that some ocean views were just barely that, but ours was such that we could have watched the sun set over the ocean had we stayed in our room at sunset! Beautiful! We could see mountains the other direction, which was a treat as well. The room was immaculate, felt like home with a big kitchen with granite countertops, the truly heavenly bed, tons of room, cozy robes, double-headed shower, etc. We were pleasantly surprised they gave us dish soap, dishwasher powder, Tide and Bounce, paper towels, etc.! As for the construction noise, it wasn't as bad as others have said, but it did start promptly at 7am. They were usually done and gone by 4pm though, and it wasn't bothersome to us at all. The pool was beautiful and yes, it was cool, but what a refreshing dip after sitting in that hot sun. We even played on the water slide (we're in our 30s). The beach was gorgeous and not crowded at all. There were many people snorkeling the reefs just 10 feet offshore behind the hotel. Overall, this place was great, we weren't bothered by a timeshare presentation, and it was clean and comfy. We will definitely return here again in the future... we can't wait to see the new part completed next year!", "title": "Fabulous & Beautiful", "helpfulness": 4, "user": "luv2travel1stclass", "date": "June 15, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5352063}, {"rating": 5.0, "stay_parameters": "Stayed March 2006, traveled as a couple", "text": "We stayed here after having a bad experience at the Ritz in Kapalua. We were lucky to get a room because most of the places are timeshares. When we checked in the staff was wonderful. Our room was absolutely beautiful! We had a kitchenette, huge bathroom and a soaking tub. The bed was super comfy and the location of the hotel was perfect - far enough away from town that we had privacy but close that it was only a 5 minute drive. You cant walk to Lahaina from here, or Kaanapali, but its close enough to take a short cab ride. The beach area is really nice and the pool is great for kids. The restaurant was wonderful, as pricey as any other, but the food was good. There is a great little store on the premise, too. I would definately stay here, in fact, i plan on coming back on my first wedding anniversary - my husband proposed to me on the beach of this resort!", "title": "Must go!!!", "helpfulness": 12, "user": "30yearoldtraveler", "date": "August 2, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5543175, "likes": {"liked": "— All in one - if you didnt want to leave the resort you didnt have to", "disliked": "— some minor construction on the far end, you can only notice it if you are on the road"}}, {"rating": 5.0, "title": "Loved It!", "text": "Just returned from an amazing vacation at the Westin Kaanapali Villas. Had read some mixed reviews but mostly positive ones.", "helpfulness": 8, "user": "viper915", "date": "August 1, 2006", "id": 5537240}, {"rating": 5.0, "title": "buyers beware.", "text": "I guess the main complaint people had was the construction noise of the new phase.", "helpfulness": 13, "user": "Robry", "date": "July 9, 2006", "id": 5441545}, {"rating": 5.0, "title": "Exceeds Expectations!", "text": "We had a one bedroom lock-off villa which is actually a one bedroom unit and a studio unit. Each has a separate entrance but a common foyer. It was in Building 4 and nowhere near the construction. We did not have any construction noise. Parking is free and easily accesible from all buildings. Each building has a concierge in each lobby which is also nice.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "July 6, 2006", "id": 5432833}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "The units were both spacious, extremely clean and beautifully furnished. The staff couldn't have been nicer and the service was superb. We had a couple of things like a burned out light in the bathroom and one t.v. in the bedroom that had bad color and engineering was there 5 minutes from my call to fix the problems.", "title": "Westin KOR", "helpfulness": 11, "user": "Bobk61", "date": "July 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 5428347}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "I just completed a one week stay with my husband, 13 year old son, 11 year old daughter and my mother. We are owners at the Sheraton Vistana Villages in Florida and switched out to this one. We stayed in a two bedroom ocean view lockoff in building 3, 6th floor. Our villa faced the park, parking lot and had a partial view of the ocean. I'll address two recurrent issues in postings:", "title": "Good family vacation spot (info on handicapped access)", "helpfulness": 10, "user": "BlessedandLoved", "date": "June 15, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 5351432}, {"rating": 5.0, "title": "Westin easily exceeds expectations", "text": "THE VIEW: Contrary to the many irritated reveiwers on the site, I did not have any problems with my view and enjoyed spending time on the balcony in the evening.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "June 10, 2006", "id": 5329223}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "CONSTRUCTION: I was not on the construction side. Therefore I would not have been able to tell construction was going on had I not seen the crane when driving up to the property.", "title": "Best Maui Trip Ever-No Regrets on purchase", "helpfulness": 7, "user": "Mariapic", "date": "June 10, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5328988}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "I think both of these issues are VERY overblown unless you are on the construction side.", "title": "Great 2nd time experience", "helpfulness": 14, "user": "oc4", "date": "May 31, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 3.0}, "id": 5236912}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "POSITIVES:", "title": "Loved Maui & Liked Hotel", "helpfulness": 9, "user": "Sue V", "date": "May 30, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 2.0}, "id": 5236327}, {"rating": 3.0, "stay_parameters": "Stayed April 2006, traveled with friends", "text": "Lobby is fantastic - truly wonderful. Too bad the rooms are just \"so-so\". The musty/damp smell was unexpected given the room rates. Beach is TINY - but a great place to snorkel. Breakfast buffet was quite nice - but VERY expensive. Concierge was helpful in scheduling activities.", "title": "Overpriced", "helpfulness": 1, "user": "carlareno", "date": "September 28, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 5883990, "likes": {"liked": "— Lobby was gorgeous. Pool was very nice.", "disliked": "— Pricey given musty rooms! Pool attendants constantly harassed guests to keep out non-guests."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006", "text": "My wife and I just returned from a week at the Westin Ocean Resort and Villas (celebrating our 5th anniversary), not to be confused with the Westin Hotel. I have been reading reviews on here for over 6 months, and I have to admit, I was a little concerned about going. We actually bought a week from a timeshare owner (via ebay) that was not able to use their week (or they just wanted to make some money?). We got a great deal, no where near the listing price on the website of 350-400/night.", "title": "Just returned after reading reviews for over 6 months on here...", "helpfulness": 35, "user": "floridahokie", "date": "September 12, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5793430}, {"rating": 4.0, "title": "Great Stay at Maui Westin Villas 8/17-22", "text": "I called back in February requesting a building on the other side of the construction, as well as an Ocean View room. (Neither were guaranteed) When we landed there was a 2 hr delay getting our car rental, so we weren't going to arrive at the resort until 8pm. I was sure by then that we would be facing the construction, plus not being an actual owner....I was prepared for it. I called to let them know we were going to be late and they were very courteous on the phone.", "helpfulness": 18, "user": "FromPacifica", "date": "August 25, 2006", "id": 5707897}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "To my delight when we arrived, we had building 5 with an Ocean View. I've heard people complain that you have to strain your neck and look down the side of the hotel to see the Ocean, but we had no problem with our view at all. We could stand on our Lanai, overlooking the pool, and see plenty of the Ocean. I think all the rooms that face the pool would have a similar view, which i thought was great. The room was clean, Westin quality stuff. (nice)", "title": "But it's a Great Location", "helpfulness": 6, "user": "CaliforniaMan1965", "date": "August 14, 2006", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 5612117, "likes": {"liked": "— The Pool", "disliked": "— Poor Drinks and Overrated bad food at expensive prices"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "The construction....was not an issue at all. We were staying on the other side, but I work in construction industry so I was intrigued and I stopped by to gaze at their current work, and it was never overly loud with 'jackhammers' or anything. Even if we were facing it, I dont believe that it would have been as big of an issue as people have made it out to be.", "title": "Good trip this time and should get better.", "helpfulness": 20, "user": "alohaguy", "date": "August 2, 2006", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 5544474, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "This was our third trip to the Westin Ocean Resort Villas thanks to my in-laws who own a time share. It is a beautiful property on truly one of the best family beaches on the island. We were there two weeks - the first week we saw whales and dolphins and tons of marine life snorkeling right on the beach. We saw an eel, thousands of reef fish, green sea turtles and . . . 1 4' white tipped reef shark. It was amazing. The second week the waves picked up a bit and so the snorkeling wasn't as good but the kids had a ball riding the waves (our children are 2, 4 1.2 and 7) The property is beautiful, the rooms very comfortable and quiet. The kitchen is stocked in equipment but there are no spices or condiments. The BBQ's are a plenty and I have no idea what these people are talking about getting lost on the property?! My 4 year old can find his way around just fine. Weird. Anyway, I have been to Maui over 20 times in my lifetime and this is by far the nicest and most family friendly place we have ever stayed. Oh, one note. I inadvertantly left my cell phone in the room upon leaving. I was fairly upset as one could imagine, but I called the next morning at about 7am Maui time and the housekeeper had found it, turned it in to security and I had it back in my hands on Tuesday. I was truly amazed by that. Thank you Westin Kaanapali, we can't WAIT to come back!", "title": "Beautiful, fun, kids LOVE it and we do too!", "helpfulness": 3, "user": "MamaOinOR", "date": "April 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28118820}, {"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Oh, the only negative is that there are signs saying kids can't go in the spa - the kids are freezing after getting out of the pool on windy days, it's unreasonable to expect them to just towel off. We were only asked to have our kids out one time. This was new this year - hope they change it back! :)", "title": "Be Careful What you are getting Booking on the Site", "user": "ArtVandelayJr", "date": "April 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 4.0, "service": 3.0, "rooms": 1.0}, "id": 27720615}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "(We never eat at the restaurants on the property - not a great value for the $$$ for us - but we did love the convenience of the store and had a FANTASTIC massage at the Spa!)", "title": "Amazing property and wonderful service", "helpfulness": 1, "user": "pdxlovetotravel", "date": "April 7, 2009", "detail_rating": {"cleanliness": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 27613945}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "I am going to be a little tough on these guys because I am not big on deception. YES Maui is beautiful and you can snorkel 20 feet into the water here and see whales right off the beach; which is AWESOME (but you get that anyway). We booked an Ocean View Studio Villa for $370 night. They put us in the SOUTH bldg 3. We had neither a deck or a flat-screen which were both featured on the virtual tour (or an ocean view without a window lean). They are cordial but give you nothing extra and would only change our room to a 1-bedroom for $125 a night add'l. Not even an hour extra on check-out. The on-site ammenities are great if you have an unlimited wallet; otherwise head to Lahaina for EVERTHING!!! Towel dude wanted $18 for 24 hours just for fins!!!", "title": "Wonderful and relaxing!", "helpfulness": 1, "user": "Andrea C", "date": "April 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27538375}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "We travel to Hawaii (generally Honolulu) every 4-6 weeks between business and pleasure and stayed at this property for the first time in February. We had an amazing time and greatly enjoyed our stay. We were using Starwood points and upgraded to a ocean view room which had a wonderful ocean and pool view. We left the kiddos at home on this trip but wish we had brought them after seeing the incredible pool. We stayed at the Fairmont in Wailea in October and found this to be a far superior property and one we will choose again in the future.", "title": "great for families!", "helpfulness": 3, "user": "torv", "date": "April 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 27347685}, {"rating": 5.0, "title": "Great condo style holiday", "text": "We really enjoyed the Villas. We stayed in building 3 and it was so quiet and relaxed.", "user": "H0neybeethree", "date": "March 1, 2010", "id": 57465191}, {"rating": 5.0, "title": "Superb Stay in Maui", "text": "When we arrived at the resort everything went well. Valet parking was great and very reasonable. $9 for regular quests and $7 for timeshare owners - however as timeshare owners if we parked ourselves it was free!! In Hawaii!!", "user": "greenlakegirl", "date": "February 27, 2010", "id": 57219675}, {"rating": 5.0, "title": "Best Vacation Sleep ever, and its a nice place to stay also!", "text": "Pool and hot tubs were just outside the doors and it was a short walk down to the beach. The beach was okay - good for snorkeling but have to walk about 100 meters south to get tot he beach where there was more sandy bottom. We saw many whales breaching right in front of the resort.", "user": "Noshitreview2", "date": "February 26, 2010", "id": 57212258}, {"rating": 4.0, "title": "Beautiful Resort", "text": "Our room was stocked with the groceries we had requested but it is a very short drive into Lahaina to get anything you need. We primarily ate breakfast and lunch at teh resort when we were there - the only time we ate supper at the villa was after catching our own Mahi Mahi when we went deep sea fishing and cooked it on the BBQ that is available at the resort.", "user": "OttawaTravellingDude", "date": "February 26, 2010", "id": 57162040}, {"rating": 5.0, "title": "One of the best Hotels", "text": "The building, our room and the resort area was clean. As timeshare owners however, you do not get daily maid service - so we were washing our own towels (oh yea - they have washers and dryers which are great) and the shower seemed constantly filled with sand by our two kids even though we did use the showers outside. They come around once during the week to refresh the bedding and towels and to do a general tidy. We did not see many staff other than the concierge who is in every building ready to help.", "user": "pvtejasvi", "date": "February 26, 2010", "id": 57142125}, {"rating": 2.0, "title": "Disappointed, wouldn't go back!!!!", "text": "We booked 2 one bedroom suite rooms on expedia on a package where breakfast was included and room upgrade on availability. Well we recieved the worst location possible, building 7, farthest right, long walk. We were a group of 5 adults and one child, and all of us were disappointed with this resort. Service was terrible!!! The only good service was the bellman at valet. Front desk staff were horribly rude and unhelpful on more than one occasion. We also didn't like the location of the resort, secluded from anything else, you would be better to stay at the westin next to Whaler's!!!! We won't be back.", "user": "vicki3", "date": "February 24, 2010", "id": 56990643}, {"rating": 5.0, "title": "Maui", "text": "Wow, there is not much else that can be said. The staff was great, the food was excellent. The view of the ocean from our room and the sunsets were spectacular.", "user": "CurtisW1", "date": "February 21, 2010", "id": 56679905}, {"rating": 4.0, "title": "Probably the nicest timeshare unit I've stayed in!", "text": "i always like reading recent reviews about resorts that are to the point and cover what you need to know, so here is my attempt:", "user": "cberenguer", "date": "February 19, 2010", "id": 56535949}, {"rating": 5.0, "title": "Fantastic in every way", "text": "- location is great. Right on Kanapali Beach and a great drive to other areas. Hotel offers a shuttle to the other Westin Hotel, Sheraton and close-by Whalers Village. I would recommend having a card though.", "user": "scooterjuanita", "date": "February 16, 2010", "id": 56176942}, {"rating": 5.0, "title": "Great place", "text": "- villa rooms are awesome. clean. specious. modern. new. don't have an oven, but the microwave couples as an oven. missing a couple of basics from the kitchen like a can opener, but otherwise has everything you need.", "user": "Ramzer", "date": "February 16, 2010", "id": 56140795}, {"rating": 3.0, "title": "Not what i expected from a Westin", "text": "We had a garden veiw above the parking lot next to the highway. We could not sit out side because of the highway noise. It took 6 days to fix shower head. Microwave door", "user": "JoeMontroseBC", "date": "March 15, 2010", "id": 58632626}, {"rating": 5.0, "title": "IN A WORD .....AWESOME!!!!!!!!!!!", "text": "handle was broken. Seat cushion outside was missing. I would suggest to bring a sharp knife for cooking as the ones provided would not cut anything. Had to wait for equipment in the two fittness centers.", "user": "zoo-ma-goo", "date": "March 10, 2010", "id": 58265051}, {"rating": 5.0, "title": "Outstanding resort!! Beautiful...", "text": "We just got back from our stay at the Westin Ocfean Villas. We are Starwood owners (Atlantis) and traded a week for Maui. I must say that this resort is just fabulous. The staff is exceptional, the timeshares are fabulous and the location is great. We loved everything about . In fact, we loved it so much that we bought a timeshare there as well.", "user": "Flyingmo", "date": "March 8, 2010", "id": 58078418}, {"rating": 5.0, "title": "Great Place to Stay For Families/Groups", "text": "We even had to endure the tsumani and I thought that the resort handed this really well. Unfortunately, we had to stay in our rooms until the threat had clearec and the warning had been cancelled.", "user": "dcv2002", "date": "March 2, 2010", "id": 57548139}, {"rating": 5.0, "title": "Playing in the ocean and pool - who could ask for more?", "text": "I just think that anyone who stays herre would NOT be disappointed.", "user": "LAtravelers2", "date": "March 1, 2010", "id": 57473426}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "We are even-year time share owners at this resort and love it. It's in a perfect location - right on the beach. The shuttle takes you down to the Westin Hotel and Whaler's Village or into Lahaina. People who book here need to be aware that the studios have small kitchens and no balconies. The one-bedrooms have much larger kitchens and a nice balcony. The beds are luxurious and both types of rooms have large showers and jacuzzi baths. There are several hot tubs on the property and a very nice pool.", "title": "Loved It!", "helpfulness": 1, "user": "GinOaklandCA", "date": "March 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59368800}, {"rating": 1.0, "stay_parameters": "Stayed March 2010", "text": "Another thing to be aware of is that there are two resorts on the same property. The Westin Ka'anapali Ocean Resort Villas North are newer and have more rooms with ocean views. I think that resort has more pools - that is where the pirate pool is located (I haven't seen it, so I don't know what that means). Both resorts have a daily calendar of activities.", "title": "Worst hotel ever!!!!", "helpfulness": 3, "user": "Nickvi", "date": "March 23, 2010", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 59297627}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "Where to start. They charge you 7 dollars a day to park your car. The shower is a walk in water gets all over the bathroom EVERYWHERE! Glass doors between bathroom and bed, open or closed you her everything. The front desk took about 30 min to check us in. When we checked out they charged us 60 extra dollars a night for what they said was an ocean view we didn't ask to upgrade and you couldn't see", "title": "Exceeded expectations; Luxurious, Convenient, Friendly.", "helpfulness": 2, "user": "dc5000", "date": "March 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 59266359}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "the ocean. Walls are paper thin can hear everyone next to you. The maid took our remote when they changed the sheets took a day to get another one.", "title": "NICE NOT GREAT EXPENSIVE OVERRATED", "user": "esch69", "date": "March 20, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 59060691}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Food @ the hotel was horrible. From the pool bar the price is about", "title": "Perfect Resort for a Perfect Vacation!", "helpfulness": 3, "user": "LivingtheDream32", "date": "March 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58772313}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 104, "average": 196, "very good": 527, "terrible": 58, "excellent": 1188}, "aka": "The Westin Kaanapali Ocean Resort Villas Hotel", "slim_ranking": 0.357142857143, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Enjoy stunning vistas and an exotic, idyllic setting on exclusive oceanfront property on Maui's North Beach, with golf, tennis, swimming, nd more. Perfect for a Hawaiian destination wedding."}