{"user_rating": 1.5, "review_count": 223, "name": "The Merchants Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed December 2006, traveled solo", "text": "The hotel is currently undergoing improvements and when finished this hotel will be a great hotel for a budget trip, it has small but clean rooms it’s a shame the view outside is unattractive and was noisy at night. I booked a single room and I was provided with a towel, soap and tea making facilities and a tv there was nowhere for clothes storage apart from a small hanging rack suitable for coats. Another thing about this hotel is the stairs, be warned there are lots of them and no lifts! Also the hotel could improve on a few things such as providing soaps and towels in the toilets and the staff could be more helpful and also they tried to get me out of my room at 10.00am earlier then the 11am advertised. Overall I was pleased with the hotel for its central location cleanliness and cheap price.", "title": "Good for on a budget trip", "helpfulness": 1, "user": "Shadowwolf", "date": "December 7, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 6344617, "likes": {"liked": "— The Price", "disliked": "— The views"}}, {"rating": 2.0, "title": "Bring earplaugs!", "text": "I booked this hotel because of the central location and cheap price (£30 per night). be warned though- it's extremely basic, my room was like a bedsit and facing overlooking the road.", "helpfulness": 1, "user": "whackerD", "date": "November 28, 2006", "id": 6184799}, {"rating": 5.0, "stay_parameters": "Stayed January 2005, traveled solo", "text": "The hotel is just off the main street, there's a bus stop outside and street cleaners working the whole night. Also you have drunk people passing by outside shouting etc. until about 4am.", "title": "Friendly staff and nice little room", "helpfulness": 1, "user": "DmitriCitizen", "date": "November 17, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6146221, "likes": {"liked": "— Friendly staff and location", "disliked": "— The dining room needs more decoration"}}, {"rating": 4.0, "title": "It's magic at the merchants", "text": "The window didn't keep out any noise, i asked at reception if I could have a room not facing the road but none were available.", "helpfulness": 3, "user": "Karenamy", "date": "October 1, 2006", "id": 5896249}, {"rating": 4.0, "title": "nice", "text": "There was also a lot of noise from some of the other rooms- fighting, crying and doors slaming. Decor is old and cheap.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "May 19, 2006", "id": 5181152}, {"rating": 1.0, "title": "Don't book this hotel !", "text": "I strongly recommend not booking at this hotel. The room I stayed in was damp and the ceiling was leaking onto the bed ! The area the hotel is in is rough and the entrance down a very dark alley.", "user": "rrrrrrrrrready", "date": "April 4, 2008", "id": 14787144}, {"rating": 1.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "This is the worst place that i have stayed ever, it is an afront to all that is good. it is a heaving pit of dampness dim lighting and stail smells, and i had to get myself very drunk so that i could sleep the night.", "title": "for the love of God don't stay here", "user": "sideshowbobWestKent", "date": "March 7, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 14115008, "likes": {"liked": "— leaving it in the morning", "disliked": "— the room"}}, {"rating": 2.0, "title": "Ergh, Don't Even Bother!!!!!!!!!!!!!!!!!", "text": "there is no point breaking it down to what was poor as everything you could think of was terrible. this place should be shut down.", "user": "charlieegg", "date": "February 4, 2008", "id": 13265860}, {"rating": 1.0, "stay_parameters": "Stayed November 2004, traveled with friends", "text": "OK so I booked the hotel on a whim. Then I read the reviews which made me a little nervous. We booked 2 double rooms, one which was room 1 and the other room 5. Me & my friend walked into room 5, turned on the very dim lights and were very disappointed. The mirror was above a sink which was very difficult to look into, outside of the manky windows was a lovely view of extractor fans from the building across. They didn't have wardrobes, just hangers on a rail from the ceilingl. Was a good job we brought ipod speakers because the TV didn't work at all, neither did the remote. Downstairs in room 1 was slightly brighter and had laminate floors. When my friends walked into the room after our night out the room was flooded as the sink had leaked. Before we went out I needed to have a shower in the shower room (we didnt have an ensuite). I was scared 2 death because there was a big window but no curtain and I didn't know if anybody could see me on the other side. I relucantly got in the shower cubicle and could feel it moving as though the fitting would come off! The Polish woman on reception warned us that the fire alarm would go off between the hours of 6am and 7am for a few minutes but not to worry. What kinda hotel does that on a Sunday morning? Anyway it did and was the loudest noise in the world. There were lots of other crap things about it too including it smelt like an old folks home. Plus u have to leave really early in the morning. And we didn't even attempt the breakfast!! Stay at a Travelodge, its like the Savoy hotel compared to this.", "title": "what a dump", "user": "sollys", "date": "February 3, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 13239880, "likes": {"liked": "— nothing", "disliked": "— everything"}}, {"rating": 2.0, "title": "Important warning", "text": "Worst place i have ever stayed in in my life! Unhelpful staff, dingy attic room, broken toilet seat, no facilities couldn't even get an early morning wake up call or pre book a taxi to the airport for our flight to New York. DON'T STAY HERE.", "helpfulness": 2, "user": "Invitada", "date": "December 5, 2007", "id": 11263698}, {"rating": 1.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "The only reason I booked this hotel is was it was about the only hotel (suspiciously) left with rooms in Manchester central for a last minute dash to see United play Roma.", "title": "April Fool", "helpfulness": 1, "user": "CyproMike", "date": "August 1, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 18505582, "likes": {"liked": "— Friendly staff", "disliked": "— The room"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "Apparantly, at around £85, I got one of the nicest rooms in the place - mainly because it had an en-suite. It was the worst hotel room I have ever stayed in. Everything worked, its fair to stay and it was reasonably clean.", "title": "The worst place I have ever stayed in EVER.", "user": "fayviolette", "date": "July 20, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 18077446, "likes": {"liked": "— if you squinted really hard you could see the outline of Jesus within in a stain on the wall", "disliked": "— everything else"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "But the entire place needs updating and redecorating. \"Tired\" is not an adequate description. Breakfast was basic, but I do recall that the coffee wasn't bad at all.", "title": "Warning ! Warning ! Warning", "helpfulness": 1, "user": "Teltyerman", "date": "July 11, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 17772474, "likes": {"liked": "— At least the bedding was clean", "disliked": "— The room"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "The only good thing I would say about the hotel is that it was staffed by very young Polish girls and guys who were very helpful and very funny and friendly.", "title": "Death trap", "user": "Ontheroad15", "date": "June 3, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 16631364, "likes": {"liked": "— The location", "disliked": "— Health and safety"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "Got off to a flying start after finding out that 'paying' for it by credit card and booking online only reserves the room and doesn't remove any money from your bank account, so that on arrival we had to pay by cash, a large amount of which we didn't have, so we had to trek about a mile to find the nearest cash machine and come back. The man was utterly miserable and sarcastic and the hallway had a stench of stale old peoples home mixed with urine and sorrow about it. I think the spirits of previous disgruntled travellers haunt it still.", "title": "I would stay here again", "user": "faience", "date": "May 9, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 15863670, "likes": {"liked": "— clean and comfortable", "disliked": "— lino in the bathroom"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Stayed here in early October while in Manchester for a match.Was a little sceptical in booking having read some of previous comments.Must say I was pleasantly surprised overall.", "title": "surprised !!!!", "user": "jonny099", "date": "October 10, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 2.0}, "id": 10064001, "likes": {"liked": "— location", "disliked": "— rooms could do with an upgrade"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled solo", "text": "Had a little trouble in finding alrite as its off a side street and not very easy to see signage from street.Had double ensuite room,both bed & bathroom very clean,couldn't complain about either.Room basic enough,tv(no remote),tea & coffee.breakfast following morning was tea,toast & cereal - again no problem here,dining room recently renovated.lad at reception also very helpful.added bonus was being able to leave bags here while shopping following day.for an overnight,budget stay would definitely recommend.v close to trams,bus station & main shopping areas.", "title": "Spend an extra £10, elsewhere!", "helpfulness": 1, "user": "PaisleyBuzz", "date": "March 19, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 5.0}, "id": 7190751, "likes": {"liked": "— Location", "disliked": "— Dampness"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Before I booked, I had read the reviews but decided to give the place a chance after reading a some positive reviews. I arrived at 7pm and it was already dark. I walked along the dark alley and rang the buzzer. As I made my way up the stairs I was aware of the tatty decor, but for £35, I wasn't expecting the Ritz - so I carried on. At the reception, all was ok. Got my key and made my way to the room. This is when alarm bells started ringing. The floor was covered in wallpaper that had been scraped off the wall and I was dodging a set of ladders on the stairs with a Polish guy about 40 foot in the air scraping away at the wall. Once I got to the top of the stairs and walked along the landing, he was still higher up than me! Anyway, into the room I go. No toilet or shower. 1single bed, a sink and a rack for hanging things up. I sat on the bed and was over powered by the smell of dampness, so I opened the window and went out for dinner. When i came back I went straight to bed but couldn't sleep because the dampness was sticking in my throat. When I looked at the wall, up in the corner, you could see the black dampness coming through the wallpaper. The wall paper looked quite fresh, but cheap. Eventually I went to the reception and asked to be moved. The manageress / receptionist / breakfast host / housemaid / cleaner (I seen her do all these jobs) was nice enough and agreed to move me. Whilst I was at the reception I noticed 6, 2 litre cartons of milk lying in the hallway, and it wasn't a chilled hallway. Tomorrows breakfast milk, I thought to myself! Anyway, she then phoned the boss and he said I could go into a \"better room\"! It was better. It had a double bed and a TV but, Stinked of smoke and DAMPNESS. The smokey smell masked the dampness, so I stuck it out all night. Woke up a few times because of the loud drunks in the alleyway. Breakfast was cereal and then toast, which suited me. I then checked out and breathed a sigh of relief when I was back on the street! I was going to stay at the youth hostel before I booked but I prefered to have my own room. Wish i had now. Only stay at this 'hotel' if you are used to cheap furniture, poor quality housing or sleeping on paper sheets! Oh, nearly forgot, the artiificial walls are paper thin too, so pray for quiet residents in the next room(s). I would have gave this hotel 1/5 if it wasn't for the fact I was able to move rooms. Spend a few more pounds elsewhere, it really will be worth your while. Avoid this place at all costs.", "title": "Not That Bad!", "user": "TheTriangle", "date": "March 18, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 7185595, "likes": {"liked": "— location", "disliked": "— noise"}}, {"rating": 1.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "Good hotel for on a budget trip. It is located right in the city centre and is a 10 minute walking distance to the MEN arena which is the reason we stopped in Manchester. We chose this hotel as it was the cheapest in the area and closest to the arena. The hotel room was nicely decorated and clean with a shower and toilet. The only problem with the hotel was finding it and when we rung the hotel for directions they didnt know where to direct us to. When we finally got there we parked our car on a secure carpark just down the road from the hotel but cost us £12.50 for just one night. The lady at the help desk in the hotel seemed nice but we had to ask where our hotel room was as she just gave us the keys and didnt show us where our room was. we both slept well until 4 o'clock in the morning as people in the hotel were making lots of noise that woke us up which we was angry about. The hotel is currently being refurbished and once finished i think it will be lovely.", "title": "worst place ive ever stayed", "user": "r1oleary", "date": "February 16, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 6801914, "likes": {"liked": "— nothing", "disliked": "— the entire hotel"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "i arrived with my 7 year old son and thought big mistake altough the staff were nice the place was a complete dive,no toilet in the room,the shower was right at the end of the bed,the window wouldn't shut properly so the room was cold and you could hear everything from the street,the entrance was down a dodgy looking alley,if your thinking of booking it DON'T its a dump", "title": "Awful", "helpfulness": 1, "user": "hanster", "date": "January 5, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "location": 2.0, "rooms": 1.0}, "id": 6556691, "likes": {"liked": "— nothing", "disliked": "— the huge amount of steep stairs and the cleanliness"}}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 21, "average": 29, "very good": 9, "terrible": 154, "excellent": 10}, "aka": "Merchants Hotel Manchester", "slim_ranking": 0.889830508475}