{"user_rating": 3.5, "review_count": 670, "name": "The San Luis Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "My husband and I stayed 2 nights at the beautiful San Luis Resort. Here are the pros- beautiful hotel, our room was great and the view was spectacular, the pool is very nice, the location on the seawall is excellent, and employees were friendly. Here are the cons- check it took forever, the front desk girls were ineffiecient and I stood there for at least 30 mins while they figured out my reservation - made on Expedia. While the pool is beautiful, on Monday it was over-run with kiddos. We got splashed by cannon balls and in general it was not relaxing. The kids were having a great time though. Basically, this isnt quite the image of the pool scene that they promote.", "title": "Nice visit to the San Luis Resort", "user": "CCC1979", "date": "April 28, 2011", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 105921426}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Overall, we were happy with our trip and will probably come back in the future.", "title": "Our favorite weekend getaway!", "helpfulness": 2, "user": "michaelb110", "date": "April 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 105582867}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The Wifey and I have stayed here twice. Both times we’ve stayed in the “deluxe quarter” rooms . The deluxe quarters are rooms on the corners of the building. The first time we stayed on the West end of the building, this time the east end.", "title": "Best Hotel Stay Ever!", "helpfulness": 1, "user": "stdrwt11", "date": "April 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 105095153}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "East Corner rooms: Close to the elevator, but not too close. They have a wet bar and fridge, sizeable closet, and nice tub. The front view from this side is best because it is over the pool. However the side window looks directly at the wall of the condos about 5 feet away – we just kept the curtain closed.", "title": "Wonderful Anniversary Weekend Getaway experience ;)", "user": "beebeelc", "date": "April 19, 2011", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104653347}, {"rating": 2.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "West Corner rooms: The walk is long from the elevators – the entire length of the hotel. There was no wet bar in this room but I’m pretty sure the was a fridge. The side window gives an open view of the rainforest and the rest of west Galveston seawall – nothing to write home about but better than a wall.", "title": "Moving people's property from chaise lounges at pool permitted my F & B manager Steve.", "helpfulness": 6, "user": "wwrobe61", "date": "March 19, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 100729640}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "This exceed our expectation as I purchased this hotel package from AAA through one of there specials and we ended up with a \"VIP\" room on the 15th floor which had an amazing view and the service was excellent. in house steak restaurant was fantastic and the pool area is great for adults and kids alike. Valet parking was a must due to the crowds and well worth the $12 a day rate.", "title": "Fantastic Room and Location", "helpfulness": 1, "user": "GVTX3", "date": "March 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100409867}, {"rating": 4.0, "stay_parameters": "Stayed March 2011", "text": "Based upon what we have seen and experienced so far this is the best hotel in the area.", "title": "Met and exceeded our expectations!", "user": "Kamster08", "date": "March 12, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 99922944}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "My husband and I decided to visit Galveston for a few days and fell I fell in love with this charming island. The San Luis is well-maintained and the staff were all very friendly and helpful and remembered our names throughout our stay. The heated pool, hot tub, and grotto spa were inviting and kept at perfect temperatures. We stayed in a king room on the 14th floor and the room was clean, quiet, & well-furnished. Had excellent view of the pool, ocean, and Seawall Blvd. We were disappointed that the H2O Bar was closed for floor maintenance but that in no way effected our satisfaction with this resort. We will most definitely be returning to stay at the San Luis again.", "title": "Hotel area great /great amenities /old condo's", "helpfulness": 1, "user": "midwestmamma", "date": "February 23, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 97762106}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We stayed in the condo's at the San Luis. The location was beautiful. Our condo was very old and needed to be updated. The hide-a-bed was the worst I have ever slept on. We actually put pillows down on the matress to sleep on. We had a bird living on our deck with a nest of eggs. I realize they are owned by private people, but they need to regulate the quality of these rentals in such a nice hotel. The hotel is very nice. The pool area is beautiful. They give you nice fluffy yellow towels to use. The pool temp was 78 degrees. The hot tub over looks the ocean. The staff was all very friendly except 1 desk clerk. One complaint was I had to pay to use their computer by the minute. Shocking at such a fancy hotel. I've stayed at Best Westerns that have a room full of computer to use for free.", "title": "Saggy bed. Tiny bathroom. Expensive room.", "helpfulness": 1, "user": "Aujourdhui2", "date": "February 14, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 96659696}, {"rating": 2.0, "title": "Inexcusable inconvenience", "text": "This is a lovely hotel, a few steps from the beach. We had a penthouse room on the 16th floor, and the view of the sun rising over Galveston Bay was absolutely breathtaking. The room was spacious, with plenty of room for a large, modern bathroom, but the bathroom was tiny. I had a very hard time plugging the tub so it would fill. Worst of all, the bed sagged towards the middle. Badly. A very uncomfortable nights sleep. Check out is a nightmare - at noon, checkout time, they had only one person working the desk. We ended up leaving our key on the desk and letting them sort it out at their convenience.", "helpfulness": 1, "user": "Mbourne1", "date": "February 13, 2011", "id": 96393245}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Just home from our 2nd stay at The San Luis Resort on their Club 10 level. This is suppose to be their VIP level. For the most part the stay was ok but housekeeping was non-existent. We stayed 2 nights and on our only full day at the resort our room wasn't cleaned. I'm not sure when they planned on cleaning it but we left the room at 11:00 a.m., let them know that we were leaving and if they couldn't clean the room. They said they would....these were 2 of the Housecleaning supervisors. We returned at 4:00 p.m. and it still wasn't clean. My husband called to register a complaint and asked that someone be sent to our room to change out towels. They never returned our call to register the complaint but they immediately changed out towels. Then one of the housekeepers asked him to sign a paper that said we didn't want housekeeping. Of course we wanted it, we just didn't want it after 4 when we would be relaxiing and getting ready for our evening out. The housekeeper told him in a disgruntled tone that they'd been busy that day.", "title": "Doubtful We'll Be Back", "helpfulness": 3, "user": "tlegray", "date": "June 4, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 3.0, "value": 2.0, "service": 1.0}, "id": 111432973}, {"rating": 2.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "We probably won't ever stay here again. We live in the Houston area and when we have a couple of days off we like to stay in a nicer hotel to relax and destress. Just 3 weeks earlier we were at The Woodlands Resort. The stay and service were so much nicer with all the same amenities and an on-sight golf course.", "title": "Pitiful: Not a hint of luxury, inflated prices, too noisy to sleep", "helpfulness": 4, "user": "TennesseeGirl888", "date": "May 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 109307429}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Paid through the nose for a two night stay at this \"resort.\" The rooms were your standard hotel room but not as tastefully decorated -- dated and even peeling wood at bathroom door bottom and stains on bathroom ceiling. The beds were doubles, not queens-- haven't seen that in years. Beyond a bathrobe to use, not a HINT of luxury (no microwave/nice teas/fridge/chocolates/whirlpool tub ...nothing. In fact everything, beyond an initial bottle of water, had an extra fee attached.", "title": "Very nice hotel", "user": "JKKTX", "date": "May 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109052684}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "We were on the 14th floor and yet the noise from the nightly parties around the pool was so loud I couldn't get to sleep until they were over-- after midnight. Certainly not the peaceful getaway I hoped for-- couldn't even hear the ocean between the traffic and partiers. If you are a party animal, maybe you'll like it. Was a total rip off to me.", "title": "Great Pool, Oustanding Restaurant, Average Rooms", "user": "marinerjess", "date": "May 14, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 108220068}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Oh-- and the two times I called the front desk, I was put on hold-- the first time for ten minutes, the second, I gave up at ten minutes.", "title": "All Texas hotels, please take note! The best is in Galveston!", "user": "shellyg1968", "date": "May 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106661788}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "The Pros: Valet staff was excellent and the pool area is very nice. The lobby is clean and very impressive.", "title": "Not horrible, but will stay somewhere else next island visit.", "helpfulness": 1, "user": "matt_ruby", "date": "January 19, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 93805606}, {"rating": 1.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "Cons: We stayed on the ninth floor. The view of the water from the room is excellent. However, immediately below us was a roof to a lower level extension to the hotel. The roof is dirty and it looks like you are above and industrial factory. On top of that eyesore is the buidings AC unit that has loud metal clanging. It looks like its from 1940 and sounds like it as well. It is loud enough to drown out the sound of the waves or keep you awake if you want to go to sleep with the balcony door open. No excuse for this.", "title": "Roach in my bed and on carpet, no discount/refund, rude", "helpfulness": 6, "user": "Jane2276", "date": "January 15, 2011", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "service": 1.0}, "id": 92961032}, {"rating": 1.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Matt", "title": "Basically old hotel that smells of cleaning fluids!", "helpfulness": 4, "user": "refinerydog", "date": "January 2, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 91422023}, {"rating": 3.0, "stay_parameters": "Stayed December 2010", "text": "I just had to check out of this hotel. When I checked in the first night I had to stomp out a bug within 20 seconds of walking in. It was nearly midnight so I tried not to worry about it. Tonight I had a bug run along the top blanket and I had to crush and kill it. I called the front desk and they said they would have housekeeping come up. I said that was a good start. They then said they would get another room ready for me. When I spoke with the front desk clerk, I wanted to confirm that I would not be paying for my stay. He could not confirm this so I declined the room until he could get a firm answer for me. He returned and told me housekeeping could not find any bugs in my room. I said I would return to the room and show him. Upon returning to the room, upper management denied any findings of bugs. I showed them the roach picture on my phone and they did not care. I checked out of the hotel with no discount and only a comment about a manager who may call me in the morning. I decided to check into the Hilton next door where they were very helpful. My room is just as nice and $60 less/night! Unfortunately, I have come to find the entire resort is owned by the same person. I'm not expecting a follow up call or any type of rebate. I am with a conference of well over 100 people. I have already contacted several of them to make sure they check their beds tonight, but suggested they check out. I plan to tell the meeting organizers about this horrible expereince in the morning. I spend at least 150 nights/year in hotels and after many years of extensive travel have never experienced service this poor. I have stayed in hotels with pest problems, but I have never had multiple roaches in a room and have never had hotel staff so blatantly act as if I were crazy and deny that they have a problem on their hands. Worst hotel experience ever. Any other hotel has to be better than this.", "title": "Annual new years eve stay service decline", "helpfulness": 2, "user": "LadyMels", "date": "January 1, 2011", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 3.0}, "id": 91337759}, {"rating": 1.0, "stay_parameters": "Stayed December 2010", "text": "Price for San Luis is sky high - location is best on the Seawall - but that is it - room was no better than a Best Western - smelled like cleaning fluids - and noisy - hallway is not carpeted and we were right by dinging elevator.", "title": "Worst service!!! Do not believe online reservation for this hotel!", "helpfulness": 4, "user": "Yhkonishi", "date": "December 25, 2010", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 90683515}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 66, "average": 93, "very good": 158, "terrible": 79, "excellent": 274}, "aka": "The San Luis Hotel Galveston", "slim_ranking": 0.354166666667, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.5, "rooms": 4.0, "location": 4.5}, "description": "The San Luis Resort, Spa & Conference Center is one of the Gulf Coast’s finest beachfront properties offering a variety of luxury options. From Spa San Luis and the heated pool to its 40,000 sq. ft. IACC conference center and magnificent gulf views, it’s an ideal destination vacationers, business travel and corporate meetings. The AAA Four Diamond rated resort hotel offers the finest in award-winning dining, overnight accommodations and first-class personalized and professional service."}