{"user_rating": 4.5, "review_count": 560, "name": "The Carneros Inn", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "After spending a few nights at Solage in Calistoga, we came down to Napa for two in Carneros. Overall, the service wasn't quite as meticulous as it was during our prior visits. But that's not to say it was bad or cold. Perhaps staff turnover is taking a bit of a toll on the details.", "title": "Third Time Around Was Good", "helpfulness": 1, "user": "JorjeJaj", "date": "February 4, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 95503779}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "Our room in the Haire section had a tight, horizontal floor plan that was a bit confining. However it was very clean and the private yard seemed a bit larger and open than prior ones. An outdoor heating lamp and gas fireplace allowed us to linger in the yard well into January dusk. A complimentary half-bottle of Chardonnay (appreciation for our return visit) was delivered warm, but it was a nice gesture.", "title": "A little oasis in the middle of Heaven", "helpfulness": 1, "user": "Murrandasp", "date": "February 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95291953}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "In terms of food, Boon Fly Cafe is a fun breakfast nook, but the seating is limited and tight so get there early. One thing to watch for is that the Hilltop Dining Room and the Farm are closed several days of the week, and this highly limits dining options in the immediate area. That said, a rejuvenated Napa Center, with several good restaurants like Celadon and the funky Bounty Hunter Wine Bar, is a mere 10-15 minute ride. The resort is very well situated for exploring Sonoma Center and wineries as well. If you like classic Chardonnays like us, you're in the right spot here.", "title": "Wonderful Resort with Friendly Staff!", "helpfulness": 1, "user": "skrentzm", "date": "December 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91218374}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "While this review may come across as harsh, Carneros Inn is definitely a very relaxing, clean and luxurious destination. Like Solage, with a few years under the belt, they will need to stay crisp and not get too complacent going forward.", "title": "Perfection! Coaxing magic from the combined elements.", "helpfulness": 2, "user": "dianeNorthCarolina", "date": "December 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89914296}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "My husband had to be in San Francisco for a meeting on a Monday, so we thought we'd go a little early and spend a few days at the Carneros Inn. We've stayed several times before, and whenever we want to escape and feel pampered, we just look at each other, and both say \"Carneros\". If I could live there I would. We came in late Friday and ate at The Farm, on site. It was so good, even though we are 15 minutes from some of the best restaurants in the world, we ate at The Farm again on Saturday. With drinking, it's just too easy to walk the 2-3 minutes \"home\" to our little cottage. Our favorites: The cottages themselves. Free standing rooms with private garden, outdoor shower (the best thing ever) and heated bathroom floors. A beautiful workout room. The restaurants. We ate at all the restaurants at the resort this time, The Boon Fly, The Hill Top & The Farm. All excellent. The chicken at the Farm is the best I've ever had. I've never been to Napa in January, and it was unbelievably green & warm, in the 60's each day. Perfect time to go, hardly any tourists (like us). Best winery we visited, Heitz Cellars. Fab cabs, and no crowds.", "title": "one of my favorite hotels EVER!", "user": "bostongal19", "date": "December 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 89113396}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Carneros Inn is the most wonderful and luxurious place to stay in Napa. The views surrounding the property are breath taking (borrow a bike and go for a long cycle ride) the restaurants and shop on the property fit for any foodie (buy a picnic and bottle of bubbles from the shop for your lunch or dinner if you're staying more than a day). There is a pool and heated tub up near one of the restaurants where you can have brunch / lunch with incredible vistas in the background and another more secluded pool for those that want to just worship the sun with a little more privacy. Then of course, there are the spotless accommodations. Cosy, clean, luxury personal cabins. We went for the most basic and it was fantastic. The bathroom is great with both bath tub and huge shower that opens up to an outdoor shower. There's a fire place for the cooler months and private patio for the hotter months (perfect for that evening picnic!) They have every detail thought about. The curtains in the room didn't seem to entirely cover up the window so there was a moment of feeling like people could look in but you get the distinct feeling, that everyone is tucked up in their cabins and it's not the kind of place where you'll get people trying to pry.", "title": "Luxury & Romance in The Best Location", "helpfulness": 2, "user": "Milly09", "date": "May 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106843388}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The only downside to all of this, is the price. If you're lucky and go off season, you can get a deal for around $470.00. Usually the rooms are around $600 a night. Yes. That's spenny. But when I say this is the ultimate in romance and luxury and that everything is on hand to you - truly, I mean it. It's the whole experience that surrounds Carneros (the wine tasting / the restaurant / the cabins / the views) that make it all in all, a night or two well worth the expense.", "title": "Amazing trip", "helpfulness": 2, "user": "dmwilsondvm", "date": "April 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 105788348}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We stayed just one night and we still got the full flavour for it and even off season, it was wonderful and sunny. There are lots of wineries within distance that you can visit (and don't have to pay for) just be careful if you use e.g. designated driver (suggested through the hotel) which Is a great idea, just don't let them recommend other wineries in place of the ones the Carneros books (that are usually all free entry) as you'll find you get taken to a not as great place, and pay at least $30 per person which they didn't mention!", "title": "Everything Perfect", "helpfulness": 2, "user": "water026", "date": "April 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 104372807}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Dine at the restaurant on an empty stomach. The food is truly great.", "title": "Luxurious trailer park", "user": "PortoTraveller", "date": "April 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 103040508}, {"rating": 4.0, "title": "Wonderful spot to relax", "text": "Have a cocktail outside around the open fire pits.", "helpfulness": 1, "user": "Travel9898", "date": "March 24, 2011", "id": 101418588}, {"rating": 5.0, "title": "boutique cottages and peaceful groves", "text": "stayed here for a couple of days", "helpfulness": 2, "user": "marie6613", "date": "May 22, 2011", "id": 109387659}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "once you drive up to the main lobby and step out of the car, you immediately feel the warmth and peace of the place", "title": "Unique + Perfect Balance between Luxury and Summer Camp for Grown-ups", "helpfulness": 4, "user": "GoBlue1975", "date": "May 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108014172}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "the lobby is very inviting and the cottages even more comfortable", "title": "Modern Farmhouse Meets Under the Tuscan Sun", "helpfulness": 3, "user": "Andrena11", "date": "May 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 107789959}, {"rating": 2.0, "stay_parameters": "Stayed May 2011", "text": "soft bed, eames chair, heated floors int eh bathroom, outdoor shower, wooden deck patio", "title": "Spa Review - Would Not Let Us Book In", "helpfulness": 4, "user": "AngCHovi", "date": "May 9, 2011", "detail_rating": {"service": 2.0}, "id": 107586109}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "its so quiet here i love it", "title": "A great all-round experience", "helpfulness": 2, "user": "julesabc", "date": "May 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 107439282}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "I have been sitting on this review for about a month. Out of fairness I've waited for the general manager to email be back, regarding out stay, and he never repsonded to my email. So...here goes. If you can afford to book a cottage with the fire pit/tub, do. You are rewarded with rooms that have shutters and are dark at night. If not, you will be in a room that is virtually lit up all night. Why? Thin roman shades and cottage lights from neighboring cottages that are on all night. One downer to the tub, it will only fit one, or two if you are a very small person. Thought that sounded great in theory but was quite uncomfortable to enjoy together.", "title": "Sleep deprived for $400 a night. Caution. Wanted to love it so badly!", "helpfulness": 3, "user": "californialovesu", "date": "March 23, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 4.0, "location": 4.0}, "id": 101270854}, {"rating": 5.0, "stay_parameters": "Stayed March 2011", "text": "Room service was uneven. Terrific one night, great burger, terrible at breakfast. Cold food, hour wait.", "title": "Perfect", "helpfulness": 1, "user": "tupapi", "date": "March 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99683525}, {"rating": 2.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "I felt vindicated for complaning when I read a former review commenting on the same issue. When we complained about the light the next am, literally everyone at the front desk looked at us like we had landed in a space ship. I asked if they had eye shades, and no they didn't. The front desk did explain that they're some people who like a well lit room to sleep in, so if they are disoriented in the middle of the night they can find their way around. That's a first, truly. And, he was so ernest about the explanation.", "title": "Small, expensive, haughty - avoid Carneros", "helpfulness": 5, "user": "Biz_Cindy", "date": "March 8, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 99340342}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "I thought the # 1 rule to any hotel is black out shades, so if you are traveling and you are jet lagged you can actually sleep. Or, in our case, sleeping in. Their will be no sleeping in at this hotel since some of the cottages are east facing and you know what that means, up with the chickens with the thin roman shades.", "title": "We didn't want to leave...", "user": "NoVaTraveling", "date": "February 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 96876887}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "It is also strangely corporate sponsered???. Other quirks. At wine hour you will the odd feeling that you're on a car sales lot. You are. The wine hour is held in a residence cottage with nice people trying their to sell a cottage. Also, the wine hour is given by various wineries who are (surprise!) selling their wine.", "title": "If I could live at this hotel, I would!", "helpfulness": 1, "user": "JRae27", "date": "February 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 96624117}], "location": {"country": "United States"}, "stars": 4.5, "variance": {"poor": 18, "average": 37, "very good": 80, "terrible": 16, "excellent": 409}, "aka": "The Carneros Hotel Napa", "slim_ranking": 0.2, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}