{"user_rating": 4.5, "review_count": 340, "name": "The Wine Country Inn", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "We spent three nights at the Wine Country Inn, and we thoroughly enjoyed our visit. The rooms were very nice but dated, and we were told they plan to renovate them during the winter. The management's instincts are perfect! The breakfast and afternoon wine and hors d'oeuvres were tasty, and the shuttle to restaurants in St. Helena was a real benefit! The location of the inn is great, with beautiful views from the rooms. We will be back!", "title": "Lovely inn!", "user": "Andrea W", "date": "November 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 184415472}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Absolutely loved the room and the surroundings. Great shuttle service for visiting restaurants in the evenings. Breakfast was a bit lacking but I'd happily recommend anyone to stay at this inn. Perfectly situated in the midst of an area with an abundance of wineyards. Close to restaurants and shopping.", "title": "Picturesque New England style inn", "user": "nordic_angler", "date": "November 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183932652}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "We celebrated our 25th wedding anniversary with a trip to Wine Country Inn and it was tremendous! It was recommended by a colleague who was very familiar with the area--and it worked out great! The St. Helena area is wonderful in a variety of ways with plenty of good wine and food--we stuck to the general area for three full days--Ryan the chef at WCI who was born and raised in Napa gave us some fine recommendations for wineries to visit--the breakfast and wine tastings with hor'dourves were delightful! They offer a complementary shuttle service into St. Helena for dinner and that was terrific! Thanks Janelle!", "title": "Great place to stay!", "user": "Joe C", "date": "November 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 183757982}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "All in all a great place to be! Can't wait to return!", "title": "Great place to stay in Napa Valley", "user": "rbrogden", "date": "November 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 183631603}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "My wife and I just got back from the Wine County Inn, and we only have good things to say. To start, they have a fantastic breakfast to choose from, we ate different things each day and they were all good. The staff is all very friendly and helped to point us in the right direction whenever we had questions. We had a room with a fireplace, which was very nice to relax by in the morning and evenings. A nice touch was that our welcome packet included free passes for tastings at some vineyards in the area, this helped save a lot of cash.", "title": "A great place in the vineyards", "user": "Timinguy", "date": "November 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183214921}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Stayed at the WCI for 4 nights early Nov. Caught the colors perfect! This was our 2nd visit to the Inn.The staff is very friendly and personable. Felt like coming back home! Great breakfast in the mornings (filling up before all of the wine tastings!). The entire WCI property is secluded and quiet, but just a block off of the main highway. Very centrally located for the runs up and down the Valley searching for that perfect glass...The evening restaurant shuttle is very very nice. Janelle, the driver, is a hoot! Will definitely be coming back, and soon. The late afternoon wine tasting and appetizers is a great time to visit with others there and recant the day. All in all, a wonderful stay.", "title": "The fall colors of St. Helena", "helpfulness": 1, "user": "Bill R", "date": "December 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 186846824}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Multiple visits--Above average service and breakfasts! Wine and extra deserts for Thanksgiving added to making this a pleasant visit to the wine country. Desk help particularly helpful for driving suggestions and dining recommendations.", "title": "Great Holiday", "helpfulness": 1, "user": "Robert F", "date": "December 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 186845986}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "This place is adorable. My fiance' and I usually avoid B&B's because we don'l like all of the personal attention and just want to be on our own. This visit may make us rethink that. The location is perfect. Just a few miles away from some of the biggest wineries. The food was awesome. They even give you the recipe's to take home if you want and we will definitely be making some of it. They also had a wine tasting and appetizers for a few hours. When we went to the room, we couldn't believe how spacious it was. I would definitely suggest a room with a hot tub. we had our own private outdoor tub with a view of the vineyard. It was the perfect place to spend thanksgiving.", "title": "Amazing Stay- We will be back", "helpfulness": 1, "user": "matthew r", "date": "December 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 186476060}, {"rating": 5.0, "title": "Hospitality, quiet comfort and incredible expansive views", "text": "My five days at this very comfortable Inn left nothing to be desired. From the welcome to departure everything was done to ensure my stay was the best it could be. A designer bedroom complete with balcony, window seat, 4 poster bed with a great matress and fireplace that was set everyday ensured I would be happy just walking into this room! The breakfasts provided by Ryan and served buffet style even included recipes for the main dish. The 7:30 to 10:30 am time for breakfast is so very civilized! The heated pool and hot tub was a bonus in November. Happy hours were a great way to meet others enjoying this delightful Inn.", "user": "Marilyn W", "date": "November 20, 2013", "id": 185342448}, {"rating": 5.0, "stay_parameters": "Stayed November 2013", "text": "I must admit I really didn't want to spend this much on lodging in Napa Valley, but once I got there, I decided that we made the right choice and it was worth it. The views are spectacular from the rooms and common areas. The inn is surrounded by vineyards. We didn't use the pool or Jacuzzi but it was also beautiful. We did get a picnic at Dean & Deluca and eat it on the patio. Perfection.", "title": "Peaceful, serene and conveniently located.", "user": "SylLovesToTravel", "date": "November 18, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 185028722}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "We received a free night at Wine Country Inn from our grandson and his father and enjoyed it tremendously. It is the second year we have gotten such a great gift. We had planned to pay for a second night to prolong the pleasure, but things got too busy this year so we settled for the one night. The inn is so nice that it felt like a longer getaway! We had diner out and the next day after checking out we strolled around St. Helena, a lovely town. All in all, a great stay.", "title": "A touch of wine heaven", "helpfulness": 1, "user": "Grampy_Bob", "date": "December 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186912840}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "This was our first trip to wine country. We will definitely go back and loved the Wine Country Inn. Beautiful fall colors. Loved the St. Helena area. Hotel staff were great! Really enjoyed the private small winery tour we took with Wine Country Inn staff.", "title": "The Wine Country Inn in the fall", "user": "Sue Z", "date": "December 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 186900619}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "We have stayed at the Wine Country Inn many times. We love the property and the people. The cottages are perfect--close by yet very private and quiet. The staff is wonderful--they all treat us like long time friends. The accomodations are upscale without being pretentious. The location is perfect--very quiet, yet close to St. Helena and perfect access to both Highway 29 and the Silverado Trail. The free shuttle to restaurants can't be beat--no worries about parking or driving after a few drinks. Highly recommended!", "title": "Wonderful Inn", "helpfulness": 1, "user": "PRISt_Charles_MO", "date": "December 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186867096}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "We have been making yearly trips to Napa Valley and have stayed at the Wine Country Inn the last 5 years. It is a great location , friendly staff , and excellent breakfast. Definitely a 5 Star! We are going to bring our grown children with us next year and introduce them to it.", "title": "Wine Country Excellence", "helpfulness": 1, "user": "Padge1", "date": "December 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186857942}, {"rating": 5.0, "stay_parameters": "Stayed October 2013", "text": "Our experience during our Engagement weekend could not have been better. Amazing free breakfast and apps. Amazing wine tour at a great price. Great service. A phenomenal room. The place was just very welcoming with great energy. We were driven to and from dinner and sneaked into restaurants that were booked. We will not stay anywhere else in Napa!", "title": "Absolute perfection for our Engagement trip", "helpfulness": 1, "user": "Stephenmull", "date": "December 5, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 186851254}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Staying at the Wine Country Inn was a great experience. The rooms are decorated with wine country elegance. Fireplaces and Jacuzzi tubs, balconies overlooking the property and all the amenities you would expect from a $350 per night room. The property is reminiscent of Old Europe and the service was outstanding. A delicious breakfast buffet (they'll give you the recipe if you like the food) from 7:30 to 10:00 every morning and a fun happy hour with wine tastings every afternoon. Ask Janelle, the transportation van driver where to go for dinner and she'll give you great tips, then take you there and pick you up.", "title": "Relaxing and romantic with great service", "helpfulness": 1, "user": "TreasureIslandBill", "date": "October 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183081137}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We have been enjoying the Wine Country Inn for many, many years, and hope to for many more. We love the views of the vineyards and love relaxing on the private patios of the villas, or in front of the fireplace inside. The Inn is located right off the \"main drag\" for winery tasting, but set off from the heavy traffic. The management and staff has always been so welcoming and friendly. The setting of the Inn is so beautiful, with walking paths through the gardens. The pool and hot tub are perfect after a long day of wine tasting! The breakfasts and afternoon wine tasting with appetizers are always inventive and delicious...their homemade granola is outstanding! The rooms are always clean, the beds so comfortable, and service is outstanding. The villa baths are amazing! Truly is and hopefully always will be our go-to residence when staying in Napa. You may pay a little bit more, but it is absolutely worth every penny!", "title": "Our home away from home", "user": "Eileen R", "date": "October 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 182562251}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "My wife and I were looking for a relaxing getaway and love the outdoors so we picked this Inn although its more expensive than I usually want to pay. From the moment we arrived we were delighted by the beautiful country setting and relaxed atmosphere. We had Room 1 only a few steps from the gardens and pool. Highlights for us were cycle riding through nearby vineyards (try the Franz loop), hiking to Coyote peak, early morning swims as the sun came up, and getting to know Calistoga. I would recommend this inn to frazzled couples who are looking for a place to recharge and are active, outdoor types. There is not much going on at the inn itself except for a nice pool and of course the afternoon wine-tasting, but the location is stunning and the staff very friendly.", "title": "Relaxing couples getaway in bucolic setting", "user": "Boston1964", "date": "October 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 182491986}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Wine Country Inn was a recommended, yet still unexpected, haven of relaxation, comfort, and enjoyable experiences. Hubby and I spent a couple days in San Fran and then drove up for a couple days to relax and unwind in Wine Country. Ohhh, how we wish we had skipped the bay area and just spent all of our time at WCI! We're already counting down to our return trip...", "title": "Already counting down to our return to WCI...", "user": "missnb", "date": "October 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 182468425}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "The PEOPLE are the heart of the Inn, making you feel warm, welcomed, and right at home.", "title": "Can't wait to return", "helpfulness": 1, "user": "Hawkro", "date": "October 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 182274131}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 9, "average": 12, "very good": 45, "terrible": 2, "excellent": 272}, "aka": "The Wine Country Hotel", "slim_ranking": 0.125, "detail_rating": {"service": 5.0, "cleanliness": 4.5, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "The Wine Country Inn sits atop a landscaped knoll overlooking and surrounded by the vineyards of the world-famous Napa Valley. Casual, comfortable luxury is the hallmark of this renowned hostelry, from its thoughtfully prepared food and eclectically designed guest rooms to its vibrantly planted strolling grounds where a new view awaits your every turn. Family built, owned and operated for over thirty-eight years this model of hospitality welcomes and pampers its guests."}