{"user_rating": 3.0, "review_count": 381, "name": "The Inn at Opryland, A Gaylord Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We only stayed here one night. I booked our stay through hotel.com and got in on a 24 hours sale. We had and exterior corridor room with a king bed and paid $62.50/night. The room was clean, quiet and the bed was comfortable. Decor was a little dated. Bathroom is VERY tiny, but clean. Staff was friendly. Parking was free. Free shuttle to Opryland Hotel, General Jackson and Grand Ole Opry. Indoor pool looked nice, but we didn't use it. Was worth the price I paid.", "title": "Nice Hotel for price", "user": "IllinoisEscape", "date": "August 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 38680241}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Stayed at this Radisson back in December when booked with the Classic Christmas Package. As I write, I have just booked the All-American Country Getaway Package for October and again will stay at this Radisson. Very pleased with accomodations, friendly staff, decorated beautifully (inside and out), great availability to restaurants and shopping.", "title": "An experience about most.", "user": "jancsapp", "date": "August 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37503824}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "We stayed at the Radisson Opryland for 12 nights over June/July and had a blast. It was our fourth stay there so we knew what to expect, but once again we were delighted.", "title": "Great hotel with terrific staff!", "user": "derbysteve", "date": "July 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 34496880}, {"rating": 5.0, "stay_parameters": "Stayed June 2009", "text": "The hotel is out of town in Music Valley but perfect for our needs. There are great family restaurants nearby, the quite superb Grand Old Golf and Games up the road a short walk away, and all the pleasures of the Opryland Hotel and Opry Mills just a 15 minute stroll away, although the hotel operates a half-hourly shuttle between them.", "title": "Great Location, great staff", "user": "sainnj", "date": "June 11, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 32118837}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The desk staff are, without exception, really nice. They're professional, efficient and friendly and happy to help in any way. They booked a great car for us to go to Franklin and were seriously impressive - take a bow, guys and gals!", "title": "Don't Judge a Book by it's Cover", "user": "pekinIL", "date": "April 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28951932}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "We stayed at the Radisson Opyland from Nov. 30 - Dec. 3, 2008 as part of the Gaylord Opryland Country Christmas package. The only reason that we chose to stay here instead of the Gaylord resort was because the Radisson is a pet friendly hotel and my mother and father in law never leave their dog anywhere! The hotel was nice - the rooms were clean and comfortable but nothing fancy. We had an interior room on the second floor with a king sized bed and although I didn't find our bed to be very comfortable, I spoke with some guests who had opted for the sleep number beds and they were absolutley raving about how comfortable their beds were! The hotel staff was fantastic - very polite, welcoming and accomodating during our stay and the lobby looked gorgeous all decorated for the holidays. Also, it was so nice to have the complimentary shuttles that ran to the resort as well as the Opry Mills mall, and the Grand Ole Opry House. My husband and I would have been happy to walk - as everything is pretty close and sidewalks are available, but the weather was pretty cold, windy, and rainy during our stay so it was quite nice to have a warm dry ride everywhere (without paying for parking!). The hotel is nice and reasonably priced - it's certainly not a luxurious property, but it was clean and well maintained and the right choice for us as we needed a place where we could bring a small dog. My in-laws were also quite pleased with their room as it had an outdoor entrance and was close to the small dog park on the property. All in all - it was a good stay and the right choice for us on this trip!", "title": "nice stay", "user": "inspiredescapes", "date": "December 10, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 4.0, "location": 4.0, "value": 3.0, "rooms": 3.0}, "id": 22614213}, {"rating": 2.0, "title": "Renovate Renovate Renovate", "text": "Strengths - great location, shuttle to the Gaylord Hotel and OpryMIlls, nice customer service associates, bed slept well, and nice lobby.", "user": "imsmilng", "date": "November 23, 2008", "id": 22123045}, {"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Weaknesses - carpet needs replacing, few channels on outdated TV, entire room needs updating.", "title": "Double Charged--Horrible Response--Multiple Problems", "user": "paulafisk", "date": "September 25, 2008", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 20363766, "likes": {"liked": "— location", "disliked": "— Terrible response for a huge error they made to our debit/credit cards and they still have not resolved. Old rooms.."}}, {"rating": 4.0, "title": "apprehensive - but turned out well!", "text": "If you go for the strengths listed, you will enjoy yourself. If you like to relax while in your room, you may be alittle disappointed. This is our third visit here so we have seen better times there. Would we stay again? Yes, when there is a renovation announced.", "helpfulness": 1, "user": "detoured", "date": "September 11, 2008", "id": 19972926}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Cheked in on September 18th only to find out they did not have our reservation, which we did on line (and had a copy of)--guaranteed with our debit card. Lady at desk (who seem very confused) said they would still give us a room and were checked in after quite an ordeal at front desk. Stayed three nights--room was very old and had an odor, fan and closet door broken and sleep number bed (which we paid extra for) was poor quality. Checked out on September 21st and charged stay to our credit card. When we got home, checked out balances on line and found out our debit card was charged (this was the reservation made on line that they could not fine) and also the credit card we gave them upon check-in was also charged. It is now September 25th and my checking account is overdrawn because of this error...multiple calls to the hotel still have not produced any results. Very, very unhappy!!!!!!", "title": "Not as bad as expected", "helpfulness": 1, "user": "allyboo", "date": "August 10, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 18828443, "likes": {"liked": "— location", "disliked": "— Pool smell"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We stayed at this hotel for two nights to attend the Grand Old Opry birthday celebration and were very pleased with the service. All the personnel at the front desk were very courteous and helpful and always greeted us with a smile. I used the online Express checkin before we arrived and all our paperwork was complete and our key waiting for us. This took a minute to check in and we were on our way. No lines to contend with. If you're a senior book the senior rate which includes an indoor courtyard room with king bed and free breakfast at the adjoining Applebys. Our room was spacious with nice bedding and a sleep number mattress. We had no issues with noise, but then again there were no conventions that weekend. The housekeeping staff were efficient. If you want value consider this hotel. There is a shuttle that runs every half hour to the Opryland Hotel and Opry Mills and parking is free. I am very fussy with my accommodations and this hotel met my expectations.", "title": "No complaints", "user": "hollywoodChicago", "date": "October 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 46586553}, {"rating": 2.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "The room had a funny smell. It smelled like an old, stinky hotel room. We could not find a parking place due to a Geek/Media Fest that was at our hotel that we knew nothing about being there that weekend so we circled for an hour trying to find a parking place. The front desk person announced our room number out loud when we checked in and the people behind us in line heard that. It is very unprofessional to announce a room number when two females are traveling and strangers knowing their room number.", "title": "Not what we expected", "user": "jmcafee", "date": "October 8, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 46241310}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "This is a good hotel with excellent staff who accommodated every misstep of my trip: company credit card auth missing, dead car battery, toilet overflow - all handled efficiently by their pleasant staff. I would definitely stay here again. This is a great place for families. The Dog Park was a bonus - if only I could've brought them along.", "title": "great friendly staff", "user": "CreoleBarbie", "date": "October 6, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 3.0}, "id": 46048065}, {"rating": 1.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We got there on Friday afternoon and checked in. We realized there was a Geek Convention. There was a letter in the room warning that there may be noise due to the convention activities. The room was okay but not what we expected at a Radisson. The air conditioner was very loud and would go on and off about every minute. We went to dinner and got back to our room around 7:30 to get ready to go to Grand Ole Opry. The walls were vibrating because of the noise in the ballroom. We called the desk and they told us they would move us to another room when we got back from the Opry. When we returned we were moved to another room. It did get us away from the ballroom noise but the air conditioner was the same and the traffic noise outside the room was terrible. We got no sleep at all. With all this said, the employees were very nice. We did stay the next night because we had already paid for the room but would never stay at this motel again. Also, there was not enough parking.", "title": "Terrible", "user": "justmarried709", "date": "October 6, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 46048034}, {"rating": 2.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Do not make online reservation without first calling the hotel to see if they are have an event that that occurs in the open area by the pool. When we stayed they were haning a geek media convention that was VERY loud and all guests were told it would be over a midnight so deal with it. Well if we dealt with it until midnight then the participants moved to the hallway outside our room and screamed karoke , yelled to each other, slammed doors all around us, and ran the hallways until 230am!!!!!!!!!!!!!!! NO SLEEP!!! The room was fine. The noise was unbearable and the staff unconcerned!!!! To add insult to insomnia it took over 30 minutes driving the parking lot to find a place to park when we came in that evening. If they are going to have that kind of events they need better parking and planning to arrange guests so that they are not in the middle of the noise if they are not part of the event.", "title": "Terrible noise and parking", "user": "tlm09", "date": "October 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 2.0}, "id": 45750253}, {"rating": 1.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "RATISON", "title": "OMG Ratison, shuttle bus hours and condition", "helpfulness": 2, "user": "Vacationetts", "date": "April 10, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 27735656}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "1. We arrived early to attend Chess Super Nationals 2009. The rooms were not ready (fine we were early) so I informed reservation desk we would return after the Chess tournaments last rounds. I ask that they note we requested a refrig for medical reasons during booking. My 9yr. old child is HFI he may not eat any form of fructose or sucrose. I have no choice but to bring food. They had given away our booked double inside room and the refrig. when we returned at 9;30 pm. They only had a single king bed room left.", "title": "It was a good room in a great location with a great rate and accommodating staff.", "user": "HikerIowa", "date": "March 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 27181919}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "2. When booking through the Gaylord Opryland they connected us to the Radison\"Sister Hotel\" with a shuttle bus to bring us back and forth to the Chess Tournaments events. We jumped the shuttle after talking to the reservation desk only to be stranded at the Opryland hotel at 9:30 pm..The last shuttle was at 7:45 pm. Last rounds start at 7pm and can last 2-4 hours depending on the game. We had to walk back to the hotel after asking directions in a gift shop. Morning Chess rounds began the next day at 9am the shuttle bus started at 11:30 pm. One would think if an event attracts almost 6,000 players(under 18) plus their families the hotels would have adjusted the shuttle hours. My son has allegeries so the walk in the night air with spring trees and plants blooming made him sick. He coughed non stop all night. All cough meds are made witha form of sucrose which he can not have.", "title": "Accommodating", "user": "WellTraveled20yo", "date": "March 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 27032352}, {"rating": 1.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "3 The Radison had a flyer in the room that an ala-cart breakfast would be set up in the morning at 7am. It not only was not set up at 7am but at 7:35 the staff were waiting for someone to bring the cash box with the money and change. A line was waiting to pay for the few items available. I do mean few. cold ceral, instant oatmeal with brown sugar,and a breakfast sausage wrapped in potatoes that cooks on a hotdog rolling machine plus coffee,tea, milk and sodas. No Juice! This was a total joke! Nothing my son could eat.", "title": "In a nutshell....Crappy!", "helpfulness": 2, "user": "jlo9906", "date": "December 15, 2008", "detail_rating": {"cleanliness": 1.0, "front_desk": 1.0, "value": 1.0, "location": 4.0, "service": 1.0}, "id": 22746684, "likes": {"liked": "— LEAVING!!!", "disliked": "— Hated it, would not reccomend to anyone!"}}, {"rating": 4.0, "title": "Great Location", "text": "4.The room 's furniture was shabby, the chairs stained (I covered it with a towel so we could sit on it), the carpet sticky and the toilet had rust stains. The lighting was dim in the bathroom sink area. It was the smallest tub toilet area I have ever seen.", "user": "brokerr", "date": "December 10, 2008", "id": 22621176}], "location": {"country": "United States", "city": "Nashville"}, "stars": 3, "variance": {"poor": 67, "average": 94, "very good": 114, "terrible": 46, "excellent": 60}, "aka": "Radisson Hotel Nashville", "slim_ranking": 0.472972972973, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 3.0, "rooms": 3.0, "location": 4.0}}