{"user_rating": 4.0, "review_count": 342, "name": "The Feathers at Ludlow", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "Having read a poor review of the Feathers on Trip Advisor I wasn't sure what to expect, but was pleasantly surprised. Our room was enormous, a twin with 2 comfortable double beds and bags of character. It was, unlike other reviewer's experiences, spotless, and all the staff were friendly and helpful. It probably is a little on the expensive side but we had no complaints about the place...just one tip on Ludlow; if you're eating out at the weekend, be sure to make a reservation.", "title": "Feathers at Ludlow was great", "helpfulness": 3, "user": "Wirralmember", "date": "April 25, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3414768}, {"rating": 1.0, "title": "Dreadful", "text": "Having read good reviews of this hotel in the Sunday Times, my husband booked a surprise weekend for me at the Feathers. Spectacular on the outside but oh, what a disappointment inside. There was no-one on reception when we arrived, the area behind reception was cluttered, it took 10 minutes to find someone. The room was awful. The carpet was dirty, the curtains were falling off the rail, the bedhead was stained from greasy heads, the bathroom was in disrepair, unclean and bright yellow. We asked for an upgrade but the hotel was full. We checked out, explaining our disappointment and how surprised we were that they could charge a premium price for accomodation that was of a much lower standard than our home. The receptionist even agreed with us! Give it a miss.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "April 23, 2005", "id": 3399402}, {"rating": 1.0, "title": "big mistake", "text": "we were visiting friends near ludlow and decided to stay at the famous Feathers Hotel. Although the outside of the building is fantastic and the staff friendly enough our room was dirty, the carpet had not been hoovered, there were hairs in the bath and dirty tea cups. Perhaps not suprisingly there was a questionnaire in our room which I intended to fill in but that evening it had disappeared! I know there were refurbishments happening and I can only hope they restore the good name of what could be a stunning hotel.", "helpfulness": 17, "user": "A TripAdvisor user", "date": "September 5, 2004", "id": 2513895}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 28, "average": 69, "very good": 117, "terrible": 21, "excellent": 107}, "aka": "The Feathers At Ludlow Hotel Ludlow", "slim_ranking": 0.333333333333, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}}