{"user_rating": 4.0, "review_count": 1136, "name": "The Standard High Line", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "Phenomenal attention to details, good food and comfortable rooms. Service in Standard Grill downstairs was great, but I can't say the same for the reception guys.", "title": "Amazing", "helpfulness": 1, "user": "milenadj", "date": "December 22, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121972696}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "This hotel is different from any other hotel in NYC, if you love the area and you like glass building you'll love it. The bar on the top floor is probably the most beautiful bar I've ever seen: no need to explain just GET THERE!!", "title": "A must go hotel with great location in the meatpacking district!", "user": "Rorostar", "date": "December 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121941348}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Walking distance to every rocking place in the area: shops, bar, clubs, and restaurants...", "title": "Great Location - Dreadful Rooms", "helpfulness": 4, "user": "Elysia", "date": "December 20, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 1.0, "location": 5.0}, "id": 121930191}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "The rooms are not so big but they have all you need, and if you fantasize about making love in front of a window with the whole city underneath you this is the place where you have to go ;)", "title": "Great Hotel, Great Experience", "user": "Aaron S", "date": "December 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121916752}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "This is one of those hotels that you have to go to once in your life...", "title": "True NYC", "user": "sbajaj621", "date": "December 17, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121840701}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "A bit \"too cool for school,\" you'll find several room quirks where form beats out function by a mile. This may be due to the Lilliputian room size or just the way the hipsters like it. Do not stay below the 8th or above the 12th floor unless you are immune to sound of the club-scene, which is more the target of this hotel. Tell your cab driver to drop you off at the revolving yellow doors, since the a Standard Hotel cheapens the place. Also, bring a miner's headlight so you can see the buttons in the elevator since hipsters have infrared vision and no trouble seeing the numbers.", "title": "Cruise Ship Cabin in the Meat Packing District", "helpfulness": 1, "user": "BeachChair", "date": "January 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 122847948}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "I spent one night at The Standard last summer and I loved it -it's trendy and impeccably well kept.", "title": "Loved The Standard", "user": "MartinAdrogué", "date": "January 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 122835713}, {"rating": 1.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "I had a suite on the 9th floor which was big for NY standards and had floor-to-ceiling windows overlooking New Jersey -stunning view. The bed was extremely comfortable. Bathroom was convenient although the shower was part of the room (no door nor curtains), which was a bit awkward.", "title": "MISAPPROPRIATE CREDIT CARD CHARGES", "helpfulness": 5, "user": "Greg O", "date": "January 9, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 122818552}, {"rating": 4.0, "stay_parameters": "Stayed January 2012", "text": "The hotel is in the middle of the Meatpacking District, with nice restaurants, bars and clubs and close to some shopping areas. It's also close to Chelsea and 10 min walk from the subway.", "title": "Mafia between the Concierge and the Hotel's door man", "helpfulness": 2, "user": "BrazItalia_Travelers", "date": "January 8, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 122790278}, {"rating": 1.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "I would definitely stay here again.", "title": "Worst service I've ever experienced!!!", "helpfulness": 3, "user": "wef4", "date": "January 8, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 122743782}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "Well, the Gansevoort used to be my hotel of choice in the meatpacking district, but after my last stay I decided to give The Standard another shot (I stayed here over a year ago too) and this time they won me over. The rooms are smaller than the Gansevoort, but they are newer and quite comfortable (once you get over the fact that your room is exposed to the world via the floor-to-ceiling windows, that is). The bathrooms have glass walled showers that abut the bed and if you're staying here with someone you're quite intimate with, this can be fun. The shower has very good water pressure despite being one of those stupid \"rain shower\" heads. The one problem with the shower is that it is not enclosed so water that sprays off of you or the wall just pools up outside the shower soaking your bath mat. The sink in the bathroom is kind of silly form-over-function-esque but not nearly as foolish as those in the \"Dream Downtown\" rooms. Beds are comfortable, but unfortunately very low to the ground. I despise that trend in hotels. There is a built in \"couch\" and a small table to eat your unbelievably delicious room service on. That is something that should not be overlooked, by the way; the room service. It is the best I've had at any hotel, both in terms of food quality and the service itself. The staff are so nice and are always very prompt. The food, well, it's just incredible for room service. Do yourself a favor and order at least one meal from room service here. You won't regret it. The rooms have giant LG flat screen tvs mounted on the wall with difficult to use remote controls because of some inexplicable delay between the time you push a button when the tv reacts to that command. I have stayed here several times along with several colleagues in different rooms and it's the same for all of us every single time no matter what room we stay in. It's so strange. The front desk must get hundreds of calls a week about this awful inconvenience. The other bad thing about the Standard is the free wi-fi service. It is PAINFULLY slow because they want you pay $20 a day to upgrade to the faster connection. This is extremely frustrating, especially if you need the service for work. For a modern hotel, they sure do fail in the technology department. Overall, however, the Standard is an excellent hotel and one worth trying for business or pleasure.", "title": "Solid choice in the meatpacking district", "helpfulness": 2, "user": "AloeKeef", "date": "January 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 122422087}, {"rating": 1.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "This review is for the Boom Boom Room, bar on the 18th floor of this hotel. After my experience at the bar would NEVER stay at this hotel, which is a shame as I just had a delightful experience at the Standard in Los Angeles.", "title": "WHAT A JOKE!!!", "helpfulness": 3, "user": "DominicParamore", "date": "January 2, 2012", "detail_rating": {"value": 1.0, "location": 5.0, "service": 3.0}, "id": 122401773}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "The bar was full of a lot of people trying way to hard to be hip and cool -- so unimpressed. Have not seen this type of behavior since high school -- PEOPLE time to grow-up and stop trying to impress everyone.", "title": "Great location,very cool hotel", "helpfulness": 1, "user": "Victoria C", "date": "January 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122355406}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "We usually stay on the upper east side,but thought we would try the meat packing district for a different vibe. You are certainly in the thick of thing here, great location next to the highline,and close to the river.Very very trendy, especially at the weekend, when its certainly the place to be seen.The bar on the top floor has exceptional views on the hudson, service was very very slow and with attitude.We all had dinner in the grill on the first night, it was ok but not outstanding.Great shopping around the area, you dont really need to go up town, everything is here,Chelsea Market is especially good.I would certainly stay here again,due to the location and the vibe.Our room was on the 15th floor - cant remember what class of room ,it was not the cheapest nor the more expensive,it had a strange built in table with bench built around it,ok if you were to eat in the room, but seemed a strange use of space.The room had good hanging space,amazing river views and an adequate bathroom with large walk in shower and very deep bath.If you enjoy running there is a great running track along the river which is busy with cyclists,runners and walkers, it's safe and well lit( good for an early morning jet lag run)there s a gym with amazing views, but I did not venture up there.We stayed here in November and they were getting the ice rink ready for Christmas.", "title": "Honest Feedback - The Standard", "helpfulness": 6, "user": "Andrew M", "date": "January 1, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 122350229}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "Overall cool hotel - ice skating rink etc a nice touch (of course at a cost as is everything at this place). Concierge - rude and unhelpful (at least the ones I dealt with). Living in HK and a 13 hour time difference I sent a request for a couple of restaurant bookings. No reply. Followed up and was told (by reception) to email the concierge. They stand next to each other! Arrived and called concierge one morning to see if they could help with tickets to 9-11 memorial. Response was (quote) \"no - go online and book yourself\". USD 400 a night - really??? Stayed at SoHo Grand last trip and they were a delight. Next trip - no more Standard! Oh and so noisy - drunks at all hours in hallways. Staff no help when called. Locked out of room due to faulty door locks - service staff who fixed locks the only nice people we met.", "title": "Good hotel, great location in a fun part of town.", "helpfulness": 4, "user": "gisele m", "date": "December 30, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122278351}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We stayed in a standard king room 0811.", "title": "Loved it!", "helpfulness": 4, "user": "kellyincville", "date": "December 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122188916}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "Pros:", "title": "Fab Hotel", "helpfulness": 1, "user": "beckagiles", "date": "December 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122140403}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "-Great part of town. Close to everything but out of the hustle of midtown.", "title": "little cold. little out of the way. isolated.", "helpfulness": 2, "user": "jacksondc", "date": "December 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 1.0}, "id": 122085852}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "-The view from the room was amazing. We could see the statue of liberty, the empire state building and the new freedom towers going up. Love!", "title": "Value for money", "user": "Traveller_now387", "date": "December 25, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 122082895}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "-Very comfy bed. Fun open shower.", "title": "Nothing Special...but amazing view", "user": "silix", "date": "December 24, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 122064184}], "location": {"country": "United States", "city": "New York City"}, "variance": {"poor": 67, "average": 159, "very good": 334, "terrible": 71, "excellent": 505}, "aka": "The Standard New York Hotel", "slim_ranking": 0.471783295711, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Located in Manhattan's thriving Meatpacking District, the latest in hotelier Andre Balazs' collection of Standard Hotels stands commandingly above The High Line, the former elevated railroad undergoing redevelopment as a public park. 338 guest rooms on 18 floors, The Standard, High Line boasts unparalleled views of the Hudson River and Lower Manhattan, full business amenities, extensive event space and a state of the art fitness facility."}