{"user_rating": 4.0, "review_count": 518, "name": "The George in Rye", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "really lovely hotel , breakfast was great and our room, though small , was very luxurious . Its not cheap but worth it for a special night away . We got parking on the street outside . I didnt want to leave really !", "title": "lovely hotel", "helpfulness": 1, "user": "gabbie-TA", "date": "June 2, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 162760540}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "We enjoyed a family birthday party which was hosted in the Benson room. The food was excellent as was the service and the atmosphere. I would highly recommend the Hotel for private functions. The bedrooms were also very well appointed and in keeping with the character of this lovely old building.", "title": "A beautiful Hotel in the centre of a wonderful old town.", "user": "Andy4265", "date": "May 30, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 162385246}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "I would highly recommend a visit!", "title": "A Fabulous Stay", "user": "SueB28C", "date": "May 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162328128}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "We stayed for one night on Bank Holiday Monday for our anniversary. Rye was very busy and all the car parks were full but we were lucky enough to find a parking space in a residential area just a short distance from the railway station. We popped into The George about midday and asked what time we could check in and were told our room was ready. Then we were told we had been upgraded to one of the suites so the day was just getting better. The room was super and the huge bath a real treat. Breakfast the next morning was delicious with good quality ingredients. The staff throughout were polite and helpful and we would certainly return to this lovely hotel.", "title": "Weekend Rescued by The George", "user": "NettieSpagettie", "date": "May 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 162121639}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We had originally booked to stay at the Flackley Ash hotel for one night. However when we arrived we soon realised we had made a mistake - see my other review.", "title": "Disappointing", "user": "sally50Benfleet", "date": "May 28, 2013", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "location": 5.0, "service": 2.0}, "id": 162069307}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We love Rye and have been many times. We don't usually stay over but an offer came up on Groupon for The George and it coincided with our trip for Scallop week (can thoroughly recommend this event every February) so we thought we'd give it a go. In all honesty, whenever we had walked past The George we had assumed it was just a pub, and occasionally we had seen a wedding party there so we'd never thought about staying there as we assumed it would be quite noisy and rowdy. As it turned out, we loved it! We stayed in a room that was not attached to the hotel and it was beautiful. It had the feel of a log cabin with a huge, very comfortable bed. The bathroom was lovely with a large, powerful shower. There was lovely fresh tea available in room (tea pigs!) and biscuits. The only downside for us was that the room was next to some gates and we were woken very early by the sound of deliveries being wheeled over the cobbles. Breakfast was fantastic - it's the only hotel menu I know that has boiled egg and soldiers (for adults!) on the menu. The quality of the food and drink was excellent and the options for the buffet section were very tasty - particularly the homemade yoghurt. Once we'd checked out, we sat in the small lounge area and read our books and had a peppermint tea which was really relaxing, and the staff were so welcoming and friendly. I would thoroughly recommend this place!", "title": "Relaxing hotel, excellent quality", "user": "GrooveArmada58", "date": "April 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 159273868}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "Just back from a short stay at the George, where we had excellent service and two lovely (very quiet) rooms - adjacent, as we had requested. We found the George stylish but comfortable, with friendly staff and a good breakfast. I'd definitely go again and would recommend.", "title": "We loved the George", "user": "Annie01603", "date": "April 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159224391}, {"rating": 3.0, "title": "Not great !", "text": "Poor bar and restaurant service, hot water from from both taps in our room, ordered fillet steak and it came on a bread board! I normally eat from a plate! I get the concept but would rather not experience it.", "user": "ChristianPOP33", "date": "April 29, 2013", "id": 159172306}, {"rating": 2.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We actually had a lovely weekend but ended up concentrating on the bad points and didn't feel it was worth the money - shame...", "title": "Poor customer service", "user": "jo R", "date": "April 26, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 2.0}, "id": 158840315}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "Just got back from a stay in the George. Overall we were very disapointed and would not stay again. To be honest I was surprised by the positive feedback by others. Upon arrival there was a mistake in our booking. Despite requested rooms over 6 months previously and calling two times this week to ensure our requested rooms we were offered two rooms which were not up to standards i would expect for the money and which were far removed from each other despite requesting that we were put together. A mistake can happen anywhere but what I really found disappointing was the manner in which it was handled and I was made to feel a nuisance and that I was in the wrong (which I wasn't). The apology was not sincere and after much trawling up and down the steep stairs we eventually gave in and accepted rooms which I would say were adequate. The lady on reception also pulled faces behind my back which my mother happened to see which again I did not feel was particularly professional. In relation to the restaurant we booked this last night. I would say that this was fine but very expensive for what you got. The fillet steak was £19 and only included chips. A side of meagre brocolli was £3 extra. All in all I think they could do much better. Upon check out this morning the hotel manage was equally unfriendly and unapologetic and the lady we met yesterday. Will not be returning. Much better places who pride their customers and who offer much better value for money..", "title": "Classic and Classy!", "user": "MackyD", "date": "April 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158614756}, {"rating": 5.0, "title": "A little piece of heaven", "text": "This hotel is simply wonderful. The minute you walk in it just oozes comfort and it smells wonderful! We stayed in Room 12 and it was just lovely. The bed was huge and comfortable and the bathroom had a wonderful shower. The whole place is decorated beautifully and the breakfast was delicious. We only stayed one night but hope to return again one day; the honeymoon suite if I'm lucky.", "user": "Stargazer1608", "date": "May 9, 2013", "id": 160209685}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We stayed for two nights in a fabulous junior suite - a wonderful, huge comfortable bed with lovely Frette linen and really good pillows (I have just emailed the hotel to find out where they buy them!). The bathroom is amazing, a huge roller top bath, but also a massive double shower with drying area, lots of hot water and good pressure. The room door opens onto the entrance to the courtyard outside so that you don't have to go through the hotel if you don't want to. The first breakfast was excellent, the second day less so, the restaurant was crowded (wedding the previous day) service was slow and consequently the cooked breakfast somewhat dried up whichi was a shame.", "title": "Delightful Hotel - but pricey.", "user": "rikkitikkitaviLondon", "date": "May 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160061080}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We are able to book a therapist to come to our room and give a facial and deep tissue massage which was very good.", "title": "Wonderful stay =)", "user": "Puja S", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 159980101}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "I found the room rate on the high side (£326 for Saturday night) but overall thought The George a delightful establishment and we would definitely return.", "title": "Two Night Break", "user": "MaureenPUpminster", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 159902890}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Rye is lovely but the parking facilities are diabolical. The hotel has none and the staff are very helpful directing you via the one way system to a suitable paying car park, but we had to keep moving the vehicle for various reasons including a bank holiday market. And it's not great to arrive to find you can't even pause by the entrance to offload luggage (large local authority maintenance blocking the way on this occasion) so have to lug cases up the High Street. However that is not the hotel's fault. But if the local authority want to restrict parking in the narrow streets, they should provide enough paying parks in good proximity to the centre.", "title": "Charming and Homely", "user": "Soho_Travellers", "date": "May 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159834756}, {"rating": 5.0, "title": "Near Perfect", "text": "This is the second time we have stayed there , we had such a nice time last year we came again this year. It's perfect for a special anniversary.", "user": "Tony M", "date": "May 24, 2013", "id": 161667855}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "It has the sort of ambience that just oozes comfort and harmony and is really very relaxing . The decor and design is quite superb , the staff are very helpful , courteous and friendly. We loved the themed rooms . The bar had a great selection of local beer .The quality of the food is very good indeed , lots of local produce too. The baths showers and basins are of very high quality as are the bedside radios and light fittings , with great artworks , vintage and reclaimed accessories too . ( To the last poster , to turn out all of the lights at night or when leaving the room you remove your room card from the wall slot , a nice detail ).", "title": "Nice but not quite there", "user": "cut2quick", "date": "May 21, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 161406145}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Yes the dinner food menu can be a bit pricey and portions a bit mean , fish & chips and steaks were large though !", "title": "Lovely place but poor service!", "user": "Dana F", "date": "May 17, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 160973765}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The breakfast is wonderful , and very generous . You could eat enough at breakfast to least all day if you wanted.", "title": "Good hotel in a lovely town", "user": "StephenW259", "date": "May 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 160472202}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "At times the service was a bit stretched , but we were relaxing and didn't mind at all . All in all definitely five stars.", "title": "Nice in many ways but not quite nice enough", "user": "steena100", "date": "May 12, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 160429769}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 38, "average": 76, "very good": 149, "terrible": 20, "excellent": 235}, "aka": "The George In Rye Hotel Rye", "slim_ranking": 0.285714285714, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.5, "location": 4.5}}