{"user_rating": 5.0, "review_count": 954, "name": "The St. Regis Bora Bora Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "Wonderful and beautiful hotel facilities. Extremely friendly, helpful and professional staff.", "title": "Beautiful Hotel", "user": "RobertoChile", "date": "February 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13915423, "likes": {"liked": "— rooms and views", "disliked": "— prices"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Rooms, restaurants, gardens, swimming pool, beaches, spa, etc. are excelents. You can feel a great ambiance and the worries of the staff in order to offer you great moments and enjoy the best stay.", "title": "Honeymoon at St Regis Bora Bora", "helpfulness": 2, "user": "Passion4TravelNY", "date": "February 27, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13885421}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The manager is a high professional and kind person,as well as all the administrative staff.", "title": "Superb property on this island paradise", "user": "yomick", "date": "February 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13838646}, {"rating": 1.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "As everything in French Polinesia, it is overpriced. You can find the same facilities and beaches in other places for a much better price. Hear you pay to be in Bora Bora.", "title": "St. Regis: Patron Saint of Poor Service", "helpfulness": 38, "user": "boraborabob", "date": "February 17, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 13621387, "likes": {"liked": "— Cool gear box on the deck and great view from the closet", "disliked": "— Terrible customer service, management staff with little to no integrity"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Our honeymoon stay at St Regis was truly amazing. I've stayed at many luxury hotels but was totally blown away by the quality of the bungalows. The pictures I saw of the resort did not do the rooms justice. Everything was so much more beautiful. We never saw our \"butler\" but our room was always immaculate and whenever we returned to our room, there were fresh flowers, beds were turned; everything was always perfect!", "title": "Great Experience", "helpfulness": 1, "user": "tr8der", "date": "February 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13260271}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Excellent from the greeting at the airport to departure.", "title": "WOW Factor", "helpfulness": 3, "user": "socaldreamhomes", "date": "December 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12158567, "likes": {"liked": "— The Villas", "disliked": "— Main restaurant service"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "I spent 5 days in an over water villa that was stunning, well furnished and equipped, though perhaps not as private as I would have preferred our butler was extremely knowledgeable about the island and was very helpful. Pool area was great as was the Beach lots of water equipment, though I went mostly for the quiet and a chance to catch up on my reading. Computer room was no problem at all other than a couple of discourteous guests making a lot of noise. the service at the pool bar was perfect!! friendly staff and very accommodating. Service at the main restaurant was rather lack luster was really just sort of OK. The Lagoon restaurant was a definite 10+ Personally I think I would have been just as happy with a more authentic Polynesian feeling, but if your looking to be pampered. this is the place. I had read about the trash burning issue though this has been solved as the dump area was sold and is being developed by the Four Seasons. No more burning trash.", "title": "so dirty island!!!!!!!!!!!!!!", "helpfulness": 5, "user": "ratatouillette", "date": "December 20, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 11720867}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "very excellent hotel when you're looking far away!", "title": "unbelievably perfect", "helpfulness": 9, "user": "skelly6", "date": "December 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 11672864, "likes": {"liked": "— That view and the water. holy moly", "disliked": "— That I had to go home at some point."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "seem's to be so great but it's so dirty around.. garbages burn just in front, at the center of bora bora..", "title": "Amazing place", "helpfulness": 3, "user": "mooneysox", "date": "December 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11289746, "likes": {"liked": "— The setting and the service.", "disliked": "— That I had to leave."}}, {"rating": 5.0, "title": "Out Of This World", "text": "You're touching the paradise in your dreams but reallity has a bitter taste.", "helpfulness": 2, "user": "larskason", "date": "December 4, 2007", "id": 11247954}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "My wife and I spent 5 nights at the St. Regis on our 10 day French Polynesian honeymoon. It was an absolutely amazing experience. I can't say enough good things about the St. Regis, and have come to the conlusion that people that didn't like it there will probably never be pleased.", "title": "Great Experience", "helpfulness": 2, "user": "tr8der", "date": "January 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13022060}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "The over water bungalows are absolutely amazing, they're quite large, around 1800 sq. ft I believe and are furnished impeccably. The huge bathrooms we're my wife's favorite part and the 2 42\" plasma TVs and complete bungalow sound system were mine. Be sure to bring your ipod and ask for an adaptor and you'll be able to have your music library piped to any room in your bungalow.", "title": "Great but fine tunning needed", "helpfulness": 11, "user": "Waterglades", "date": "January 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12945460, "likes": {"liked": "— The Room", "disliked": "— Complete overcharging on non food services"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "The service was fantastic, all of the staff was willing to help with any request we had. We were told the resort was at 40% occupancy, but we felt like it was deserted. The main pool had only 12 lounge chairs and they were never full, peak time at the beach and we would count maybe 6 other people, we felt like we had the resort to ourselves. The food was excellent, the breakfast at Te-Pahu was good as well as the lunches, the service was also very friendly. Lagoon was excellent and was by far our favorite dinner spot, sushi take hadn't opened yet when we were there (May 07). The spa was great, we had a couples massage and thoroughly enjoyed it. We did the jet ski tour and it was one of the best things we did as it is a great way to see the entire island and experience some of the beauty of Bora Bora. We were not that impressed with Bora Bora itself when we took the ferry there and if I had it to do over again we'd skip it entirely. The food at Lagoon was so good we didn't even want to go anyplace else for dinner. We had an amazing time at the St. Regis Bora Bora and we hope to return there someday in the not too distant future.", "title": "Ridiculous Experience", "helpfulness": 13, "user": "ACPACPACP", "date": "January 20, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "location": 3.0, "rooms": 4.0}, "id": 12811510, "likes": {"liked": "— the overwater bungalow and the fast internet connection", "disliked": "— the staff and the restaurants"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "There are so many positives about this property and I have to be careful in writing this review as I know others will be waiting to read new reviews as they come on the site just as I did once we had committed our honeymoon to this property.", "title": "Fabulous!", "helpfulness": 4, "user": "Rat-ta-too", "date": "January 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12514362}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "So I arrived with all the comments from many reviews in my head and I think it goes to show that apart from the odd extreme review which may or may not be balanced (like photos of trash which DO NOT represent the Island AT ALL) my fello reviewers get it right and thats what makes this sight invaluable in world travel today.", "title": "Bit of a disappointment", "helpfulness": 5, "user": "Floridia", "date": "January 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 12267176}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "My wife and I stayed at the St. Regis Bora Bora in July of this year, after starting our honeymoon at Le Tahaa. I have written another review about that property, in general we left very pleased but a bit disappointed about the food there. We had been looking fwd to the St. Regis as the grand finale of the honeymoon. The St. Regis did not disappoint on any level.", "title": "Magnificent attention to detail makes the price well worth it", "helpfulness": 9, "user": "d81976", "date": "December 1, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11185320, "likes": {"liked": "— The enthusiasm and attentiveness of the staff"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "One thing that really struck both my wife and I was that we immediately felt as though seemingly every nook and cranny of the hotel experience had been looked after with care, and was superior at the St. Regis. Some quick examples, the complimentary champagne bottle waiting for us in the OWB was an older much better quality bottle than the bottle that had greeted us in Tahaa. The OWB was significantly larger, and more cleverly designed than at Tahaa. The spa was located in a much more asthetically pleasing location (near a man made lagoon stocked with really interesting marine life as opposed to overlooking an odd green pond at Tahaa). The internet was broadband on 3 computers in a lounge as opposed to dial up on one computer at Tahaa. Although we really spent very little time on the computers, this was an important little detail for me because I just want to have the ability to check the red sox scores and get back to the vacation. At Tahaa the one computer is either usually occupied or takes a while to navigate on the web when you finally do get on. Another difference, for breakfast, Tahaa claims to have a \"newspaper\" ready for guests. What that really is, is a one page print out of a summary from the International Herlad Tribune. That would not be so bad if it were readily available. However, it was not available on more that 50% of the days we were at Tahaa. At St. Regis, they actually print the entire newspaper of the USA Today, and several other papers, and have them sitting out literally every day for breakfast. However, the most important different for us was the food! We ate at the Jean Georges restaurant the first night and absolutely loved it. The Kobe Beef dish is spectacular. The restaurant by the beach is also fantastic.", "title": "Mixed feelings on the St. Regis", "helpfulness": 5, "user": "trvljess", "date": "November 18, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 10902667, "likes": {"liked": "— The bungalow", "disliked": "— The distance from the main area to the bungalow"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The property is very nicely laid out, and lovely. However, the thing that really distinguishes the St. Regis is their staff. Milton Sgarbi, the GM, has done a wonderful job of assembling a top notch group of people that are dedicated to making the experience a memorable one. What touched my wife and I was the incredible responsiveness if anything actually did go wrong. A quick example, we had arranged for a romantic candlelit dinner by the ocean on our last night. When we arrived at the restaurant, the reservation had somehow been misplaced, and there was another couple actually having a candlelit dinner in what I would assume is the usual location for this type of meal. The manager of the restaurant responded in an incredible manner, we were first invited to come sit by the bar where we were informed drinks were on them until a table could be prepared. The bartender then asked us what kind of drinks we liked, when we asked to see the menu, he actually told us no need for the menu if we wanted he would just mix up any type of interesting cocktail we liked. My wife and I are both fans of pomegranate juice, he created two really tasty and interesting cocktails for us based on pomegranate, vodka, and some other exotic juices. It was great! Meanwhile, we noticed over our shoulder that the manager had arranged for a new table to be brought out and set up by the water for us. It was also private like the original table would have been, and in just as nice a setting. The meal that followed was wonderful. We were really touched by the various servers that helped us that evening. There congratulations for our nuptials did not feel contrived at all, and they were very willing and eager to talk about where they were from in France or French Polynesia and ask us about New York. The bartender made several trips from behind the bar to our table to check on us as well as did the manager. The staff really made us feel like our enjoyment on our last night was really important to them, and it literally felt as though we had the full staff of the restaurant all dedicated to making this experience as wonderful as possible for us. It was definitely the most enjoyable and unique meal we have ever had at any restaurant and we still smile about it months later.", "title": "6 star prices not 6 star service", "helpfulness": 14, "user": "gemmifer", "date": "October 30, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 1.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 10437861, "likes": {"liked": "— The room was our favorite", "disliked": "— The service for the prices"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Some other quick notes about the St. Regis and Bora Bora.", "title": "Arguably One of the Most Beautiful Places on the Planet", "helpfulness": 22, "user": "Shiba-Inu-Parents", "date": "October 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10088601, "likes": {"liked": "— The World Class Over-Water Villa and the People who made our stay Magnificent", "disliked": "— Having to Leave (Only the Shiba Inu at Home was Happy)"}}, {"rating": 5.0, "title": "excellent!", "text": "Don't miss the shark and ray feeding tour. We went on sharkboys tour, and we both had a blast. My wife was really hesitant about going on this tour, but afterwards she wanted to do it again! The rays are so incredibly friendly, they are almost like puppies.", "helpfulness": 11, "user": "andreea81", "date": "October 3, 2007", "id": 10035120}], "location": {"country": "French Polynesia", "continent": "South Pacific"}, "stars": 5, "variance": {"poor": 17, "average": 36, "very good": 85, "terrible": 7, "excellent": 809}, "aka": "The St. Regis Bora Bora Hotel", "slim_ranking": 0.111111111111, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "description": "The exclusive St. Regis Bora Bora is 44-acre island resort located in Polynesian paradise. Our elite accommodation features the 13,000 sq ft Miri Miri spa and Lagoon Restaurant by Jean Georges."}