{"user_rating": 3.5, "review_count": 3616, "name": "The Milford NYC Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "We scored a great deal at this hotel ($99/night) and figured we couldn't beat the price for the location. We were prepared for a not-so-posh hotel but for the price, we were ok with it. The hotel was in the process of having some renovations done and the check-in line was atrocious but once we got to the desk, the check-in desk folks were pleasant and accommodating. The room, as many have already commented on, are SMALL! Even by NYC standards. However, they make good use of space and the modern design and appointments really make up for the lack of space. And who goes to NYC to sit in your room all day?!?! The location is great - in the middle of it all - and I definitely thought it was a good deal for the area. Don't expect the Ritz but otherwise, it was a good stay.", "title": "Small rooms, great location!", "helpfulness": 1, "user": "shida_girlBoston_MA", "date": "September 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 176638735}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We stayed in the Milford Plaza for 2 nights and so glad it wasn't any more.", "title": "Great location, but tiny rooms", "helpfulness": 1, "user": "lynn t", "date": "September 10, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 176630354}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We were impressed on arrival and the location couldn't have been better.", "title": "Can't beat the location", "user": "Sketerbud", "date": "September 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 176628124}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "But, after a long wait to check in, made our way up to our room, which when booked was an executive room.", "title": "Great Budget Hotel Close To Times Square", "helpfulness": 1, "user": "Jo H", "date": "September 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 176567080}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "It was a small room on the back of the building. The double bed was barely large enough for my husband and I. there was a curtain in place of a door on the wardrobe space, and a sliding door on the bathroom, which was only there to give the sense of more space ( that's what we think).", "title": "Not Great, but the kids liked it.", "user": "Yvonne v", "date": "September 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 176558513}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Just returned from 5 night stay at the Milford, I must say that despite staying here before in 2003 and having an enjoyable/comfortable stay then, I was slightly concerned to read the reviews on here prior to travelling so much so that I considered cancelling, and rebooking elsewhere. I'm so glad I didn't!! Firstly it is clear that the hotel is undergoing renovation if this is going to bother you don't book, if you don't like intermittent traffic noise and busy lobbies etc then you probably won't be happy staying in any large hotel in New York especially one next to Times Square!!! if you can't fathom out the simple lift/elevator system (you enter your floor number and it tells you which lift to take, how hard is that?!) then you probably shouldn't be travelling unaccompanied anywhere!!! what you do get for a very reasonable price for it's location is a really comfortable room, a great location, fantastic friendly staff (especially security, front door and housekeeping) the renovations have provided this previously generic looking chain hotel with a quirky modern fresh identity, the hallways with their murals and lighting make the hotel even more unique and inviting. Having stayed in several more expensive hotels in the Big Apple on numerous occasions we honestly found this to be the most comfortable of all the hotels we've stayed in in the city. We also stayed over New Years and the hotel was close to full occupancy but we never once heard any noise from other guests or rooms, we also used the fitness suite on the 3rd floor which was well equipped and also renovated. All in all for the money we paid, comfort and service received this was our best hotel experience in New York and we've had some hotel experiences!!!!!", "title": "Fantastic location, great staff, very comfortable room", "user": "BrightonBoxer", "date": "January 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148908373}, {"rating": 4.0, "title": "Great Location", "text": "We booked this hotel due to its proximity to time square and where a bit worried die to some of the reviews we had read. As a result we were pleasantly surprised. The room was small as would be expected in a city but was clean and had everything we needed for the few hours we spent in it.", "helpfulness": 2, "user": "melodonn", "date": "January 5, 2013", "id": 148868207}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The hotel was still undergoing work to the lobby and reception area though it was starting kto take shape and looked good. A sign said there would be a roof top terrace opening in 2013 and really somewhere to grab a drink was the only thing that we missed at the hotel.", "title": "No problems with the Milford Plaza :)", "helpfulness": 5, "user": "The_Last_Unicorn", "date": "January 4, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 148808771}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The front desk stff were helpful and friendly. We did have probelsn with housekeeping one day and came back to our room not having been dealt with but the front desk staff resolved this for us (though they did have to put the request through to housekeeping three times).", "title": "Excellent Quality/Cost", "helpfulness": 4, "user": "DHMCK", "date": "January 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148780774}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "Overall a good stay.", "title": "Good if you're lucky!", "helpfulness": 1, "user": "Lamby-Bamby", "date": "January 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 148775440}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Stayed here for 3 nights just after new year with wife & 2 kids. Having stayed here before i was a bit worried reading the reviews here recently from some people but happy to say all was well! Arrived early & there was no problem checking in more than an hour before the official check-in time.", "title": "Still great value", "helpfulness": 4, "user": "buddie67", "date": "January 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 149182063}, {"rating": 1.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Room was small but comfortable. Bed & pillows very comfortable & extra blankets were available if we needed them but we didn't. Some instructions on how to use the air conditioner would have been nice but we got there in the end through trial & error! Also a free safe in the room as well which was a bonus. Room was cleaned every day & fresh linen/towels also.", "title": "Very disappointed", "helpfulness": 1, "user": "AZ_103", "date": "January 7, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 149081238}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Yes, renovations are still taking place but this is well advertised & we wouldn't have booked if it was going to bother us. We were out of the hotel all day anyway so no problem. Same with the wi-fi, there is a fee for this but we didn't go to NYC to sit in a hotel room or be on a computer all day. The entrance lobby did resemble the Burma railway most of the time but that just seemed to be people waitng for rides to the airport & didn't obstruct anyone getting to & from their rooms.", "title": "Basic and close to Times Square", "user": "Con B", "date": "January 6, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 148981805}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Why are people on here complaining about the elevators? You just tap in your floor number & it tells you what lift to use, we never waited more than a minute. Yes, there can be some noise from traffic (we were on 14th floor & still heard a bit) but if you want peace & quiet just avoid NYC altogether.", "title": "Great Location, Clean, Good Price", "helpfulness": 6, "user": "urememberd", "date": "January 5, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 148932589}, {"rating": 4.0, "title": "Milford plaza review by Allistair Jennings", "text": "The location is second to none & i don't think there would be another hotel at this price anywhere in the area.", "user": "Allistair J", "date": "January 5, 2013", "id": 148929110}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We have been going to the Milford for years and it seems the renovation has been going on this entire century. The rooms are quite small and appear furnished by Ikea but I don't mind it. And speaking of the rooms - who did the windows? Room 1253 was drafty thanks to the widows not being properly fitted and it has been the same with other visits. Rooms are clean and staff is great.", "title": "Average With Great Location", "helpfulness": 1, "user": "ojdidit", "date": "January 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 149357690}, {"rating": 4.0, "title": "Great hotel location.", "text": "We just paid $99 a night with breakfast so you can see the money you can save - just get on their promotions list. The breakfast they offered was at a small shop across the street and it was excellent.", "helpfulness": 1, "user": "Lauren W", "date": "January 10, 2013", "id": 149345670}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The real point is the location. Times Square is a block away. Bus and Penn station within a few blocks.", "title": "Great location. Clean, comfy hotel.", "helpfulness": 1, "user": "Jenny B", "date": "January 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149335124}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Stayed here for 4 nights this month and nothing bad to say about the hotel. No frills but since you are in New York you aren't going to be staying in the hotel apart from sleeping, which by the way the beds are amazingly comfortable and rooms are really clean. Great location right next to Times Square, which is excellent for people going to NYC for the first time. I would think that being near the top floor (floor 27) was keeping us away from any disruptions from the remaining renovations that were going on. I would stay in this hotel again, if going back to the city as it was a great central location and could find different places well. Empire State Building was a few blocks away so we just walked, which was great. The overall negative comments I seen before I went are obviously from guests that are very picky and expect a lot more than what they paid for.", "title": "AMAZING HONEYMOON EXPERIENCE!!!", "user": "JALM124567", "date": "January 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149334468}, {"rating": 1.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "We boyfriend and i stayed here for 7 nights and December. It was perfect for our needs; a place to sleep after a long days sightseeing and shopping! We were lucy enough to have a cornor room on the 25th floor and it was HUGE with two windows looking out over New York. We looked in to a regular size room while walking past and although they were quite a bit smaller still seemed good for the centre of New York. We found no problems with the lifts (which quite a few people have mentioned on here) and the staff were excellant, really friendly. It is literally a 3 min walk to times sq. and about a 5min walk to the nearest subway. Wouldn't think twice about returning here on our next stay - great hotel.", "title": "mixed feelings", "helpfulness": 1, "user": "tonycim", "date": "January 10, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 149310529}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "I booked the Milford in order to take two teens to visit NYC for the first time. I requested an upper floor and a room with a view to help make their first visit memorable. When we checked in I was impressed that the clerk had seen my request and promised to double check that the room we had been assigned was suitable. It was! I could not have been more pleased. We watched boats going down the Hudson from our room on the 22nd floor. My young traveling companions were thrilled and spent a surprising amount of time entertained by simply looking out the window. The location is wonderful. We were in Times Square until close to midnight and felt safe walking back to the hotel. When we returned, the hotel's security was politely asking guests to show their room card before they were allowed to board the elevators. I appreciated the hotel's attention to safety and the visible security personnel. Our room was small, but who spends much time in their hotel room while in NYC? The beds were very comfortable and we all slept well. The two layers of roller window screens are a great idea. The shades allow you to have anything from transparency to complete darkness without the bulk of heavy, dust catching, odor absorbing curtains. The only small change I would suggest to the management is to turn down the volume of the music in the lobby. When coming into the hotel from the noise of the city street, I had expected tranquility. Instead, it was louder inside the lobby than outside. (Of course, the teens did not mind.) I would definitely stay at the Milford again.", "title": "Great View and Location", "helpfulness": 1, "user": "MollyBright", "date": "September 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 176118986}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "The only good things are the location, comfortable bed, relatively quiet for midtown Manhattan.", "title": "Not so good", "user": "costip_trip", "date": "September 6, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 176030926}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "The bad things are that the paint on the door and wall was all chipped and the carpet looked like it was really 'used'. The room was small, smaller than other hotels I've stayed in. There are many tourists and the elevators are very busy. I've barely could take one to get to the room.", "title": "Great location", "helpfulness": 1, "user": "Julie D", "date": "September 5, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 175952434}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Best thing about this hotel: great location. Check in took at least 45 minutes due to a long line. Room was ok, clean. AC worked fine, room was cold all the time.", "title": "Great Location: right in the heart of the city", "user": "linda p", "date": "September 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 175893820}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Booked the hotel thru Expedia where it was saying they have free Wifi. Once I checked it, found out it was a charge of 14.99$ for Wifi.", "title": "Very Friendly Staff & Nice enough hotel", "user": "leigh m", "date": "September 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 175864536}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "My wife and I spent five nights here in September 2012. We had a basic room with a standard double bed. The room was surprisingly small with very little space to keep clothes so we had to live out of a suitcase. The A/C worked well, the bathroom was small but clean and everything functioned. Staff were polite and very attentive. After a few days I grew quite fond of our roomlett. It was quiet at night. The hotel is well situated for attractions. I would stay here again but get a room with two beds.", "title": "It grew on us", "helpfulness": 1, "user": "Sweedlepipe", "date": "September 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 176362357}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "A friend of mine who has been to New York suggested that I stayed in this hotel. His main reason for the suggestion is due to it's location. Considering I'll be travelling alone, a good location (near to almost everything and safe) seems to be something very crucial to me. When I was staying at the hotel, it is still under renovation. That is sometime in May, 2013. I've read about it a lot in the reviews here and was hoping that the renovation would be over by the time I'm there. It is a little hassle finding the drop off entrance as there is really no drop off entrance that will not block the traffic in the area. I'm not sure if it's a high season or the hotel has always been that busy, but the check in is a chaos. The lobby is a chaos. Guest luggage is everywhere. There's a line to check in. That's the first for me by the way. There's only one lift from the check in floor level to the rooms. If you prefer your bags to be carried by the door man, then you may take the stairs up a floor and take lifts (6 of them) to your rooms. I'm guessing this is a temporary measures as the renovation is still going on.", "title": "Renovation", "user": "K_Akit", "date": "September 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 176295873}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "The room, nothing impressive to mention. The size is pretty standard. I've been staying in smaller rooms in hotels in countries in Europe for the same price. The location is great. Which is the reason for staying in the hotel. Near to the time square. Just right behind the hotel. Few restaurants around. The most convenient was when I have pre-planned to watch the Lion King theater and it really is just a minute walk away. It ended quite late at night but since the hotel is just a minute a way, I was not to worry. Checking out, was...how do I put it...very convenient. I received a receipt under the door of my room the night before the check out day. Since, I've pre-paid my stay at the hotel, if I agree with the charges shown on the receipt, I can just leave the key in the key box at the lobby and leave.", "title": "can't get a better location!", "user": "thorlick", "date": "September 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 176293114}, {"rating": 5.0, "title": "Fantastic Hotel.", "text": "Just spent 5 nights at the Milford Plaza (Aug 29th to Sep 3). Would highly recommend the hotel for location alone. It's right around the corner from Times Square, next to theatres, restaurants,and in walking distance to central park & 5th ave. There was renovations happening while we there but the room we had was updated and clean (clean is the main thing I look for). The rooms might be considered a little small but there was three of us and we fit in there ok, but we weren't there to spent time in our room. There was a safe, hair dryer, air conditioning, beds were comfortable. You could hear noises from the street but with air conditioning on you couldn't hear it. I was impressed with security as well, we had to show our room keys when going back in the evening and they obviously have security roaming around the hotel floors as well. Felt very comfortable. It's a big hotel and lots of people coming and going, but I would stay there again in a flash.", "helpfulness": 1, "user": "Leanne F", "date": "September 7, 2013", "id": 176184746}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "We stayed here in Dec 12 for 4 nights. The staff were very friendly. Although the rooms were quite small they were very clean and recently refurbished.", "title": "Great location & service", "helpfulness": 1, "user": "Tamir D", "date": "September 7, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 176159938}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Stayed in Milford for 6 nights I have to say found the staff in the hotel excellent and very helpful,On the other hand the staff in the concierge not to polite found one in picticular to be quite rude,She seem to have a couldnt care less attitude,Leaving that aside the room we stayed in has two double beds which were so comfortable had great nights sleep.The only thing is I think they should put tea/coffee making facilities in the rooms as we had to go out to local deli first thing in morning and bring back coffee,The room was a little small but we didnt spend much time in it anyway but is was spotlessly clean,and cleaned and fresh towels every day.The renovations are still on going but they did not disturb us at all.We were on the 4th floor,and we had no noise at night.It is on the same streets as the theatres and all attractions are in walking distance Time Square is just 2 mins from hotel.It will be a pleasure to stay there again in the near future.", "title": "No frills but a great location", "helpfulness": 1, "user": "urs41", "date": "January 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 149297499}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The only reason I chose to stay here was because of the location! If you really want to stay at times square, then its not a bad option but otherwise I would pass. The rooms are comfortable but that's about it. The hotel is quiet basic for the money you pay.", "title": "Average Hotel", "helpfulness": 1, "user": "Simi M", "date": "January 9, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 149296698}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Also I found that the staff was not very helpful, among other things after check out before leaving the hotel my family and I wanted to use the guest rest rooms and the lady at the bar was rude ( we had to get the key from her) and actually refused even when I explained that we just checked out and have are waiting for a cab ! ( Not even left the hotel) !! with that I am sure I am not going back.", "title": "Great stay", "user": "Sarah C", "date": "January 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 149275827}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Stayed here from 4th to 8th Jan, 2 adults and a 12 year old! Checked in with no problems at all very quickly. Allocated a room on the 16th floor with a view of a wall, so hubby went back to reception and they gave us a room on the 4th floor with a view over 8th avenue, was worried about the noise, but not overly noisy that you could not sleep! Hotel clean and housekeeper came in every day, staff at the hotel very friendly and welcoming.", "title": "New York", "user": "wellieLeeds", "date": "January 9, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 149274302}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "hotel is in a great place with lots of things around and nice places to eat nearby.", "title": "Excellent location - value for money", "user": "Lassiedog", "date": "January 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 149190144}, {"rating": 3.0, "stay_parameters": "Stayed January 2013", "text": "I stayed here with my mum and sister in January this year for 5 nights. This hotel is in a fantastic location, it's about one or two blocks from Times Sq, within reasonable walking distance of Central Park, Rockefeller, Grand Central Station and Broadway. Plus it's Manhattan so you're never far from a bar or restaurant! We even managed to walk to Bloomingdales a few times, although I'd suggest a cab in winter (it was FREEZING!!). One of the bus tour operators start some tours a block away from the hotel so it's perfect for that too.", "title": "Great location but noisy and busy", "helpfulness": 1, "user": "Shellbell100", "date": "September 9, 2013", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 176530175}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The rooms aren't huge but I expected that. It was a bit snug for 3 but we barely spent any time in it when weren't sleeping. The beds were comfy too. However, there was a lot of building work going on which did cause some inconvenience. We waited quite a long time to check in too (45 mins after flying for 8hrs - that wasn't pleasant!). We also got an room that adjoined to another one and the noise from our neighbours was ridiculous at times, we could hear every word they said through the adjoining door and they weren't considerate at all.", "title": "Great Hotel, with Great Location", "helpfulness": 1, "user": "Danielle V", "date": "September 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 176453641}, {"rating": 2.0, "stay_parameters": "Stayed September 2013", "text": "But....this was still an ideal hotel for sight seeing. The rooms were clean enough and the maids were in every day. I've heard a lot of the hotels in New York are quite dated so at least they're freshening it up. Just maybe ask for non adjoining rooms! I'd stay again.", "title": "You can put lipstick on a pig...", "helpfulness": 5, "user": "Hspearmano", "date": "September 9, 2013", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 2.0}, "id": 176431953}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "My hubby and I stayed at the Milford from Thur-Tues over Labor Day weekend. We had originally traveled to New York to go to the US Open in Flushing, and extended our stay to do the tourist thing while in NYC. The Milford was great-the construction was a little obnoxious, but we were never in the hotel long enough to let it bother us. The lobby/bar area was great-newly done, with a great atmosphere. Make sure to check out the happy hour at the bar! We stayed in a newly renovated Queen room, and it was as expected. Small, but comfy bed, great AC (it was extremely humid and we walked everywhere), and everything we needed to get ready. We were mostly there to sleep at night. Black out blinds were great! If you're looking for a hotel close to Times Square and Hell's kitchen with easy access to the Subway station, then this is your hotel. Prices were very reasonable! Only bad thing is, we saw a cockroach walking down the hall on our floor-hubby mentioned that's what happens with an old hotel-still not the greatest thing to see during your stay!", "title": "Enjoyable stay", "helpfulness": 2, "user": "rwfranklin", "date": "September 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 176429596}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "So before I get into my review, let me preface this by telling you that my family and I are frequent travellers, myself for business every other month, and our family or my husband and I travel out of province/country at least once per quarter.... We've stayed in a lot if hotels.", "title": "Newly renovated in the best location", "helpfulness": 2, "user": "LiPiMiami", "date": "September 8, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 176386444}], "location": {"country": "United States", "city": "New York City"}, "stars": 3.5, "variance": {"poor": 404, "average": 950, "very good": 1395, "terrible": 353, "excellent": 514}, "slim_ranking": 0.708803611738, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.5, "location": 4.5}, "description": "The Milford NYC in Times Square...Middle of it all...1300 newly renovated guest rooms, 24 theaters, 43 restaurants, 102 shops...1 step from the lobby! Try it & share your experience! In the heart of NYC's Theater District, 1 block from NYC's Times Square & close to all the most popular NYC restaurants and attractions, the 1,300 Newly Renovated well-appointed rooms offer value for money. Other services include Hi-speed Internet access, multilingual staff, concierge desk for your tickets/travel and valet parking."}