{"user_rating": 4.5, "review_count": 1523, "name": "The James Chicago", "reviews": [{"rating": 5.0, "title": "Great Hotel!!", "text": "My husband and I went to Chicago for our 1st Anniversary. We stayed at James Hotel and it was a wonderful experience. It was close to all the shoppings, resturants, the trains and buses. We only took a cab once to another area and other times, we either walked or hopped on the trains. The staff was wonderful, they cleaned our room at least twice a day. All the equipments at the gym were new and very clean. And you must try the David Burke Prime steak house. We went there on Sunday night and they have the Super Prime Sunday dinner for only $42 per person. It was a four course dinner and it was worth every penny of it. We couldnt even finish it. There is a mini bar in the room but it was pretty expensive. So i suggest you to buy drinks from cross the street where they have a Trader's joe and they have a great selection of wines too. There is also 7/11 on almost every corner. If you are travel by plane and with only couple of people, I don't suggest to rent a car since the parking in downtown is a pain and the parking in the hotel is very expensive. There is a train from the Ohare airport directly to the downtown area. We took the train from and to the airport and very conveninece and inexpensive. Overrall, this is a great hotel if you are looking for something trendy and close to everything.....", "user": "MQ0705", "date": "July 7, 2009", "id": 34125281}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The service at the James Hotel was top-notch. When we arrived, it was 99 degrees in Downtown Chicago and our air conditioning didn't work. Every single room was booked, so we had to stick it out for the first night. The next morning, they moved us into a beautiful (larger) room while we were out on the town. We ended up spending the week in a king loft suite and it was incredible! And the bed is incredibly comfortable.", "title": "Amazing service in an unbeatable location", "user": "Mayhem72", "date": "June 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33558315}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "I can't stress enough how amazing the service is. Everyone has stayed at a hotel and felt like just another guest, but this hotel takes the time to give superior service. Every single employee of the hotel greets you and is sincerly helpful and nice. The spa was fantastic, and the gym had everything you could need! The rooms were spacious, clean, and fun! Also, loved the bath products (Kiehl's) and the extra touches like cookies at bedtime.", "title": "European Oasis in downtown Chicago", "user": "Lillylights", "date": "June 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33254446}, {"rating": 5.0, "title": "Excellent Choice for a special weekend in the city", "text": "It was our wedding anniversary, and the concierge arranged for a fantastic dinner with a surprise at the end... a lovely dessert with \"Happy 5th Anniversary\" painted in frosting on the plate.", "user": "lrgardener", "date": "June 9, 2009", "id": 31952086}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "I would never stay anywhere else when I come to Chicago, and we are definitely planning on returning. The location was prime... just seconds from Michigan Avenue, a mile from Millenium Park (easy walk) and blocks from the river. Worth every penny.", "title": "What A Fantastic Hotel", "user": "jl1464", "date": "June 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31307146}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "This was my second stay at The James and I'll definitely return again. Aside from it's great location near Michigan Avenue and all that Chicago has to offer, The James itself is just a wonderful hotel. The staff is friendly and very accommodating and the rooms are fun and modern with beds that are to die for. I went with a group for a mom and daughter trip, and the teenagers immediately sought out the BOSE sound system and cool projection TV. I didn't have time for the amazing massage in their spa that I had on my last visit, but there's always next time! Eat at Primehouse - the restaurant in the hotel - at least once during your stay. You won't be sorry. I love the workout room- it's nice and spacious - not something you see every day in a hotel. Everything was just top notch and we had a great time.", "title": "Best Place for a Chicago Getaway. Period.", "user": "carycomm", "date": "December 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52016712}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled with friends", "text": "For the price I was not really super impressed. Our room was was an ok size, something I would think of as really great in Europe, but a little small in the US, even in a big city. Check out was sort of a nightmare. It took nearly 40 minutes to get our car out of valet.The food in the restaurant was pretty good and the staff in the restaurant was great when you could get them. We were at our table for over 20 minutes before we even got water. And another 20 minutes between the waiter describing the menu and until we could order. The location was really good for Michigan Ave. shopping.", "title": "Nice place if you get a deal", "user": "francophile619", "date": "December 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 51578334}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "I love this hotel because every time I stay I can count on excellent service, a clean room and a great stay. The restaurant is fabulous, and the staff really goes out of their way to help you.", "title": "Reliably excellent", "user": "Ferocity", "date": "December 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51344590}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "Travel for my business is pretty flexible. We pretty much have our choice of major cities to work in, but for some reason we are always drawn to Chicago. I'm pretty certain it's because the James is such a fantastic place to stay.", "title": "Something to look forward to", "user": "JordanV", "date": "December 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 51238829}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "I look forward to the clean rooms and crisp lines, the nightly homemade cookie on my pillow, the delicious breakfast options in the restaurant, and the fun vibe of the lobby. I even miss the Kiehl's products when I leave.", "title": "My new favorite hotel in Chicago", "user": "zadkine", "date": "December 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51080983}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "By far, this was one of the nicest hotels I have ever stayed in - and it made celebrating an anniversary with my boyfriend such a memorable experience!", "title": "Hands down, best customer service EVER!", "user": "christylyn42", "date": "May 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30818947}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled solo", "text": "For starters, we called ahead to get suggestions for restaurants and bars in the area. The concierge couldn't have been more helpful and nice - and she obviously took note that it was our anniversary and informed guest services because when we arrived they said \"happy anniversary!\" and gave us a complimentary room upgrade.", "title": "Excellent Hotel", "helpfulness": 1, "user": "Chris416", "date": "May 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30763639}, {"rating": 5.0, "title": "Favorite hotel in Chicago. Better than the Peninsula", "text": "The hotel is impressive - the lobby and bar are gorgeous and the studio room we stayed in was very trendy and well-kept. The maids did a great job of cleaning up the room and even at night when they came to turn down the sheets, they cleaned things up a bit again and replaced towels.", "user": "DcTravelalot", "date": "May 25, 2009", "id": 30736523}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "The location of the hotel is perfect! We parked our car and never once took it out of the lot or had to take a cab. You are literally on Rush Street and only a block away from Michigan Avenue. We walked to the Navy Pier, the John Hancock Tower and to various shops and restaurants with no problems at all.", "title": "Excellent time at the James Chicago", "helpfulness": 2, "user": "charck", "date": "May 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30720007}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "Above and beyond everything, the customer service is great. Being a younger couple, my boyfriend and I have had experiences where we aren't always taken seriously as hotel guests. At The James, every employee made us feel extremely welcome and bent over backwards to make sure that we were having a good time. The concierge arranged all of our dinner reservations, and for one dinner, even arranged to have a car from the restaurant pick us up. Even though we were in town for only 2 nights, we genuinely felt like the hotel employees knew and recognized us after only a few conversations.", "title": "UNBELIEVABLE EXPERIENCE", "helpfulness": 1, "user": "Supastar147", "date": "May 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30534300}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The location of this hotel is perfect to get around the downtown area. The service of this hotel is impeccable. Everyone was extremely helpful and professional from the doorman to the front desk to the room attendants.", "title": "modern yet comfortable", "user": "limeynyc", "date": "December 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 50889252}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The beds were the best thing in the room. Very comfy and cozy. I want to buy one for my house now. I do wish that the hotel had humidifiers to offer guests. Chicago in the winter can be extremely dry on one's body. One final critique is that the shower temperature was not consistent. The temperature fluctuated to extremely cold to extremely hot throughout numerous showers.", "title": "Just a Fantastic Weekend", "user": "Buffed112859", "date": "December 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50426838}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "Would definitely stay here again.", "title": "Funky decor, shame about the lifts", "user": "Sal123", "date": "November 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 50222230}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "Dispite what other are saying, this was one, if not the best Hotel stay in Chicago I have had. I travel to the Big City about three times a year for pleasure and The James rates up with the best. I was upgraded and the staff made the stay worth my special weekend visit. I don't believe you will be disapointed.", "title": "Great price, good service", "user": "sibi4", "date": "November 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 49426973}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "I stayed in the James over a weekend while working in the Chicago area. The location was fantastic for shopping and sightseeing. My room was on the 14th floor so I didn't notice any of the noise that other reviewers have mentioned. I liked the decor (modern) and found the room comfortable and the free wireless very useful. The toiletries (Kiehl's) were particularly nice. We ate in the restaurant and it was OK. The main problem with the hotel was the lifts - I ended up waiting for my colleague for 15 minutes on one occassion as one of the two customer lifts was out of action and the lifts are tiny. I would also recommend that the staff not correct British guests when they use the word \"lift\" rather than \"elevator\" - after 15 minutes of waiting this is quite irritating.", "title": "Great hotel, pity about the noise!", "user": "pplios", "date": "November 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 49062877}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The James is just our style - modern, sophisticated, and service-oriented, without being pretentious. It is more than a bit like the Mercer in NY, without being cold, and without the outrageous cost. Our room was large, beautifully lit, and wonderfully appointed, and though it was a king bed, I don't think it was special beyond that. Great TV and bathroom, too. I've been in almost every hotel in Chicago, and this is one of the very best. If you can find a deal here, stay. You can only do better if you are at the Peninsula.", "title": "Finest Boutique Hotel in Chicago", "helpfulness": 3, "user": "fierydragon", "date": "January 4, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52616211}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "I'd recommend The James to anyone (we ourselves were directed by a local's recommendation). The design, comfort, service etc were all exemplary.", "title": "Pretty Much Perfect.", "helpfulness": 2, "user": "spencermfi", "date": "January 4, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52596007}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Likes:", "title": "Close to ideal", "helpfulness": 2, "user": "flyingfish182", "date": "December 30, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 52178350}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "All the basics were covered very well, from check-in to check-out. A.", "title": "Contemporary rooms with great location for shopping", "helpfulness": 2, "user": "Yarnbuilder", "date": "December 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 52080474}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Location was great (although there are many options in the area).", "title": "Excellent contemporary hotel in the heart of Chicago", "helpfulness": 2, "user": "ABC1980", "date": "December 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 52024663}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "First time going to Chicago and we couldn't have been happier with this hotel. Great location off the Mag Mile. Great rooms---clean, spacious, bright. Great service---the conceirge Toni was awesome. Very accomodating to late check out (it's usually 2pm as it is!!!)---that's incredible!!! The restaurant in the hotel David Burke's Primehouse was delicious and had the most incredible steak I have ever eaten. Try the doughnuts---awesome!!! You can't lose staying here. Has an awesome gym!!! I can't wait to go back!!!", "title": "The James Delivered!!", "helpfulness": 1, "user": "Desilu", "date": "July 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35288895}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Friendly and attentive service. Stylish and relaxing lobby/bar/restaurant. State of the art workout facility. Clean comfortable rooms. Perfect location. We will be back.", "title": "Our new favorite city hotel!", "user": "MoensIowa", "date": "July 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35149280}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "I try to stay at the James every time I happen to be in Chicago. There are other good choices in town, but nobody has what the James offers: superior service - aka class meets efficiency -, metropolitan design and comfort with an attention to details I found only at the W in Seoul, and what always plays a role meaning a convenient location ... Then they get to you with small unexpected touches that make the difference ie: I was about to take off and drive North, it was a hot July day...one of the staff members handed me a bottle of water. A small gesture. Unexpected and appreciated. The management AND the staff understand what we expect and more importantly, what we need. AND they consistenly execute against that.", "title": "Impeccable with an unexpected (pleasant) touch", "user": "Vera B", "date": "July 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35137153}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "I recently stayed 3 nights in the ultra swanky James Hotel. Located in Chicago’s premier shopping district, The Magnificent Mile, this hotel is the epitome of cool. Upon entering the hotel you are greeted with the sounds of jazzy deep house dance music. The decor and the ambiance of this hotel reads uber chic. At check in I’m given an environmentally friendly room key card made out of recycled cardboard. This is the first of many environmentally friendly features that this hotel has to offer. I do have to admit that I was not fully impress by the customer service that was given at check-in. The front desk attended was very dry and unwelcoming, he didn’t say much to me and did not explain how to get to the hotels hidden elevators. However I was determined not to let one persons dry attitude affect my over all view of the hotel.", "title": "The Ultra Swanky, Uber Cool James Hotel", "helpfulness": 3, "user": "LeBeat", "date": "July 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 34873758}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "Entering the Apartment Suite (room number 1108) my first reaction is to be turned off by how small the suite is. At only 650 square feet the Apartment Suite isn’t much larger that the standard rooms. However my disappointment is short lived after seeing the amazing view from the bedroom. The room looks straight out to Michigan Ave. and looks even better at night. As an amenity you will receive a plate of gourmet petit fours, cookies, a 350 ml bottle of wine and a personalized hand written welcome note. The room comes complete with a fully stocked bar. The bar has everything from vodka, pop, water, nuts and even a vibrator. Thats right. If you look hard enough you’ll find an adult pleasure kit hidden inside the bar.", "title": "Great Service, Location, & Value!", "user": "ChiTown16", "date": "July 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 34491684}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Stayed 16-19 Novemeber 2010 in Loft King Suite #1122.", "title": "Loved the James!", "helpfulness": 2, "user": "pelun", "date": "February 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 54986933}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "A hip hotel with a cool sleek design in a great location. Staff fantastic; very friendly and helpful. Entrance and lobby really trendy. Quick efficient check-in. We had booked a Studio King suite but were upgraded to Loft King suite. Large and wonderful with a media room/lounge area, living room and separated sleeping area. Brilliant good-sized bathroom with shower and bathtub. Media room really cool with a DVD projector and Bose surround sound system. Another large flat screen TV in living room and in the bedroom. Complementary wifi. Design very cool and room super comfortable. Nice wetbar. Excellent amenities. Sufficient clothing storage. Our room had view towards backside with no nice views which only negative. The bar hip and trendy. Plenty of people but not disturbing. Restaurant with nice décor and excellent food. Very poor european breakfast included in price. Excellent fitness room. Maybe only snag elevator wouldn’t take you all way down so had to pass reception/bar area. Concierge very helpful. Great stay in wonderful Chicago. Would return!", "title": "Wonderful Hotel - Wonderful Location - Wonderful Personal Service", "helpfulness": 1, "user": "StPaulygal", "date": "January 26, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54405204}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We recently stayed at this hotel and found everything to be absolutely wonderful. The rooms are beautiful, modern and CLEAN. Nice touch with Kiehl's products in the bathroom. Turndown service at night with a different sweet was also a nice touch.", "title": "Truly and easily one of the best hotels I've ever come across.", "user": "Ivy W", "date": "January 21, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 54060534}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The most impressive thing about the hotel was the staff was so friendly and personal - from the doorman who recognized us the next day and remembered where we needed to go, to the concierge, Bill, who was outstanding in providing us restaurant recommendations and shopping info, ANYTHING and everything, to the friendly front desk staff, and even the bartender who was an expert on the great steaks at the connecting Prime restaurant.", "title": "A+", "user": "Smairy", "date": "January 8, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52920947}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "The location is ideal, across from a Trader Joe's if you need a bottle of water, or a snack, a Marshall's across the street, to the Magnificent Mile 1/2 block away!", "title": "Great Hotel", "helpfulness": 1, "user": "Aisling13", "date": "January 6, 2010", "detail_rating": {"value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 52750423}, {"rating": 5.0, "title": "Great location and service", "text": "I had 16 friends in from college, and this was the perfect place. Great location. Bill, the chef concierge, steered us perfectly to Union for dinner. Could not have asked or more!", "helpfulness": 1, "user": "LMitchell4627", "date": "May 6, 2012", "id": 129482503}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Cool hotel with great lobby design and trendy art – unfortunately the art and design aspect was not reflected in the guest rooms. Rooms were slightly more average/bland then the rest of the hotel, and we would have appreciated a little more luxury in the bathroom – tub was too shallow to take a bath. Good location in Chicago; you can walk to all shops from The James Hotel (up or down N Michigan Ave., and up to W Oak St). Good 24-hour Gym in the lower level of the hotel with proper gym equipment. “Primehouse” Restaurant by David Burke (connected to the hotel) is worth a stop for dinner - go for one of their Dry Aged Reserve Steaks, opt for the custom Caesar Salad to start, and save room for 'Cake in a Can' - you can always store the left over cake in your room’s minibar fridge. Service at the hotel was okay, but for a Five Star Alliance Hotel no one went out of their way to ensure our stay was great. Overall 'okay' experience, but for a hotel that gets 'rave' reviews, a little underwhelming.", "title": "Good Hotel just not Great", "user": "MM-TorontoTraveler", "date": "May 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 129252310}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "What’s true in real estate applies to hotels in Chicago as well. The James Hotel is in a near perfect spot, one block west of Michigan Avenue, close enough to be right in the thick of things but removed so that you can breathe when you walk out of the lobby.", "title": "Location, Location, Location", "helpfulness": 4, "user": "pablo_a2", "date": "May 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 129169555}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "This was our first stay at the James and we will likely return; the hotel has that sense of understated cool, from the lobby and its Paul Frank bicycles to the contemporary colors and furnishings in the rooms. Before you book, here are a few things to keep in mind.", "title": "Perfect, Or As Close As You'll Ever Get", "helpfulness": 2, "user": "edyrp", "date": "May 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129167661}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The lobby is busy, it’s a little tight for space but really you won’t be spending a lot of time there anyway, the staff is attentive and checking in was a breezy. The elevators up to the guest rooms are cramped, no, seriously, cramped. If you’re at all claustrophobic you will need to take a deep breath, but remember, this is a small hotel, its and its not unexpected. We stayed on the third floor and to be honest the one issue that you’ll likely have is street noise. It is a city after all but still I’d say that there was a touch more street noise than in other city hotels. We also ran into issues with the roman window shade; the draw-pull was basically nonfunctional which meant that we had to turn the roll by hand which was enough of a pain that we kept the shade down and the room dark all the time, a minor nuisance.", "title": "Great location; Great amenities", "helpfulness": 1, "user": "Aparr1230", "date": "April 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129132251}, {"rating": 5.0, "title": "Great location, great room", "text": "We stayed at the James in March 2012 for a weekend. The hotel was hard to find using GPS, but once there, it was great. The lobby is a little cramped, but still beautiful. The rooms are designed with a minimalistic approach, but the bed is extremely comfortable. The bathroom was good as well. We stayed in a suite. The location of the James is great close to Michigan Avenue. David Burke's steakhouse attached to hotel is also phenomenal. The only downside is that both hotel and restaurant were pricey.", "helpfulness": 1, "user": "Jeroen W", "date": "April 30, 2012", "id": 129118917}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "The James has the perfect combination of location and service. Great staff, clean and it has the “James” signature that always has been offering. Rooms are fantastic, great bedding, turnover service is a nice touch, and toiletries from “Intelligent Nutrients” are awesome... daily showers were a perfect wake up!!! Breakfast was delicious with great service. Front desk service and concierge amazing great...There was a negative minor thing, related to the paint maintenance in some common areas of the building.... really minor thing... but they need to be addressed in order , for the management to keep up the standard of this hotel within the competitive market in the “Windy City”. Always will be my first option to stay in Chicago. Thank you to The James’ team.", "title": "Always great!! still my Choice No1 in Chicago.", "helpfulness": 1, "user": "mancho", "date": "April 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129010895}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Great location, one block from magnificent mile and within walking distace of fabulous restaurants. Exceedingly friendly staff and service. Comfortable beds but bathroom layout with sliding door is a bit odd. Overall, would recommend hotel to anyone visiting the windy city.", "title": "Can't beat the location", "user": "torino006", "date": "April 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128980771}, {"rating": 4.0, "stay_parameters": "Stayed February 2012", "text": "The James Hotel in Chicago was wonderful. It is a rather pricy hotel but you can find some great packages on their website. The doormen are friendly and attentitive. The hotel staff is warm and accommodating and the hotel is quiet. We did have a bit of miscommunication with the front desk regarding some changes but they more than made up for the inconvience. Our only complaint was the night we stayed there was a jazz musician playing out on the street until about 11:00 and the garbage truck was on the street bright and early at 7:00. The recent remodel was beautiful. The next time we're in Chicago we will definitely stay there again.", "title": "Wish we could have stayed longer!", "helpfulness": 2, "user": "asteinmetz", "date": "April 23, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 128447522}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We stayed at The James recently and were very disappointed, given other excellent reviews of this property. The staff was friendly and helpful, but the room we were given was very basic and unappealing, on a low floor, and the hallways and elevators had damaged walls and filthy carpets. The noise from street traffic below made it difficult to sleep. The gym, located in the basement, was without windows and overcrowded with equipment. The highlight of our stay was dinner at David Burke's, which was excellent, along with the service. As far as choices for boutique hotels in Chicago, there are much better options with beautiful architecture, interior design, good gym and/or spa facilities, swimming pool, and other amenities, such as Kimpton hotels and Radisson Blu Aqua.", "title": "Coasting on past reputation/reviews?", "user": "Isabel1958", "date": "April 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 128432850}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled solo", "text": "I very much enjoyed the James Hotel, especially since I got a rate of $169 through TravelZoo for a Deluxe Queen room.", "title": "Great location, especially at this rate", "helpfulness": 3, "user": "Rocco46", "date": "May 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7642254, "likes": {"liked": "— Location, quiet, quiet, quiet, value", "disliked": "— Parking is next door, but quite pricey."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Check in was very quick and very professional. I had a room on the 16th floor, facing Ontario Street. I never, however, heard any street noise, or any noise, really. The room was very quiet. The room was very large, with room for a large chair and ottoman and a small table and bench/sofa, in addition to the queen size. bed.", "title": "Hip & Trendy hotel in a great location!", "user": "krystennicole", "date": "May 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7640921, "likes": {"liked": "— The location and the decor", "disliked": "— Overpriced mini bar"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The decor was white, white, with more white, which I wasn't totally crazy about, but it wasn't too distracting.", "title": "Darned Interesting place", "helpfulness": 1, "user": "MDW-BOUND", "date": "May 10, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7586327, "likes": {"liked": "— Fun and hip", "disliked": "— The couch and chairs were not comfy, but the bed was great!"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "Great location, lovely staff. I always stay here when in in Chicago", "title": "Funky Hotel", "user": "Jonathan S", "date": "May 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129947063}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Great gym, delicious breakfast (love the potatoes), good service overall. Stayed in a loft room - fantastic space but my only comment to travellers is consider a basic room as you can then get a view. Loft rooms all face inside and there isn't anything to see but someone else's room across the courtyard. What I particularly liked was that gym which is one of the best I've seen in a hotel, the location can't be matched and very good wifi. Another comment about the loft room - again, love it, but as a business traveller I immediately noted there was no desk or decent workspace. Bed fantastically comfortable.", "title": "Excellent boutique hotel", "helpfulness": 1, "user": "alexsw1", "date": "May 12, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 129824173}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "We picked this hotel for it's location and were not at all disappointed. We could walk virtually everywhere we wanted and were only a couple blocks from a metro station. The rooms were nice, although a little small for my taste. Nice King sized bed that seemed a little cramped. Our bathroom was also pretty small and the door didn't work very well. Concierge service was really helpful and nice. This hotel even offers to rent or lend bicycles to take city tours and there is a highly rated steak house downstairs. Overall the hotel is nice, comfortable and in a great location.", "title": "Great location and service", "helpfulness": 1, "user": "chimchim171", "date": "May 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 129764048}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "This is a small, modern boutique hotel located just one block from Chicago's magnificent mile. I couldn't have picked a better location for a quick overnight stay in Chicago. We were upgraded to a suite and it was just perfect.", "title": "Great hotel, great location!", "user": "lhooq19", "date": "May 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129586751}, {"rating": 4.0, "title": "What a Nice Place to Stay.", "text": "The staff were wonderful--gracious and courteous. I usually don't consider my experiences with staff when giving a rating but everyone was so exceptional that I feel they deserve some accolades. I will definitely stay here again the next time I'm in Chicago.", "user": "GLaker", "date": "May 7, 2012", "id": 129507986}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Dates: 19-23 April 2012", "title": "Enjoyed the James again... even more", "helpfulness": 2, "user": "pelun", "date": "May 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130356116}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Webb: www.jameshotels.com/Chicago.aspx", "title": "Really great city centre hotel", "helpfulness": 1, "user": "Lou_C07", "date": "May 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130289606}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Internet: Free", "title": "Cool Hotel in great area of Chicago", "user": "cruzinfagans", "date": "May 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 130243704}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Style: Boutique luxury design", "title": "Impressed with service", "helpfulness": 1, "user": "LOB16", "date": "May 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130137738}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Situation: Perfect. Close to Michigan ave.", "title": "Loved it!!", "user": "Vicky3030", "date": "May 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130125371}, {"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "This is a great boutique hotel with fun, modern rooms and a great location! We had a great time, however, when we arrived at the hotel I was informed that even though we had contacted the hotel and requested a non-smoking room (my wife is pregnant) that since we booked through Hotwire they were unable to accommodate the request. They then told us that we could have a non-smoking room if we were willing to upgrade (for a fee) - which basically said to me: \"we have a non-smoking room...but not for you, since you booked through Hotwire.\" We ended up paying the fee (I didn't want my pregnant wife to be in a smoking area of the hotel) and got a room with two double beds (of course we had requested a King sized bed, but it was either that, or pay even more for a non-smoking king room).", "title": "Good hotel, great location, bad service.", "user": "figgynewton", "date": "July 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 35763183}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "Bottom line: this is a great hotel with a great location, but don't expect any decent service if not booked directly with the hotel (and based on their check-in service, I'm not sure if you'd even get good service if you did actually book through the hotel). I'm sure that there are better hotel choices, near Michigan Ave, where you'd get much better service...", "title": "Amazing Trip", "user": "nichokr", "date": "July 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35619072}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "The James was an amazing hotel to stay at while in Chicago. It's located a block off Michigan Avenue on Ontario. The staff was extremely accommodating and professional. They made great recommendations for restaurants. The hotel has a very modern feel and was a bit too trendy for me, but it was still beautiful and very comfortable. Think yuppie, yoga, and \"nature-y\". The J Bar and the restaurant are attached and great for guests of the hotel. Overall, I would recommend this hotel for price and quality.", "title": "The James was a fabulous oasis on a long business trip!", "user": "KristyJ", "date": "July 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 35586170}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "On a recent 10 day business trip to Chicago I stayed at the James. The staff was amazing, always helpful with packages, directions, restaurant reservations and special requests. Great guys at the door were always there to help. Room service was quick and always very tasty. We ate at the fabulous steak restaurant a couple of times and it was wonderful. Even though I was there for a business trip the hotel would be great for a Chicago getaway. It's just a block and a half away from Michigan Avenue and all it's shopping, plus there's TONS of restaurants within a block to 4 or 5 blocks of this hotel. Easy walk to Navy Pier and other Chicago attractions as well. Rooms were very comfortable, especially the beds and bathroom; clean, modern styling. Kiehl's bath products were great too. My only complaints would be that the bathroom was a little small and the business center is open to the lobby and could get a little loud when trying to work and there were sometimes alot of people just checking their E-mail in there when I was trying to get alot of work done. Great stay though!", "title": "Great hotel", "user": "EllaKToronto", "date": "July 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 35498915}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "I would definitely stay at this hotel again, and I really think it is a hidden gem. Great location for shopping, sightseeing, great restaurants nearby. Rooms are very nice and modern,and very friendly staff. First trip to Chicago and my 2 daughters and I loved it.", "title": "The James is THE place!!!!!", "user": "PTV", "date": "July 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35459651}], "location": {"country": "United States", "city": "Chicago"}, "stars": 4.5, "variance": {"poor": 49, "average": 92, "very good": 416, "terrible": 23, "excellent": 943}, "aka": "James Chicago Hotel Chicago", "slim_ranking": 0.114457831325, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "The James Chicago offers a stylish and engaging alternative for the contemporary business or leisure traveler.The James is ideally situated right in the heart of downtown Chicago, just steps from Michigan Avenue. In addition to its proximity to numerous dining, shopping and nightlife choices along the world famous Magnificent Mile, The James is within easy walking distance of such celebrated cultural attractions as Millennium Park and The Museum of Contemporary Art.To mark its fifth anniversary as one of Chicago's most celebrated boutique hotels, The James Chicago revealed a refreshed look that includes updated furnishings, new environmentally-thoughtful services and a selection of updated in-room amenities."}