{"user_rating": 4.0, "review_count": 1341, "name": "The Queens - Leeds", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "Very dusty in the dingy and dated bedroom and bathroom. Put a complaint card into reception which wasn't even acknowledged. Expensive for what was provided, small dingy room that hadn't been cleaned properly, small dusty bathroom with shower tray that didn't empty properly, chipped furniture and paintwork (even after the alleged revamp), disinterested reception staff. The bed was comfortable, sheets were clean but in no way was this value for money.", "title": "Horrible, avoid if at all possible", "helpfulness": 1, "user": "julieb007", "date": "October 5, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 4.0, "service": 2.0, "rooms": 1.0}, "id": 45910759}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We have stayed 3 times in the Queens Hotel in Ledds over the last 2 years. The hotel is well situated and represents good value for our deal £79 for a double.What impressed us thistime was the friendliness of the staff from the concierge to the night duty manager who went out of his way to get us some non-allergenic pillows.A credit to the hotel but everyone seemed so much more helpful making it a delightful stay. The romms still need some updating especially the bathrooms and better cleaning in rarely used areas. But all in all we enjoyed our stay and will be back . Congratulations to the staff", "title": "Getting alot better", "user": "Familydoctor", "date": "October 4, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 45833495}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "I stayed at the queens for one night at the beginning of September whilst on business. I chose this one because of the tripadvisor reviews and it's location. Plus last time I got lumbered at another not nearly so good hotel on the outskirts of Leeds. Nothing much to complain about with this hotel.Very central, two minutes from the central station and overlooking city square. Check in was very quick and efficient. I got a room on the 4th floor overlooking the square and very close to the lifts. No problem with noise at all. The hotel as previous reviewers have mentioned is 'very' art deco, which is surprising as it was built in 1936 I believe but very nice in any case. My room was reasonable in size as was the bathroom. Looked as if the bathroom had been renovated not too long ago. Mind you the net curtains could have done with a wash and the window sill was dusty, just minor points. There was internet access although the hotel web site says you get two hours free, if it is then I could not find it, only had full payment options and hotels charging for internet access and local calls always loose points with me as I think in today's times it should be included. had dinner in the main restaurant and it was great. Staff were very good and attentive, food was excellent and prices very reasonable. The same restaurant is used for breakfast and the 'English' from the buffet was one of the best I have come across. I will definitely be using this hotel again on my next business visit in December. Oh nearly forgot if you want to park your car it's valet only and I have no idea how much it costs.", "title": "Really Nice and Central too.", "helpfulness": 1, "user": "DaveRuss", "date": "September 4, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 39767327}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "A really well refurbished hotel, with lovely art Deco touches. Very frindly staff and a very comfortable clean room. I loved it.", "title": "I was delighted by the quality of this hotel - particularly for the price", "user": "isabellecg", "date": "September 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 39550580}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "I stayed in the Queens for four nights in August 2009 and the hotel was very busy catering for lots of guests during the England/Australia Test cricket. However, the service was great and the staff were very helpful and efficient in dealing with all my requests. As a train traveller with lots of baggage the hotel was perfectly located at Leeds station and my room was spacious and quiet. Altogether an enjoyable experience.", "title": "Treated like Royalty at the Queens", "user": "Seventy2", "date": "August 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 39115695}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "I stayed at the Queens for one night midweek in Late June. I was between rented properties and needed a bed for the night, and I don't think I could have chosen one more comfortable! We didn't check in until around 5pm, and as we were going back out just an hour later, the staff were quite happy for us to park our car in the drop-off layby outside and keep an eye on it for us rather than taking it straight to the underground car-park. Our room was lovely, well-decorated and comfortable with a fantastic view of City Square. Despite our room being right opposite the lift shaft, there was no excessive noise, either from other guests or the lift itself, all that could be heard was the occassional 'whoosh' when stood in the bathroom! Although quite compact, the bathroom was gorgeous, with a super-powerful shower - which was welcomed after a day shifting boxes! I slept soundly - the bed was perfect - and the full English breakfast included in the room rate and served in the restaurant was very tasty. The staff were wonderfully attentive and friendly, and the hotel was immaculately decorated and furnished with more than a nod to its art-deco origins. Wish I could have stayed for longer, but 100% what you need from a city-centre hotel and excellent value for money!", "title": "Treated like a queen!", "user": "northerninvader", "date": "July 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 35587683}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "I'm thinking about starting an organisation called the Campaign for Real Hotels (CAMRHO perhaps?) promoting hotels with character rather than the uniform chain hotels which are the same all over the world. Leeds has lots of these - Hilton, Crowne Plaza, Marriott etc.", "title": "Fantastic Art Deco hotel", "user": "Spineynorman", "date": "July 21, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 35385894}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "As soon as you walk into the lobby at the Queens, fantastic art deco features abound. And the theme continues throughout the hotel - rooms, bar, restaurant - all well-designed, clean and stylish. Judging by the number of meetings taking place in conference rooms and the bar, the Queens has maintained its role at the heart of this city.", "title": "Great Value - Grand Hotel", "user": "NicolaKem", "date": "July 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 34636355}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "On more practical points. The staff are excellent. The food in the restaurant is very fair and the breakfast buffet very good, although eggs served in a buffet are never great. The hotel is also excellent value.", "title": "Fab Location", "user": "dazandandrea", "date": "July 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34629428}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Negative points are that the room we stayed in, although nicely furnished, was rather dull being decorated in dark colours - not helped by a small window with poor rear view. The exterior of the hotel also suffers from 80 years of grime and would be much improved by a good clean.", "title": "Excellent short stay", "user": "lettyger", "date": "June 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 31933061}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "Stayed for 5 nights on business. I had travelled by train and the hotel as literally next door to the station which was nice as on arrival at the station it was about a two minute walk. The entrance lobby is very impressive as was the dining room and bar. Every member of staff I encountered i.e. check in, bar staff, restaurant staff, room service, concierge, housekeeping, check out were very polite and professional and most importantly seemed to be pleased to be of service to me. I was made to feel most welcome.", "title": "Perfect", "user": "The Fat Punter", "date": "August 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39034178}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The room was spacious and spotlessly clean, as was the bathroom. The food was very nice and there is a huge selection of just about everything you could think of for breakfast.", "title": "1930s elegance", "user": "MrsBTorquay", "date": "August 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 38569176}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "The location is perfect for the city and if you need to stay in Leeds then you need look no further.", "title": "Beautiful interior, very clean, would stay again", "user": "jetsom00", "date": "August 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36624731}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "After checking out, the concierge looked after my luggage as I needed to work in the city that day and when I called to collect it I was in a rush to catch a train. This guy then took me through some back corridors practically running and carrying my case for me and we ended up actually in the station concourse itself and I comfortably caught my train.", "title": "very nice stay", "user": "LondonBillbost", "date": "July 30, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 36230921}, {"rating": 2.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "Impeccable service all round.", "title": "rather dissapointing", "helpfulness": 1, "user": "dr-dickw", "date": "July 23, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 35607088}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Stayed for a couple of nights in September on their Champagne promotion and had a really comfortable stay. We arrived by car so had the problem of finding a convenient place to park without it costing! Not possible near by, station was £8 overnight. We didn't eat or drink in so can't comment on quality or prices but breakfast was plentiful and good (included inour package) Only complaint, on the Sunday they seemed to be overwhelmed by the numbers (short staffed perhaps?) so tables were not being cleared quickly enough which meant a queue built up of people waiting to be seated.", "title": "Great Location if arriving by train.", "user": "disleksik", "date": "November 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 49240963}, {"rating": 2.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "One night at this hotel was enough. A drive across Leeds from the Radisson where we stayed for 2 nights was difficult - the one way system and ring road were appalling. So pulling up in the very small layby to wait for valet parking I was amazed to treated rudely by the concierge who accused me of blocking the road and suggested I drove around for a while and come back later! Not a welcoming approach", "title": "Old fashioned hotel with little customer care", "helpfulness": 1, "user": "Sybil_Ramkin", "date": "November 13, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 49108671}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "At reception they claimed I had no booking and at that point I was prepared to leave. However after a lengthy wait I was allocated a room. It was on the 7th floor with such dirty windows I have little idea of what the view was like. The room was basic and the bathroom was clean", "title": "Excellent", "user": "Greensleeves", "date": "November 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48232967}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Breakfast was varied and plentiful but lunch was disappointing.", "title": "Perfect location, great service, beautiful rooms", "user": "bluedenim", "date": "October 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48050023}, {"rating": 2.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "The location is good - very close to the train station and the main shops. Expensive valet parking in the disused railway arches under the hotel. The concierge on the second day was much friendlier and helpful but generally I thought the staff were disinterested and lacking in customer care", "title": "Handy for train station, dirty rooms", "user": "Hurlstone", "date": "October 13, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 5.0, "service": 3.0, "rooms": 1.0}, "id": 46762823}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 83, "average": 181, "very good": 452, "terrible": 46, "excellent": 579}, "aka": "The Queens Hotel Leeds", "slim_ranking": 0.217391304348, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "description": "As the most famous landmark hotel in Leeds, The Queens really does set the standard. Proudly positioned in the heart of City Square adjacent to the rail station and a host of other amenities, The Queens Hotel radiates a powerful allure from every inch of its immaculate white Portland stone façade. But the beautiful frontage is no façade, as you’ll discover when you step inside. The perfect balance of old character and contemporary elegance, The Queens Hotel Leeds combines its proud 1930’s Art Deco heritage with modern 4 Star luxury. Benefiting from £10.5 million in careful restoration, The Queens is the perfect Leeds hotel. A stay in any one of its 215 sophisticated bedrooms will leave you in no doubt as to why it is so well known. For the ultimate in exclusivity, book to stay in the QClub. Leeds’ only executive floor, situated at the very top of the hotel. Each of the 18 plush and peaceful bedrooms on this level has been fully refurbished and benefits from the introduction of a new executive lounge to relax in. Business types will find the hotel location extremely convenient next to the station and for meetings, conferences or grand banquets, The Queens is the only conference venue in Leeds with a 600-seater capacity to easily accommodate your eagerly anticipating guests or delegates."}