{"user_rating": 4.5, "review_count": 213, "name": "The Beckford Arms", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Also booked for 1 night in this place, we asked for a 'quiet room' and got a room upstairs at the corner of the streetside and their parking. Small room, no wardrobe, and with an even smaller bathroom .. The inn itself looks charming and the owners and staff are really friendly.", "title": "it's all part of 'staying at an inn'...", "user": "yvakat", "date": "July 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 135339279}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We went in late afternoon for a drink in their garden, they claim to have been very busy for lunch (it was a sunday afternoon) and indeed seems to be a good place for families with children..", "title": "A Country House Weekend", "user": "Grannyinwellies", "date": "July 23, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135123604}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "In the evening we took dinner overhere, good food, excellent brownie afterwards ! We were the only customers having dinner (at least in this part of the inn) and this felt a bit strange.. later on although more people came in for drinks.", "title": "10 out of 10!", "user": "Dan H", "date": "July 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134810692}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We didn't sleep that well, as a party went on outside and we could hear everyone come in / go off the parking till late night (and our neighbour next door didn't help much either on this, by going in/out the room every hour during night..) we got this confirmed in the morning (the party) but they mentioned that this is 'part of staying at an inn'..", "title": "Worth waiting for - the most comfortable bed ever!", "user": "dorsetgourmet", "date": "July 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 134724203}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "Breakfast was excellent with good choice ! Overall we enjoyed very much the food, and would certainly drop by, if around, for this on a next journey.", "title": "Fantastic destination to get away from it all!", "user": "nic20100", "date": "July 13, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 134316720}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "From the moment we stepped through the door to our departure we met the most friendly and happy staff. Everything, and more, was provided to make our stay sublime. We stayed in the Attic room which was lovely. The food was scrumptious. Our only regret was that we were only there for one night!", "title": "Superb", "helpfulness": 1, "user": "Sauvarin", "date": "September 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139492231}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "we stayed in room 4 which Is advertised is a small double but I was pleasantly surprised as I've stayed in smaller rooms and paid more!", "title": "Beautiful place, a real english gem!", "helpfulness": 1, "user": "Bristol28", "date": "August 28, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 138694698}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The bathroom is very big, the products in the bathroom smell gorgeous. They are on my Christmas list!", "title": "A real cut above the rest!", "helpfulness": 2, "user": "GeoffUren", "date": "August 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 138244703}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The decor is very stylish.", "title": "Wonderful", "helpfulness": 1, "user": "Honeymooners014", "date": "August 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 137736769}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Lots of lovely touches including soft music playing in the room on arrival.", "title": "Hmmmm", "helpfulness": 3, "user": "HampshireReviewer", "date": "August 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 137242495}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Wonderful food and great service in this lovely gastro-pub 5 mins from A303. Having decided to order a carafe of the local white wine our waitress suggested we tasted it first, brought us a glass, and let us keep it even after we decided it didn't quite suit us.Fantastic potted crab, fresh fish with gorgeous sauces, inventive puddings, all cooked with great skill. We ate in the bar area, lovely relaxed atmosphere (ask for a table in one of the other areas if you want peace and quiet!), we all trooped into the lounge area to watch Bolt win the 200m. Busy for a Thursday night and deservedly so.Best meal we've had for ages. Wish we'd booked a room to stay.", "title": "Great evening", "user": "MattMoo234", "date": "August 14, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 137177089}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We booked The Beckford Arms for a quiet night away after visiting friends in Bath for the weekend. We arrive early sunday evening just in time to check in and to enjoy a bottle of wine in the last of the sun on the rear terrace. On arriving we were given a very warm, personal welcome by the owner who personally showed us to our room. We booked quite last minute so the onl room available of the 8 in the building was the smallest, number 4, but this was perfectly adequate for our one night stay. The Bathroom is huge for the size of the room with a brilliant shower. The owner showed us how to use the TV and radio in the room before expaling about benefits such as the DVD library and the moving showing in the sitting room that evening. We dropped our bags, only criticism of the room is no where really to hang anything if you need to for a longer stay. We wondered down to the bar and got our drinks and sat enjoying the sun. The hotel is quite remote but was perfect for us to relax after a busy weekend. We had a wonder to look at the gorgeous church next door and back to our room to shower and change for dinner. The whole hotel and room was spotlessly clean and small touches like the hand made toiletries were appreciated. These are made by the owners wife and can be purchased as well as for use in the hotel. We went down to the restaurant and selected from the amazing menu. Being a sunday evening there were only another few couples dining which was nice. We both ordered steak which was served perefectly. Again nothing we could fault about the meal. We then selected a few dvds from the hotel library which are free of charge to take back to the room with a bottle of wine to enjoy the end of the evening. The bed was so comfortable and a peaceful nights sleep. We enjoyed a monday morning lie in. Breakfast is meant to finish at 10 but the owner did say it was a strict 10am rule and we could order after. We chose to eat in the cosy sitting room compared to the restaurant where we ate the night before. This room is where they were showing the movie the night before and is cosy and homely with an open fire. the breakfast menu was good which is extra while continental is included in the room price. We ordered scrambled egg and eggs benedict which were served by the lovely chef. Again faultless food and we also helped ourselves to the continental breakfast. Over all, everyone from the cehf, overn, waitress and barman were so friendly and welcoming and we are definately planning to return. The cosy decor would make an ideal retreat during the winter. We cannot wait.", "title": "Absolutely Perfect, Quiet Getaway. Ideal For A Weekend Break", "helpfulness": 2, "user": "Paul F", "date": "August 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136511609}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The Beckford Arms was one of the nicest hotels we have stayed in. The welcome was very warm, the décor gorgeous and the food lovely. We were particularly enamoured with the toiletries, which are made by the owner’s wife – in fact they are what first brought the hotel to my attention, as the handwash is used in a restaurant I go to in London and I loved it so much I searched for it online, and found it was only available from the hotel (and on their website). When trying to think of somewhere to go for a long weekend I remembered how nice it looked on the website!", "title": "Practically perfect in every way", "helpfulness": 1, "user": "suzied2", "date": "August 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 136309634}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "The little touches are great – fresh milk left outside in the morning for tea, hangover remedies and make-your-own Bloody Mary provisions at breakfast... and we were in room 4 which is described by some as smallish but the bathroom is really big! The only tiny glitches were; on the Friday night we were kept awake by a party until 1.30am in the bar (though that is a peril of staying above a pub) – in our bathroom you could hear every word spoken in the bar, and even with the bathroom door closed we found it a little bit noisy - it was a hot night, though, so we had to have the window open; and secondly, our room was only half-cleaned when we got back from a day out – once we asked it was immediately sorted out and apologies were profuse so it was clearly a one-off lapse (they were very busy). But that aside it was all lovely – great setting, delicious food, friendly staff and very comfy and stylishly decorated rooms. If you are there for several days and want dinner elsewhere for a change, the Riverbarn is a lovely 20-minute walk through the pretty Fonthill Estate and serves delicious AA-rated food in a very homely environment, like eating in someone’s front room! To explore the area properly you would need a car, as it's in the middle of lovely countryside so a little remote (in a nice way).", "title": "We can't fault the Beckford Arms", "user": "KateLeicestershire", "date": "July 31, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 135863706}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "Highly recommend the Beckford Arms - very high-end in terms of decor and food, and a reasonable price for the experience.", "title": "40th Birthday at The Beckford Arms", "helpfulness": 1, "user": "LouLew72", "date": "July 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135691512}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "what a great place. we only stayed a night as a quick treat-escape one wintery weekend from bristol. lovely room, classy place, fab food, fun night, lovely boozer, great hosts. have already been back since", "title": "a brilliant 24 hours", "user": "misimango", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 133864178}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "What a lovely place, the staff were so friendly and kind. We turned up on the off chance during a rather wet day and were made to feel very welcome. The food was fab, gardens lovely although raining on our visit. Dogs welcome inside and out, very friendly to our six year old son, he loved their dog Elsa, very sweet!! Worth a visit but don't tell too many people about it or you'll never get a table!!!", "title": "Wow", "user": "Lesley A", "date": "July 9, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 133836750}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Had an amazing weekend with all of our Friends and Family. We booked all the rooms for my 40th Birthday weekend and a surprise 'wedding' party! EVERYONE had a relaxed weekend thanks to the commitment and professionalism of all the staff. I booked this back in September 2011 and have been bugging Hannah ever since to create our perfect weekend, nothing was too much trouble and she accommodated all of our needs and requirements. Thank you Hannah! Then the weekend came, and we had 3 amazing nights, Rooms = Small but perfectly formed - good attention to detail. Food: Outstanding, Party/BBQ/Breakfast all second to none! Bar & Restaurant Staff - Happy, polite and they really care about what they do! 18 people and 2 kids all HAPPY! Now thats no mean feat...Great location, amazing scenery a real chill out place. So THANK you ALL at the Beckford Arms..You made our special weekend, Extra Special. We will be BACK! Go on, book the place for a whole weekend...you won't regret it...!", "title": "Amazing Family Weekend", "user": "SimoGiv", "date": "July 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 133661199}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "On a touring holiday of Wiltshire, my wife and I arrived at The Beckford Arms having suffered a very disappointing start to our trip elsewhere (see another Review altogether) and immediately relaxed into the comforting welcome and gentle ambience that we discovered here. What a relief !", "title": "A real find ; peace and contentment abound", "user": "The-Troubadour", "date": "July 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 133300454}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "With efficient and friendly staff, a soporific garden to laze and drink in, very good food (the continental breakfast option is recommended - and is included in the B&B rate) and a very comfortable bed at night, The Beckford Arms was a delight.", "title": "Brilliant for a break", "user": "JerryPlus3", "date": "June 22, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 132551389}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 5, "average": 9, "very good": 36, "terrible": 1, "excellent": 162}, "aka": "The Beckford Arms Hotel", "slim_ranking": 0.333333333333, "description": "The Beckford is situated on the edge of beautiful Wiltshire rolling parkland. It is a country pub with 8 simple but elegant bedrooms, a restaurant, a private dining room, a sitting room and a wonderful mature rambling garden with hammocks under shady trees. Bedrooms include bespoke, handmade natural bathroom products and guests may borrow DVDs from the library to watch in their rooms. On Sunday nights a classic movie is shown in the sitting room."}