{"user_rating": 4.0, "review_count": 759, "name": "The Sofia Hotel", "reviews": [{"rating": 5.0, "title": "Perfect", "text": "Our family loved the Sofia Hotel. It was in a great location, clean, comfortable and very friendly staff. We travelled to San Francisco, Anaheim and Las Vegas from Australia and this was our favourite hotel. All amenities were included, wifi, fridge, safe & even 2 free bottles of water per day, which is a small thing but meant alot to us. Air con worked well & had a room with a view, but too busy to enjoy it anyway. Would definitely stay there again.", "helpfulness": 1, "user": "Julie E", "date": "October 1, 2012", "id": 141709318}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We picked this hotel for its location and price. The hotel and the staff were really great. Be warned...the room is small, however, we did not mind as we do not spend much time in the room when we are on vacation. We really enjoyed the Sunday brunch at the restaurant in the hotel called Currant. Also, we are from a big city so we had no problem taking the bus from the airport to the hotel which the bus stop was directly in front of the hotel. And we walked to the bars / restaurants in the Gaslamp district so it was perfect.", "title": "Great Boutique Hotel", "user": "Kathy Z", "date": "September 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 141688612}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "The Sophia is a beautiful and clean hotel! It is in a great location. Has a nice restaurant and very good service. However, I gave it an average rating because to the value. When we were checking in we realized we would need two queens instead of our king, because our college student daughter would be joining us. The hotel clerk informed us that there were no queens available and that we would have to upgrade to a junior suite. (Even though the hotel was no where near full capacity), we would have to pay an extra $80. on top of our on-line rate. That meant our hotel room called junior suite would be a whopping $300. per night. Yes the rooms are nice! But No! they are not worth $300. a night. The junior suite was like a Marriott Courtyard room. A fair price for \" The junior suite\" in my estimation is more like a $200. room.", "title": "small and overpriced", "user": "dondies", "date": "September 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 141244150}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "My first time in San Diego and coming from a hotel disaster, this was definitely our savior! A beautiful boutique hotel! One of America's historic hotels built in 1927 is still up and running for a reason!", "title": "Our Savior!!", "helpfulness": 1, "user": "jlrichhc", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141140611}, {"rating": 4.0, "stay_parameters": "Stayed September 2012", "text": "From checking in with the friendliest staff to our super cute room, everything was beyond fab! It is the perfect location downtown to stay.", "title": "Boutique style with great location.", "helpfulness": 2, "user": "jam79", "date": "September 24, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 141056200}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "If you need a really nice place to stay in downtown San Diego, this is it! Quiet (and I'm a light sleeper and this was nice), very clean, much more upscale than I thought it would be. It's a old, classic hotel that uses that them but modernizes all facilities in a very stylish way. Easy access to everything. Their fitness room was clean, fully functional machines, not the usual broken down or partially working equipment. Just a total pleasant stay!", "title": "Excellent", "helpfulness": 1, "user": "Bowtiebiker", "date": "September 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140975714}, {"rating": 1.0, "stay_parameters": "Stayed September 2012", "text": "It was labelled as a 4 star hotel.", "title": "Small and over priced!", "helpfulness": 3, "user": "Deano478", "date": "September 21, 2012", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 5.0, "service": 2.0, "rooms": 1.0}, "id": 140888614}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "However been that we was doing a trip of California and did not want to stay in just any hotel we chose this one based on pictures, price, location and star rating.", "title": "A grand old lady", "helpfulness": 1, "user": "luzUtrecht", "date": "September 21, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 140881741}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "DON'T STAY HERE!!!!", "title": "nice hotel", "user": "dutchietraveler", "date": "September 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140569611}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "We stayed as a couple with two cases and the room we had was extremely tiny you could not open the wardrobe doors to get to the safe because the bed was in the way.", "title": "Comfortable stay, lovely hotel, great location!", "user": "FreeHoliday", "date": "September 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140127557}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Excellent, excellent location, close to the airport, downtown, train station and lots of taxis outside. There is a huge shopping mall opposite the hotel which is convenient. Rooms are very comfortable and modern, a little bit small but would not stop me going there again.", "title": "Fab Sofia", "helpfulness": 2, "user": "Simonemeyerowitz", "date": "January 21, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12857076, "likes": {"liked": "— The location", "disliked": "— hot and stuffy"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "The hotel and rooms have no windows so can be stuffy at times - dont know what it would be like in summer. Overall excellent hotel and location - would recommend.", "title": "Great stay at Sofia", "helpfulness": 3, "user": "rdrgrl724", "date": "January 8, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 12454627}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Stayed at the Sofia for one night on New Year's Eve. I traveled with some girlfriends and the three of us stayed in a standard room. Although the room was on the small side, we loved the modern look of the hotel. It was well-situated on the corner with lots of options for restaurants and fast food nearby. We were even able to walk about four blocks to the gaslamp district. The room was clean, beds were comfortable and soft with great sheets and comforters. Unfortunately parking was $25 a night, as stated in other reviews but it seems to be pretty usual for most hotels in the area.", "title": "Great Location. Pleasent stay.", "user": "shashaedmontonCanada", "date": "January 7, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 12422976, "likes": {"liked": "— location", "disliked": "— size"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "I would recommend this place for a great stay and I will definitely be coming back this summer when the weather is warmer.", "title": "Just got back", "helpfulness": 3, "user": "webeenthere", "date": "January 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 12394125, "likes": {"liked": "— Locaction", "disliked": "— Restaurant"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Prior to our cruise in Dec we stayed at the Sophia. We already anticipated the small rooms, and the usual scenes that go on in a downtown area. Like the homeless ect... But they never bothered us. The staff was very helpful and we received a free upgrade. Yes the room is small, but it was clean and updated.", "title": "Not for families with kids", "helpfulness": 1, "user": "Obelixta", "date": "December 28, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 12013854, "likes": {"liked": "— Cleanliness", "disliked": "— Small rooms, everything is pricy"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We stayed 3 nights at this hotel and found it has some excellent things going for it. Don't judge this hotel by the outside and by the Greyhound bus terminal next door, just walk into the lobby and you will be surprised. The hotel had more staff at the front desk than my bank has tellers and they were all very friendly. The lobby has a business office with 3 computers with free internet access.", "title": "Perfect hotel for the right kind of traveller.", "helpfulness": 1, "user": "monarg", "date": "March 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 14542423, "likes": {"liked": "— Location", "disliked": "— Downtown noise"}}, {"rating": 4.0, "title": "Mini Vacation From Los Angeles", "text": "The rooms are quite small and have some very nice personal touches including a microwave and a fridge, it is all quite modern.", "user": "Balconylove", "date": "March 24, 2008", "id": 14489216}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "This hotel is not for families. The location is great for entertainment but not for a quiet night's sleep. The Gaslamp quarter has a lot of", "title": "Great location", "helpfulness": 2, "user": "jpfitzy7", "date": "March 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 14185955, "likes": {"liked": "— Location", "disliked": "— Noise"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "emergency sirens be it police ,ambulance or fire. You can count on being waken up at least once or twice in the night. The beds have nice linens but they are doubles not queen size as the room cannot accommodate a queen bed.", "title": "Great Hotel!", "user": "jahjah01", "date": "February 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13713728, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "We took our 15 and 17 year old kids to Sea World for Spring Break and a mini getaway. After reading nice reviews of the Sofia Hotel, and comparing prices of other nearby hotels, we chose the Sofia. What a great choice. After an exhausting full day at Sea World it took only ten minutes (all freeway) to arrive. Valet attendants were very accomodating, friendly and knowledgable. Check in was a breeze. We love boutique hotels and this one is exactly that! The rooms are small but very clean, modern, and cozy. Just a quick walk gets you to a whole bevy of fantastic restaurants nearby. We chose \"Asti\" (excellent Itallian!)There is also a mall right across the street. The restoration of original architecture in downtown is wonderful. The only downside, was the Greyhound station close-by, so there are vagrants walking around as most people would expect in most Downtown areas these days. Other than that..........I highly recommend this property for a nice San Diego get away and then some!!!!", "title": "Okay but expected more", "helpfulness": 1, "user": "moncherrie", "date": "February 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 13712197, "likes": {"liked": "— Location", "disliked": "— Price"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I stayed at the Sofia while attending a conference at a more modern hotel up the street a couple of blocks. The modern place was plenty glitzy, but I was always happy to return to the Sofia with its helpful staff and warmth. If you like hotels with age, personality, and style, you will like the Sofia; if you like new glitzy places filled with shiney objects, you will probably be dissapointed.", "title": "Personality", "user": "Twoprofs", "date": "October 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143800610}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "As others have noted, my room could have been larger and brighter, but it served me well; it was clean, organized, comfortable, and well supplied with ammenities . When I had TV problems one evening, Jesus was on the spot within moments to take care of things courteously and promptly; the desk staff answers every question the same way. Some of the public areas could stand a little freshening (carpets, for example, in the entries), but the room was spotless and modern.", "title": "Old World Charm", "user": "mtproductions1", "date": "October 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 143343424}, {"rating": 4.0, "title": "Much enjoyed!", "text": "The Sofia has a very European feel about it, and I like that unique charm and style.", "user": "Cassie O", "date": "October 20, 2012", "id": 143248062}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "When looking for a hotel what is the more important size of room or location, I would say location. This hotel has a great location walking distance to the Gaslamp district and 5th Avenue. Unfortunately the rooms are a little small but they are functional and modern. The staff was very helpful and the valet service was great.", "title": "Wonderful stay at The Sofia", "user": "claremonttraveler", "date": "October 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143245203}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "My BF and I spent 7 nights here winding down our tour of america. Staff were very helpful, friendly and informative. The business centre is free to use and there are computers with free Internet and free printing. You pay a fee of about $8 a day which gets you access to the business centre, gym, yoga studio, bikes, 2 bottles of water a day etc. Hotel was well priced for it's features, this is the first place in America that we stayed at that had a fridge and microwave!!! The restaurant is great, with fantastic happy hour food and drink specials, and 10% off with a valet ticket! It is well situated and close to everything. We hired a car and it took us less than 15mins to get everywhere. The only downfall was that we seemed to be given less towels every few days. We'd have one less hand towel or face washer which was odd. My only complaint would be the fact that they don't have the history channel which I fell in love with in NY. Would defiantly stay here again. Don't be deterred by comments of homeless people near by, from our experience they are everywhere in San Diego for some reason.", "title": "Good Location,friendly staff", "user": "bluewaterstjohn", "date": "October 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 143076265}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Spent a Saturday night at this historic hotel for a quick weekend get-a-way in San Diego. We can only say great things about this hotel, the service and the restaurant. First of all, this hotel is pet friendly and they put you in very nice rooms with views when bringing a pet. I can't stand hotels/motels that charge extra for pets only to put you in the least desirable rooms (1st floor, back of the building, noisy, smoking, etc.). Secondly, the room was beautiful, the bed comfy and the location ideal. My only complaint would have been the tiny (17\") flat screen TV in the room. The restaurant downstairs (Currant) has a great happy hour and was also dog friendly. We ordered a handful of inexpensive and delicious happy hour plates of food...and were stuffed. The service at the restaurant was excellent as well. We would definitely stay here again.", "title": "Historic and elegant", "user": "JandCtravels", "date": "October 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142917263}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "The Sofia Hotel is a nice hotel for a business trip. There is a gym which is open what feels around the clock. The rooms are small but very nice and kind of stylish. So not a completly typical Amerian hotel, but a very nice not too big hotel for a business trip in San Diego. Also the location is perfect: walking distance from one of the shopping malls and the streets with the restaurants are also close by.", "title": "Business Hotel", "user": "nnndrea", "date": "October 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142897832}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The hotel is indeed well located if you are vacationing in San Diego and want to be near the main attractions. handily located for the Gas Lamp district and transport routes to other areas this hotel offers a good base.", "title": "Form over function?", "helpfulness": 1, "user": "Tam B", "date": "October 14, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 142779528}, {"rating": 4.0, "title": "Very good boutique hotel", "text": "The valet parking was as usual over priced, as is now compulsory for most city locations world wide. But at least they were prompt and kept the vehicle undamaged.", "user": "s62blue", "date": "October 10, 2012", "id": 142453022}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We stayed at the Sofia Dec. 4 - 8, 2007. The staff and hotel are very nice and the rooms are very functional although smaller. The key here is the location which provides excellent bus and trolley access. We went everywhere we wanted using public transportation costing a fraction of what a car would cost to rent and park. This also eliminated the frustration factor of looking for parking etc. There are many restaurants within easy walking distance of the hotel and the waterfront is easily accessible via bus. One thing to note is that the double rooms bordering 1st avenue do have traffic noise to contend with if that kind of thing bothers you. By the way, we tried the restaurant in the hotel and it was quite good. All in all a very good experience.", "title": "Excellent Location!", "helpfulness": 2, "user": "noland-b", "date": "December 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 11698927, "likes": {"liked": "— Location", "disliked": "— Traffic Noise in outside rooms"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "It is a nice hotel with beautiful contemporary rooms that are well maintained. The staff was okay. The front desk clerks seemed to have difficulty in understanding basic issues and did not seem to really answer questions. I stated in my reservations that I would be coming in late after 12:00AM. When I arrived at the hotel at 1:15 AM the clerk told me he assumed since I had not arrived by 12:30 I was not coming and had erased my reservation, however he had still charged my credit card. Nevertheless, the clerk still found me a room. Upon checkout I asked the clerk to check my billing since they had already charged my credit card. It was indicated by the billing statement that everything was in order so I left. Upon arrival to my home the next day I found that I had been overcharged for one day. To date this issue has not been resolved.", "title": "It's Okay", "helpfulness": 4, "user": "Travel_noise", "date": "December 6, 2007", "detail_rating": {"front_desk": 1.0, "service": 3.0, "cleanliness": 5.0, "value": 2.0, "rooms": 5.0, "location": 3.0}, "id": 11287918, "likes": {"liked": "— Room was great", "disliked": "— Front desk was not on top of thier business"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "It is within walking distance of the convention center and mall. The largest downfall is that the hotel is right next to the bus station.", "title": "It's just ok", "helpfulness": 1, "user": "drcomposting", "date": "November 26, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 2.0}, "id": 11075878, "likes": {"liked": "— Small room, wired internet"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "I stayed there for three nights for a big conference with more than eighteen thousand attendance. I booked this hotel using conference rate when all the other major downtown hotels were booked out, for approximately $150 / night. The location was fine, except it’s next to a greyhound station. The convention center is within distance (20 min) but it’s better you bring a pair of walking shoes.", "title": "Wonderful Stay with a European feel", "helpfulness": 6, "user": "TravelDuoAD", "date": "November 26, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11063586, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "The hotel is clean. The room is so small to a point, which is making me uncomfortable. It kind of reminded me of the inexpensive hotels I stayed in NYC. Unfortunately they don’t have wireless and they were unable to provide a longer Ethernet cable, so I wasn’t able to use my laptop on my bed. The hotel restaurant is new and seems to have a very good wine selection. Its room rate (either conference rate or regular rate) isn’t a lot less than other the premium Gaslamp hotels. You might want to pay 20 – 30% extra for a bigger room in a more convenient location, particularly if you’re traveling with somebody.", "title": "Hmm, nice but tight", "helpfulness": 3, "user": "travelgal75", "date": "November 21, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 10964356, "likes": {"liked": "— lack of space"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Really not impressed by the Sofia. The hotel is adjacent to the greyhound station and there was always a good number of homeless people around the hotel entrance which my fiancee found offputting and at times threatening.", "title": "not impressed", "helpfulness": 1, "user": "holtender", "date": "February 20, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 1.0, "value": 3.0, "location": 2.0, "rooms": 2.0}, "id": 13695782}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The renovation of the hohel is very sympathetically done, but its age does mean that the rooms are untidy. With 2 of us plus 2 bags there wasn't much space for movement and wardrobe space is limited.", "title": "Very good hotel", "helpfulness": 1, "user": "WelshLady", "date": "February 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 13642681, "likes": {"liked": "— Location and staff", "disliked": "— The windows"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "My major moan at the Sofia concerns the housekeeping. The room looked dirty when we arrived. The comp mouthwash had been opened and the sink had a scummy residue around it. this didn't improve throughout our stay. Front desk staff were helpful and the business centre was very good. The attached restaurant seemed popular although the bar staff were among the least friendly i have encountered in the US.", "title": "Very Impressed", "helpfulness": 2, "user": "memcadman", "date": "February 11, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 13471986, "likes": {"liked": "— History", "disliked": "— Shower"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "My boyfriend and I have just come back from a 9 night stay at the Sofia and we loved this hotel. The location is great within easy walking distance of the Gaslamp quarter one way and the port with the Midway etc in the other direction.", "title": "Great location, great hotel", "helpfulness": 4, "user": "Princess_Pudding", "date": "February 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 13211330, "likes": {"liked": "— Location, location, location", "disliked": "— Small room (but perfecly adequate still for our needs...)"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "The hotel itself is smart and clean and I don't think the staff could have been anymore helpful. When we arrived the receptionist looked for a corner room for us as we were staying a while and they were bigger than some others which I thought was very nice.", "title": "A long weekend in San Diego", "helpfulness": 4, "user": "cmcfong", "date": "January 27, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 13032917, "likes": {"liked": "— Front desk staff. Brian in particular was very helpful.", "disliked": "— Housekeeping issues noted above and the shower door."}}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 51, "average": 111, "very good": 318, "terrible": 25, "excellent": 253}, "aka": "Sofia Hotel San Diego", "slim_ranking": 0.377777777778, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Nestled in the heart of San Diego, The Sofia Hotel offers luxurious accommodations to please every taste. Weather you are traveling for business or pleasure, you will indulge in an unforgettable experience."}