{"user_rating": 4.5, "review_count": 761, "name": "The Westin Detroit Metropolitan Airport", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Located right in the Detroit airport it was perfect not only for its location but meets all the Westin standards. Great for a late arrival or an early start the next morning. Rooms are very nicely done, comfortable, bedding is posh. The hotel lobby has its own security checkpoint into the airport which can eliminate delays in the main terminal. The hotel offers a pass for security so that guests may enter the terminal to use the restaurants and bars in the terminal if one chooses not to use the hotel facilities. The room has Starbucks coffee for your morning starter. No complaints, excellent choice.", "title": "Perfect for us", "user": "notnecessary", "date": "August 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 171521324}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "I loved this hotel!!!!! We were in Detroit for the AAU Junior Olympics and stayed here. The hotel is located in the airport, but you would have never known it, because it was so quiet. The Front Desk agent were extremely helpful. They always made sure I had what I needed. I was traveling with my boyfriend, four kids and our dog Miki. Our room was very spacious. The room attendant went out of their way to bring Miki her own bed and feeding pans. I went to the bar every night and had the Molten Lava Cake!!!!!!!!!!! It was so delicious! Did I say I had it every night. I had the same servers Kimberly and I think her name was Cassandra. They were extremely nice. One night my boyfriend was sick and Kimberly had the Bartender to make him a hot toddie. It really made him feel better. We stayed there for a total of 5 nights! Everything was wonderful! Keep doing what you are doing Westin!!!!", "title": "Elegant and Pet Friendly", "user": "Luv2Travel1828", "date": "August 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 171371883}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Stayed the night before an early flight. The rooms are very comfortable and quite considering the airport location. There was a great valet parking deal that made cost of room next to nothing if valet parking value is added in to equation. Have stayed several times in the past, it has been consistently good. Service by bellmen was excellent. They helped take luggage to room and back to airport check in. Hotel is located in Delta terminal.", "title": "Comfortable and convenient", "user": "KHA8", "date": "August 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 171266222}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "This hotel is IN the airport, which is why we decided to stay. we had an early flight the next day. Prices were better than I expected – but keep a few things in mind….", "title": "Good Hotel (can't always use the security check point)", "user": "travel920", "date": "August 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170889456}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Service: Outstanding no issues with check in/check out.", "title": "I should have been in the UK", "user": "HampshireBrodie", "date": "August 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170496409}, {"rating": 3.0, "stay_parameters": "Stayed December 2005", "text": "My family and I stayed here for 3 nights before relocating to Uk. We had a 2 bedroom suite. The bathroom had problems . The club room/ lounge was just okay. The maids, maintenance, bellboys all were complaining. No one there was happy and they surely made you feel it. Great for the business traveller for one night. Overall, the rooms were small and not very clean. Most suites provide you with bottled water, here it cost me 7.50. Great beds and pillows and close to NWA.", "title": "It is just a great bed!", "user": "cj15", "date": "April 11, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 3.0, "service": 2.0}, "id": 4957792}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "I have been a frequent guest at many of the hotels near Detroit Airport. However, this is the best without any doubt. It is the most convenient hotel for the airport. The staff was very friendly and pleasant. The rooms are qujite comfortable. The heavenly bed is SUPERB! I look forward to many more stays here at this fantastic hotel!", "title": "Absolutely Best Choice For DTW Area", "user": "GabrielR89", "date": "July 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168555728}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Just stayed two nights here and will definitely come back. This hotel is attached right to the airport and is about a 2-3 minute walk from the gates. It also has its own security gate to enter into the airport which saves considerable time. Additionally, there is a side entry into the ticketing area which helps cut time. Rooms were vey spacious, modern and very well maintained. Staff was very friendly. I also commend the room service for how fast they could get the food delivered. The food was a little pricey and limited in choices, but good overall and consistent with other hotel prices. As a traveling tip, very few know that you can go to the front desk and they will get an agent to walk you into the airport to buy food from the many restaurants in the airport itself. Also, for $5 you can get workout clothes and tennis shoes to wear for the gym. If you valet park, Kevin is great - very, very nice guy. There is also a Starbucks downstairs in the lobby and a very well maintained and comfortable lounge/bar and dining restaurant. All the staff here were very friendly. If I could make a suggestion, it would be the difficulty in baggage delivery to the rooms. The hotel is about 15 minutes from Ford Field and Tiger Town which is nice if you want to fly into town to catch a game. Staying here helps save on the hassle of a commute in the morning for flying out, as well.", "title": "If you are in Detroit, consider staying here", "user": "jmoonesq", "date": "July 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 168335222}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "We stayed one night at this hotel on our way back from Asia. It was clean, the service was great and the rooms are incredibly sound proof. I will definitely be back. Next time I will ask for a room that looks outside instead of the atrium.", "title": "Great Location and Clean", "helpfulness": 2, "user": "BellaCuore", "date": "July 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 167427007}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "The Westin DTW is a great choice if you need to stay at the Detroit airport. It literally is part of the McNamara Terminal at DTW, which serves all Delta (and only Delta) flights. It has its own TSA security checkpoint, allowing you to step off the hotel elevator and get right in line at security to enter the airport concourse. The hotel has Delta check-in kiosks as well as flight status boards right in the central atrium. Especially if you are taking Delta, the Westin could not be any more convenient. If you are taking another airline, the airport offers a free shuttle from the McNamara Terminal to the North Terminal, about three miles away. I have used that shuttle in the past and found it to be relatively convenient. The hotel itself is as nice as most non-airport Westins. It is either relatively new or else has been immaculately maintained. The rooms are standard Westin rooms, meaning they are comfortable, well furnished, and provided with a number of amenities that make life easier for business travelers (lots of work space, outlets, etc.). I didn’t hear much air traffic from my room, but given how late I arrived and how early I departed, it isn’t likely there were many flights during that brief time. As with any airport hotel, there is no reason at all to stay here if you don’t have to be at the airport, which is too bad, because this Westin is as nice as the hotels I have tried in downtown Detroit. The downside is that it is relatively pricey compared to the other airport hotels located off the airport property, but to me, the convenience factor and the quality differences between this hotel and the others nearby makes the price difference worthwhile.", "title": "Perfect Choice if Stuck at DTW", "helpfulness": 3, "user": "Wedgewood", "date": "July 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 166797730}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Very courteous checkin and very fast. The decor and cleanliness of both the lobby and rooms are exellent. If you fly out of that terminal, its is VERY convenient. Checkout was quick and courteous as well. I will return for sure.", "title": "Great Hotel visit", "helpfulness": 2, "user": "chris s", "date": "July 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 166650342}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The Park/Sleep/Fly package that the Westin offers is very convenient for us and we enjoy our stay at the hotel. Our room this time looked over the lobby and restaurant and was more spacious then some of the rooms looking out towards the airplanes. The security entrance/exit is not working for us because we arrive too late and leave too early. We ate at the restaurant and while the food is okay, it is nothing special, but it is pricey because of the location and the association with a Westin hotel. I wish they would change their menu occasionally and provide some lighter/smaller items for people who don't want a heavy meal later in the evening. We already booked additional stays at the Westin because of the convenience and the very professional and friendly valet service.", "title": "Overnight Stay at the Westin Airport Hotel", "helpfulness": 1, "user": "Beachlover888", "date": "July 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 166626791}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "I arrived in Detroit late, and had to leave early, so I opted to stay at the airport. I chose this hotel because it is in the terminal. It is lovely, room was large, clean and peaceful. Really a nice place. It was a blessing not to have to board a bus to get there. There is a security checkpoint right at the hotel, which is convenient, but unfortunately it didn't open early enough for my flight. It was a bit hard to find my way to the regular checkpoint, but there was almost no line, so it was no problem. If you are in transit in Detroit, this is the place to stay.", "title": "Quiet oasis.", "helpfulness": 1, "user": "travelingmom35805", "date": "July 2, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "value": 3.0, "rooms": 5.0}, "id": 166026534}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "This hotel is clean, modern, and sits comfortably among its Marriott and Hilton peers, in terms of service and quality. My room was neatly appointed, if not a little sloppy in presentation, but everything felt clean and cared-for.", "title": "Above average - if your destination is DTW", "helpfulness": 1, "user": "chalega", "date": "June 27, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 165432361}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "As this is an airport hotel, don't expect much of a view, or nearby nightlife options. I was staying for a convention, which also took place at the hotel. If that's not your scenario, I'd suggest another hotel (perhaps the Westin downtown?), simply for the ease of travel and doing things.", "title": "Wow, one of the best airport hotels", "helpfulness": 1, "user": "Gunzee", "date": "June 25, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 165253505}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled solo", "text": "The secret in this hotel, though, is the shortest *direct* security line at the airport.", "title": "Nice experience", "user": "georgiegirl42", "date": "June 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 164445425}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Arriving in DTW on a late flight and wanting to hit the sag as soon as possible. Roger that, if you are flying on Delta - walk right into the very nicely designed lobby of the Westin.", "title": "Yes it's in the airport but in the Delta terminal", "helpfulness": 1, "user": "Finke", "date": "July 28, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 169529916}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "If not, any of the airport jobs will probably do since you have to take a considerably long transfer from the \"the rest of us\" terminal to the Delta terminal.", "title": "Convenience overcomes the little flaws", "user": "NKC", "date": "July 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169367677}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "The hotel itself has a beautiful lobby, nice rooms with not so nice noise insulation to the neighboring room (all hell broke loose at 7 am in the room next to my suite). The bathroom of my room was really beautiful, quite a treat for an airport joint...", "title": "Excellent Location good value clean exceptional comfort", "user": "133DavidL133", "date": "July 27, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 169277531}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Breakfast was good, but servers mostly busy with chatting among themselves. Also: bed and breakfast doesn't actually mean \"bed and breakfast\". It means you have $20 bucks of your breakfast bill; an amount that you can easily exceed when ordering a la carte, as there is no breakfast buffet.", "title": "Good place to stay but don't expect any Platinum upgrades", "helpfulness": 1, "user": "AdmiralMaggie", "date": "July 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 168889914}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Finally, our room definitely smelled of smoke despite the fact that Michigan hotels are by law non-smoking, which means that the smoke detectors in a room connected to the ventilation system of my room must not have been trigger by someone smoking... Very upsetting.", "title": "If you have to go to the airport next day, Must stay here.", "user": "rurina", "date": "July 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168832579}], "location": {"country": "United States", "city": "Detroit"}, "stars": 4, "variance": {"poor": 19, "average": 45, "very good": 195, "terrible": 7, "excellent": 495}, "aka": "The Westin Detroit Metropolitan Airport Hotel Detroit", "slim_ranking": 0.0588235294118, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "The Westin Detroit Metropolitan Airport, located in the new world-class McNamara Terminal, offers a private security entrance, latest technology and Detroit's most stylish & comfortable surroundings."}