{"user_rating": 4.5, "review_count": 220, "name": "The Angel Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Lovey resturant and food was amazing, the staff were really helpful and nothing was to much trouble they all seem to really enjoy working there which made our whole evening a really enjoyable one. Will deffiently go back if in the area again.", "title": "Excellent Meal", "helpfulness": 1, "user": "Faye L", "date": "July 29, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "service": 5.0}, "id": 169622857}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Stayed here for one night on Mon 1/7/13 on a Travelzoo deal. I have known of this place for years (before they added accommodation) & always wanted to go there - so jumped at the chance when I saw the offer on Travelzoo. I certainly wasn't disappointed. It is in a lovely quiet country location and the accommodation was excellent - comfortable and clean. The staff were very friendly, the service attentive and the food was absolutely delicious and plentiful. We were impressed with the canapes delivered to the room prior to dinner - a lovely touch. I would definitely recommend.", "title": "Fabulous stay with delicious food", "helpfulness": 1, "user": "Tattyoldbit", "date": "July 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169612812}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "We were celbrating a good friend's birthday with a party of almost 40 people. No mean feat to look after a group this size whilst providing excellent food and service as if we were a table for four! Excellent food and a delightful room for our stay over. Fresh milk in our fridge for tea, delightful breakfast incuding home made black pudding. A computer glitch meant we were unable to pay, the charming staff member said to avoid delaying us, they would phone us to take payment in a day or so.", "title": "First class stay and dinner", "user": "Richard B", "date": "July 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 169414394}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Thank you Pascal and all your delightful staff for a most pleasant experience.", "title": "You must stay here", "user": "alisonl62", "date": "July 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168764247}, {"rating": 4.0, "stay_parameters": "Stayed June 2013", "text": "Booked this as a surprise for my husbands birthday. He has said its one of the best things he's had bought for him. Room was beautiful, we had the Rylstone suite, if I had to pick a fault, and it's not easy to find one, no mirror to sit at and dry hair, but that's being picky. Food was beautiful, staff incredibly helpful and nothing was too much trouble. I find it very hard to believe some of the derogatory comments on here. We had a 5* stay. Well done Angel Inn.", "title": "A lovely little place!", "user": "wellishwonder", "date": "July 22, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 168579575}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Yes the staff have changed since our last visit in September last year however nothing has changed otherwise. All the staff cant do enough for you and are all very pleasant. The food was superb again with a great choice of wines.", "title": "The staff have changed!", "user": "ian056", "date": "July 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 168515678}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Very good food for the money.Superb rooms but a little on the expensive side,Although they are well equipped. The location is brilliant and a superb base for visiting the surrounding dales.The service in the evening was very good with a pleasant and knowledgeable wine waiter.Overall would be very happy to return for another visit.", "title": "VERY GOOD BUT A LITTLE OVERPRICED ROOMS", "user": "david p", "date": "July 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168417178}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "Excellent evening last night to celebrate my birthday with friends, the rooms are beautiful , the food is wonderful and Pascal and his team were fabulous. No doubt we will return soon...thankyou again from the Hunter/ Gregory/ Nichol party.", "title": "FABULOUS TIME, BEAUTIFUL LOCATION , AMAZING FOOD & SERVICE!!!! A credit to Pascal and his team.", "user": "kimgrego", "date": "July 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 168405685}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "A few weeks ago we phoned to see if any rooms were available for the night of our friends wedding which was being held at the Angel, in their wedding-licenced “Cave”. When we were told the price by Pascal, my partner quipped “that sounds quite expensive”. This was greeted with the start of what turned out to be a ill mannered, bad tempered tirade accusing her of calling him a rip-off which she never mentioned.", "title": "What a Shame!", "helpfulness": 9, "user": "Cherry-Garrard", "date": "July 16, 2013", "detail_rating": {"value": 3.0, "location": 4.0, "service": 4.0}, "id": 167758128}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The only way that she was able to end the abuse was to calmly say that she was going to “end the conversation and put the phone down”. We had no alternative than to stay at Grassmere away from the rest of the Wedding Party which was a great shame.", "title": "The best equipped room we've ever had ...", "user": "GolferYork", "date": "July 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166717923}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We stayed here for a couple of nights on a Travelzoo offer of £149 DBB per day. We were delighted with the suite that we occupied. The limited dinner menu available on our package was fine for us (we could have upgraded each night for £10 pp) and the quality of the food was excellent as was the table service. The wine list offered plenty of choice of many lesser known good producers. Breakfast choices were plentiful and potentially very filling.", "title": "Beautiful room, great food, appalling Wi-Fi", "helpfulness": 1, "user": "nataliatiyad", "date": "September 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 175119035}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "The housekeeping service failed on one occasion and this was charmingly rectified as soon as we returned in the evening.", "title": "Amazing!", "helpfulness": 2, "user": "EEEEvans", "date": "August 27, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 174241312}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Part of the pleasure of this area was the ability to do walks in Upper Wharfedale and around Malham and on reading that the hotel provided inclusive high speed Wi-Fi services to all rooms we opted to download our maps on site. Big mistake. The Wi-Fi is none existent in the rooms (at least those in the converted barn) and that in the main building is so painfully slow that a 15 second download at home took 20 mins there. The staff knew the facility was hopeless and implied that the owners were aware but no action was being taken to correct the situation.", "title": "A taste of luxury", "helpfulness": 1, "user": "Gill S", "date": "August 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 173392882}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "A shame, because we'd love to return but not whilst the Wi-Fi remains so awful.", "title": "Excellent as Promised", "helpfulness": 1, "user": "Woodlandstearoom", "date": "August 13, 2013", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0}, "id": 172125525}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We love The Angel at Hetton and have now been twice. The setting is perfect, the rooms are beautiful, the bar is warm and welcoming, and the food...what can I say!?!? Every last mouthful from the canapé they brought up to our room before dinner to the delicious selection of cheeses we finished with, was perfect! You'd be a fool to miss this place! I almost don't want to review it so it's never booked up when we want to go! This place is a gem, an absolute must visit for a quiet getaway to the countryside.", "title": "Bit too slap dash?", "helpfulness": 4, "user": "Adam S", "date": "August 11, 2013", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 3.0}, "id": 171687654}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We stayed at the Angel Inn for our Silver Wedding Anniversary in July 2013 and could not have asked for a better place to stay. We booked the Sycamore Suite in Sycamore Bank next to the main building. This suite is quite spacious with a sofa and flat screen TV and access to a garden area with a small table and two chairs with the glimpse of a lovely view through the trees opposite. The room was immaculately clean and nicely furnished.", "title": "A top class hotel for a special night or weekend away", "helpfulness": 1, "user": "hammerboro", "date": "August 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171374355}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We had an excellent meal in the main restaurant and a nice touch was that an hour before dinner some canapes were brought to our room. One of the obvious attractions is that you are in the Yorkshire Dales and we did a fantastic circular walk from Malham Tarn (about 30 minutes drive away) that took in Malham Cove.", "title": "Angel at Hetton for a special date", "helpfulness": 1, "user": "StuartBaird", "date": "August 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171145844}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "My wife and I spent a lovely anniversary weekend at the Angel and we found it meet our expectations and in many ways exceed them. Having seen 'The Trip' with Steve Coogan and Rob Bryden we were tempted - especially by the thought of the English breakfast in this part of the world. We were not disappointed.", "title": "Luxurious break", "helpfulness": 1, "user": "Gill A", "date": "August 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171047205}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "The dinner, bed and breakfast deal was around £270 and I have to say this is more than a fair price for the quality of dining, the service and the room. I know that you could easily pay £150 - 200 for a dinner of this quality in London - so in my view, getting a high quality and luxurious room as well as a top class breakfast was an added bonus at the market rate.", "title": "Very good but overpriced and a poor attitude", "helpfulness": 2, "user": "EJ C", "date": "August 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 170689418}, {"rating": 4.0, "stay_parameters": "Stayed August 2013", "text": "The Angel is worth visiting for many reasons - its beautiful location, so close to some of the most spectacular scenery in Europe, never mind England or Yorkshire; the quality of the food and the quality of the service. Pascal himself took us to our room and explained some of the history of the place and its development - it has been a long road, hard work and only with a clear vision which has got them to this point. The Angel is also the birthplace of the Gastro-pub in Britain and therefore for that reason alone has to mark it down as a 'must visit' for epicures.", "title": "Lovely food pity about the bar service!", "helpfulness": 2, "user": "Flipper63_13", "date": "August 4, 2013", "detail_rating": {"cleanliness": 4.0, "location": 5.0}, "id": 170644785}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 5, "variance": {"poor": 22, "average": 13, "very good": 34, "terrible": 9, "excellent": 142}, "aka": "The Angel Hotel Hetton", "slim_ranking": 1.0, "description": "Pioneering Gastropub in the heart of the Yorkshire Dales providing luxury accommodation. Seasonally changing locally sourced menus with blackboard specials featuring the daily catch from the east and west coast.Nooks and crannies and open fires create the archetypal country pub atmosphere. Expect a warm Yorkshire welcome, little quintessential extras in your room like fresh milk and sliced lemon and ice.Experience dinner in our three AA Rosette restaurant or our traditional Bar Brasserie and wake up in comfort to a 'Full Yorkshire Breakfast'."}