{"user_rating": 4.0, "review_count": 1281, "name": "The Dana on Mission Bay", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "Stayed in the newer Bayview suite which was very nice, ask for the AAA rate to save some money. Very roomy 2 queens or a king. Kitchenette and nice bathroom. Sitting area with couch that is a queen sleeper, great for the kids and a partition door which gives privacy, and also a sleep in if the kids wake early. Nice large patio with bay views. Resort is super kid friendly, lots of other families. Pool is nice not too many chairs and pool service is not always available. Rent a boat accross the street at Sea Forthe next to the Hyatt Hotel across the street, they had a much larger boat inventory. We fit 9 people on a pontoon boat, very fun and only $85/hr. Mission Blvd has lots of restaurants. Ask the conceriege about the restaurant with the magician on Mondays and Thursdays, well worth it!", "title": "VERY Realaxing", "helpfulness": 9, "user": "jod2la", "date": "August 8, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3747085}, {"rating": 3.0, "stay_parameters": "Stayed August 2005", "text": "Very friendly and helpful staff. Overall an excellent stay. We'll be back", "title": "not bad", "helpfulness": 7, "user": "drumsalongthemohawk", "date": "August 5, 2005", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 3739126}, {"rating": 4.0, "title": "The View Makes It Best!", "text": "As with the other reviews, book into the newer section. Rooms were nice and modern, staff was helpful and courteous. Pool and hot tub nice. They offer shuttles to seaworld and the zoo. Nice location on the bay but have to drive to everything else. Skip Mission Beach and the amusement park unless you like the seedy crowds and smell of marijuana.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "August 5, 2005", "id": 3738638}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "We were there July 4th weekend. The rooms were clean and comfortable.", "title": "Loved the Dana on Mission Bay", "helpfulness": 8, "user": "vapisala", "date": "August 3, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3734056}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "The grounds were lovely and well kept. The view of the bay each morning was spectaculor! However, the furnishings needed some serious updating. I felt that I was in a Hotel from from the 70's. Also, being from the south, I was somewhat surprised that the staff would not speak to you at all. Overall, I would definitely go back...it was easy to travel around San Diego from the Bay Area. In the end, the View is what makes it the best!", "title": "Split personality", "helpfulness": 11, "user": "Equality_7-2521", "date": "July 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 3.0}, "id": 3685768}, {"rating": 4.0, "title": "OK, but a little pretentious", "text": "We stayed for 4 days over New Year. The hotel has a great location if you want to be near the sea but don't expect to walk to anywhere else from here it is isolated. The hotel has two sides to it. The newer section where we stayed was new, clean with nice views. The rest looked somewhat wornout from the outside. The breakfast at the Blue pearl was a standard affair. Don't bother with dinner there. The whole place has the feel of somewhere that desperatly wants to be 4 or 5 star but can't quite make it. Rather overpriced for what really amounts to a good motel in a nice location.", "helpfulness": 5, "user": "JWUk", "date": "January 8, 2007", "id": 6565923}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "I stayed in the newer area of The Dana, and it was quite nice. I was on the ground floor and the room opened to the bay...delightful. The room was spotless and the furnishings up-to-date. As others have stated, you must have a car if you are going to stay at this relatively isolated property. But, hey, it's Southern California...of course you need a car!", "title": "Beautiful Location, Nice Rooms", "helpfulness": 1, "user": "FromTheBu", "date": "December 29, 2006", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 6511107, "likes": {"liked": "— Clean, with a beautiful view.", "disliked": "— No in-room WiFi."}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "My only complaint was that the free wireless did not work in my room (I guess you get what you pay for), so I had to take my iBook to the lobby for Internet access.", "title": "Great View of Bay", "helpfulness": 1, "user": "Traveller3333", "date": "December 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 2.0, "rooms": 4.0}, "id": 6503155}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "Pros:", "title": "Absolutely Fabulous!", "helpfulness": 2, "user": "toorollingstoned", "date": "December 25, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6495678}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "1) Free Shuttle Service to the Seaworld and to the airport (hourly)", "title": "A pleasant place to stay", "user": "LLTVancouver", "date": "December 25, 2006", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6491260, "likes": {"liked": "— Setting", "disliked": "— Front desk"}}, {"rating": 5.0, "title": "Wonderful Hotel", "text": "I loved this hotel. The location is great - directly across the street from Sea World. The staff went above and beyond to make sure our stay was perfect. The room was clean. They offer two heated pools and hot tubs. The restaurant on site was reasonably priced and the food was good. I would definitely recommend this hotel.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "November 20, 2005", "id": 4128059}, {"rating": 2.0, "stay_parameters": "Stayed October 2005", "text": "We stayed at the Dana as it was the closest hotel to Seaworld. It was close and we walked with our 2 kids one evening there & back - it is a 25min walk, the kids were not keen to do it again!", "title": "Poor service & over busy", "helpfulness": 14, "user": "faye f", "date": "October 3, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 1.0}, "id": 3986193}, {"rating": 3.0, "stay_parameters": "Stayed September 2005", "text": "We booked a room in the newer section and it served its purpose for us . There are no frills but the room was clean and newly furnished . The decor was dark & the bathroom small but there was a good wet bar with microwave, coffee maker & granite top.", "title": "Website not quite 100%", "helpfulness": 13, "user": "mwcotton", "date": "October 3, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 3.0}, "id": 3985643}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "We spent Sat afternoon by the pool which was awful! no towels were provided & the hotel had 2 back to back weddings taking place. The band was so loud & the music clashed with the piped hotel grounds music. One wedding finished at 5pm , the other started at the same time so the hotel was heaving with people !! very very busy. We were trying to have a meal in their restaurant Firefly but there were so many wedding guests passing chairs over our heads, smoking cigars & cigarette ends all over the floor. That night the revelry continued to very late. If you are looking for a quiet hotel , I would strongly recommend checking if there are any weddings booked! The hotel is quite small and really this took over every available space as their facilities are all very near to each other.", "title": "We loved this hotel", "helpfulness": 28, "user": "janinelouie", "date": "August 26, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3809331}, {"rating": 4.0, "title": "Pleasantly Surprised at The Dana", "text": "The service by the pool was non existent ( noone there), the service in Firefly was very poor - our meals came up wrong & we told them 3 times but they did nothing to change them. The decor in Firefly was also disappointing , not as nice as the web picture shows. The front desk was unhelpful - we checked in at 10 pm but were kept waiting whilst the check in chatted to his colleagues about Las Vegas. On check out when they asked us for feedback & we told them these comments, they offered to take off our internet connection only ( $3.95!).", "helpfulness": 14, "user": "A TripAdvisor user", "date": "August 24, 2005", "id": 3803117}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "We stayed at the Dana for 4 nights as part of a California holiday. The staff there were really lovely and very helpful, including at the restaurant. The room was dissappointing though - very basic and by the time we got a baby cot in there, there was really no room to get around, we had to clamber over beds to get to the bathroom, and somehow the shower always managed to flood the bathroom floor, and as there was no drain we had to put the towels on the floor each day so that we didn't slip over, just generally annoying. However the main problem we had with this hotel was the noise. We were upstairs at the end of a block and the noise from people walking up and down the stairs was bad - but the noise of the traffic outside was unbelievable. If you are staying here do not stay in the 500s block., it really was one of the noisiest hotels I have ever stayed in. I think if you were in one of the blocks with the marina view or pool view it would have been much nicer in that respect.", "title": "Nice location - incredibly noisy though", "user": "crdtdb", "date": "April 19, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 2.0}, "id": 28299859}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "We booked our room through AAA. I knew we would be in good hand when I had to contact the hotel directly to change the dates because the staff was so helpful. When we got lost trying to find it (our fault), another staff member stayed on the phone with me until we found it. I should add, the hotel is NOT hard to find.", "title": "So much more than we expected", "user": "Twenty3Skidoo", "date": "April 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28267721}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "From check-in to check-out, we enjoyed every moment we were there. Our newly remodeled large room had an amazing view of the bay (we paid a little extra for it and it was worth it to see the sunset every night), the bed was comfortable (with lots of extra pillows), food service was totally reasonable (not something we usually take advantage of), the Blue Pearl restaurant was great (especially our breakfast experiences there because of the staff) and had a diverse enough menu to satisfy our taste.", "title": "The nicest place we've stayed in San Diego. Right on the bay!", "helpfulness": 1, "user": "dianeg0123", "date": "April 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 28106535}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "I really can't say enough about our stay. The staff at the Dana makes the hotel even more worth it. Another example: after we checked out, my husband thought he left his cell phone in the room. The concierge helped me try to find it in our room.", "title": "Beachfront Paradise", "user": "becksbeach", "date": "April 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28105963}, {"rating": 1.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "I can't wait to go back.", "title": "Totally Disgusted.", "helpfulness": 2, "user": "Lindz32109", "date": "April 15, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 2.0, "service": 3.0, "rooms": 1.0}, "id": 28099761}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "This was the second visit and I never thought it could get better but it did. The staff at the Dana Inn was the best and actually helped me save money on our family package to Sea World. o the entire staff at the Dana Inn... we thank you deeply for the wonderful service and going the extra step to be so helpful. \"A Job Well Done\" and we look forward to our next visit soon.", "title": "The most beautiful, and most relaxing place!", "user": "fred83060", "date": "April 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28092166}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "I found a fantastic rate for the Dana over Spring Break 2009. I booked a deluxe premium bay-view room with a breakfast package via a booking engine which made it quite clear what I was booking and paying for, but I checked Trip Advisor just the same. What I found was alarming, as several people were claiming a \"bait and switch\" done by the hotel upon check-in. My only thought on this is they booked the lowest rate on any given reservation site, but on researching many sites, could not find one that wasn't clear about the room being booked. My advice would be to specifically book a room in the Water's Edge buildings, specifically a premium bay view if you want the best view of the bay. If you're concerned about cost, book the cheaper, older rooms in the old section, but expect to get what you pay for. In our case, we feel we got MORE than what we paid for.", "title": "Absolutely wonderful!", "user": "GetmeouttaMN", "date": "April 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28078626}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "We got exactly what we booked upon check-in, experienced GREAT service from everyone from front-desk clerk, to maid service staff, to the bartender at Firefly, the shuttle drivers and EVERYONE at the Blue Pearl. I find that if employees are treated with cheerfulness and respect, you'll generally get the same back.", "title": "Nice stay", "helpfulness": 1, "user": "2girlsandmom", "date": "April 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 27927267}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "The breakfast package was a total of $60 for our room, which was enough to feed our family of 4, and was very good. We ordered dinner to go, and that was excellent, also. The service was fast and friendly, almost classy, given the fact it's a casual, family-friendly eatery. We only had drinks at Firefly, but as I said before, the bartender was fantastic, the drinks were great, and he even found us some bread and dipping oil.", "title": "Great Hotel for a Single Parent", "helpfulness": 1, "user": "KAsheDC", "date": "April 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 27813305}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "The pool by Firefly is the better pool of the two available because of the view of the bay and the fact that it's lit at night. The Tropical Pool at night was a little creepy and dark, but would be nice during the day.", "title": "Beautiful location", "user": "DeaconFans", "date": "April 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27802967}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "Took one of the cheapest rooms located in the block to the north east of the smaller pool. Room 217 second floor. Accessible from outside landing.", "title": "Good value in a great location", "user": "LVSaint", "date": "May 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 30001566}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Away from the noise of the poolside but close enough to get to within a minute.", "title": "Lovely place to stay after initial disappointment", "helpfulness": 1, "user": "izzyHull", "date": "May 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 29637691}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "Might get a bit of noise from around the outskirts of the hotel as it is public land (as are the areas around a lot of these waterfront hotels in Mission Bay) but this did not pose a problem.", "title": "Good Value", "helpfulness": 1, "user": "JojoDavis_California", "date": "May 6, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 29429968}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Room although small was nicely renovated and comfortable with fridge and large flatscreen TV. Beds were fine. Small bathroom adequate. No free wifi and $12 day but for the low price, not a big problem. Will return!", "title": "location, location, location. my my what a view!", "user": "vacations101Colorado", "date": "May 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29309202}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "(Try to get the room next door on the end to have the additional window over the marina.)", "title": "Great stay at The Dana for a great price!", "user": "Ladybug0600", "date": "April 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 28962981}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "This was our second trip to the Dana. We enjoyed staying there so much, we had to stay again. Our room in the newer section, (which is the only section we have stayed in), was clean and spacious with a microwave and mini-fridge. The view each day from our patio, supplied with chairs and a small table, was breathtakingly beautiful. We found both pools to be extremely clean and inviting with lush, tropical landscaping. The surroundings provided a tranquil atmosphere that allowed us to truly relax. We would definitely stay there again, and recommend this hotel to all our friends.", "title": "Relaxing with Beautiful Views", "user": "strivingtorelax", "date": "April 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 28870436}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "This was a really nice motel, with nice views overlooking the marina.", "title": "Nice but under flight path", "user": "bakpas", "date": "April 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 28676230}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "Only two reasons we might not stay here again are", "title": "Just Right", "user": "RoadrunnerTx", "date": "April 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 28554210}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "1. Bit far out of town but good if you just want to go to Seaworld", "title": "we would go back in a second", "user": "golfdoc_9", "date": "April 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 28549568}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "2. Underneath the flight path", "title": "Our home away from home", "helpfulness": 1, "user": "SammyIsAWhale", "date": "April 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28435731}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "As we have three children, finding a hotel that has standard rooms large enough for five is tough and limits your selection. I was able to book the Dana for Presidents Day weekend through their website. We booked a King room in the new section with a sofa bed. We drove down to San Diego and spent the day at Sea World the went to check into the room after dinner that evening.", "title": "Pleasantly Surprised, Wonderful Stay", "helpfulness": 8, "user": "juxie", "date": "February 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 6814009}, {"rating": 2.0, "title": "Dana is Dr. Jekyll and Mr. Hyde", "text": "THE ROOM:", "helpfulness": 10, "user": "ryan360guy", "date": "February 16, 2007", "id": 6803345}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "We were given a room in the new section (as requested) overlooking the Marina. It was nice and large. I called the front desk and requested a crib (had forgotten to do that when reserving a room) and they delivered on within 15 minutes (which is much faster than other hotels have been). The \"double\" sofa bed was actually only a twin, but that was fine with us as we had brought a blow up air mattress for my son. There was plenty of room for everyone we could still move around. We had a nice balcony with a table and two chairs. The bathroom was spotless and really nice with a natural skylight and wall lights (no florescent lights). The toilet had a quiet flush on it and my son loved that there were q-tips and cotton balls in the bathroom along with the shampoo, mouthwash & conditioner (little things impress 9 year old boys). There were also two robes and slippers for use. There was a nice sink in the bathroom with a fridge and microwave (they even had a recycling bin under the sink). It was very comfortable and quiet (although you could hear the airplanes from time to time).", "title": "Great View, great Hotel, Free Parking, Close to Beach", "helpfulness": 3, "user": "debblabs", "date": "February 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6738900, "likes": {"liked": "— Location, View of Room and Free Parking", "disliked": "— Laundry Facility and Workout equipment"}}, {"rating": 4.0, "title": "Great For Families With Small Children..Loved It!", "text": "THE POOL", "helpfulness": 3, "user": "My3sonsMom", "date": "January 21, 2007", "id": 6636404}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "The kids loved in. It was heated with nice views, good size jacuzzi. The pool on the old section was also nice, although no views, but they had ping-pong and other games as well. The bar would put any drinks in plastic cups for you so you could take them to the pool area.", "title": "Nothing to complain about this hotel!", "helpfulness": 5, "user": "Nelleke", "date": "January 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6634651, "likes": {"liked": "— The whole package! But most of all the great services!", "disliked": "— I don't have any, but maybe the distance to downtown but I knew that when I booked it and it was no problem for us."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "We just returned from a wonderful stay at the Dana Hotel in San Diego. We were in the area with my sons soccer team and several families participating in a tournament. We had a total of 8 families who stayed at the Dana. Not one complaint from any of them.", "title": "Gorgeous Hotel, Excellent Staff & Ideal Location", "helpfulness": 15, "user": "Tuckers", "date": "March 20, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4715655}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "The staff at The Dana is very friendly, helpful and efficient. We had a couple extra requests and they were taken care of immediately. The hotel grounds are clean and well kept. They have security personnel walking around, too. The concierge desk is staffed with some very knowledgeable, friendly people.", "title": "loved this hotel!", "helpfulness": 10, "user": "danichlo", "date": "March 11, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4599738}, {"rating": 4.0, "stay_parameters": "Stayed November 2005", "text": "We stayed in the newer area of the hotel, in the Bay View Rooms on Waters Edge. These rooms are large and all have water views. We were on the first floor, so our balcony opened right up onto the grassy area by the water. There were a couple chairs and a table on the balcony, too. The weather was cold & rainy so we didnt really get to take advantage of our ideal location. There are 2 pools, the one near the lobby and our room was very pretty. It had a nice large jacuzzi, which my kids enjoyed! and the pool was heated nice and warm. They have towels by the pool, too, which was a nice touch.", "title": "It worked..", "helpfulness": 9, "user": "cooperswen", "date": "February 27, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 4559827}, {"rating": 3.0, "title": "Wow!", "text": "The hotel room (room 1109) itself was really nice. As you enter there is a closet on the right, and the bathroom to the left. A nice touch is the motion sensor light that goes on as you enter the room. The bathroom was spacious and beautiful! Dark slate tile & granite countertop. A ton of counterspace, as well as some shelves to put things. Tub/shower combo. Water got hot quickly and decent water pressure.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "February 16, 2006", "id": 4465301}, {"rating": 3.0, "title": "Nice hotel Just dont use long distance telephone", "text": "There was a small kitchenette, too. With a microwave, refrigerator, sink & coffee maker (with plenty of coffee supplied). There are cupboards to store your food items, but no utensils or bowls/plates.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "January 13, 2006", "id": 4350421}, {"rating": 5.0, "title": "Fantastic hotel", "text": "When we arrived, we were pleasantly surprised at this hotel as this was only rated a 3 & a half star hotel. The room was fantastic, the view was even better and it was close to all.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "January 9, 2006", "id": 4334518}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "Very very Happy With This Hotel And Would Recomment to Anyone!!", "title": "Actually 2 Distinctly different properties. Be Careful!", "helpfulness": 47, "user": "beeclean", "date": "January 9, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4334153}, {"rating": 5.0, "title": "Excellent experience", "text": "My 11 y/o daughter and I spent two nights at the Dana in early January 2006. I booked a marina view room based on the pictures and descriptions on their web site. Upon arrival at the room, I was extremely disappointed by the motel atmosphere. While the room was neat and updated, it was impossible to get away from the cheap claustrophobic roadside feel.", "helpfulness": 19, "user": "KYmiddleamerican", "date": "January 2, 2006", "id": 4316625}, {"rating": 5.0, "title": "Loved the Dana!", "text": "In fact, 'marina view' is misleading since the only way to see the harbor is while outside of the room or standing up bedside from within.", "helpfulness": 19, "user": "A TripAdvisor user", "date": "December 27, 2005", "id": 4305982}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "Luckily, when I expressed my displeasure at the front desk they were overly generous by upgrading us to a bay view room. Simply put, it was night and day. The 'new' section is logistically isolated from the motel section with what technically amounts to its own pool and common area. The rooms are newly furnished, with perfect views of the adjacent bay.", "title": "Beautiful at the Dana", "helpfulness": 9, "user": "wateronbluesky", "date": "December 18, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4248482}, {"rating": 5.0, "title": "Fab hotel", "text": "Stayed in the newer section of the hotel which it would seem is the place to be! Very clean, smart and spacious. Patio overlooked the bay and the tramp with his thong on which made for abit of entertainment! Great location for relaxing, running, cycling etc but need a car for resturants etc.", "helpfulness": 6, "user": "Foxbudd", "date": "October 20, 2006", "id": 5975180}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "Seaworld is right next door and you are pretty central to most things so a good location. I would definatley stay again but only in the newer rooms (1000's and 2000's).", "title": "enjoyed the Dana", "helpfulness": 7, "user": "traveler06", "date": "October 12, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 5945512}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "Stayed in the new section of the Dana last week. We found the room to be a good size and nicely done. It was nice to have a fridge and microwave. Comfortable beds, and the evening turndown service was a nice touch. They also provide slippers and robes. The concierge and front desk staff were helpful. They offer a shuttle to the airport, Sea World and Belmont Park/Mission beach. We ate at the Blue Pearl and Firefly and both were good. Firefly has a much more interesting dinner menu and has nice outdoor seating near the pool. There are two pools - one in near the main lobby and one in the garden area. We also saw the older sections of rooms when walking by, and these are also fine, just the views and locations of some that are not as great. I would suggest to pay extra for the newer rooms. I can understand why some people complain about the older rooms because of their view/location or lack of. But, overall this is a decent hotel. Sea World is about a 15min walk. You can also walk across the bridge and up to Mission Bay Park/Belmont Park/MIssion Beach. Pacific Beach is further north. There are more restaurants in this area. I would suggest a car if you are wanting shopping, attraction and dining choices.", "title": "Okay stay...", "helpfulness": 1, "user": "JLNH", "date": "September 28, 2006", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 5889048, "likes": {"liked": "— restaurants, & close to conference center", "disliked": "— price"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "I stayed at The Dana because I was taking a seminar at the nearby Mission Bay conference center and I didn't want to rent a car. I suppose because of its location the price goes up, but I thought $189/night was a bit much. My second floor \"standard non-view\" room was pleasant enough but was accessed with stairs--no elevator. The windows had palm trees in front of them so no view, but it did feel private. I enjoyed the two restaurants on the property--the food was very good. The Firefly lounge had very pleasant outdoor tables where I ate a late dinner after arriving. I wasn't able to eat there another day, though because a wedding was using all the space. I also enjoyed walking along the marina to my room. I probably wouldn't stay there again, unless I needed to be near the conference center again.", "title": "Over-priced", "helpfulness": 6, "user": "Katyblue", "date": "September 28, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 2.0}, "id": 5885182, "likes": {"liked": "— The atmosphere of the pool areas", "disliked": "— price"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "The website photos and information give a very different feel to what it actually is. We wondered if we were at the right place. We anticipated this hotel to be the luxury part of our vacation. Very over-priced. The boardwalk along the marina is very nice and peaceful, but that is open to the public anytime and they didn't have to pay $250 a day to use it. There are two very nice pools in different areas with a different \"feel\" to each of them. We enjoyed the evening fireworks view as we enjoyed the pool. Very, very nice.", "title": "Reasonable hotel, but over-priced", "helpfulness": 6, "user": "Eurofolk", "date": "September 24, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 5831081, "likes": {"liked": "— Location", "disliked": "— price"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "Took our granddaughter to San Diego for the weekend from L.A.f by train. She loved it. Booked the Dana even though some of the review were spotty. Arrived late and check in was a breeze with the clerk really trying to accomodate our request for a king bed plus a sleeper sofa for our granddaughter. Got exactly what we asked for - it was in the new section looking out on the bay. Beautiful room - lovely view - perfectly manicured grounds and friendly staff. Would recommend to anyone. The Blue Pearl Restaurant was a little bit of a hike but with reasonable prices, abundant well prepared food and very kid friendly. The Dana (plus Shamu, of course) made the weekend.", "title": "Wonderful place", "helpfulness": 2, "user": "theridleys", "date": "December 4, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6330475, "likes": {"liked": "— Cleanliness and view", "disliked": "— Not much"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "The hotel offers exactly what its pictures show: comfortable environment, two swimming pools, bay view rooms that overlook that harbor.", "title": "Good Value and Excellent Environment", "helpfulness": 2, "user": "EthanJay", "date": "November 27, 2006", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "location": 4.0}, "id": 6182233, "likes": {"liked": "— Value and location", "disliked": "— Room quality"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "It is true that rooms in the older section are not as nice as the new ones -- but they are not as expensive either, which is a bargain considering the fact that these rooms are on the same property as the more expensive, newer ones. I find the quality of the older rooms acceptable, though not spectacular. There were reviews written about the noise levels - we didn't find it to be that big of a factor as other guests really respected each other. We only heard other guests as they were getting out of their car or passing by our room.", "title": "Great Place, Great Value", "helpfulness": 7, "user": "localflavor", "date": "November 9, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6092587, "likes": {"liked": "— cleanliness, and convenient location", "disliked": "— charged $10.00 fee for wireless internet per night"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "This property is best if you have your own car and want free parking as well as peace and quiet when you are at your hotel. This setting juxtaposes the hotels by the beach, which allow you to just step out of your room and go to the beach. Those hotels have a relatively noiser environment and parking there costs extra.", "title": "Average stay, nothing special.", "helpfulness": 7, "user": "KD1", "date": "November 7, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 1.0, "location": 4.0, "rooms": 3.0}, "id": 6083061, "likes": {"liked": "— Location", "disliked": "— Over-priced"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The Dana is actually only five minutes away from the beach, so every time we wanted to go to the beach and eat there, we just drove there. The only challenge was to find parking, but that wasn't too difficult either.", "title": "good time", "helpfulness": 8, "user": "aussie82", "date": "October 21, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5979973, "likes": {"liked": "— clean and comfy rooms with cable and pool view room", "disliked": "— nothing"}}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 101, "average": 147, "very good": 401, "terrible": 65, "excellent": 567}, "aka": "The Dana On Mission Bay Hotel", "slim_ranking": 0.277777777778, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}