{"user_rating": 4.5, "review_count": 1210, "name": "The Merrion Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "We have been here several times over the years and the standard never varies.It's a class act in all areas.", "title": "It's discreet and understated nothing is too much trouble and all the staff say hello when you see them", "helpfulness": 1, "user": "Triglyph", "date": "August 29, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 117404341}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We stayed at The Merrion for four nights in early August 2011 and I can see why it is #1 on Tripadvisor. Everything about the hotel was first class, from the decor, the rooms, the service, the food and the location. We could not recommend it highly enough.", "title": "Outstanding in Every Way", "helpfulness": 2, "user": "SteveDanvilleCA", "date": "August 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117366327}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We stayed at The Merrion while traveling with another couple through Ireland and it was our favorite. Not only was the hotel elegant and spacious but the service was top notch. If we ever make it back to Dublin, The Merrion is where we will stay!", "title": "Our favorite in Ireland!", "helpfulness": 2, "user": "lisa23621", "date": "August 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117294696}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Excellence in every detail. They did go out of their way to provide the best service possible. Great food choices and room service. Afternoon tea is a must. Rooms are clean and comfortable, impecable laundry and dry cleaning service. Beautiful indoor pool and great spa. I recommend it 100%. Everyone at every post is most friendly and willing to provide a hospitable ambiance.", "title": "Excellence", "helpfulness": 3, "user": "Carlos O", "date": "August 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117277124}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Second visit in 3 years - only one night - upgraded to a suite so no complaints there. The room(s) were so nice that we decided to stay in for the afternoon and save our walking round Dublin for the evening and the next day. Lounges are very comfortable. Service is great - quick and intelligent.", "title": "Lovely hotel", "helpfulness": 2, "user": "JohnWilly", "date": "August 25, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117254022}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We were so impressed by the Merrion, especially considering what we paid and comparing to other recent hotels. From the moment we arrived staff helped us out of the taxi and by the time we turned around our bags were already inside. They instantly addressed us by name and knew the details of our booking. Check in was speedy and hassle free. We were then directed to our room and given an introduction to the facilities while concierge brought up our bags.", "title": "Fantastic service and great value for money", "helpfulness": 3, "user": "Rachel_Whales", "date": "September 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117685558}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "The room was spacious with all the amenities we could need, including umbrellas, marble bathroom with fluffy towels, a huge and comfortable bed with extra long pillows to properly fit the bed, complimentary newspaper, and more. The decor was classy and luxurious and we liked the atmosphere of both the room and the common areas.", "title": "Fantastic hotel", "helpfulness": 2, "user": "Captainchaos2", "date": "September 2, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 117569671}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "We did find the restaurant a bit too pricey which meant we didn't get to experience the meals and spend more time here, we would have loved to try the breakfast or high tea in front of the open fire place.", "title": "Excellent - home away from home", "helpfulness": 2, "user": "oberone", "date": "September 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117528280}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "The cleaning staff were also a little too thorough for our liking. They rearranged clothes in my case and moved others to the cupboard as well as rearranging toiletries unnecessarily. This may be a positive thing for other guests but I found it quite invasive, however once I mentioned it to reception staff it was no longer an issue.", "title": "Above and Beyond", "helpfulness": 2, "user": "Betera", "date": "August 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117475393}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "Checkout was quick and easy, when I queried the cost of a local phone call they even waved this charge from my bill. We thoroughly enjoyed our stay at the Merrion as well as Dublin itself. We would definitely recommend this hotel and are looking forward to returning one day.", "title": "Very lovely hotel... would like to return...", "helpfulness": 1, "user": "LondonStella", "date": "August 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117467584}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Ok we stayed here for 3 nights after touring the South of Ireland and let me say first that i am pickey so what i am complaining about might not bother others..", "title": "Almost great, but.....", "helpfulness": 2, "user": "Neil-from-Dallas", "date": "August 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "service": 5.0}, "id": 117047819}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "All of the staff did a great job and were very helpfull and friendly, they really tried to make you happy. The location is exellent as has been said by other reviewers. The room was clean and well appointed but...", "title": "First class hotel and food", "helpfulness": 2, "user": "essexreviewer1958", "date": "August 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117033531}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "we always request the best rooms, don't complain about price and expect to be shown to that type room upon arrival, not to a lesser room and then let the shuffle begin! Well that is what happened here. First we were shown to a room on the first floor with the story that these rooms were the best because of the high ceilings! Well that was not going to work as the room looked out on to the roof tops of adjoining buildings. Ok if you got a room thru bargainrooms.com, but not when you are paying full price and requesting the best. Then we were moved to a second floor room that looked into the courtyard gardens and this is where we stayed. Did not want to continue the shuffle but i am sure that rooms on the front ot the building looking toward the street were better!", "title": "Superb service; limited view", "helpfulness": 2, "user": "AMMJK", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116937874}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The lobby/drawing room and bar areas are quite nice and cozy.", "title": "Worth the money", "helpfulness": 4, "user": "SydneyJedi", "date": "August 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 2.0, "service": 5.0}, "id": 116833161}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "We ate breakfast in the cellar restauant and it was nothing special but we did eat dinner in the French Restaurant and it was one of the best...see seperate review.", "title": "A one night stop ..", "helpfulness": 1, "user": "SussexGeorge", "date": "August 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116671974}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "From the welcome to our departure, the staff, service, food and personal attention were truly super! And a terrific pool and changing rooms rounded out our very pleasant stay. Not to be missed when coming to Dublin.", "title": "Excellent hotel in heart of Dublin", "helpfulness": 2, "user": "rdst", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117227909}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "This hotel was lovely, but the best part for us was how welcoming they were of our 16-month-old son. They provided a very comfortable crib in the room, baby toiletries, and they even had a tiny dressing gown for him to wear! We also ate in their Cellar restaurant. The food was excellent, and they had the most extensive children's menu I have ever seen! It was the first time we've been able to take the baby out to a nice restaurant without some kind of scene. Highly recommended.", "title": "Fantastic with our young son!", "helpfulness": 2, "user": "wearyroad", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 117209574}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Everything about the hotel, from the concierge, to check-in, to the room, exceeded expectations. Staff in the bar, drawing rooms and restaurants very efficient and friendly. Room was beautifully appointed and generous in size. Amenities excellent.", "title": "A superb oasis near the centre of Dublin", "helpfulness": 2, "user": "johnandmaggie", "date": "August 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117205149}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "I have stayed in other 5 star hotels in Dublin and have left feeling disappointed and ripped off, but the Merrion has always been fantastic. The rooms are worth the money and the service is first class. The hotel is beautiful, classy, cosy, in a great location and the breafast is fantastic!", "title": "The best hotel in Dublin", "helpfulness": 3, "user": "lizzydays", "date": "August 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117145939}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We stayed here for a long weekend and Dublin was as usual busy and lively. The Merrion is close to the centre but just off the main roads so provides a quiet and relaxing base. The staff were friendly and helpful, but never intrusive; the peat fire in the lounge added to the welcoming atmosphere. Our room was comfortable and well-equipped, and looked out over the gardens. We sampled two bars and the restaurant, and enjoyed them all. There was a slight glitch with one dish at dinner but it was resolved immediately and efficiently, so did not spoil the experience. The day we returned home my husband had to work, so I ate breakfast in the lounge, enjoying pastries and good coffee in front of a fire with a book - a delightful way to start the day! The hotel is not cheap but a great deal of work goes into running it smoothly and its guests are able to enjoy the results.", "title": "Blissful retreat in a buzzing city", "helpfulness": 3, "user": "Twickerstourist", "date": "August 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 117073261}], "location": {"country": "Ireland", "continent": "Europe"}, "stars": 5, "variance": {"poor": 19, "average": 53, "very good": 166, "terrible": 13, "excellent": 959}, "aka": "Merrion Hotel", "slim_ranking": 0.00558659217877, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "The Merrion, created from four Georgian townhouses, is located in the city centre opposite government buildings. Many of the 142 bedrooms and suites overlook period landscaped gardens. Guests can dine in the 2-star Michelin restaurant Patrick Guilbaud or The Cellar Restaurant and Bar. The intimate No 23 cocktail bar waits as does the Tethra Spa which boasts an 18m pool, steam room, fully equipped gymnasium and two private treatment rooms. The Merrion offers six private dining and meeting rooms."}