{"user_rating": 4.5, "review_count": 337, "name": "The Ritz-Carlton Beijing", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The main reason we booked the Ritz Carlton was because we were seduced by photos of the decor... which does not try to be too obviously Chinese. Instead, the designers have opted to go with touches of Chinoiserie, which make is very refined and elegant. We were certainly not disappointed and there were actually few things to fault about the hotel. Our room was really fantastic—very big, very comfortable, very refined, with lots of beautiful details. The bathroom was great and very luxurious (although having the toilet simply behind a glass partition is not necessarily that practical if there are two of you!). We used the laundry service a couple of times and it was really efficient. The breakfast selection is also really incredible—among the best we've ever experienced (and we've travelled a lot). The service overall was also the best that we experienced throughout China. The only question mark about this hotel for me would be its location. It's situated in a new district to the east of the city (near the 4th Ring Road), where there are lots of luxury boutiques. We were there just after the Olympics and the system of alternate number plates was still in place. So, there wasn't too much traffic on the roads and it took us only about 20–25 minutes to get to Tian'anmen Square in a taxi. However, once all the cars are back on the streets, I reckon the that location could be a little more problematic. Solely for that reason, if we went back, we'd probably try the Grand Hyatt, which is so much more conveniently situated for the tourist sights.", "title": "Refined and elegant, but is this the right location?", "user": "ianp1", "date": "September 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 2.0, "rooms": 5.0}, "id": 20060421, "likes": {"liked": "— The decor", "disliked": "— The location"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "I stayed here while covering the Olympic games. Although this Ritz isn't as elegant as others I've visited, the staff is amazing!", "title": "A Gold Medal Stay!", "user": "BonVivantFL", "date": "September 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 19779664, "likes": {"liked": "— The staff", "disliked": "— No complaints"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "I was blown away by the Chinese hospitality. It eceeded my expectations in every way. The restaurant offers many choices and many different types of cuisine.", "title": "Devoid of Character: Don't Forget Your Phrasebook", "helpfulness": 1, "user": "nowvoyager1", "date": "August 17, 2008", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 1.0}, "id": 19036083, "likes": {"liked": "— Outstanding Italian food with great service and a wine list to match", "disliked": "— Lack of authenticity,location."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The exercise room was well equipped. The property is very nice and well cared for.", "title": "Worthy of all the praise and more!", "helpfulness": 1, "user": "MacchitaoConBailey", "date": "August 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 19029549, "likes": {"liked": "— Luxurious accomodations; location to metro & availability of taxis", "disliked": "— Additional charge for Internet, WiFi & printing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled solo", "text": "The interiors and room decor could use an update, but it was very comfortable. The staff is the BEST reason to stay here. They take Ritz-Carlton's usual excellence and kick it up a notch. I reccommend this hotel if you're ever in Beijing.", "title": "Superlative experience all round, great staff", "helpfulness": 2, "user": "tonyamarillo", "date": "August 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18701988, "likes": {"liked": "— Great service and attention to detail, fixtures and fittings all brand new, beautiful classic design", "disliked": "— location not central but a small complaint. it means it is quieter than many other beijing hotels"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "I am based in Hong Kong and my job requires that I travel every week. As a result, every week, I end up in a hotel somewhere in Asia. For the most part, these hotels claim to be \"5 star.\"", "title": "Truly 5 Stars", "helpfulness": 1, "user": "Rabidpuppy", "date": "August 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 39031987}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "I spend a fair amount of time in Beijing, but this was the first time I had stayed at this particular Ritz Carlton. For the past 9 years, my BJ hotels of choice have varied between the Grand Hyatt (great location, but getting very tired), the St. Regis (nice, but scarily quiet since last year's renovations), the Ritz Financial Street (also 5 Star but isolated location), the Intercontinental (4 Star at best) and the China World (good, but over rated).", "title": "Great Location, Comfortable Rooms, Good Service", "user": "emandjeff", "date": "July 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35887788}, {"rating": 5.0, "title": "Barolo in Ritz-Carlton is Beijings best restaurant, period.", "text": "I was a bit hesitant to stay at the Ritz Huamao Center, as my colleagues had told me that service was sporadic and the staff were snooty. However, my company gets a terrific corporate rate there, so I thought I'd give it a try. I am so glad that I did.", "user": "Bud G", "date": "June 23, 2009", "id": 32965605}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Physically, this hotel really reminded me of the Ritz in Hong Kong, which was torn down last year. The rooms are done in a traditional, European style - unlike most hotels in BJ, which seem to be done in a more modern style. No need for me to comment on which is better, given that's really an issue of personal taste. However, I can say that the one bedroom suite I stayed in was absolutely gorgeous - excellent layout, bright, and in very good condition. All the requisite goodies were present - boase sound system, huge flat screen tvs (plus a bonus tv above the bath tub) , Bulgari amenities, ipod dock.....I peeked into a \"regular\" room and, in truth, I would have been happy with that too. Larger and more spacious than rooms at many of the other hotels in the same range. The carpet in the halls still smelled new!", "title": "Loved it!", "user": "MsTravelHag", "date": "April 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 27862478}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "I found the staff and the service to be consistently excellent. No snootiness at all. From the moment I checked in until I left two days later, I did not meet one unfriendly staff member. Special mention to the Club Floor team - in my mind, the team at the Club Lounge is one of the best ever. Again, the key was consistency - everyone was polite, friendly (in a natural, not plastic, way), discrete and enthusiastically helpful. They were also warm and helpful to the non-hotel guests that I brought up to the Lounge for meetings. Very important in a city where locals are sometimes not treated as nicely as visitors by the service industry.", "title": "Great Hotel with Exceptional Service", "user": "nukenriles", "date": "April 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27733437}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "I had to attend a conference at the last minute. The conference was being held in the hotel itslef so i booked a room for two nights. I currently live in Singapore and am originally from India. Having experienced hotels in both these countries and other countries, this was by far my best experience. The staff were excellant and courteous. Service levels were by far the best i have come across. The room was fabulous. The great part of this hotel is that eventhough you may go there for a conference, unless you are in the conference room itself, you will not feel that there is a conference on. This is a great feeling especially when you return to your room and you feel you are on a vacation! Great place.", "title": "Ritz Carlton Beijing", "helpfulness": 2, "user": "Attorney_8", "date": "June 21, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17092964, "likes": {"liked": "— the room and the service", "disliked": "— the location could have been closer to the city centre"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008", "text": "Thr Ritz Carlton Beijing at China Central Place is fantastic. Service was absolutely stellar. We live in Beijing and often go for weekends \"away\" in the city. This is now our favorite spot and highly recommend it for anyone who likes a luxury hotel with personalized service and a terrific location. Can't say enough great things about this Ritz.", "title": "The service, the rooms, the location - fantastic", "helpfulness": 3, "user": "TokyoBelle", "date": "June 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16762317}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "Excellent service as always. We met a housekeeping director (I asked some info from her before our stay) whom has prepared me with maps, helped me to book table for the famous beijing duck, all these totally exceeding our expectations, and which was something we should not expect from her dept, but she did it for us.", "title": "Ritz Carlton, always the Top notch service", "helpfulness": 3, "user": "dwcho", "date": "June 6, 2008", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 16719042, "likes": {"liked": "— The location, the service", "disliked": "— Small lobby area"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008", "text": "The breakfast was good, the environment was peaceful even though there were some group tours staying. The hotel situated in a modern area where new shopping malls were around, so there's no problem to have food outside the hotel and offer easy access to subway station, it will be even more so when the underground walkway is opened for quicker access.I n fact, its surrounding area reminded me of Ritz Carlton Tokyo where the environment was clean and with easy access to malls, subway. Although the hotel itself was of relatively small size, compared to Ritz at Tokyo.", "title": "paradise in busy Beijing", "user": "vanam1960", "date": "May 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16485141, "likes": {"liked": "— everything", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Overall, it was a great stay and we absolutely enjoyed the quality service that Ritz Carlton hotel has always maintained.", "title": "This is a fantastic Hotel", "helpfulness": 1, "user": "themonkeywoo", "date": "March 26, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 3.0}, "id": 14566395, "likes": {"liked": "— The quality", "disliked": "— The fact that Taxi drivers didn't know that it existed"}}, {"rating": 3.0, "title": "Jinging in Beijing", "text": "Spent Christmas in Beijing. The hotel from an interiors angle, was as you would expect from a 5 star hotel. Although a much more compact version, in terms of lobby and reception. Rooms were spacious enough with a nice sofa built in and plenty of storage space. Certainly enough room to swing a cat as they say. Bathroom were big too. Seperate shower and bath and toilet. All glass partitioned, so may be abit odd if both needs to use one or the other together. His and hers sink.", "user": "TopNotchHongKong", "date": "February 9, 2009", "id": 24395530}, {"rating": 5.0, "stay_parameters": "Stayed April 2008", "text": "In terms of service, the team were pleasant and efficient enough. Our bookings for tours were dealt with very well. General inquires were met. However, one thing that needs to be improved is the comprehension of English. Sometimes errors do occur because of that. But that only happens with a few of the team. Not all.", "title": "The Beijing Ritz- A great experience", "user": "L&JinVA", "date": "January 3, 2009", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 23214736, "likes": {"liked": "— Service and comfort", "disliked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "The breakfast spread was good, with some nice selection of western and asian. Though the asian food seems to come up lacking in one way or another. (I found that this pretty much applies to all hotels. Just something missing.....)", "title": "A great hotel for Beijing.", "user": "Achilles_F12", "date": "December 31, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 23140357, "likes": {"liked": "— Nice new and clean rooms. Comfortable beds. Big bath and shower. Attentive staff.", "disliked": "— I only had five days there!"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008", "text": "One thing which was quite odd was how the staff at the resturant started to clean the area exactly 10.30am on the dot, when people were still eating. They were making all sorts of noises, with plates clanging and cutlery banging and napkins just thrown around. I believe at one stage they even used a 'used' napkin to wipe the tables ! Not something to look forward to when tucking into your food. It really felt quite 'unprofessional', pulling down what is meant to be a 5 star hotel and again this area needs some more training. Actually alot more.", "title": "More than 5 stars hotel", "user": "pmp007", "date": "November 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22287025, "likes": {"liked": "— bathroom and bed", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Overall, a nice hotel but needs improvements. Would have got a 'Very Good', but because of the negatives, an 'Average' Close to the Metro and some expensive shops around the area.", "title": "Nice in Beijing", "user": "travelsny", "date": "November 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 21918097, "likes": {"liked": "— Service", "disliked": "— Ocassional hiccups with food"}}], "location": {"country": "China", "continent": "Asia"}, "stars": 5, "variance": {"poor": 4, "average": 22, "very good": 107, "terrible": 2, "excellent": 202}, "aka": "The Ritz-Carlton Hotel Beijing Huamao Beijing", "slim_ranking": 0.00573300573301, "description": "The Ritz-Carlton, Beijing is a 305-room luxury hotel, situated in Beijing's Central Business District. The Hotel is an integral part of China Central Place, a complex featuring business towers and an upscale shopping mall. The Hotel offers luxurious oversized rooms, a Spa and fitness centre, extensive meeting and conferencing space all surrounded by garden landscaping, a beautiful amenity in the central city. Dining options include an Italian restaurant, Cantonese all-day dining a lounge and two bars."}