{"user_rating": 4.0, "review_count": 107, "name": "The Old Inn & Waterfront Bunkhouse", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "We stayed at \"The Old Inn\" and used it as our base whilst visiting to do sailing. The rooms are excellent, the beds comfortable and have hot showers, not much else needed in my eyes. It is great value for money as the breakfast was also included price. Staff are all excellent and very friendly.We ate there every evening and the food was excellent and as someone else has mentioned the minted peas with the fish and chips is excellent. But the best meal for me was the slow cooked lamb, excellent. The seating area outside has views that you can never get bored of also.All in all a brilliant little place and will definately re visit sometime in the future. If you get the chance then the Talisker Distillery is also worth a visit.", "title": "Excellent place to visit", "user": "Chris C", "date": "June 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 131610521}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Haddock, chips and minted peas. Wonderful value and so well cooked. Best minted mushy peas I've ever eaten", "title": "lunch at The Old Inn", "user": "AnnieNewbury", "date": "June 6, 2012", "detail_rating": {"value": 5.0, "service": 4.0}, "id": 131430063}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "I recently stayed four nights at The Old Inn Bunkhouse and was really impressed with the facilities and location. The bedroom I had was good, the common areas, lounge and kitchen area were excellent. There is a lovely view from the communal balcony area. The pub was very good, with real ales and a nice menu. Staff were very welcoming and most helpful. On a cold or wet day there is a open fire in the main lounge area, although if they could move the pool table to a side room it would make it perfect. Very short walk to Talisker distillery. Really good stay, highly recommended. Thank you Doug.", "title": "Really great place", "helpfulness": 1, "user": "CB2111", "date": "May 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 129324085}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Once again we visited the Old Inn several times on our short break to Skye.", "title": "Great place to visit", "helpfulness": 1, "user": "Bilncrs", "date": "May 1, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 129170097}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Although there was a new manager, the place has lost none of it's charm. All the staff were very helpful.", "title": "A pleasant pub", "helpfulness": 1, "user": "HBunyan", "date": "April 30, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0}, "id": 129088032}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "The old inn is a favourite place to go for a spot of food for myself and friends, we've been back and forth a few times over the past month and loved it each time. My friend is vegetarian and enjoyed the veggie burger so much she had it twice, i had haddock chips and mushy peas, again so good it was had twice. Portion sizes were big, well worth the money and hospitality of staff was fantastic. Theres a seated patio are at the back which is perfect if your lucky enough to catch a sunny day. I sat there with another friend and enjoyed some squat lobsters for lunch with a beautiful view over loch Harport. Highly recommended.", "title": "Fun, beautiful place", "user": "Szawonski", "date": "April 18, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0}, "id": 128118406}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Six of us stopped for lunch on 5th April. Roaring fire and great food. One foodie had a prawn pasta dish which was fantastic. Burgers really good. Girl at bar was new, but eager to help. Rest of staff were really friendly and efficient.", "title": "Great traditional pub", "user": "Ralphy55", "date": "April 17, 2012", "detail_rating": {"value": 5.0, "service": 4.0}, "id": 128059937}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Stopped here for a late lunch and found a great little pub serving good food. I would never really order a burger, but after a good walk it attracted my attention! It was really good, good quality beef topped with black pudding, bacon, cheese, gerkins, onion rings, lettuce, tomato and relish. Best burger I've had in ages. Noticed that some of the recent reviews aren't great, maybe we were lucky, but I would go again.", "title": "Late lunch, Cracking Burger!!", "user": "HJ88", "date": "April 13, 2012", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 127812022}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "After driving for 45 minutes to get to The Old Inn, we were greeted with a sour glare from a lady and gentleman who were undertaking till training at peak time in the middle of the restaurant. Having been given menus at the bar, we were then told that actually it was only the food on the blackboard which was available to order. This food was much more expensive than that in the menu that you are given when you go in, and a lot more fancy than most walkers, and certainly children would be looking for after a day out on Skye. Asked for a pork steak without the peppercorn sauce, which eventually came out with the sauce on. Asked the waiter to change it and was told \"you are lucky as we are just cooking another one for another customer\" Presumably the other customer was given the port steak removed from us!! I'm not sure why a lot of pubs are now going for such poncy food. This is fine for one day on hour holiday, but mostly you want good old fashioned pub grub from an Inn with a bunkhouse, Who on earth wants to pay more for their dinner than their bunk room? Leave the posh grub to the Three Chimneys who know exactly how to treat their customers, and stick to being a pub. We live on Skye, but won't be rushing to return.", "title": "Unfriendly with limited food available.", "helpfulness": 6, "user": "IsleofSKyeMrsP", "date": "April 10, 2012", "detail_rating": {"value": 2.0, "service": 2.0}, "id": 127581257}, {"rating": 2.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "My wife and son and my brother and his wife made a special trip to dine here whilst staying at Ullinich, some twenty miles away, last Friday 30/3/2012, having read the mostly great reviews.. The scenery, as everywhere you look on Skye, is breathtaking and The Old Inn is very happily situated on the banks of the Loch Harport. It is more of a cosy Pub with small room with three or four tables for eating than a restaurant. The staff were very friendly and helpful but sadly that is the limit of the positive comments that we can make. Two of us chose to go with a starter of home made vegetable soup which looked like the usual blended, yesterday's vegetables and was bland and no better than you would get in any motorway service station.", "title": "Very Underwhelmed", "helpfulness": 9, "user": "gandool", "date": "April 4, 2012", "detail_rating": {"value": 2.0, "location": 5.0, "service": 2.0}, "id": 127235729}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "A night at the Old Inn in March was fantastic. We stopped there after a night in Portree for a trip to Talisker and a night in the bunkhouse. Full attention from a very helpful staff and a friendly atmosphere. The restaurant's newest chef is excellent, with the homemade crab cakes and fresh-caught Langoustine hitting top quality. The pub atmosphere was rustic, local and welcoming. The views are great from the outside seating, able to see both the Black and Red Cuillins. The bunkhouse was very nice, full kitchen available for self-catering and nice bunkbeds, fully furnished. Plenty of bathrooms. The shower temperature was inconsistent, but other than that the stay was close to perfect. The staff actively ensured that we were not only taken care of but also felt welcomed. It was a lovely time and I am waiting for a chance at a return visit. Thanks to Keith, Tammy, Therese, and the rest of the staff for a great time.", "title": "Just before Tourist Season", "helpfulness": 1, "user": "Scott F", "date": "March 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 126960007}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "I have known the Old Inn for many years and it is, essentially, a great place with character, a lovely setting, good food, good beers and good music. However, the quality of all of the above is becoming increasingly inconsistent with long waiting times to get food and breakfast served in summer, thai curries with lots of delicious veg one day and at other times barely a carrot, undercooked fish one time and another the most gorgeous fried mackerel you have ever tasted straight from Loch Harport.", "title": "Why not 5 stars every time?", "helpfulness": 3, "user": "Janso0", "date": "March 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 126360177}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Some of the staff are absolutely great though increasingly under pressure. One can't help feeling that the owners use the Inn as a gold mine rather than cherish it as the great place it is with lots of potential for providing outstanding Scottish hospitality. I am hoping ...", "title": "Homemade Lamb pasties", "user": "Barra10", "date": "March 17, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 126232095}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "After a windy 3 mile walk to visit Talisker distillary we popped to the Old Inn for a spot of lunch... The menu only had a few choices which all sounded delicious, we ordered two lamb pasties and when they arrived we were quite literally blown away by how delicious this meal was.. Everything about this little village pub was brilliant. The staff were friendly and attentive, the locals were also great fun the listen to and had we not been too full from the pasties I would have tucked into their sticky toffee pudding which sounded delightful! A great find and would recommend to anyone visiting the distillary... Rustic but delicious!!", "title": "No Beer????", "helpfulness": 1, "user": "northernroamer", "date": "November 26, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0}, "id": 121059413}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Visited mid November,and noted that the Inn was only open on Friday and Saturday due to the Winter downturn in business.", "title": "Great place, shame about the beer", "user": "skywalker_89", "date": "November 2, 2011", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 4.0}, "id": 120088134}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "If you would prefer to stay in the midst of Skye’s stunning country rather than a small town, then this is a good place to start. The Inn, which is in large part a walkers’ inn, is on the waterfront, looking out over Loch Harport. The rooms are simple (this is not a 4 star hotel) but adequate, and are clean and properly maintained. The bar is bustling in the evening with locals, walkers and other visitors, and serves well kept local ales. The food uses a lot of local fish and other produce and portions are generous. The quality is generally good, the seafood particularly so, but some dishes were a little weak. The service was helpful and friendly.", "title": "Great location; friendly inn.", "user": "wine_searcher", "date": "July 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 134286793}, {"rating": 1.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We stayed for 3 nights from 7 to 10 July 2012. We would definitely return.", "title": "Don't ruin your holiday by using this place", "user": "Osaurus", "date": "July 11, 2012", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 134116860}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "I first popped into this pub/restaurant on Saturday 7 July 2012. We just had hot drinks and cakes. Both times we had the misfortune to have to attempt to talk with the youngish chap who appeared to be in charge, we found him to be very aloof and extremely unfriendly.", "title": "Fresh excellent food, super staff and top service", "user": "WatchFox", "date": "July 2, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0}, "id": 133243813}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Today, Wednesday 12 July 2012, we decided to give the place the benefit of the doubt by getting our supper there. What a dreadful mistake. We waited 20 minutes to order. We waited another 20 minutes to be told that our starter was not available. We waited 45 minutes for our coffee to arrive. We had to ask for condiments.", "title": "great seafood", "user": "EZPOxford", "date": "June 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 132825891}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "On settling up this time, the woman behind the counter - probably the rude man's wife - was much worse than aloof and unfriendly; she asked us three times, if we were sure we never had the starter. Then she waved the till receipt in our faces, rolled her eyes away and said \"that right?\" And indeed, the £32 for two burger meals, two coffees and a cider probably was right.", "title": "Disappointing", "user": "brucemoose", "date": "June 9, 2012", "detail_rating": {"value": 3.0, "service": 2.0}, "id": 131630106}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 13, "average": 13, "very good": 42, "terrible": 4, "excellent": 35}, "aka": "The Old Hotel Carbost", "slim_ranking": 0.75}