{"user_rating": 4.0, "review_count": 365, "name": "The Margate Resort", "reviews": [{"rating": 1.0, "title": "Worst Hotel I ever stayed at!", "text": "We stayed at the Margate June 24th. We were awakened to our sink overflowing because the people on the second floor were taking a shower. No adjustment to our bill for our inconvenience. Staff not helpful or concerned. The Hotel was dirty and non smoking room smelled of smoke. Outdoor pool was out of order. Wish we knew of this site before we booked our room.", "helpfulness": 16, "user": "A TripAdvisor user", "date": "July 3, 2005", "id": 3632791}, {"rating": 2.0, "title": "they put on a good front", "text": "The hotel is highly over priced!!", "helpfulness": 10, "user": "A TripAdvisor user", "date": "March 9, 2005", "id": 3262739}, {"rating": 1.0, "title": "Overpriced and Poorly Staffed", "text": "Their lobby is deceiving. Yout think it's so beautiful but the rest of the hotel and it's views are nothing spectactular. I wouldn't spend the money to go back there.", "helpfulness": 26, "user": "DCPiacere", "date": "October 23, 2004", "id": 2780603}, {"rating": 1.0, "title": "Margate is a rip off !", "text": "We booked an August weekend in a 'Lakeview' room at The Margate after reading a description of the \"resort-like\" atmosphere on their website. However, what we found when we checked into this $269/night motel room was a toilet not bolted to the floor (subsequently fixed), broken tiles, rusty fixtures and broken (and dangerous) electrical outlets. Common areas were outdated and unclean. Five trips and three phone calls to the front desk produced responses from the desk staff that \"only the manager could address our complaints\" (oh yes, and one offer of a free breakfast). Despite verbal (phone messages) and written requests, the manager never contacted me during our stay and never appeared to be in the office at the times when the staff said she would be returned. The Margate has a nice beach and beach bar, but it is a poorly maintained, overpriced motel with very poorly trained staff. Given that combination, I wouldn't recommend staying at this 'resort' until it comes under new ownership and management.", "helpfulness": 23, "user": "funshine", "date": "October 9, 2004", "id": 2674268}, {"rating": 2.0, "title": "OVERRATED", "text": "We stayed at the margate on september 5th, we were going to the B.B king concert. We paid an outrages amount of money,around 300.00 for a lake view room. The room was small,out dated,and there was a small window with a jail like bar acrossed it, the bed was no where near the small window. We had asked the front desk if they would", "helpfulness": 43, "user": "A TripAdvisor user", "date": "September 12, 2004", "id": 2524765}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "My family stayed at the Margate on Columbus Day weekend. When we arrived, our room smelled like urine. When we called we were told someone would be right up. That didn't happen so we went looking for someone in housekeeping. A woman came in and told us it was outside that smelled. We think it was the cleaning solution they use. YUK. The day after we had to call to complain because as of 3:30pm our room had yet to be cleaned. Also, the beach was covered in geese droppings Responsiveness was very slow (and sometimes not at all). They should hire more maid staff!", "title": "Terrible service and Dirty", "helpfulness": 3, "user": "debcer5", "date": "October 10, 2006", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 2.0, "location": 3.0}, "id": 5935522, "likes": {"liked": "— Location", "disliked": "— Service"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "This looked like the nicest place in town..... boy was I wrong!", "title": "Not worth the money!", "helpfulness": 3, "user": "trektravel", "date": "August 3, 2006", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 5546506}, {"rating": 1.0, "stay_parameters": "Stayed July 2006", "text": "1. Called for directions, got hung up on.", "title": "Pretty Bad", "helpfulness": 9, "user": "BostonLegal", "date": "July 10, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 5448523}, {"rating": 1.0, "title": "Can't trust the Margate", "text": "2. Finally found the place on my own and the front desk staff was RUDE!", "helpfulness": 7, "user": "A TripAdvisor user", "date": "June 22, 2006", "id": 5373847}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "3. Beds were AWFUL", "title": "Liked it A lot!!", "helpfulness": 13, "user": "mchgh", "date": "September 4, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3842701}], "location": {"country": "United States"}, "variance": {"poor": 31, "average": 38, "very good": 106, "terrible": 43, "excellent": 147}, "aka": "The Margate Hotel Laconia", "slim_ranking": 0.384615384615, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Come to The Margate and enjoy all the amenities expected of a first class lakefront resort and conference facility less than two hours north of Boston. Whether taking a dip in our indoor and outdoor pools, sunning on our 400 foot private sandy beach, relaxing in our whirlpool-sauna, or dining at our Gazebo Beach Bar for lunch or dinner, you are sure to find all the comforts of home.Beautifully decorated and maintained guest rooms, onsite event and dining facilities, and a skilled staff dedicated to making your stay a wonderful experience make The Margate on Lake Winnipesaukee the place to vacation in the Lakes Region.At The Margate Resort, we've gotcha covered. With 15 different room types from which to select you are sure to find accommodations that best suit your needs. All guest rooms are fully equipped with Keurig® K-Cup Coffee Makers, Green Mountain® coffee, free wireless internet, irons & ironing boards, and hairdryers. Lake and West rooms also include double-sized stainless steel mini-fridges!Choose a room in our Lake building for spectacular views of the lake and unparalleled sunsets. For convenience during inclement weather, the Lake building is connected to the amenities building by underground tunnel!For a motel style experience, choose our West building. West Beach guests enjoy quick access to our sandy beach, just steps away from your door. Many West Inland rooms have backdoors leading to our West Lawn area!Our Inn building units are generally larger than the other buildings, offer the lowest rates, and being located right next to our outdoor pool makes the Inn a great choice by most families during the summer season."}