{"user_rating": 3.5, "review_count": 1164, "name": "The Square Copenhagen", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "This is one of the best hotels for the price. Rooms are smartly sized and arranged and the entire hotel is very clean. There is one major problem: The nightclub attached to the hotel will have you water glass shaking off the table until 5 AM. The supervisory staff was arrogant and dismissive on the matter. The breakfast is long in the tooth. Location is great but it is better left to the nightclubbers.", "title": "Outstanding for Monday through Friday Stays", "helpfulness": 1, "user": "MartyMidwest_USA", "date": "February 28, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 57341593}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "The Square is a pretty and very central hotel.", "title": "Nice hotel", "user": "AndreyNor", "date": "February 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56693815}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled solo", "text": "Good service, nice and friendly people working there.", "title": "Nice, clean, great location but be aware of noise", "user": "Anton9", "date": "February 7, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 55418157}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Nice bar, and it's even nice to sit outside the hotel having a drink in the evening.", "title": "A very good hotel", "user": "Bodleianus", "date": "February 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 55274460}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Very quiet hotel, beautiful rooms.", "title": "Perfect stay", "user": "Ian M", "date": "January 5, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 52683589}, {"rating": 2.0, "stay_parameters": "Stayed May 2006", "text": "We arrived at The Square midway thru our trip during the week. We parked our rental car in a garage underneath for their guests only. It was alot more than we expected. $35 a day!! But everyone rides bikes so I guess parking is very limited. The lobby was ok. All the hotels we stayed in had the entry key for the elevators which is a great safety feature. We were upgraded without asking to an Executive Room on the 6th Floor. Thank goodness for that. It was the smallest room we had. It did overlook the Square which I really liked. Noise was no problem unless the window was open. The beds were horrible. They were so thin and soft that when you got up you almost slid off the bed onto the floor. Gave us something to laugh about. The pillows were tiny and useless. The bathroom was nice with a full tub and lots of space. The rooms were spotless. The staff were ok but gave us the wrong directions and we walked about 1mile out of our way? Because of the beds I would definitely check out hotels nearby such as the Radisson as the location was perfect. We did the canal tour which was fabulous. Went to Trivoli Gardens which was included in our room price and I was glad as $15 admission each was alot to walk around an amusement park that really wasn't that impressive. We loved Rosie McGee's just around the corner for late night entertainment and the Hard Rock was just ok. There were lots of pubs and eateries in every direction. The Little Mermaid needs to be put in the water away from tourists climbing all over it. Couldn't even get a decent picture. And yes in Copenhagen everyone seems to smoke. And they allow it in all the bars and restaurants. Well if you are 15 you can buy alcohol! But we enjoyed the freedoms we no longer have at home tremedously. I loved Copenhagen but I didn't love The Square.", "title": "Loved Copenhagen Didn't Love The Square", "helpfulness": 4, "user": "wutsnext", "date": "June 17, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 5355858}, {"rating": 2.0, "stay_parameters": "Stayed June 2006, traveled on business", "text": "A colleague at work always stays at The Square and when I couldn't get a room at my usual hotel due to a convention I thought I would use the opportunity to try it out for myself.", "title": "a bit of a let down", "helpfulness": 5, "user": "Ade666", "date": "June 10, 2006", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 1.0}, "id": 5330166}, {"rating": 4.0, "title": "The Good, \"The Bad\" and The Smoking", "text": "In the brochure it says that most of their rooms have a view of the Town Hall Square - I would have to ask how. The hotel is rectangular with only one of the narrower sides facing the square - my room had a lovely panoramic view of the car park and a view into a kitchen - I tried to work out if it was Burger King or one of the other establishments on Vesterbrogade.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "June 7, 2006", "id": 5317222}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "The room was comfortable and generally clean. In the bathroom I was pleasantly surprised to see that there were bottles of shampoo etc - until I noticed that a couple of them had been half used. I know that the Danes are very eco friendly but even they draw the line at sharing shampoo.", "title": "The Square - A very Danish Hotel", "helpfulness": 2, "user": "OhioFranco", "date": "June 6, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 5315905}, {"rating": 2.0, "stay_parameters": "Stayed May 2006", "text": "My biggest bugbear was checking out - it was a Friday morning so the management had decided that only 2 receptionists were required. After all why should everyone want to go home at the end of the week. One of the receptionists was busy printing material for a convention attendee who reviewed each page and asked for most to be reprinted. The second receptionist then picked up the phone and started giving the caller directions to get to the hotel - from the complexity of the instructions and the length of time it took I assume that he was coming from New York and she was giving him full directions from his house to the hotel. In the meantime the queue had increased to about 20 people. To make matters worse there were staff milling around behind reception and in the office. The final straw was when the first receptionist finished printing out War and Peace and moved across to the bar to serve someone who had just walked up and said she wanted to buy cigarettes. When she eventually came back she served me but there was no hint of an apology or an explanation.", "title": "very disappointing", "helpfulness": 8, "user": "Cindy M", "date": "May 30, 2006", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "rooms": 1.0, "service": 1.0}, "id": 5233445}, {"rating": 4.0, "title": "Small rooms BUT great place to stay!!", "text": "The location is perfect, and the place is very clean. The breakfast was wonderful. The only negative is that the room and bathroom (no tub) are very small.", "helpfulness": 1, "user": "csulbxx", "date": "September 10, 2004", "id": 2521933}, {"rating": 5.0, "stay_parameters": "Stayed August 2004", "text": "Stayed 2 nights at The Square Hotel. We are very glad we did. Our family of 2 adults and 2 children reserved a mini suite that accomodated all of us quite adequately. The room had a queen bed and queen sleep sofa and a great bathroom, all done up in a very contemporary styling. Our room had large, but soundproofed, windows overlooking the city hall square (the rendezvous point for all tourists to Copenhagen). The rate included the European style buffet breakfast of cold meats, cheeses, breads, pastries, fruit, cereals, coffee and juices (but don't expect a hot American-style breakfast here).", "title": "When in Copenhagen, Stay Here!", "helpfulness": 4, "user": "JasminedogLosAngeles", "date": "August 30, 2004", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 2503157}, {"rating": 4.0, "title": "location, location, location", "text": "It was a bit pricey, but the central location in front of the city hall square, the main pedestrian shopping street and Tivoli, cleanliness of the hotel, the helpfulness of the staff and the breakfast made it all worth the price. For the price, I cannot think of a better located hotel and beats out the SAS Radisson hotels in my opinion. Highly recommended for families with children. Stay here.", "helpfulness": 2, "user": "vaca7423", "date": "August 30, 2004", "id": 2503151}, {"rating": 5.0, "title": "Fantastic stay at The Square", "text": "You can't pick a better location if you try, thats the best part. We stayed here pre cruise and found for the price it's great! Rooms a tad cramped as usual with european hotels. Only complaint is the staff, which seemed usually too busy doing nothing to assist us. I would recommend it based on its location. We did stay post cruise at the Marriott, that was 5 star!", "helpfulness": 5, "user": "A TripAdvisor user", "date": "August 8, 2004", "id": 2429490}, {"rating": 5.0, "title": "Great Hotel, Great Location", "text": "Having just returned from The Square I can definitely say that I would love to return!", "helpfulness": 2, "user": "cmelt", "date": "August 4, 2004", "id": 2381790}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "Non-smokers beware. The fourth floor is the smoking floor; our room on the fifth floor received so much second-hand smoke through the ventilation system that it not only made it tough to sleep but caused lung & eye irritation. Staff came to the room after my second complaint, agreed it was \"a little smoky\" and said the only solution is to turn off the heating vent. We opened the window which helped a little, but temps were below freezing and the hotel is on a major intersection so street noise was excessive. I asked about another room but they were fully booked. Either all the rooms on the 5th floor are like this, or room 542 has a serious HVAC problem.", "title": "Not for non-smokers.", "helpfulness": 1, "user": "Chip004", "date": "January 3, 2010", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 52438201}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We stayed for a weekend break in Copenhagen. We had a lovely trip and thought the hotel was in a great location- only a 5 minute walk from central station. We stayed on a room only basis so I am unable to comment on the breakfast. The hotel is a good place to stay if you are out and about sight seeing for most of the day.", "title": "Copenhagen 2009", "user": "EmmaLouB", "date": "December 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 51740682}, {"rating": 3.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "We found Copenhagen to be very expensive- however it was a special birthday treat so worth the expense but not sure if we could afford anymore than 2 nights!!", "title": "best location with satisfied stuff", "user": "kermci", "date": "December 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 51328354}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled solo", "text": "I would recommend the hotel to others who are looking for a good base and a good nights sleep in a decent room.", "title": "Superb location, small-ish but functional rooms, problems with price.", "user": "srd6", "date": "December 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 50814195}, {"rating": 4.0, "title": "The Square, Copenhagen", "text": "if you'll stay there, the only advantage you'll have - location. but it is already not bad. the style of the hotel is not that bad as well, but during check-in I had to face the rudeness of the personal, the rooms were booked by the company, invited us becouse of business, but the stuff asked the number of my visa, for garauntee. after I refused to give it - I just did't have it - they became very angry, and I felt like I was suspected very much.", "user": "EdC8", "date": "December 6, 2009", "id": 50747522}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We stayed at The Square for 2 nights, sight-seeing in Copenhagen. I booked the room directly with the hotel, on a late deal rate. It was an excellent location, being close to the rail station (5 minutes walk, even wheeling a suitcase) and Tivoli Gardens (just around the corner). The Stroget (main shopping street) starts just across the city hall square that the hotel overlooks. We requested a high room at the back of the hotel, so although we had no view, it was very quiet - even with a rock concert going on in the city hall square one night! The rooms weren't huge, but bigger than expected for a city centre hotel, with plenty of hanging space. We had breakfast included in our package, which was the usual continental buffet - no complaints (cake for breakfast is always a treat!!). The staff on the front desk were always polite and helpful (lending me an adapter plug, when mine turned out not to fit). There was internet access in the foyer/bar available to all (there was always a couple of people waiting to use it). Finally, when I returned home I found I had been overcharged on the room rate. I sent an email to the hotel pointing this out and they quickly refunded the difference, with no fuss. I'd recommend this hotel with no hesitation.", "title": "A great weekend break location", "helpfulness": 1, "user": "SeeEverythingOnce", "date": "September 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39470760}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "Small room but clean. Great view of the central square. Couple blocks from the train station so easy access from the airport. Only spent one night, in transit. If I was spending few days in Copenhagen, might have looked for a \"cozier\" place but for one night, meeting up with friends, was totally convenient.", "title": "Central location", "user": "vagabond2004", "date": "August 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 39290478}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "A five minute walk to Copenhagen Central Station. Within walking distance to most sites and restaurants/shopping are very close on Stroget street. HIghly recommend this hotel for it's location and convenience. Breakfast wasn't included during my stay, but I tried it once. 110 DKK for a cold buffet. I was expecting a hot buffet.", "title": "Great Location", "user": "Kyle H", "date": "August 30, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 39237605}, {"rating": 2.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "The location is as central as can be, which is very convenient, but we soon tired of the panpipe music being played constantly by the pretend-indian buskers on the main square right outside. Even with windows closed we couldn't escape the pipes.", "title": "Noisy location, house-keeping understaffed but nice interior design", "user": "CPHDot", "date": "August 27, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 2.0, "service": 2.0, "rooms": 3.0}, "id": 38932921}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The room had a cool design and bathroom too was modern. The poor house-keeping girls could do with some extra help though! Having been out all day we were surprised to find our room still not cleaned by 4pm ... so mentioned this at reception ... who then sent house keeping by. They apologized for not having had the time yet, but they had been sent to another floor - clearly under-staffed.", "title": "Exceptionally comfortable", "user": "Seichele", "date": "August 19, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 38185497}, {"rating": 1.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Hotel is nice and a good location, but be careful of added costs. The hotel includes breakfast if you book directly. If using a discounter, the hotel will slap you with an additional bill for breakfast. when checking out. We booked and pre-paid for a two night stay in August through a discounter. When we checked out we were presented with a $82.14 bill for breakfasts. We were not told about this in advance by the discounter or the hotel. By booking through a discounter, we spent $67.19 more than if we had booked directly with the hotel. As for as we know this is the only hotel in Europe that does this.", "title": "Be careful of hidden costs.", "user": "AMAlexander47", "date": "September 10, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 40512704}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled solo", "text": "Great location, across from Radhuspladsen (Town Hall Square), but service was uneven. Front desk responded to my request to change my room several hours after I arrived due to the overwhelming stale-smoke smell, but they tried to blame me for not liking the first room. I wasn't too keen on that attitude. Also, the housecleaning staff took an early holiday one day, leaving before afternoon and depositing a bag outside the door with towels and toiletries. If the room isn't going to be made up every day, I don't have a problem, but that seemed to be the height of laziness or strangeness. Overall, both episodes led to a negative impression of service at this hotel. The public spaces are lovely. Sometimes, design came before function in the rooms. This hotel seemed to favor neither shelves nor drawers. A tip: skip the seriously-overpriced and underwhelming breakfast. The only draw to the breakfast is the aesthetic of the breakfast room on the 6th floor. There are cafes nearby with much better breakfast food at much better prices. Still, if you favor location, this is a good spot. A block from Tivoli, across the street from the [towering and awesome] Town Hall and Stroget, Copenhagen's lovely equivalent to London's Oxford Street. You can walk just about everywhere from The Square, and the train station is 400 meters away. I won't stay there a second time - there are too many other hotels in Copenhagen, big and small, local and international, to make this one a great draw - but there are good points to it.", "title": "Location is great but service needs some work", "user": "samantha787", "date": "September 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 4.0}, "id": 40469374}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Neat and smart, but small room...but then there's the view...of a brick wall! (Almost a joke!) The mattress was foam (or something other than mattress). Staff was helpful and efficient. The lobby was attractive with sufficient light and seating. The location was fabulous - very near City Hall and Tivoli Gardens, at the beginning of the self-guided walking tour in Lonely Planet. (I have no idea about the value of the hotel. It seemed expensive, but everything in Copenhagen is expensive...or maybe it's just the US dollar that has lost so much value compared to other currencies....) We had to leave too early for the full breakfast, but the croissants were all that you expect from Danish pastry.", "title": "Small room in a great location", "user": "lsmkw", "date": "September 5, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 39805551}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The Square hotel is in an ideal location. It is located right by the Stroget, Vesterbrogade and Hans Christian Andeson Boulevard (which has attractions)", "title": "Would go back", "user": "TravellingGal83", "date": "September 3, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 39705199}, {"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The hotel is a comfortable and enjoyable to stay in. The rooms are compact but have everything you need, double bed, plasma screen, separate bathroom with shower.", "title": "Dissapointed that all our requests were ignored. Noisy but good location", "user": "The_Super_E", "date": "September 3, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 39669975}, {"rating": 4.0, "title": "Fresh hotel, centrally located that overs value for money.", "text": "Visited this excellently positioned hotel for 3 nights. The property has obviously undergone extensive renovation in recent times. The staff were all very helpful, the furnishings contempary and the lobby light, airy and quite chic.", "helpfulness": 3, "user": "campbell2006", "date": "July 31, 2006", "id": 5533760}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled solo", "text": "As one expects from European hotels, the rooms are small and while the furnshings are slick, they lack a certain practicality. For example, trendy glass shower screen couldn't keep the rest of the bathroom dry for all the tea in China.", "title": "A fair hotel for a fair price", "helpfulness": 1, "user": "Al1970", "date": "July 30, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 5528085, "likes": {"liked": "— Location", "disliked": "— The untruth about the air-con"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "We had a front room which overlooked the bustling city square. Must say next time I'd opt for a room without a view as the one we had copped a bit of street noise.", "title": "Great location- The Square", "helpfulness": 4, "user": "richie453", "date": "July 30, 2006", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 5527787, "likes": {"liked": "— location", "disliked": "— room not cool enough"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "The Scandanavian breakfast, inluded in the rate, in served on the 6th floor and has a nice outlook over the rooftops of Copenhagen. Quality and range of choice for breakfast was the best we experienced on our Scandanavian tour.", "title": "Would stay again, but not during hot weather", "helpfulness": 1, "user": "Milford46", "date": "July 30, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 5527701, "likes": {"liked": "— Location", "disliked": "— infrastructure"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "As with most Scandanavian hotels the air conditioning is non existent which may be an issue for some visiting in Summer.", "title": "Go for 'Superior Room'", "helpfulness": 6, "user": "dd01a", "date": "July 26, 2006", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5511850, "likes": {"liked": "— Location", "disliked": "— Filthy carpet"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "Our selection of the Square Hotel, enhanced our experience in Copenhagen. It put us pretty much in the center of everything and made planning our days much easier. It’s across the street from the City Hall and from Tivoli gardens. Can’t get much more central than that.", "title": "Well located Square Hotel", "user": "FloridaTravelmum", "date": "September 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 43588892}, {"rating": 2.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We also liked the hotel itself and I’d recommend it highly. It’s pretty much a modern business hotel. Though some Trip Advisor reviews complain of small rooms, we didn’t find our standard room unbearably small and it was well laid out with a bed, loveseat and desk. The bathroom was nicely appointed in that modern sort of way so many hotels use.", "title": "The Good and the Bad", "user": "baileyfirestone", "date": "September 20, 2009", "detail_rating": {"cleanliness": 2.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 43131954}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled solo", "text": "Depending upon how you book, you may or may not have breakfast included with your room rate. As with everything in the Scandinavian countries it’s pricey but it’s a really good, plentiful buffet in a beautiful, open, airy top floor room with great views over the city which makes for a great start to the day.", "title": "Great location for first time", "user": "Ingmar53", "date": "September 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 41093800}, {"rating": 5.0, "stay_parameters": "Stayed September 2009", "text": "We had the opportunity to spend a night at the Square Hotel at each end of a Baltic cruise. We'd stayed there shortly after it had opened 5 years ago and were very pleased with the location, amenities and the modern design. We didn't even consider other hotels when we visited Copenhagen this time.", "title": "Good Choice", "user": "InMyOpinion09", "date": "September 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 40671128}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Well, the location is still wonderful. (Its overlooks the Danish equivalent of Times Square, is around the corner from Tivoli and across the square from the Stroget.) However, it is showing signs of wear; the walls were nicked up, upholstery was snagged and worst of all, they have a mold problem in their bathrooms. When we complained, they immediately acknowledged the mold problem they are experiencing and moved us to a room with less mold. If we hadn't been leaving the next day, we might have re-located to another hotel.", "title": "Not impressed.", "helpfulness": 1, "user": "da Nut", "date": "September 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 1.0, "service": 2.0, "rooms": 3.0}, "id": 40592921}, {"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "First, the hotel ignored my request for an upgrade (perhaps understandable, as it seemed full) and a high-floor room (not understandable). Avoid low floor rooms on the inside - the pattering of rain on the rooftop next door will keep you up all night.", "title": "Super location, nice design, terrible housekeeping and customer service", "user": "Flight1NewYork", "date": "August 15, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 2.0}, "id": 37776142}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Second, the bathroom was dirty (grime in the sink), and there were items from the previous guest left/found in the room when we arrived.", "title": "Great Location", "user": "SchuberMick", "date": "August 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 37743816}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Third, the housekeeping staff is a disaster. On the second day, we spent the lunch-break (12-2) at the hotel (child took a nap), which apparently hindered the housekeeping. Instead of cleaning the room, they left plastic bags with towels in front of the door. They told us that housekeeping left at 2pm, and we basically missed our chance.", "title": "Everything is square!", "user": "MollerupPaaTur", "date": "August 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 37462758}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We left the sign \"please make up the room\" hanging for the next 24 hours, and submitted a customer-service card to the manager. To no avail, because on the next (third) day, our room was again not cleaned when we stopped in to the hotel at 3pm. We called the front-desk who apologized and sent the cleaning crew (who apparently did work past 2pm).", "title": "Great Location", "helpfulness": 1, "user": "SchuberMick", "date": "August 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 37457992}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "This repeated on the fourth day. A bucket from room-service remained in the room for 2 days... in front of the room for a whole day. All in all, not what I expect for 200+ EUR per night.", "title": "Coffee and Danish right next door", "user": "gfarmer668", "date": "August 11, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37383887}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "I stayed here with some friends in March and would stay there again. Many of the reviews here said it was a noisy hotel but our room was nice and quiet. It was small but for one night it didn't really matter.", "title": "A good value hotel in an expensive city", "helpfulness": 1, "user": "Snowwhite29", "date": "April 7, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 60647267}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "The location is excellent and worth the extra money compared to where some of the cheaper options are located.", "title": "Fantastic Place to Stay", "helpfulness": 1, "user": "Jaduong", "date": "April 2, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 60178464}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "Breakfast was great and they also offer bike hire, but if you are a big group then you may need to book ahead as we couldn't get enough bikes for 6 of us.", "title": "great location", "helpfulness": 2, "user": "Dublin2010Dublin", "date": "March 31, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 60039313}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "The only problem we had was with the lift which took a few goes to get going.", "title": "Great location but a bit noisy!", "helpfulness": 2, "user": "Beckster999", "date": "March 23, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 59315971}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Copenhagen is a fantastic city in itself and finding a nice central place to stay will really enrich ones experience of the city.", "title": "Nice but very noisy", "helpfulness": 2, "user": "WienBadger", "date": "March 5, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 57771622}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Quite centrally located, but staff at reception is \"customer hostile\".", "title": "Below average - Customer hostile at reception", "helpfulness": 1, "user": "tempmay", "date": "August 23, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 4.0, "value": 2.0, "service": 1.0}, "id": 117151765}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "Our first room was at the 2nd floor, and the big outside ventilators in the courtyard made an unbearable low frequence noise.", "title": "Great location for a city trip to Copenhagen", "user": "Anja_S_DE", "date": "August 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 117086471}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "Impossible to sleep, se we had to request a room change at 2am.The reception manager \"Helen\" was quite aggressive and uncourteous. It seemed that she was happy to have stand us at the desk in the middle of the night.", "title": "Great Location, AC not working", "user": "mia28", "date": "August 22, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 2.0, "value": 2.0, "service": 2.0}, "id": 117065129}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The other room we got was not as clean ; old carpet and full of dust in the adiators.", "title": "Location, location, location", "user": "montrealer77", "date": "August 21, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 117047343}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Location of this hotel is great: at the main square, just opposite of the town hall, near main station, Tivoli and main shopping streets. All the main touristic attractions are also nearby.", "title": "Completely Satisfied", "helpfulness": 2, "user": "C1andG2", "date": "August 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 116990720}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Considering its location it should come as no surprise that the noise level is somewhat high during the night, but as long as the windows stay shut it's bearable. Other reviews on Tripadvisor complain about beds being soft, but we did not find this to be a problem. BUT! We booked a couples retreat package, and to be designated to separate beds that slide apart is not very romantic.. Breakfast was very good, and location perfect! Staff were friendly and helpfull.", "title": "Ein bisschen laut, aber schön", "user": "Sykkelthor", "date": "August 20, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 116984113}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "With a location that could not be more in the city centre then it is, the location is absolutely the best.", "title": "Great stay at a hotel with the best loction", "user": "Stenbeck", "date": "August 20, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 116972261}, {"rating": 4.0, "title": "Safe Option", "text": "The lobby have wireless internet, but the rooms are still only on wired internet, although really long cables are available to lend in the reception. The beds are a bit soft, but I gues that is a matter of taste.", "user": "avelautham", "date": "August 17, 2011", "id": 116839289}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "They have a really nice breakfast and overall really friendly and helpful staff.", "title": "Excellent Location, Great Service", "user": "LADWhitePlains", "date": "August 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116777778}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "Copenhagen is an expensive city, you can drop a wad of cash just going out in the evening for a meal. I was very happy to have found this hotel, it is European 4*, it is clean and very reasonable in price.", "title": "Convenient location for restaurants, shopping", "user": "TcarlGren", "date": "August 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 116773675}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "Stayed at the Square for two nights, last month.", "title": "What to Expect", "helpfulness": 11, "user": "DarrenHenman", "date": "July 5, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3638430}, {"rating": 4.0, "title": "Trendy & centrally located", "text": "Following generally positive but some poor reports on here, we booked based on this sites advice.", "user": "A TripAdvisor user", "date": "June 28, 2005", "id": 3617071}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "I now know why it generally gets a majority of good marks but the occassional poor mark.", "title": "Excellent location", "helpfulness": 10, "user": "bpcs", "date": "June 14, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3551199}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "The Positives :-", "title": "great location", "helpfulness": 8, "user": "CherylUK", "date": "June 14, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3550378}, {"rating": 5.0, "title": "Great Location", "text": "- It Cool & Stylish", "helpfulness": 7, "user": "A TripAdvisor user", "date": "June 13, 2005", "id": 3548182}, {"rating": 3.0, "stay_parameters": "Stayed July 2006", "text": "I was at this hotel from the 5th to the 7th July. Having already booked in, I then read some of the comments on Tripadvisor about staff, spongy beds and started to worry a bit. I needn't have - this is a perfectly acceptable 3 star hotel in a very busy, central location.", "title": "Good hotel for a short break", "user": "Philw137", "date": "July 17, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 5475341}, {"rating": 3.0, "stay_parameters": "Stayed July 2006", "text": "Our room seemed to look out on a carpark, which actually meant it was quieter than looking out on the main square, so no worries there. Beds were comfy, breakfasts good but busy, and I found the staff on reception very attentive. Good little hotel, but I might go for a slightly less busy location next time.", "title": "Ok but nothing special!", "helpfulness": 2, "user": "Crazycat", "date": "July 17, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 5475307}, {"rating": 3.0, "title": "Disappointing", "text": "Location of the hotel is excellent for all the main tourist attractions - within walking distance.", "helpfulness": 1, "user": "Canberra_Traveller", "date": "July 14, 2006", "id": 5466966}, {"rating": 5.0, "title": "Wonderful stay at The Square Hotel", "text": "Hotel itself was ok - rooms have seen better days - in our room one of the lights in the headboard was broken, back ambient lighting also broken, toilet seat broken, shower that flooded the bathroom! Rooms are on the small side, but ok for a short stay.", "helpfulness": 3, "user": "2468", "date": "July 12, 2006", "id": 5460696}, {"rating": 3.0, "stay_parameters": "Stayed June 2006", "text": "The room looked nice/modern but it wasn't practical - no clear lighting which made it really hard to read / unpack cases if you're arriving at night - no lights in the hallway area of the room where the luggage rack is located. No in-room safe, ironing board or iron. The bathroom shower only stopped flooding the room when you pointed in to one of the corners and squashed yourself in! If you moved the shower head anywhere else it went straight under the shower door and into the bathroom.", "title": "Doublebed?? Your'e joking....", "helpfulness": 2, "user": "Corvette8", "date": "June 19, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 5362643}, {"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled solo", "text": "Stayed two nights at the begining of June.", "title": "Just fine for a short stay", "helpfulness": 4, "user": "CAStein", "date": "July 23, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 5499417, "likes": {"liked": "— Desk staff", "disliked": "— Room"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Room was small but functional, the bathroom clean. The modern decor was beginning to look a bit worn.", "title": "Great location", "helpfulness": 7, "user": "Birmingham,England", "date": "July 21, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 5492670}, {"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled on business", "text": "The lobby is very large and serves as a place to get a drink or coffee as well. Staff were unfaillingly friendly and for the most part helpful.", "title": "Small rooms, sleak, efficient", "helpfulness": 5, "user": "rightofcenter", "date": "July 19, 2006", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 4.0, "rooms": 4.0}, "id": 5487455}, {"rating": 3.0, "title": "OK", "text": "Stayed at the Square Hotel Copenhagen in Denmark on April 25 for 3 nights. Planned to book rooms at the Imperial hotel unfortunately the Imperial was fully booked during the period. Location was good as it's in the city centre (town hall square) and very closed to Stroget and Tivoli garden. We're not surprised to find out that the rooms, bathrooms were small as we have read some reviews from other TripAdvisor members. The rooms were ok and clean enough, wooden parquette floor was a plus. However, we think that the beds' size were so narrow (perhaps won't be comfy enough for big bones body). We regret the front desk staff were not courteous enough, especially the younger staff. They tended to ignore guests and busy talking between themselves eventhough they knew some guests were waiting and needed their assistance (and standing in front of them!). Hotel design is sleek, modern and considered new compared to other hotels in the city.", "user": "biscotti", "date": "June 12, 2005", "id": 3544743}, {"rating": 5.0, "title": "Amazing hotel - great for small children", "text": "We just returned from staying at the Square for four nights. Everything was amazing. Spacious rooms, comfortable beds, a spectacular breakfast. The staff were extremely helpful - the 24 hour bar in the lobby always gladly provided warm milk for the baby. The staff made several restaurant recommendations and even reservations for us, and they were suberb - exactly what we had requested. Our children are 1 and 3 and the junior suite was perfect, a pull out couch for the 3 yr old and a crib for the 1 yr old. The location also cannot be beat for any exploration of this wonderful city as it is across from the town square and the main historical district.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "June 7, 2005", "id": 3536197}, {"rating": 3.0, "title": "Style over substance", "text": "There's cow patterned sofas, back lighted-glass room numbers and wooden handled umbrellas. The hotel is made up to be ultra modern and ultra-chic and while all the window dressing is there it still seems like a decent, workman like 2/3 star hotel.", "helpfulness": 2, "user": "DKB", "date": "June 6, 2005", "id": 3534411}, {"rating": 4.0, "stay_parameters": "Stayed June 2005, traveled on business", "text": "The central location is great, close to the Tivoli, shopping streets and central train station which gets you to the airport in 12-13 minutes. The buffet breakfast was also one of the best I've had in recent memory. One last plus is the heated floor in the bathroom.", "title": "Sleek Danish", "helpfulness": 1, "user": "UKnative", "date": "June 5, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 3530335}, {"rating": 1.0, "title": "Shoe box rooms; 80 cm beds, unfriendly staff", "text": "While it does have those positives, it seemed overpriced for the lumpy single (push them together for a double bed) beds and there didn't seem to be much sound proofing, either outside walls or inside walls. There was also a touch of mould in the bathtub which just shouldn't be in a 3 star hotel, let alone a hostel.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "May 20, 2005", "id": 3488968}, {"rating": 3.0, "stay_parameters": "Stayed May 2005", "text": "After all recommendations at this site I was convinced having found the ideal hotel for Copenhagen. I booked via travelocity for 1000 dkr/night a superiour double room for 3 nights.", "title": "Unimpressed", "helpfulness": 3, "user": "Zurich", "date": "May 19, 2005", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3486425}, {"rating": 5.0, "title": "Beautiful", "text": "The hotel IS located at the town hall square, but only a minor part of rooms face it. The majority shows to a side street, some show to the back yard. The view towards the square is great, but the traffic tremendous and annoying.", "helpfulness": 6, "user": "MarcosSix", "date": "May 15, 2005", "id": 3473432}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "The first room showed to us on 6th floor was incredibly small, had no terrace (as the other have on 6th floor) and a far too small bed. The second room was bigger, but still on the small side. I was reassured that this was a superiour room (there are standard, superiour and executive rooms) and even was promised the other day to be moved into an executive room on 3rd floor. By the way, the bottle of champagne being included in the superiour room comes as half a bottle (for two).", "title": "Nice through and through", "helpfulness": 5, "user": "deliberate_tourist", "date": "May 6, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3442046}, {"rating": 5.0, "title": "A wonderful experience", "text": "When having moved, the room proved being of the same size, only differently shaped, and it was much brighter. The windows were not sufficiently sound proof and the aircondition did not cool down, not a good combination for getting some fresh air and a restful sleep. The bathroom size was good (and compared to the room size next to oversized, smile).", "helpfulness": 8, "user": "A TripAdvisor user", "date": "May 1, 2005", "id": 3430250}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "The interiour looks stylish but already shows signs of attrition. More annoying was that both rooms we had were not well cleaned, dusty and had stains. Were the beds comfortable? Well, they are soft and when you move during your sleep, the mattress will move, too.", "title": "More than a 3 star experience by comparison", "helpfulness": 12, "user": "Willlondon", "date": "March 28, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3306581}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "Great location in a beautiful city! The only thing negativ is that when we order the room at the hotels web pages you don't get included brekfast, and that will cost another 150 DK (I think) each day.", "title": "We'll be back!", "user": "tnn86", "date": "September 5, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 117689517}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We stayed here four nights. After our experience with The Strand, we approached this reservation with some trepidation. The hotels are part of the same management group. Our experience here could not have been more different. We arrived at the hotel about the same time as many others, probably all having disembarked from cruise ships that morning. Although it was well before checkout time, the staff handled the situation well. They set up a temporary luggage hold area (at no charge) in the lobby with someone responsible for monitoring it. We were registered and told to check back about 2 pm when we could then pick up our keys. The staff was friendly, courteous, and very helpful even though “swamped.” As others have noted, the hotel is in at the center of “downtown” attractions. You can walk down the Stroget to Nyhaven in 15 - 20 minutes. The hotel interior is minimalist contemporary – clean lines, glass, and black. The rooms are small by American standards, but clean and comfortable. Our package included breakfast. The buffet had a good assortment of items, but if breakfast had not been included, we would not have paid the extra charge for it. Since we took two extensive day trips, we appreciated its closeness to the train station. For the most part, we spend very little time in hotels except to sleep. For the price, for the time, the hotel provided what we needed.", "title": "Excellent Location, good service", "user": "redneckersson5", "date": "September 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 117615687}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Location was great - just opposite Tivoli Gardens. Rooms were modern and sleek. Dissapointed with the breakfast as it had no hot options and you had to pay for coffee!", "title": "Great location, nice rooms", "user": "MS_1410", "date": "August 30, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 2.0}, "id": 117466565}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "There was also no internet available in rooms, although available in the lobby.", "title": "Very good option in Copenhagen", "helpfulness": 6, "user": "brzlian1", "date": "August 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117458034}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "We were moved to another hotel on the first night of a three night stay to an alternate hotel due to water damage and unfortunately, the sister hotel we were moved to (Phoenix) was nowhere near the quality of the room we booked for the Square. So that was dissapointing.", "title": "Good Location, Clean, Everything You Need", "helpfulness": 2, "user": "lauragp", "date": "August 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 3.0}, "id": 117194498}, {"rating": 4.0, "stay_parameters": "Stayed May 2006, traveled solo", "text": "I stayed at the Square four nights in May 2006 on my first trip to Copenhagen. I was at first disappointed by the location as the Radhus Square is a big cement area with little charm, lots of garrish billboards and noise. However, the location is very central and the hotel itself was very cool, with nice decor and sleek design. My small single room was cute but a little worse for wear seeing how new the hotel is. I loved that I could open my window for fresh air, and the bathroom was fantastic. The breakfast spread on the top floor was dynamite. The staff was extremely friendly and the bike I rented was great. I would probably stay here again unless I could find another similarly stylish hotel, at a good rate, but in an area with more ambience.", "title": "Good stay overall", "helpfulness": 2, "user": "tvlbug", "date": "September 1, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 5731874}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We stayed in The Square for 2 nights in August 2006. Aside from price our next requiste was location, and the The Square was perfect to explore the main attractions of Copenhagen. Their special on-line price also included 2 tickets for Tivoli, which we might not have done otherwise (and really enjoyed the many hours we ended up spending there). The staff was polite, the breakfast buffet just fine but basically a good choice for this price range. Some negative points: the shelves in the lobby \"apple display cube\" were filthy and the elevator didn't seem like it could be trusted, and - more importantly, faux wengé furniture and Hans grohe faucets aside, I couldn't get over the large human hairball in the shower (which knocks it to a 2 star rating, and not 3). The beds were comfortable and in the end a good sleep was had.", "title": "Good choice for location", "helpfulness": 3, "user": "amelia_101", "date": "August 29, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 5722132}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Maybe one of the few Copenhagen hotels with a/c which was needed in August. If you are looking for a mid-range priced hotel close to the major sites, The Square works well enough.", "title": "a solid hotel", "helpfulness": 5, "user": "sak01", "date": "August 20, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5629655, "likes": {"liked": "— clean and comfortable hotel", "disliked": "— not overly luxurious"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "OK..here is the real scoop! The hotel is fine! It is in a good location...right next to Tivoli and close to the pedestrian street(stogert). It's entrance is right on Town Square on a busy street...but the front entrance is not that dirty!!(I checked!)", "title": "Very convenient location, nice hotel", "user": "glaible", "date": "August 18, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5623514, "likes": {"liked": "— close to Tivoli", "disliked": "— warm during hot summer months"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "The front desk was friendly and the room quite comfortable....beds are nice and the bathroom is very nice! A buffet breakfast comes with the room...prettty good!!", "title": "Not a good hotel", "helpfulness": 1, "user": "BarbaraBec", "date": "August 18, 2006", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 5622469, "likes": {"liked": "— nothing", "disliked": "— everything"}}, {"rating": 5.0, "title": "Loved The Square", "text": "Was in the Square in July/Aug 2004. Great hotel with a great view of Radhudpladsen (the town square). Tivoli is next door, as is the pickup point for several tours around this lovely city (and country).", "helpfulness": 1, "user": "A TripAdvisor user", "date": "August 3, 2004", "id": 2378581}, {"rating": 5.0, "title": "Great hotel, good location", "text": "Hotel staff very helpful and courteous. Loaned me an AC converter at no charge. Helped me arrange tours around the city (and country).", "helpfulness": 1, "user": "rmartin1", "date": "July 22, 2004", "id": 2314488}, {"rating": 5.0, "title": "STAY HERE !!!!!!!!!!", "text": "My room was a bit small, but it had everything one would need and then some. The cards on elevators were a nice security feature; however, the open access to stairs defeated the purpose somewhat.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 17, 2004", "id": 2304213}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Nice hotel. Convenience to train station makes for easy travel; near the pedestrian areas and old town. Understaffed front desk meant long wait times, but always received good assistance. Sixth floor room got stiflingly hot during the day, but door to roof balcony cooled it off at night; could be terrible in summer. Good sized room with small bed. Excellent breakfast. Lots of street noise; I'd recommend a room on the back.", "title": "Copenhagen Square.", "user": "Twoprofs", "date": "May 25, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 65304028}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We booked an Executive Double Room with a view of the square.", "title": "great location, small room", "user": "Chutney101", "date": "May 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 63759966}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "But when we got there, there was no view (they could not garantee that) and the room was very small. The bed was a small Queensize. (1,40 meters wide)", "title": "excellent location", "user": "gkogko78", "date": "May 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 63466531}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "The bed was horrible. Much too soft and when 1 person moved the other one had no choice.", "title": "Spacious room with fab bathroom", "user": "Puslespil", "date": "April 26, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 62516511}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "The room was too warm, even when I turned off the heat and opened a window.", "title": "Great Location", "helpfulness": 1, "user": "Sundeep-travelbug", "date": "April 15, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 61385343}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "This was an excellent choice. Perfect location, close to everything. Newly redecorated. Good rooms. Hearty breakfast. Not cheap, but well worth the price.", "title": "Great Hotel", "helpfulness": 2, "user": "carlstef", "date": "August 8, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3746297}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "Don't try checking in before 2:00 PM", "title": "Impressed by The Square!", "helpfulness": 4, "user": "gustavm", "date": "August 1, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3726473}, {"rating": 3.0, "stay_parameters": "Stayed July 2005", "text": "We visited Copenhagen between the 29th-31st of July for celebrating our one year engagement and wanted everything to be perfect! Last year we stated at the Nyhavn 71 (which also was too expensive compared to this very good-value hotel), but wanted a different style this time. Both me and my fiancée fancy Danish design a lot and The Square was therefore a very good alternative compare the lot more expensive SAS Radisson Royal, after consulting many Tripadvisor reviews. We had great expectations - and they were all fulfilled!", "title": "Good hotel but not great", "helpfulness": 12, "user": "cmpg1", "date": "July 27, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 3705340}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "The lobby was stylish and the red leather Arne Jacobsen chairs (The egg) were beautiful and gave a nice and expensive feeling! The overall impression of the lobby is highly designed and everything is so well done. Every little singe detail made an entirety. But I can agree with an earlier reviewer that many tourist groups can be a annoying. The bar was quite poor, but they had some wines, drinks and beers (the Dansih beers tastes very well in the Jacobsen chairs!).", "title": "A Very Good Choice & here's some extra tips", "helpfulness": 13, "user": "KWUK", "date": "July 19, 2005", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3683081}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "We booked a supra city saver price of 900 DKK (double standard room) per night via an airline company and got a nice non-smoking superior room at the second floor facing the inner yard (a small bottle of champagne included). We were very lucky and got a superior room! Not so funny maybe, but it didn’t matter when staying there with your true love. We didn’t found the room noisy at all, only when the AC was on full speed there was some noise.", "title": "Great Hotel", "helpfulness": 1, "user": "carlstef", "date": "July 13, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3662408}, {"rating": 3.0, "title": "So so hotel in good location", "text": "We stayed at the Square for a week for a conference. It was comfortable enough and very clean but nothing about it was outstanding. It was quite pricey but this was our only Scandinavian hotel so that might be the norm.", "user": "Rachel_Whales", "date": "September 21, 2011", "id": 118409917}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "PROS", "title": "not a 4 star hotel", "user": "KMK", "date": "September 18, 2011", "detail_rating": {"location": 1.0, "service": 3.0, "rooms": 2.0}, "id": 118264811}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "- it's right next to Tivoli Gardens so the location is great", "title": "Spot on and almost spotless", "helpfulness": 1, "user": "naitS", "date": "September 17, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 4.0, "rooms": 2.0}, "id": 118244601}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "- breakfast was lovely, with fresh mueslie and yoghurt", "title": "Great location. Great hotel. Good value.", "user": "TravelingNut1972", "date": "September 15, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 118174871}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "CONS", "title": "very small room and triple means double bed only", "helpfulness": 1, "user": "Sunny R", "date": "September 13, 2011", "detail_rating": {"value": 2.0, "location": 5.0, "service": 2.0, "rooms": 1.0}, "id": 118051627}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "We stayed here in July 2006. The hotel is centrally located just a few minutes from the central station and a few steps from Tivoli Gardens. When we arrived there seemed to be some problems with the computer system so the check in was very , very slow. The girl at the front desk was very nice though and offered and apology for the waiting. The room was nice and clean and they gave us cot for our baby. The hotel seems new but the public areas seemed to be in need of a bit of a good cleaning because the elevators looked very dirty. The breakfas was nice and had several good choices. It seemed this was the only hotel in Copenhagen because most days the breakfast room was full of people, although to be fair this is a large hotel. The reception area is nice and modern as are the rooms. Considering the location alone we would stay here again.", "title": "Good location", "helpfulness": 1, "user": "TjLaura", "date": "August 4, 2006", "detail_rating": {"front_desk": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 5558725, "likes": {"liked": "— Location"}}, {"rating": 4.0, "title": "The Square - perfect location", "text": "Stayed here July 2006, for a weekend break and the location was fantastic it was near to the train station (3 minute walk), bus stops, tivoli gardens was right on the doorstep which is a wonderful place to visit especially at night.", "helpfulness": 4, "user": "Cubbies", "date": "August 1, 2006", "id": 5535556}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Stayed here for one night in early August. Our family of 3 (two adults and one 12 year old) slept in a Superior Double. Cost was 1,455 DKK per night (breakfast and VAT included) plus a $35 DKK Environment Fee. Here are my comments:", "title": "Very Average Experience", "helpfulness": 3, "user": "ThreePuttPat", "date": "August 13, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 5605810}, {"rating": 4.0, "stay_parameters": "Stayed April 2006, traveled as a couple", "text": "* Check in and check out was efficient. Hotel always seemed to have 3 people staffing the front desk.", "title": "Great loved the hotel and location.", "helpfulness": 3, "user": "chessykat", "date": "August 12, 2006", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 5602564, "likes": {"liked": "— Our top flolor suite and the roof top breakfast room", "disliked": "— Nothing it was all very good"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "* Location was fine. The Square is close to the train station; a block from the Travel Information office; not too far from the highway; very close to Tivoli; walking distance to major sights.", "title": "Not very impressed", "helpfulness": 2, "user": "scotty27", "date": "August 5, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 5557448, "likes": {"liked": "— Location", "disliked": "— Hot room"}}], "location": {"country": "Denmark", "region": "Zealand", "continent": "Europe", "city": "Copenhagen"}, "stars": 3, "variance": {"poor": 112, "average": 249, "very good": 502, "terrible": 52, "excellent": 249}, "aka": "The Square Copenhagen Hotel Copenhagen", "slim_ranking": 0.302752293578, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 3.5, "rooms": 3.5, "location": 4.5}}