{"user_rating": 5.0, "review_count": 24, "name": "The Captain's House", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "My husband and I stayed for two nights earlier this month and everything was perfect. The decor is simple, stylish and comfortably elegant. The furnishings and fabrics are gorgeous and everything was spotlessly clean. The staff couldn't do enough for us. Not only did the manager recommend a great place for dinner, he walked us down the street and introduced us to the owner of the restaurant! Before that he popped out of the hotel to procure a botle of wine for us to have in our room while we were freshening up. Our room was small but perfectly adequate, featuring a cute balcony with French doors. Breakfast was served in a lovely, light and airy room and was a delightful start to each day. Our departing flight was not until the afternoon so we requested a late checkout, which was no problem, no charge and they gave us fresh towels so we could have a quick shower before leaving. Wonderful service. We are going back at the end of the month and have booked a larger room at a higher rate. Still a fantastic bargain!", "title": "First class little hotel!", "user": "VirginiaHouse", "date": "June 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112926058}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The best hotel in Preveza. The stuff was really kind and so helpful, the room so cozy and comfortable. The location just perfect.", "title": "The best in town", "helpfulness": 1, "user": "PaVel050808", "date": "May 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 107796347}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "I think it's the only Greek hotel that deserves the four stars and there is no doubt it's value for money!", "title": "What a gem of a 4* boutique hotel!", "user": "PeterCYork", "date": "December 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89509716}], "location": {"country": "Greece", "region": "Epirus", "continent": "Europe"}, "stars": 4, "variance": {"poor": 0, "average": 0, "very good": 1, "terrible": 0, "excellent": 23}, "slim_ranking": 0.0769230769231}