{"user_rating": 4.0, "review_count": 188, "name": "The Lafayette Hotel, Swim Club & Bungalows", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "As I know San Diego quite well, I chose the Lafayette for the reasons of price, location, free parking and free wifi. It is a historic hotel in a nice residential neighborhood, near restaurants, and away from the I-8 (Mission Valley) where a lot of the motels are or downtown where parking is impossible or very expensive. Nevertheless, freeway access is close by. The price was moderate for a small but comfy room with a large bathroom, plenty of electrical outlets, and flat screen TV. It's not luxurious, but it is worth the money. I would recommend it to anyone not interested in a motel and not willing to overpay for the downtown hotels.", "title": "A San Diego classic", "user": "Massimo1", "date": "April 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 128497474}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "It was just remodeled - very nicely done. Very comfortable bed and I've stayed in luxury hotels in Vegas - comfort level was the same which is amazing for half the price. Flat screen and ipod docking station. Staff was nice and helpful. Parking is gated underneath the hotel. Great location - safe neighborhood and near some really good restaurants. It was also close to all the major attractions of San Diego. Would definitely stay again. Only problem - wifi didn't work so we had to go to a Starbucks...thank goodness they're on every corner, right!", "title": "Clean and comfy", "user": "Red_26101", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128404430}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We live in Huntington Beach and love to bring people to the San Diego Zoo. This was the first time we decided to stay overnight in a hotel and picked this hotel because it's about 5 minutes from the zoo and the pool was designed by the original \"Tarzan\". We had learned about him from an LA tour we had taken the day before so I thought that was a nice coincidence. We loved the hotel. The food and atmosphere at the Red Fox was totally old school. Steak, baked potatoes, salad...fantastic! The room was recently renovated and was cozy for all 5 of us. The pool was clean and well kept. The breakfast at the newly renovated restaurant off the hotel lobby was fresh and very tasty. The only reason I didn't give it 5 stars is because the people at the front desk were just not that personable.", "title": "Fun place to crash and eat after a long day at the zoo", "helpfulness": 1, "user": "Cheryl D", "date": "April 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128181713}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We had a family suite: 2 large bedrooms (one with a bunkbed which the kids loved), 2 washrooms and 2 closets. There was a fridge and coffeemaker but no microwave. Both rooms had flatscreen TVs, and there was a small dining area. Breakfast was not included, parking was.", "title": "Worked well for our family of 4", "user": "sunseeker1062", "date": "April 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 128150532}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Our room did not overlook the pool which was a shame, on the other hand, some poolside rooms seemed to have a bit of partying going on so maybe it was best that we were a bit removed. The large pool was heated and towels are available from front desk.", "title": "Good hotel depending on which wing...", "helpfulness": 3, "user": "Corpsie74", "date": "April 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 128075888}, {"rating": 2.0, "stay_parameters": "Stayed March 2012", "text": "So we had made a reservation despite the questionable reviews. The website looked good, as did the photos. After arriving in San Diego we drove over to check it out.", "title": "Lafayette...yes or no?", "helpfulness": 1, "user": "ap3266", "date": "March 16, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 126167712}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Getting there was easy, but the neighborhood started looking questionable the further we drove. When we got to the hotel, my wife was not impressed. We walked into the lobby (which was empty) and were a little disappointed.", "title": "Good for families on a budget. Great Pool!", "helpfulness": 1, "user": "Jacksmack", "date": "March 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 125716328}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The front desk clerk didn't bother to greet us or show us around. The hotel is neat and has a cool history, but we just got negative vibes.", "title": "hotel", "user": "carlosr60763", "date": "February 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 125156659}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The pool is definitely smaller than what I thought. The Red Fox Steak House is indeed next door, but it looked tired and haggard.", "title": "Hotel Horrible!", "helpfulness": 7, "user": "rsspider55", "date": "January 31, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 123905537}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "The biggest turn off really was the area surrounding the hotel. There were some seedy looking establishments replete with homeless people hanging out at a liquor store nearby.", "title": "Very Congenial Walk into the Past", "user": "Margaret J", "date": "January 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123621365}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "This is not my first time at this hotel. I spent a girls weekend here prior to their recent renovation. The hotel has that throwback vibe to the 40s, where you could imaging people wandering out of their poolside rooms to lounge and socialize at the pool. That was my first visit experience. Despite the rundown condition of the hotel, prison-style toilet, and far from fresh breakfast, I considered coming back.", "title": "Has great potential and charm but all ruined by visits from cockroaches", "helpfulness": 3, "user": "moretravelpleez", "date": "April 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 128026292}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Our recent trip (last weekend), I booked my family and my sister's there, due to the great rate on Hotwire. It was a chance booking, but when I realized where I will be staying, I didn't mind at all. Finding out that they also have family style suites with bunk beds was a bonus. My family stayed poolside while I upgraded my sister to a family suite. Since my last trip, the hotel has a fresh coat of paint, decorator service, better bedding, carpeting, more outdoor furniture, flat screen tv, updated lobby, among other nice touches. I was excited to see all the efforts to freshen up the hotel without losing its mid-century charm. I was willing to overlook the condition of the bathroom (still prison style toilet), most power outlets not working, having to walk past a smelly gutter to get to my room, and dragging luggage up stairs.", "title": "Terrible Easter weekend Experienced!!!", "user": "Alvin A", "date": "April 9, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 127569735}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "All was fine and dandy until I went out to pick up dinner for both our families on our last night and brought it back to my sister's suite. While we were eating, I saw an enormous cockroach crawled up the wall. The kids shrieked and my brother-in-law had to get up and dispose of it. To my horror, the kids said that it was not the first cockroach that crawled around in their room. My appetite was ruined and I was pretty upset. I didn't see any in my room, but my mind started to wonder if there are worse things crawling on our beds and floors.", "title": "def great price", "user": "JessiCakes17", "date": "March 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 126926340}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "For all the money that they took to renovate the hotel, investing in exterminator service should be part of the investment. I really wanted to like this hotel and was willing to overlook most things, but I just couldn't overlook sanitary issues.", "title": "not bad for the price but whould not go out of the way", "user": "diananimagoo", "date": "March 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 126902381}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "I don't think I could bring myself to stay here again. Really too bad.", "title": "3 star hotel that gets 5 stars", "user": "StarAlly", "date": "March 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 126853421}, {"rating": 4.0, "stay_parameters": "Stayed January 2012", "text": "Walking into the Lafayette is walking back into time. The nostalgic presence of history is strong. The lobby is a friendly entrance with high ceilings and a historical pleasantness of grandeur.", "title": "Aleja & Ted's adventures", "helpfulness": 1, "user": "alejaTELLURIDE", "date": "January 25, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 123582568}, {"rating": 2.0, "stay_parameters": "Stayed December 2011", "text": "Continue through the lobby, pass the atrium and outdoors onto a patio to view the pool with it's surrounding bungalows. I felt like I should be in the garb of vintage clothing to honor this space.", "title": "More like a Motel 6", "helpfulness": 1, "user": "sandman8888", "date": "December 29, 2011", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 122245925}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Very fun and a Funtastic place to have a party, a reunion or a holiday.", "title": "An Unknown Gem", "helpfulness": 2, "user": "Lumpkinites", "date": "December 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122151364}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "Terrible, don't know how they got 3 stars, the guy who gave it to them must be high on something becoz this is a motel not a hotel and there was construction during our stay which made it worse!", "title": "Once a Grand Hotel now a comfortable margin", "helpfulness": 1, "user": "SammyM68", "date": "December 22, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 121982713}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "The Lafayette has undergone considerable renovation, and the process is not yet complete. The color schemes are lovely. The rooms were perfectly clean, with the most comfortable beds imaginable, large flat-screen TV's, and all the usual, top-flight amenities. It was too cool to use the pool, but it was enticing. There is also a legendary bar/steak house on site. The rates are incredibly reasonable for the quality and comfort. THIS is a hidden jewel!", "title": "I'll be back", "helpfulness": 1, "user": "Sue R", "date": "December 7, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121499280}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 15, "average": 26, "very good": 59, "terrible": 13, "excellent": 75}, "aka": "Lafayette Hotel San Diego", "slim_ranking": 0.385185185185, "description": "Built in 1946, the Lafayette has been the site of historical glamour, and offers a unique change from a typical hotel experience. Among its famous guests were Bob Hope, Lana Turner, Ava Gardner and Betty Grable. Inside, the Mississippi Ballroom took center stage where Hollywood’s stars came to dance the night away. Conveniently located to all shopping, entertainment and business areas, the historic Lafayette Hotel, Swim Club & Bungalows is, indeed, the best lodging choice in San Diego."}