{"user_rating": 5.0, "review_count": 70, "name": "The Corner House Bed & Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "The owners were extremely helpful and welcoming. The breakfast is excellent and the rooms are very nicely renovated (although the rom downstairs is quite small).", "title": "Well looked after b and b with charm", "user": "Alexlondon2010", "date": "March 4, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 125614121}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We used this B and B for a quick trip to Whitehaven. Leisa and Dave made us feel very welcome. We stayed in the Buttermere Room, a downstairs bedroom with a wet room. The shower was lovely and had body jets ect. Full instructions were in the book in the bedroom. There were also lovely toiletries in the bedroom and the wet room, and the towels were fluffy soft. Leisa had also provided plenty of coffee, tea, hot chocolate and biscuits in the room. We had a great night's sleep and the following morning had one of the best cooked breakfasts we've had in a long time, including 4* hotels.", "title": "A Gem", "user": "havenrules", "date": "February 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125327413}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We really appreciated having an off-road parking space which is difficult to find with some guest houses in Whitehaven. I would definitely recommend this B and B to those visiting the area. The service was excellent and the cupcakes we received as we left were a lovely surprise. Well done Leisa and Dave, you're doing a great job in promoting the area and your business. We will be visiting again.", "title": "Great B & B", "user": "Christine B", "date": "December 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121896929}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Excellent B &B, excellent service Leisa & Dave were very helpful and even invited us into their own Loung for coffee. we stayed in the Buttermere room and the bed was so comfty I wanted to take it home with me. The place was spotless and we got up to a fabulouscooked breakfast. Will definitely be going to stay again in the near future!", "title": "Truly excellent service - highly recommended", "user": "Sarah W", "date": "November 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120415356}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "A colleague and I needed to stay over in Whitehaven for one night and found The Corner House via Google - we were so glad we did! Leisa and Dave could not have done more for us, or been more hospitable. They collected us from the station, and provided us with both a warm welcome and full information about the area including suggestions for where to eat that night. In the morning, after a fantastic (and early, because we needed to leave early for a meeting) breakfast, Leisa even drove us to our appointment because our taxi failed to arrive. The accommodation itself is to a very high standard, both rooms are beautifully decorated, spotlessly clean and very well appointed. I would very highly recommend this lovely B&B to anyone wanting to stay in the area.", "title": "Fantastic B&B - couldn't ask for better!", "user": "jpfadams", "date": "October 17, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 119400276}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We stayed here on the evening before setting off on the Coast to Coast bike ride. This is an ideal place to stay for anyone attempting the C2C as it has lockable, secure bike storage and is only a short ride down hill to the start.", "title": "We loved it and we hope to be back soon!", "user": "Daventree", "date": "July 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115148064}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We were warmly welcomed and were made to feel more like friends than paying guests. We stayed in the Buttermere room which is beautifully decorated and the wet room is fab. Breakfast in the morning was great and just right to set us off on the 50 mile bike ride we had to do that day.", "title": "The ultimate B&B - We absolutely loved it and we'll be back.", "user": "MrP1943", "date": "June 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114717863}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "We would definately recommend and hope to be back soon!", "title": "Very comforatable B&B, can't go wrong if you're visiting Whitehaven.", "user": "SeanVintin", "date": "June 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 114580638}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Our long weekend in Whitehaven was made complete by this wonderful B&B. The absolute attention to detail that Leisa and Dave Kelly have put into their incredibly presented home is total. They make you feel like part of the family from the moment you arrive. Leisa knocked on our door with an unbelievably good 'still warm' Chocolate Brownie, scrummy! The bedroom and bathroom were so comfortable, spacious and relaxing to return to after a days sightseeing. The breakfast was just perfect. When we checked out Leisa even gave us a presentation pack of two of her lovely home made cakes, what more could you ask. Do yourself a favour and try the Corner House. You'll love it. A lovely centre to tour the spectacular area.", "title": "Fantastic B&B", "user": "JohnW50_10", "date": "April 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106268150}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled solo", "text": "I’ve been staying in this Georgian B&B for 6 weeks now due to long term work in Whitehaven. It is close to the centre of the town but also in a quite location away from the main road.", "title": "The Corner House is an excellent place to stay and use as a base in Whitehaven.", "user": "Flavourskent", "date": "April 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104238580}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "This was a real find!", "title": "Bed and Breakfast as it should be!", "user": "Groovy146", "date": "April 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127910530}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "This is a beautifully appointed house with wonderful hosts to match. The property is decorated to a very high standard and the bed was a real pleasure to sleep in. (I have to agree with Tina C that it was the best night's sleep I have had for a longtime.) Nothing was too much trouble and the breakfast was particularly fantastic. Fresh, locally sourced food cooked to perfection and served with a smile. The walk into Whitehaven was really easy (I travelled by train) and this would be a great place for anyone considering the C2C cycle.", "title": "Fabulous!", "user": "Tina C", "date": "March 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126878264}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I had a fantastic stay from start to finish. Booking was easy. The owners are very friendly and attentive. The room was gorgeous, very tastefully decorated yet practical and comfortable with really careful attention to detail. A very comfortable double bed helped me to have the best night sleep I've had in a while. The bathroom was lovely, brand new, very tasteful with a fantastic shower. Breakfast was delicious. I would recommend this lovely place to any-one. The beautifully boxed hand made cupcakes presented to me at breakfast on day 2 was a very pleasant and welcome surprise.", "title": "Flawless", "user": "Alec_Keep", "date": "March 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 126556147}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "Attention to detail is what makes the difference between a satisfactory B&B and a flawless one, and at the Corner House they pay attention to detail. Plentiful Egyptian combed cotton towels; Cole and Lewis bathroom products; quality fairtrade tea bags in the room; no skimping on the allocation of milk and biscuits; local free-range eggs with the generous breakfast; orange juice that's so orangey you think it was just squeezed; fresh strawberries and blueberries with the cerials; and amenities complemented by a very considerate style of hospitality that gives you the space to relax and enjoy your surroundings. Perfect.", "title": "Wow ! Best bed and breakfast I have ever stayed in. rooms so well done with great materials.", "user": "Simonjf", "date": "March 23, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 126541945}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I stayed for business and was so pleased to stay in this boutique b and b. Best breakfast ever followed comfortable sleeps in great beds. I will stay agai for sure", "title": "An absolutely gorgeous B&B", "user": "ShoppingGoddess", "date": "March 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 126346397}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "A great place to stay, excellent hosts who made you feel very comfortable. We chose the Buttermere room because of the shower, the room was spotless and with fine touches. There was a good choice for breakfast with all the traditional cooked but there was the added extra of fresh fruit (strawberries & blueberries) and fresh kippers from the local harbour. For the journey home we were given 2 chocolate cup cakes in a presentation box which were delicious. Many Thanks", "title": "A great B&B with good hospitality", "user": "paul r", "date": "September 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117716835}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "From the minute we entered we were looked after room was beautifully furnished amazing and so well equiped. Looked after like we belonged there nothing was to much trouble cannot say enough good thing about it.", "title": "Best place we have stayed in the UK in a long time highly recommend", "user": "bluechick03", "date": "August 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116863006}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "Within easy reach of the port and town but just far enough away to be quite", "title": "Wonderful...would definitely stay here again", "user": "EVE R", "date": "August 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116798158}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "One of the best B&Bs I have stayed in! Gorgeous room, wonderfully comfortable bed, beautiful en suite bathroom, everything immaculately clean. The breakfast was great too. All locally sourced produce and the coffee was perfect. The family that run it are lovely - warm, friendly and couldn't be more accommodating. Off street parking a big plus, too. The Corner House is a ten-minute walk down into the centre of Whitehaven which is a fascinating place, steeped in history and stories about its mining past. I'll be back!", "title": "Excellent Hotel", "user": "July60", "date": "July 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115493174}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "We stayed for 2 nights, beautiful bedroom with large bathroom featuring a lovely free standing bath. The breakfasts were faultless, plenty of choice and served in immaculate surroundings. Nothing was too much trouble for our hosts and their attention to detail was in evidence all through our stay. Highly recommended.", "title": "A Pleasant Stay", "user": "EverythingDinosaur", "date": "July 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 115311983}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 0, "average": 1, "very good": 3, "terrible": 0, "excellent": 66}, "slim_ranking": 0.0714285714286, "description": "Leisa and Dave welcome you to The Corner House.This Victorian villa, built in 1876 hosts many original features, including high ceilings, sash windows and fireplaces. We have three rooms to offer our guests - a superior double, standard double and a twin.The Corner House is located only a 5 minutes stroll from the historic Georgian port town of Whitehaven. Much of the town dates back to the 1700's when shipping, rum and mining were its main trades. The regenerated harbour side with it's cafes and restaurants is now noted as being the start of the C2C cycle route.At The Corner House's guest facilities include onsite parking, secure cycle store and free WiFi. We pride ourselves on providing the right balance of service and quality that you would expect from a hotel with the personal and friendly atmosphere you would find in a bed and breakfast.Whether it's a romantic weekend away, fell walking, cycling or business, The Corner House offers quality accommodation, comfort and style"}