{"user_rating": 4.5, "review_count": 498, "name": "The Nolitan Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "I originally booked a stay at this hotel through Tablet Hotels paying for the room in advance back in the Fall of 2012. But then I became sick and was unable to go to NYC. At the time of booking, our upfront payment was not refundable but the Nolitan Hotel generously credited us for a future trip to NYC, and we rescheduled a trip to NYC in January and was able to use this credit for our January stay. I'm very grateful to Nolitan for their flexibility.", "title": "New Favorite Hotel in NYC", "helpfulness": 1, "user": "bbjj0827", "date": "February 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152779797}, {"rating": 2.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Now the hotel - it was awesome. The neighborhood was fantastic - in the lower east side - my new favorite hood to hang out in - near the Williamsburg bridge. We had great eats that weekend near the hotel, including the south Willaimsburg area after a pleasant beautiful walk over the bridge.", "title": "Big disappointment", "user": "KitsuneGeneva", "date": "February 19, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 152569590}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "The room was bigger than expected (especially given NYC) and the bed was awesomely comfortable (check pic). The shower was \"open\" - meaning that the shower had glass walls into the bedroom. There is a curtain one can pull for privacy ...... though it's a bit awkward to shower some openly, it does add to the room feeling bigger as the whole space appears \"open\".", "title": "Miami Beach meets Paris in NYC", "user": "alexdelange", "date": "February 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 152541057}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The staff were very helpful and friendly - which added to a great stay. Love the lobby and wished I had more time to hang in it. We discovered in the late afternoon / early evening - free wine and snacks were available. The hotel had extra perks such as bike and skateboard rentals (which I think were free but I could be mistaken). Given that it was January, we're not renting bikes but still loved that they were there to use. And if you forgot your laptop, they had ipads one could use. Oh and there's a fantastic balcony ..... though too cold for us to use but I did love it.", "title": "Overnight Getaway!!!!", "user": "Joe A", "date": "February 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 152531730}, {"rating": 5.0, "title": "A Beautiful Hotel", "text": "Overall, I loved it. And would absolutely stay there again. My only hesitation is that it's a bit expensive ........ but I guess it's nyc ....", "user": "Thomas_A484", "date": "February 19, 2013", "id": 152519639}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We stayed in the Nolitan hotel for 9 nights in July 2012 and got a very good rate on Quikbook. Note that the hotel is having major renovation on the ground floor and there is no restaurant. We didn't hear any noise from the works though.", "title": "Cool area, friendly hotel", "helpfulness": 2, "user": "Belgian_EU", "date": "August 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 136163049}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Pros:", "title": "We Loved It!", "helpfulness": 1, "user": "InternationalHorizon", "date": "July 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 135723803}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "- roof terrace. Huge and usually deserted. No umbrellas though.", "title": "Amazing boutique hotel", "user": "miguel r", "date": "July 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 135692772}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "- Our room had a very small balcony, which was nice, although far too thin to really sit on.", "title": "A great place should be closer to perfect", "user": "FredS2008", "date": "July 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 135494995}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "- wifi was free although the speed, and coverage, was patchy.", "title": "Great hotel, great staff.", "helpfulness": 1, "user": "9Kblue", "date": "July 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 134931357}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "On planning a trip to NYC to visit our daughter, I found the Nolitan. Knew nothing about the neighborhood at all. What a wonderful surprise. The hotel was a perfect little find. Clean, good size, amazingly wonderful bed, great shower and a great, friendly, helpful staff!! Would definitely return to this hotel. loved the area. Steps to SoHo, Greenwich Village, Chinatown, Little Italy. A wonderful change from the super touristy areas of New York City. Dozens of wonderful shops and restaurants close by.", "title": "Great find!", "helpfulness": 2, "user": "bjoy408", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133837372}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "What a great place! From the moment I came, no detail of this hotel had been overlooked- you can rent their bicycles and skateboards- they have a whole list of menus that deliver to your hotel in a nice neat little packet in your room- their shower and bathing products are exceptional- the room is a bit on the smaller side but the planning is thoughtful and useful- relaxing wonderful fourth of July stay- will return!", "title": "Affordable luxury", "helpfulness": 3, "user": "Lunka86", "date": "July 9, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 133807457}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We spent 2 very enjoyable nights here over the 4th of July. The location is great if you want to spend time in and around Soho, Little Italy, and Chinatown. Of course the subway makes it easy to get to midtown and museums in 15 minutes or less. We really enjoyed being away from the touristy Midtown/Times Square crowd. The rooms are a little small, but they are very clean and comfortable, and the staff couldn't be more friendly and helpful!", "title": "Fantastic Hotel", "helpfulness": 2, "user": "tablehead", "date": "July 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 133792117}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The combination of a Vacationist deal + good Tripadvisor rating + desire to stay in a new neighbourhood (we usually stay around midtown) led me to the Nolitan. I'm so glad we landed here. The service at the hotel was fantastic, we had a beautiful view of the Manhattan skyline from our balcony and we were able to explore new parts of New York. There were minor quibbles (small room...of course, it's New York!), a loud air conditioning system, and a rather light continental breakfast, but they were all minor points compared to the hotel's pluses.", "title": "Cool, clean base from which to expore Nolita", "helpfulness": 2, "user": "LtDan", "date": "July 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 133283535}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Hints for people looking for meals: Barmarche, just up Elizabeth Street at Spring, was a fantastic dinner choice. The Epistrophy cafe around the corner on Mott was a great place for a drink. Asia Dog, just a block west, had tasty gourmet hot dogs if you need a snack.", "title": "Funky NYC gem", "helpfulness": 2, "user": "cactuspee", "date": "July 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 133219094}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "I just finsihed a sabbatical in New York city when my work sent me again for a week of work.", "title": "Friendly Nolitan", "helpfulness": 1, "user": "Langoustine", "date": "January 26, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 150680595}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "I wanted to experience something else than Chelsea where i had spend all this time, and i chose the Nolitan. And that was a good choice. It feels like home, the staff is super friendly and helpful, the hotel attaracts beautiful people and because it is a very personal place, people tend to talk to each other and connect over the usual 6 o'clock complimentary cheese and wine. The rooms are medum size, but modern and sensual, with a little balcony and all amenities. Amazing. loved it and strongly recommend it for a good price in a great burrough and a simple and lovely place to stay. Location is just amazing, steps from soho, steps from my favourite Epistrophy cafe, steps from the best foot massages in the world and the almonds cold drinks of China Town. Really easy and nice. Thank you for your warm reception. I will come back.", "title": "A Great Find", "user": "Prim8Keeper", "date": "January 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150489221}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Danielle", "title": "Modern & Fun", "helpfulness": 1, "user": "subtchr", "date": "January 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 150361193}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "We stayed in the Nolitan Suite for our wedding. The suite was on the eight floor and had amazing views - looking uptown you could see empire state building, Chrysler building, etc. and looking east you could then see the Williamsburg bridge. Although the views from the rooftop are even better. The suite its self was set up very well and the living room area is big enough that you can easily entertain a few people. The huge soaking tub, which easily fits two, and rain shower were probably my favorite part of the suite. The design was clean and modern with a slight retro feel. When our photographers were taking photos they mentioned it looked very \"mad men.\"", "title": "A Boutique Gem in Nolita", "user": "sococindy", "date": "January 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 149780796}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The staff of the hotel was very eager to please and accommodating. The night of our arrival along with our wedding night they left champagne and a note congratulating us. They also gave us a very good rate on our block of rooms including a discounted rate on the suite.", "title": "Comfortable space in a great location", "helpfulness": 1, "user": "DPW67", "date": "January 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 149421850}, {"rating": 5.0, "title": "New, spotless, hip (but not painfully so) AND central LES location!?", "text": "Picked the Nolitan based on the reviews on Trip Advisor. I wanted a boutique hotel in the LES that was a guaranteed, sure-bet great exprience, and that's what we got. I paid ahead and splurged for the Corner King for a surprise weekend birthday get-away. the room was a perfect size for 2, with views of the river on one corner, and the Empire State Building the other. At night, it was spectacular!", "user": "Bec215", "date": "August 20, 2012", "id": 137789944}, {"rating": 5.0, "title": "Fabulous hotel, excellent staff", "text": "CONCIERGE:", "user": "BeverlyS", "date": "August 12, 2012", "id": 136999870}, {"rating": 5.0, "title": "I Never Write Reviews", "text": "The front desk staff double as concierges - that's a new thing, apparently - so they were still a bit green around the gills helping us find some information, but they're absolutely wonderful and kind, and infinitely patient. They also managed to secure a dining reservation at Le Bernardin on a Friday night when I could not, which gets them bonus points in my book!", "user": "Lauren S", "date": "August 10, 2012", "id": 136808018}, {"rating": 5.0, "title": "Great Find", "text": "FOOD:", "user": "Mark P", "date": "August 10, 2012", "id": 136799071}, {"rating": 4.0, "title": "Yes to the Nolitan", "text": "The continental breakfast is very basic and blah (though the coffee was good), but their restaurant was under renovation when we were there, so I'm withholding judgement on the food angle, but they do get points for arranging delivery from 15 area restaurants including famed Blue Ribbon Bakery, which they plate on-site with real silverware - a very clever 'stop-gap' measure that actually gives you access to some amazing food without the wait in line!", "user": "Tom i", "date": "August 8, 2012", "id": 136680855}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "First time to NYC and very glad we chose to stay at the Nolitan! We stayed from 23rd Dec to 1st Jan - I had heard and read many good things about this hotel before our trip and it was also in the ideal location for us! We couldn't stand the thought of staying around midtown with the masses of other tourists and wanted an area that was more 'low key'.", "title": "Welcome to the neighbourhood!", "helpfulness": 3, "user": "Allana J", "date": "January 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 149217804}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The hotel is right in the heart of downtown and walking distance to Soho, Chinatown, Little Italy, many fantastic restaurants, cafes, shops and the subway stops are close by in every direction you walk. The hotel is on quite a busy road but don't let this put you off, as soon as your off Kenmare street its like your in a different world! Also as mentioned not as touristy around these parts which was great for us and we felt like more of a local than a tourist.", "title": "Nolitan Redefined the Hotel Expirience", "helpfulness": 2, "user": "et49589", "date": "January 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149187783}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The hotel staff were very helpful and friendly - they were more than happy to give tips on whats good to do in the area and help with any querie we had.", "title": "Great location, great staff, imperfect room", "helpfulness": 1, "user": "rrrosner", "date": "January 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 149028796}, {"rating": 2.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The rooms were very well designed with a good layout and very clean however they are quite small but from what I hear most rooms across NYC are small! We stayed in the deluxe queen room with balcony and were on the 9th floor and had a great view of the city and Empire State Building. I had read that people complained about the street noise level but we didn't find the outside traffic noise to be an issue at all - I'm not sure if this is more of a problem on lower levels.", "title": "Cold, noisy, unpractical", "helpfulness": 5, "user": "Lifebender", "date": "January 4, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 148814772}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The hotel offers free bike rental which we thought was great and qw made use of this a couple of times, its on a first in first serve basis.", "title": "Overnight in NYC", "helpfulness": 1, "user": "copnyct", "date": "January 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148640706}, {"rating": 4.0, "title": "Location, location, location!", "text": "We come to NYC 3-4 times every year and have stayed all over the place. Upscale, low key, boutique and big chain hotels. The Nolitan might be our new fav spot and we hope to be regulars there.", "user": "Msk6261", "date": "September 20, 2012", "id": 140777300}, {"rating": 5.0, "title": "Our Wedding Anniversary – memorable!", "text": "Nolita is our favorite area of the city. Small, mid-range boutiques, trendy, fun restaurants and a great, active vibe. The Nolitan is in a perfect position to explore Nolita, Little Italy, Soho and the village. We were very excited to see they were building something in the area.Kenmare St (where it's located) is not very exciting to look at but turn left or right a block away and you enter into a new world. It's not unsafe, just not much to look at.", "user": "Lesterlh", "date": "September 15, 2012", "id": 140301304}, {"rating": 5.0, "title": "Wonderful Staff", "text": "The staff at the Nolitan is friendly and solicitous. They went out of their way to make sure our needs were met.", "user": "PapaEdwin", "date": "September 14, 2012", "id": 140297878}, {"rating": 4.0, "title": "Repeat visit: definitely Still cool and attentive.", "text": "The room was relatively small but not unusual for an inner city NY hotel. The layout was so efficient and well thought out that we did not feel cramped in the least bit. The decor is trendy and modern (almost to the point of being \"cold\" or architectural style). It's a new hotel and the room was immaculate, linens and towels plush and the bed was quite comfortable.", "user": "mojo2014samba", "date": "September 6, 2012", "id": 139598567}, {"rating": 5.0, "title": "as though you've moved into the neighborhood", "text": "Our only concern about noise was that the metal doors did not create a great seal for sound and you can hear things in the hallway. There must be some molding that could fix that. There are only 7 or so rooms on each floor so not THAT much happens in the hall but I would assume it would cffect rooms closer to the elevator.", "user": "Cori_ATX", "date": "September 4, 2012", "id": 139375577}, {"rating": 5.0, "title": "Feel like a true New Yorker and stay at the Nolitan", "text": "If you've ever dreamt about living in downtown NYC but missed out on that life experience for one reason or another (like me), this is your chance to do so without breaking too much of your budget. The Nolitan is one of those contemporary, luxurious, yet uber-low-key boutique hotels that you really don't want the whole world to know about. From its location to its service to its well-appointed rooms, everything is perfect. We were lucky to have one of the upper-floor rooms with a balcony, plus a beautiful view of the Empire State building and Williamsburg Bridge. Head to the rooftop with your complimentary breakfast or glass of wine and soak in the NYC skyline. Unlike some of the hotels nearby, there really is no \"scene\" here, which was really great for us. Our vacation just ended but we already miss our stay at the Nolitan...see you next time!", "user": "stetienne2", "date": "September 2, 2012", "id": 139158436}, {"rating": 5.0, "title": "Nolitan - fresh, new, very nice and helpful staff", "text": "The Nolitan is in a convenient quiet location if you want to be in the lower east side. The staff is very friendly and helpful. They not only stored 4 very large suitcaes for us but even helped us move them to our child's apartment a block away! The linens are very nice and the bed is comfortable. Overall, the hotel is fresh and new and the staff is eager to please.", "user": "cduck5", "date": "August 31, 2012", "id": 138992708}, {"rating": 4.0, "title": "An Oasis of Calm and Serenity in the Big City", "text": "Staff was extremely helpful and very courteous. I had a couple of issues that were resolved well but two things had not been resolved. I did not get a newspaper each day, and did not have any turndown service on the second night. I arrived for the CB at 9:30am only to find nothing left but yogurt. Second day the bagels were stale. In addition, turndown service did not include tidy up - garbage not removed, glasses not replaced. I did ask about the turndown service, but I recieved no response to my query. I did love the location, the room was fabulous and the people were terrific. Loved the rooftop terrace as an oasis of serenity! Could have been a little cleaner up there.....no garbage can provided so folks just left their garbage. I will consider the hotel again, as these issues are easily fixed and not a deal breaker for me --- a request was sent for my feedback and I am looking forward to see if these issues are resolved for the future.", "user": "princess416", "date": "August 28, 2012", "id": 138689472}, {"rating": 5.0, "title": "Posh details and fabulous location", "text": "I would definately consider booking this hotel again, the rooms, while small, are well organized, comfortable and very clean. I had the neighbourhood corner and it was truly lovely! Well appointed, huge tv - lacking a lot of tv stations though for NYC. Nice electronic amenities, free bikes and skateboards although I am not one to take my life into my hands and bike around NYC!! Traffic is a disaster at all hours. The neighbourhood is very safe - I walked alone at 1 pm at night and did not feel uncomfortable. Serviced by many subway stops, tons of amazing restaurants - this property could not be more well located to see the heartbeat of NYC!", "user": "Christine F", "date": "August 27, 2012", "id": 138508239}, {"rating": 5.0, "title": "Loved it! Excellent Location!!! Amazing Staff!!!!", "text": "A new addition is \"Happy Hour\" at 6 - 8 pm - I missed it on Staurday as I had to leave early for dinner and the theatre, and it is not available on Sundays.", "user": "JacquelineBiasco", "date": "August 20, 2012", "id": 137829212}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Pretty pricey (I spent $300/night). Great neighborhood. Restaurant under repair (they claim it will be ready by April 2013). Not the quietest hotel in the world (lots of traffic out front), but not terrible either.", "title": "Sweet Location - Nice rooms which are not huge", "helpfulness": 1, "user": "AranNathanson", "date": "February 6, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 151550293}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Cosy rooms with a modern, stylish touch... A bit small and noisy (as often in NYC!) but nicely organized and very comfy. Not many facilities (no gym, no pool, no spa) but a restaurant should open by the end of Feb... Till then, no real breakfast is served unfortunately, which is the only thing I was disappointed about during my stay. General atmosphere is a bit fancy but friendly. Decent value for money and, most of all, a perfect location!", "title": "Cool boutique hotel with a perfect location", "helpfulness": 1, "user": "Max G", "date": "February 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 151448996}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The Nolitan Hotel is a beautiful, industrial/contemporary style boutique hotel located right smack in the middle of all the action of SOHO, Greenwich Village, East Village, LES. Rooms are cozy in size but outfitted with all the latest and very high quality fixtures and appliances. Everything is also brand spanking new. Staff could not possibly be friendlier or more accommodating. Can't wait to go back when their bar and restaurant open, which they say will be any week now.", "title": "Beautiful contemporary hotel", "user": "MtnLakesiders", "date": "February 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 151229753}, {"rating": 1.0, "stay_parameters": "Stayed January 2013", "text": "Location is great. Hotel needs much improovement. The rooms are tiny (typical for ny) but also not kept very clean and VERY NOISY. Kenmare is a very busy street and this place clearly did not spring for good windows because I stayed on the 9th (top) floor and was awoken by trucks at all hours. Also, they are the first hotel I have stayed at that does not have a professional system for wake-up calls. In a 5 day stay, one day my wake-up call didn't happen, one day I got it 15 minutes late, and the clincher was one day I got an 8:45am wake-up call at 7:00am! On top of that, my bathroom products were often not refreshed, the lobby was freezing with random space-heaters everywhere and one elevator was \"out of service\" for half my stay, leaving me waiting for several minutes any time I wanted to enter or leave my room. Also, there is no bar or restaurant there and no room service. Just beware...", "title": "Awful service in a great location.", "helpfulness": 1, "user": "morgan3000", "date": "February 1, 2013", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 151202825}, {"rating": 1.0, "stay_parameters": "Stayed January 2013, traveled solo", "text": "My room was very cold as was lobby. Hotel currently is developing a \"concept\" for food; so no room service and mediocre pastries and coffee on paper plates and cups for breakfast, consumed perched on uncomfortable chairs, an improvisation that didn't work. Promised amenities such as newspaper and turn down service did not materialize and once I had to request even regular day time clean up. Room never really felt clean. Staff varied between \"way cooler than you\" indifference to sort of friendly. One of the elevators was out of service the entire stay; a good metaphor for a not ready for prime time hotel. Certainly not worth the over $1000 for three days.", "title": "Nolitan nightmare.", "helpfulness": 2, "user": "Jane F", "date": "January 28, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 150826361}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Nolita is a great place to explore and close to the hustle of SOHO.", "title": "Loved it!", "helpfulness": 3, "user": "AForAdam", "date": "July 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 134746933}, {"rating": 5.0, "title": "Very glad I tried something \"new\" with the Nolitan", "text": "I usually stay in downtown Brooklyn when I travel to New York City for business. However, for my most recent trip, I was open to recommendations for lodging since the rates at my usual hotel were a bit on the extreme side. (Nearby hotels were no better.)", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 1, 2012", "id": 133188495}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "Thus, I was told to check out the Nolitan. Not only was it reasonably priced (relative to what my usual hotel was charging), it was accessible to work via taxi or subway and very, very chic.", "title": "Wonderful jewel in the neighborhood!", "helpfulness": 1, "user": "peggy p", "date": "June 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133030744}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "I arrived a tad early for check-in, but the staff was kind enough to hold my bags while I sought out lunch. As soon as my room was ready, I was notified right away. I've stayed at hotels where the staff was inattentive. This was not the case at the Nolitan. From the moment I stepped through the door, I knew I would be in good hands.", "title": "Loved the Nolitan", "helpfulness": 4, "user": "ParisTourist", "date": "June 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 132957590}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "My room was tiny, but since I was traveling alone, this was hardly an issue. It was tastefully decorated, white with red accents. I'd almost consider it a \"clean\" look. What I found interesting was the open bathroom: the shower and sink area did not have a doorway. (The shower itself, however, did have a glass door!) As for the toilet? That's in a room of its own. It almost reminded me of when I traveled to Japan, so while it was a bit unusual for me to see it here in the States, I wasn't completely confused by it.", "title": "short but sweet", "helpfulness": 1, "user": "david r", "date": "June 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 132877134}, {"rating": 5.0, "title": "Amazing location - excellent deal", "text": "The room also had a balcony, which, had I anticipated staying in my room for an extended period of time, would have served as a nice little relaxation space. Granted, I didn't have a stellar city view (I faced a mechanic's garage, among other stores), but I also don't mind people-watching. (It's worth noting here that despite having a neighborhood view, I slept well each night. Noise was not an issue.)", "helpfulness": 1, "user": "J D", "date": "June 26, 2012", "id": 132808417}], "location": {"country": "United States", "city": "New York City"}, "stars": 3.5, "variance": {"poor": 9, "average": 19, "very good": 106, "terrible": 4, "excellent": 360}, "slim_ranking": 0.038374717833, "description": "Located in the heart of Nolita, Manhattan’s most historic downtown neighborhood, the Nolitan Hotel is the first luxury boutique hotel to open its doors in this authentic New York City district. The Nolitan Hotel bridges comfortably chic New York City living with intuitive service and signature touches all designed for you to experience the next level of indulgence or as we like to say, life as a Nolitan!"}