{"user_rating": 4.0, "review_count": 866, "name": "The Mansfield", "reviews": [{"rating": 4.0, "title": "A Very Nice Hotel", "text": "After reading some of the other reviews on this site, I was a bit skeptical, but I was very pleasantly surprised when we arrived. Our plane arrived at 6am and we checked in at 7am. A room was ready for us and we were allowed to go right up and get ready for our day. While the room was fairly small (but definatley not tiny), as I was walking around the rest of Manhattan, I realized that unless you want to spend a lot of money, ALL rooms are going to be small. It is a very small island packed with millions of people afterall.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "July 13, 2004", "id": 2294509}, {"rating": 4.0, "title": "Price Line it.", "text": "The hotel was right in the heart of Midtown--2 blocks from Times Square and half a block from 5th Ave. The only complaint I would have to have about the hotel is the lack of ventilation in the bathroom. When taking a hot shower, it became difficult to breathe.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "July 10, 2004", "id": 2287145}, {"rating": 1.0, "title": "Spend your money elsewhere, a rip off to be sure!", "text": "Please stay elsewhere. The sofitel is just across the street. The glitz of the website is positively NOT indicative of this small, run-down, a tad dirty hotel. I paid $250 here through the hotel website and feel like i was really taken. The room was semi-clean, we found trash in the cans and the pillow smelled of perspiration. My daughter got 3 bruises in the bathroom as you couldn't turn around without injuring yourself on the sink, wall, tub, wall phone, etc. amazingly small, would call it teeny or tiny instead. The comp breakfast consisted of no more than dry bagels, muffins and coffee. we had to wait for juice refills. the computers froze upon arrival and we had a 15 minute wait at check in. our room 202 was ON THE STREET and garbage trucks were cruising all night long...no sleep, also the room was just above the entry foyer and at the bar's closing there was very loud laughter that made it impossible to relax...yet another thing, the room straddled the staircase...all this at $250 a night. Please do not waste a night here.", "user": "jerseygurl", "date": "June 21, 2004", "id": 2208608}, {"rating": 2.0, "title": "Not my cup of tea", "text": "The room was very, very small. The bathroom did not have a vent. The telephone did not work, the tv did not work very well and the reading lamp did not work. It did have a very nice continental breakfast, but all in all in my opinion, not worth it.", "user": "A TripAdvisor user", "date": "April 12, 2004", "id": 1776406}], "location": {"country": "United States", "city": "New York City"}, "stars": 4, "variance": {"poor": 74, "average": 148, "very good": 326, "terrible": 57, "excellent": 261}, "aka": "The Mansfield Hotel New York City", "slim_ranking": 0.582392776524, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.5, "rooms": 3.5, "location": 4.5}, "description": "An architectural and historical landmark, The Mansfield is a portal to a New York City of days gone. Guests of the hotel appreciate its club-like surroundings and superb craftsmanship, as illustrated by the lobby’s detailed illuminated 16-foot ceiling and oval staircases with original terrazzo floors. The Mansfield is located just off of Fifth Avenue at 44th Street, residing within the historic preservation district of Midtown Manhattan, and deep in the heart of the Theater District. The hotel is within a short walk of the finest Fifth Avenue stores, Bryant Park, Times Square, Broadway, Grand Central Station, St. Patrick’s Cathedral, Rockefeller Center, the Empire State Building, Madison Square Garden and the Radio City Music Hall. Guests can enjoy complimentary 24-hour espresso and cappuccino in the hotel's classically-restored Beaux-Arts Club Room."}