{"user_rating": 5.0, "review_count": 153, "name": "The Winchester Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "We have stayed at this in multiple times and have loved it! The rooms are elegantly decorated and comfortable. The beds are so plush and the pillows were so wonderful that I researched them and bought some for our home. The breakfast contends for the best food in Ashland and their staff is very friendly. We will definitely be staying here again.", "title": "What a treat", "user": "CJCAtlanta", "date": "December 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147533941}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "This was our first visit to Ashland and we were unsure what to expect, but initially chose the Winchester Inn for its convenient location (within walking distance from the Shakespearean Theater, downtown shops, and Park). We hoped to find it inviting and peaceful. Our expectations were far surpassed as we enjoyed not only a warm, comfortable suite, but the quiet, peaceful atmosphere of this beautiful Victorian B&B. We felt as if we had stepped into the past with much of the decor, yet our room came fully equipped with TV and wireless service and luxurious bedding. We do not hesitate to recommend the Winchester Inn and its friendly staff to anyone looking for cozy, comfortable, convenient, and cost-effective accommodations.", "title": "Cozy, Comfortable, Convenient, and Cost-Effective", "user": "Valerie2352", "date": "November 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146192519}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We now have stayed at the The Winchester three times and have loved it every time. The rooms are interesting, well-appointed and comfortable and the included breakfast is outstanding. Its location two blocks from the theaters and a half a block from downtown could not be better. We literally did not move our car the two days we were there.", "title": "Excellent, well located and friendly Inn", "helpfulness": 1, "user": "Tom B", "date": "November 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 145464943}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "A very nice B & B. Wonderful breakfasts and great service; we had a small issue with our room and they immediately moved us to an upgraded room while they addressed the problem. Location can't be beat.", "title": "What a sweet place..", "user": "Yogisan", "date": "November 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 145422664}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The Winchester Inn was a perfect B&B. It's a charming Victorian, every room unique. Outside are well-kept gardens and cozy reading spots. Breakfast is inventive and delicious, and so generous a meal that we never bothered to eat lunch during our three-day stay. There is also an afternoon/evening wine bar staffed by knowledgeable staff, and they serve dinner should you wish to dine at the inn. The proprietors were welcoming and helpful, a family atmosphere. Every afternoon they somehow managed to slip a small complimentary surprise treat into our room. Our room was one of the simpler ones, but still quite spacious, including a very comfortable bed, couch, and window seat looking out into the trees. The bathroom was clean and well-appointed. The Oregon Shakespeare Festival is a block away. Having discovered this delightful place, we will want to return to Ashland just to stay here!", "title": "Best B&B", "user": "patluck", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144581060}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Reasons for liking the Winchester Inn:", "title": "Terrific family run small hotel", "helpfulness": 1, "user": "Oski80", "date": "August 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137207755}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "1. A unique hotel, the only cookie cutter is in the kitchen. Each room is different and therefore the several rooms may appeal to a wide variety of desires. We have been staying in this hotel at least annually for many years..... and quite frankly enjoy it as much as almost any hotel anywhere. In earlier years we had stayed in other places in Ashland, and there are many. But we now just book in at the Winchester. What is not to enjoy with the small afternoon snack delivered to the room, the turn down service, the fluffy towels and all the amenities of a first class hostelry in a true theatre town.", "title": "Perfect...", "user": "NevadaSoulTrain", "date": "August 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137020172}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "2. The hotel is Family run by a very professional team. We have had good suggestions about restaurants, though there is one in the Hotel. The grounds are beautifully landscaped and maintained. We have seen family members setting flower beds in the spring, and the \"crew\" tending them all summer long. Sitting with friends with complimenary coffee in the Gazebo or on the porch in the morning makes catching up with our friends who come from several points of the compass most enjoyable.", "title": "Third visit, still perfect", "user": "Michael S", "date": "August 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136814149}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "3. Restaurant. The complimentary breakfast choices are wide, and one can order additional items. (They do request that you leave a tip for the excellent service).", "title": "All is good at The Winchester", "user": "TravelingDawg78", "date": "August 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136629108}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We had two really good dinners on our last trip, and have found the quality of the cuisine and variety to be amongst the best in Ashland. (As might be expected, there are many Ashland restaurants, but the quality of the more expensive ones is rather spotty.) Tables are suffiently spaced and the room is reasonably quiet so that conversation is possible.", "title": "Charming", "user": "KiraMexico", "date": "July 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 135484610}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We have stayed at the Winchester for years on trips to Phoenix and Palm Desert. Honestly? This was the best stay yet. We stayed in the Robert Gordon Suite in the right building of the property. Fresh flowers, ice, and muffins awaited out arrival. With gas fireplace, and front Living Room (where I write this), the stay was exceptional. But the best of all was the bed. A thick down comforter, sheets that felt like satin, and a pillow that for me was perfect all made this a memorable stop. We will be back and request this room again. Fabulous one night stay.", "title": "Our best stay yet", "user": "grapdad", "date": "February 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152037523}, {"rating": 5.0, "title": "New Year's Eve in Ashland", "text": "We have just returned home from spending the New Year in Ashland. We were last in Ashland in October and knew that we had to come back and spend a day to explore this beautiful and seemingly prosperous town. The Winchester Inn is a three (I think) building B&B with a total of about a dozen rooms - each from what we could gather were, as expected, very unique. We stayed one night in the Barbara Howard room (it was supposed to be two nights but an ugly cold had me turning back home early) and enjoyed it wonderfully. Fantastic bathroom, comfortable sitting area with a gas fireplace that was most welcome and a mattress on our king bed that was simply the best we've slept on. We had dinner New Year's Eve in the Wine Bar and couldn't have asked for a better evening. I understand they are giving the Bar and Dining Room a \"freshening up\" (dining room was going to close after the the 2nd) which will be welcomed but in no way prevented us from enjoying our dinner. Breakfast (which is included) was also very very good. This B&B is perhaps stronger in the kitchen than it is in the lodging. We'll be back!!!", "helpfulness": 1, "user": "Terry C", "date": "January 5, 2013", "id": 148942421}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "Every time I come to Ashland (I'm up to nearly ten visits over the past 7 to 10 years), I stay at the Winchester Inn. Here are a few of the reasons why: great location, amazing accomodations (it's hard not to feel pampered), the most comfortable beds and seets I've ever slept in, extraordinary breakfasts (who ever writis about breakfast?!), an outstanding dinner menu and first class wine list. There's lots to do in Ashland and I sometimes find myself wanting to hunker down and just enjoy staying put at the Winchester Inn.", "title": "Why do I love visiting Ashland?", "user": "Tod T", "date": "January 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148854061}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "Each time I have stayed in the Winchester I notice something newly added to the richness of decor, but somehow done in the most comfortable ways. What has not changed is the incredible standard of service. From a warm welcome upon arrival, to every personal need addressed throughout the stay...its impossible to miss the superior and authentic hospitality offered by the whole staff. The warmth and attention to detail in the rooms, and the comfort of beds and furniture add to a real state of relaxation. The service in the restaurant (as well as the beautiful bar adjacent to the lobby) is swift and professional and always personal, which is the character of the whole experience at the Winchester. One of the best parts is the gardens, and the proximity to the theaters and shops. Well done, Winchester Inn. I can hardly wait to return and see whats next!", "title": "Did I Land in OZ?", "user": "Christie R", "date": "December 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147625470}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "This richly furnished inn is just a short walk from the theaters of the Oregon Shakespeare Festival and a few steps from the tasteful shops and boutiques of Ashland. The inn manages to maintain a feeling of friendly informality wrapped in an aire of dignified elegance. Each room is is individually named and decorated with guests' comfort and convenience a priority.", "title": "A Gem of an Inn in an Oregon cultural center", "user": "Greg G", "date": "December 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147571607}, {"rating": 4.0, "title": "Tomorrow and tomorrow...at the Winchester Inn", "text": "We've gone to the Oregon Shakespeare Festival for several years now, staying in a variety of places, but this year we found the place we'll go back to over and over again. Our room was spacious and comfy, the high bed with steps to climb in was charming, the bathroom clean and functional with lots of room and the breakfasts delicious and more than ample. The one dinner we had there was excellent, comparable to most high end restaurants even in San Francisco, and the staff and owners friendly and very helpful. They became grandparents today and we wish them lots of joy!! It is costly but offers a great deal in return. The only thing I wish they had was a tea or sherry in the afternoon and coffee or tea in the evening when we return from a play. Hope to see you again next year!!", "user": "Shelley S", "date": "September 8, 2012", "id": 139773725}, {"rating": 5.0, "title": "Charming Inn", "text": "We have been going to the Ashland Shakespearean Festival with friends for over 20 years and have stayed in several inns. The Winchester Inn is by far the best. The ambiance of this Victorian inn is wonderful as are the breakfasts and dinners. This family-run inn is well-maintained, and it has won many awards. The only downside is that it has become a bit expensive, but this is true for most Ashland lodging. If you stay or eat there, you won't be disappointed.", "user": "TravelTrekker1", "date": "September 4, 2012", "id": 139392720}, {"rating": 4.0, "title": "Charming Victorian Inn", "text": "Stayed1 nite at the Winchester. Our room was nice but they should think about replacing the stained and dirty looking carpet. Beds were comfy and breakfast was delicious. Would consider staying there again.", "user": "Tom E", "date": "August 27, 2012", "id": 138527092}, {"rating": 5.0, "title": "Update", "text": "When going to the Oregon Shakespeare Festival there is no better place to stay. It is conveniently located less than two blocks from the three stages. the rooms are clean, spacious and luxurious. The staff and the owners are warm, inviting and helpful. The food is delicious and amongst the best in the Ashland with the breakfast being anything you could want. They go out of their way to accommodate. Their dinners are also superb but difficult to squeeze in if you are going to theater. Most of their guests are repeaters. We have been there for more than five years. We also meet some of the nicest people.", "user": "restats", "date": "August 26, 2012", "id": 138470786}, {"rating": 5.0, "title": "Another rave review", "text": "Once again we enjoyed a lovely four days at the Winchester Inn. The rooms are more than comfortable...love the newly renovated bathrooms and the fabulous beds. The breakfasts are delicious and beautifully presented. As mentioned by others....do have dinner at the inn at least once during your stay. Tasty, beautiful and a good value. Don't miss the bar...a most gracious spot to unwind a bit. The bartender is a delight!! All the staff...and the owners...go above and beyond to make your stay memorable. Already booked our visit for 2013!!", "user": "Linda C", "date": "August 14, 2012", "id": 137209897}], "location": {"country": "United States", "city": "Ashland"}, "variance": {"poor": 1, "average": 2, "very good": 17, "terrible": 3, "excellent": 130}, "slim_ranking": 0.289473684211, "description": "The Winchester Inn offers luxury accommodations, affordable excellence, the restaurant features local ingredients with global inspiration, craft cocktails and boutique wines. We are the only Wine Spectator Award Winning restaurant in Ashland as well as the only restaurant with a Certified Sommelier on staff.Pamela Lanier's B&B Guide just announced us as Top Chef of 2012."}