{"user_rating": 4.0, "review_count": 109, "name": "The Desmond Hotel", "reviews": [{"rating": 5.0, "title": "A romantic overnight trip", "text": "My husband and I spent overnight at The Desmond this past weekend.", "user": "BornToTravel", "date": "January 30, 2005", "id": 3100523}, {"rating": 5.0, "title": "The best place I have ever stayed at...", "text": "The stay was so relaxing from start to finish. The front desk staff were very accomodating allowing us to choose exactly where our room was (away from elevators on the fourth floor). The room was very clean and the canopy bed was very nice. We enjoyed the jacuzzi in the pool area however the pool could have been a bit warmer as well as the air temperature. We also used the fitness center which was nicely accomodated for doing some cardio and a few weights. The crab cakes at the Hunt Room were truly \"lump\" and delicious. The atmosphere of the Hunt Room was very relaxing. We also enjoyed the Sunday brunch with cooked to order omelets. Make sure you try their bread pudding with vanilla sauce. They are known for this and it was delicious!! I recommend the Desmond for your next trip to suburban Philadelphia.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "September 9, 2004", "id": 2520703}, {"rating": 5.0, "title": "Best Place to Stay in Malvern", "text": "My husband and myself spent labor day weekend at the Desmond. What a treat. It is a beautiful hotel situated in a quiet part of town with beautiful landscaping. The staff is outstanding and do everything to accomodate you. The food is magnificent, especially the brunch. The rooms are very nice with four poster canopy beds, the hunt room is decorated with fine linen and leather chairs. Everything about our stay was extremely pleasant and will be remembered fondly.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "May 13, 2003", "id": 995065}], "location": {"country": "United States", "city": "Malvern"}, "variance": {"poor": 11, "average": 18, "very good": 35, "terrible": 4, "excellent": 41}, "aka": "Desmond Hotel", "slim_ranking": 0.833333333333, "description": "Welcome to a one-of-a-kind hotel, conveniently located in one of Pennsylvania's most scenic and historic settings. From the moment you walk in, you'll know why guests tell us The Desmond is the best part of traveling. It's a difference you can taste, whether you're savoring fresh seafood and prime steaks in The Hunt Room, fresh Maine lobster in our seasonal Sunset Grille, or relaxing with cocktails, snacks and comfort food in our authentic English pub, the Fox and Hounds. Above all, it's an experience that removes you from the distractions of everyday life, and surrounds you with the quiet pleasures you deserve."}