{"user_rating": 4.5, "review_count": 459, "name": "The St. Regis Aspen Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "Spent the afternoon in Rèmede spa and got drinks in shadow mountain lounge afterwards. The spa treatment was a couples massage. Afterwards my fiancé and I moved to the lobby lounge. The service in the lounge was exceptional. Peter the australian bartender was a great conversationalist and", "title": "Relaxation at it's best!", "user": "Rae004", "date": "February 4, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 151420037}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "talking futbol with Mariano was a great way to end my relaxing afternoon. Thank you everyone who was involved in my tranquil day! I will definitely be returning!", "title": "Outstanding bar service!!!", "user": "Kecabron", "date": "February 4, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 151419951}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Peter and Mariano were amazing bar tenders, pretty hilarious guys. Recommended me some good whisky, I wasn't disappointed with their suggedtion. The waitress Gianella sweetess girl ever, nice smile very polite. Two thumbs up!!!!", "title": "Underwhelmed", "user": "BrendanSpratt", "date": "January 31, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 151089677}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "Myself and my partner stayed here over New Years and for the price we were paying, I was extremely underwhelmed.", "title": "Outstanding Service!!!!", "helpfulness": 1, "user": "Awesome_Dude1", "date": "January 30, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 151060195}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "First the high points:", "title": "wonderful!", "user": "dianemk", "date": "January 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 150890568}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "The St. Regis never disappoints. Everything from our greeting at the airport by Alexandra, the delicious breakfast in the beautiful dining room every morning, and our cozy fireplace room was perfect. One night after dinner we returned to a personal note, cookies and cold milk waiting in our room for us. As fabulous as this resort is--(right downtown Apsen, close to lifts, restaurants and shopping) it's always the people that make it the most memorable. When our group requested a fondue party during our week stay, the beverage manager Kyle McElwain made it happen for us, despite fondue not even being on the menu. Not just once, but twice! Tara Alire provide the most amazing service to us all week long with a smile on her face in the Shadown Mtn. Lounge. She anticipated every need before we could even ask for it! We were so happy at the St Regis we spend over half our nights IN the hotel, rather than dining other places. These people went out of their way to make us comfortable and feel very special during our stay. We will return as soon as possible!! I miss the pillows already.", "title": "Excellent Service!", "helpfulness": 1, "user": "Rowe5", "date": "February 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152988814}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Super staff and service. Excellent location in heart of Aspen. Family friendly. Perfect pool and hot tubs. Great food. Lobby, lounge and bar area are second to none. We had a wonderful experience and look forward to returning SOON!", "title": "St. Regis Aspen Rocks", "user": "Dan R", "date": "February 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152956452}, {"rating": 1.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "We took three rooms at the St Regis (standard, superior, junior suite) for a week of family skiing and it all started so well. Pleasantly met at the airport; quickly shuttled to the attractive hotel; an enjoyable bar snack in the chef’s table restaurant after our long transatlantic flight; and a speedy extensive buffet breakfast the next morning not to mention the splendid Aspen Sports shop attached to the hotel. Unfortunately, with the honourable exceptions of Aspen Sports (who were consistently excellent) and the junior hotel staff who were exceptionally friendly and helpful, everything went downhill fast. Apparently $45M has been spent on the recent refurbishment and my news for the unfortunate investors is that most of this money has been utterly wasted. Whilst the rooms are reasonably sized and stylish they do not meet the needs of their guests. Cupboard space is fine for a short-stay executive but inadequate if you have ski clothes to hang up (and isn’t that supposed to be a major market in Aspen?). A dopey designer might consider the room lighting to be chic and a triumph of subdued style but because there are so few lights (with peculiar and pointless switches) and none overhead it is impossible to read anything. The air conditioning is a masterstroke of stupidity. The thermostat is located 10 cm above the (single) air outlet. Thus, on one side of the air outlet, the bathroom is 15 degrees colder whilst, on the other side, the sleeping area is 10 degrees cooler. Stand near the windows (e.g. to read something) and it is 15 degrees colder. The engineer told us to set it 12 degrees higher than we wanted it. The bed, poor thing, singlehandedly attempts to redress the designed-in dreadful balance of style versus substance. It is one of the most comfortable beds we have ever slept in. Hurrah! Unfortunately, should you visit the bathroom in the middle of the night (the lights will of course turn themselves on and absolutely refuse to turn off for some considerable time) you will bang your shin on the sharp corner of the leather covered bed base. Naturally, the style-conscious part of your brain will consider a bleeding shin a small price to pay for such finely stitched leather and beautiful sticking-out corners… Or perhaps not. You may want to sit on the sofa (what for? You can’t read a book there), but whilst the cushion colours and patterns may be gorgeous, they are clearly meant to be looked at and not used because they are uncomfortable. Unhappily, our junior suite was limited to a single armchair so one of us was reduced to flopping about on the sofa anyway. Stylish but unfit for purpose.", "title": "Stylish. Unfit for purpose. Run by bean-counters to minimise pleasure", "helpfulness": 7, "user": "GLx", "date": "February 21, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 1.0, "sleep": 5.0, "rooms": 2.0, "location": 4.0}, "id": 152717928}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "Once you escape from your dimly-lit room you will be at the mercy of the bean-counters that seem to run the hotel. The hotel has only one non-breakfast restaurant (see separate entry under “the restaurant at the St. Regis,” known as The Chefs Table) so the eating choice is reduced to bar snack or so-called “ultra-fine” dining. Completely hopeless. Two days after we arrived – actually for the next five days - the breakfast buffet was missing (not even a continental half-offering). We had to order everything plate by plate which took 45 minutes because the number of breakfast staff had been reduced. This is wholly unacceptable for skiers who want to get out there. We were told that occupancy was down and therefore changes had been made. The same thing happened in the main bar. Service speed was tortoise. Probably caused by shift patterns incompatible with demand and/or staff numbers being reduced to an “appropriate” ratio for that days occupancy levels allied with customer-hostile working practices (e.g. not allowing waiters to both wait-on and bartend – presumably for financial control reasons, and requiring waiters to trek 200 yards each way for food - which was therefore cold when it arrived). On one occasion I had to cancel a bar order after a 15 minute wait because we no longer had time to drink it!", "title": "A real treat!", "user": "Tennis0720", "date": "February 17, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 152375693}, {"rating": 4.0, "title": "Beautiful resort with iffy service", "text": "Given that the hotel’s rack rate for our rooms averaged circa $1000 per room per night, one might reasonably expect the rooms to be both practical and stylish and to include standard items such as wi-fi and use of sauna . But this is not the case. Wi-fi will cost you an extra $15 a day whilst entering the spa will cost you $50 a day at least (obviously massage etc is additional). What unimaginative managerial bean-counting cretin has invented these silly charges, insisted on inadequate staff ratios allied with bad working practices and not realised that service quality and customers’ experience are extremely adversely affected? Where is the real hotel manager? I never saw one and, although I suspect I may have glimpsed a duty manager once, none of them ever talked to me either in passing or on purpose. What does he or she do? How does he or she know what is going on or what their guests think unless they walk around and talk to people? Has he or she gone AWOL and bean-counters taken over?", "user": "swaffy", "date": "February 17, 2013", "id": 152368276}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "4 nights in Aspen with Dom as your server........#winning! Seriously though great hotel, great location and did I mention that the bar is ......... awesome!!!! Have your drinks drinks served in a copper mug. During your down time go to the nightly sabre presentation.", "title": "The Bar Makes The Hotel!!!", "helpfulness": 1, "user": "addostone", "date": "March 3, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 153570446}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "An outstanding hotel stay starts for me when the front desk day clerk sees me and says my name at check in -- and every single day of my stay-- his name is Andrew. The stay gets better when the butler, Erica, sends champagne and strawberry chocolates to my room -- just because I am me. It gets even better when every morning at dawn the Front door service staff led by Brian accommodate a request to drive and pick me up from scenic sites near by for photographic shoots of Aspen sunrises. The hotel room, recently remodeled is perfect; hardwood floors, great mountain views and I understand some rooms have fireplaces. Never has there been a real live plant in my hotel room bathroom before the St. Regis, a touch of class! Photographs of the plant and room are attached to the review. If you would like to see more photos of Aspen mountains check out my travel blog jdrolle.blogspot.com.", "title": "Outstanding service and world class spa", "user": "JDRolle R", "date": "March 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153505589}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "The absolute best part of this hotel is the Remede spa. I have been to many spas so I really did not believe this one could be different. At first glance I could not see why it is rated as one of the world's best. I booked an appointment for reflexology-- Betty was fabulous; she asked 5 times at the end of the service what else could she do? This was my first experience in an oxygen lounge. The Vichy - 360 degree shower was both invigorating and relaxing. The spa also had a hot steam room and whirlpool but the added features which surprised me were the Vapor cave, which felt great on my lower back, and the Confluence waterfalls. This was my best spa experience -- they made a believer out of me by combining great service with outstanding exotic feature options.", "title": "Everything a luxury hotel should be!", "helpfulness": 1, "user": "BarbiG", "date": "March 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153494860}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "The St. Regis in Aspen is absolutely perfectly located ... a leisurely two-minute stroll to the lifts at the base of Aspen Mountain and all the wonderful shopping and restaurants in the village. Recently, the public rooms as well as the guest suites have been beautifully refurbished and are immaculately maintained; the eclectic elegance is warm and inviting. Without exception, the entire staff is always ready to make your stay at this premier property truly memorable.", "title": "beautiful place", "helpfulness": 1, "user": "gerardo r", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153039516}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "rooms were amazing, beds were very comfy, bar is fun, excelent service, I stayed for 3 weeks and i can not wait to come back.", "title": "The service starts at the front door.", "helpfulness": 1, "user": "Duckyst", "date": "February 25, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 153008591}, {"rating": 5.0, "title": "Loved our experience!", "text": "Loved our experience! The location was great and we did not need a car, the hotel took us everywhere we needed, even though everything is in walking distance. The staff was helpful and went out of their way to meet our needs. The restaurant staff was attentive and helpful with my children. The lobby area was friendly as we all hang out after skiing and had food and drinks. Housekeeping actually straighten up our room besides cleaning it, and replaced all the items we used, even if bottles were half used. They planned all our dinners. A no-brainer of a vacation. We recommended our friends and they spoke to someone in the sales department to plan an event and were also happy. it was nice to go on vacation and be pleasantly surprise by an experience that exceeded our expectations.", "user": "elizabethmiami", "date": "April 1, 2010", "id": 60134541}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "The staff of the Aspen St. Regis was very attentive. The spa was great. The food was great. The accommodations were spectacular. Love the location at the bottom of the Gondola. We skied in from our day to the bottom, only a block or two from the lift. Friday we got a foot of snow and extended our St. Regis visit.", "title": "St. Regis Aspen exceed our very expectations. It was exhilarating!", "user": "Summersdad", "date": "March 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59411693}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The St. Regis has the right location, close to Ajax mountain and the city central. It was easy walking distants to any place in Aspen. The hotel, restaurant and lobb/bar area are beautifully appointed and we enjoyed sitting by the fireplace after a long day of skiing. The deluxe room was small and maybe next time we will upgrade to a suite. One thing we enjoyed was the terrific view of Ajax mountain from our bedroom. The outside hot tub wasn't hot enough, maybe because it was heated by a solar panel? Overall we really enjoyed our stay at the St. Regis Aspen and I give the housekeeping service an A+ for preparing our room both day and night. I'm not a big fan of allowing pets.", "title": "Aspen Skiing Vacation", "user": "PrivateJetCa", "date": "March 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 58167552}, {"rating": 5.0, "title": "Try it", "text": "One of the very best hotels in the US. The service is beyond compare", "user": "TomStocker", "date": "February 27, 2010", "id": 57268661}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled solo", "text": "I stayed at the St. Regis for three nights - Feb 19th to Feb 22nd, 2010. I can say in all honesty that my entire experience there was exceptional. The service is over the top, the rooms are beautiful, and the staff was exceptionally friendly and helpful. I was there for a short winter ski vacation. It is not a ski in/ski out hotel but you can either walk the short distance to the nearest lift or a ski valet will drive you there in comfort. It's about a 1 minute drive. The ski valets compensate for a lot of the inconvenience of not being right on the slope. They wax your skis and warm your boots at night and have them ready for you in the morning. Minimal hassle. I also loved the uncrowded outdoor hot tubs, which come in handy after a day of skiing. The Spa is nice but somewhat small in my opinion.", "title": "Absolutely the best!!!", "user": "Drink_The_Koolaide", "date": "February 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57164558}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We had last stayed at this hotel 14 years ago when it was the Ritz Carlton and found the facility in pristine condition after all these years. With our Starwood platinum membership, we were upgraded to a magnificent executive suite with a nice view of the streetscape and the mountains. The only complaint we had concerns the pool facility. The weather was beautiful and there were not enough chairs on the pool deck to accommodate the number of guests. The pool staff was inattentive (to say the least) and left guests to fend on their own. The pool is not large and not designed for lap swimming and, in addition, was overrun with screaming children who were dive-bombing into the water with oblivious parents on the sidelines talking on their cellphones. The pool staff also paid no attention to the fact that the children's antics interfered with swimmers and with guests in lounge chairs who were frequently splashed as a result of these activities. Obviously, the swimming pool is not a highlight of visiting Aspen so this may be of little consequence. However, if you are looking for an adult resort, this is not it.", "title": "Beautiful but too kid-friendly", "helpfulness": 1, "user": "DCRE", "date": "August 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73742555}, {"rating": 5.0, "stay_parameters": "Stayed July 2010", "text": "Had a great weekend stay July 16-19th.", "title": "Had a great weekend stay", "helpfulness": 1, "user": "Astroph", "date": "July 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72075511}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We were \"upgraded\" from a Deluxe 2 double bed room to a Grand Deluxe, which is just an upgrade to a mountain view.", "title": "Near Perfect Stay", "user": "JamesR36", "date": "July 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 71922013}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "The staff was very friendly and the service was excellent. The trail mix must not be an SPG Plat welcome gift, but a general welcome gift for the room. There was a ton of stuff going on in Aspen during our stay: Free music on top of the mountain, art festival, farmer's market, and the Aspen music festival.", "title": "heavenly", "user": "sparita", "date": "July 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70760504}, {"rating": 1.0, "stay_parameters": "Stayed July 2010", "text": "The free car service was a great way to get around town. Some of the music festival's concerts were about a mile away and the car service was a very convienit way to get around. The driver was very friendly and picked us up within 5 minutes of placing a call. I might even take the time out to call the hotel and thank them for the great service provided by the young driver.", "title": "Great location with walking to town and...", "helpfulness": 1, "user": "jerryfmd", "date": "July 8, 2010", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 5.0, "service": 2.0, "rooms": 1.0}, "id": 70138112}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "Butler service and ride service satisfied me.", "title": "Beautiful Hotel", "helpfulness": 2, "user": "Nosda", "date": "January 23, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 150459253}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Our stay over New Year 2013 was just lovely. The St Regis Aspen is a true 5 star hotel. The rooms are great and the skiing and proximity to the hills and Aspen town is fantastic. Loved the hotel and service. Ski shop folks were so helpful. Only complaint is that the cleaning staff constantly walk in your room. We are on holiday - do not disturb sign on or newspaper at door not picked up yet. Why is that such an issue at this hotel? Otherwise, this hotel is great and would happily stay here again.", "title": "Spa Review- not hotel", "user": "NYCLizzie", "date": "January 23, 2013", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 3.0}, "id": 150429970}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Every year I'm in town I spend some time at the St. Regis, and in particular, the spa. It's a beautiful setting and the therapists are excellent, but I have to say I was disappointed this year. My treatments were great, but when I went to use the waterfall pool, it was too cold to stay in. It had been heated, but not much and definitely wasn't the relief from the cold weather that it had been in years past. The ladies' hot tub was fine, but the steam room wasn't working either. There was no indication that anything wasn't operational when I arrived, so this was all trial and error. When I spoke to the staff up front, they said their engineers were trying to fix a problem with the steam room, but no offer of coming back to use the facilities when they were fully operational was made. I went to the oxygen room and asked for a glass of champagne, only to be told they were out of champagne. I was very skeptical that the St. Regis in Aspen was cleared out of champagne, and when my friend questioned it, two glasses were produced. When I picked up the car, it stank of cigarette smoke. No one outside at that time was smoking, so I can only assume it was someone who had had the car while it was parked or being moved. Normally, this spa is a highlight of my trip and worth every penny, but next time I'll be calling in advance to make sure everything is working and stocked before I book.", "title": "Upgrade your ski vacation", "helpfulness": 1, "user": "UrbanVenturer", "date": "January 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150120301}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled solo", "text": "This is a very nice hotel. It’s close to all the great Aspen restaurants and shopping. We had a terrific stay here. The staff was attentive and very friendly. I would definitely recommend this hotel to anyone who wants the finer things in life as well as a great Aspen experience.", "title": "This is a very nice hotel", "user": "LorieH", "date": "April 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 62795385}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "The St. Regis made our trip to Aspen most enjoyable! From picking us up at the airport to having our skis ready every morning, St. Regis made our stay the easiest and most hassle-free ever. With a 6 and 8 year old, we were concerned that the St. Regis would be a bit \"stuffy\". But this was totally not the case. The staff and atmosphere was extremely family friendly (even getting a teddy bear from Mr. Ben Mollere). We will be back and highly recommend this incredible town and hotel.", "title": "Best place in Aspen for Family and young kids!", "user": "AdventureCO", "date": "April 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60941872}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled solo", "text": "Spent two night at St. Regis Aspen in February. I booked early on the website and got almost a 50% off deal, but still I didn't think it was worth that price I paid for. Before checking in St. Regis, I spent four nights at The Little Nell and had to say The Nell beats St. Regis in every aspect.", "title": "Not Impressed", "user": "babygenius", "date": "April 7, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 60613767}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "The Nell is pretty much in the center of the town and where all the actions take place, St. Regis is a bit tucked away, but still good walking distance to everything in town. They did not have enough bell men at the front door, sometimes I did not see anyone at the door at all which is very odd.", "title": "All you need for your vacation", "user": "FreqTravelerDC", "date": "April 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 60602347}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "I arrived a bit early on my first day, probably around 2 pm and was told that my room was not ready. The front desk put down my cell number and told me that they will call me once the room is ready. Since I did not like sitting in the lobby doing nothing, I told the front desk that I'm going to the spa for a maniure.", "title": "First Class", "user": "trcarter1", "date": "April 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60139110}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Ski vacation to AspenSnowmass. Resort was about expected for 5-star hotel.", "title": "Aspen Snowmass", "user": "theMunchies", "date": "January 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 150021609}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "PRO:", "title": "Beautiful hotel with great service.", "user": "EJLJS", "date": "January 17, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 149878983}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "- Great room. Had a room upgrade and a great view of the mountain, courtyard, pool.", "title": "One of the best places to stay in Aspen", "user": "Tokyowife", "date": "January 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149814410}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "- Bathroom under-sink lighting is motion-activated. Great idea - just enough non-direct light without blinding you awake.", "title": "A Big Downgrade From Our Past Visits", "helpfulness": 1, "user": "mintchip17", "date": "January 11, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 149463964}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "- Location is walking distance to shops and restaurants.", "title": "A Few Things Kept This Stay From Being Perfect", "user": "butkusr", "date": "January 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 149339169}, {"rating": 4.0, "title": "Great resort, could be even better if you ban smoking on premises", "text": "All of us want to make a great 1st impression. Our 1st impression of St. Regis was when we drove up, with 2 small kids in car, to find 2 people smoking by the valet parking area. It was a major turn-off to think of unloading our car and our children into toxic cigarette smoke.", "helpfulness": 1, "user": "Lincoln888", "date": "June 17, 2010", "id": 67787110}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "The rest of our stay was great, and we would consider returning, but would also explore other Aspen resorts with a strict non-smoking policy.", "title": "Great town, hotel is worth a discounted stay", "helpfulness": 1, "user": "bigblue6276", "date": "June 16, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 1.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 67692778}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "The hotel is nice, but would not be worth the full price. I needed to check out one day early for a 5 night stay and they would not refund the last night's stay, during off-season. It took arguing to allow me to use the last night's stay towards incidentals.", "title": "Great staff in perfect Aspen location", "user": "lauragreenstreet", "date": "June 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 67073913}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "The Hotel was great and the staff was amazing. We also brought along our dog and they were great to her as well. They only thing I would say is that people who arent staying at the hotel frequent the pool and take the best spots. I hope they get a handle on this quickly as we are thinking about making another trip up this summer, but this would make us choose another hotel.", "title": "Truly 5 star", "user": "muhnshine", "date": "June 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66340702}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We just got back from a relaxing weekend in Aspen and the St Regis made our trip. From the moment we checked in we felt like family, everyone was so nice and willing to help. Our room had the most amazing view of the mountains and the 24 hour pool area. My favorite part about the room was that the windows opened so you could enjoy the fresh mountain air, my second favorite part were the amazing bath products.....love the Remede spa. Speaking of spa we had a couples massage and finished with a glass of champagne in the oxygen lounge - does life get any better. The restaurant was also great, we had dessert and breakfast, the staff was very friendly, service was perfect and the food and mouth watering. Truly 5 star service, best hotel in Aspen and cant forget the starwood points, the best!", "title": "Our favorite place to stay in Aspen, by far", "user": "FredandGlenda", "date": "May 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64047738}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "I was very lucky to stay for 6 days at the St Regis Aspen Residence Club in December! From accommodations to staff, I felt like a Queen! If you want privacy on vacation, this is it! I was able to come and go incognito. The bedroom fireplace with auto shut-off, the huge Jacuzzi tub, steam shower, heated floor, I could go on and on. The new Food and Wine Restaurant was magnifique!! Lamb carpaccio, the steak, the champagne, the list goes on. The 3 snow rimmed hot tubs were used every night-loved the heated towels. I cooked a fabulous meal in the well equipped kitchen or I went to some fine dining within easy walking distance. I loved my stay, thanks staff and Starwood!!", "title": "Now this is the very best!!", "user": "Crazy Mimi", "date": "January 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 149307154}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Our trip to Aspen during Christmas week was absolutely fabulous.", "title": "Ab Fab'", "user": "DenverMcSwains", "date": "January 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149186381}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The St. Regis Hotel takes your vacation to a whole new level. Our room was probably the nicest room we have ever stayed in, The outdoor jacuzzis were great after skiing, the level of service, the super friendly staff, and the location right in down town Aspen was perfect. We could walk everywhere! We had a magical two days in possibly the most beautiful place in the world! Thank You St Regis.", "title": "Gorgeous property, Amazing Bulters and Valets, stay away from their breakfast place called Buttermilk", "helpfulness": 2, "user": "spgISLANDtraveler", "date": "January 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149183449}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Check in was flawless as the valets and butlers really make the property. Very clean and simple check in, and great room, property, etc- as expected with St. Regis. We were there over the holiday and New Year's Eve for 6 days. Great redesign and it shows.", "title": "Kid friendly, high quality mountain resort", "user": "KCB0930", "date": "January 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149106845}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "My biggest complaint however was the Buttermilk Restaurant (only breakfast area on resort). While the team members were genuinely nice and hard workers; you could tell that the Regis had not trained them well and they were there to handle the large amount of travelers for NYE. When paying the ridiculous rates you do for mediocre buffet food you expect to not have to ask to refill your coffee and water, ask for new forks, etc. It should just appear, but it never does and we ate there for 5 days (again only place to dine in the morning). It was flat out abysmal and a huge downer to our vacation. Plus the buffet was always terrible selection of very few items. The service members really did try their best so don't want to bash their attempts, but they clearly did not do this job on a regular basis.", "title": "Perfect location, great service, stunning updates", "user": "AdventureSeeker54", "date": "January 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148695430}], "location": {"country": "United States", "city": "Aspen"}, "stars": 5, "variance": {"poor": 25, "average": 44, "very good": 69, "terrible": 17, "excellent": 304}, "aka": "The St. Regis Aspen Resort Hotel", "slim_ranking": 0.166666666667, "description": "The lavishly renovated St. Regis Aspen Resort offers a luxurious spa; world-renowned winter sports like skiing, sledding, and snowboarding; fine dining; and impressive event spaces in Colorado."}