{"user_rating": 4.5, "review_count": 136, "name": "The Notchland Inn", "reviews": [{"rating": 4.0, "title": "Old World Charm", "text": "The Notchland Inn in the White Mountains takes you back", "helpfulness": 4, "user": "scudder5", "date": "July 3, 2006", "id": 5420534}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "in time. The house has so much history and has been kept", "title": "Just as good the second time", "helpfulness": 5, "user": "New-England-wanderer", "date": "March 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4579462}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "ioriginal for the most part. The two Bernese Mtn Dogs, Crawford", "title": "Perfect Retreat", "helpfulness": 2, "user": "Carson10", "date": "October 24, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4048837}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "& Abby are a joy to be around. The owners & staff are very", "title": "This is what a B&B should be - excellent!", "helpfulness": 12, "user": "TravelBuff", "date": "October 15, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4024915}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "accommodating. You need to se this 1800 mansion and enjoy", "title": "Romantic Country Inn", "helpfulness": 8, "user": "Bill P", "date": "July 15, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3670715}, {"rating": 5.0, "stay_parameters": "Stayed June 2007", "text": "We had a lovely stay at the Notchland Inn. The staff were great, the dinner was sublime - and they offered seconds on the desert!!! The location is great for hiking and stargazing. We enjoyed watching the birds from the dining room. We can't wait to return ...", "title": "Loved the Notchland", "user": "shemoves", "date": "July 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8247685, "likes": {"liked": "— Wood burning fireplace in room, meals, location, birdwatching", "disliked": "— 1 small hot tub"}}, {"rating": 4.0, "title": "Had a nice Birthday weekend", "text": "The only downside to our vacation is that we forgot our camera and could not take picutres...", "helpfulness": 2, "user": "DemisGrammy&Grampy", "date": "February 7, 2007", "id": 6753243}, {"rating": 1.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "My husband and I stayed at the Notchland quite a few years ago for my birthday. We loved the location and the area. The staff was great, the dinner was different and delicious and we enjoyed having a \"real\" fireplace in our room. I also liked the fact that they recycle etc... The only disappointment that we had was not being able to take a sleigh ride. I can't remember if there wasn't enough snow or they no longer did this. The outside hot tub was nice, but a little too HOT!! We would definetely go back and stay.", "title": "Wedding Comments", "helpfulness": 7, "user": "lnmoneypit", "date": "January 24, 2007", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 5.0, "service": 1.0}, "id": 6687003, "likes": {"liked": "— beautiful setting", "disliked": "— rude staff/mediocre food"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We were guests at a wedding at the inn on January 20,2007. We did not stay at the inn. The inn is in a beautiful setting and is very nice. Very clean and well maintained. However, I would not recommend the Notchland Inn to anyone. We were treated very rudly by the woman who seemed to be in charge of the arrangements. (I do not know her name) During the dinner, the doors to the private dining room we were in were closed by the staff. It began to get very cold in the room and one of the guests asked if she could keep the doors open as we were very cold. She told us she would only keep the doors open if we kept our voices down...that there were other guests celebrating things as well. I understand that, however there were only 11 guests at the wedding and we were not by any means overly noisy during the dinner. We were all astonished by this. None of us had ever been treated like this, especially at a wedding.", "title": "One of our very favorites", "helpfulness": 3, "user": "MrArtie", "date": "October 24, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6008231}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The ceremony was very nice, and the owners very pleasant. Didn't see them again after the ceremony. Dinner on the other hand was a disappointment. The wedding ended at 5:40pm. We were ignored until approximately 7:50pm. We snacked on the jar of pistachio nuts from one of the sitting rooms! The service was very slow. Did not finish dinner until around 9:30pm. Sometimes 20-30 minutes between courses. And the food was average, nothing special and very small portions. (The best man went out to get pizza as soon as dinner was over!) I realize when such a big party stays at an Inn, they can be noisy. As I said, we did not stay at the inn the previous night and do not know how loud the wedding guests were that night. Regardless of what happened the night before, there was no reason for the staff (mainly one woman) to treat us the way we were treated. I only hope the bride and groom remember the ceremony and not the treatment of their guests. We left very shortly after dinner and will not return to the inn. Had it not been for this, we would have considered a stay there. Instead we will recommend other beautiful inns we have stayed at to our friends and steer them away from the Notchland Inn. LN and JS", "title": "Excellent for a Relaxed Break", "helpfulness": 2, "user": "Creamegg", "date": "October 24, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6005178, "likes": {"liked": "— Fabulous five course evening meal", "disliked": "— Tiny bathroom in Jefferson"}}, {"rating": 5.0, "title": "Winter Wonderland", "text": "My husband and I spent two nights at the Notchland in the winter of 2002 and it was the MOST relaxing time we've had in years. We have two small, active boys and the time away was just what we needed! We used one of the suites with a fireplace and jacuzzi tub and the food at dinnertime was exquisite! We only wish we could have stayed longer. We have little free time, but someday we WILL be back:) Kristyn", "helpfulness": 7, "user": "A TripAdvisor user", "date": "June 2, 2003", "id": 1033961}], "location": {"country": "United States"}, "variance": {"poor": 2, "average": 5, "very good": 23, "terrible": 3, "excellent": 103}, "aka": "The Notchland Hotel Hart`s Location", "slim_ranking": 1.0, "description": "Get away from it all, relax and rejuvenate at our comfortable 1860s granite mansion in the midst of the White Mountain National Forest. Settle into one of sixteen spacious guest rooms, individually appointed and all but one with wood-burning fireplaces. Notchland's wonderful 5-course dinner and hearty country breakfast are served in a romantic fireplaced dining room. Hiking, biking, swimming, skiing, kating, antiques, crafts and outlet shopping are close at hand. Notchland ... a magical location."}