{"user_rating": 4.0, "review_count": 88, "name": "The Old Malt House", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "Travelled to Bath for the first time to transfer our son to Bath University, which went well and Bath was wonderful", "title": "Disappointed", "helpfulness": 1, "user": "Family077", "date": "September 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 81164503}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We stayed for 2 nights £110 per night for 1 room for 3 people (2 adults and 1 teenager)", "title": "only 2 star more like 4 star", "helpfulness": 1, "user": "truck7", "date": "September 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80324848}, {"rating": 5.0, "stay_parameters": "Stayed September 2010", "text": "our other son had his own room for an additional £60 for 1 night £280 in total with the evening meal costing around £70 plus £9.50 for 5 drinks (glass of wine, 1 pint of bitter and 3 soft drinks)", "title": "A little gem hidden in the somerset countryside.", "helpfulness": 1, "user": "Judecupid", "date": "September 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80121305}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "This hotel has a definate Guest House feel to it.", "title": "Excellent value for money", "helpfulness": 1, "user": "scarymum", "date": "September 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 79276719}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "6 mile outside Bath which is ok as it is very easy to get to Bath and parking was very good once in Bath centre. The staff were very nice and friendly.", "title": "Great place to stay", "user": "Trp2001", "date": "September 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78458578}, {"rating": 1.0, "stay_parameters": "Stayed August 2010", "text": "Arrived at the hotel at 1.30pm as had to atttend a wedding at 2.30pm at nearby Priston Mill, walked into reception to find very unfriendly Jen, who informed me I had to pay £5.00 to get my room key as I was half an hour early to check in, told her I just wanted to put my bag somewhere, she just told me to put it in one of our families rooms. 10 minutes later got the key to my room, as my family had just spent about £500.00 on a meal in the hotel restuarant the night before, which was really bad I thought this was a liberty. The people who run the hotel have no idea about customer service. The location was good as it was near the wedding venue. The rooms were clean and quite big, the gardens were very tatty and the whole place needed a spruce up. Would not be going back.", "title": "terrible", "helpfulness": 3, "user": "kazled", "date": "August 3, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 73546231}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Well where shall I begin! arrived at hotel where we had a large family meal for 15...food came up steaks overcooked,salmon pesto with sundried tomatoes unrecogniseable....starters not too bad for some people,rooms are clean,but the place itself is looking run down,cigerettes in the ashtrays outside not emptied from night before...weeds and like around the main entrance not very good first impression,wires out of the sides of the hotel which should be covered up,garden furniture out of the 60's needs updating....but wait for it!!! the bacon sarnie...last breakfast of stay my husband asked for bacon sandwich and what came up was 2 pieces of bread which was stale , not even cut the sandwich in half and inside ....its getting better! was half a slice of bacon cut up into little pieces to spread around the slice of bread!!!! my husband left it and that was our last morning there.....we would not be returning...really needs a spruce up and someone in the kitchen that knows what a bacon sarnie is!", "title": "The worse bacon sandwich in the world.", "helpfulness": 1, "user": "micheymich", "date": "August 2, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 73483402}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "We booked a number of rooms for our extended family to stay overnight following a family wedding at nearby Priston Mill. The ages of our party ranged from 23 -88. Our needs were fully met as far as the deployment of the rooms was concerned - adjacent ground floor for the elderly members of the party being essential. Our hosts cheerfully greeted us and were amenable to a number of last minute adjustments. They did not charge us for early arrival as they could have done. The rooms were clean, modern and well-appointed. Excellent service and a delicious breakfast. The location of the hotel is delightful and I would certainly consider returning for a leisure break in the future.", "title": "An outstanding place to stay for all ages", "user": "debandrich", "date": "July 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69366456}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "During holidays, tours and cruises you always become aware of a person or group determined to complain no matter how they have been treated. This situation is also evident on Tripadvisor as some reviews for this hotel amply demonstrate.", "title": "Exceptionally helpful", "user": "darby_and_joanRugby", "date": "June 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 67808021}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Our experience was such that it was difficult to believe that these bad reviews were about the same hotel. Let me give but four examples.", "title": "Lovely location - friendly staff - good food", "user": "bobton", "date": "June 12, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 67267903}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "This was my 3rd stay this year at the old malt house and it is a very pleasant hotel. The rooms are clean, comfortable and well sized, with freeview available on the TV. The only downside (no fault of the hotel) is getting a mobile phone signal, 02 and Vodafone both don't work anywere in the hotel. Food is fine and staff helpful. Can't argue with the value for money of this hotel. Will keep staying when ever I am in the area on business.", "title": "Nice friendly hotel", "user": "eddie8105", "date": "August 22, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 76277520}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We have just spent the weekend in this lovely hotel. Jen and David are the perfect hosts and nothing is too much trouble. The room was light and very spacious with a lovely view. The whole hotel is spotless and the food both at breakfast and evening meal is first class.This is a very peaceful location off the beaten track although all amenities including Bath are nearby. We cannot understand some of the cruel reviews about The Old Malthouse.If you have any doubts, ignore them and enjoy a perfect stay in this lovely homely hotel!!!", "title": "PERFECT PEACEFUL GETAWAY", "user": "carrs5963", "date": "August 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75595529}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Simon and Jan 15th August 2010", "title": "Peace, quiet and very good service", "user": "Tony Bonser", "date": "August 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 75073451}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "Having just returned from a three-day stay at the Old Malt House, I am pleased to recommend it without reservations. The room was clean, spacious and comfortable. The bed gave us both three very good nights' sleep and the view, of fields with five horses, were lovely. The staff were very friendly and the food excellent. Although our room overlooked the road, what little passing traffic there was did not disturb us in the least. It is a little off the beaten track - a positive benefit for us, and we found the park-and-ride service into Bath very convenient (especially as, with Senior Bus Passes, it was free!) Directions provided by the hotel to other places of interest were totally accurate, though this is the sort of country we could happily get lost in. We shall return.", "title": "Well run and punches above its weight", "user": "steamer51", "date": "August 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 74626485}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Management efficient, helpful and welcoming. Very quiet location. Immaculate comfortable room. Restaurant above average for a hotel of this size. Look forward to return visit", "title": "friendly family run hotel with great breakfasts", "user": "julieparker5", "date": "August 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 74081615}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Stopped over the Easter break (3 nights). Strange experience. We arrived on Good Friday at just before 2.00. We knew we couldn't check in until after 2.30 but presumed that the hotel would be open and we could have a drink and lunch first, however, when we arrived the gates were closed (not the most welcoming first impression). There was also a notice up saying the bar didn't open until 6.00 pm. We were not impressed as our confirmation of booking said the bar opened at 11.00 am and we were expecting a nice country hotel/pub where we could sit outside in the sun and enjoy a drink/lunch.", "title": "Mixed Review", "helpfulness": 3, "user": "Cakesy", "date": "April 26, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 2.0}, "id": 105546580}, {"rating": 2.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "On a positive note both Jen and David were extremely pleasant, friendly and helpful (as was a barmaid also named Jen) and David went out of his way to print us off information on places to visit in the local area. Our room (room 10) was spacious and spotlessly clean, bed/pillows were comfy and room had everything we needed. Bathroom was also spacious but shower was a nightmare (either scalding hot or freezing cold - which changed every few seconds). David did tell us that our room was next on the list to have the bathroom refurbished and in particular the shower updated. At the moment the shower is extremely dangerous and people can easily scald themselves (as we did!).", "title": "Nice Hotel shame about the service", "helpfulness": 5, "user": "Hoakum", "date": "April 20, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 104798918}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "Dinner the first night was a disaster. You order in the bar and then get taken through to the restaurant when your table is ready. We had booked a table for 7.00 - our starters arrived at 8.00. When we were taken through to our table there was no cutlery for the starters and the wine wasn't on the table either (we had to ask for that - you would think an hour would give them plenty of time to get it ready!). We had ordered a bottle of white Pinot Grigio and were served red Rioja, although this was changed straight away. Food was ok. The second and third nights we ordered food at 6.30 and it was ready for 7.00 but then the hotel was much quieter. (David was very apologetic for the delay on our first night. We were told that we had to wait so long because the chef was a student and she had never catered for this number of people before). David did inform us that he felt she needed to learn how to cope in that situation, which I was not impressed with. Surely the priority is that guests come first and someone should have helped her out. The main chef was apparently on holiday and it may be that this situation would not normally arise if he was there.", "title": "poor value-dissapointing", "helpfulness": 2, "user": "mashersmob", "date": "March 7, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 99310968}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Easter Saturday we arrived back at the hotel at about 2.00 and again the gates were closed (although I opened them so we could get to the car park). We then walked to Timsbury to try and find somewhere for a drink/lunch. Timsbury is a pleasant 1 mile walk away (although uphill going). We found what we presumed was the only pub (Guss and Crook). Do not go there, it is a complete dump. Several locals came into the Old Malt House on a night and they both recommended the Severn Stars in Timsbury (situated on North Road (B3115), postcode BA2 0JH). They said it is very popular and does good food although unfortunately we did not have chance to visit it.", "title": "Highly Recommended!!", "helpfulness": 1, "user": "Ge0rgina66", "date": "October 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85174848}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Our main disappointment was the fact that the hotel is closed during the day. Although Jen and David would have been happy to serve us a drink from the bar if we asked (and they did when we first arrived) you feel like you are being a nuisance when the place is quite clearly closed (although I must stress that was how we felt, they never made us feel that way).", "title": "Old England at its Best", "helpfulness": 1, "user": "malmar2609", "date": "September 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 81649648}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 11, "average": 9, "very good": 22, "terrible": 5, "excellent": 41}, "aka": "The Old Malt Hotel", "slim_ranking": 0.57}