{"user_rating": 4.5, "review_count": 1070, "name": "The Breakers", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "A colleague has been raving about The Breakers so she was thrilled when I had an opportunity this summer to be in Florida for an architect's convention. My husband and I extended our professional commitment stay to include The Breakers. We are now believers! It has impressive presence, beautiful interiors, well kept grounds, multi swimming areas and right by the beach. We felt very comfortable and the staff is friendly and helpful without being too hovering. Mr. Ponce who is the unofficial historian of the hotel is very much part of its history. He is 93 years young and gives a once a week tour of the hotel and grounds. If you are in Palm Beach for any reason, anytime, stay at The Breakers. We plan to return again and again.", "title": "Grand but down to earth", "user": "Global-Architect", "date": "October 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 83241180}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "Went to a conference at this hotel. What an awesome experience. Breathtaking views of the ocean, exception service, the beds were better than home, food was outstanding, the pool area was unbelieveable and rooms were large and I could fit the large rollaway in the bathroom it was so large. The entire hotel, from lobby to the rooms was decorated so nicely (look at the ceiling in the lobby). The staff treated you like royality. Expensive, but worth every penny. A must stay at least once in your life. You won't be disappointed.", "title": "An awesome experience", "helpfulness": 1, "user": "Richard0076", "date": "October 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 83184278}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "The Breakers is a stunning property and I had a great experience staying there. My room was amazing and had a partial waterview. What I didn't like:", "title": "Almost perfect", "helpfulness": 2, "user": "TeamCS", "date": "October 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83035895}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "only one of the three hot tubs was actually hot and functioning, and it happened to be the one next to where senior citizens were doing water aerobics", "title": "I wish I could get used to this!", "user": "kinderfam", "date": "October 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 1.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82215617}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "the options for breakfast are limited to a full service restaurant in the main building and an overpriced \"cafe\" inside the news stand with a poor selection", "title": "Absolutely wonderful", "user": "wendiEssex", "date": "October 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81957549}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "Was there for a seminar, so the price was reasonable for the level of this hotel at $175 per night. Someone in an earlier review said the food was not so great. I have to disagree. Food was not bad at all. Every night, i took advantage of the $35 for 3 course summer special that they have at most of their restaurants. ( Echo, flagler steak house, sea food bar, italian, top of the point). If you stick to that, then you can have an affordable dining option. If you are picky and dont find anything in the summer special, then make sure you have a good limit on your credit cards cause the tag will go up very fast. At the Steak house, the soup/filet/dessert that you can have for $35 goes for like $80 if you pick the same a la carte. As other said, grounds are just fantastic, and the staff is of the highest quality. They really make you feel like you own the place.", "title": "The best money can buy", "helpfulness": 1, "user": "djbob", "date": "September 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78176539}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The beach is nice, but since i only had one hour per day to enjoy it, i cant make the most detailed review about that part. Since we were right between hurricanes Danielle and Earl, beach was closed for swimming for most of my stay, due to dangerous rip currents. Not sure if this is current for this place. If it is, then i guess it is a factor to consider for families who want to mostly enjoy the beach.", "title": "Fabulous Place", "user": "parisgirlnj", "date": "September 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 78160645}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "|As for drinks around the pool, they are the most expensive i have seen, probably ever. Average drink is like $14 a piece. With automatic 20% tip and tax, must come to around $18 each. Way too expensive for me.", "title": "The Best of the Best", "user": "seasideboston", "date": "September 2, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 77972101}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "In the end, when you go to Best Buy, there are $1000 tv's, the a few more at $1200, then a few more at $2000, then one at $6000 just for the ones who want to enjoy the best, regardless of the cost. I guess that what Breakers is there for. Just to have an idea of how expensive it can get when you are not in the off season having special seminar pricing, i went to try and check prices for the other end of the spectrum, around christmas. As of today, a regular room with one double bed during the week of between christmas and new years day runs for $1080 per room PER DAY. That is not for a suite, that is for their cheapest room. You can try for yourself. That says a lot about what kind of people can afford this place.", "title": "True 5 Star Hotel for the Entire Family", "user": "Hangerguy", "date": "August 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77755380}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "That being said, if pricing is no issue, or you can go in off season, this place is tough to beat.", "title": "Nice Place to stay But....", "user": "highmain", "date": "August 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 77525131}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The hotel is really grand and beautiful. The staff members are attentive and helpful in every area.. The hotel attracts a very mixed bag of visitors, many families, people of all ages. The restaurants that we dined in were teriffic. Our room had a partial ocean view and was nicely appointed, but a bit small. My only complaint was that the walls are thin and we could hear conversation and TV in the room next door. Our neighbors were early risers, therefore so were we.", "title": "beautiful", "user": "kyamin", "date": "October 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 83864036}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "I would love to go back again soon.", "title": "Might come back, but not sure -- a mixed bag", "user": "ivanciment", "date": "October 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 83753299}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "I agree with previous review that Chef Adriano makes some of the best omelettes of any hotel buffet. We liked: lots of pools, pretty grounds, easy to get to from the airport and the rest of Palm Beach, the Circle room for breakfast, friendly lifeguards and pool staff; sunsets from the patio at the lounge on the concierge floor. Now to other comments: We stayed 4 nights in two adjoining rooms on the concierge floor facing west with 2 small children. The views facing west are excellent and the rooms are larger; the ocean-facing rooms on that floor are rather small and you don't really see the ocean that much from them. Our adjoining rooms were rather different. One was green with carpet and had a sofa (and we really liked the decorating in this one but alas the room had two doubles and the king bed was in the other room), the other was in tile and no sofa. Rooms are in the same category and shouldn't be. So I guess if you're in a room and don't like it, make them show you another one. Both rooms were a bit dark in the mornings as they faced west and the windows are shuttered and not that large. This is a very large hotel with about 550 rooms; it is best to stay on the concierge floor unless you want to be anonymous. When we were there, the pool heating was out and this was a disappointment with small kids. It was scheduled maintenance and nobody warned us before coming. Fortunately, on most days the sun heated up the pools to the extent that in the afternoon it wasn't bad, but it was about 85 degrees outside and in the winter this would have been a disaster. Food and beverage was decent but not outstanding at dinners. Top of the Point restaurant's desert menu was so boring that we didn't order anything from it. Much more exciting to us was Cafe Boloud at the Brazilian Court hotel. However, I should add that the hotel's gourmet room was closed the week we were there. Some of the portions of things we ordered, such as grilled mahi mahi sandwich at ocean grill, were really small and we didn't feel the value. I didn't like that it took nearly 10 minutes to walk from our hotel room to the pools. We felt the hotel favored conventions over independent travelers. We had one major complaint and it matters how it was dealt with: I came via Amex Platinum. We didn't get upgraded as hotel was full when we arrived. The Platinum benefit includes continental breakfast. We were on concierge floor so we get that anyway as we paid for that. So I said give us the upgrade to the full breakfast in the Circle Dining room which costs an extra $10 per adult / $5 per child so that we could at least get some value from the basket of amenities offered through Amex. Normally, Amex Platinum customers get full breakfast, by the way and this hotel gives one of the lowest allotments for this amenity of any hotels in their program. I asked for this at the front desk on the first morning of our trip. They said they would get back to us. They didn't. The night before checkout, I saw the charges still on the bill for all the days and it came out to close to $100 over 4 days. I again went to the front desk; they said nobody had followed up. Then he went to a manager and the manager refused. The next day at checkout I complained again. They still refused but said someone would call me. Somebody actually did and told me they agreed with my request, especially since the pools weren't working, and said we would be credited for the extra breakfast charges. The person said repeatedly they want us to return. So I guess that onsite, their managers could do a better job of resolving these kinds of minor items in favor of the client and leaving them with a much more positive feeling about the property, but in the end the manager who followed up over the phone made the right decision. I would prefer a bit of a smaller property -- this hotel has created a \"club\" and a lot of the weekenders at the pool offseason are locals who are members of the club. It is not an intimate hideaway the way I remember it from 25 years ago, last time I was there with my parents. But it is a new generation and the desires of people are different these days. The Breakers is well positioned to service these people. it's a decent property; I'm just not sure it is the right one for us. Next time we would go to Palm Beach, we'd look around at the Four Seasons and Ritz Carlton and see if it offered the best choice for us with our small kids and then decide.", "title": "wonderful property with amazing leisure facilites", "user": "TravelAdorer", "date": "October 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83592334}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "Attended a meeting at the Breakers, which lasted four days. Had a wonderful newly renovated Full Ocean Front room with a balcony. Every morning I got up at 07:00 and watched the spectacular sunrise from my balcony (so did many of my neighbors :)). Had breakfast every morning at The Circle - which was a pure delight. Must say Chef Adriano made the best omelettes, I have ever had in a hotel. On top of that we were served by James every morning, who was the friendliest and most courteous person ever. The meeting room was great - very nice decor and stylish. Free wifi in the entire hotel is another fabulous plus - altough 200 people went online together - the system always worked very well. For lunch and dinner we had buffets, which were nicely decorated and the decor of the food was outstanding. The leisure facilities are second to none and I wish my family could have been there with me. The last night we dined at the Italian restaurant on site - the pizza from the brick oven was great and there is a nice play area for kids. Really the Breakers offers something for everyone. The grounds are spectacular and I wish I had time for golf and tennis. The only downside was Palm Beach itself - nothing going on - almost dead in September - but then who needs to leave such a spectacular hotel?", "title": "Not quite what I expected", "helpfulness": 1, "user": "Islandehopper", "date": "October 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 83502982}, {"rating": 4.0, "title": "Wonderful, Classic Property, One Speed Bump", "text": "The property itself was nice and well kept. I must admit I had expected more from my stay as it is the Breakers. Everything came at an additional cost -including the morning cup of coffee. Parking on their 140 acres, steam room, airport or town shuttle, all additional. My real disappoint came in not having access to this iconic hotels history details. Unless you are there at 2pm on Tues there is no hotel tour. A self guided tour would have been a great option for those of us interested in the properties art and history...maybe this will be in their future.", "user": "CofCtraveler88", "date": "October 13, 2010", "id": 83389317}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "I stayed at the Breakers for a Convention. I was amazed about the service quality and the friendliness of the staff. This is a remarkable hotel with great restaurant a recreation facilities. There is no need to leave the hotel, then Palm Beach is rather boring at this time of the year and the hotel offers all types of enjoyment. Just the shopping indulgence needs to be done outside the hotel. I will definitely come back.", "title": "Perfect Staff, superbe architecture", "helpfulness": 1, "user": "ZrhWorldtraveller", "date": "September 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81568723}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "Recently stayed at The Breakers, in a renovated deluxe room. I would suggest springing for the money for an ocean view. The hotel is old world elegance, with great modern touches- state of the art fitness machines, 4 pools to choose from, poolside cabanas, shops, and 8 or 9 restaurants to choose from. Echo is a short free shuttle ride and worth the trip- excellent food and impeccable service- the bartenders ask your name and actually remember it during your visit! This is not a place to go and watch your pennies, but well worth it even if you live local as we do. It was a great staycation. City place nearby is a great place to go shop and eat, and of course Worth Avenue is nearby. The Golf course is stellar, and in the summer they offer great deals for parents to play with kids. There were plenty of young kids there, and conventions going on. A great place for all!", "title": "Breakers exceeds our expectations!", "user": "cornballs", "date": "September 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81114968}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "This was our 2nd time back to the Breakers but the first time in the summer months. We had an incredible stay over 9 nights in mid August 2010. Here are the big positives:", "title": "Very close to paradise", "user": "MattJohnst", "date": "September 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79495248}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "1) very attentive service from the restaurant manager to receptionist to valet to housekeeping", "title": "Luxurious and elegant...don't miss it, if your in the area!", "user": "Flagirl56", "date": "September 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78472859}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "2) 5 swimming pools to choose from + jacuzzis", "title": "Amazing place to stay", "user": "sralston", "date": "September 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78192810}], "location": {"country": "United States", "city": "Palm Beach"}, "stars": 5, "variance": {"poor": 37, "average": 66, "very good": 173, "terrible": 35, "excellent": 759}, "aka": "The Breakers Hotel", "slim_ranking": 0.3, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Set in the heart of the island of Palm Beach amid 140 acres of picturesque oceanfront property, The Breakers is recognized as one of North America’s iconic resort destinations. Independently owned, this legendary resort has been completely revitalized to offer a paradise for couples, families, and special gatherings. Revel in a new tropical feeling at the glorious beachfront, play the greens, and enjoy the blissful spa, delicious dining, and incredible services energized by a genuinely caring staff, integral in helping you make fabulous memories. * Nine distinctive restaurants and five bars* A private beachfront oasis with five sparkling pools, bungalows and watersports* An oceanfront spa, offering moonlit massages amid Atlantic breezes* 36 holes of championship golf including the on-site Ocean Course and Rees Jones® Course; a golf academy* 10 lighted Har Tru tennis courts and instruction by USPTA/USPTR-certified professionals* 10 on-site boutiques including Lilly Pulitzer, Guerlain and Ralph Lauren* A family entertainment center and kids’ camp; 11 boutiques.* The Flagler Club, private club level with a private concierge and residential ambiance, Interactive Family Entertainment Center and Kid’s Camp."}