{"user_rating": 5.0, "review_count": 403, "name": "The Lion and The Rose Bed and Breakfast", "reviews": [{"rating": 5.0, "title": "Enjoyable experience.", "text": "We celebrated a 50+ anniversary with a visit to Asheville using Tripadvisor recommendations for the B&B and dinner: we were not disappointed. The Lion and Rose hosts were very gracious, our accommodations surrounded by antiques were comfortable and the breakfast was excellent. A nice touch was the coffee/tea left at our door at 8 a.m. (Breakfast starts at 8:30). Even Cedric, the family fox terrier. was welcoming.", "user": "Harpone", "date": "September 16, 2012", "id": 140448427}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We made a last minute reservation for 3 days and lucked out by getting the Marian Hill room, which gave us lots of space to spread out. I think we made use of everything in this B&B except for the videos, and there was not time for that. Jim is an excellent cook, and made me excellent gluten free, lactose free breakfasts. Because we checked out early on our last day, he had made us sandwiches the night before (on request), stored them in the pantry frig, and we had breakfast on the road back to the Charlotte airport. His restaurant suggestions were right on. Next time, we want to stay longer and explore more of the area. I highly recommend this place as it is one of the best B&B's we've stayed at.", "title": "Superlative!", "user": "walklady2000", "date": "September 14, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 140294964}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We spent 3 nights in the Fannie Rice room. The room was very comfortable and appealing. It was so nice to wake up to hot tea (or coffee) on a tray outside our door. The breakfasts were delicious and the well-stocked guest pantry really made us feel welcome. It was also thoughtful of the hosts to provide a desktop computer and printer in the parlor for last-minute searches on the area. The 1896 house itself is a treasure with a beautiful parlor, covered porch and lush garden. The negatives were the noisy window A/c (but I was glad to have it - it was muggy when we went), a small TV in a large armoire, and a movie selection that didn't capture our interests, but those are minor complaints.", "title": "Lovely", "user": "xi5", "date": "September 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 139347971}, {"rating": 5.0, "title": "Wonderful!!", "text": "My husband and I just got home from our two night stay here and we are missing it already. This is a great place to stay....Jim and Linda are terrific hosts and cooks, and the property is amazing. We enjoyed sitting on the porch with a glass of wine in the late afternoon and enjoying the beautiful gardens and surroundings. Our room was perfect, and the breakfasts were delicious, especially the lighter than air buttermilk and cornmeal waffles! We loved the proximity to downtown and we did a lot of walking...in fact we left our car in it's parking spot for the full two days. Coffee at our door in the morning prior to breakfast was such a nice touch, and the homemade cookies and brownies in the afternoons were too good to pass up. Over all, we loved this place and will definitely return.", "user": "Marie H", "date": "August 26, 2012", "id": 138421469}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "My husband and I spent our one year wedding anniversary at The Lion & the Rose in August. The house and property were beautiful. The suite was homey, very comfortable, and beautiful. Breakfast was amazing both mornings and the location was perfect for us (we wanted to explore downtown). Jim and Linda were very welcoming and provided great service. We especially loved waking up to the smell of a delicious breakfast and a nice pot of coffee outside our door. We could not have asked for a more perfect place to spend a quiet, relaxing weekend getaway.", "title": "Wonderful!", "helpfulness": 1, "user": "Courtney L", "date": "August 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138144112}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "We truly enjoyed staying at the Lion and the Rose B & B this fall. They owners think of everything such as comfortable robes, beautifully appointed rooms, snack and drinks, coffee or tea at your door while you get ready to come downstairs for breakfast, and much more. They were so helpful with choosing places to go and restaurants to try. My only two complaints would be that they need more hangers in the closets and the breakfasts were too heavy. I think I would have preferred a heavy choice and a light choice or maybe a list of what would be served and you could check what you wanted. I felt that we threw away too much food.", "title": "Beautiful B & B", "user": "charliesmimi", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144678351}, {"rating": 5.0, "stay_parameters": "Stayed November 2012", "text": "We stayed at The Lion and the Rose for our anniversay. It was perfect! The whole house was gorgeous and immaculate. Breakfast was amazing and the service was above and beyond. We will definitely keep The Lion and the Rose in mind next time we are in Asheville!", "title": "Perfect for a romantic night!", "user": "nschwenks", "date": "November 4, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 144502448}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Beautiful house and a very good location. Delightful welcoming hosts and very fulsome breakfasts. A superb stay enjoyed the comfort of the place. Stayed in the top floor suite and thoroughly enjoyed it.", "title": "Wonderful stay", "user": "lgmsomerset", "date": "October 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144164671}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "My wife and I went beck to The Lion & The Rose for our first anniversary after staying there for our honeymoon. Jim and Linda were wonderful hosts, again, and the room, house, and (especially!) the breakfasts were amazing. Very comfortable rooms in an elegant house. Can't wait to go back!", "title": "Wonderful Repeat", "user": "William P", "date": "October 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143990568}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We visited Asheville and stayed at the Lion and the Rose in late July and had an absolutely wonderful time there. The house is warm and inviting as was our room. Breakfast was the best--so much wonderful food I couldn't finish it all.", "title": "Wonderful Long Weekend at Lion and the Rose B&B", "user": "mgcavan", "date": "October 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143843681}, {"rating": 5.0, "title": "Victorian in Ashville", "text": "Beautiful Victorian home with period furniture and spacious rooms. Superb breakfast. Warm and well informed helpful hosts. A wonderful place to stay in Ashville and visit the Biltmore and the Blue Ridge Pkwy.", "user": "Richard L", "date": "October 23, 2012", "id": 143571306}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "My sisters and I have a yearly reunion trip. This year we booked the Lion and the Rose Bed and Breakfast for our visit to Asheville and to the Biltomore estate. Although we had traveled to England together and stayed in many B&B's there, nothing could top the Lion and the Rose. Not only were the accommodations elegantly comfortable, the owners were welcoming giving us lots of sugggestions for places for lunches and dinners. The breakfasts topped Food Network presentations with speciality pomegranate syrup for the Belgium waffles. Our only regret was that we could not stay longer.", "title": "Sisters' reunion", "user": "Adelaide K", "date": "October 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143238439}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Our stay was perfect, our accommodations comfortable and spacious and our hosts couldn't have been nicer. They were so helpful with information about things to do and had directions already printed to major sites. Their information about restaurants was right on, they really know the restaurants in Asheville. The breakfast at the B & B was delicious. .", "title": "Lovely experience", "user": "Daisyzorro", "date": "October 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 143165539}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We had a marvelous 2 night stay in October 2012 at The Lion and the Rose. Some B&B's can be a bit fusty, or overdone, but this was our best B&B experience yet! Jim's breakfasts are too die for...they keep you full all morning long and he goes out of his way to accommodate everyone (I'm vegan). Both Jim and Linda were so helpful, without being the least bit intrusive. Books, videos, magazines and brochures about Asheville are plentiful around the house. We stayed in the Holger-Nielsen room and found it very comfortable and clean, with a large, modern bathroom. In the evenings, we enjoyed \"sneaking\" into the guest pantry for some sweet snacks, Cokes, and maybe a glass of port in front of the fireplace. It was hard to leave the B&B for the cold, cloudy outdoors since we could have sat around the well-appointed living spaces and watched the gardens all day. Beautiful home, and lovely folks. Just a delightful trip! Couldn't recommend more!", "title": "Too bad we couldn't spend the whole time in the B&B!", "user": "edayem", "date": "October 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143075368}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "My boyfriend's parents gave us a trip to Asheville for Christmas last year, and we went on the trip this past weekend. My boyfriend's father contacted the Asheville Chamber of Commerce, and the Lion & the Rose was highly recommended. We are so glad that we chose to stay here! From the moment we walked in, Jim was extremely hospitable, showing us where there was information about sights, and showing us where everything we would need in the house was located. The innkeepers keep a fridge full of drinks (water, soda, beer etc.), as well as tea, and sweet and salty snacks available 24 hours downstairs. Jim showed us to our room, and gave us recommendations on restaurants in the area. He and his wife went to a concert at the Biltmore that night, but had a sheet with their contact information downstairs in case we'd need them while they were not in the house. We stayed in two different rooms during our stay, and Jim & Linda moved our belongings over to the next room, and even hung up our coats in the new room that we'd left laying on the chair in the previous room.", "title": "Excellent stay in Asheville", "user": "Monica S", "date": "October 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142967580}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "We stayed at the Lion and The Rose for a weekend along with some friends. The home is beautiful, warm and comfortable. Our room was cozy and welcoming with all the amenities of a hotel. Breakfast was fabulous! The owners were friendly and we fell in love with their dog, Cedric. We highly recommend The Lion and The Rose.", "title": "Wonderful- we'll come back again", "user": "mjones783", "date": "October 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142311358}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "my husband and i visited the biltmore house in asheville, nc last year near christmas. we stayed at the lion and the rose bed and breakfast and were delighted! the building is victorian style, but very well appointed and comfortable. i liked that the house was decorated with real greenery inside- it was a nice touch and also smelled wonderful. the outside of the house had a festive look as well- with several outdoor christmas lights. the staff was friendly, helpful, but not intrusive. i highly recommend this bed and breakfast, especially for a romantic getaway.", "title": "romantic, well appointed bed and breakfast", "user": "bea53_10", "date": "October 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142025579}, {"rating": 5.0, "title": "Lovely historic home", "text": "A lot of nice touches here - lovely gardens, big porch, truly gourmet breakfast, special attention to the needs of travelers, (eg - power strip in the room). The same attention evident in the antique furnishings and complete feel of the house. Friendly staff as well and we quite enjoyed our stay.", "user": "Sarah F", "date": "September 28, 2012", "id": 141538211}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "My wife and I stayed here in September 2012. The Montford Historic District, where this B&B is located, is a leafy, tired neighborhood with lots of similarly-restored houses just off downtown. As such, there are plenty of B&B's to choose from.", "title": "Nothing Special", "user": "RTK1316", "date": "September 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 141242653}, {"rating": 5.0, "title": "Beautiful neighborhood", "text": "PROS: The house was restored very nicely, and it sits on an expansive corner lot deep into the neighborhood. Morning coffee delivered outside our room was a nice touch, and the breakfast was creative and satisfying. Solid Wi-fi throughout the house and the availability of snacks for late-night cravings was welcome.", "user": "triplevet", "date": "September 24, 2012", "id": 141194250}], "location": {"country": "United States"}, "variance": {"poor": 0, "average": 5, "very good": 16, "terrible": 1, "excellent": 381}, "slim_ranking": 0.238095238095, "description": "The Lion and The Rose Bed and Breakfast is a beautifully restored Queen Anne, just three blocks from downtown Asheville, North Carolina and minutes from the Biltmore Estate. Each of the five guest rooms is uniquely furnished with antiques and period appointments. All rooms include a queen bed, private bath, full gourmet breakfast, TV/DVD player, luxury soaps & linens, custom robes, wireless internet service and a 24 hour guest pantry."}