{"user_rating": 4.5, "review_count": 36, "name": "The Olde Post Inn", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Bit late with my review, but still pretty clear as it was a disastrous weekend- all to do with weather and absolutely nothing to do with this wonderful guesthouse!", "title": "Amazing restaurant, lovely accommodation", "helpfulness": 1, "user": "Ken_Tara", "date": "April 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 61029114}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "My partner and I travelled up from Dublin late Friday afternoon all packed and plans in place to spend Saturday walking in the area of the Cliffs of Magho, just beyond Enniskillen. I had read fab reviews about the restaurant in the Olde Post House and as the pics looked so nice and welcoming on the 'net, we decided to make it our base. There was a further plan for a total pig-out gastronomic feast after our day of walking.", "title": "AMAZING!!", "user": "monaghanlass", "date": "September 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 45314016}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Well, just as we arrived in Co Cavan, the murkiest, most dense fog I'd ever seen settled on us and showed no signs of lifting. Once we were settled in our comfortable en-suite room, we decided to have dinner that evening as well. We made it just in time for the Early Bird, and Oh. My. God. The complimentary amuse-bouche crab cake prior to our starters was just the beginning of a wonderful evening of great food, great wine and great company. Recommendations? Try the duck and share the chocolate brownie dessert! Rounded off with an amaretto and a coffee, we waddled bursting back to our room.", "title": "excellent food, disappointing accommodation", "user": "lucysue", "date": "March 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 7191231, "likes": {"liked": "— the staff, fine dining", "disliked": "— cracked toilet seat, cramped room, tiny bathroom, noisy"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "My wife decided to surprise me on my birthday, with a meal and an overnight stay at the Olde Post Inn. I believe it's a converted post office. When my wife was driving us there, I really had no clue where I was going to. When I got there, I was none the wiser, as I had never heard of it. I could see from the plaques on the wall that it's won best restaurant in Ulster several times and Bridgestone award of Best Restaurant for 2011 ! Well, the food didn't disappoint at all. We went with the 5 course meal for €56 each. I had a chicken and lobster caesar salad which was delicious. My wife had goats cheese. We both had soup which was tasty. My wife had a chicken main course while I went with the rib eye of Angus steak with bearnaise sauce. My wife had an apple tart for dessert. She said it was outstanding. I had a collection of ice creams and sorbets which I found acceptable enough. Overall the food was great. We were stuffed after it. It's not minimalist gourmet fare. They lash on the veg and potato to complement the main course. Easily 9/10 from both of us. We stayed over the night. It seemed we were the only ones. No sign of life. The bedroom was lovely. A huge bed with nice decor and a big plasma tv in the room. The bathroom was nice and clean as well. A small complaint would be that the weather was very warm and we left the window open, but there was noise coming from the bar till around 12.30am. Next time I will bring my earplugs ! The breakfast the following morning was absolutely outstanding. I had the full Irish. Everything on the plate was so tasty, especially the mushrooms and white pudding. The staff are the big selling point of this place. The owner was a lovely chatty person. The waiting staff were all very friendly as well. We will definitely be coming back here. I think we will bring my parents for a surprise trip the next time. It's a lovely restaurant in a lovely location. Great for total relaxation. Highly recommended for foodies who like eating in picturesque relaxed surroundings", "title": "A lovely experience", "user": "BurstYourBubble", "date": "July 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 4.0, "service": 5.0}, "id": 115747027}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Didn't stay here - just came to restaurant for early bird menu when on mid-week break in Cavan. Quality and presentation of food outstanding. Setting excellent and cleanliness beyond reproach. Fantastic friendly service, courses came at good intervals, nothing was rushed. Loved it all. Wish it was 50 miles closer to home!", "title": "Will someone pay for me to eat here every week?", "user": "PastieSupper", "date": "June 30, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "service": 5.0}, "id": 114914541}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "I have stayed here and eaten here on separate occasions. The food is excellent if pricey by local standards. However you get what you pay for. The staff are excellent and this is a reflection of the fact it is a family owned and operated business. There are only 6 rooms and you need to book in advance as it is not open 7 nights a week (closed Mondays I believe). It does evening meals most nights and lunch on Sundays.", "title": "Superb", "user": "abc246", "date": "March 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101749960}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Let me start by saying we did not stay in the Inn, we just came by for a nice meal. It was recommended by the proprieter of the B&B we were staying at, on the northwest side of Cavan (\"The Arches\" - look for our review there).", "title": "Wow!!! This was the best food we had in Ireland", "user": "WhirledAdventurers", "date": "December 4, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0}, "id": 89025502}, {"rating": 4.0, "title": "quaint and homely", "text": "We were in Ireland for 1 week. We had been primarily eating pub/restaurant food up to this point and were looking for something with a little different atmosphere. It was perfect. We arrived a little early (okay, a lot early), after a cold day at the races. Our over-promptness didn't phase our hostess at all. She took our jackets and sat us in the lounge, next to a warm fire; Drinks were provided and our dinner order taken. Shortly afterward, appetizers were provided while we waited for our table. The service was friendly and excellent.", "helpfulness": 1, "user": "sheryliz22", "date": "October 27, 2010", "id": 85043751}], "location": {"country": "Ireland", "continent": "Europe"}, "variance": {"poor": 1, "average": 2, "very good": 7, "terrible": 0, "excellent": 26}, "slim_ranking": 0.5}