{"user_rating": 4.5, "review_count": 471, "name": "The Inn at Perry Cabin by Orient-Express", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We stayed for one night at The Inn at Perry Cabin and had a wonderful and relaxing time. The entire hotel is beautiful. The staff and service were excellent. Our room was lovely as was the bathroom, both were very clean. Our room opened up to a little patio with chairs and table, overlooking the water. We had high tea in the tea room which was really nice. Also had dinner there in front of the fireplace, although at bit expensive, definitely worth it. The grounds are beautiful as well. They offer free bicycles which we used around town. They also have free vcr and dvd movies to use. We would highly recommend this hotel to anyone.", "title": "Fantastic", "helpfulness": 1, "user": "jojie86", "date": "December 11, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6364539}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "This is a high quality place with high standards. It's also very relaxing and has a nice location with pleasant views over the water. Food is very good although the menu doesn't have daily specials so if you stay for more than a few days you run out of things you really want to eat. Until the new spa has been built (spring 07 apparently) the pool is seriously compromised as it is next to the building site (which is screened but still doesn't look very nice). Also the existing fitness room is small.", "title": "Very good hotel", "user": "Musician101", "date": "October 6, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5922813, "likes": {"liked": "— spaciousness, quality furnishings", "disliked": "— noisy airconditioning"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "If I was being honest, the noise from the airconditioning system verges on being unacceptable (we had an upper floor suite) - the buildings have a rather hollow sound to them and I think the AC plant rumblings tend to echo through the buildings. I don't know if this varies according to which room/building you are in however. Overall though this is a very nice base to explore this part of the Maryland coast.", "title": "First-rate all around!!!", "helpfulness": 5, "user": "lovey3", "date": "August 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5712175, "likes": {"liked": "— Pleasant, relaxing atmosphere", "disliked": "— Small bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We recently had the pleasure of visiting the quaint town of Saint Michaels for our anniversary and we opted to treat ourselves to a stay at The Inn at Perry Cabin-not cheap, but worth every penny!", "title": "Perfect lazy weekend getaway", "user": "costadelmar", "date": "August 23, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 5702339, "likes": {"liked": "— Great setting for romantic weekend getaway (quaint/cozy) - particularly room (master suite) and location", "disliked": "— SOME rooms in the historic section are not that impressive for the cost - so be aware of that."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The entire experience was first-rate from check-in to check-out and everything in between. We stayed in the \"historic\" side of the hotel in one of the \"state\" rooms and found it to be clean, charming and very comfortable, albeit the bathroom a bit small. We particularly enjoyed relaxing on our private terrace with views of the Miles River.", "title": "Location to die for; accommodation already deceased!", "helpfulness": 7, "user": "foolonthehill2005", "date": "August 15, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 5615644, "likes": {"liked": "— Location", "disliked": "— Poor maintenance"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "If you have not been to St. Michael's, it is one of the most charming places I have ever been! The food is excellent at the hotel and in town. Great for crab and seafood! The hotel has gorgeous suites with really large bathrooms, and large sunken tubs, perfect for baths. The view of the bay is so tranquil..perfect long weekend getaway to relax, revive and so romantic! I wish the spa was open while we were there. Its opening next month and looks like it's going to be amazing!", "title": "So charming!", "helpfulness": 1, "user": "NYC127", "date": "May 22, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7671212}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We stayed in the original wing in a king bedded room. The website photos are accurate...this is a fine location. Our room had a small patio (ground floor) and most of the upstairs rooms had balconies. This charming inn has a knowledgable, friendly and experienced waitstaff and concierge who are enthusiastic and eager to help. The landscaping was picture perfect. The inn is within easy walking distance of town and restaurants. The onsite pub has a British flair and the bartender is wonderfully attentive. We took refuge there on a Monday night when most of the intown restaurants were closed and had a very good pub style meal created by a chef who takes pub dining to another level! We look forward to our next trip to the area so we can spend more time watching the River roll by.", "title": "A Picturesque Inn", "helpfulness": 2, "user": "Pamgoes", "date": "April 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7347524}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We have just returned from a weekend at this Inn, and want to express what a wonderful experience it was. We were immediately made to feel right at home, and over the course of the entire weekend, we were impressed with the friendliness and helpfulness of the entire staff. The setting for the Inn is simply beautiful, right on the Miles River on its way to the Chesapeake. For once, the pictures displayed on an inn's website fairly depicted what was actually present! The Inn is simply gorgeous, but in a homey, very comfortable", "title": "a welcoming experience", "helpfulness": 2, "user": "harryoh", "date": "April 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7278852, "likes": {"liked": "— the comfort and homey feeling", "disliked": "— no drawers in the armoire"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "manner, where we felt right at ease sitting anywhere in the tastefully decorated public rooms. Speaking of which, our room, a state room, was exquisitely decorated and very comfortable. The state room is one level up from a signature room, and is worth spending the extra money. All the state rooms have water views, some with better positioning than others, while the signature rooms are the only rooms that do not have direct water views. And rest assured that the water views are gorgeous. When making a reservation, we recommend calling the inn to discuss your preferences for a state room, as the staff is very accommodating. The state rooms vary in terms of size, positioning and decor. Also, while all of the state rooms have outside sitting areas, some of them have private porches, while others have shared patio areas. The bed and breakfast package is truly a bargain, as your breakfast choice can be selected from the entire menu, without limitations, and would be prohibitively expensive if ordered a la carte. Rest assured, however, that the food is incredible and the menu choices varied and unique. On Sunday morning we were given the option of ordering from the menu or choosing their beautiful breakfast buffet which was all-encompassing.", "title": "Plan on $1000 for a 2-day stay!", "helpfulness": 3, "user": "jtfaze", "date": "February 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 6818816, "likes": {"liked": "— Beautiful location", "disliked": "— Too expensive for what you get. Plan on spending $1,000 for a 2-day stay!"}}, {"rating": 2.0, "title": "Nice, although overated", "text": "This was our first visit to the Inn and we have already made reservations for our next stay!", "helpfulness": 2, "user": "Terja", "date": "January 10, 2007", "id": 6570833}, {"rating": 5.0, "stay_parameters": "Stayed September 2005, traveled as a couple", "text": "We stayed at the Inn at Perry cabin in September 2005, for 2 nights. We had a fantastic time. The room was lovely, with our own small patio and direct access to the garden and water. The grouds are lovely, with squirrels and birds. The food in the restaurant was brilliant. We have travelled extensively in the US and this is probably one of the best hotels we have every stayed in. We found the staff to be exceptionally helpful, friendly and keen to give information about the local area. Fresh fruit in the rooms, bathrobes and slippers, first class toiletries all added to the experience. Beautiful lounges and the restaurant is lovely, wtih tables spaced far apart for privacy. You must try to oyster stew!", "title": "Fantastic stay - the food is fabulous", "helpfulness": 6, "user": "Bournemouthlady", "date": "September 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8665645, "likes": {"liked": "— Very comfortable bed", "disliked": "— nothing - it was super"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "This was our second stay at Perry Cabin. Our first stay was over Christmas a few years ago so it was good to see the property in full bloom. We booked on the spur of the moment (a week early) and were happy to get a room, if only for one night. The reception staff was great and the entire property was beautiful. We had a room in the older part of the building on the first floor with a wall of windows overlooking the harbour. The room was nicely furnished with a comfortable sitting area and a side door leading to a private fenced patio. We would have loved to stay a week if it had been possible. The BEST part about this luxurious hotel is that they accept pets. Our dog was treated every bit as well as we were and it was nice to have her with us. We saw other people with dogs around the hotel but all were on leashes and well behaved. We will be back.", "title": "Absolutely Perfect!", "helpfulness": 4, "user": "Macvoyager", "date": "September 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8613199, "likes": {"liked": "— Location and Service", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "Excellent hotel", "text": "We stayed in the master suite with view. It was a beautiful suite, with comfortable bed with pop up TV, huge bathroom/closet/dressing room with separate tub and shower, and a living room with another TV, sofa, desk, and refridgerator. I thought the service was just right. The staff was there when we needed them, but didn't hover. As someone else said, the automatic filling of the ice bucket every afternoon and the turndown service with cookie were very nice touches. The food in the restaurant was fabulous, as was the service. It's not the kind of place where you feel obligated to tip everyone every time you turn around. We came from Massachusetts, and visited because we were in Maryland for another reason. I wouldn't make a special trip by plane from out of state to visit St Michaels, I think there are better resort towns along the coast of the US in the summer. But if you are in the area, or live within driving distance, it's a great, romantic, spot for a few days.", "helpfulness": 2, "user": "cindyeo", "date": "August 14, 2007", "id": 8423104}, {"rating": 2.0, "stay_parameters": "Stayed July 2007", "text": "The inn at perry cabin is at a great location and is beautiful. The rooms and the amenities were fantastic. The rooms had great views they were seconds from the water. The service was not up to par and some of the employees were very rude. Other than that the inn was great and it was a shame that the service put a down side on the trip.", "title": "a shame", "helpfulness": 3, "user": "love2travel19", "date": "July 31, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 1.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8268158, "likes": {"liked": "— Location", "disliked": "— service,"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We have visited St. Michaels by boat many, many times, but this was our first visit by car. We booked a two night package for about $400/night that included one 3-course dinner for two at the Inn's restaurant. We had a room in the older section, closest to the reception area which was handy. The room was medium sized with large windows and door opening onto a porch/deck looking towards the harbor and the back of the Chesapeake Bay Maritime Museum. That was nice for morning coffee and/or an evening glass of wine.", "title": "Nice but needs some updating", "helpfulness": 2, "user": "toadster", "date": "July 31, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 8266696, "likes": {"liked": "— Friendly staff, setting on Chesapeake Bay", "disliked": "— Lack of amenities in room -- dresser, mirror, lighting, bathroom exhaust fan, storage space"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We came for 3 nights mid-week to celebrate our 20th wedding anniversary. The Inn is quite large and is very pretty. There is a new spa that we did not see, but we enjoyed the pool which is very pretty and heated to bathwater temperature (not an exaggeration!). Rooms that we were in were attractive and the beds are very comfortable, but it is in the details that the inn fails. At this price, we expect a higher level of care and excellence.", "title": "Disappointed", "helpfulness": 6, "user": "erb42", "date": "July 12, 2007", "detail_rating": {"front_desk": 1.0, "service": 3.0, "business": 4.0, "cleanliness": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8106228, "likes": {"liked": "— very pretty, comfortable bed", "disliked": "— inattention to details degrade the experience. Poorly trained staff"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007", "text": "Overall we felt the inn lacked a friendliness and warmth. Signs seemed to emphasize the NOs rather than being inviting. Reception staff has serious problems and check in, despite our room being prepaid, was difficult and unpleasant.", "title": "The Best Inn Ever", "helpfulness": 2, "user": "PhoebeZamboni", "date": "July 4, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8055173, "likes": {"liked": "— Beautiful location and super-competent and friendly staff.", "disliked": "— Everything was wonderful! No complaints!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The room would have been fine except that it was not possible to regulate the room temperature and though there was a heat wave, I had to wear the hotel's warm terry bathrobe to keep warm! I contacted the front desk 5 times over 2 days each time getting a different story about the problem. Finally at 11:30 pm on the 2nd night they changed our room to a part of the hotel that has a more updated system.", "title": "Stellar experience at Perry Cabin!", "helpfulness": 3, "user": "I'matthebeach", "date": "June 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7751230, "likes": {"liked": "— The cool pillows and lounge chairs at the swimming pool!", "disliked": "— Leaving!"}}, {"rating": 4.0, "title": "Could Have Been Great", "text": "The manager put us in an upgraded room and comped us for our first night - and we appreciated that. Still, I would rather have had a great experience than a free night.", "helpfulness": 2, "user": "FourEasyPieces", "date": "May 28, 2007", "id": 7709344}, {"rating": 5.0, "title": "Enchanted With Inn At Perry Cabin", "text": "I would probably not come back again and instead, if in the same area, chose a smaller place that is friendlier. I will spend the big bucks at the places that warrant it - and there are many on my list!", "helpfulness": 2, "user": "VALBEACH", "date": "May 26, 2007", "id": 7700977}], "location": {"country": "United States", "city": "St. Michaels"}, "stars": 4.5, "variance": {"poor": 20, "average": 41, "very good": 111, "terrible": 13, "excellent": 286}, "aka": "The Inn At Perry Cabin By Orient-Express Hotel", "slim_ranking": 0.25, "description": "Set on 25 lush acres with manicured gardens and nestled on the Miles River, The Inn at Perry Cabin offers luxurious accommodations furnished with contemporary and antique furnishings. Experience an unparalleled culinary experience in Sherwood's Landing, seamless, attentive service and many recreational options including an horizon edge swimming pool and fitness center. The new Linden Spa offers services focusing on pampering, rejuvenation and wellness."}