{"user_rating": 4.5, "review_count": 438, "name": "The Lodge at Chaa Creek", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with friends", "text": "i can't imagine why anyone would complain about this wonderful spot. the staff is probably the best part- everyone was helpful beyond the call of duty.", "title": "a winter escape", "helpfulness": 1, "user": "hisim", "date": "February 17, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 24679954}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "the food was fine- not the best we've ever had, but better than average. our accommodations ( 5 women friends escaping the cold for a few days without husbands ) were idyllic with a view that was unsurpassed. we loved the butterflies, nature walks, fresh fruit, and all the side excursions that were available. we had a 5 person villa, and i can't comment on the other rooms. ours was great!!", "title": "Chaa Creek Beyond Superlatives", "helpfulness": 2, "user": "johnburtonbrown", "date": "January 30, 2009", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 24020955, "likes": {"liked": "— Overall atmosphere, very friendly staff, great food.", "disliked": "— Internet access was spotty, but could be a result of the country's infrastructure, not Chaa Creek."}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Like most travelers to Belize, we planned a surf and turf itinerary, splitting our time between the mainland and the cayes. Our base for five nights would be The Lodge at Chaa Creek, an absolutely amazing resort on a 365 acre nature reserve near the Guatemalan border. We had to drive across the country to get there, but that only took a few hours.", "title": "DIsappointing for a honeymoon", "helpfulness": 2, "user": "lipanda", "date": "January 19, 2009", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 3.0}, "id": 23711883, "likes": {"liked": "— The grounds and wonderful noises as you sleep.", "disliked": "— Not romantic, small mis-leading accommodations."}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled solo", "text": "Just beyond the town of San Ignacio, we turned onto a long dirt road that passed through a few farms before gradually entering the jungle and the Chaa Creek property. We would travel back and forth along this road more than a dozen times. At night, we stopped and turned off the headlights to watch the trees sparkle with hundreds of fireflies.", "title": "almost perfect place", "helpfulness": 4, "user": "anilegna", "date": "January 17, 2009", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 23645001, "likes": {"liked": "— convenience, easy ride into town", "disliked": "— was not cheap"}}, {"rating": 5.0, "title": "Beyond fantastic", "text": "Upon finally arriving at the gates of Chaa Creek, we were greeted with rum punch and refreshingly cool and minty face towels to relieve us from the heat. As our bags were taken to our cottage, our guide took us on a tour of the immaculate grounds, lush with a variety of tropical plants and dotted with charming, thatched roof structures constructed with indigenous materials. When we were taken through the bar and restaurant, we were introduced to several of the staff, all very courteous, attentive and professional.", "helpfulness": 2, "user": "momfrommaus", "date": "January 17, 2009", "id": 23638820}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "This hotel has more character and style than most of the 5 star hotels I have stayed in, all around the globe.", "title": "Wonderful experience", "helpfulness": 3, "user": "Val_travel_addict", "date": "January 15, 2009", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23589312, "likes": {"liked": "— location, staff attention to details, food, activities", "disliked": "— property gate closing at 11 PM w/o instructions on what to do if this arrives"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "It has an amazing position in the middle of the tropical forest,", "title": "Loved Staying at the Camp Casitas", "helpfulness": 2, "user": "brlops5", "date": "December 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 22439787, "likes": {"liked": "— It felt like camping, but in a bed. Put you right into nature.", "disliked": "— Wolf Spiders, they are very big."}}, {"rating": 3.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "the rooms are spacious with noble wood furniture, the food is delicious and the staff makes effort to prepare each night a wonderful setting for dinner.", "title": "Some great, some not so great, some bad", "helpfulness": 2, "user": "Rob S", "date": "November 17, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 21928673, "likes": {"liked": "— Beautiful grounds, people", "disliked": "— Hard beds, food, iffy water"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "I do recommend you to take time to sip an all spice tea in the garden-bar at the beginning of the evening with real torches lighting the tropical vegetation around you.", "title": "Luxury Resort In the Jungle", "helpfulness": 1, "user": "Capaneus7", "date": "October 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21376147, "likes": {"liked": "— Amazing Rooms", "disliked": "— Weather (Not their fault)"}}, {"rating": 5.0, "title": "True Integrity", "text": "In a nut shell: we totally love it. The perfect romantic getaway.", "user": "BZ_NZ", "date": "October 23, 2008", "id": 21147951}, {"rating": 5.0, "stay_parameters": "Stayed April 2010", "text": "My husband, 14 and 10 year old daughters stayed 7 nights in the casitas. We were joined by another family with similarly aged kids. We loved staying in the \"camp,\" although it is really not camping, more like a cabin with a canvas roof. There were beds, linens and a porch with a hammock and chairs. It could be noisy at night, but that was from geckos, howler monkeys, cicadas and an occasional possum, all of which we enjoyed. Dosio and his family, the caretakers of the camp, took wonderful care of us. The food was great! Plus, we used the beautiful pool at the Lodge, and booked several excursions through the concierge there. We highly recommend a trip to Tikal in Guatemala and horseback riding (Robert in the stables was great with kids; we even let the girls take a second ride by themselves.) The walk to the Lodge is ten minutes along a beautiful trail and was not difficult.", "title": "Fantastic family experience", "user": "pecele", "date": "April 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 60768920}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "After a week on Ambergris Cay, we ventured off to Chaa Creek. What a treat. This is a classy resort in the middle of the jungle. To enjoy this eco lodge, you really need to be adventurous, like to hike, bird watch, ride horses, canoe and relax. Best to plan your days in advance. Each day, one of our children planned our events for the day. The highlights were a morning horseback ride around Chaa Creek, a canoe trip from Chaa Creek into San Ignacio, a morning at the Spa, and best was a day’s trip to Guatemala to see the Mayan ruins at Tikal. The drive to Tikal is long and bumpy but well worth the adventure. Also be sure to visit the market in San Ignacio and take in a soccer game while there.", "title": "Fun in the Jungle", "user": "CapeCodTravler", "date": "April 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 60523954}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We enjoyed breakfast, dinner and cocktails each day at the resort. The meals were terrific, local and always had a fun twist. We are used to fine restaurants and we were not disappointed here. Lunch was always out on one of our adventures. It’s probably a good idea to bring along some snacks as you are a ways away from shopping. Be sure to store your snacks securely as we did have a 4 legged visitor each night that gnawed on our trail mix. Part of living in the jungle I guess.", "title": "Rustic Luxury", "helpfulness": 1, "user": "naomicdm", "date": "March 29, 2010", "detail_rating": {"value": 4.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 59880958}, {"rating": 5.0, "stay_parameters": "Stayed March 2010", "text": "Be sure to bring some snacks along as you are in a fairly remote location.", "title": "No Worries at this Magnificent Eco-Resort", "helpfulness": 1, "user": "PatriciaG78", "date": "March 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59242306}, {"rating": 5.0, "title": "Experience of a lifetime!", "text": "We enjoyed our stay at Chaa Creek quite a bit. We stayed in the tree top suite, which was by far one of the most unique and beautifully decorated rooms we ever stayed in. We had a jacuzzi on our wrap around porch that overlooked the Macal River. The grounds were immaculately maintained. There were dozens of on sight activities including a butterfly farm, horseback riding and canoeing. There were also tours such as to Tikal, a Mayan ruin and also caving and tubing were options as well. If you have an opportunity go to Tikal and Caracoal. The ATM tour is amazing. The staff was very friendly and knowledgeable. The cuisine was refreshing and tasty. You really got a feel for the local food. If you want to have luxury but also want to be surrounded by the jungle this is the place for you!", "helpfulness": 1, "user": "50solo", "date": "March 17, 2010", "id": 58788588}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "It is difficult to review Chaa Creek.This was our second trip to beautiful Belize. We stayed at Chaa Creek for 5 nights this July and I would recommend it with some reservation-it really depends what you want to experience. It is indeed beautiful, the morning birding guides are very good, the forest trails are well marked, the grounds are meticulously kept, it is peaceful and quiet, clean and manicured, with a beautiful pool and absolutely gorgeous comfortable accommodations. There are many many friendly staff everywhere to help you with, I imagine, any request you would have. It is a very luxurious, safe yet somewhat sterile place to go.", "title": "Beautiful Safe and Peaceful but a bit sterile", "helpfulness": 3, "user": "gatopaja", "date": "July 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72605210}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "The breakfast and lunch menus were varied, fresh, and light but the dinner menu was very limited, expensive and rather \"heavy\" . . . not really tropical but meat and pasta and lots of heavy sauces. We ordered off the lunch menu for a few nights for dinner which was perfect - very good salads, grilled fish burgers, but then we were told that they couldn't do this again for us. We would eat a late lunch in town and skip the dinner menu for our last couple of nights.", "title": "Spectacular!", "user": "Nene809", "date": "June 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 68464198}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "For people going to Belize for the first time, or, who perhaps need their hand held in a predictable, organized and safe environment, I would recommend this place.", "title": "Perfect romantic getaway", "user": "MichelleBermuda", "date": "May 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 65181405}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "It is not a place to go to experience local culture or food or to mingle with people who are studying and learning about the diverse animal/plant life of the area. I would also not want to go there without my own vehicle as it is very secluded so you would have to request lifts to go to town or anywhere. Although, all the tours of the area are offered through the lodge and according to other guests the tours were top notch and well organized.", "title": "Belize at its absolute Best!", "user": "PRPiper", "date": "May 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63663354}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "It does not have the feel of an eco-jungle lodge but more of an upscale posh resort where people go to participate in package-planned organized tours.", "title": "Honeymoon loveliness", "user": "Claudiner", "date": "May 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63022888}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "My husband decided on a whim to visit the Cayo district after spending a beach holiday at Ambergris Caye. We chose Chaa Creek for numerous reasons such as excellent reviews, great location to visit Mayan ruins, the rainforest, excellent accomodations and they also offered a 20% discount since it was off season. The day we arrived, we set up activities the same day and they called the horse stable to set up my horseback riding and the bike shop for my husband's mountain biking experience. They did so efficiently and didn't care that it was so last minute.", "title": "A safari in the rainforest", "helpfulness": 3, "user": "wlslb", "date": "September 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 78525046}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We stayed in a cottage room and it was very beautifully decorated. That same night, the howler monkeys woke us up, it was quite amazing. When stayed in Botswana, the lions and elephants woke us up. So this was another one of those moments where you really cherish being able to be so close to nature, yet be in a comfortable space.", "title": "An unexpected gem!", "user": "hhtravel", "date": "August 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 75979655}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "The next morning, I enjoyed a guided bird watching walk (i was the only one there). We met the owners who were extremely down to earth and warm. We wished we could have stayed much longer. The resort is shutting down for a month or their annual maintenance and b/c it's really slow during this time. We had excellent weather (no heavy rains the entire week we stayed in Belize). We drove from BZE airport with our crystal 4WD rental. It was a 1.5 hour drive and we were often the only car on the highway. We drove to Tikal, Guatemala the next day. The resort offers a well-priced tour 150 pp. Since we had a car, we decided to drive ourselves. First we need a notarized authorization from the car rental agency (Crystal takes care of this) which cost $15 and they give you copies of your rental docs to give to the Gautemalan border patrol. We were very nervous about crossing the border b/c we heard negative things about the experience esp for those not with a tour guide and our spanish wasn't very good. We had to pay the $37.50 pp belize dollars exit tax (paid to Belize) to cross the border to Gautemala. We took the advice of the resort and used the money changers at the border to get quetzals as there were no ATMs that were easily accessible. For each dollar, we got $7.5 quetzals. We were charged $20 belize pp for crossing and $40 belize for the car to cross and$10 belize to cross the small bridge and another $10 belize for fumigation when we returned the same day. Also, they needed a copy of the driver's passport and drivers ID with the stamp on it, so we had to walk across the border to a copy shop (luckily it was only a short walk). They tried to charge us $12-$16 belize but my husband refused and only paid $10 belize. Overall, i would recommend that someone use the tour company but we don't really like organized tours and the time constraints that come with it. We also stopped by a local restaurant in Gautemala and the food was delicious.", "title": "On a scale of one to five, we give Chaa Creek a six.", "helpfulness": 1, "user": "JJColoSprgs", "date": "August 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75659651}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Any how, we were so sad to leave Chaa creek. The property is huge and there's so much to do that we didn't get to take advantage of b/c of timing. So do stay longer if you can. Since it's the rainforest, there are bugs and we found big waterbugs in our room (which was quite scary for myself).", "title": "Cool Jungle Setting with Thoughtful Service", "helpfulness": 2, "user": "volcanogirl", "date": "August 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 73391368}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We came to Belize with our 3 kids, 7, 10 and 12 to get off the beaten path. We had no plans or reservations and wanted to go with what grabbed us. Normally we try to avoid places like this but in Belize they are the norm. We decided to try Lodge at Chaa Creek based on the reviews. We arrived unannounced in the pouring rain and were treated as if they had spent all day waiting for us. The accommodations are fantastic! Clean, comfortable and beautiful. The staff could not be nicer and the food was terrific. It was nothing like an al inclusive of this type normally feels. They had many outings that were free and many you could pay for but none were pushed. We travelled out of season so the price of the room was dropped and breakfast, which was the best meal of the day, was included in the room.", "title": "Great place to visit but price/quality ratio out of proportion", "helpfulness": 1, "user": "HansPetersZeist_NL", "date": "July 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 72640101}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "My wife, nephew and his best friend stayed for 4 nights at Chaa Creek. I had stayed there 22 years ago, and there have been some improvements (spa, pool) but I am happy to say the flavor of the hotel has remained the same. It's a great place to bird watch, glide down a lazy river that's a 5 minute walk from our room, see a small but excellent museum, and observe morpho butterflys at their own hatchery on the grounds.", "title": "Perfection in the jungle", "user": "cjthediver", "date": "April 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62600479}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "The staff are friendly, helpful, polite, and eager to help. The food is excellent, and used local produce to enhance flavor. Waking up in the morning to the sounds of the jungle is invigorating. They also have horse riding, and various free activities. Our guide Miguel took us to several adventures: Rio Frio cave, zip line, Rio On waterfalls and ponds, tubing inside a river that goes into an amazing cave, and Mayan ruins. His knowledge of flora and fauna was excellent.", "title": "rustic luxury", "helpfulness": 1, "user": "abh123456", "date": "April 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 61919297}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Chaa creek is an excellent place to base your stay in Belize. it's about 1 1/2 hours away from the airport. Many of the attractions in Belize are spread out and take a while to get to. Chaa Creek is a wonderful place to return to after exploring this amazing country. I hope to return some day.", "title": "If you're only using this as a place to stay the nights it's ok", "helpfulness": 1, "user": "photographer5", "date": "April 15, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 61387865}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "We loved our stay at Chaa Creek. It was our first destination in Belize, and it was wonderful to have our driver waiting for us at the airport. After a pleasant drive west, we arrived at our cabana (#16) which was wheelchair accessible. Arriving in the room was wonderful: our towels were folded like swans on the beds. The rooms and bathrooms are really beautiful. We loved our outdoor shower and the fact that you can drink the water from the tap. The only bummer about our room was that it was near the bar, so we could hear music and people until the bar closed (maybe around 10 pm?). The food at the resort ranged from OK to really good. We loved the tortillas at breakfast, the drinks by the pool, and the lunch menu. Dinner was disappointing (bland), so we often ordered off the lunch menu. We loved the bird watching tours in the early AM, and the tour of the Mayan organic farm was interesting. We paddled down the river to San Ignacio (boring and hot). We liked our tour to Xunantunich, but our guide was just OK. We had a great time paddling at Barton's Creek caves. We lounged by the salt-water pool, and enjoyed drinks at the bar before dinner. The grounds are GORGEOUS, and we loved seeing howler monkeys, butterflies, and all kinds of toucans on the property. As a wheelchair user I needed a fair amount of help to get up the hilly terrain. There are two steps into the Dining Room and another couple into the bar area: the staff were happy to left me. I was able to access the pool through the towel room. The shower inside our bathroom was too narrow for me to access, but the outdoor shower worked well. Everyone was very willing to help. We met some interesting people and generally enjoyed the luxury of the resort. We especially enjoyed chatting with the owner. We picked up that they might have a booking problem: they knew I used a wheelchair, but had us move from one room to another after the first night (the rooms were identical, but the first night we had the access the room by crossing someone else's outdoor seating area). We heard a number of other guests complain that the hotel had messed up their arrival dates, and one family had to stay at the 'camp' for one night.", "title": "Simply Fantastic...", "user": "SKinTX", "date": "April 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 61245952}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "There is no nightlife at Chaa Creek and very little interaction between guests. The rooms are rather basic, no air-conditioning (there are no glass windows, only screens), no television and no refrigerator. The lack of a locking door is an issue, however a small safe (about 6\"x18\"x12\") is available in the room for wallets and cameras. The variety of food is limited and is not included in the bill (I feel obligated to mention that every member of my group was taken ill by the end of our stay, but this could have been simply due to the fact that we were not used to the types of food served).", "title": "Great place to stay in Belize", "user": "dopeschool", "date": "April 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 61038108}, {"rating": 4.0, "title": "loved chaa creek", "text": "I recently came back from a 4 night stay at Chaa Creek. We were a very large group of 13 family members traveling together. The room, the grounds, service, and setting were incredible. Very clean and beautiful rooms. No AC was not a problem the ceiling fans wer more then enough. A couple of us had problems with bugs in the room but most did not (we were after all in a jungle setting and expected some bugs.) The staff was great. Denise the concierge was very helpful arranging outings for us. Everyone was so helpful and friendly. I though no phone and TV was going to be a major problem for the younger member of our group but was not. We talked and played together more. There is a lot to do around the lodge. If night life is your thing make your stay short but really worth it. The new pool will be a great addition. The food was very good for the most part. (try the great teas and drinks at the bar) Traveling from the airport was long but our driver was great, we stopped for lunch so it was not bad. Will definetely go back. The owners are friendly and should be proud of their place", "user": "yolsl", "date": "August 8, 2008", "id": 18756725}, {"rating": 5.0, "title": "Book a vist you won't be dissappointed", "text": "Myself and my wife have just returned home from a trip to visit family in Belize. During our holiday we were fortunate to spend a night at Chaa Creek, this was without doubt the highlight of our holiday.", "user": "UkBeenthere", "date": "August 4, 2008", "id": 18620451}, {"rating": 5.0, "title": "Most relaxing resort with genuine, caring staff", "text": "First of all let me reassure anyone reading the reviews about Chaa Creek this place is just great, peacefull and relaxing much of which is down to the attention and hardwork of all the staff. we were fortunate to have breakfast with the owner and it is obvious that all her team have brought into her vision for the resort and that reflects in their attention to detail when dealing with the guests.", "user": "lasw710", "date": "August 3, 2008", "id": 18584011}, {"rating": 5.0, "title": "Best trip in Years - Chaa Creek in Belize", "text": "A lot has been said about the bugs in the rooms, hello this is a Jungle Resort and it delivers everything it says on the tin and this includes the odd bug or creepy crawly, if you want to limit the amount of these little crittiers you find in your room when you return to it after dinner don't do what we did and leave all the lights on in your room, big mistake.", "user": "tempest0109", "date": "July 28, 2008", "id": 18342173}, {"rating": 3.0, "title": "A jungle experience....", "text": "As for the food all I will say is give it a go and don't be put off by strange or different items on the menu, I'm a pretty fussy eater and was a little concerned when i read the menu for dinner , however I tried it all and enjoyed it all.", "user": "tuffybear", "date": "July 6, 2008", "id": 17584392}, {"rating": 5.0, "title": "Our favorite! Gorgeous cottage, Loved Restaurant, Beware Spa!", "text": "We traveled all over Belize in November 2007. This hotel was our favorite.", "user": "Stephanie B", "date": "September 23, 2008", "id": 20303699}, {"rating": 5.0, "title": "Chaa Creek - Serenity, Beauty and Total Relaxation!", "text": "We spent one night in a double occupancy cottage.", "user": "dld8", "date": "September 17, 2008", "id": 20145324}, {"rating": 5.0, "title": "A great home base", "text": "The owners had apparently recently brought back new furnishings and decorations from BALI -- but it was a beautifully, elegantly appointed cottage w/ outdoor jungle shower. Everything was in perfect/ working condition. The room was reasonably spacious, the bathroom was bigger than average and the outdoor shower was set in a small private garden setting. There's a recessed patio area out front that we shared with the adjacent 'cottage' and there's hammock in the closet that you can relax. I loved the hammock. The restaurant was delicious. I thought that the cocktails could have been a little stronger -- but we enjoyed the healthy and delicious cooking. There is a nice bar adjacent that we just glanced at, but that looks like a nice, polished place to kick back and hang out. There are trails to walk around and canoeing/ kayaking nearby but we did not have time for this. We found some nice coasters in the gift shop.", "user": "momsrule", "date": "August 31, 2008", "id": 19575717}, {"rating": 5.0, "title": "Paradise in the jungle", "text": "The cons? They were mowing lawn both days we were there and it was LOUD. Very not relaxing. The BIG disappointment was the Spa. I paid for a full hour of some Mayan technique massage. The lady that I had was nice, but the massage did not feel good - I felt that the technique was lacking and the pressure was inconsistent. But I had no idea what I was in for later. The next morning at Chan Chich lodge, I got up early to go bird watching despite severe neck pain as a result of my massage and I had to let it go because I was unable to move my neck to look around with the binoculars. I have never before sustained such painful muscular injury that persists after a massage. But, this was our favorite place...we LOVED our cottage.", "user": "Yuki_8", "date": "August 27, 2008", "id": 19449825}, {"rating": 5.0, "title": "Don't miss it!", "text": "I was a recent guest at Chaa Creek and was amazed by the beauty of the property, accomodations and most importantly the staff! The property definitely rates as one of the best not only in Belize, but in all of Central America!", "user": "adventurer08", "date": "August 16, 2008", "id": 19017547}], "location": {"country": "Belize", "region": "Cayo", "continent": "Central America", "city": "San Ignacio"}, "stars": 3.5, "variance": {"poor": 7, "average": 21, "very good": 60, "terrible": 2, "excellent": 348}, "aka": "The Lodge At Chaa Creek Hotel", "slim_ranking": 0.294117647059, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "For over 30 years Chaa Creek has been providing a comfortable base for exciting inland adventures for thousands of visitors, from explorers, scientists, filmmakers, research groups, students and people of all ages looking for intellectual and physical stimulation in Belize's vibrant rainforest - the heartland of the Maya. We also realise that any rewarding adventure is enhanced by comfortable accommodations and excellent food. Our 23 palm thatched cottage rooms ensure a good night's sleep and delightful mornings accompanied by the sing song of a rainforest waking up, and guests can choose a Complete Garden Suite, an Orchard and Spa Villa, Macal Cottage or Tree Top Suite, all equipped with a Jacuzzi for even extra comfort. As one example, under our Chaa Creek Cares program, 10% of all accommodation revenue goes straight into environmental and social programs, and in supporting Green and community groups. We sleep better, and you will too, knowing that your stay at Chaa Creek has a positive effect on Belize and our very special pristine natural environment. Families share some of life's most cherished moments - and memories - during a Belize family vacation. And to guarantee a family vacation that everyone will enjoy, multi award winning Chaa Creek is the only Belize destination you'll need. Our affordable, all inclusive family friendly adventure holidays are absolutely stress free and bring everyone closer together through sharing a variety of amazing adventures along with quiet moments to reconnect - all in a stunning rainforest setting. Nature and romance bloom year round in the stunning beauty of Belize. Our all-inclusive romantic vacation packages allow lovers of all ages to immerse themselves in nature and each other. An exquisite rainforest filled with colourful tropical birds, canoe trips down the meandering Macal river with the misty Maya mountains in the background, unwinding together in your private Jacuzzi surrounded by a tropical garden, couples massages, candlelit dinners and sharing once-in-a-lifetime experiences create the perfect conditions for love to flower."}