{"user_rating": 4.5, "review_count": 779, "name": "The Annabelle", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We were greeted on arrival with a refreshing cool towel and an iced lemonade drink. We had booked a garden room but were given a free upgrade to a room with a partial sea and pool view. The room was directly above the outdoor dinning area and if you had the balcony doors open during the night there was some early morning noise from staff laying tables for breakfast. This was not an issue for us.", "title": "Excellent Hotel", "user": "Tom186356", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 162080284}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "The bedroom was a good size and very clean, as were all areas of the hotel.", "title": "A very good hotel", "user": "Hamish O", "date": "May 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 162013351}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Food at both breakfast and dinner was excellent with a good choice of freshly cooked items. Dinner in the evening was generally themed on a different country's cuisine for example French, Italian, Chinese.", "title": "Fantastic hotel", "helpfulness": 1, "user": "Rita D", "date": "May 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161883712}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "All of the hotel staff were extremely helpful and courteous.", "title": "\"Excellent staff\"", "helpfulness": 2, "user": "Tom186356", "date": "May 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 161820512}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "Guests did tend to reserve sunbeds around the pool but the hotel has a rule that if beds remain unoccupied then towels will be removed.", "title": "Highly Recommended", "helpfulness": 3, "user": "Sean W", "date": "May 25, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 161809016}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We decided on a break to somewhere new and found good reviews on the Annabelle. Arrived on 9 april for a week and were not dissappointed. Upgraded to half board and a lovely view from the room of gardens and the sea. Staff all very helpfull especially Cipriani, Evangelina and Julia in the restaurant where the food excellent and the evening buffet varied with each evening.", "title": "luxury break", "helpfulness": 3, "user": "charliecrewe", "date": "June 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163877190}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Gardens and pool first class, thoughly enjoyed our holiday and will return, thank you.", "title": "\"Garden Heaven\"", "helpfulness": 3, "user": "charliecrewe", "date": "June 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163849930}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The Annabelle & flights were booked for my birthday, on-line instead of using an agent. The price was cheaper & because it was the beginning of May, we received half-board for the price of B&B. On arrival, we were greeted with a lovely refreshing cold drink and our cases were taken up by a very charming porter. Our room was like the rest of the hotel, clean, beautiful & stylish. We had a balcony which over-looked the side gardens & the sister hotel, not a prime site but it was nice. After unpacking we went for a walk aroung the beautiful fragrant gardens which surrounded the terraced pool, waterfall & lagoon areas. On the beach front they had a champaign & seafood bar restaurant which opened during the day, this was also used for the traditional Cypriot nights which are well worth a visit & very entertaining with fab food. Follow the path along the sea front takes you past a whole host of restaurants, shops & coffee bars, making the Annabell perfect for a lazy, chill-out holiday. The quality of the food & local wines were very good. The staff were exceptional & always eager to help, your room is cleaned every day & they turn down your bed at night, leaving a flower and verse on your pillow.....a lovely little touch! The Annabel is a well deserved 5* hotel & it's no wonder people return year after year............I know that because we met some of these lovely people. The hotel caters very well for couples, family & travellers on their own. The hotel gardens are a beautiful background for weddings as well as having fabulous function rooms.", "title": "Our 6th visit and we still love it!", "helpfulness": 2, "user": "FlipperClaire", "date": "June 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163569364}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Hubs and I were due to fly out to the Annabelle in early May to celebrate my fathers birthday but due to some sporting issues and an emergency op we had to change our dates. The wonderful Efi could not have been more helpful in moving our booking and the staff behind reception were also super helpful when it came to upgrading our room as we needed more space.", "title": "Not 5 star", "helpfulness": 5, "user": "sueNofolkEngland", "date": "June 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 163346596}, {"rating": 5.0, "title": "Excellent Hotel", "text": "We were a little disappointed in the early morning scrum for sun beds and In fact found out that some people went down at 6am and then went back to bed once they had their beds, but I. Sure the management will work out how to deal with the issue over time....", "helpfulness": 2, "user": "Kirstie S", "date": "June 6, 2013", "id": 163152234}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Lovely hotel, 5 star public areas but our room was no better than others we have stayed in. The food was not special either and the entertainment was very poor, probably aimed at a more upmarket audience who like the cello and grand piano type music. However the staff were fantastic. The pool areas and all areas adjoining down to the beach were superb. Good value for money although beware the bar and prices, especially the wine and tea and coffee prices.", "title": "Terrific location", "helpfulness": 2, "user": "suzywilliams", "date": "June 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 162892536}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We moved from the sister hotel to the Annabelle for a more quiet location, as there were too many children and babies at the Almyra. Both hotels are great and staff excellent. We had a lovely sea view room at the Annabelle, with a small balcony overlooking a pool. which is just a decorative one, and lush gardens. We loved this hotel and our room, which was on the 3rd floor. There are lovely dotted places around a swim up bar called The Grotto, and we whiled away many a pleasant hour or so there. A lovely place to stay and we will definitely go back. Weather was fantastic every day, but getting hotter so would not want to go much later than April/May.", "title": "Lovely hotel, lush gardens and great rooms", "helpfulness": 2, "user": "leonie32", "date": "May 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162522070}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We stayed at the annabelle for two weeks in May, we booked through a private agent last minute...on arrival we were greeted by Effi on reception she checked us in and gave us a refreshing drink and showed us to our room number 18 which was lovely with a view of the harbour...and had our own little courtyard garden. Effi continued to assist us with other requests on our stay she was excellent.", "title": "Must read!! Hotel annabelle, brilliant stay , fab food, amazing staff will be back! Dont look just book!!", "helpfulness": 6, "user": "James N", "date": "May 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162329732}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The grounds of the hotel are amazing, we have stayed here before and it was more mesmerizing this time! We were on a half board basis with breakfast & dinner at ghe fontana which was excellent - fresh salads and a choice of hot meals with a differen theme every night! My only quip was that i am vegetarian and sometimes i would of liked to have had a vegetarian mousakka or lasagne this wouldnt of taken long to make next to the big main meat lasagne or mousakka.", "title": "Pretty good!", "user": "cll_london", "date": "May 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 162304119}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "We visited the gym at the alymyra which is the hotel next door, the facilities and spa there are amazing so if you fancy a change of scene from the annabelle pool...breakfast is the man meal for everyone i would suggest getting up early if you like peaceful atmosphere as by 930am everyone is v hungry and rushing around!!", "title": "What a gem in paphos", "user": "Margaret244", "date": "May 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162249837}, {"rating": 3.0, "title": "Not enough sun beds for guests", "text": "Have visited Paphos many times and are currently staying at the Annabelle. Would agree with previous comments that this hotel badly needs upgrading to compete with others in the area. Cannot fault the staff who are extremely polite and friendly. Major issues with sun beds to be honest there are just not enough and if you leave your beds unattended the towels get removed you can't even go for a long swim or lunch. If you don't reserve a bed by 8am you will not get one. Will not return here, shame as it is in such a good location.", "user": "beaubrummie", "date": "June 14, 2013", "id": 163971084}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Great hotel very friendly efficient staff. Buffet food of a very good standard with none of the bun fight usually associated with the Spanish hotel variety. Some may consider the drinks expensive, but the hotel needs to make a profit on food and beverages, in order to support the number of staff.", "title": "Very Good Standard", "helpfulness": 1, "user": "Ron L", "date": "June 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 163943220}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "You want good service, you have to pay a little extra. One small negative although I do not have the answer to the problem of towels on deckchairs. At 8.00am the poolside is open and a bit of a dash for the prime spots with parasols.", "title": "EXCELLENT HOTEL", "helpfulness": 1, "user": "saintcombs", "date": "June 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163942715}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We could not have stayed at a better hotel. We were given a large room with a balcony overlooking the harbour and the pool. The food was excellent except for 1 evening which was an asian theme which we do not like, but there was plenty other food for us to eat. The staff were really friendly and could not do enough for the guests. Nothing was too much trouble. I just read about another family staying at this hotel with a poor review, and I could not think that they could have been staying at the same hotel as us.", "title": "Lazy Days", "helpfulness": 2, "user": "SandyBeach76", "date": "June 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 163939822}, {"rating": 3.0, "stay_parameters": "Stayed June 2013", "text": "We have been to the Annabelle several times and we picked it this time for a holiday in the sun at a hotel which has elegant gardens and a spacious pool area and attentive staff. We like sea view rooms with a balcony where we can read in the late afternoon and enjoy a \"sundowner\"", "title": "NOT 5*", "helpfulness": 5, "user": "Chloe799", "date": "June 13, 2013", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 163911441}], "location": {"country": "Cyprus", "continent": "Europe", "city": "Paphos"}, "stars": 5, "variance": {"poor": 39, "average": 95, "very good": 223, "terrible": 8, "excellent": 414}, "aka": "The Annabelle Hotel", "slim_ranking": 0.221052631579, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}}