{"user_rating": 4.0, "review_count": 26, "name": "The Commodore", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We stay at the Commodore every year. Yes, it is not new, it is not as fancy as new monster-high rise condos... it is not a lot of things.", "title": "Not the newest...but one of the best values for a comfortable stay on the beach", "helpfulness": 5, "user": "wilbret", "date": "August 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116699092}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "What it is, is...", "title": "Don't stay here...", "helpfulness": 3, "user": "Jim C", "date": "August 11, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 4.0, "value": 1.0}, "id": 116564542}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "At the \"quiet\" end of Thomas Drive. Convenient and none of the \"strip\" traffic.", "title": "loved it very clean", "helpfulness": 3, "user": "harleyboater", "date": "August 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0}, "id": 116294100}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "All rooms are gulf view.", "title": "Favorite Family Condo", "helpfulness": 3, "user": "Ashley C", "date": "June 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114829618}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Plenty of parking. No parking decks or crossing streets.", "title": "Right on the beach and very affordable in the off season", "helpfulness": 5, "user": "cburn", "date": "October 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83719693}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Our first visit to Panama City Beach was Great. We stayed at the Commodore Condominiums on the east end Thomas Drive. I would stay here again. When looking for a condo I look for cleanliness and comfort above all. I have a few basics that one has to meet: Clean, Good Bedding, Washer/Dryer in unit, Dishwasher. Every thing else is just extras. After all we're just renting. A co-worker had recommended this complex. We've stayed in several condos on the gulf coast over the past several years and this 2b/2ba condo #603 was probably the cleanest condo we've ever stayed in. It doesn't appear to be the newest complex but it is well maintained. The bedrooms were roomy. The master had a king bed, private full bath, and large walk-in closet also walk out to the balcony. The 2nd bedroom had a full and queen size beds and large walk-in closet. There was also a pull-out sofa bed in the living room. All more than enough room for the three of us. The kitchen had every thing you might need to cook in. Dining area had a large table w/ 6 chairs and also a bar w/ 2 stools. The living room had the sofa, love seat and an odd chair. The view from the living room out onto the balcony was a beautiful unobstructed view of the gulf. The pool area was pretty and had a kiddie pool and hot tub. They also have on sight security. The security guards are super friendly and do not cause any inconvenience to Commodore's guest. Just extra peace of mind.", "title": "Comfortable Clean Cozy The Commodore Condo", "helpfulness": 4, "user": "ky40741", "date": "October 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 83531752}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "I stayed at the Commodore with my boyfriend and my parents. We rented a 2 bedroom condo for $135/night. Go to their website and look at the specials. I rented 6 nights and got the 7th night FREE. The room was very spacious and stocked with everything we needed. Full kitchen, washer & dryer, dish washer, a huge balcony and a great dining room and living room. The decor was beach themed but mature and well put together. We stayed on the 5th floor and we had a great view of the beach and all the amazing sunsets. The staff was very friendly, even the service guys were nice on the elevator! The pool was great. It was large and heated. Also there is a kiddie pool and a poolside hot tub :) Beach access is perfect with chairs for renters and the beach there was very clean and not crowed. The water was shallow for several hundred yards and St. Andrews Bay Park was within walking distance. I plan to stay here for now on!", "title": "Best room I ever stayed in for THAT price!", "helpfulness": 4, "user": "GaKitten23", "date": "August 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38978550}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "We arrived on the 11th of May the clerk was friendly and helpful. No snotty attitude here. We made our way to our room, 1207. A simply decorated 2 bedroom condo. Very nice furnishings. Flat screen TVs in Living and bedrooms. The carpets has been cleaned recently. The pool area was uncrowded as was the beach. All pools and spa were well chlorinated and clean. The facility was in the process of doing some work on the different floors there (Painting and floor refinishing), But there was no problem or noise from that. The elevators were clean and actually interrupted a staff member mopping them out. You have to remember that these are outside access elevators and have people with sandy feet in and out of them all day, so a little sand now and then is expected. We spoke with a few of the people that lived there and had nothing bad said about the renters. Apparently some one had some bad info as they were in the process of doing some outside restoration work. The Kitchen was well stocked with the necessary utensils and had no problem there. The one thing I can say about the overcrowding issue is to go \"off season!\" No traffic no crowds. I just failed to find any of the problems in the past two reviews that they did. Great location away from the main strip and close to the main bridge back to PC.", "title": "Another fun stay at the Commodore!", "helpfulness": 6, "user": "DJwog", "date": "May 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30060136}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "This is a very family oriented resort. Our family has stayed the past 5 years in a row. It is in a area of Panama City Beach that is semi secluded. We had stayed in other condo's in the area but none compared to The Commodore.", "title": "It doesn't have all the bells & whistles as the newer complex but is awesome.", "helpfulness": 5, "user": "Schrute", "date": "May 4, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 2.0, "rooms": 3.0}, "id": 29327914}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The down fall is that it is an older complex so it is not all up to date on several things. Another downfall for some is you can't walk to the hot spots you have to drive.", "title": "I can't recommed it.", "helpfulness": 3, "user": "summerwindKentucky", "date": "October 3, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 20590203, "likes": {"liked": "— location - it is at the end of PCB near St. Andrews Park", "disliked": "— Condo was sub par"}}, {"rating": 5.0, "title": "A Taste Of The Good Life", "text": "I had a wonderful time here.I came down with some friends.We got up in the mornings and watch the dolphins come right up to the beach almost but of course by the time we got down the elevatorand got out there they would be gone .Beautiful place very pretty at night especially during the fireworks. Would definetely recommend it toanyone needing a good quiet vacation", "helpfulness": 2, "user": "angelface694u", "date": "April 2, 2008", "id": 14752006}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "We have returned here almost every year for the past 15 yrs. Great family atmosphere. Quiet end of the beach. Walking distance to State Park & Jetties. Friendly, & clean. Top Notch! We have always stayed on the 12 floor in Executive Suite 1208! This is our family's favorite vacation spot.", "title": "Best on the beach", "helpfulness": 4, "user": "kittysmith", "date": "March 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14082247, "likes": {"liked": "— Everything!", "disliked": "— When it was time to go home!"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "I would consider this a good value. The accomodations were very clean and roomy. No complaints at all about the room itself, we were in a 2BR/2BA room 708 and it was nice. The TVs need to be updated or at least have buttons. The Hot Tub was nice and the kiddie pool is average. I do think the main pool is a bit small for the number of units the Commodore has. Everytime we went there is was packed and we did not enjoy ourselves at the pool at all. It didn' help that there was a family reunion of very rude people there either. Anyway the beach area is very nice and well kept and the location is great and super close to several awesome restaraunts (Cptn. Andersons, Boatyard, Montego Bay, and Treasure Ship). I would recommend this place, for the money it was nice. (About $130 a night) Bryan Ray", "title": "Average", "helpfulness": 3, "user": "AtlantaBry", "date": "September 5, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8659590, "likes": {"liked": "— Spacious bedrooms", "disliked": "— Small Pool"}}, {"rating": 5.0, "title": "Bang for your Buck!", "text": "Nice complex. Stayed in E-7 on 7th floor.", "helpfulness": 2, "user": "sassyo", "date": "September 15, 2006", "id": 5803351}, {"rating": 5.0, "title": "The Commodore is great!", "text": "If your party is small, unit sleeps 4 with queen bed and queen sofa.", "helpfulness": 6, "user": "Octagon8", "date": "May 24, 2006", "id": 5226338}], "location": {"country": "United States"}, "variance": {"poor": 4, "average": 4, "very good": 7, "terrible": 0, "excellent": 11}, "aka": "The Commodore Hotel Panama City Beach", "slim_ranking": 0.666666666667}