{"user_rating": 4.5, "review_count": 67, "name": "The Strontian Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The UK restaurant reviewer AA Gill says his third law of restaurant food is that \"the quality of the food is always in inverse proportion to the quality of the view\". And while this might not always be the case, we felt it was accurate for the Strontian Hotel. The views over the loch are stunning, but we felt that most of the food had come straight from the freezer. Portions were ample but the menu was very average (and below average for children).", "title": "Great view, but......", "user": "Blackstone", "date": "September 15, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 41906036}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "There were a number of other issues with our stay. First, at no time before or during our stay were we asked to register or provide evidence of who we were (apart from providing credit card details). Second, our bill was hand written on a compliment slip itemised as just food, accommodation and drinks. Third, rather than receiving a warm welcome on arrival the owner seemed surprised by our entrance (although she quickly composed herself and found our booking). Fourth, there were used towels from the previous occupant behind the bathroom door. Fifth, the bedroom was superficially clean but not as clean as it should have been. And finally, the heating was off in the residents’ part of the hotel and even in late August there was a pervading smell of damp (towels used in the morning were still not dry on our return in the evening).", "title": "Friendly place", "user": "Busby_traveller", "date": "July 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 35366179}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Individually these gripes might seem relatively insignificant, but taken together they created an overall feeling of a hotel short of capital and run by an amateur. We even heard the barmaid tell a local in the bar that she couldn’t wait to leave the place. I am sorry this is such a harsh review – this could be a great small hotel and the owner is clearly a good, friendly person. But it badly needs some quality outside advice and a dose of hospitality professionalism liberally applied.", "title": "Friendly, unfussy hotel with spectacular view", "user": "pinkfeebee", "date": "July 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 35127632}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "The owner could do worse than take a short break to where we went next – An Taigh-Osda at Bruichladdich on Islay (see separate review). This gem of a place restored our faith in privately run small hotels which had so recently been tested.", "title": "The Best of British", "user": "ABLinABZ", "date": "June 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32671210}, {"rating": 2.0, "title": "Back to the \"All that is bad about British tourism\"", "text": "Well done the young ( local) staff. Service was excellent, the food well prepared and plenty of it, and the bar welcoming and typically Scottish (even down to the Scottish music being played on the sound system).", "user": "A TripAdvisor user", "date": "June 11, 2009", "id": 32142312}, {"rating": 5.0, "title": "spectacular location", "text": "We just reurned to the US after a 3 week trip to Scotland and our first stop was a 5 night stay at the Strontian Hotel and we had a wonderfull time. New owner Michelle is working very hard to make improvements and if she continues in the same direction as she has already taken the hotel it will definitely be a favourite country place to stay. Our room was comfortable and had a spectacular view down Loch Sunart. The breakfasts were huge and served promptly. The staff were also great and we had a good time in the bar mixing with other guests and locals. We would definitely go back!", "user": "jmcuevas", "date": "May 28, 2009", "id": 31031014}, {"rating": 5.0, "title": "Nice visit", "text": "Stayed over night on 23rd May for one night - booked a double room last minute and it was very nice indeed - food was ok and reasonable value for money. Bed was fantastic - we both had a great sleep. The room was nice and cosy with a beautiful view of the bay - we would definitely go back. Breakfast was average but nothing bad - usual cooked breakfast and coffee etc. Not bad at all - it was a shame the weather wasnt great tho'! I would definitely recommend this hotel to anyone wishing to go to this area.", "user": "Moragcam", "date": "May 24, 2009", "id": 30647394}, {"rating": 5.0, "title": "Under new mangement", "text": "We booked the hotel under winter special rate including dinner bed and breakfast which turned out to be great value. The new owners of the hotel since October 09 have really put a lot of effort in bringing the hotel up to modern day standards. We spoke to the owner who was a ex business person and clearly must of stayed in a lot of nice 5 star hotels in her time has incorporated these touches into decor and service of the hotel. We stayed in the newly refurbished Loch view room which has a new bathroom very nice decor gone was any hint of Scottish Highland tack. The food in the restaurant was also very good and worth it even if not staying hat the hotel. The had employed a new chef who was using fresh ingredients, my wife thought the salads where great. Would recommend the hotel especially the Loch view room.", "user": "leisureisbest", "date": "April 3, 2009", "id": 27335821}, {"rating": 5.0, "title": "Fantastic Friendly Hotel", "text": "We have just returned from a weeks break at the Strontian Hotel over the Christmas period. The hotel is situated in an idyllic location, with stunning views from the hotel of the loch & mountains. There are plenty of beautiful walks which are signposted, some of which are directly behind the hotel.", "user": "Grices", "date": "January 6, 2009", "id": 23314554}, {"rating": 3.0, "title": "Great location", "text": "We received a lovely warm & friendly welcome from the owners Michelle & Marilyn, who have recently taken over the hotel. They were very accommodating & nothing was too much trouble for them, going out of their way to ensure we had a pleasant stay. The rooms that they have recently redecorated are beautifully done & are warm & relaxing, we cant wait to visit again to check out the rest of the refurbishment which we are sure will be to the same high standard. The bedrooms were very roomy with en-suite bathrooms & the family room was great for us. The meals were good and the owners were great with the kids, adapting the menu if needed to suit the kids taste (we have 1 child who doesnt like chips!!!). The atmosphere in the bar was great & the locals are very friendly & welcoming too. Overall a fantastic family friendly place to stay & we are already planning our next visit. Thanks to you both once again for making our family christmas special & look forward to seeing you in 2009.", "user": "Karla", "date": "June 30, 2008", "id": 17367593}, {"rating": 5.0, "title": "lovley frendly people make you feel welcome", "text": "i loved the feel of the place everybody was friendly ,and the breakfast was lovely ,i wish the dinner menu had a little bit more to choose from as i love my salads and mash i would also,love to see home made pies but that wont stop ,me returning to this hotel", "user": "tinat63", "date": "February 25, 2008", "id": 13829299}, {"rating": 5.0, "title": "Super Place", "text": "We have stayed twice at the Strontian Hotel, once in 2001 and again in 2005. It was great in 2001, and has only gotten better. They have redecorated the rooms--bigger and updated. Located right at the head of the loch. Finlay is a great host. We had a friend who got sick and they helped us locate a doctor in Archaracle. The pub is hopping on the weekends as this is the main watering hole in town. We called and told them we were coming for dinner and they had a table reserved for us. Can't wait to come back again. This area is the most beautiful in Scotland, in our opinion.", "user": "65Piper", "date": "August 23, 2005", "id": 3801648}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 2, "average": 6, "very good": 17, "terrible": 2, "excellent": 40}, "aka": "The Hotel Strontian", "slim_ranking": 1.0, "description": "Our Hotel is a small highland Hotel at the start of the Ardnamurchan Peninsula. It is a beautiful spot in which to explore the wonderful peninsula and its amazing wildlife e.g otters, seals, pine martins, eagles and of course ideal for bird watchers. We have secluded white sandy beaches and beautiful hills to climb, amazing boat trips and fishing opportunities too !We have just six bedrooms with private residents lounge and dining room as well as a small highland bar serving great pub food. The Hotel is open all year except November and January and we really welcome cyclists, walkers and birdwatchers. We have drying facilities and storage for cycles. We can arm you with maps and suggest beautiful walks and excursions, provide you with packed lunches and cycle hire too. PS Pets are welcome also."}