{"user_rating": 4.5, "review_count": 1566, "name": "The Chesterfield Mayfair", "reviews": [{"rating": 5.0, "title": "Loved the Chesterfield Mayfair", "text": "We spent 9 days at the Chesterfield Mayfair in London. It excelled our expectations. The staff was extremely helpful and friendly. They made us feel at home. The service was prompt and the restaurant served excellent food.", "user": "friendchicagoil", "date": "November 14, 2007", "id": 10825460}, {"rating": 5.0, "title": "Outstanding Hotel", "text": "The hotel itself has retained the old style charm of the past while it has been upgraded. Modern conveniences have been added but the cozy charm has been well maintained. It is charming boutique hotel.", "user": "spendalot64", "date": "November 13, 2007", "id": 10799765}, {"rating": 5.0, "title": "Lovely treasure of a hotel.", "text": "Furthermore, the location is a plus. It is near both the tube and bus stops. Shepherd's Market is only one block away. There we found a number of good little restaurants that were affordable, considering the drop in the dollar.", "user": "MDMORG", "date": "November 12, 2007", "id": 10774923}, {"rating": 2.0, "title": "A question of luck", "text": "We visit London twice a year and The Chesterfield is the only hotel we would ever consider staying. The hotel itself is beautiful - sophisticated and elegant yet small and charming like a private club. The staff is second to none and everyone makes sure your stay is the very best. The bar and restaraunt are excellent - both the food and the very gracious staff. The Chesterfield is like our home away from home.", "user": "blacklab", "date": "November 11, 2007", "id": 10747299}, {"rating": 5.0, "title": "Brilliant Service, Accommodation, Location & Staff!", "text": "We just finished our honeymoon with a stay at the Chesterfield Mayfair. I cannot say enough wonderful things about the room, and the staff. The are warm and attentive. The room was comfortable and beautiful. The location could not be beat. We were thrilled with the quiet, wonderfully appointed hotel. We would absolutely stay there again, and recommend them at the highest level to anyone!", "user": "CarolJL1", "date": "November 8, 2007", "id": 10689023}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "I am surprised at how highly this hotel is ranked by other Tripadvisor members. My wife and I stayed for one weekend night in April. The room was fine, although on the small side as most London hotel rooms are. The bed was OK, but no more than that. The mattress was not of the highest quality - certainly not up to Marriott (where I usually stay when in London on business) standards and not a patch on the ones we have at home, including the infrequently used guest room!", "title": "OK, but restaurant had major problems", "helpfulness": 1, "user": "Jctee", "date": "May 19, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 16207563, "likes": {"liked": "— Quiet room", "disliked": "— Terrible restaurant experience"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Generally the staff were friendly and attentive, although not overly so. At one point in the bar during the evening they all seemed to go AWOL at the same time, and we had to wait quite a while to get the bill.", "title": "Perfectly Charming!", "user": "shoyt", "date": "May 15, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16069928, "likes": {"liked": "— It was everything you dream of a London Hotel as being (and what most fail to live up to)", "disliked": "— Pricey"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "What really let it down was the experience in the restuarant. The table wasn't ready for us when we arrived, even though we had reservations and the place was less than half full. It took almost an hour for the main course (fish) to arrive and when it did it was cold. We had to send it back and wait another 15-20 minutes for them to try again. It was a little better second time around, but still not right and by the time it had arrived we had finished the wine and didn't feel like ordering more. It seemed they had real problems in the kitchen that night. This was probably because it was the weekend and - the hotel mainly being aimed at mid-week business users - many of the key kitchen staff would be taking their nights off. In my experience this is an issue with other business hotels. There is, however, no excuse for poor service, especially given the restaurant prices. One other moan about the restaurant - there was no atmosphere at all. A little music would have helped. To his credit , the restaurant manager responsed to our complaints in a very professional and courteous manner, but he obviously didn't have the staff to resolve the problems. I didn't envy him his job that night.", "title": "Lovely Hotel.", "user": "SHnorfolk", "date": "May 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16030287, "likes": {"liked": "— The experience.", "disliked": "— N/A"}}, {"rating": 5.0, "title": "What a Great London Hotel", "text": "The next morning there was a long line for seats at breakfast, so we didn't bother waiting, but checked out and breakfasted elsewhere.", "user": "bigbird334", "date": "May 12, 2008", "id": 15963076}, {"rating": 5.0, "title": "Extraordinary Hotel", "text": "All in all I would not be in a great hurry to stay at this hotel again.", "user": "njhappy077", "date": "May 2, 2008", "id": 15587192}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "My husband and I stayed at the Chesterfield in August and found it it an excellent choice. It's in a great location in a beautiful part of the city, just enough off the busy roads to give you a sense of being in a neighborhood, while still being close to any exploring you would want to do. But what really sets this place off is its friendly and helpful staff, from the efficient front desk who greet you personally, to the wait staff in wonderful Butler's restaurant. We were fortunate to have our daughter, her boyfriend and two of their friends join us at the last minute for dinner, and Butler's sat us right away at a large table in a nice area that made it feel special. We had a great waiter with the perfect personality who took a personal interest in our group, brought meals quickly to two who had to catch a train, and even accommodated my order for something that wasn't on the dinner menu! That meant a lot to us. Often in a big city you don't get such personal attention. Our room was not large, but that is very typical of London, and it was impeccably decorated and nicely appointed. The Chesterfield is not a large property, so each room is decorated individually, as opposed to a large chain hotel. This gives the hotel a unique personality, and true English charm. My only regrets are that we could not stay longer, and that we missed their famous afternoon tea! I hope to stay at The Chesterfield again soon, and would recommend it to anyone who is looking for a great location and exceptional service in London.", "title": "Wonderful Experience!", "helpfulness": 3, "user": "CaribbeanDreamin", "date": "October 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 142062401}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We stayed a week at the Chesterfield Mayfair Hotel while in London in mid-September. The hotel is delightful, as are all of the staff that we had occasion to interact with. We would recommend this hotel without reservation.", "title": "Great week in London", "user": "Frank W", "date": "October 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141952012}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "This hotel was nothing but pleasant surprises. We arrived at 7:30am weary from traveling and long flights. The staff was very pleasant, provided warm towels and water, a very efficient check-in, and our room was available at this early hour. The rooms are not large, but are very comfortable including the beds, which we used to take a quick nap. The staff goes out of their way to make sure that your needs are met. The location is very convenient. I would definitely recommend this hotel to friend and book it for myself in the future!", "title": "Exceeded Expectations!", "helpfulness": 2, "user": "Ilmgks", "date": "October 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141947042}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Just returned from another superb weekend at the Chesterfield Hotel to celebrate our wedding anniversary. Every aspect of the hotel is fabulous. Every member of staff was welcoming. How many hotels do you visit where staff call you by your name every time then encounter you? Well at the Chesterfield it is the norm and just shows the commitment to personal service. We were fortunate to be ugraded to a suite which was the height of luxury.", "title": "A star of the Red Carnation Hotel group", "helpfulness": 1, "user": "pclarkBerkshire", "date": "September 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141669055}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "If you want to stay in luxury, be treated as an individual and want your needs to always be the first priority then visit the Chesterfield.", "title": "Heaven in Mayfair", "user": "SonoranArizona", "date": "September 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141601821}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "The Chesterfield Mayfair London has become a faded beauty, still interesting, but lacking a great deal.", "title": "A Ghost of a Beautiful Lady", "helpfulness": 6, "user": "Mel_Paris", "date": "June 29, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 17350373, "likes": {"liked": "— Location in Mayfari", "disliked": "— The room and the service"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "I've stayed at the Chesterfield many times and have had wonderful stays. I particularly enjoyed the elegant touches and the high levels of service. Now, the Chesterfield is more like a \"nice Marriott\" than a speccial lady. The location remains a postive. However, the new smoking terraces of the nearby pubs create a din from 6:00 PM to 9:00 PM.", "title": "Fabulous", "helpfulness": 1, "user": "CraigArizona", "date": "June 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17321565, "likes": {"liked": "— location", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "My room was small, but filled with monsterously-sized furniture. The results was a feeling being in a flea market vendor's small shop. The bathroom was so small, that one had to take care not to hit the sink when exiting the bathtub / shower. The closets were ample, but access to them required a contortionist.", "title": "Small rooms but excellent hotel", "user": "PFP", "date": "June 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 17143171}, {"rating": 5.0, "title": "A Classic Home Away From Home", "text": "What can one say about the price. While the Chesterfield is not blame for the weak dollor, the prices have increase over 50% from my last stay 2+ years ago. With the weak dollar, a commercial room was over $500 per day!", "helpfulness": 2, "user": "particularman", "date": "June 10, 2008", "id": 16817968}, {"rating": 4.0, "stay_parameters": "Stayed August 2005, traveled as a couple", "text": "The service staff was, at best professional. The old \"touch\" of the concierge and receptionists has been replaced by young, inexperienced people who do not suceed in pulling it off.", "title": "Chesterfield Mayfair", "helpfulness": 3, "user": "erinWestmeath", "date": "June 3, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 5.0, "value": 4.0, "rooms": 5.0}, "id": 16640209, "likes": {"liked": "— location", "disliked": "— Cannot find fault"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "One of London´s hotel gems. The location is perfect, the staff incredibly helpful, the bar and restaurant beyond one best dreams. All in all home from home.", "title": "London", "helpfulness": 1, "user": "peter_glazier", "date": "October 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 142809488}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "The rooms are a little on the small side but everything else surpasses any comment", "title": "Near perfect hotel, excellent! Susan", "user": "SBarnard", "date": "October 12, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 142684702}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Our stay was 4 nights, September 1-4. We enjoyed the friendly staff, from our breakfast host Caroline to the bartender James. Love the lemon drop & James Bond martini's. The high tea was a highlight. Would highly recommend this hotel for its outstanding service, location, and value.", "title": "Still Love The Chesterfield!", "helpfulness": 1, "user": "Sarawin", "date": "October 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142651449}, {"rating": 4.0, "stay_parameters": "Stayed September 2012", "text": "My husband and I stayed for our 3rd time in the Chesterfield Mayfair in September. And we still love every aspect of it! All the staff is so friendly, the beds are really comfy, breakfast is grand. We love the halls and bedroom walls with their padding, which dampens sounds and makes for a warm, inviting environment. We research other London hotels from time to time to keep ourselves honest, but the thought of going somewhere else and being disappointed is more than enough to keep us from leaving the Chesterfield. We will return again in December! Also, we love the quiet neighborhood and the charm and convenience of Shepherds Market a block away - great choice of restaurants. I don't really want the whole world to know about this gem of a hotel, and I highly recommend it.", "title": "Good place", "helpfulness": 1, "user": "fabry_b", "date": "October 11, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 142578861}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "Really next to the Green Park underground station and near the Soho area, this Hotel is a nice place to stay for work or for pleasure.", "title": "\"Treated Like Royalty\"", "helpfulness": 1, "user": "Jamesdowling", "date": "October 8, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 142312870}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I selected this hotel from the trip advisor reviews for a weekend in London to celebrate my husbands birthday. I have to say we thought the hotel was very well located, a five minute walk to Green Park tube station and we easily walked to Bond Street & Oxford Street. We had a weekend package and thought this fantastic value. Breakfast was excellent, plenty of choice and the smoked salmon was delicious, everything we ate at breakfast seemed to be very good quality. We also had the afternoon tea on our last day as part of our package and again we are big eaters but just couldn't manage it all (and the scones were just the best). Staff were courteous, polite and helpful without being too intrusive (a birthday card for hubby and additional magazines aimed at us were a very nice touch) and our rooms was plenty big enough and very clean. I often stay in London on business and was surprised to read someone thought the road noise was to loud? This hotel is in a residential area and has double glazing and we certainly didn't hear any traffic noise and we were on the front of the hotel.", "title": "Lovely birthday weekend", "user": "Foodforfriends", "date": "May 26, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 16415276, "likes": {"liked": "— Quiet location and value of weekend package", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "This hotel is a little more than we usually pay when in London but we are definately planning to stay when we go back for our Christmas shopping weekend. We had two nights in a deluxe room plus breakfast, 1 afternoon tea and a complimentary bottle of champagne as part of their special 'weekender' package for £390 for two nights well worth booking.", "title": "A Luxury Long Weekend", "user": "Savages", "date": "May 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16229554, "likes": {"liked": "— Attentive staff without being intrusive, there to help when you need it.", "disliked": "— A little road noise at night in our room"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Having stayed many times in London and received excellent service at hotels such as The Dorchester, The Grosvenor etc., I have never been treated to such outstanding personal service as that delivered by The Chesterfield. Absolutely nothing was too much trouble and the staff could not have been friendlier or more attentive in a non obtrusive manner. Special mention is deserved by Loris, the most charming of Restaurant Managers you could wish to meet. Service in the Butlers Restaurant was outstanding whether it be for breakfast, afternoon tea or dinner, as was the quality of the food. The Dormer Suite in which we stayed was extremely pleasant and very quiet with little or no noise from outside or inside the hotel, together with lovely extra touches such as the decanter of sherry!! My wife and I will have no hesitation in returning on our next visit to London as this hotel fully deserves it's Tripadvisor rating.", "title": "Exceptional Service", "helpfulness": 3, "user": "looking4luxury", "date": "June 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 16604947}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I have just returned from the most amazing long weekend in London, staying at The Chesterfield Mayfair. We arrived at the Hotel earlier than the usual check in time however the staff were wonderful, helpful and friendly with nothing being too much trouble. We opted for a superior double room that I just cannot fault, the room was spacious, well decorated and immaculately clean. The bathroom was simply stunning with possibly the best shower either of us have ever experienced! Nice additions such as bath robes and slippers, bottled water plus ground coffee and a caffitier added to our stay. Our rate included afternoon tea which was fabulous with more of all the lovely sandwiches and cakes offered should you wish. The breakfasts were equally as impressive with a huge choice of well prepared hot dishes on offer alongside the usual cold options.", "title": "The best weekend ever!", "helpfulness": 2, "user": "hklee", "date": "May 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16455363}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "Location wise the hotel is ideal, set a little away from the hustle and bustle of the busier areas, there are plenty of ammenities close by. The tube station (Green Lane) is only a pleasant few mins walk away, as is Piccadilly, certainly an ideal base to explore London from.", "title": "Very nice hotel, great location", "helpfulness": 2, "user": "Ramatash", "date": "May 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16422780}, {"rating": 5.0, "title": "Fabulous Hotel", "text": "My wife and I just returned from a 7 night stay in London. We chose the Chesterfield based on online searches and the clincher was the high rating on Tripadvisor. We were NOT disappointed!!!", "helpfulness": 4, "user": "Montreal_Foody", "date": "August 30, 2007", "id": 8548574}, {"rating": 5.0, "title": "Lov-er-ly!", "text": "The hotel is located just off Berkeley Square in the Mayfair district. This is one of the best features of the hotel since if you like walking, you can get to almost all the major attractions on foot. There is also a tube station (Green Park) just a short walk away.", "helpfulness": 2, "user": "mayflower57", "date": "August 24, 2007", "id": 8494204}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "The hotel staff are extremely eager to please. We booked a promotion which included full english breakfasts every day as well as a complimentary bottle of champagne and one classic engish tea.", "title": "Fantastic!! Stay here!!", "helpfulness": 7, "user": "Cat111", "date": "August 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8451885, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The breakfasts were excellent as was the service. The tea was fun too although they serve so much food you can't possibly finish!", "title": "Chesterfield Mayfair - Best hotel in London", "helpfulness": 11, "user": "clc51", "date": "August 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8407919, "likes": {"liked": "— Location, hotel staff, rooms, bathrooms", "disliked": "— internet on TV was cumbersome and they ran out of Internet cards for other computers - minor problem in my mind as this was not a business trip."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "The rooms are exactly as they appear on the website as are the common areas of the hotel. Unlike other hotels, their website is not edited to look better than the real thing.", "title": "Superb Value, Fine Location", "helpfulness": 8, "user": "NHTraveler37", "date": "August 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8400203, "likes": {"liked": "— Location, superb service"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "This was a huge experience. This hotel is located in the middle of beautiful Mayfair and has everything that comes to one's mind when you think about an English top hotel. From the carpet to the pastries, from the breakfast to the doorman, everything is sooooo English.", "title": "Uber-british hotel in topstyle", "user": "tjp1994", "date": "October 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 143600594}, {"rating": 4.0, "stay_parameters": "Stayed October 2012", "text": "Rooms are a bit dark, but that's typical with that carpet and all those thick curtains. It sleeps fantastically. Can recommend the hotel. Folks are friendly and again locationwise it can't be better", "title": "Pleasant but small room", "user": "Fysmd", "date": "October 18, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 143164700}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Service is fantastic and the meeting facilities too. I found my room small but well presented. Bed very comfortable but too many gadgets with lighting the room up all night with Illuminated Displays, LEDs etc.", "title": "Excellent accommodation and food in Mayfair - Can't go wrong!", "user": "Bazza-Ruto", "date": "October 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 143117343}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Wifi wasn't terribly reliable and iPad and phone needed Ro continually re-enter the access creds.", "title": "Splendid tea!", "user": "Alcabe", "date": "October 15, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0}, "id": 142877463}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I stayed at this hotel In November of 2011, whilst on business. My room was tastefully decorated, clean and very comfortable. The room overall was of a high standard. The food was excellent, including a very good breakfast in the mornings. Hotel staff were very helpful and courteous at all times. I will most definitely choose one of the Red Carnation Hotels again when I'm back in London, whether it is for business or pleasure. Excellent overall hotel experience. Met my expectations in full.", "title": "Absolutely B****y Fantastic", "helpfulness": 1, "user": "Newkybroon_777", "date": "October 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 142813218}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "I stayed for a weekend .The hotel simulates traditional English luxury in the middle of London which is difficult to find these days. The place has a lot of character into it . The linen and towels are superb .The bed is very comfortable .The rooms are small but the fact that there is a lot of attention to details compensate for this.", "title": "Traditional English", "helpfulness": 1, "user": "Tayseer m", "date": "September 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 141595188}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "After reading the reviews I chose to take my BF here for his 21st bday for our first afternoon tea experience. Very happy with my decision! The staff were very lovely, the hotel was beautifully presented and there was a lovely selection of cakes and sandwiches. They offer to fill the food up for you too! - not that you'll need it though cos it's very filling. Really nice selection of teas and the glass of champagne gave it an extra bit of 'special'. Definitely recommend asking to be seated in the conservatory as it's more laid back and very pretty. Perfect for any special occasion and the staff are very accommodating. It's only a 5min walk from Green Park Tube station and very easy to find. Also - dress code is smart casual.. we went in jeans and smart shirts/tops and shoes which was appropriate.", "title": "Champagne afternoon tea - lovely!", "helpfulness": 1, "user": "pinkbecky13", "date": "September 28, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0}, "id": 141477521}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Only stayed 1 night - wish it was longer. The Hotel was beautifully decorated and all the staff were really pleasant, happy and polite. The room we stayed in (Room 425) was lovely, beautifully presented and immaculately clean. Loved all the little extras - dressing gowns, slippers, bottled water by the bed, lovely toiletries and the chocolate nibbles left on the pillows with the Turndown service. Best bed I have ever slept in, AND you can request different pillows to suit yourself. This was a 'surprise' trip for us for our Silver Wedding Anniversary and on mentioning this to the breakfast staff, we were presented with a decorated 'Congratulations' cupcake and a glass of Bucks Fizz. Couldn't fault this Hotel - Highly recommended.", "title": "Beautiful Hotel", "helpfulness": 2, "user": "Joanne S", "date": "September 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141317370}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "My stay at the Chesterfield Mayfair was excellent. The rooms are average sized for London, but adequate. Room service was prompt, the food was great. Both the bar and the restaurant were very good. The staff was friendly and helpful. There is not an on site fitness centre, but guest passes to a nearby gym are available.", "title": "Great hotel, great location", "helpfulness": 1, "user": "Steve H", "date": "September 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141312306}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We researched SO many hotels for our 4 night stay in London. We really like the Mayfair area so we narrowed it down to only hotels in Mayfair. We read all the reviews and ultimately chose The Chesterfield based on location. We booked the best available rate for the King room with breakfast promotion code. It worked out to be 180GBP plus 20 percent VAT....", "title": "Location, value, service", "helpfulness": 1, "user": "jtp123", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141105017}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "My girlfriend took me here for a weekend break for my birthday.", "title": "Great Location and Service", "helpfulness": 4, "user": "Benjamin_S", "date": "July 8, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 17655981, "likes": {"liked": "— Location and Service", "disliked": "— Noisy Air con"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "She wanted a good base for easy access to the city.", "title": "Excellent!", "helpfulness": 2, "user": "EuroDiva", "date": "July 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 17636478, "likes": {"liked": "— The high level of service", "disliked": "— Pricey restaurant"}}, {"rating": 5.0, "title": "best hotel in london", "text": "stayed at the chesterfield for 2 nights at the beginning of november. wonderful experience, the staff cant do enough for you (highly unusual in london), the rooms are immaculate, food exceptional, especially the roast of the day and the superb breakfast. the location of the hotel tops it off, just quite simply the best hotel in london. i wont even consider staying anywhere else in the capital again.", "user": "mthomas75", "date": "November 8, 2007", "id": 10691573}, {"rating": 5.0, "title": "Wonderful Hotel!", "text": "The Hotel is run by the same people that run the Milestone, one of Englands top small hotels and the same professional management is evident. The staff is friendly and helpful. The room was comfortable and well decorated with that \"English\" look. I actually liked the Chesterfield better than the Milestone (we stayed there September '06) because the Chesterfield is closer to the major attractions and the theater district. You are about a 5-10 minute walk to the tube and there are a number of good restaurants close by. I would definiely stay at the Chesterfield Mayfair again!", "user": "Csora2547", "date": "October 27, 2007", "id": 10364014}, {"rating": 4.0, "title": "wonderfull staff", "text": "Excellent old style hotel!", "user": "Coeury", "date": "October 8, 2007", "id": 10056777}, {"rating": 4.0, "title": "Chesterfield Mayfair - Service like no Other", "text": "wonderful suites! I've seen most of them and they are amazing", "user": "Canada_One", "date": "October 8, 2007", "id": 10054625}, {"rating": 3.0, "title": "Good hotel with personal service", "text": "sdt rooms a little small (for my taste but normal for such a typical building)", "user": "judyumcer", "date": "October 7, 2007", "id": 10051941}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The CM staff cannot absolutely do enough to make your stay the best possible. We requested a room with two beds, and although we were upgraded to a junior suite (sweet) the bed was a double that was not split. They had just upgraded the room and converted two small singles into a jr suite. In a few moments staffers were in the room fixing the bed.", "title": "This hotel is great!", "helpfulness": 1, "user": "JenniferHongKong", "date": "October 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 10047957}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The room had so many amenities it's hard to list them all. Many bottles of fresh water were made available daily, each evening a complementary hors d'oeurves were provided (smoked salmon; quail eggs), and also newspapers. There was more.", "title": "Can't wait to go again", "helpfulness": 2, "user": "jetjez", "date": "October 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10033718, "likes": {"liked": "— the staff", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Like all hotels in Europe, rooms on the small side, even the jr suite. My only negative is that the rooms at the CM seem to be a bit overdecorated and a bit too much stuff crammed into them.", "title": "Fabulous Chesterfield", "helpfulness": 3, "user": "guyChannelIslands", "date": "September 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10009051, "likes": {"liked": "— Homely and clean"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled solo", "text": "I stayed at the hotel from the 24th to the 28th of April 2008. I booked it after I read the excellent reviews here. My flight was late so I arrived very late at the hotel but I found everything to be ready and waiting for me.", "title": "Great choice. Great atmosphere. Great people", "helpfulness": 1, "user": "Elephant", "date": "May 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 15583226, "likes": {"liked": "— The assurance that on my next visit everything will be taken care of with no mistakes. Given as to who gave me the info I believe it.", "disliked": "— The coffee. They REALLY need to work at it because everything else out of the kitchen is brilliant."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Truth be told there was a mistake with my room but I must say that they fixed it ASAP and with no problems. So please take that into consideration. Mistakes are human and the important thing for me and what I am choosing to remember is how swiftly they were dealt with and the manner in which that was made. What I am trying to say is speak up and your issues will be addressed. And solved. In my case every little or big detail I asked for was dealt with exceptionally by the people there and always with a smile. Non of them seemed to be bored or seemed to do things mechanically. The staff is extremely helpful throughout the hotel but not oppressive. They give you room to breath sort of speak.", "title": "Nice Hotel", "user": "tss", "date": "April 29, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 15483928, "likes": {"liked": "— The location and friendly and competent staff.", "disliked": "— Dinner"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "On another note I loved that people throughout the hotel greet you when you pass by them at any time of the day.", "title": "A very decent place to spend time", "user": "Guybrushtravelz", "date": "April 26, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 15372792, "likes": {"liked": "— The overall atmosphere of a very shiny and polished place"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Gives the place a very friendly atmosphere.", "title": "Loved the Chesterfield", "user": "thart1", "date": "April 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15344012, "likes": {"liked": "— cleanliness, staff, quiet and safety of location ...no worries", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "Being disabled I was a little apprehensive about staying there because allot of the reviews on Tripadvisor state that it is not suitable for people with disabilities. Because of my condition I need things the average traveller does not.", "title": "Still a great Hotel", "user": "BWOverseas", "date": "April 23, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15287651, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "My husband and I stayed in the Chesterfield Mayfair hotel during a week-end just before Christmas, enjoying their so-called \"week-end package\". The location was perfect, the staff very helpful.....beyond expectations. Definitely I would reccomend it and I hope to be back again.", "title": "Lovely hotel", "user": "sbelati", "date": "December 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 11625267, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "My husband and I have just enjoyed a weekend in London staying at the Chesterfield Mayfair. The staff were attentive, polite and extremely helpful. It is a typically olde worlde hotel situated in a quiet street. We found the location to be ideal for shopping, theatres, galleries and just about everywhere else too! Our only one disappointment was the lack of a mini-bar in our bedroom, although they do supply complimentary tea/coffee and water.", "title": "Loved it!", "helpfulness": 1, "user": "JerseyGirl1966", "date": "December 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 11623331, "likes": {"liked": "— Location", "disliked": "— The prices of food/drinks"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "My hubby and I stayed here for 2 nights on 1st and 2nd December. I booked this hotel for a short break for our wedding Anniversary through the Hotels own website.", "title": "Chesterfield delivers again!", "helpfulness": 1, "user": "gubette", "date": "December 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11542211, "likes": {"liked": "— Lovely room and breakfast", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "I chose a 'Mayfair Weekend' package which I have booked before as it is such great value: breakfast daily, complimentary bottle champagne on arrival and full afternoon tea for 2 on one day, all for £215 per night plus VAT.", "title": "Great Service - Great Restaurant", "helpfulness": 2, "user": "ITTS", "date": "December 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 11473368, "likes": {"liked": "— Excellent restuarant", "disliked": "— Bed clothes need refreshing"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "I filled out the guest preference form which you can download from the website after you get your booking through and ticked a few items that we would like in the room: feather pillows, telegraph newspaper etc etc and in the special date/occasion just mentioned it was our wedding anniversary think nothing of it.", "title": "Great Location, Comfortable Stay, Professional Staff", "helpfulness": 3, "user": "redi2travl", "date": "December 7, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 11316236, "likes": {"liked": "— Location"}}, {"rating": 5.0, "title": "deserves its high ranking!", "text": "Perfect location. Quite small but cozy and well appointed rooms. Excellent service. Deliciouse breakfast and tea. Just the nice and peaceful retreat you are longing for after a busy day in London. 5 minutes walk from \"everything\" and still so quiet, both day and night. The staff really seemed to do everything to keep us happy and satified, not because they had to, but because they wanted to. We will definitly stay there again, and have already recommended the hotel to our friends.", "helpfulness": 2, "user": "Fridag", "date": "December 6, 2007", "id": 11285662}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "We stayed at the Chesterfield Mayfair for 3 nights mid September. The location is great, walking distance from the Piccadilly Circus and the Buckingham Palace.", "title": "Great location, great service, charming hotel", "user": "snshn3", "date": "December 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11262494, "likes": {"liked": "— the location", "disliked": "— the price"}}, {"rating": 5.0, "title": "Good central location - charming hotel", "text": "The staff was very warm and friendly at all times, even to my little toddler. The food is overpriced, but that is London for you!!", "helpfulness": 1, "user": "Terps37", "date": "December 1, 2007", "id": 11192553}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The rooms are a good size considering Europe's standards and the bathrooms are very well appointed. We had a great view of the courtyard from our room.", "title": "Not Quite What We Had Expected", "helpfulness": 3, "user": "Mulherin", "date": "November 25, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "location": 5.0}, "id": 11048837, "likes": {"liked": "— Location", "disliked": "— Food"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Overall, we had a great stay and would absolutely stay here again.", "title": "excellent choice great personal service!!!", "user": "Carolanne H", "date": "November 21, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10968039, "likes": {"liked": "— service, bar and location", "disliked": "— room size"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We arrived for a week's stay at the Chesterfield Mayfair and were constantly impressed and pleased by the extraordinary service that was provided. Everyone was friendly and made us feel quite welcomed. Our room was delightful, but a bit on the small side. The bathroom was more than adequate. Our experience in the bar and restaurant was similar; staff just seemed to really extend themselves to make you comfortable.", "title": "The Ultimate in Customer Service", "helpfulness": 1, "user": "Ballyhaise", "date": "July 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 18404444, "likes": {"liked": "— Good value and service.", "disliked": "— Room was on the small side."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "This was our first stay at the Chesterfield Mayfair. Our previous visit to London was at the Stafford (same general area -- much more expensive). We will return to the Chesterfield Mayfair. Great value, great location and a wonderful staff.", "title": "Great Location, Charming hotel if you get a nice room.", "helpfulness": 1, "user": "trvlbker", "date": "July 22, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 18156232, "likes": {"liked": "— Location and size of hotel", "disliked": "— some of the rooms need updating."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "My son and I just returned from a trip to London and Paris. The Chesterfield Mayfair Hotel was our first stop. I had emailed the hotel just after I booked our trip to secure a room with 2 double beds, seeing that I am traveling with my son. No problem, received a prompt reply, it would be taken care of. It was, however, the room we were shown first was drab, depressing and smelled. The next room we took for one night because there weren't any others, was equally drab and depressing, but we both slept well.", "title": "Wonderful hotel with PERFECT staff", "helpfulness": 1, "user": "tigerduck", "date": "July 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18136731, "likes": {"liked": "— The staff and the beautiful room", "disliked": "— The short bed in the first room"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The next day we were upgraded as promised, however they wanted to charge us $200 US for the upgrade. I told them if I was going to spend that I would check out and move to the Ritz Hotel. Didn't think the hotel was worth it at that price, an extra $200 per night. So, upon that they upgraded us to a suite for no extra charge. I was considering moving hotels...but the suite was lovely. The only problem was the noise of cars outside our window at night. It made sleeping with jet lag a little difficult.", "title": "Disabled Guest Review", "helpfulness": 2, "user": "gottakeepongoing", "date": "July 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 17921459, "likes": {"liked": "— Location, safety, quiet, swanky club feeling,", "disliked": "— Asking for assistance (but they were nice about it so I shouldn't complain!)"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "It is a lovely hotel if your room is nice, the suites are nice, the other rooms need a face lift.", "title": "Wonderful staff & hotel", "helpfulness": 1, "user": "smow", "date": "July 14, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 17866564, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "My wife and I stayed at the Chesterfield for three nights in September 2007. We can not say enough about this hotel: the staff was fantastic, the rooms were beautiful, the breakfast cannot be beat, and the location is perfect.", "title": "Loved this hotel!", "helpfulness": 2, "user": "MDKinFL", "date": "September 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8852075, "likes": {"liked": "— The entire experience"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Our weekend package was upgraded from a standard double to a superior upon our arrival. The package included one English tea, a bottle of champagne, and full breakfast each morning. Breakfast was unbelievablel there was a full menu from which to choose. My favorite was the Scottish eggs Benedict (that is a muffin, poached eggs and Scottish smoked salmon). The hotel is about a five minute walk to the Green Park tube station and about a fifteen minute walk to Piccadilly. The hotel is lavishly decorated; we felt as if we were staying in a 19th century mansion. Of course, there were all the amenities: sat. TV, heated bathroom floors and mirror (no fogged-up mirror!).", "title": "A great hotel", "helpfulness": 1, "user": "jim2752", "date": "September 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8839140, "likes": {"liked": "— Friendlyness", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "After traveling in Paris and Zurich, the super friendly staff and the comfortable amenities made the end of our trip a real treat. We would not hesitate to stay at the Chesterfield upon our next visit.", "title": "Expectations Exceeded 1-2 September 2007", "helpfulness": 2, "user": "Golightly52", "date": "September 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8680330, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Over the years we have stayed at many 5 star hotels in London and, from our point of view, this is the best. It's not the biggest or the flashyest but the standards of service from the staff, the general atmosphere, the location and the cleanliness are second to none. We have stayed here a few times and we're looking forward to our next visit.", "title": "Excellent stay at the Chesterfield", "helpfulness": 3, "user": "themorrisman", "date": "September 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8611850, "likes": {"liked": "— The staff, the room, the location", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "To be spoilt was our quest when we went to stay in London for a weekend of sightseeing, and we were not disappointed in anyway. In fact our expectations were exceeded, from Ben and Darih in Reservations who made the process so straight forward and were so nice, Chris our concierge, who was charming and extremely knowledgeable, sharing the old joke that you can even get an elephant from Harrods, and he would try if I really wanted one, to Armand who searched high and low for a cocktail recipe for my friend even ringing the establishment where she had last drank it. The receptionist was also lovely, unfortunately I did not get her name, but she remembered ours when we returned from our sightseeing and were so tired. So many hotels talk the talk but very few walk the walk, The Chesterfield walks to walk. Thank you to all at The Chesterfield for making our stay so special, from being able to request feather pillows and duvets to lovely club sandwiches from room service. It was like staying in a lovely country home with old friends as hosts. Will definitely stay there again.", "title": "Not bad", "helpfulness": 2, "user": "SJ_tramp", "date": "August 31, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 8592014, "likes": {"liked": "— Central location.", "disliked": "— Room size."}}], "location": {}, "stars": 4, "variance": {"poor": 23, "average": 46, "very good": 222, "terrible": 12, "excellent": 1263}, "aka": "The Chesterfield Mayfair Hotel London", "slim_ranking": 0.008356545961, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.5, "location": 5.0}, "description": "Awarded \"Best in Class\" 2010 in the AA Inspectors’ Choice Awards, The Chesterfield Mayfair continues to be celebrated for its style, comfort, and exalted levels of personal service and is Mayfair’s only hotel to receive this prestigious award in 2010. Discreetly tucked away near Berkeley Square and a mere stone's throw from Green Park Tube station, the quiet, calm and efficient service blended with supreme comfort characterize this deluxe four-star hotel."}