{"user_rating": 4.5, "review_count": 1677, "name": "The Ritz-Carlton, Kapalua", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "I had been somewhat hesitant to stay at the Ritz Carlton Kapalua, given the numerous negative reviews...THANK GOODNESS I stayed anyway. My husband and I had one of the best vacations in a long time and it is thanks to the Kapalua Ritz.", "title": "Most Gorgeous Place On Earth-Thank Goodness I Ignored Some Reviews", "helpfulness": 5, "user": "MLPMorse", "date": "April 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27821621}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Upon arrival we were greeted with enthusiasm and then were upgraded from our bargain Terrace Rate room not once, but twice to an ocean view room on a high floor. I did not expect an upgrade and it was given graciously. Our room was well appointed and beautiful. The amenities were great and sheets were of very high quality.", "title": "Well done Ritz!", "helpfulness": 5, "user": "jelloj1369", "date": "March 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27180321}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "The pool and the grounds on the hotel were beautiful and well run. We never lacked for service at the pool and then attendants rushed to provide us with chair covers and beach towels. Initially we were disappointed that the middle level of the 3 tier pool was out of service, but by the time we got up the next day the pool was running perfectly and beautifully. The area by the beach was great too...which brings me to the best attraction at this resort...the surroundings.", "title": "A perfect honeymoon destination!", "helpfulness": 3, "user": "JHS76", "date": "March 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27121803}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "Kapalua, Maui is honestly one of the most if not the most beautiful place on earth. The resort is situated in such a way to take advantage of the vistas. We watched an amazing sunset from the 5th hole of the golf course, adjacent to a native Hawaiian burial ground completely alone. Unreal in it's beauty.", "title": "A slice of paradise", "helpfulness": 6, "user": "sunflowergurl", "date": "March 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26945920}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "The restaurant prices are steep, but all the food was tasty. The good news is that within walking distance is the Honolua Store which is cheap and tasty. The service in the stores, concierge stand, bell men, valet and check-in were top notch and of the typical Ritz Carlton quality.", "title": "Honeymoon in Paradise!!", "helpfulness": 7, "user": "abw2008", "date": "March 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26471168}, {"rating": 5.0, "title": "Loved the Ritz Carlton Maui", "text": "Amazing property located in a great area of Maui. Just for background, we are a young family, with two children ages 6 & 5. We do not have \"throw-away\" money but we do like to vacation well. We have stayed at numerous RC's, 4S's, etc worldwide.", "helpfulness": 21, "user": "aristophanesny", "date": "February 12, 2007", "id": 6782592}, {"rating": 4.0, "title": "Loved it!", "text": "After reading some of the negative reviews on this site and then staying on the property, you will wonder to yourself, \"did these people stay at the same resort?\". Granted, the resort is due for a renovation (newer furniture, tv's, etc...), which is coming in July. The hotel will reopen for Christmas. That said, it was not \"falling apart\" or \"aged and ratty\" as a few reviews claim. In fact, it was very clean with twice daily maid service. Although I promised myself I would not go to Hawaii to stare at the corners of my room and public areas to see if the carpets were frayed, or search for coffee stains, I did anyway, and after 9 days at the hotel, I did not find any stains, but did notice in the corner of my room that a small section of the carpet was starting to look a bit worn. I can't believe I even took the time to write that.", "helpfulness": 5, "user": "RMC2007", "date": "February 11, 2007", "id": 6778118}, {"rating": 5.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "Seriously, the place is not falling apart, in fact it is very nice. The renovation will only enhance the quality of the rooms. Here are some thoughts by section:", "title": "Better than Four Seasons", "helpfulness": 13, "user": "wynntime", "date": "January 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6720058}, {"rating": 1.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "1. The beach. DT Fleming beach was voted the \"Best beach in America of 2006\" by some guy named Dr. Beach. I do not know who Dr. Beach is, but I will say, the beach was beautiful. Big, fun waves were excellent for body surfing/boogy boarding. The sights and sounds of waves crashing, along with the views and the sandy beach were amazing. I would not take my daughters in the water on some days because the waves were pretty big. Kapuala Bay (right next door) is better for young kids and snorkeling. Some reviews claim the hotel is far from the beach and say negative things about the beach. Again, here is where I pause and say \"where were you staying ? The hotel rests on top of the hill overlooking the ocean, which creates stunning views and is a very short walk to the beach. If you had too many \"lava flows\" the night before, they have a golf cart/shuttle that will take you to the sand from the pool area. As an added bonus, on the first morning of our visit, we all woke up ridiculously early (East coasters) so we decided to take a walk to the beach. On the way down, we happened to see whales breaching in the ocean. Amazing.", "title": "Stay Somewhere Else.....", "helpfulness": 10, "user": "CACaliforniaGirl", "date": "January 28, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 6710408, "likes": {"liked": "— The Blueberry Muffin at the Coffee Stand", "disliked": "— All of it......"}}, {"rating": 3.0, "title": "First time at the Ritz", "text": "2. Pool. Very nice, big with multiple levels, beatiful views. Pool service was good. The renovation will include an area designated as a \"kids pool\". Good idea. Although we never had any issues, I always looked for a spot away from sunbathers or people relaxing in the pool. Because the pool was big enough, I never had a problem finding an area to play with my kids. Tip: Unless the hotel is crowded, don't bother with the cabanas.", "helpfulness": 4, "user": "BFulkerson", "date": "January 26, 2007", "id": 6697738}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "My wife and I stayed here in February 2011 and we were not disappointed. It is a little out of the way but Maui is so small it didn't really cause an issue.", "title": "Great honeymoon spot", "helpfulness": 1, "user": "steveandash", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115857933}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled solo", "text": "The price difference to stay here vs. the Sheraton or Marriot was well worth it.", "title": "Best Beach in the Islands", "user": "barking1RedondoBeach", "date": "July 27, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 115848322}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "Always stay here or Napili Kai when in Maui, this is more fancy but share the same beaches. Best part of the Island yet far away from the crowds.", "title": "Honeymoon heaven", "user": "qlk0107", "date": "July 26, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 115820834}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "My husband and I lived it up at the Ritz for 2 days out of our 2 week honeymoon and it was definitely a highlight. The grounds and pool are gorgeous. Since it is situated on a hill there's a perfect ocean view too. (Although not great for seeing a sunset.) The staff were so accommodating and always smiling. Seriously, there are no grumpy people here! The spa is pure luxury and the perfect way to spend our last morning. Overall, the Ritz lived up to its reputation and you get what you pay for, which is a small fortune. :)", "title": "Just perfect. 100% Ritz-Carlton.", "user": "Farenkov", "date": "July 24, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 115722684}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "I spent 8 days with my family in July there. Perfect experience! I emailed an information about my daughter's birthday 5 days in advance to concierge and they presented her a perfect cake with tropical fruits and flowers.", "title": "Pretty resort, very windy", "helpfulness": 2, "user": "grlgrdgate", "date": "July 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 3.0}, "id": 115704483}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "My daughter and I just returned from a week at this resort. It is a lovely setting with high standards of service.", "title": "Relaxing, scenic", "user": "vanholt", "date": "August 12, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 5.0}, "id": 116623861}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Pros: setting is lovely and scenic, staff, especially valets and maids, are very accommodating and attentive, location is tucked away from the hustle and bustle and congestion of other resorts on west Maui, rooms are well-appointed, including comfortable bed and luxurious linens; modern exercise room; resort shuttle is always available to various parts of Kapalua; good restaurants in the area of the larger resort and adjacent towns (Napili, e.g., but not the Ritz restaurants, which are over-priced.)", "title": "You can believe the hype... it's all true! AMAZING!!", "helpfulness": 2, "user": "atravelersrt", "date": "August 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116524771}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Cons: Kapalua weather is unpredictably rainy and very windy; resort is not beach side; long hotel layout makes for long walks to and from room along dark, tired hallway rugs; the hotel does not enforce adult only pool rules; the particular clientele can be crass and noisy at pool and loding walls are thin; ocean view rooms can mean only a corner view of the water from the lanai; a bit sterile and lacking in the feeling of Hawaii heritage.", "title": "Perfection... Perfected.", "helpfulness": 3, "user": "R A", "date": "August 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116487844}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We stayed here for 4 nights for our honeymoon in April in an Ocean View Suite. RC staff communicated with me well in advance of our arrival, booking dinner reservations and spa appointments for us. It was nice to feel pampered even before we arrived.", "title": "Stayed for our wedding, LOVED the service and room", "helpfulness": 2, "user": "LaurenKeith", "date": "August 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116454710}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The hotel was very easy to find and it feels like a secluded paradise once you enter the premises. The hotel staff were friendly and helpful but also laid back, which contributes to the relaxed atmosphere. We had a complimentary goodies waiting for us in our room because it was our honeymoon. They go out of their way to make you feel at home.", "title": "Pros & Cons", "helpfulness": 3, "user": "MIOL2", "date": "August 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 116436519}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Our second time to Maui, this year with a 6 mo baby and grandparents. Last year had a wonderful time staying at the Four Seasons in Wailea, but found ourselves driving up to Kapalua for dinner a few times, quite a trek esp at night. We found both hotels are high quality in terms of service and amenities.", "title": "Location, location, location!", "helpfulness": 2, "user": "BPtravels26", "date": "July 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 115944113}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Pros:", "title": "Paradise", "helpfulness": 2, "user": "honeykim11", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115927333}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "1. Location-close to everything! Lahaina, Fleming beach, snorkeling, shopping. Not to mention Merriman's, Sansei, Lahaina Grill, and Gerard's.", "title": "Beautiful resort", "helpfulness": 1, "user": "kiwizoe", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 115909311}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "2. Snorkeling/Beach-love the complimentary shuttle from the hotel to Kapalua Beach. Don't forget to grab some hotel beach towels from the valet. There is some shade but you can rent the gear, chairs and umbrellas there. You call the shuttle when you're done for pick up. We paid $75 for 4 adults to snorkel for 3-4 hrs. While there is a bit of a walk down from the hotel to the public beach, they will set up chairs for you and there is a small grassy section the left and right of the beach restaurant (owned by the Ritz) where you can lounge in the shade and still walk to the water for swimming. It's not as fabulous as the beach service as FS but good enough. The waves are a bit rougher and it's at times windy but for the most part, still lots of fun!", "title": "Love it! Relax in Luxury", "helpfulness": 2, "user": "AmyLynn230", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115897760}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "3. General Store-this place is great! both as a cheap alternative for a homestyle lunch/afternoon snack and for souvenir shopping, they are now an affiliate of ABC stores. Within 3 min walking out of the hotel lobby, stroller friendly.", "title": "Great Room, huge property, good location", "helpfulness": 1, "user": "Steveg5000", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115891485}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "Don't mind paying for a 5 star location and hotel but an extra $25/day (resort fee) and $100/day for a 4 person cabana is a bit over the top. \"Clincher\" was a charge for $24 for three small bowls of white rice at the hotel's signature restaurant. Still- a fine resort and recommended for a relaxing visit.", "title": "Beautiful suites, but the extras make it a questionable return destination", "helpfulness": 2, "user": "SHGee", "date": "August 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 3.0}, "id": 116405431}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We stayed on the Club Level the last week of July, 2011. The property was absolutely amazing - fabulous pools, ocean, walking trails and rooms. The Club Level service was truly wonderul. Leslie, Charlotte, Athena and Laura met every need we ever had. They served us special drinks, made reservations for us, and generally treated us like family! We highly recommend the club level.", "title": "Gorgeous Property", "helpfulness": 1, "user": "dallastripster", "date": "August 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116395502}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "As others have mentioned, the pool does get windy. We rented cabanas on the days were at the pool a lot ot minimize the wind. The cabanas were $100 a day and came with a cooler of drinks and a tray of fresh pineapple. The swimming pool was pretty chilly, but it didn't seem to bother the kids!", "title": "Very good value for money", "user": "Grandvaux", "date": "August 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116362896}, {"rating": 3.0, "title": "A gamble.", "text": "Our group did a snorkeling/photography program through the Ritz that was really good. We also enjoyed the lei making class. The beach at the Ritz was great for boogie boarding!", "helpfulness": 2, "user": "martygSeattle_WA", "date": "August 3, 2011", "id": 116210076}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Overall, we loved the Ritz at Kapalua and we cannot wait to return.", "title": "Fabulous Hotel on Maui", "user": "Travelmom76092", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116176088}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The Ritz Carlton was isolated from the rows of hotels on the other parts of the island, so it was quiet and restful. The beach was quite a walk down the hill and the surf was rough here. I have heard that was typical, so we watched the surfers and did not swim at Kapalua. We used the beach when we moved to a hotel at Wailea. The rooms were spacious and comfortable. The health club which was located in the spa area was very well equipped with Cybex equipment, and elliptical machines, etc. There was no excuse not to keep a workout routine. The spa services were costly. The pool was very nice, surrounded by tropical landscaping. We were happy to have a car, as we thought the food was overated and there were fine restaurants 5-15 minutes away by car. The concierge services were very good, as they helped my husband book scuba trips before our arrival during a very busy week. Overall, I would recommend this hotel to take advantage of pampering and relaxation.", "title": "Quiet Location", "helpfulness": 5, "user": "RoColorado", "date": "December 20, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 3.0}, "id": 6477253, "likes": {"liked": "— The health club.", "disliked": "— The cost of food."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "First off, I completely agree with the reviewer a couple posts below - this is definitely more of a 4-star experience, but a very solid 4 at that. We stayed at the Ritz over a period of about 2 weeks. We had our wedding at the Sacred Hearts Mission (next to the Honalua General Store), our reception in the Anuenue Room, and stayed there afterwards as our base for our Honeymoon.", "title": "Great experience overall (11-28 through 12-12).", "helpfulness": 10, "user": "A02", "date": "December 19, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 6472886, "likes": {"liked": "— Unpretentious, top-notch service.", "disliked": "— Getting a little aged... renovation will fix."}}, {"rating": 1.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Our Deluxe Ocean View room (4th floor) was in great shape. The bathrooms were in good order, clean, and very large (separate shower stall and shower/tub). The TV was hilariously old, but worked fine. It's one of those things where you expect something nicer... but the reality is that for as much as we actually watched the TV while there... it simply didn't matter. We appreciated the decent-sized mini fridge that was empty for us to keep drinks and such that we bought at the General Store. It easily fit a six-pack of beer, 6 bottles of water, some food, and a decent sized Gatorade. There was only one small bleach stain on the carpet, but wasn't noticed until a few days in. I did get a complimentary room the day of the wedding to get ready in on the 1st floor (facing out) and I will say there was a noticeable difference in room quality – even the hallways were darker and less inviting.", "title": "The Good The Bad The Ugly", "helpfulness": 14, "user": "finestrod", "date": "December 14, 2006", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 6439905, "likes": {"liked": "— banyan tree rest. Robert the waiter was excellent food was also great.", "disliked": "— read my opinion"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "Contrary to earlier reviews, we were given 2 bottles of water at least twice a day - sometimes three. The staff cleaned our rooms a minimum of twice a day and were extremely friendly. We had robes in our room as well. Towels were replenished/replaced fully every time they were in the room.", "title": "NOT a 5 star hotel...a well executed 4", "helpfulness": 10, "user": "woods1966", "date": "December 7, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 6344536}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "Overall, I was VERY happy with the condition of the grounds and the hotel itself. The Christmas/Holiday decorations were stunning to say the least. The concierges were great every time we asked a question or made a reservation. The lobby greeter always said hello to me each morning. The lobby bar attendant was prompt the one time I sat there looking for a drink - and very friendly. The pool staff was excellent both days we sat out there - coming around every 30 minutes asking if there was anything we needed. They also came around with fresh pineapple every couple hours. The pool bartenders we encountered on both days were very talkative and happy. They were more than happy to order a sandwich only available at the beach grill and send it up. The beach grill was relaxed and offered decent service. In fact, there was only one bad employee we encountered the entire trip. My wife loved Joy - who ran the bracelet and lei making classes... she was genuinely happy to be there and you could tell. We saw no trash in hallways more than an hour or so.", "title": "Our first and probably last stay - Take the kids to the Four Seasons", "helpfulness": 10, "user": "partyofour", "date": "December 5, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 6335635, "likes": {"liked": "— The ground were beautiful, especially with the Christmas decorations.", "disliked": "— Once it started raining we had to leave the resort - no onsite activities."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We stayed four nights in a “residential suite” at the end of April. We decided to splurge for the Ritz on Maui since the portion of our trip on Big Island was paid for. I can’t say enough good things about this resort.", "title": "Perfect for Relaxing Getaway", "helpfulness": 10, "user": "vtgambler", "date": "May 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29801789}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Room: The suite was huge. Bedroom was spacious with big bathroom and closet. The main portion of the suite included the kitchenette, dining table and 2 couches. There were 2 lanais and even though we had a garden view room there was a great view of the ocean from the front lanai. Appliances/amenities: Two 42” flat screens, fridge, freezer, microwave, blender, dishwasher, coffee maker & plenty of dishes/utensils. Housekeeping did a thorough job and replaced towels and toiletries 2-3 times a day. By the end we had about 50 shampoo containers. Only complaint here was that our room was the first in the hallway next to some sort of utility closet or storage room so sometimes we could hear employees in there from our bathroom or bedroom. This was only during the daytime.", "title": "Beautiful Loacation. Very Expensive Dininig.", "helpfulness": 3, "user": "OCTraveler06", "date": "May 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 29784353}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Grounds: The setting is gorgeous. Everything is green and lush. The mix of palm trees and pine trees is interesting. Needless to say everything is well manicured. The place reeks relaxation.", "title": "Fabulous stay.", "helpfulness": 2, "user": "BeakerTX", "date": "May 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29254033}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "Beach: Was pleasantly surprised with the beach here (DT Fleming). Soft sand entry and clear water. There was pretty decent surf the days we were there and it seemed popular with boogie borders. It’s about a 5 minute walk to the beach from the pool but if you’re really lazy they have a golf cart to shuttle you back and forth. There is a bar/restaurant down on the beach. One complaint was that you can’t use the hotel chairs on the beach only on the adjacent lawn.", "title": "Amazing Stay at the Ritz!", "helpfulness": 4, "user": "eawil", "date": "April 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 28981737}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Pool: Very nice and the drink service was good. Nice padded loungers and no hassles obtaining chair covers and towels. The pictures on the hotel site are pretty accurate. Yes drinks are expensive but exactly the same as the major Kaanapali resorts. We actually spent more time at the pool then we usually do in Hawaii because it was so relaxing.", "title": "Very Nice", "helpfulness": 1, "user": "CraigJ", "date": "April 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 28829790}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "My husband and I spent 2 weeks at the Ritz Kapalua in December 2006. We rented a convertible at the airport on arrival (STRONGLY suggest) and drove to the Ritz. Check in went smoothly. The hotel is beautiful. The room was very nice, a decent size, with a balcony facing the pool. The bed was UNBELIEVABLY comfortable. The Ritz uses these amazing feather bed toppers that I just can't seem to duplicate at home no matter what I buy....", "title": "Very nice!", "helpfulness": 1, "user": "JillyMcWilly", "date": "February 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 25321529}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "The pool was fabulous with fairly decent service. My only complaint about the hotel is the beach. There really isn't one...You have to take about a 5 minute walk to get down there and it's kind of a small, rocky area. The pool did make up for it though!", "title": "A beautiful location, weather and all!", "helpfulness": 1, "user": "cleopat", "date": "February 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 25117962}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "The restaurants were good, but expensive. We took the car out every morning for a drive around the island. There is a McDonald's about 5 minutes down the road from the hotel so we would drive up there for breakfast and our morning coffee.", "title": "great room and private beach but not centrally located", "helpfulness": 1, "user": "DoubleLane", "date": "February 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 25052605}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "The hotel is fabulous and, of course, five star - but it is kind of set apart from everything on the island. Nothing is walking distance in Maui, so get a car. Lahaina is right down the road, as is the strip of hotels on the busiest beach in Maui. The Grand Wailea and Four Season's are on the other side of the island.", "title": "Wonderful Hotel, Bad Location", "user": "gskline", "date": "February 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 1.0, "service": 5.0, "rooms": 5.0}, "id": 24902834}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Overall, we had a wonderfully, relaxing time here. I would definitely return.", "title": "Best Vacation of Our Lives!", "helpfulness": 1, "user": "melanierc23", "date": "February 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24565263}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We stayed at the Ritz from December 25th to the 31st. We booked a garden view room and the room was fine. There was no musty smell that others have complained of on this site. Yes, the rooms are outdated and they are in need of remodeling. The bathrooms were fine too, but if you stay on the ground floor, they keep the sink drains closed for a reason, so just remember to close them again. They have small refrigerators in-room, but no mini bar. The in -room safe is keyed, so you have to take the key with you everywhere which is inconvenient.", "title": "Prefer the Four Seasons", "helpfulness": 9, "user": "Susannah S", "date": "January 8, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 6566959, "likes": {"liked": "— The location", "disliked": "— The service"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "The pool area is really large which is nice, but the service at the pool was bad. Not nearly enough servers and you do have to wait a long time for drinks. Also, it can be hard to get someone to help you find a place to sit and the pool area does get really crowded. On one occassion, someone went to get us towels and set up our chairs and just never came back.", "title": "Secluded-Except for the Massive Construction", "helpfulness": 8, "user": "webkat", "date": "December 26, 2006", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0, "rooms": 4.0}, "id": 6501912, "likes": {"liked": "— Sun", "disliked": "— Staff"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2006, traveled as a couple", "text": "The Terrace Restaurant was overpriced and not worth it. If you want a good and inexpensive breakfast, just walk over to the Honolua General Store and get breakfast there. They had eggs, waffles, pancakes, etc. This seemed to be where the locals in the area had breakfast and you can sit on the deck and eat there for $5 per person. Also, you can order sandwiches to go for a picnic lunch at Haleakala or in Hana.", "title": "Very comfortable hotel", "helpfulness": 10, "user": "Matt-brand", "date": "December 24, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 6490317, "likes": {"liked": "— location, hotel, golf, pool", "disliked": "— bit dated rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "The Banyan Tree was excellent and the service there is what you would expect from the Ritz. We had drinks in the lobby bar one night and the service was horrible. They were completely understaffed and the atmosphere was lacking also.", "title": "Ritz Carlton in Maui, Great Service, Great Pool, Great Golf Course", "helpfulness": 4, "user": "worldlytraveler", "date": "December 23, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 6485009, "likes": {"liked": "— The Golf Cours or Pool", "disliked": "— How far we had to walk to our room"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "The salon area is really small, but Sarah did my pedicare and was really nice and very friendly and did a great job too. The concierge desk was helpful with activities and booking dinner, but they do not seem to have the discretion of employees at other high level hotels.", "title": "Great for couples!!!", "helpfulness": 5, "user": "AdamPaz", "date": "December 21, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6478669, "likes": {"liked": "— Great staff, food, views!!!", "disliked": "— Long walk to rooms (walk one hallway, to an elevator, and then back the other way)"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "I think it was a week before our honeymoon that I said to myself \"Let me go online to tripadvisor and see all the good things about the Ritz!\". Well... after reading some reviews I became so nervous! Hahaha, good thing I kept an optimistic view because our honeymoon was nothing less than stellar.", "title": "Dream Honyemoon at the Ritz!", "helpfulness": 6, "user": "travelbuddy20", "date": "December 5, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 6335077, "likes": {"liked": "— Pool", "disliked": "— The rooms definitely need to be updated"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Does the Ritz Carlton need updating? Yes. Are the tv's old? Yes. BUT they have signs up that ask you to please excuse the appearance while they are renovating. So, to me, I excuse it!", "title": "We are here right now!!! What is everyone complaining about??", "helpfulness": 4, "user": "BrandoReefDiver", "date": "December 4, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 6333545, "likes": {"liked": "— Free coffee before 8am!!", "disliked": "— No free cofee after 8am!!"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Lets go onto bigger and better things. The rooms were really nice... great beds and great bathrooms. The pool is gorgeous and the pool service was excellent. The beach isn't that far. Its down a pathway .. walk.. its good for you! The tennis courts were pretty good.... lots of them so we didn't have to wait. The spa is very nice a bit small but good service. The gym is really good too,plenty of machines. We had continental b'fast included and I'm so happy we did. The b'fast was yummy & had a great view.", "title": "Got a great deal", "helpfulness": 1, "user": "Kbears", "date": "December 1, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6314733, "likes": {"liked": "— Location", "disliked": "— Price if I had to pay for it"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The weather: It was sunny everyday. Not one drop of rain in our 8days there. There is a bit of a wind but its a warm Aruba like wind and it was welcomed!", "title": "Pleasantly surprised", "helpfulness": 2, "user": "JBlakey", "date": "December 1, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 6314321, "likes": {"liked": "— The service was top notch", "disliked": "— Room was musty, could use some updating"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "We had a great time at the Ritz and will absolutely go back!!!!", "title": "Finishes Strong", "user": "JuanC", "date": "November 30, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6310512}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "We had a wonderful stay at The Ritz-Carlton Kapalua from 2/28 - 3/2/09. We had been on the Big Island for a week and decided to finish our stay in Hawaii with a 3 day stay on Maui. My husband and our son and daughter-in-law and daughter and son-in-law booked a package with 2 free breakfasts each day along with a round of golf each day and $150 in spa credits each day.", "title": "Everything and more...(except the weather)", "helpfulness": 2, "user": "J_and_T_WI", "date": "March 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26407798}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "The wonderful started at check in where we were upgraded to Ocean Front Suites. The rooms were spotless and beautiful with views of the ocean that were incredible. The staff was very friendly and accomodating with suggestions for dining and making sure that we had everything that we needed for our too brief stay.", "title": "Wonderful location, but windy and rainy", "helpfulness": 1, "user": "eberhardbrockmann", "date": "March 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 26132593}, {"rating": 5.0, "title": "Scenery, privacy, service...can't be beat.", "text": "The weather was not teriffic - extremely windy (darn those trade winds!) cool, and rain on and off the whole time we were there, but we still had a great time! The first full day the guys played golf at The Bay Course (my husband says it was a fantastic course and he would definitely love to play it again) and the ladies worked out and then did a spa day. The spa was fantastic - beautiful, relaxing, rejuvenating and we enjoyed all of our treatments without exception! Staff again could not be more accomodating and friendly. The second day was pretty rainy and although the guys enjoyed playing the Plantation course, the rain won that day!", "user": "geno31", "date": "March 3, 2009", "id": 25509837}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We had breakfast in The Terrace Restaurant which had a wonderful buffet with everything you could imagine to enjoy for breakfast. We had drinks and lunch in The Alaloa lounge (The Ahi Cobb salad was absolutely delicious!) If we had had more time I would have liked to have dinner at The Banyan Tree, but we did go with suggestions from staff and had dinner one night at The Pineapple Grill (great drinks - coconut martini - yum!) and at Jameson's one night. (Fantastic fish entrees!). The last night we went into Lahaina and had dinner at Cheeseburger in Paradise - fun!", "title": "GREAT HOTEL, BUT PLEASE RENT A CAR", "helpfulness": 4, "user": "michiganlove", "date": "March 2, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 25479118}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "All in all, we had a great time at The Ritz. The views were spectacular and even though the weather was not the greatest, we even got to go in the ocean and fight with the waves a little while with boogie boards. The rooms were beautiful, loved the bathrooms and showers and the beds were so, so comfortable! We were definitely spoiled and my husband said that they sure knew what they were doing giving us the upgrades, because we WILL be back and we WILL want the ocean front suites again! Can't wait to go back!", "title": "Make sure a few things have been taken care of before staying here...", "user": "opinion8dla", "date": "March 2, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 25416637}], "location": {"country": "United States"}, "stars": 5, "variance": {"poor": 95, "average": 172, "very good": 375, "terrible": 52, "excellent": 983}, "aka": "Ritz-Carlton, Kapalua Hotel", "slim_ranking": 0.5, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "Nestled on 54 acres, The Ritz-Carlton, Kapalua showcases a stunning, fully-renovated destination resort offering 463 guestrooms, including 107 residential suites, warm wood floors, travertine bathrooms, flat-screen televisions and Hawaiian-inspired artwork. The Spa beckons with treatment rooms framed by private garden showers, volcanic stone grottos, heat therapies, and a fitness center with spectacular ocean views. Jean-Michel Cousteau's Ambassadors of the Environment offers all levels activities from land to sea. Also featured are six restaurants, indoor/outdoor meeting space, an inviting children's pool and luxury cabanas. It is enveloped by picturesque Kapalua Resort’s two championship golf courses, dining and a century-old pineapple plantation."}