{"user_rating": 4.0, "review_count": 167, "name": "The Victoria Inn", "reviews": [{"rating": 4.0, "title": "Great B&B and restaurant", "text": "The Victoria Inn is comfortable and very clean. We had a large room and en-suite which was very good value for money, though it will need a bit of TLC soon. What makes this Inn special is the great service - great hosts and our waitress at dinner was so attentive and helpful. The food is excellent - especially the dinner in the restaurant - we have been to lots of restaurants/B&Bs in the USA and it's rare to find food that seems fresh with a choice of vegetables - ie hasn't been cooked and heated up. I would certainly visit this Inn again and locals should try the restaurant, they are missing a treat.", "user": "John1e2", "date": "July 13, 2008", "id": 17843100}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "Ann and John Rooke", "title": "A wedding celebration to remember", "user": "2Mainemoms", "date": "May 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16270485, "likes": {"liked": "— The personal attention and fantastic Inn", "disliked": "— There was NOTHING not to like!"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "The Victoria Inn is truly one of the last \"full service\" inns in New England. From the moment you walk into it's beautiful and tastefully decorated foyer, you realize you are in for a treat. The inn keepers, Stacey & Kamil, are wonderful and it quickly becomes evident that this inn is their avocation. Every detail is looked after.", "title": "Loved the Victoria Inn", "user": "TravellingBoston", "date": "March 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 14694203, "likes": {"liked": "— Quality of food, comfort, attention of owners", "disliked": "— Really nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We booked the Victoria for our wedding dinner, as well as the Inn for our guests to stay during their visit. Each guest was greeted with fresh, homemade cookies, in a meticulously prepared room. The service given by all staff members was first class all the way.", "title": "Without a Doubt, Best Inn in Bethel!", "user": "abby2525", "date": "March 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14010396, "likes": {"liked": "— Room # 4 is large, comfortable, quiet and the owners very hospitable.", "disliked": "— nothing, everything was perfect."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Our dinners were a cullinary delight, to say the least. The wedding cake rivaled that of the finest bakerys. We planned a brunch the following day and yet again, our senses and taste buds were delighted. A repast of French Toast Creme Brulee, Maple Glazed Bacon, Shirred Eggs, and Chocolate Covered Strawberries, just to name a few. Most of our wedding guests regretted that they filled up and couldn't eat more...", "title": "Under new management - we had a wonderful visit", "helpfulness": 2, "user": "Happily-retired2", "date": "November 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 10884521, "likes": {"liked": "— Friendly, gracious hostess and staff; beautiful setting; beautiful facility.", "disliked": "— We liked it all."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "We stopped at the Victorian while on a road trip. We were concerned that a place with such an exquisite looking dining room would be out of our price range, but were pleasantly surprised when the owner not only reduced the price, but reminded us that we also got 10% off their dinners!", "title": "Classy and Hospitable", "user": "naturegirl0", "date": "October 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21117042, "likes": {"liked": "— food", "disliked": "— second floor"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "The room was fantastic and had beds for several more people than we had.", "title": "Best Inn Keeper in New England", "user": "CAVoyager", "date": "October 9, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 20748722, "likes": {"liked": "— Inn Keeper", "disliked": "— Beds too hard"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The dinner was a true gourmet experience with quality ingredients and wonderful menu choices.", "title": "Winning weekend at the Victoria Inn!", "user": "Jane G", "date": "August 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19353004, "likes": {"liked": "— I felt like the owners were really invested in our enjoyment of their inn.", "disliked": "— Nothing."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The owner, Stacy, had a way of making you feel as though you were the only guests in the Inn and she had all the time in the world for you.", "title": "Happy Birthday to ME!", "helpfulness": 1, "user": "scrappingtwinmom", "date": "July 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18321637, "likes": {"liked": "— food", "disliked": "— That we had to leave"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008", "text": "I would go again in an instance.", "title": "Day 6 on a Harley...What a welcomed stop", "user": "RoadKing03", "date": "July 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18299610, "likes": {"liked": "— The Victorian is the total package", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "We decided last minute to go skiing at Sunday River and were lucky enough to find one room left at The Victoria Inn for the weekend. It was great to be allowed to check in at 2pm after a cold day on the mountain. After being warmly greeted by Stacey, we were escorted to Room 9 which had more than ample room for one couple. Queen bedroom, sitting area, and bathroom downstairs with a 3 bed loft upstairs. (Great set up for a family) The room was decorated nicely and was well cleaned. Bed was perfect - not too hard or soft and the linens were good. I enjoyed a nice soak in the soaking tub after a hard day skiing and had plenty of hot water and towels. The room needed a little TLC in areas and was a littled dated from the 80s but a minor point. We slept well and the Inn was quiet at night - no banging doors or late night party owls. (i.e Sunday River)", "title": "Last Minute Getaway - Great Little Find", "user": "Daphne418", "date": "January 25, 2009", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 23897152, "likes": {"liked": "— good sized room, shower/tub, good hostess, GREAT CHEF", "disliked": "— Minor points : No bottled water in room, Slow service at dinner"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008", "text": "Due to the freezing temp, we decided to stay put and try the Inn for dinner. We were pleasantly surprised! Our dinner was amazing – he had the lamb, I had the duck. You could tell the ingredients were fresh and prepared with skill and with a passion for cooking. However, the extremely slow service took away from the outstanding meal. At times we were forgotten with empty glasses and our main course took almost 30+ mins to arrive with no one checking on us. (Other tables around us had an attentive server) But we still enjoyed not having to drive home after a great day and meal. Breakfast the next morning, included with lodging, was delicious and service was fast. You could again tell – the chef pays attention to detail and uses fresh ingredients.", "title": "Wonderful, warm inn", "user": "NWSongbird", "date": "January 8, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 23381105, "likes": {"liked": "— The innkeepers"}}, {"rating": 5.0, "title": "A lovely experience", "text": "Compared to the rates and quality of lodging options at Sunday River and other establishments in the area, we were very satisfied with our stay here. We even got a discount for a last minute reservation and 10% off dinner in the restaurant. Look forward to our next stay at the Victoria Inn.", "user": "SheldonHW", "date": "November 29, 2008", "id": 22300722}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "My husband and I booked the inn the day before arriving, knowing nothing about the area or the inn itself. We were so pleased with it that we decided to stay an extra night. As others have noted, the inn's greatest asset is Stacey, who is so genuinely warm and friendly. We were on a budget and thus booked a standard room. Be aware that while quite lovely, they are indeed standard - pretty small, with few extras - but the price is fair. The owners have obviously put great care into the place, including personal touches like books for browsing and a large binder full of numerous recommendations on hikes, bike routes, driving routes, local restaurants, etc., that they themselves composed. The inn location is also great, situated on the main street with several shops and restaurants in walking distance, although the town itself is rather sleepy. Due to our budget, we elected to have dinner elsewhere (the menu is a tad pricey) but the breakfasts were wonderful. Of a modest portion, they were rich and filling, and above all delicious. All in all, I'd highly recommend the inn to anyone, and I hope to come back some day.", "title": "A Night in a Former Era", "user": "nrhs62", "date": "November 11, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 21736268, "likes": {"liked": "— The room itself and the service.", "disliked": "— Victorian furniture is not meant to be sat on for long."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "My wife and I stayed at the Victoria Inn while on a leaf peeping trip in October. We had never stayed in a B&B before. I'm glad we picked the Victoria Inn for our first experience. The Inn was picturesque and the room was like something out of a victorian era novel. Stacy the owner made us feel right at home and was very helpful in planning our sightseeing in the area. The dinner in the restaurant was so delicious we ate there every night. The breakfast were wonderful, too. The ambience of the B&B really topped off our leaf peeping trip. I'd recommend this inn to anyone looking for a picturesque, well-maintained, and reasonably priced getaway.", "title": "a New England delight!", "user": "UKMaggiemay", "date": "October 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21139294, "likes": {"liked": "— Being made to feel a cherished guest", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "Worth an hour drive just to eat in this restaurant! Absolutely wonderful gourmet dishes. A dining experience that makes tastebuds come alive! Stacey, the owner was a wonderful hostess and though we weren't staying at the Inn, gave us a full tour. The rooms are outstanding and much more than one would typically expect from a small town Inn/B&B, not to mention the wonderful ambiance and romance of it's gorgeous Victorian era architecture.", "title": "Food coniseur's dream! Gorgeous suites & rooms, much more than one would expect!", "helpfulness": 2, "user": "wildatheartrehab", "date": "November 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10520931}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Thank you Stacey, we will be back!!", "title": "Great B&B for viewing fall colors", "helpfulness": 2, "user": "Mauigirl808", "date": "October 20, 2007", "detail_rating": {"front_desk": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 10167718, "likes": {"liked": "— Warm and welcoming innkeeper"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Your guests from NC & SC", "title": "Wonderful!", "helpfulness": 2, "user": "Olathe-Ks", "date": "October 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10040893}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "The Victoria Inn worked out perfectly for our trip to Maine to view the fall colors. It is in a lovely small town, near the White Mountains but not in the main tourist areas. We often stay at B&Bs when traveling in Europe, and what makes a B&B stand out is often the owner. Stacey is a natural at this, she obviously enjoys running the Inn and restaurant, and warmly treats each guest as an individual. The food was very good. The breakfast was light but very good, we had the shirred eggs (baked and creamy) and also the granola (one of the best I've had), the iced pumpkin cookies upon our arrival were delicious. We were able to have dinner only one night - I had the Osso Bucco - it was really, really good. The restaurant was busy at lunch and dinner - so has a good reputation in the local community. Our room was lovely - everything looks new, it was comfortable and CLEAN!", "title": "really nice", "helpfulness": 2, "user": "lvzRhodeIsland", "date": "July 26, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8240086, "likes": {"liked": "— location and Stacey the owner"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "A memorable driving tour was a loop through the Rangeley Lake area. The views of the lakes and mountains up hwy 17 and 4 are spectacular. The return via hwy 142 was special - no one else on the road, the colors were peaking with a view of the bright mountain at the end of the road.", "title": "Couldnt' ask for anything nicer!", "helpfulness": 3, "user": "travelinow", "date": "July 22, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 8218070, "likes": {"liked": "— The quality and comfort of the inn, including the room and the food, as well as the personable management."}}], "location": {"country": "United States", "city": "Bethel"}, "stars": 2.5, "variance": {"poor": 11, "average": 13, "very good": 36, "terrible": 9, "excellent": 98}, "aka": "The Victoria Hotel", "slim_ranking": 0.4375, "description": "Beautiful Victorian inn at the foothills of White Mountains in Western Maine. Only 6 miles from Sunday River Ski Resort and Golf Club. 14 Guest rooms, all with private baths, many with Jacuzzi tubs. Full breakfast is included with every room. Fine Dining in our 45 seat restaurant."}