{"user_rating": 4.0, "review_count": 95, "name": "The Fort Resort", "reviews": [{"rating": 5.0, "title": "Want to go back", "text": "Amazing! very high up the hill. great rooms, excellent food and very friendly staff. unfortuantelly we stayed there for only one night and weather was not clear so we could not see the mountains, yet we realized that we were literally above the clouds!", "helpfulness": 2, "user": "Hana77", "date": "September 1, 2006", "id": 5732104}, {"rating": 4.0, "title": "beautiful scenery hotel", "text": "will surely go back to relax and enjoy the view. best time to visit as advised between Oct and March. enjoy your trip.", "helpfulness": 2, "user": "maewmaew", "date": "July 6, 2006", "id": 5432181}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "fort hotel locates on the very nice scenery. i could see the langtang mountain-top from the hotel and also from my room. the staffs are very polite and the food was great [ especially the homemade yoghurt!!!!! ]", "title": "Very High Up", "helpfulness": 3, "user": "zcemn01", "date": "January 19, 2006", "detail_rating": {"cleanliness": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4362085}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "The Fort Resort is probably the best place to stay in Nagarkot. There's a sign that says it's 2000 m above sea level -- I'm not sure if that makes it the highest hotel in the world, but it's pretty high up there that breathing becomes a liiiiiittle bit difficult if you climb up the stairs to the roof too fast!", "title": "Beautiful sunrise", "helpfulness": 3, "user": "SmyeeQq", "date": "December 31, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "service": 5.0}, "id": 4314054}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We stayed one night at the Fort Resort in the hope that we would awake at sunrise for the coveted Himalayan view with the site of Everest in the distance. The hotel staff will even ensure that you are up in time to see the view. Unfortunately this wasn’t to be for us but our stay at The Fort wasn’t a disappointment. We stayed in one of the cottages rather than in the main building and the room was large and had a double and a single bed. It was very clean with stylish décor and windows with what would be great views overlooking the Himalayas. The lack of views on some occasions is made up for by the great garden area, that is obviously well cared for and full of flowers in pots and flower bed areas – I spent a lovely morning here eating breakfast in the sun and taking loads of photos. We ate in the restaurant in the evening and despite a slight mix up with our order and the time we had to wait for it (due to a large party staying) the food was good.", "title": "Good hotel with nice gardens", "user": "Samkirk9", "date": "April 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 28505703}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Originally we had booked to stay at the Tea House which is attached to Club Himalaya. However on arrival we found that the Tea House was now closed during certain week nights. Unfortunately they hadn't notified us of this. As Club Himalaya was full we ended up staying in the Fort Resort. We are so glad we did end up here as it was truelly wonderful.", "title": "Fantastic Hotel with Great Staff", "user": "alan_ni", "date": "February 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24803230}, {"rating": 4.0, "stay_parameters": "Stayed November 2006", "text": "The hotel has rooms in the main hotel building but also has what are called cottages down at the front of the hotel. We stayed in one of the cottages and it was fantatsic. Each cottage has a downstairs and an upstairs room. We had an upstairs room which had its own balcony with a wonderful view of the Himalayas. The room itself was quite large and very clean with loads of character. Indeed the cottages from outside also have great character with nice wood carvings. There was no TV in the room but when you can look at the Himalayas you don't need a TV.", "title": "Breathtaking", "user": "lofty761", "date": "December 20, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 6475651, "likes": {"liked": "— The views", "disliked": "— Take a torch"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Due to the power cuts the hotel supplied us with a gas superser heater which kept us warm. They also supplied a lantern for light and hot water bottles at night. The bathroom was also quite large and very clean. There was also hot water in the mornings for a shower. The room was cleaned each day.", "title": "Can't beat the views", "user": "tollyg", "date": "December 6, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 6339206, "likes": {"liked": "— The Views"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "There was a decent choice for breakfast each morning and indeed there was a good selection of food on the menu in the restaurant at night. We ate in the restaurant each night and it was very nice. There is also a view of the Himalayas from the restaurant.", "title": "Fascinating place", "helpfulness": 1, "user": "D&DWoods", "date": "December 4, 2006", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6330643, "likes": {"liked": "— The location and remoteness where you feel honored to even be there", "disliked": "— It takes a long time to drive there"}}], "location": {"country": "Nepal", "region": "Central Region", "continent": "Asia"}, "variance": {"poor": 11, "average": 19, "very good": 39, "terrible": 2, "excellent": 24}, "aka": "The Fort Hotel Nagarkot", "slim_ranking": 0.461538461538}