{"user_rating": 5.0, "review_count": 531, "name": "The Red Tree House", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Four of us had the pleasure of staying here in October, we shared the beautiful penthouse apartment which was stunning, comfortable beds and linens, comfy sofas and all the things you could possibly need to explore the area.", "title": "Heavenly penthouse!", "user": "Nessnoo", "date": "December 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122021452}, {"rating": 5.0, "stay_parameters": "Stayed November 2011", "text": "The breakfasts were gorgeous, the hosts; helpful, suave, entertaining and welcoming! We had the loveliest time, felt pampered and frankly we could have stayed for months!", "title": "Perfect!", "helpfulness": 1, "user": "2kiwinomads", "date": "December 20, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 121926699}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Thank you all!", "title": "The Kind of Place You Fantasize About When Traveling", "user": "mari-mariposa", "date": "December 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121831121}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "(We adored April the dog too!)", "title": "Great home base in Mexico City!", "user": "girlmelbourne", "date": "December 15, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 121764565}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Had a wonderful stay here for 4 nights. Everything about the Red Tree House was perfect for us. From the moment we arrived and were welcomed by Ernesto, shown to our beautifully appointed room, shared breakfast each day with all the other interesting guests and repeated the interaction in the evening over a glass of complimentary wine kindly dispensed by Jorge, we really enjoyed ourselves. Location is good, just a short taxi ride to many of the sights. Ernesto and George were extremely helpful with local knowledge and will sort out most things for you. When there, make sure you go up the road to the Chocolate Shop a block or so away. World class chocolates!", "title": "My new friends' house", "user": "mararcha", "date": "December 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121708111}, {"rating": 5.0, "title": "the best in Mexico City!", "text": "We felt very fortunate that we secured a room here over the December holidays. As soon as we arrived we were greeted by the Craig, Ernesto & Victor and we felt immediately welcomed. The rooms are lovely & comfortable. Breakfast was delicious and we enjoyed meeting the other guests. My only regret is that we didn't have enough time here. The neighborhood feels very safe & quiet and is located to the subway so it's a breeze to get around. We will be going back.", "helpfulness": 1, "user": "Ciruela7", "date": "January 8, 2012", "id": 122776088}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "Loved this place.", "title": "Charming, cozy, clean, welcoming", "helpfulness": 1, "user": "rwalzer", "date": "January 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 122438867}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "The fellows who run it, Ernesto, Craig, etc., are all super nice and welcoming.", "title": "Very helpful friendly staff and fun social environment in a lovely house in a good neighborhood.", "helpfulness": 1, "user": "Nikki E", "date": "January 2, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 122431636}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The place is really charming courtyard area, and really QUIET, which I couldn't believe give the very hip and busy neighborhood of La Condesa where it's located.", "title": "Outstanding ! Best B&B ever !", "user": "BenFor", "date": "January 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 122405474}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "I stayed in the treehouse, which is very small, but fine for one or two people. Comfy bed, TV, good shower, good attention to detail like nice shampoo and soap.", "title": "This is how it should be done!!!", "user": "FreqFlyerAU", "date": "December 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122124730}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "Being fortunate to travel the world, I can truly say this has been one of my best hospitality experiences EVER. From the wonderful, homely welcome, to the beautiful, well appointed rooms (offering everything you would expect from a 5 start hotel), the expert travel/destination advise and complimentary touches - this is a winning formula. Breakfast is around a communal table, so a great time to meet fellow guests and swap stories and tips. A great Continental selection and a different, Mexican hot item each day (delicious). In the evening you are invited for a glass of wine and to enjoy the great company of the owners and other guests. The layout is intimate (16 rooms) around the house and internal patio. Everyone goes out of their way to make sure you have a great time. A special mention to Victor (who acts as Concierge), who drove us out to Teotihuacan at the crack of dawn and was a great host/guide. The Red Tree House deserves all the praise on Tripadvisor. Do not consider anywhere else in Mexico City.", "title": "Genuine hospitality at its best", "user": "Globaladventure", "date": "January 18, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 123264776}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "I stayed at the Red Tree House in August 2011 for my birthday week-end (bad on me for not posting a review sooner!) in Mexico City and I can't say enough good things about this place. The location is in the Condesa neighborhood, which is packed with quirky boutiques and cafes and eateries, and a 5-10 minute walk to the nearest subway station so you are never far away from anything that this amazing city has to offer. The house is an old colonial one with an inner courtyard, and the whole place is beautifully modernized and decorated. The breakfasts are cooked to order and absolutely delicious and the communal spaces are very warm and inviting, and the owners really created an atmosphere that just invited the guests to sit down on the couch, or pull up a chair and just be at ease with the other guests. One of the best parts was in the evenings when the owners host open a few bottles of wine and the guests can just hang out and talk about their day before everybody goes off to their evening activities.", "title": "Amazing Place in an Amazing Neighborhood", "helpfulness": 2, "user": "Foodie26", "date": "January 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 123208869}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Bottom Line: if you're looking for an authentic, hip place to stay in DF that is in an amazing non-touristy neighborhood that is an excellent value for your money, please please please stay at the Red Tree House!", "title": "Hosts Extraordinaire", "helpfulness": 1, "user": "mcsphiladelphia", "date": "January 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122896356}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "You know how it usually goes. You arrive at the B and B, go up to the room, unpack and then come down to the 'wine hour' where it's awkward among guests, bad wine is served and after nodding hello you down your wine and leave. Not at The Red Tree House where owners and staff make it a place and time for guests to really converse, ENJOY the endless wine being poured and end up inviting strangers to join up for dinner.", "title": "the very best B & B in the world", "helpfulness": 1, "user": "Cody14", "date": "January 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122853541}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "And you know how you read tons of reviews of B and Bs where they say how great the staff is with recommendations for dining, touring and everything to make your stay great and you get there and all you get is a page of neighborhood restaurants in your room? Not at TheRed Tree House where Craig will talk chefs and food with you as long as you want, Victor will offer to do double duty as your driver to the Pyramids and everyone bends over backwards to make your stay great.", "title": "ABSOLUTELY LOVED IT", "helpfulness": 1, "user": "seatseeker", "date": "January 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122790597}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Really cool place. super friendly hosts, amazing breakfasts and blissfully comfortable beds. The red tree house is the prefect little chill out place to land after a long flight. The secret court yard is gorgeous and the relaxed living area is a great way to meet fellow travellers and swap stories. the RTH is in the heart of the condesa, great selection of bars and eateries just a short stroll away. we'll definitely be back.", "title": "a little oasis", "user": "kellvis", "date": "November 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121120852}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "Great location near restaurants and shops. Ernesto was a prefect host while owners were away overseas. Breakfasts were a highlight and a surprise every morning. Spotlessly clean and beds really comfortable. Just prefect for my first visit to Mexico. April was great company also. Highly recommended.", "title": "Great breakfast, good location!", "user": "Beth N", "date": "November 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121083646}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "What a super place to stay. You feel like you are welcomed home the minute you walk in the door. The other guests were all fund to talk to, and the location is great, right in the heart of Mexico City near the tours and other sights. Breakfast was super! I happened to be staying there on my way back from Buenos Aires just as the swine flu scare shut down Mexico a couple of years ago, and they were great, going out of their way to make things easy for everyone. I recommend it to anyone who wants to have a wonderful experience in Mexico City.", "title": "Feels like home the minute you walk in the door!", "user": "DocSavage_007", "date": "November 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120604235}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "My husband and I stayed here for two nights at the start of out trip to Mexico and it was by far the best place we stayed. The house is lovely, rooms cleans, the bed was one of the most comfortable I've ever slept in, it has a great courtyard, a sociable atmosphere, amazing breakfasts and the staff couldn't be more friendly or helpful. Stay here.", "title": "Great B&B", "user": "laura b", "date": "November 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120564367}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "The Red Tree House has that type of service that makes you feel comfortable, taken care of, and makes the whole Mexico City experience a great one.", "title": "its a home away from home", "user": "na_ta_ez", "date": "November 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120284119}], "location": {"country": "Mexico", "region": "Central Mexico and Gulf Coast", "city": "Mexico City"}, "variance": {"poor": 0, "average": 1, "very good": 13, "terrible": 0, "excellent": 517}, "aka": "The Red Tree House Hotel", "slim_ranking": 0.0123456790123, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "description": "A comfortable, affordable house with rooms to rent in the heart of the vibrant, safe neighborhood of Condesa, in Mexico City."}