{"user_rating": 4.0, "review_count": 79, "name": "The White Hart", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "I booked a table here for Sunday lunch on Rememberance Sunday. On arrival our table had been reserved in our name. We were seated straight away and our drinks order taken immediately. We didn't wait very long for our food and I have to say that there was plenty of it and it was delicious. The prices are very reasonable too. All in all a very pleasant and enjoyable lunch in a friendly warm pub! We live locally and will certainly be back soon.", "title": "Lovely Meal And Great Service", "user": "Dicky2583", "date": "November 25, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0}, "id": 146145611}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "This was the perfect place to arrive at after a cold day at Thruxton! Warm pub, warm greetings from the staff and a lovely atmosphere all round. We were going out for dinner later but decided to stay in the pub as we felt so comfortable there. The place was buzzing from early afternoon. The food was good and the service was more than good. The room had evewrything you needed with lots of toiletries etc. Although the pub is on a roundabout, it was quiet. We look forward to staying there again!", "title": "Friendly staff, lovely atmosphere", "helpfulness": 1, "user": "LollypopsDorset", "date": "November 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145950290}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "I decided I had to immediately write a review after staying at this lovely country pub.", "title": "Friendly, Helpful and Comfortable", "user": "Marianne T", "date": "November 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144481102}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "My first impression immediately set the bar high by the friendly welcome I received from the staff when checking in. They were very chatty and answered all my questions with enthusiasm and clear knowledge of their establishment. I was given clear directions to my room and offered fresh milk and fruit along with the facilities already in my room.", "title": "Fantastic!", "helpfulness": 1, "user": "holidaygal38", "date": "October 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143635214}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "On entering my room I was very pleased with the cleanliness and homeliness. There were several toiletries in the bathroom and tea and coffee available with the kettle. The smell was pleasant (unlike some rooms you stay at) and the bed very comfortable.", "title": "Friendly, Comfortable, Clean and v handy", "helpfulness": 1, "user": "David T", "date": "October 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143523491}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We have stayed at this Inn several times each year over several years and always found the same friendly welcome and good service. The rooms are comfortable and adequate, rather than luxurious. You have a tea/coffee tray with biscuits, new forest bottles of water and chocolates in each room.", "title": "Busy Inn with rooms", "user": "Charlesmalcolm", "date": "April 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 157416203}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "The breakfasts are good and varied as well as freshly cooked. The lunch and dinner menu is also varied with a good choice and specials board. We can recommend the fish and chips on a Monday, this is when it is served in newspaper, the old fashion way.", "title": "Good lunches", "user": "Rosie H", "date": "April 6, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0}, "id": 156777101}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "There is plentiful parking space at the front and back. It is a short walk up the High Street to many interesting shops and you can watch the Trout in a tributary of the River Test that flows under the road.", "title": "very suitable", "user": "jacquesotoole", "date": "March 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154923482}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "The staff are always friendly and helpful which is why it is frequented by so many of the locals. Always a good sign.", "title": "Delicious food in a relaxed country pub", "helpfulness": 1, "user": "Harry B", "date": "March 17, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0}, "id": 154862754}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Ate lunch here again, this time on a Saturday. Varied menu plus chalkboard for daily specials. Buffalo burger with chips was good as was tender meaty lamb shoulder and vegetables nicely cooked. Service friendly and no trouble catering for a two year old. Nice outdoor area with tables. Just wished we could have stayed for the home-made puddings but the two year old's nap time was overdue so I'll just have to keep on coming back!", "title": "We will stay here again!", "user": "GeoffandMickey", "date": "March 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154324344}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "I recently made a booking for three double rooms as we were meeting two couples we had met in Sri Lanka and Winchester area was inbetween all three. As we had previously stayed there we suggested.", "title": "Weekend break", "user": "BracknellJuliet", "date": "March 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 153998262}, {"rating": 4.0, "title": "Nice evening", "text": "However, a dissappointment. One couple were outside in the newer looking rooms and two inside upstairs next to each other.", "user": "Routemaster12", "date": "February 9, 2013", "id": 151715206}, {"rating": 5.0, "title": "What else can we say about The White Hart Inn except \"WE LOVE YOU\"!", "text": "Our room looked okay but in need of modernisation. The bathroom had a rusty old radiator and in need of decoration. TV didn't work with bad reception, when mentioned to staff told it was to do with the traffic lights outside for roadworks.", "user": "A TripAdvisor user", "date": "January 27, 2013", "id": 150725157}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Had booked a table for the evening as we thought better to eat in and drink. Food was okay, but nothing special.", "title": "Best of the area", "user": "IanSheffield", "date": "January 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 148770813}, {"rating": 4.0, "title": "Again, speaking as a local", "text": "Had a very nice evening at this pub. The only reason they didn't get full marks was because it felt like there were a lot of things on the menu that were simply not available or they had run out of. Whilst this was slightly annoying, alternatives were offered to our group and an extra scoop of ice cream at the end of the evening with no extra charge when they had run out of the chosen flavour was appreciated.", "user": "JonT999", "date": "December 20, 2012", "id": 147790331}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Very clean rooms although a little dated for us, reminded me of my grandmother's house but in the very best way and the beds were very comfortable. Excellent food in the Restaurant and brilliant friendly service from all the staff.", "title": "Lovely friendly place", "user": "JewellsUk", "date": "May 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160423408}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We stayed in room 3. This is an old pub within Stockbridge - which itself is well worth a visit if you like old style shopping, where places are owned by different people, no chain stores! The bed was the softest I've ever slept in, I could hardly get out! I guess if you like harder mattresses, you should mention this when booking. I can sleep on anything, so didn't mind. The room had a skylight with thin blind, so early morning light came streaming through. We don't mind this but some might. Floor boards were extremely creaky and ceilings low in the corners. The decor in the room was smart and modern. The bathroom was large and lovely. A huge victorian style tub on feet in the centre of the room, and separate shower. Down side, no where really to put your wash bag things. It could do with a place for this next to the sink, there is room.", "title": "Quirky rooms friendly staff", "user": "polarbearonthinice", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 159875761}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We ate here twice and have been before, the food is very good quality and value.", "title": "Good value for money", "user": "judyh84", "date": "April 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 158710328}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "If you want quaint, this is it. But expect what goes with it, as I've mentioned!", "title": "Above average food.", "helpfulness": 1, "user": "Maurice P", "date": "April 22, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0}, "id": 158475298}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "Had a great weekend stay here. We had a lovely meal on our first evening - comprehensive menu and ample helpings. I chose the Hampshire trout on a delicious fricassee. Breakfast was also excellent with everything you could wish for. We stayed in the annexe section which was very handy for the car park. Good provision of tea/coffee with china mugs. Comfortable beds - mattresses rather soft but that's how we prefer them. There were only two main drawbacks ; firstly, there was a lot of floorboard noise from upstairs and secondly, the small window was so high up that you couldn't see out of it. I found this very claustrophobic so would not have wished to have this room for more than a couple of nights, Overall a great stay and good value for money. Would stay again but in a different room", "title": "Great place to stay and eat", "helpfulness": 1, "user": "SDMar", "date": "April 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 157585623}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 8, "average": 8, "very good": 27, "terrible": 6, "excellent": 30}, "aka": "The White Hart Hotel Stockbridge", "slim_ranking": 0.875}