{"user_rating": 4.0, "review_count": 155, "name": "The Queens Hotel", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We didn't stay at The Queens, just had a meal there one night. It looked so promising from the outside but once inside we were amazed to see all the Christmas decorations out (middle of October). It got worse when we went to the restaurant. As soon as we had sat down our nice green napkins were taken off us and replaced with ones with holly on. Christmas crackers were on each table. The food was average, nothing special at all and it just seemed very depressing to see all the decorations out so early. We asked for a jug of water but were told they didn't do jugs, we could only have a glass (very strange). The wine waiter went round each table before then going to get the drinks so by the time our bottle of wine arrived we were well into the meal. Any later and I would have refused to pay for it. Decor was very dull and the staff seemed to be as depressed as we felt!", "title": "Christmas at The Queens - In October!!", "helpfulness": 4, "user": "Cakesy", "date": "October 17, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 4.0, "service": 1.0, "rooms": 3.0}, "id": 47102282}, {"rating": 5.0, "title": "Best Hotel in Llandudno by Far", "text": "Please, October is too soon for Christmas festivities", "helpfulness": 1, "user": "ShearingSearcher", "date": "August 9, 2009", "id": 37167079}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We've just returned from a short break at the Queens hotel, we have been on a number occasions and always found it to be first class. Noticably there were some families there this time, usually there are couples ranging from their early fifties upwards.", "title": "Good Value", "helpfulness": 1, "user": "Tolulla", "date": "July 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33996409}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "The service is second to none, alway's there to help you with any problems that might arise, polite and courteous serving staff, wonderful reception, and good entertainment.", "title": "She was once a grand lady but now a little tired and old.", "user": "infast", "date": "March 17, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 26323993}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "We be returning again.", "title": "new years eve", "helpfulness": 2, "user": "gypsy1604", "date": "January 5, 2009", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 23292373, "likes": {"liked": "— the new year celebrations", "disliked": "— mattress"}}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 10, "average": 24, "very good": 46, "terrible": 4, "excellent": 71}, "aka": "The Queens Hotel Llandudno, Wales", "slim_ranking": 0.53125, "description": "WELCOME TO THE QUEENS HOTEL. Welcome to the Jewel in the Crown of the North Wales coast. The Queens Hotel, ideally situated on the seafront is a family run, celebrating 30 years under the same Management, All 83 en suite bedrooms (many have views of the sea and promenade) have colour television, tea/coffee making facilities, hairdryer and telephone. Wheelchair access is via a ramp (gradient 1:8) in to the hotel, from where the ground floor reception, ballroom, dining rooms and bedrooms are all accessible via 2 lifts. We are able to offer parking for coaches and cars.Extremely accessible situated centrally on Llandudno's Victorian Promenade. Just two minutes from the main shopping street, the Queens Hotel affords splendid views of the Bay, Great Orme and restored Pier. The Aberconwy Conference Centre, North Wales Theatre and Llandudno's other attractions are also within easy reachOur friendly personally trained staff will cater for your requirements in the most professional manner. Relax and enjoy the warm and restful atmosphere of this great Victorian seaside hotel. We continually strive to perfect the service and warm welcome, which is why guests return year after year. Ideally placed with Snowdonia on the doorstep and numerous local attractions including The Great Orme and Venue Cymru, we look forward to welcoming you."}