{"user_rating": 4.5, "review_count": 49, "name": "The Gables", "reviews": [{"rating": 5.0, "title": "A Picture Perfect Afternoon", "text": "A friend and I had a most delightful time and lunch at The Gables this afternoon. The food was unique and delicious...our server was attentive and the ambiance was cheerful, Nantucket-like and romantic. The new owners have restored this wonderful landmark to a \"T\"...wait until you see the new outside garden!", "helpfulness": 1, "user": "ChristineBernice", "date": "September 7, 2006", "id": 5778793}, {"rating": 5.0, "title": "The Gables Restaurant", "text": "Chris from Barnegat NJ", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 2, 2006", "id": 5418048}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "I had booked a room at The Gables for a romantic getaway for an anniversary...and it wasn't that great. First of all, the rooms are wayyyy too small for what you pay. Our room was on the third floor and the shower was on the second floor. Granted we had a half bath in our room however we had to trek down a flight of stairs, that were not private, to shower. The bed in our room was obviously old and did not fit the bed frame well and it was lopsided and practically falling off. Our \"breakfast\" was only a choice of three options (french toast, scrambled eggs, or oatmeal) that were given verbally by the waiter (no menu). The breakfast food was ok--I'm sure we could have gotten better food elsewhere on the island. There is also no \"common\" area for guests to relax or hang out. There is a \"sitting room\" which is basically a hallway that they stuffed a couch into. We were basically ignored our entire stay there--while I realize that their main business is the restaurant it would be nice if they took more of an interest in their guests--especially since it's NOT a cheap place to stay!", "title": "Not the best", "user": "zero523", "date": "July 16, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "location": 5.0}, "id": 17955463, "likes": {"liked": "— Location", "disliked": "— We were ignored the entire trip!"}}, {"rating": 5.0, "title": "The Gables...top notch everything", "text": "The location IS great though--and you can get beach chairs and badges which was nice. Honestly, I'm sure there are better B&B's on the island...I will never go back there and will not recommend it either.", "helpfulness": 1, "user": "Thom013", "date": "May 18, 2008", "id": 16166689}, {"rating": 5.0, "title": "I loved this place", "text": "my experience at The Gables was truly wonderful. The rooms are graciously appointed with jacuzzi's and remote control fireplaces. The food was beyond great. The entire experience was definitely \". Top Notch\". And so close to the beach.....great any time of year. I like it in the winter for some \"recharge my batteries\" time. I felt well cared for and at home. Thanks guys.", "helpfulness": 1, "user": "teejay49", "date": "May 4, 2008", "id": 15644249}, {"rating": 5.0, "title": "Fabulous getaway", "text": "My husband and I stayed here over the weekend for our 25th wedding anniversity. It was one of the best places I have ever stayed, This bed and breakfast is a lovely victorian syle house with beautiful paintings and lamps etc...", "helpfulness": 1, "user": "ahuva888", "date": "July 18, 2007", "id": 8141522}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We stayed in the Bailey Lloyd room. The room was very romantic with a red clawed tub in the room that has jet sprays in it. There are other great rooms as well. My husband and I had a great time. We ate dinner in the dinning area downstairs and can not rave enough about how goood the food was. The beachfront is a stone throw away. We even enjoyed a lovely walk after breakfast on Sunday. In a nutshell, our weekend was superb. We definitely recommend that you visit the Gables and have a fabulous and romantic weekend like we did.", "title": "Spectacular!!!", "helpfulness": 3, "user": "seanerenata", "date": "October 30, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6033076, "likes": {"liked": "— The comfort and character of the rooms. And the food.", "disliked": "— Leaving. Ha!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "We had a cocktails and dinner for about 100 guests Chowderfest weekend in Beach Haven. The Gables was the perfect place – relaxing, beautiful and not too “beachy”. The staff pampers the guests and the food was excellent. We also booked all of the guest rooms for our friends and had use of the lovely study on the second floor for late night conversations and relaxing.", "title": "Elegant wedding, fabulous food, charming rooms. The perfect setting.", "helpfulness": 3, "user": "lbillies", "date": "January 29, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 23995983, "likes": {"liked": "— Charming, beautiful and clean - great location near town and beach."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The owners did everything possible to make our event a success from working with our florist and photographer to making great design recommendations and even suggested the LBI Museum for our ceremony which was ideal.", "title": "Just what the doctor ordered!", "helpfulness": 1, "user": "flashNy", "date": "November 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21595149, "likes": {"liked": "— the charming decor", "disliked": "— no view"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We put a tent over the patio and had a band and DJ for cocktail hour and after dinner dancing. Dinner was 5 courses and all of the guests have told it that it was the best food they ever had at a wedding. Even though you’re at the table for awhile not even the children were bored. Service moves at a gracious pace and each course is exceptional.", "title": "Wonderful Experience", "user": "manoroja", "date": "September 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19894785, "likes": {"liked": "— Location and Ammenities", "disliked": "— Smallish rooms"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008", "text": "I’ve read reviews here that say that the guest rooms are small but I don’t think they are for a boutique hotel. It isn’t a chain hotel – each room is decorated with antiques and lovely bedding. The bathrooms are great – well lit, modern and comfortable.", "title": "Eh", "user": "Soon2bMrsHess", "date": "August 23, 2008", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 19270798, "likes": {"liked": "— The pretty front deck.", "disliked": "— Waiting for my order."}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "I would strongly recommend The Gables for a wedding, a party or a get away – even a summer vacation breakfast – it’s at the beach but it’s another world.", "title": "Lacks outdoor space to relax", "helpfulness": 2, "user": "1966traveler", "date": "August 4, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "location": 5.0}, "id": 18597543}], "location": {"country": "United States"}, "variance": {"poor": 6, "average": 3, "very good": 4, "terrible": 2, "excellent": 34}, "aka": "The Gables Hotel", "slim_ranking": 0.583333333333, "description": "Glorious Food - Gracious Lodging. A small, refined Long Beach Island hotel and restaurant, The Gables is a meticulously restored Victorian inn combining the charm of a fine 1890s home with contemporary comforts and the finest food and service. Our award-winning restaurant is a destination in itself, at any time, as we serve breakfast, lunch, afternoon tea, dinner, and after-theatre suppers."}