{"user_rating": 5.0, "review_count": 260, "name": "The Purist Villas and Spa", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We had an upgrade on the first night, so we had a pool on our own. The view was fantastic there, and I would suggest to make the reservation for the room with a pool. The remaining days we stayed in the River Villa which had no swimming pool on it's own, and despite the main pool was nice too, we felt that having a Gazebo on your own with a nice pool is much more relaxing, as there are no parasols to cover the area at all in the main pool and without a parasol is quite tough when the sun is quite strong especially in the morning hours.", "title": "Cosy villa close to the center", "helpfulness": 3, "user": "Welikegoodhotels", "date": "October 10, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119141022}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The only thing we were annoyed with, was the driver that they had - quite a competency going on among the 2 hired drivers and the external drivers. Every time we used the car with the hotel drivers, all they asked was what did we do and who drove to where, and once we mentioned that we had an external driver (which was only a coincidence) who drove us around the whole day, the hotel driver was not pleased at all. However, these 2 drivers do not speak well English, and the external driver we had spoke very fluent english and we really had a good time having this driver with us as we were much much informed about places we visited and the life of Bali. I'd recommend to have this driver (his name was Made ((Madi?)) I think) instead if possible.", "title": "Spectacular", "helpfulness": 3, "user": "elinorline", "date": "October 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 119074157}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "We stayed in Hill Villa at the Purist Villas, a series of discrete, detached villas on a beautiful site full of palm trees and other foliage - it felt like being in the rain forest.", "title": "Rabid dogs, fighting roosters, a chained monkey.. oh my.", "helpfulness": 16, "user": "Tasukete", "date": "October 2, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 118865550}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The villa was just a fabulous fusion of modern european and antique Indonesian - stylish and comfortable. The food is totally organic and the signature muesli something to be experienced for breakfast! We had massages in the Spa (excellent) swam in the pool, ate delicious suppers on our balcony and felt totally nurtured by the incredible team of Purist staff. We have travelled the world to some of the most exclusive hotels and can honestly say that the service here was more distinguished and subtle and effective than anywhere we have been. Breathtaking!", "title": "Real luxury just outside central Ubud", "helpfulness": 1, "user": "donnaleedew", "date": "October 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 118835042}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Beware this hotel is not as it appears online and makes me question all the other reviews and how they seem to miss some key points. It is in an extremely remote location so you feel isolated and a shuttle runs twice a day. The dirt path, wild dogs, and baking sun do not make it for a pleasant 30 minute walk into town. Oh yes there is also a chained monkey at a nearby house temple. In the hotel, on the other hand, you are exposed- rooms are easily viewed/accessed with little privacy. Some are very noisy due to children by the pool, construction, and neighboring cock fighting farm. My MAIN COMPLAINT though, is the situation that happened when we first arrived. We were told that there was work being done in our villa and that we were being moved to an equivalent one. When asked to see our villa, we were told it was “dusty”. The equivalent one was not a villa but a room with no private outdoor space, very little light, etc. When we met the hotel owner he confirmed that work was being done, no apologies. I then peaked into the villa we were supposed to have and noticed clothing. Then I confronted the manager he admitted that there were people still staying there. They allowed us to stay later the day we were leaving so I am very grateful for that but even with that there was a lot of confusion and lack of communication, mainly on the part on the manager. Aside from all this though, the hotel is just not run affectively. There is either a lack of management or oversight or possibly a lack of money- maybe all three. A lot of “fibbing” that is easily caught, a lot of miscommunication and misrepresentation.", "title": "Family Stay at The Purist Ubud Sep 2011", "helpfulness": 2, "user": "JenTran", "date": "October 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 118810182}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "It took me ages to pick where we were going to stay in Ubud (so many of the hotels have fantastic reviews!) but I am SO happy that we ended up at the Purist. The architecture is stunning and the atmosphere tranquil and relaxing. But the thing that makes the Purist stand out is its impeccable service and attention to detail.", "title": "Heavenly!", "helpfulness": 2, "user": "ct2281", "date": "November 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120359919}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "The hotel is situated a 10 minute drive outside of Ubud in the perfect location to escape noise and stress. We were welcomed after a hot morning's travel with a refreshing drink and flower garland. We were then taken to our room (the Garden Room) which was just incredible! We had a private pool all to ourselves and the room was beautifully decorated with furniture sourced from Timor. The service was flawless and the staff went out of their way to help organise a cycling tour and a cooking class for us. The only problem we had was difficulty getting the hotel's driver to pick us up from town in the evening for 2 nights running, but the problem was immediately dealt with by the manager and we were treated to complimentary sparkling wine by means of apology. Fantastic. The breakfast was the best we had in Bali and we had it served by our pool each morning. We also enjoyed a massage and body scrub in the spa, which left my husband's skin the softest it has ever been. The hotel was fully booked when we were there but we barely saw any other guests and felt like we had the place to ourselves. On our last day we had to leave early to catch our flight but we were given a breakfast box to take with us and some bangles for me to keep.", "title": "Wonderful stay at the Purist again", "helpfulness": 1, "user": "Kjersti W", "date": "November 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120322228}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Overall, a truly amazing and wonderful experience, a perfect end to our honeymoon!", "title": "The perfect place to unwind.", "helpfulness": 2, "user": "Liz W", "date": "November 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120145133}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Wonderful place and people to come back to and unwind. We will be back som time soon.", "title": "Perfect honeymoon spot or just for relaxation", "helpfulness": 2, "user": "lit2kim", "date": "November 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 120102344}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We had the most wonderful week at The Purist Villas in October, it is such a beautiful space in which to have a holiday. The architecture and design of the villas, and the art the owners have collected perfectly enhance the beauty, peace and tranquility of the setting, and we found it so very easy to relax and thoroughly unwind even though we only had a week's holiday.", "title": "The perfect relaxation centre, with SERVICE", "helpfulness": 1, "user": "Baz777", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119998136}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We stayed at The Purist for four nights in July, and enjoyed a fantastic stay. The villas and grounds are beautiful, and a nice relaxing change after staying in Semenyak. The staff were amazingly friendly and helpful, and the butler service was fantastic.", "title": "Pure relaxation at The Purist", "helpfulness": 1, "user": "amberandtim", "date": "October 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119884171}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We had the pool area to ourselves most times we were there, despite the resort being fully booked. The layout is very private and each room secluded from each other which is great.", "title": "Paradise", "helpfulness": 2, "user": "Naomi86", "date": "October 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119751612}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The only downside to our stay was construction happening near our room (but not very close, about 250m or so), it didn't really bother us as most of the time during the day we were out and about or by the pool. This new villa may be complete by now.", "title": "Very pleasant", "helpfulness": 2, "user": "jeffries", "date": "October 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 119724554}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "Borrowing the mountain bikes from The Purist and cycling around Ubud is great fun, and the staff drew us a map to explore the hills.", "title": "One of the nicest villa's we ever stayed", "helpfulness": 1, "user": "Reinalinda", "date": "October 22, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 119584319}, {"rating": 5.0, "title": "how is this not the #1 place in Ubud", "text": "My wife and I loved our trip to The Purist and any couple would have an amazing stay I'm sure.", "helpfulness": 1, "user": "pac1834", "date": "October 16, 2011", "id": 119374105}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We booked the river villa for 6 days of our honeymoon. When we arrived we were offered our choice of our original booking or an upgraded villa - the jungle villa - an upgrade we gladly accepted due to the increased privacy it provided. Though a little dark, and in need of a more thorough dusting throughout, the facilities and decor of the villa were fantastic. The staff all spoke english well and treated us like family, and genuinely seemed to wish to provide us with excellent service and respect. They were also very happy to assist when I fell ill with the dreaded \"Bali belly\" and did all they could to make the experience less painful. We felt so lucky that we mostly had the the main pool all to ourselves, as everyone else seemed to use private pools attached to their villas. The way the Purist is designed, you really feel like you could have the whole place to yourselves even though we knew from our trips on the free shuttle into town that there a few other couples there. A negative aspect of our stay was the construction noise coming from the property next door, and some irrigation work occurring at the Purist outside our villa, but the noise was only a minor inconvenience to us. A much greater source of annoyance was the competitiveness occurring between the different drivers who work for the villa. Each of them would question what we were doing, when, and which driver was taking us, to try and obtain our business. Madi was our favourite driver, as he was a happy go lucky fella who showed us all the sights along the way. We enjoyed our food at the villa, even if it was somewhat basic. The chef obviously puts a lot of effort into obtaining fresh produce everyday and in his presentation of the food. Our spa treatments were also wonderful and very easy to organise. With these you pay for the quality of the treatment.Ubud itself was an ideal location for a honeymoon, in preference to other locations in Bali", "title": "Excellent honeymoon", "helpfulness": 1, "user": "xelar8", "date": "November 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120806801}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We spent 3 days in The Purist Villas (bamboo villa) and our expecations based on previous comments on this website were fully met. It is a quiet place, very stylish, clean, with attention to every detail and offers you full privacy. Breakfast is served in your villa at the time you wish. Everything has been perfect and Yvonne and Alberto and his staff have been very helpful and friendly to us. Whenever we will go back to Ubud this will be the place to stay. And we can recommend it to everyone who likes to spoil him/herself.", "title": "3 days of full unwind", "helpfulness": 2, "user": "MicheleV345", "date": "November 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 120517754}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Just departed from Ubud on our holiday and could not wait long enough to write my review of The Purist. This place is fabulous in every respect, from service, to the spa, to the villas, to the advice provided. We arrived very late and were promptly picked up by our driver, taken to the hotel and efficiently checked in. Our room, the Hill Villa, was beautiful, secluded and at somewhere around 300sq.m in size, large enough for many more than the two of us. As our stay evolved, the daily suggestions on restaruants, assistance with reservations, and coordination of drivers made it that much better. I think the best compliment though is to their General Manager, whom upon our notice of departure to other parts, indicated that while he looks forward to our return, would also be pleased to assist us in hotel and travel advice for any other Indonesian destination. While there is NO OTHER PLACE to conisder when travelling to Ubud, there is no greater compliment that can be said to any hotel than the ability of its staff to provide service when they may not be the direct beneficiary. Profesionalism and humility say quite a bit of the experience and it most definitly shows.", "title": "The only place to stay in Ubud!", "user": "TAverbuch", "date": "November 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120514808}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We recently spent 4 wonderful nights in the Bamboo Villa. The Villa is spacious with beautiful artworks dotted around the room. The Bamboo Villa has a private pool but we ended up using the main pool more often as there was never anyone in it (even though the hotel was full). Every little detail has been thought of in the rooms and around the common areas. The breakfasts were wonderful with a range of western and Balinese choices. The staff are warm, friendly and helpful. The Purist is conveniently located and the staff organised a scooter during the day for us as well as evening transport into 'town'. Although we had already booked most of our restaurants prior to arriving at Ubud the staff were very helpful with their suggestions. We had a thoroughly enjoyable and relaxing stay and are look forward to returning!", "title": "Lovely relaxing break.", "helpfulness": 2, "user": "Ads50", "date": "November 10, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120406347}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "An enclave of peace & tranquility in busy, cultural Ubud. The Purist is not just one of the finest properties in Bali, it is perhaps the best accommodation in SE Asia - even when compared to the Chedi Club Ubud, The Beachouse Maldives & Pangkor Laut Resort Malaysia.", "title": "To lose yourself, to relax, or to experience the real Bali... The Purist is the place.", "helpfulness": 2, "user": "geohove", "date": "November 9, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 120385702}], "location": {"country": "Indonesia", "continent": "Asia"}, "stars": 4.5, "variance": {"poor": 0, "average": 4, "very good": 31, "terrible": 0, "excellent": 225}, "aka": "The Purist Villas Hotel", "slim_ranking": 0.0803571428571, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 5.0, "location": 4.5}, "description": "THE PURIST VILLAS AND SPA is a hip designer’s hideaway nestled in the green fertile hills of Ubud, Bali. It wants to be a meeting point for individuals, for those who need to unwind in an inspiring setting and being pampered with great massages and delicious food. Our chefs use the freshest of ingredients, locally produced and in season, whether your meal is served in your villa or in the restaurant. In its rural and tropical setting you can fully appreciate the tranquil peacefulness the Balinese are famous for. The beautiful surrounding rice paddy fields make the short walk to the centre of Ubud a scenic walk. Being the cultural and spiritual heart of Bali, it is obvious why Ubud is a haven for writers and artists from around the world. The secluded Purist compound includes a spa building used for the specialist Ayurvedic massages as well as a yoga and meditation deck. We offer a variety of treatments, given by the best massage therapists, yoga and meditation teachers. The construction and design of The Purist reflects the ancient Balinese Hindu belief embracing the importance of balance, purity of spirit and harmony, as well as a deep respect for the natural environment. We use an eclectic palette of materials, including recycled wood, authentic Indonesian artifacts, natural lava and lime stone and green river stones. With The Purist, Yvonne and Alberto succeeded in creating yet another home away from home, which has become their trademark signature. The Purist offers only seven private villas, making it the smallest boutique hotel in Bali. In this way, we can meet any of your personal and specific needs. The Purist: sophisticated hospitality stripped to the essence."}