{"user_rating": 5.0, "review_count": 466, "name": "The 1895 Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We were only able to stay in the inn for one night unfortunately, because they were booked the other days.", "title": "Wonderful B&B and gracious owners.", "user": "NYCtravel", "date": "March 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 58128632}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "in summary, it was a wonderful stay. We enjoyed the room (clean, well appointed, good bed and great sheets), had a great time at the wine and cheese speaking with the other guests and the owners, enjoyed a good hearty breakfast and were sad that we had to leave the next day.", "title": "Great Bed & Breakfast", "user": "Jennunc", "date": "February 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57214819}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The owners take pride in their work, really go out of their way to make you feel comfortable, and were able to accomodate all our wishes.", "title": "Great location -- Beautiful Accomodations -- Nice Inn Keepers", "helpfulness": 2, "user": "Woodworker525", "date": "February 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56840871}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We are hoping to return to Savannah and would only stay here again.", "title": "One of the best", "helpfulness": 2, "user": "J11111", "date": "January 31, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54826562}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We stayed at the 1895 Inn last weekend and it over exceeded our expectations, even after reading the reviews here. Originally we were planning a Valentine's Day weekend, but after the Inn was booked we moved our trip back one week. I'm so glad we did. Ed & Bob are the best hosts and you truly feel like one of the family. The Inn has all the comforts of home and more! We stayed in the Colonial Room, which was Beautiful! The breakfasts far exceeded any B&B food we've had before. Words cannot describe how great everything tasted. The Inn is also located in the center of everything. Savannah is a walking city and the Inn is very central to everything you want to see.", "title": "What's not to love", "helpfulness": 1, "user": "Like_to_travel_111", "date": "January 24, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54284706}, {"rating": 5.0, "title": "Want to be pampered? Try this Inn", "text": "We stayed for 3 days here and got spoilt rotten ! Not being able to eat eggs I could not eat all on offer at their superb breakfasts but no matter, Ed and Rob rustled up alternatives! Well worth the accolades.", "user": "Rhodocrat", "date": "October 24, 2009", "id": 47639393}, {"rating": 5.0, "title": "Lived up to all the Trip Advisor high ratings and more.", "text": "This is an outstanding 4 bedroom inn with lots of amenities and great hosts plus the resident dog, Dudley, to greet you. Perfect location in the middle of the old town.", "user": "pikespeak1", "date": "October 21, 2009", "id": 47437971}, {"rating": 4.0, "title": "So you say you don't like B&B's???", "text": "Given the unanimous rave and near-rave reviews already written for 1895 Inn, we have nothing to add about this B&B and its hosts that hasn't already been said, all of it true! Now, many travellers come to Savannah and the 1895 pre-disposed to B&Bs, and we suspect they are always enthusiastic and pleased. So we're writing to those of you who generally avoid B&B's in favor of hotels (as WE generally do!) to give you that unique perspective.", "user": "jpahter", "date": "October 19, 2009", "id": 47234322}, {"rating": 5.0, "title": "Outstanding Inn for a Great Weekend Trip", "text": "To begin with, we strongly suspect that there is not a better B&B experience to be had, anywhere, period. The home is a showpiece of immaculate rooms with truly wonderful art, antiques and furnishings. The central historic district location is ideal. The 9AM breakfast is deliciously elegant and informal at the same time. Ed is a marvel of local knowledge and solid advice and one of the most gracious humans you will ever come upon. He is also compulsive about culinary and housekeeping details, which may give HIM headaches but works to YOUR favor as a houseguest!", "user": "SBHgirl", "date": "October 17, 2009", "id": 47088369}, {"rating": 5.0, "title": "Amazing gem! Would not change a thing!", "text": "Now, for you non-B&B people and no others, here is the rest of the story. Yes, you'll climb two and perhaps three sets of stairs every time you enter or exit the house. Yes, there are house rules. Yes, you will rub elbows with others at breakfast and in the common areas even if you forego the daily wine & cheese get-togethers. Yes, the furniture is old and the floors may creak here and there. Yes, Oglethorpe has traffic noise and the firetrucks across the street can pull out, sirens blazing, at any time of day. These, after all, are the reasons you and we typically choose elevators, boxy modern rooms, expanded amenities and anonymity, because we genuinely prefer them. To each his own, and to your own self be true!", "user": "cab99", "date": "October 9, 2009", "id": 46366339}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "We thought we would miss the privacy of a hotel or apartment and we were wrong. It was fun meeting other people and comparing the day. The breakfasts are to die for and we wish we were still there. The bed is so comfortable, the bathroom like a spa. We could store leftovers in the fridge, and we were treated like royalty.", "title": "Best B&B ever", "helpfulness": 1, "user": "Deneen R", "date": "December 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50424179}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "My wife and I prefer B&Bs and have stayed at many very nice inns. We read the reviews here and so expected a pleasant experience ... but our expectations were exceeded in every way.", "title": "A great house and warm and friendly hosts -- made our trip to Savannah a memorable one!", "helpfulness": 1, "user": "J-J-SoPines", "date": "November 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49904215}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The inn has a nice layout that works well with a very nice and open kitchen open to a beautiful dining room and living area. This is very conducive to conversation with our terrific hosts and really nice guests that were also enjoying the inn. The furnishings, art and collectibles are quite an addition and Ed and Robert had many interesting stories to tell.", "title": "The most unique and relaxing B&B; you will not be disappointed.", "user": "MarieNorthCarolina", "date": "November 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49389999}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Ed and Robert are charming, witty and knowledgeable about Savannah and much more and added a lot to our weekend in Savannah. As noted by the other reviews, the breakfast was fabulous and we enjoyed all of it ... yes we ate too much but we'll be good this week!", "title": "Once Again, the highlight of our trip!", "user": "CK95", "date": "November 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49060933}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The inn is spotless, the bed very comfortable and they have pretty much thought of everything.", "title": "Perfect", "user": "ERigby", "date": "October 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47751129}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "We stayed for a weekend recently and absolutely LOVED the Inn. This wasn't our first visit - we have been to The 1895 quite a few times. Savannah always charms us with it's grace and beauty, but the Inn is the highlight of our trip. The breakfast alone is worth the price of the room, which I might add is very reasonable. Bob and Ed are fabulous hosts, and they made us feel like we were at home, not just visitors. I would (and DO) recommend the 1895 to everyone I know.", "title": "The best inn you will ever find!", "helpfulness": 1, "user": "CarolinaFolk", "date": "January 19, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53894369}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Our recent 3 night stay at the 1895 Inn was the highlight of this get-away. We were immediately welcomed by Ed who made us feel right at home, right away. And what a home it is! Beautifully and tastefully decorated without that 'Laura Ashley' look or feel. Each room [4 in total] is extremely clean, spaciously equipped with modern facilities and conveniences and old world charm. The inn is well situated within easy walking distance to all the highlights. Parking in the back is limited but free street parking for guests is safe and convenient. Wine and cheese at 5:00 is served. Robert makes one heck of a breakfast, formal and elegant, yet comfortable. We loved this inn and enthusiastically recommend it for those who appreciate the finer things..without pretense. Ed and Robert really made us feel welcomed and we certainly appreciated their hospitality. Oh, and during your stay at the inn, you might as well visit Savannah too.", "title": "Spoiled in Savannah - This is the place to stay.", "helpfulness": 1, "user": "ncc1701a", "date": "January 7, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52867325}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Everything about this B&B is wonderful; from the owners (who are born hosts), to the rooms (rammed with the most beautiful art and antiques) to the food (divine).", "title": "Fabulous B&B - everything you could wish for and more.", "helpfulness": 2, "user": "MrandMrsRees", "date": "December 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52082325}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Staying here is like staying in a museum there is so much beauty to behold. And yet comfort is clearly a number one priority here. We both slept wonderfully well on our gorgeous bed, after enjoying our evening snack of chocolate cake in front of a DVD borrowed from the very extensive DVD library.", "title": "Can't beat the 1895 Inn in Savannah", "helpfulness": 1, "user": "ILnative", "date": "December 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51411688}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Breakfast in the morning was bountiful and delicious.", "title": "Gorgeous Inn, Top-Notch Service, Lovely All-Around", "helpfulness": 1, "user": "dnhenry77", "date": "December 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51281296}], "location": {"country": "United States"}, "variance": {"poor": 0, "average": 0, "very good": 9, "terrible": 0, "excellent": 457}, "aka": "The 1895 Hotel", "slim_ranking": 0.025641025641, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}}