{"user_rating": 5.0, "review_count": 241, "name": "The Luang Say Residence", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "We stayed at the Luang Say residence for three nights during our visit to Luang Prabang. The Hotel is visually appealing, colonial french style buildings nestled among lush vegetations. The staff was extremely professional and helpful. We have never experienced this high quality level of service anywhere. Rose and Ae were duty managers, Edward was the restaurant manager. They were fantastic. The rest of the staff was as good. They always accommodated our requests wholeheartedly, For example, the internet in our rooms was not that fast (building 5), so they immediately tried to fix it. When all their efforts failed, they moved us to different rooms. They made reservations for us at restaurants in town, shuttle us to and from the spa. Everything worked flawlessly.", "title": "World-class service at this fantastic propery", "helpfulness": 1, "user": "Prozach", "date": "July 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166233579}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "The restaurant is exceptionally good, but a little pricey. We had one dinner there and three breakfasts. You should not miss the dinner, at leafs once. The Lao flavors are fantastic.", "title": "Luxurious stay in a beautiful paradise", "helpfulness": 1, "user": "Jashnzindagi", "date": "June 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 165651738}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The rooms are large, with a small reception area, and large beds. The bathrooms are clean and the shower is huge. The geckos do chirp at night, but that is OK. Between the geckos and the mosquitos, i choose geckos.", "title": "Hidden Gem", "user": "Iehoeyn", "date": "June 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163412169}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "Overall, a great stay, and will definitely come back again. Cannot recommend this pace highly enough.", "title": "UNDISCOVERED GEM", "user": "Janejit", "date": "June 5, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 163130606}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "A pretty property, Luang Say residence is a paradise for those who want to experience luxury in Luang Prabang.", "title": "Quiet elegance", "user": "D B", "date": "June 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162936173}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Stay here, you will not be dissapointed! Worth every penny for the room , ambience and service. From arrival we were treated like royalty - airport pickup with water, arrival at hotel with lovely greeting. Then to the room - wow! I stay in alot of hotels and this room was outstanding. Drinks that night and dinner, also flawless. Continued with breakfast, and a lovely day by the pool.", "title": "Perfect in every way - except we had to leave!", "helpfulness": 1, "user": "NewcastleNicole", "date": "July 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167578853}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "My only comment woudl be that the spa we were recommened by the hotel was lovely for treatments, but a little 'sterile', so maybe do your own research on spas.", "title": "I would live in this hotel if I could", "helpfulness": 1, "user": "rwkinfla", "date": "July 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167443127}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "Overall though, amazing hotel, grounds, and serivce. If i get a chance i will defintiely be back.", "title": "Wonderful hotel", "helpfulness": 1, "user": "JemmaSydney", "date": "July 9, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 166992744}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "Luang Say Residence is perfection in the Laotian mountains. From the moment they picked us up at the airport until we left we were treated like family. The hotel is only two years old but it looks lie a French colonial mansion from last century. We stayed in one of the four rooms in the main building, and our room and bathroom were large and spacious and very clean. The staff could not be nicer or more helpful, and the food in the restaurant has got to be the best in Luang Prabang. I hate to write this review because I don't want anyone else to discover this gem. But they truly deserve five stars all around.", "title": "I did not want to leave!!!!", "user": "FeathersLucey", "date": "July 8, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 166701323}, {"rating": 5.0, "title": "All you could wish for and more", "text": "This hotel is outstanding. From the beautiful gardens and pool area through to the design and special touches in the rooms it is excellent.", "user": "mpyy", "date": "July 7, 2013", "id": 166586785}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Arriving at this beautiful hotel you already get a taste of what to expect. Entrance and lobby area is how you would expect the France colonialists to live in old times but guess they would not have had such smiling and attending staff as Luang Say Residence can proud them self off.", "title": "Colonial charm in Luang Prabang", "user": "ThaiExplorers", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 162232430}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "The short walk to the room (all suites) is a small excursion in it self, as the garden is beautiful and compromises more spices on display than most well equipped garden centers around the world can produce.", "title": "A fabulour hotel and dining experience", "user": "roadtrip222", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 162222546}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The rooms are located in separate villas with 4 rooms in each. Spacious and tasteful decorated, which makes you fell at home right from the beginning.", "title": "A Charming Hotel", "helpfulness": 1, "user": "FLKathie", "date": "May 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162026779}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "I could continue writing praises for this hotel but will end here and conclude: This place is simply just perfect.", "title": "My 2nd return to The Luang Say Residence and still superb stay at this stunning and best hotel in Luang Phrabang", "user": "Nok_Sujitra", "date": "May 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160789839}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Beautifully renovated property with meticulous attention to all details colonial. We stayed in the Exploratory Suite which was lovely, large and luxurious. The bath room was tastefully decorated and again decadently large. The restaurant was memorable, elegantly decorated, and importantly, the Chef was able to handle perfectly a menu of traditional French cuisine alongside Laos local dishes. A great wine selection was available which helped top it all off. Our best meals were had here during our stay in Luang Prabang. The service was at all times, friendly, polite, and attentive at all times. Thank you for making our stay memorable.", "title": "Enchanting", "helpfulness": 1, "user": "HKFrequentFlyer", "date": "April 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 159142512}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "We just spent 3 nights in Luang Prabang at this wonderful hotel which I picked based on the reviews of this site. Everything people have written is true- the hotel is a gem. On arrival the staff took us to our suite which was just beautiful- designed from the 1900's French colonial charm with modern amenities. Particularly loved the bed which had mosquito net draping. We had a terrace which overlooked the main street which was nice. Breakfast was simply delicious each morning- freshly baked breads, home made jams and a huge a-la-carte choice. The staff did everything they could to make our stay wonderful and arranged for tours and transport to the city center. Would stay again in a heart beat.", "title": "Excellent in every respect...", "user": "sguntupalli", "date": "August 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170239123}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We stayed at the Luang Say Residence for 4 nights. From the moment we were picked up at the airport, everything went very smoothly. The room (we stayed in a Pioneer suite) was large, nicely furnished and very well equipped. It's hard to believe the hotel was newly built because its colonial style is quite convincing! The large pool was very much appreciated as well. The a-la-carte breakfast was one of the best we've had during our trip throughout S-E Asia. We also tried the Laos tasting menu at the Belle Epoque restaurant, which was very good indeed and an outstanding introduction to local food. The wifi is of a decent speed throughout the entire hotel. Finally, what made our stay more than just great was the excellent service of the entire staff. In particular, Lae at the front desk could not be more helpful and sweet, she has arranged everything we asked for in the best possible way. All in all, a must in Luang Prabang!", "title": "just perfect", "user": "elyke1234", "date": "July 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 170076002}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "My wife and I stayed at The Luang Say Residence in Luang Prabang for 4 nights . We occupied a Pioneer Suite.", "title": "Great Hotel !", "user": "raja t", "date": "July 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 169545468}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "It was a very good experience overall. The room was very nice, with a good balcony and large bathroom.", "title": "French colonial chic experience!", "user": "touristsunshine", "date": "July 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 169310549}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The hotel cafe ( Le Belle Epoque ) was really outstanding .", "title": "Paradise in Luang Prabang", "user": "miss_moss79", "date": "July 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169253823}], "location": {"country": "Laos", "continent": "Asia"}, "stars": 4.5, "variance": {"poor": 4, "average": 4, "very good": 21, "terrible": 1, "excellent": 211}, "aka": "The Luang Say Residence Hotel Luang Prabang", "slim_ranking": 0.0307692307692, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.5}, "description": "Quaintly located in a lush landscaped garden, this luxurious property provides 5 colonial style buildings that include this fully decorated boutique resort. Other than leisure travelers, this property is also a perfect base for guests on transit since it’s only a short drive away from the airport and downtown. All the 24 suites are fully equipped with a flat screen television, personal mini bar, in-room safe and WiFi internet access. Featuring numerous onsite facilities such as a large swimming pool, dining room, library, foreign exchange service and laundry service. For explorations, guests can walk down the tree lined streets where you will find a wide range of restaurants, cafes, vibrant handicraft markets and the famous, Mekong River. The city also boasts its 32 protected temples and the famous attraction, Haw Kham Royal Palace Museum – which you should not miss. The Luang Say Residence awaits your visit."}