{"user_rating": 5.0, "review_count": 96, "name": "The Clarke House Bed & Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "My husband and I got married at The Clarke House Sept. 8 2012. What a beautiful spot for a wedding! This place is a hidden gem. Cindy, the owner, was involved in every last detail leading up to the wedding and even helped me with many ideas. She even came out of the Inn at midnight after my rehearsal dinner at The Country Cow the night before to help touch up all of the flowers and table settings with me. I got a great night sleep in the King Suite and was able to relax and get ready with my bridesmaids there the next day. We had a tented reception over the whole back yard with130 guests in attendance. Even though it started to rain right before our ceremony Cindy set huge umbrellas for guests in the ceremony area so we could still take advantage of the beautiful setting. The next day Cindy cooked brunch for approx. 20 of us and it was amazing! The pool and jungle gym were great for the kids and the fire pits on various areas of the property added great warmth to the cool night air. I wish I had more pictures to share. If anyone is looking for a unforgettable wedding venue this place is it!", "title": "My Wedding Weekend at The Clarke House", "user": "Jennysoprano", "date": "September 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139996110}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Cindy and George were a pleasure to meet and very helpful. Cindy served up a great breakfast while George helped with the food and conversation. We will certainly go back if we're in the Campton area again. [Ask Cindy about the Six Burner Bistro!]", "title": "Top-Notch Room & Breakfast", "user": "nomojunkmail", "date": "August 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138049943}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "My sisters and I and our husbands stayed recently. Cindy and George are extremely accommodating! Our room was spacious and the king sized bed was incredibly comfortable. There were nice toiletries provided along with plush robes. The rooms were spotless. We had the most delicious and amazing breakfasts and they served us on the deck. Bring your appetite, but Cindy's heirloom breakfast recipes will keep you full until dinner! George prepared a fire for us each night and they had a large selection of cds and dvds for use in the rooms or in the living room. Also, there is a huge assortment of games both indoor and outdoor. They have a beautiful place and they spare no attention to detail. Their grandson, Bryson, was extremely polite and helpful, a fine young man. There are flower gardens everywhere and a very nice pool. We all agreed we definitely plan to come back!", "title": "A Must Stay !!!", "user": "EllenL283", "date": "August 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137524943}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We stayed with Cindi and George for three days and we simply went \"batty\" over the the EXCELLENT accommodations. The room was very charming; the surroundings were quiet with a country-type atmosphere; and Cindi's cooking was just superb! Thank you George and Cindi!", "title": "The Clarke Experience", "user": "John R", "date": "August 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136301468}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "My family (3 generations) has not been together under one roof since 1973. When planning a family reunion for this summer in New Hampshire, we strived for perfection. And that's exactly what we found at The Clarke House Bed & Breakfast! From reservation to check-out, every aspect of our stay was magnificent & flawless.", "title": "Family Reunion Weekend", "user": "Catherine P", "date": "July 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135917414}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We were married in New Hampshire this past weekend and a friend recommended the Clarke House and we were not disappointed. Cindy and George were wonderful. The room we had was cozy and warm and the breakfast was simply amazing. The German pancake was thin and light like a crepe, dusted with powdered sugar. The sausages with onions and apples were delicious. Cindy also asked us before we arrived if there were any food allergies and she made sure what we needed. This place is like a piece of heaven tucked in the woods. We couldn't have asked for a better place to stay.", "title": "Donna and Fran M Massachusetts", "user": "Donna R", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128479638}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "This was our third trip to the Clarke House and we will be back! My husband and I needed a weekend getaway, some time to just relax and do nothing :) We love the peace and comfort that the Clarke House offers. We spent our mornings feasting on the gourmet breakfasts that Cindy prepares (unbelievable), our afternoons reading and relaxing by the fire in the living room, and our evenings trying out a couple of the local restaurants. This trip we ate at the Italian Farmhouse just up the road in Plymouth, it was fantastic! We are already planning our return trip this summer with a few of our friends. As far as Bed & Breakfasts go, this is top notch!", "title": "Repeat Relaxers at The Clake House", "user": "ElizabethJ33804", "date": "March 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126910038}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "I agree with pretty much everything my wife said in her review -- very friendly, very nice rooms, cozy atmosphere. But I have to be a bit candid, even if I'm the first to give it four starts instead of 5. If you don't like the specific cuisines they serve, you'll have a hard time eating breakfast. The vast majority of their dishes have some kind of fruit mixed in or cooked in, and I'm not a fan of fruit. They were mildly accommodating in that they made oatmeal as a substitute for one course, but I wasn't given any alternative for several of the other courses and had to eat nothing for part of the second breakfast -- even after we told them the day before. My wife and I like to bake ourselves, and we always make sure to bring alternatives for even the pickiest eaters.", "title": "Very good, but breakfast needs more options", "user": "MichaelGreenhut", "date": "February 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125025863}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "When we were leaving, they also commented, \"I hope you had enough to eat. Your diet is rather limited.\" Not really something you say to guests with tastes different than yours.", "title": "We found winter and the comforts of home at the Clarke House", "user": "Donna K", "date": "February 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124977846}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Also they mentioned they had trouble accommodating vegetarians, so watch out if you don't eat meat.", "title": "Warm, welcoming family vacation atmosphere", "user": "Traveler1377", "date": "February 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 124975715}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Great experience, two nights in Maple Suite. Breakfast was incredible, a full course meal. Great hospitality from George and Cindy. We looked for a place to stay convenient for a wedding, we found the perfect place. We can't wait for a return visit.", "title": "Felt like home!", "user": "S S", "date": "July 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135897550}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Steve & Susan S.", "title": "Beautiful Girls Getaway!", "user": "Amber C", "date": "June 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132318686}, {"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "This place is absolutely beautiful! Went for a girls getaway, for a baby shower! Perfect location for it! The food was splendid, and the host Cindy and George were so fabulous and helpful. Loved the pool and hot tub, and fire pit, and the house and rooms are gorgeous! Would I go again? FOR SURE!!!", "title": "Amazing B&B!!", "user": "Larasorich", "date": "June 18, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 132274283}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "We loved our stay! It was a fun girl's weekend getaway for a baby shower...amazing! Every detail was attended. The food and atmosphere were top notch. Can't wait to go again!!", "title": "FUN Baby Shower party!", "user": "Traci S", "date": "June 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131480391}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "I recently stayed at the Clarke House Bed & Breakfast with a bunch of ladies for a baby shower get away. We enjoyed relaxing around the pool and hot tub, visiting on the patio while using the grill, then we sat in the yard around a fire pit for more relaxing and chatting. The grounds are beautiful, the owners are very accommodating, ensuring we were comfortable and having fun. The next morning, we enjoyed a DELICIOUS breakfast before the baby shower. This was the perfect getaway, I would come back and have another girls weekend away any time!", "title": "Want the quintessential New England B&B? The Clarke House is it.", "helpfulness": 1, "user": "CP883", "date": "April 25, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 128593642}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "My wife and I stayed four nights at Cindy and George's wonderful bed and breakfast. We stayed in the King Suite, which is quite large, with a separate dressing area. The bed was extremely comfortable. We used the wood buring fireplace each night, which not only warmed the room but added an even more cozy feel. The breakfasts were the best we have ever had at a b&b. Cindy is a fantastic cook. The best compliment I can give is to George and Cindy as hosts. They made us feel right at home and the morning conversations with them and the other guests were very enjoyable. We hope to stay at the Clarke House again.", "title": "Fantastic breakfasts and more...", "user": "jab31151", "date": "October 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143046914}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "this was classic NE experience. first and foremost George and Cindy are wonderful and special people. George spins some wicked yarns lol :) but all true of course. an incredible individual who has served his country passionately. now he reports to a new General--his wife Cindy. Cindy you are making me look bad at home. i was known for my breakfasts but you have made me look like a rookie novice. i am under pressure coming home.", "title": "oh my", "user": "Scoop717", "date": "October 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142219384}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "now to to Clarke House. you can tell in the room with the fireplace (a common area to watch tv) that the wood beams do date back hundreds of years. also another living room area you can hang out in so plenty of room. we stayed in the king suite and were not disappointed. the inn is immaculate and George let me use his computer to check directions and get my fix of surfing. also helped with where to go and how to get there. you need to know where you are going. always candy and cookies out. Cindy's breakfasts (if you did not get the clue already) are LEGENDARY. bread pudding with carmel sauce, raspberry baked french toast, fruit cups with great fresh fruit. there was more but i need to finish.", "title": "comfortable, relaxing, enjoyable", "user": "Pat R", "date": "October 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 142164612}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "we went to Cannon Mtn and rode the tram up the mtn. George suggested driving on the Kacamangus (sp?) Highway thru the White Mountain National Forest. good call and so glad we did that on our way back to ME.", "title": "new england road trip", "user": "David153", "date": "October 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 142154059}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "there is no doubt why these folks are getting such high ratings. the nicest people and they have a great place. so glad we found them.", "title": "Lovely, Relaxing and Delicious!!! :)", "user": "Patty0722", "date": "October 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141748140}], "location": {"country": "United States"}, "variance": {"poor": 0, "average": 0, "very good": 2, "terrible": 0, "excellent": 94}, "slim_ranking": 0.166666666667, "description": "Charming and cozy luxury bed & breakfast located in the heart of 4 Seasons of Beauty ~ The White Mountains of New Hampshire. We are conveniently located near many attractions including Mt Washington, The Cog Railway, Clark's Trading Post, The Natural Science Center, and the Curious George Cottage! We are close to many festivals such as Jazz, Boogie and Blues, the Highland Games, several playhouses and open-air concerts. We are near to hiking, biking, kayaking, boating and fishing, or just take a beautiful scenic drive through the mountains and explore our lakes, rivers and waterfalls ~ and don't forget the great New Hampshire skiing including 5 ski resorts a short drive from us. On premise we have a heated swimming pool and Jacuzzi, lawn furniture, hammocks, firepits and yard games in the Summer. In Winter we have a large skating rink (and skates) a bonfire, snowshoeing, backwoods hiking and sledding all located at the B&B ~ and after an exilherating day of play, come sit by one of our large wood burning fireplace and just relax ~ AND our breakfasts are amazing ~ you are guaranteed to be well fed! \"Enter as Strangers ~ Leave as Friends\"at The Clarke House Bed & Breakfast!"}