{"user_rating": 4.0, "review_count": 3867, "name": "The Palmer House Hilton", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We had a wonderful stay. Our room was exceptionally neat and comfortable and also spacious and quiet. We loved the convenience of the bars and restaurants and had so much fun just exploring this magnificant space. The location is next to the Art Institute and Crown Fountain. It is not a budget hotel, but you get so much for what you pay for--a total package.", "title": "Comfortable, versatile, great location!", "user": "DrSkater", "date": "October 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83751572}, {"rating": 2.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "I looked forward to staying here after hearing the renovation was finally finished. I was wrong! The room was hardly big enough for the bed, the thermostat and light switch were actually behind the television set - that's how small it was. And it is loud as ever - the sound of plumbing from other rooms in our little cell was deafening, drunks roaming the halls sounded like they were screaming in our room, and we had some traffic noise. The old school, Shining-set charm just doesn't make up for this nonsense. There are much nicer, better built places to stay nearby for the price. Stop by the Palmer lobby for a drink and spend the night elsewhere.", "title": "Still Dumpy After All These Years", "user": "TravelCuties", "date": "October 16, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 83737601}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Enjoy Chicago!", "title": "Retro glamour in great location", "user": "writer5280", "date": "October 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83589441}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "My husband and I just stayed at the Palmer House on a Friday and Saturday night while in town for a wedding. Beautiful hotel! We were upgraded to a suite that was stunning. Excellent workout facility. Great location to check out downtown on foot. I'd highly recommend this hotel.", "title": "Ignore the haters...still a high quality great experience", "user": "JFKforinternational", "date": "October 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 83469372}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "A lot of people told me that the hotel has seen better days...that the lobby is still greqwt but the rooms will be old, maybe stuffy.", "title": "Ambient, nice, best location but I wouldn't call it family oriented", "helpfulness": 2, "user": "tupes92", "date": "October 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 83414492}, {"rating": 5.0, "title": "What a glorious old hotel!", "text": "I spent three nights at the Palmer while attending my son's graduation from Kellogg. The hotel was clean, staff from friendly and helpful. As I was traveling by myself, I felt safe! The hotel is so convenient to all of Chicago. My room was gorgeous and had great beds! I highly recommend,", "helpfulness": 1, "user": "WHSBookLady", "date": "June 25, 2011", "id": 114730458}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The hotel is centrally located. All services you need are available. The beds are some of the most comfortable we have experienced at a hotel in recent years, even their rollaway beds are comfortable. Service is great and easy to see that it is a popular spot with tourists. My only wish was that the 2-bed rooms had queen-sized beds instead of full-sized, but wasn't a huge issue.", "title": "Excellent service, clean and comfortable.", "helpfulness": 1, "user": "Tripcritic2", "date": "June 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 114720510}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We stay at the Palmer House almost every time we visit Chicago and are never disappointed. The biggest plus is the location- easy to get to by train from either O'Hare or Midway, and the Art Institute, Millennium Park, Michigan Av are all close by.", "title": "Great blend of historic elegance and modern amenities + location", "helpfulness": 1, "user": "PAOPAOFlorida", "date": "June 24, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 114719573}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "The history of this place is amazing and the lobby is worth a visit on its own. The rooms can be small but I've never been in one so small that it is uncomfortable. The beds are so comfortable. The Executive Lounge is very busy in the morning, but they keep everything well stocked and fresh and I love it. I noticed that they just started a tour of the hotel, highlighting its history-- didn't have time but plan to do that on a return trip.", "title": "Executive lounge is dreadful- rescue required", "helpfulness": 1, "user": "farawaymum", "date": "June 24, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 4.0, "value": 3.0, "service": 2.0}, "id": 114705978}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I stayed in a king room on one of the two executive floors- the room was lovely-spacious, very nice furnishings and modernised (but tasteful) bathroom.Executive floors have their own elevators-this is nice.The public areas are beautiful and the hotel if properly managed could easily ooze opulence but it doesn't- such a lost opportunity.", "title": "Loved the atmosphere and the location", "helpfulness": 1, "user": "BandBenthusiast", "date": "June 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 114688116}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We stayed at the Palmer House the day before Christmas Eve. The hotel was decorated beautifully for the holidays. They also upgraded our room for us. I had sent an email asking if they could. No charge. Awesome. Staff were very pleasant and helpful. The upgraded room was super. Two bathrooms, and very clean. Bed was great too.", "title": "Grand hotel", "user": "iceal", "date": "December 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90836563}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "As usual, my travels took me to Chicago ... which in December is always an adventure! The best part of the trip is always staying at the Palmer House in the Loop. I always marvel at the decor (the ceiling of the main reception room continues to amaze!), and am consistently pleased with the service. The Executive floor is a great place to unwind and get snacks and drinks, while those working on that floor - and everywhere in the Palmer - are pleasant and happy to help in any way they can. I tell others to stay at the Palmer House ... and everyone always agrees that it's terrific!", "title": "Another wonderful trip to the Palmer House!", "user": "dhimberger", "date": "December 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90833981}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "My husband and I stayed at the Palmer House in Chicago so that we could get together with some family members to exchange Christmas gifts and have dinner. My niece lives directly across the street from the hotel so the location was phenomenal. I booked on line and purchased the 7 day advance nonrefundable king deluxe room. We had a corner room which was spacious, beautifully decorated and extremely clean. Our luggage was delivered in the time frame promised, coffee delivered via room service on time and check in/out was painless. We had dinner with our family at the Lockwood which was excellent and the breakfast buffet included in our room rate. I can't say I have eaten at a breakfast buffet with such a selection and with such quality in a long time. The hotel was decorated beautifully for the holidays. The staff had a bit of holiday cheer so it was just such a pleasant stay for us. For those shoppers - State street is right there. It is a very fine hotel. Try it out next time you are in Chicago - I don't think you will be disappointed.", "title": "Wonderful Christmas Getaway", "user": "WarmthSeekerChicago", "date": "December 27, 2010", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 90832791}, {"rating": 5.0, "title": "Beautiful, iconic Chicago hotel in the heart of the city!", "text": "Frank Sinatra, Judy Garland, George Burns, Frankie Vallee, and Nat King Cole have all performed at the famous Empire Room at the Palmer House Hilton. It’s a hotel that holds a place in Chicago’s history with the original hotel being built in 1871 and being destroyed in the Great Chicago Fire just a few days after it was finished. It was immediately rebuilt, and then rebuilt again in 1925. That is the structure that still stands today. The lobby is grand – these were the days when folks flocked to the lobby to socialize and people watch (remember no TV). It is still a great place to sit, people watch, and enjoy a drink.", "helpfulness": 1, "user": "travel_junkie3000", "date": "December 21, 2010", "id": 90405012}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "We visited in December so everything was beautifully decorated for Christmas. Our room was on the 20th – Hilton Club Floor. One room was a double and was very large – plenty of room to spread out with a large walk in closet and decent size bathroom. The King room was a bit smaller, but completely adequate. In both rooms, it looked as if the bathroom had recently been freshened up with new paint, wall paper, vanity and sink. The tub was a little tired but clean and I like the vintage look of an older hotel. The hallways are decorated with pictures of all the celebrities that appeared in the Empire Room. It was fun to see all the people that performed there from the 30’s to the 70’s.", "title": "Wonderful as always", "user": "gretabus", "date": "December 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90355055}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "Over a number of stays at the Palmer House have found it to be a comfortable, traditional downtown hotel with an elegant lobby. Because of its age, the rooms are varied. In particular, the smaller rooms have some problems with noise due to the thinness of the walls. If you can get into the two bathroom variety, they offer soundproofing and space.", "title": "Central Downtown Hotel for Business", "user": "The_Lewis", "date": "August 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 76495672}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Have had some wonderful dinner suggestions from the Concierge desk. The lobby is a great place for drinks later in the evening. But one of the real secrets is to exit out the back door and have your after work drink at the Miller Pub - traditional service and atmosphere can't be beat.", "title": "Great stay for what we paid", "user": "VLSE", "date": "August 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 76227504}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "My only complaint would be that the internet is not included, which is ridiculous in a business hotel.", "title": "Doesn't honor reservation; poor maintenance of plumbing", "helpfulness": 1, "user": "drumman358", "date": "August 19, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 75991347}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "My husband and I stayed here for 5 nights for our trip to Chicago. We booked the hotel through Hotwire and got an amazing deal on the nightly rate. For what we paid, it was a great hotel. The room was clean and comfortable. The only things with our room was the carpet looked really worn, not something I would have walked barefoot on and the bathroom shower looked a bit old and in need of a little repair/renovation. The staff was very nice, especially the staff at the concierge desk when inquiring about information about the city. The location of the hotel was great. Right by Millennium Park, and a close walk to the Sears Tower, Magnificent Mile, Navy Pier, and Grant Park.", "title": "The Palmer House Make Your Vacation Special", "user": "ycnanb", "date": "August 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 75512263}, {"rating": 1.0, "title": "Dissapointment", "text": "The only thing I disliked was that it seemed that the hotel charged for anything they could get away with. You had to pay for high speed internet access in your room, to use the fitness centre, you even have to pay if you wanted a later check-out time. These are all things that I'm used to getting included with the stay in other hotels I've stayed at. As well, the parking was somewhat expensive ($38 a night), but I think it was in line with what other places charge for downtown Chicago.", "helpfulness": 1, "user": "Mary26Pat", "date": "August 16, 2010", "id": 75506675}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "I was in Chicago recently for a convention and stayed at the Palmer House. It was still a very nice hotel. I had stayed there many years ago. The rooms have been recently renovated so they seemed more modern. The lobby area is a relaxing place to sit and have a drink from the Lobby Bar. The ceiling of the lobby is a beautiful piece of art. The staff seemed friendly. I did not have any problem while staying there. The rooms are a bit pricey. I would stay there again for a business trip. The location is great.", "title": "The grand old Palmer House still has charm", "user": "codysmomnow", "date": "October 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 84496603}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "My fiance and I were driving across country to attend a friends wedding and we decided to stop here for a night as neither of us had ever been to Chicago.", "title": "Great staff, really beautiful hotel", "user": "Hawkeye35", "date": "October 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84487237}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "I can't speak on the price of the rooms as our reservations were made as a gift for us by family but I must tell you, this hotel is wonderful!", "title": "Classy", "user": "dgold7", "date": "October 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 84428560}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "We drove from Connecticut and arrived at the Palmer House right after check in time had begun. I can tell you, after driving for 17 hours straight, we looked a fright, but the staff never blinked an eye or treated us as if we were out of place. Everyone from the valet to the bellman to the front desk attendant was professional and kind and made us feel welcome before we even checked in.", "title": "Great service, paper thin walls, upgraded room big, regular rooms tiny", "user": "Southside", "date": "October 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 84117772}, {"rating": 3.0, "stay_parameters": "Stayed October 2010", "text": "The hotel is within walking distance of a number of shopping centers and restaurants and only a few blocks from the famous \"Bean\" in Millenium Park.", "title": "Expensive Disappointment", "user": "navellar", "date": "October 18, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 83987448}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We recently stayed at the Palmer House for the fireworks.", "title": "Great Location for 4th of July Fireworks", "user": "MI_TRVLERS", "date": "October 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 83224505}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The location is great!", "title": "BEAUTIFUL!!!", "user": "angela7p", "date": "October 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 83222184}, {"rating": 2.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "The staff very friendly.", "title": "I may come back for a drink but not for the night....", "user": "salesgirl19", "date": "October 11, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 83033306}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Overall great experience.", "title": "Exquisite hotel located in the heart of Chicago", "user": "JoAnn70820", "date": "October 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83020265}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "Hotel was wonderful and staff very friendly! We are putting it on our list for a place to get married at as the hotel was gorgeous and within walking distance of everything that Chicago has to offer! Thanks again!", "title": "Visit The Palmer House in the Spring", "user": "BarbaraBurlington_WI", "date": "October 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82784552}, {"rating": 2.0, "stay_parameters": "Stayed February 2008", "text": "I recently stayed at the Palmer House Hilton for a short business trip. They are renovating this hotel and there is noise everywhere. The elevators in the lobby were being worked on so you had to lug your luggage up 2 flights of stairs. What a nice way to arrive! I moved rooms twice because the noise was either in the walls from the electrical or plumbing, or the banging of construction starting at 8:00am on a saturday morning or outside your window from the train next to the hotel. Every room is a different size - some are like closets and some are huge - very inconsistent. I would recommend staying in more modern hotel instead of this old over the top hotel.", "title": "Renovation City - stay here if you like noise", "helpfulness": 1, "user": "ROSEOC", "date": "March 1, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 13961579}, {"rating": 4.0, "stay_parameters": "Stayed July 2005, traveled as a couple", "text": "A fabulous location to exploer the Chicago Loop area, enjoy Grant Park, the Taste of Chicago, the Museums, and the architecture. Also if you're a fan of historic hotels, it doesn't get any better than this. The lobby is fabulous and our room was fresh and renovated but still have the historic charm and details. Loved it! And will definitely stay there again when I'm in Chicago.", "title": "Love the Historic Charm", "helpfulness": 1, "user": "tsc_traveler", "date": "February 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 13936295, "likes": {"liked": "— Historic Charm, the central location"}}, {"rating": 4.0, "title": "Missed the \"old\" Palmer House", "text": "We've stayed at this location every Christmas season for the last 5 years--it's a tradition for us and our friends. The hotel has undergone a huge renovation, making it more \"metro chic\". The rooms & restaurants are more modern, and the staff is as accommodating as ever. I guess if I'd never stayed at the \"old\" Palmer House, I'd really love this place--but I miss the \"grande dame\" feel. At least they've kept a lot of the historical elements--such as the ornate ceilings, lobby, etc.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "February 27, 2008", "id": 13882972}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "The Palmer House Hiltion is a big and busy hotel. The lobby was noiseier that the downtown Chicago streets outside the hotel. However, I got a great deal ($72) through Hotwire and the hotel was well worth the price I paid. My room and bathroom were very, very small, but I paid a small price for them. This is a nice, old property in the Loop that packs in a lot of guests. The hotel is being renovated and I am certain that the renovation will improve the hotel further. I am used to a quieter hotel, but I was only there for one night. The price I paid was a tremendous value for the hotel. I didn't use any of the amenities at the hotel since I arrived late and left early. Rooms service breakfast was nice, but expensive.", "title": "Good Deal on Busy Hotel", "helpfulness": 1, "user": "Aaron A", "date": "February 23, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 3.0}, "id": 13795677}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "I recently stayed at the Palmer House Hilton for a short business trip. I had fond memories of this hotel, but I had been warned about its downhill slide in recent years and the renovation currently underway. Both turned out to be accurate.", "title": "A Tired Old Hotel", "helpfulness": 2, "user": "Ursus62", "date": "February 23, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 13782010, "likes": {"liked": "— Location", "disliked": "— Small rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Stayed here over a June weekend to see the Nationals visit the White Sox. Was impressed by the professional friendliness of the staff - everyone from the door man who greeted us to the person who checked us out. The hotel is beautiful, turn of the century classy, and the lobby is breathtaking. The room (8-137) was huge - two double beds - and you could easily fit two more in there! No view, but it wasn't important to us. Bathroom was decent sized and clean. Only issue was the lack of free things one is used to in the hotel. WiFi was $7 an hour. The gym was $10 a visit. The hotel lobby bar was steep (and closed by 12 on a Saturday!) I can only imagine what parking cost. It is extremely transit accessible, with the El and Red line subway right out the door, and the Blue line a mere block away, and Grant Park two blocks away. Location was awesome, price was definitely right. Just be aware of the little extras you'll have to pay.", "title": "Classic hotel, good location, but everything is extra", "helpfulness": 1, "user": "DanRandom", "date": "June 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 114835304}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "This property is no longer a 4 star hotel. While the lobby remains grand, the rooms are very small and in need of a makeover. The carpet was frayed, wallpaper was peeling off and doors and door frames are beat up. You can barely turn around in the bathroom, and when the closet door is open you cannot get to the bathroom or bed. The TV's are ancient, and there is no coffeemaker nor refrigerator in the room.", "title": "Aging hotel that needs makeover", "helpfulness": 1, "user": "Nobarbe", "date": "June 28, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 2.0, "value": 1.0, "service": 1.0}, "id": 114830967}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "The front desk clerk was rude to my wife when she checked in. The hotel charges a fee of $10 per person per day to use the fitness facilities and another fee to access the internet. Valet parking is over $60 per night. Could Hilton possibly nick us for any more fees? They are worse than the airlines.", "title": "Incredible service....again!", "helpfulness": 1, "user": "SunnyPeach", "date": "June 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114804598}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "The only reason we stayed here was that all the other downtown hotels were booked up. In the future that would be the only reason we would ever stay here again.", "title": "Beautiful Hotel with Elegance", "helpfulness": 1, "user": "beverlyjoy", "date": "June 25, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 114739791}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "The service at The Palmer House continues to be stellar, and is why I continue to go back there. The hotel is rich in history, and the architechture and murials are really lovely. Even though I was on a business trip, it made it so much more pleasant to be out of town when you get to stay in such a lovely hotel, with service that is so advanced. We had breakfast in the Hotel all 3 mornings, and the servers were very pleasant and happy to share their bright side with us each morning! Yes, I would recommend it to all of my business peers and my friends. Thanks", "title": "Everything was good except the room smelled", "helpfulness": 1, "user": "KMKC08", "date": "June 25, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 3.0, "value": 4.0, "service": 3.0}, "id": 114737361}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Overall not a good stay at the Palmer House Hilton. First room looked old and faded. The bathroom was so small that one person in the bathroom could barely close the door by leaning off to the side and then slowly closing the door. We asked to be moved. The next room also was old and faded and quite a lot smaller than the first room. But the bathroom was about twice the size. Now, twice the size means it was still a very small bathroom but at least one person could easily utilize the sink, shower and the toilet. There was still no place to put toiletries.", "title": "Disappointing", "helpfulness": 1, "user": "garythetraveler", "date": "January 1, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 12213486, "likes": {"liked": "— Location", "disliked": "— Old small rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "When first checking in, I asked if there was a possible upgrade for me (I was with my wife and daughter). I am HiltonHHonors Diamond and usually get upgraded to executive level or to a suite at a Hilton Hotel. She responded in a rude tone that I would surely like the room I was in. It turned out to be the miniature bathroom room.", "title": "Loved The Palmer House", "helpfulness": 3, "user": "LV247", "date": "December 24, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 11933117}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "The room did not have enough towels for three people. Called down and they brought up extra towels. Next day room was again not supplied with enough towels. Called down and they were brought up. Next day was the same. It does not seem like a big deal but how many times do you have to ask for enough towels.", "title": "Not what it used to be - AT ALL!", "helpfulness": 8, "user": "Jennifer and Ji... F", "date": "December 20, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "location": 5.0, "rooms": 3.0}, "id": 11705512, "likes": {"liked": "— The location.", "disliked": "— It's sadly changed for the worse."}}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The hotel provides in and out self parking with a garage next door. They validate a ticket for the in and out after we paid $30 per day for parking. Twice the validation did not work and I either had to pay an extra $29 or get another ticket at the garage and then get it validated again at the front desk. Both times the front desk staff acted if if it was my fault as if I had not validated the ticket.", "title": "Bad times at the Palmer House Hilton", "helpfulness": 4, "user": "IanGChicago", "date": "December 19, 2007", "detail_rating": {"cleanliness": 1.0, "front_desk": 3.0, "location": 4.0, "service": 3.0, "rooms": 1.0}, "id": 11692574, "likes": {"liked": "— the used condom in the room"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "Hotel is under construction and there are a few inconveniences involved with that but construction is a temporary issue and I cannot fault that.", "title": "Under renovation, but new rooms are lovely", "helpfulness": 2, "user": "jhw516", "date": "December 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 11676634}, {"rating": 1.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "sure it's beautiful. location is great. historical. and if you want to step back in time, great. if you are not a business traveller, this place might be for you.", "title": "annoying", "helpfulness": 2, "user": "slovos", "date": "December 21, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 51642331}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled with friends", "text": "here's my gripe: $15/day WIRED internet", "title": "Great Location and Nice Hotel for Families", "helpfulness": 1, "user": "BoysInNY", "date": "December 20, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 51570501}, {"rating": 5.0, "stay_parameters": "Stayed December 2009", "text": "$15 is already outrageous. if you want to charge me extra for a glass of wine at the beautiful bar and call it ambiance, i get it, it's worth it, but this is internet, there is no ambiance, the hotel is choosing to screw its clientelle at this rate. still, this is, if a little high, toward the average for 4+ star hotel internet rates. what really gets me is that this is internet with a 4 foot cable. you're tethered to a desk. by no means can you relax with a laptop in bed. no way. if i order room service, it comes with a convenience charge, i'm paying extra. i don't have to move. again, i get it. but this $15 tethered interent is the hotel telling you to come to the kitchen, make it yourself and drag it back to your room and pay triple.", "title": "Fantastic", "user": "travellingMaine", "date": "December 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51453546}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "The Palmer House Hilton is such a historic hotel. From the moment you walk through the front doors and walk up to the lobby, the view is amazing! It was really nice to walk into the lobby, see everyone enjoying themselves at the bar or just lounging around, and looking up and seeing the detail in the ceiling. It’s truly a spectacular sight.", "title": "Historical, but NOISY", "user": "brodiego", "date": "December 17, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 1.0}, "id": 51393606}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "This is a very large hotel. There are different elevators that go to different floors, so be mindful of which floor you’re going to. Once you’re on the floor, it’s almost like a maze to find your room. There are a lot of signs to tell you where to go, so that helps out.", "title": "Good location - nice hotel", "user": "TravelWisconsin", "date": "December 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 51248747}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "The check-in line was a maze and had ropes to herd you through the process. Not enough staff available. As a result, the bell captains were trying their best and it was hard to get an elevator quickly. The Lobby Bar was busy and very loud due to the crowds not like in the photos on the website. Strollers & suitcases were near various chairs. Tacky. Our room was tiny but renovated. Great bed! Tiny closet. The valet was always overwhelmed due to crowds. I feel that the place looked like they had given out coupons for a cheap rate. Do not stay here!", "title": "I felt like I was at an amusement park or zoo", "helpfulness": 2, "user": "LUVSHOPPING", "date": "August 15, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 75374903}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "We enjoy staying at the Palmer because it is historical and the facility has been restored beautifully. Make sure to check out the ballrooms. The Lockwood restaurant is excellent and the service is the best. It has a very friendly hotel staff. The typical room is a little on the small side as most older hotel rooms are. We always recommend this hotel for out of town guest because of it's historical significance and proximity to the museums and M. Park.", "title": "Wonderful historic hotel", "user": "bettyIllinois", "date": "August 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 75342244}, {"rating": 1.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "I attended a conference and was required to stay at this property. I was very disappointed with the accomodations for the price of the room and the location. The property has been updated but the quality of the bedding and the taste of the decor is odd. Many of the rooms have no views at all facing air conditioning units or office buildings. The location is an unusual neighborhood with no nice restaurants, bars or shopping nearby. The property also charged me $5 to RECEIVE a fedex package in addition the the outrageous $51 for valet parking. On a positive note the gym-spa is really nice with great equipment in a large space. For $219 per night there are much nicer hotels in much nicer neighborhoods in Chicago.", "title": "There are better hotels in Chicago", "helpfulness": 1, "user": "Jusloretta", "date": "August 14, 2010", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 1.0}, "id": 75220039}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We wanted a hotel near Grant Park since our kids (17 & 20) were going to Lollapalooza at Grant Park. We also wanted something centrally located where we wouldn't need to get our car or take a cab. I read all of the reviews and found that the Palmer fit all of our needs. I was a little worried since some of the reviews mentioned tiny rooms and/or being located near noisy elevators but there will always be a bad review or two. Our fears were solidified when, after check in, we entered an elevator with a disgruntled British woman who was clearly unhappy. She couldn't stop complaining for the entire ride on the elevator. When she got off of the elevator we all wondered what our experience would be like.", "title": "Great place for parents with kids going to Lollapalooza", "user": "Craddock01", "date": "August 10, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 74697974}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Let me back up...I booked through Priceline and called a few days later to put in a few requests. We were reserving 2 rooms for 4 nights and I wanted the rooms near each other and I wanted one of the rooms to have 2 double beds. When I booked through Priceline all they showed left were Kings. When I contacted the Palmer directly, they had no record of my reservations through Priceline. They stated I could book 2 rooms as insurance and cancel up to the day before our stay if need be once we worked out the problem with Priceline. I got everything worked out and the hotel was very helpful. The rooms were rather large, were not near the elevator, they accomodated my requests (the rooms were connected with one being a double and one a king).", "title": "Great lobby, room was small but clean and comfortable", "user": "CallaBudgie", "date": "August 10, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 74662516}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I have stayed in some beautiful old hotels, but the lobby of the Palmer House puts all other \"grand\" hotels to shame. Spectacular ceiling mural, huge, original Tiffany lighting sculptures, a \"red lacquer\" ballroom that is amazing, and a grand ballroom that is stunning. All public areas are amazing. My room had two double beds and two bathrooms. My guess is that in the recent renovations, they took two small rooms and combined into one. Beautiful furnishings. Bathrooms were small but nice. Room was very quiet. My Hilton Honors membership gave me quick check in. No free wi-fi, but I did get free high-speed internet. I always carry my iPad, so good thing I brought my laptop along with me, too.", "title": "Truly a grand hotel, worth every penny.", "user": "rac-columbus", "date": "June 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114674260}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Good location, close to art museum, lakefront, Macy's (former Marshall Fields flaship store), and only a reasonably short walk to Michigan avenue's Mag Mile.", "title": "Historical and impressive lobby, but don't expect anything grand in your room.", "helpfulness": 1, "user": "RedSnapper25", "date": "June 20, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 2.0, "value": 3.0, "service": 4.0}, "id": 114588116}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "This was a very nice stay for a business trip.", "title": "excellent location but,,,,", "helpfulness": 1, "user": "loverotravel", "date": "June 20, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 114587530}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "The hotel is very impressive especially in the lobby area. Staff was very nice and efficient when we checked-in. We only stayed there for one night and we would not wish to stay longer. It was the last minute decision to stay there using Hotwire.com. We didn't want to pay $200-$300 per night in Chicago Downtown area for just one night. It was about $120 with tax.", "title": "The best hotel lobby in Chicago", "helpfulness": 1, "user": "MizzouLizard", "date": "June 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 114530188}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "Pros: Centrally located in Downtown Chicago area.", "title": "Tiny Rooms - Great Location", "helpfulness": 1, "user": "Last_Girl", "date": "June 19, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 5.0}, "id": 114446259}, {"rating": 4.0, "title": "Nice Hotel, Great Location", "text": "We came to Chicago to attend a Christmas concert (Dave Koz and friends) playing at the Chicago theatre. We flew in from Cleveland to O’Hare airport, took the “EL” downtown (stop is about ¼ from hotel), walked to the hotel, and even though there was a lot of activity, we were able to check in fast and efficiently. We have stayed at the Palmer House before; it is a fine old hotel that has stood up to the test of time. Although there could be some updates (old CRT televisions for one). The room was large and spacious, although we did peak into one room on our way to our room and did find it unusually small. The room was very quite, we had a family of four with two very active kids next door, and when I saw that they were next to us I started to worry as they were full of energy as they were entering their room at the time I went for ice. Once in our room I could barely here them, with the TV off!! One of the staff showed me to the ice room, not only did they point me in the direction, but they took me to the room. The room never got serviced since we put the “do not disturb” sign out after we came from breakfast. We did not have a view from our room, but they have the window coverings designed in such a way that no view is required. I like this hotel and its downtown location which is centralized with everything!! We would defiantly stay there again.", "user": "Kennewi-CLE", "date": "December 12, 2010", "id": 89650400}, {"rating": 5.0, "title": "Wow! A Bucket list visit", "text": "What a dream to stay at the elegant Palmer House hotel! We were treated like honored guests! The lobby is to die for!", "user": "Kaikoura", "date": "December 3, 2010", "id": 88943661}, {"rating": 4.0, "title": "Palmer House is our new favorite hotel!!!!!", "text": "Ok, based on the reviews we were a little nervouse about staying here. However that all changed as soon as we stepped in the lobby and saw how beautiful it was. Our room was a two double with sitting area and two...yes two closets!!! Our room was huge!!!! We have stayed all over the country and different countries,,, this room was very large and nice!!! We slept great!!! no noise whatsoever...The location is great!!! Walk out the door to state street and bam, there is the Christmas parade!!!! The starbucks is over priced since it is inside the Palmer house, and we did eat at the Lockwood restaurant, very good!!! A little pricey, but what nice hotel restaurant isnt? The service was phenomenal!!!! The only complaint I had was with the concierge...I asked the lady where the lady for directions to the parade, and she just looked at me and said \"state street\"....uh...I tolde her we weren't from Chicago, so where is state street??? She coldly replied \" take the escalater down and turn right, walk out the doors and thats state street...???Like we were supposed to know that since it was our second day at this hotel...I guess she was unhappy about working on Thanksgiving...oh well...Her problem, not ours...They should also have flatscreens in the rooms by now, there was still a huge tube tv in our lovely room, so that was outdated....I wonder if Palmer purchased any flatscreen hd tvs with the 179 Million they spent on renovations?? beside those two quirky things we loved this hotel!!! We will stay here everytime we visit Chicago!!!", "user": "fundad1967", "date": "December 3, 2010", "id": 88941389}, {"rating": 3.0, "title": "Nice historib building, lousy experience", "text": "Well, the good things first: The building is nice, the location is perfect, people were friendly.", "user": "Traveller_235711", "date": "December 3, 2010", "id": 88892633}, {"rating": 5.0, "title": "Best overall hotel in Chicago", "text": "The rest was quite shabby: The room was smallish, no bar, nothing, not even a bottle of water for their esteemed hilton honors member. Internet at horrendous prices.", "user": "CG812", "date": "December 2, 2010", "id": 88861757}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "After a wonderful stay at the Palmer House last fall, when my wife and her two sisters decided to get together for a birthday celebration (husbands included, although it was touch and go for a while!), there was no hesitation in returning to the Palmer House. And we weren't disappointed!", "title": "Second visit was even better than the first!", "helpfulness": 1, "user": "Calif0rnia_traveller", "date": "June 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114919719}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "As other reviews indicate, this is a wonderful, classic hotel. There is old-world luxury everywhere - certainly the mural on the lobby ceiling, but in many other details, as well. Don't pass it by too quickly - look for artwork everywhere, and elegant details in every things from lamps to furniture.", "title": "Affordable Luxury, A Must If Staying in Chicago", "user": "ajalloh", "date": "June 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114902920}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The early check-in went great - thanks to Jurgita at the front desk. We had three adjacent connecting rooms on the executive level. I don't think I've ever seen 3 connecting rooms before - perfect for a group of 3 couples. The executive level is well worth the extra money. A private elevator to the top 2 floors is a nice treat! Plus a huge lounge, which was a great place just to hang out in between sight seeing. One of the lounge hosts, Ernest, was incredible. In addition to making us feel welcome and taking care of all our food and beverage needs, he's a wealth of knowledge about the area. The included breakfast was typical continental, but certainly adequate. The evening snacks could have been a full meal - two hot choices every night, plus fruit, veggies, cheese & crackers, etc. And the world-famous Palmer House brownies were available all day! As was fresh, hot coffee!", "title": "A splendid hotel in Chicago", "user": "PeterOdgaard", "date": "June 30, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 114901855}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "The location is perfect. Just steps from the Orange Line train from Midway Airport. Millennium Park and Grant Park are only a block away. Buses run frequently right in front of the hotel to take you wherever you want to go - Navy Pier, Magnificent Mile, Museums. And a 3 day day transit pass is only $14! No need for a car here.", "title": "Perfect location, great service, lots of charm, GREAT fitness center", "helpfulness": 2, "user": "Jamesteroh", "date": "June 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 4.0, "service": 5.0}, "id": 114853781}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "The rooms were in good shape, although the hotel is well over 100 years old. If you're looking for something brand new and modern, stay at the Holiday Inn Express along the freeway. If you're looking for a truly luxurious experience, stay at the Palmer House!", "title": "Best 20th Anniversary Trip to The Palmer House", "helpfulness": 2, "user": "2talltodd", "date": "June 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 114851777}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "The hotel is in an excellent location (at least to me); just a very short walking distance from the Art Institute, Millennium Park, etc.", "title": "Nice but disappointed", "user": "Rubencito66", "date": "December 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 5.0}, "id": 51218365}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "There are a few things that I was extremely surprised by, being this hotel a 4 stars hotel.", "title": "Nice but noisy", "user": "Jabezgreen", "date": "December 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 51188904}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "1. YOU HAVE TO PAY FOR INTERNET CONNECTION. I have been in Europe in hotels with the same star rating and they offered FREE WIRELESS HIGH SPEED INTERNET (YES \"FREE\" and YES \"WIRELESS.)", "title": "Historic Palmer House Hilton", "user": "onemoretrip09", "date": "December 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 51062283}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "2. YOU HAVE TO PAY FOR TV; there are some uninteresting videos for free, which last a few minutes at the most, but the rest is \"pay per view\" and very expensive, considering the quality of entertaining offered.", "title": "I have better experiences in downtown Chicago", "user": "ELE28", "date": "December 9, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 50958779}, {"rating": 5.0, "title": "EXTREMELY PLEASED WITH EVERYTHING!", "text": "3. NO COFFEE MAKER IN THE ROOM... I found it nice to make myself a cup of coffee when I am back to my hotel room from a cold street...", "user": "JaneJOwossoMichigan", "date": "December 8, 2009", "id": 50906136}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "I've stayed at the Palmer House Hilton many times. It always seemed like a nice, grand hotel but this grand dame is showing her age. The room I was in was very small and a bit shabby. I understand a lot of rooms at these old, traditional hotels can be small but the room seemed very tired and in need of an update.", "title": "Needs some updating", "helpfulness": 1, "user": "deparker", "date": "December 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 52042059}, {"rating": 2.0, "title": "Hilton, are you listening? Palmer House has issues!", "text": "For exploring the loop, Millinium Park, and the Art Institute, the location is great. The lobby is lovely but I believe I will stay elsewhere next time.", "helpfulness": 2, "user": "Buckhead720", "date": "December 26, 2009", "id": 51906182}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "I have stayed in this historic grand hotel several times, in December of various years, in conjunction with attendance at a conference in Chicago. I have stayed here the past three Decembers, about five nights each time. This time was the deal-breaker for me ... no more Palmer House!", "title": "Nice hotel, but a little overrated", "helpfulness": 1, "user": "JD262", "date": "December 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 51862618}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "First of all, I want to know where the Palmer House gets off charging guests for WIRED internet, at the scandalously high rate of $18/day? You can't use your laptop in the bed. The service drops without warning and can be quite slow.", "title": "CLASSIC AND CHARMING", "helpfulness": 1, "user": "MONYLINE", "date": "December 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 51816130}, {"rating": 1.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Secondly, could you perhaps renovate and make the bathrooms any smaller? Seriously, anyone over about 180 pounds would have to squeeze and scrunch to fit into the bathroom I had on the tenth floor.", "title": "old dingy hotel", "helpfulness": 1, "user": "chitraveler22", "date": "December 22, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 51708277}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Stayed at the Palmer House end of December over new years for a total of three nights. Hotel was booked through online bidding website, so received an excellent value for the room. The room was spacious, however the room seemed to be missing a piece of furniture, there was room for a chair or small sofa. Bedding, furnishings, etc in the room were all high quality and new. The toilet in the bathroom appeared crooked but was functional. The bathroom itself was very small. The tv from the room next door was audible most of the time in the room. We were on the 12th floor facing Monroe and could hear the EL train but it wasn't too bad, but I know some light sleepers in my family would not have liked this!", "title": "Fantastic property with a few flaws", "helpfulness": 1, "user": "europa00", "date": "January 3, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 52457337}, {"rating": 3.0, "title": "Charme of the last century", "text": "As the hotel is located on the loop line and also on the red line subway, it is great for public transport options. Hotel valet was $51 - do yourself a favor, drop your bags with the bellman, then drive two blocks away and park in the Grand park lot for $29 a lot better than the $38 self park and really only one more block away.", "helpfulness": 1, "user": "FrankS7", "date": "January 2, 2010", "id": 52387479}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Maid service was OK, but was missing a glass one night. Room was always cleaned quickly enough for us.", "title": "Very nice, great location, BEWARE gas thieves in self-park garage", "helpfulness": 1, "user": "phil521", "date": "December 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 52244496}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "The lobby bar of this hotel is magnificent and much enjoyed having a refreshment in the lobby.", "title": "A beautiful, historic Hotel in the heart of Chicago", "helpfulness": 1, "user": "Kimmy528", "date": "December 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 52211728}, {"rating": 5.0, "title": "Beautiful historic hotel", "text": "Business Center cost $9 to print a page and send a FAX (domestic).", "helpfulness": 1, "user": "SabrenaM", "date": "December 30, 2009", "id": 52196552}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The hotel is gorgeous, the main lounge area was fabulous for a drink and the rooms were perfect. Took a wonderful trip with my siblings and we booked 2 rooms each with 2 beds AND 2 bathrooms. The extra bath in the room was priceless and I was extremely happy with the room rate, surprised actually. You're not right on the Mile, but you are literally down the street from Millennium Park and the Art Institute (great museum). You are actually situated in the middle of the Mile and all the museums. We had a fantastic time and I can't say enough about the hotel, wouldn't consider looking elsewhere for the next trip.", "title": "Excellent hotel, good location & incredibly reasonably priced", "user": "CT1129", "date": "August 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 138125817}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "Staying at the Palmer House was an easy decision for my party and myself because of its location, amenities and their pet policy. We were traveling for pleasure to enjoy the windy city and have a new puppy whom we could not fathom leaving behind. Many of the downtown hotels have a not-so-friendly pet policy. Also, the only thing we love more than our dog is brownies. Gooey, chocolates, cake-candy morsels laced with hash...yum. The Palmer house actually invented that delicious chocolate goodness we love more than life itself. If you love dogs and desserts, the Palmer house is the place for you.", "title": "Chicago or Vatican...you decide!", "user": "4figgy", "date": "August 23, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 138103626}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "This hotel far surpassed my expectations. Location in the Loop was perfect for sightseeing and distance from the subway system. From the history of the building to the friendliness of the staff, every part of my stay was fabulous. The executive level room with two double beds was perfect for my husband, my 20 year old daughter and myself. Not a super large room, but plenty of space for a city hotel. The room was spotless and up to date. The breakfast room was staffed by the most efficient and helpful people no matter what time of day we stopped by. Breakfast and appetizer time was crowded particularly on the weekend, but staff kept up with the supplies and cleanliness as best they could. When I called down to the front desk to ask about where I could find some bottled water at midnight, two bottles were brought up immediately. I would stay here again in a heartbeat!!", "title": "Exceeded Expectations", "helpfulness": 1, "user": "Yaques", "date": "August 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 138091690}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "This was a dream, after cancelling our reservations at the Radisson in Milwaukee after the first night (that should have been called the RAT-ison)! The Palmer House was classy and clean. Beautiful decor and rich history (I enjoyed watching the Palmer House history channel at the hotel). Wish they would publish a book for us history enthusiasts. The staff was very friendly for the most part (for a big city anyway), except for one of the operators who obviously needed some Xanax. At any rate, next time I'm in Chicago, I will definitely stay here. I'm a solid Hilton patron now for sure. Thought the valet parking was a little pricey at $62.00 a day, but for room price at $150.00, I guess it evened out. It was right on the loop, so you can take the Red Line anywhere (Navy pier, etc.) and it's walking distance from the Willis Tower (former Sears Tower). You can buy Red Line tickets at the CVS just a few blocks away. I would buy an all day pass or a 2-day pass.", "title": "One of the Best! And I am picky!", "user": "RTAboss1", "date": "August 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138083168}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "I enjoyed my stay at the Palmer House. I really like historic properties and this hotel built in the 1920s did not disappoint.", "title": "Excellent choice for a well located, budget friendly hotel with easy access to major attractions", "user": "Eric C", "date": "August 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 138060016}, {"rating": 4.0, "title": "very nice hotel, I will stay here again!!!!", "text": "I stayed at the Palmer Hotel 7/29/2010 - 8/2/2010. PLEASE DONT LISTEN THE BAD REVIEWS OF THIS PLACE!!! I almost stayed at another hotel because of the negative reviews. The hotel was perfect I arrived at 8:00am for early checkin and did not have any issues. I am a clean freak, to the point I was prepared to go across the street to CVS and by cleaning supplies if needed. The room was very clean , I doubled check the bath room drains and shower curtain and under the bed and it met my expections. I did turn down the comfortor because I dont trust that to be clean no matter where I stay. I had a room with two double beds and found it to be spacious. Yes, the bathroom counter could have been bigger - but at least it was clean with granite top and marble floors and more mirrors than I will ever need! Yes, the view outside my room was of the building next door but you are in downtown chicago what do you expect (room 14-264)! Also the train is near the hotel but I didnt hear it nor did I allow it to hender my stay! This Hotel is right in the middle of everthing, everything is within walking distance. Michigan Mile, Millineum park, restaurants, Filen's Basement and starbucks is INSIDE the hotel!!! We only took a taxi when we went to Gibsons steak house it 's further north by Ohio and Rush streets. $6 taxi ride.", "helpfulness": 1, "user": "shushopin", "date": "August 10, 2010", "id": 74651863}, {"rating": 3.0, "title": "Nice Hotel. Smoky Rooms. Find a floor away from smoking level.", "text": "Everytime we returned to the room it was clean with fresh towels - again no complaints. The concierge was very helpful but the line was very long. TIP B&B restaurant on state st. next door to the Hotel will deliver to your hotel room - we had breakfast in bed every morning and the food was sooo good!!", "helpfulness": 1, "user": "bustraveler0000", "date": "August 10, 2010", "id": 74542538}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "I have no complaints about the hotel other than they should add a dance club then it would be PERFECT.", "title": "Disappointing Experience", "helpfulness": 1, "user": "LLindaC", "date": "August 10, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 74542304}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Nice hotel. Great downtown location. Had a room above the smoking floor. I basically had a smoking room. Pretty strong odor. Hotel staff switched my room the next day. Was pleased with the diamond floor. The other floors are very dated.", "title": "A good place to stay", "user": "chocolateloverLondon", "date": "August 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74443452}, {"rating": 5.0, "stay_parameters": "Stayed August 2010", "text": "i arrived with 16 yr old daughter and her friend on Friday of Lollapalooza around 12:30. They went to concert, hotel was a zoo and rooms were not ready till 3. I had been up all night. I sat in the lobby for 2 hours where it was horribly loud, crowded and the muzak was screaming. Finally I went to a small room off the lobby, put down my 3 pieces of luggage and put my head down for 30 min. I was awakened by a security guard who told me I could not 'sleep on the floor\" I explained that I was exhausted, waiting for a room, but he made me move.", "title": "This hotel has great amenities and is one...", "user": "IliveITB", "date": "August 8, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 74365948}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We had arrived in Chicago at 08.50am and were able to check in straight away. The process was relatively lengthy but the staff were very polite and helpful. The room itself was quite large and very clean and although no hairdryer was present, one was quickly brought up to the room. The bathroom was lovely.", "title": "Great hotel", "user": "StrawberryBlonde78", "date": "February 15, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13579474, "likes": {"liked": "— The decor, cleanliness and the cute note from reception", "disliked": "— The queasey lifts"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "The public areas to the hotel are amazing, although the lifts made me feel slightly queasy. Overall the hotel was fntastic and in a great location for exploring Chicago. The staff were great and I loved the extra touches, like a card from the guy that checked us in saying what a wonderful experience it had been! Would definately stay there again and would recommend it to anyone visiting Chicago.", "title": "For biz travel I ALWAYS stay at the Palmer House", "user": "rbuffing", "date": "February 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 13557603, "likes": {"liked": "— Brand-spanking new renovation. Unique in-room coffee pods actually make a good cup.", "disliked": "— Can't think of a thing."}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "For years, I've been travelling to Chicago once or twice a year for work. I like the Hotel Burnham, but I LOVE the Palmer House. After a long work day, it is so relaxing to sit in the gorgeous lobby and enjoy a cocktail. I got one of the renovated rooms on this stay and I thought it was lovely. Not everybody likes to look past the small footprint of the rooms in a historic hotel, but I don't mind. Service was courteous, but it could be a little more friendly. Every place I saw was very clean. I never have a problem getting a cab at the PH - which is a huge issue if you're from Arizona because you won't want to walk ANYWHERE in Chicago in January.", "title": "Not the best...not the worst", "user": "ILuv2Travel76", "date": "January 30, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 13123723, "likes": {"liked": "— Location", "disliked": "— Musty room"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "I spent 2 nights at the Palmer House Hilton. A famiily member was staying there for a business conference so it was a good time to check the place out. Unfortunately we stayed in one of the older rooms (apparently there are some newly remodeled ones) Our room was small, but did include 2 double beds, desk, chair, tv and average sized bathroom. The room however had an old smell to it, musty and caused sinus congestion every morning. So if you have allergies or sinus problems I would suggest requesting a newer room. The Lobby on the other hand was beautiful! Living up to its historical significance, and seeing why famous visitors such as Ulysses S. Grant and Charles Dickens stopped in. But overall I wasn't too impressed. There was a not so exciting small gift shop and restaurant/bar on the ground floor. However, there is a Corner Bakery, CVS, Walgreens and White Hen close by for quick breakfasts and coffee. The hotel is located in a great location if you plan to go to the theater, or shopping on State Street. It is close to restaurants too. There are plenty of taxi's and its along the bus routes. Easy walking distance to Millenium Park. Note however, that on Sundays a lot of the small food joints and shops in the loop area are closed, including some Walgreens. For being a Hilton, I was disappointed in the quality of the room, especially for the price, but the location is great depending on the types of activities you plan to do in Chicago.", "title": "Get place to watch the parade", "user": "Charstorm", "date": "January 27, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 2.0, "location": 3.0, "value": 3.0, "rooms": 4.0}, "id": 13029198}, {"rating": 3.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "Specifically choose this hotel for the location to the Thanksgiving day parade. It was lively and full of families for this event. Check in was busy as was the front valet area but it's because everyone arrived at the same time. We had the 2 bed-2 bath room which was a very nice size with a set aside area for sitting, it was very comfortable for a family of 3. I booked online and took advantage of the discovery package which also included the breakfast. For our purposes of parade watching this was key because no one wants to search for breakfast when you should be \"finding a spot\" on the parade route. The lobby area is gorgeous, the room updated but the pool was small and outdated. Also the hot tub was very lame, both the pool and hot tub were filled to capacity at this time of the \"family invasions\". Will stay here again for the same purpose but would probably select a different hotel during other times of the year.", "title": "Under construction", "user": "MadTownTraveler", "date": "January 25, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "location": 4.0}, "id": 12977464, "likes": {"liked": "— Location", "disliked": "— Construction"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "Just completed a 4 night stay at this hotel (stayed here last year for 1 night).", "title": "Grand lobby, small rooms, pitiful service", "helpfulness": 1, "user": "Justtravels988", "date": "August 8, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 74360625}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Grand Lobby- the hotel is very proud of its heritage (a tv channel dedicated to it). the lobby is grand- from a past era. the rooms were recently renovated, but they're really tacky (peacocks on the carpets, green silky/satin cheap pillows, lime green velvet chairs, etc).", "title": "Average hotel in a good location", "user": "jessholl", "date": "August 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 74359045}, {"rating": 5.0, "title": "Very Clean hotel", "text": "The rooms are the size of closets. To the point where they feel unsafe because the hallway door opens directly next to your bed. needless to say, even at 12AM when I tried to sleep, i could hear everything in the hallway and surrounding rooms. its like there is no privacy what so ever.", "user": "jersey1977girl", "date": "August 8, 2010", "id": 74313005}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "I can get over the small rooms since its an old hotel, but the service is seriously awful and amateur.", "title": "Great Hotel, Great Location, Small dark Rooms", "user": "egglestn", "date": "August 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 74154904}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "1). To use hotel wireless (at $14.95 per day- even for HH Diamond members such as me) you have to get this UFO device from the Front Desk. I inquired, they gave me the device, I had to fill out a waiver, then the desk agent went on a 7 minute search for the instructions. Finally, i told her to stop looking and just had them keep it. seriously, a 12 minute ordeal to pay them $14.95 per day. And, they never offered this at C/I.", "title": "A Wonderful Hotel", "user": "badler25", "date": "August 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74071151}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Staff was very helpful regarding TSA confiscated toiletries at 5:30 am. Excellent bar with a very good Dirty Martini. Bathroom somewhat small otherwise a 5 star stay. Very helpful downtown location. The room was well appointed and comfortable.", "title": "Business Travel", "user": "James C", "date": "August 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 138052639}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Full disclosure: I have a life-long weakness for old Grand Dame hotels and the luxuries of eras gone-by. In a sea of glossy hipster hotels, the Palmer House stands apart as an Art Nouveau jewel. The over-the-top lobby is the stuff of legend and worth a stay alone.", "title": "Surprise and delight", "helpfulness": 1, "user": "Leigh_n_Ian_n_Ollie", "date": "August 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 138046007}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "That said, what sets the Palmer House apart is the top-flight guest service. After check-in through the Preferred counter, my 8 year old son and I took the elevator up to our room on the 22nd floor. Upon opening the door, we were slightly deflated upon seeing a well-appointed, but very average, upscale room. Rather small, one window with a mediocre view, and no distinctive features.", "title": "Fun in the Heart of Chicagoland", "user": "twofivers", "date": "August 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 138034915}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "All that changed when the bellman, Steve S., arrived. As he was bringing in the bags, he kindly asked if we were happy with the room. Upon learning through chitchat that it was my son's birthday, he flew into action and moved us to much larger corner room with a view of Lake Michigan. But the gesture that won my heart forever was the surprise delivery of fresh chocolate chips cookies (honestly, some of the best I've ever tasted) and a carafe of ice cold milk in an chill bucket. On the tray was a hand-written birthday card from Steve the Bellman.", "title": "The Palmer House Hilton", "user": "Debra L", "date": "August 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138021315}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Just wow.", "title": "Very nice update of a great old hotel", "user": "twistyhair", "date": "August 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 137995780}, {"rating": 5.0, "title": "Very nice for the price.", "text": "My wife and I stayed at the Palmer House for her 30th birthday. It was very nice for the price I paid. The staff was nice and helpful. Rite down the street from Millennium Park and close to shopping. I would stay here again!", "user": "BigJZ", "date": "December 15, 2010", "id": 89885196}, {"rating": 4.0, "title": "Great find in the heart of Chicago! Excellent value", "text": "I booked a stay at the Palmer House Hilton over the summer during the Taste of Chicago. It was a belated birthday trip for my gf (and a sneaky engagement plan....she said yes). The Palmer House Hilton was a pleasant surprise.", "user": "gphenom24", "date": "December 14, 2010", "id": 89858984}, {"rating": 4.0, "title": "Another great stay!", "text": "First off that lobby area is immaculate. It's a beautiful lobby area, very classy & upscale. My girlfriend immediately thought I'd laid out big bucks for our weekend stay. Check in was fine. There was a short line, but it moved quickly and our desk clerk was very courteous and we had keys in hand promptly and were off to our room. Also, the baggage check was free after our checkout and we didn't leave until late in the evening (we did tip though).", "user": "SeasonedTraveller999", "date": "December 13, 2010", "id": 89773881}, {"rating": 1.0, "title": "Paying customers are a bother to this place.", "text": "Now we did have one of the smaller rooms, which was a slight disappointment. The setup and decor were excellent. But initially I felt a tad uncomfortable with the lack of open space. I got used to it by the 2nd day, but it's by far the smallest hotel room I've ever stayed in. That said, I didn't have to climb over the bed or squeeze in between anything. There's just enough space to do what you need to do. Not much extra. I must say though, the beds and pillows were extremely comfortable. I slept very well.", "user": "Traveler40-2011", "date": "December 13, 2010", "id": 89754984}, {"rating": 4.0, "title": "Gotta stay here at least once", "text": "The view from the room was not much to see. All we really could see was the fire-escape. But that wasn't an issue as we spent most of our time there out & about exploring the city.", "user": "procyclist", "date": "December 12, 2010", "id": 89675428}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Over-all great building fantastic architicure. Stayed on the 10th floor (and all floors same except floor 7(see below) and the executive floors. very nice open hallways with lounge area near central elevators. Rooms were very clean, beds very comfortable (although sharing a full bed with a spouse or another may cause restless sleep). bathrooms were clean and decent albiet small.", "title": "Very nice", "user": "Philip E", "date": "August 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137956190}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "A couple of nice bars, a few shops, Starbucks, and a good resturant (rather pricey but good). Banquet room beautiful, servicestaff was great and very attentive.", "title": "Beautiful hotel, perfect location!", "user": "outtahere1", "date": "August 21, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 137955444}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "What would I change??? Valet parking ($62 overnight, CRIPES!); but I guess compared to the price of the hotel and the Chicago location... not overly unbelievable.", "title": "Brilliant Stay", "user": "p999hug", "date": "August 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137921788}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "I fell in love with this hotel! It was so beautiful and the staff was amazing! Wherever we looked something was being cleaned! And the location could not be beat! We walked everywhere, which really saved on taxi fares! Perfect anniversary getaway...we will be back!", "title": "Top Notch", "user": "Peggy Y", "date": "August 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137909750}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "My friend and I have just returned from a stay at The Palmer House and found the experience very enjoyable.", "title": "Very Well Property Right In Middle of Chicago", "user": "lanzmo", "date": "August 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137889893}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "While we had some concerns based on other reviews, the appeal of staying at a classic historical treasure won out. And we weren't disappointed!", "title": "Beautiful classic hotel! Relive the grandeur of old!", "user": "Calif0rnia_traveller", "date": "October 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84837497}, {"rating": 2.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "If you stay here, make sure you slow down and take a moment to enjoy the beauty. The most obvious is the main lobby with the gorgeous mural on the ceiling. But all around you are smaller, more subtle works of art - various statutes, paintings, ornate fixtures, and ornate trim all over the place, inside and out.", "title": "Awful service", "user": "skates26", "date": "October 25, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 84806171}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "We had a room on the top floor with a private elevator that only went to the top 2 floors (and the fitness center, I believe). So there were no long lines and not stops at all 23 floors.", "title": "Nice hotel, great location", "user": "Lisagmd", "date": "October 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84802459}, {"rating": 2.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "Our room on the executive level had two beds, two bathrooms and was very large. Everything was in great condition and clean. Even the rooms had touches of elegance - pay attention to the details everywhere, even on the lamps. We did not hear any noise from neighboring rooms at all.", "title": "Nickled and Dimed To Death", "user": "Chicago60603", "date": "October 24, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 84636463}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "The executive lounge was above average for a Hilton. Don't miss the original recipe brownie created right here at the Palmer House for dessert!", "title": "Loved it: location, posh lobby, nice room but teeeeny bed.", "user": "bl0s5m", "date": "October 23, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 84563884}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We stayed for 1 night 8-21 for personal travel. We were a party of 3, 2 adults and a 2 year old. I booked on Priceline as we always do for Chicago. In the past we have always gotten the Hyatt Regency on the river. The Hyatt is amazing and have always had an amazing stay. The Hyatt must have been booked because we ended up here.", "title": "Probably Great If You Don't Use Priceline", "helpfulness": 2, "user": "jenai23", "date": "August 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 138166953}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Before arrival I emailed and used Facebook to inform the hotel that we would be traveling with a 2 year old. I did not think I needed to specify that we needed a non smoking room with a 2 year old. When we checked in they informed us that they were booked full and all that was left for us was a smoking room, This was a Tues afternoon at 3:10. But they would be happy to upgrade us to the executive floor where we would get two beds and two bathrooms. She said we would want two beds since we had our daughter along. BUT it is still a smoking room. I said no thanks we just need one bed in a non smoking room we have our own pack and play. She said oh they have pack and plays we did not need to bring ours. Really a Pack and Play that has been in a smoking environment is suitable for a child to sleep in? I informed her that we would absolutely not be staying in a smoking room and that I requested a non smoking one. She then informed me that because I chose to use priceline that I do not get to pick my room and that I would get was leftover after their regular paying guests got the requested rooms. She said that is the chance you take when booking to save money. I have never had any issues at any other hotel using priceline. Not sure why a hotel would participate in priceline if this is the way they operate. I let her know that I was shocked that they even still allowed smoking in their hotel and she said oh yes that is why our customers book here. I said well thanks on that case I will head to another hotel. Miraculously a room on the 17th floor was available but it was a non smoking entertainment suite that had no bed. They could bring us up roll aways. We decided that would be ok not a big deal to us. We had a sleeping child on our shoulder.", "title": "Great location, great service", "user": "drb0919", "date": "August 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138161384}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "The room was outdated and dingy. It was rather large with a wet bar area, 2 floor to ceiling windows. Plenty of room except the tiny bathroom. We were on the Hilton Honors floor. They brought our luggage and the roll aways. The beds were like sleeping on concrete. Pillows and linens were fine. Room was clean, some stains on the furniture. The time we were there we were in and out of our room over 20 times, amazingly we barely even saw another guest, not sure how the hotel was booked full.", "title": "Well equipped but small rooms", "user": "UWJJ", "date": "August 23, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 138160477}, {"rating": 2.0, "title": "Conjures Images of \"The Shining\"", "text": "The hotel is neat inside and about one block from Millennium Park. Nice area. The bellman and doorman were wonderful along with the valets. It was $62 for valet for one day but with a two year old we don't mind. We were in and out with the car at least 10 times. We expect to pay that much for valet and we need it. The Hyatt Regency is only $25 a night and you can come in and out as many times as you want also.", "user": "A TripAdvisor user", "date": "August 23, 2012", "id": 138151207}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Did not eat or drink there or use anything else in the hotel besides our room. Next time I book for the city on Priceline I will choose the next area North so as to not get this hotel again. It is a shame, if they would just treat everyone the same this hotel would have been great. Still shocked that you could smoke in a hotel today. They allow pets, but I would never let my dog sleep on a carpet doused in smoke.", "title": "What a lovely place!", "user": "DeeBelle", "date": "August 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 138128514}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "My wife and I stayed just two wonderful nites on the 11th. and 12th. of September. We will be doing this for the balance of our married life. Thanks Palmer House for an outstanding experience.", "title": "45th. wedding anniversary", "user": "theonlyone54", "date": "December 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90257677}, {"rating": 2.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "I reviewed the Palmer House in Dec 2009. Sorry to report that my opinion has now been downgraded. There is no \"service\" in this hotel whatsoever. The front desk was condescending and did not care one bit about my promised upgrade. No bell staff. No concierge, just a vacant desk with some brochures scattered on it. Internet is now $20/day. My room was so forlorn, with furnishings right out of the 1970s or 1980s, worn carpet, DIRTY towel, hair in the tub, no amenities whatsoever, not even a coffee pot, and the same tired TV channel offerings. Workers were picketing over union affairs at all three entrances and banging trash can lids and hubcaps together - all night. Real nice touch there, Palmer House Hilton. And you did nothing about it. Last time I will stay here and I strongly suggest others stay elsewhere. Plenty of nice hotels in the vicinity. Palmer House is a tragedy these days, I'm afraid.", "title": "Shame on me for staying here yet again", "user": "Buckhead720", "date": "December 19, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 5.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 90229547}, {"rating": 4.0, "stay_parameters": "Stayed December 2010", "text": "By the am the hotel upgraded us to the executive level but our 3 rd room for a two night stay. If you do stay here it is worth the money to either get the bigger rooms or the executive floors... I will also add I so irritated in the am do to repacking twice and getting to sleep at 1 am, the staff at the lockwood restaurant did not flinch at poor disposition and the excellent food renewed my attitude", "title": "Never again!!! Part 2", "user": "Momof5part2", "date": "December 18, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 90161123}, {"rating": 2.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "I was recently in Chi. for 2 weeks to attend some Gov't training. The Hilton-Palmer House is a very historic building, originally built in 1871 and rebuilt after the Chicago fire of the same year in 1875. There were additions in the 1920’s. So, while the hotel lobby is extremely palatial (reminded me of the main room in Grand Central Sta.), the hotel room I had left LOTS to be desired. As a Hilton Honors member, I called a few days before arriving to ensure that a fridge, microwave, and coffee maker were part of the room amenities. I was assured that they were. Unfortunately, upon arriving in my room, nothing I was promised was there. The Hotel said that they would provide these amenities; however, there would be a daily charge for them. After arguing with the desk clerk that a Hilton hotel ought to have such items, the hotel DID finally comp. me for these amenities, however, there was not a lot of space in my hotel room for them. The king bed and side desk took up almost the entire space. And, the bathroom, as others have complained, had no shelf, other than what little space was on the counter where the modern bowl sink was. For anyone with lots of toiletries, you were out of luck for shelf space. The clothes closet reminded me of my parents 1900’s built house with small 3’X5’ closets, again VERY small space. And the room thermometer apparently worked when it wanted to. When I arrived, the room temperature was 72 degrees and the thermostat set to 65 degrees. In order for room temperature to be reduced, I had to open the window, wide, so that the room temperature was more closely related to the thermostat setting. I had latter set the thermostat to 60 degrees to reduce the heat in the room. It didn’t work. Heck of a way to heat/cool the room. The only chair in the room was a desk chair. Spending two weeks in this hotel, it would have been much more comfortable to have some sort of upholstered chair with an ottoman. Course; there was no space for a chair like that in this room either. My Gov’t laptop has so much security on it, it would not work in my hotel room. However, if I had wanted to use a computer in my room, the charge would have been $15/day. This really highlights this hotel, they charged for EVERYTHING. If I was spending my own money, I would have stayed at some other hotel, this is an embarrassment for the Hilton chain of hotels. Staying in this hotel for two weeks was a hardship and not comfortable.", "title": "Palatial Lobby, Tiny Rooms", "user": "Govt_Traveler52", "date": "December 18, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 90158681}, {"rating": 2.0, "stay_parameters": "Stayed December 2010", "text": "Understand that the last bit of service ends when you get on the elevator in the beautiful lobby. Not a single extension is answered, even concierge and room service go to voice mail. I love old hotels and even the rooms, but these rooms are oddly cramped with furniture and very bad fixtures and lighting. Towels are old and rough, soaps and amenities are Walgreens brand - no minibar, or fridge. Room service deplorable. Housekeeping staff very friendly, front desk condescending and rude. Will never stay at this hotel again.", "title": "Don't bother! This is the worst Hilton in their group.", "user": "Tishfish", "date": "December 16, 2010", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 90026518}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "I stayed at the Palmer House Hilton Jan 13 and Jan 14. It was the best location for food and shopping, but it was so \"ritzy\" that our children couldn't walk arround in their jammies or run in the halls and play. Then we were put on the 16th floor! (as we all know, a fire latter doesn't reach 16 floors!) Our room was avarage it had rust arround the bathroom door, but the room was pretty big. Instead of Mr.Hilton donating his money to charity, he should make sure his hotels are up to par! Although the hotel was very interesting, it was 25.00 for 2 eggs,bacon and toast. If your planning on eating, there is a great little place about a block away called BP's Pub (i think) It's cheap and VERY good.", "title": "Big, Nice hotel, but not for children", "user": "Stay_cv", "date": "January 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 12813538, "likes": {"liked": "— the location", "disliked": "— the pool was little"}}, {"rating": 5.0, "title": "Beautiful and Historic", "text": "This was in a great location right in Downtown and within blocks to a couple different train lines. I was attending a wedding, so the whole wedding party and most guests also stayed here. The lobby was very classy yet comfortable. There were many couches, chairs, and tables, where we were able to convene as large groups and hang out for long periods of time without feeling unwelcome or watched. The room was very large for 2 queens, and 2 bathrooms, which was perfect for my husband and I to share the room with 2 others (4 total) without feeling cramped. It was the only way we'd be able to afford it, otherwise, the price was double what we'd usually pay for a room ($230/night). Everything was of course clean, and the staff was courteous. We didn't get a wedding group champaign gift for the room however, because we booked with expedia, instead of calling in our reservations and paying the wedding party rate- so I thought that was a bit stingy because they knew we were with the wedding group.", "user": "occasionaltravels", "date": "January 7, 2008", "id": 12413144}, {"rating": 5.0, "title": "I Have ALWAYS Enjoyed my Stay at the Historic Palmer House!", "text": "I attended several conferences at the Palmer House and I stayed there each time. The Palmer House is absolutely beautiful! It has a rich, classic, luxurous appeal.", "helpfulness": 3, "user": "Maxxy0000", "date": "January 4, 2008", "id": 12322568}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Over the years, each time I have never had a complaint about the hotel", "title": "Great Stay", "helpfulness": 2, "user": "raedrenn", "date": "January 2, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 12263472, "likes": {"liked": "— Character", "disliked": "— Busy"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "or services. The rooms are very nice and comfortable. This is the type", "title": "Great Location", "helpfulness": 3, "user": "Trvlhopper", "date": "January 2, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12258524}], "location": {"country": "United States", "city": "Chicago"}, "stars": 4, "variance": {"poor": 312, "average": 626, "very good": 1396, "terrible": 161, "excellent": 1372}, "aka": "The Palmer House Hilton Hotel Chicago", "slim_ranking": 0.487951807229, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "North America’s most established hotel, the Palmer House Hilton first opened its doors in 1871 and has remained the place to \"see and be seen\" in downtown Chicago. We continue evolving to serve you with the latest conveniences and comforts in meetings, accommodations and dining - a hip and historic blend of modern nuances and Chicago cultural significance. Whether you’re holding a gala in the famed Empire Room or an intimate gathering in one of our hospitality suites, your event is sure to be a success. Here, you’ll be the host in the Chicago hotel that’s been the venue of choice for celebrities, politicians, and royalty for more than a century.When you come to the Palmer House Hilton, you don’t just stay here. You live here—even if it’s only for a night. That’s why all of our guest rooms and suites have just the right touches to make you feel right at home. You’ll sleep well on our Hilton Serenity Dream bed featuring a plush top mattress and crisp linens, lathering up with Peter Thomas Roth bath products, perceptual service and a full host of amenities to keeping you connected – from flat screen HD televisions, wired and wireless high-speed internet to alarm clocks with auxiliary ports, you’ll find everything you need to rest easy. Lockwood Restaurant, your Farm to Fork, AAA 4 Diamond destination open for breakfast, lunch and dinner as well as afternoon tea. The Lobby Bar at Lockwood is a favorite for locals and travelers alike for craft beers and craft cocktails with Palmer House private reserves and labels. Potter’s is the hip spot to enjoy a retro mix of perfectly poured libations and delectable light fare while reminiscing about the hotel’s history. The hotel is walking distance to the Blue Line and the Orange Line “L” stations for quick transport to O’Hare International Airport and Midway Airport, respectively. The Palmer House Hilton is steps to all the action along State Street including Macy’s, Nordstrom Rack, American Apparel, H&M, Block 37 Mall and the Chicago Theatre. The hotel is also a short walk to The Art Institute, Joffrey Ballet, Cadillac Theatre, Jeweler’s Row, Millennium Park, John G. Shedd Aquarium, Field Museum and Adler Planetarium."}