{"user_rating": 4.5, "review_count": 744, "name": "The Hotel Roanoke & Conference Center, a Doubletree by Hilton Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Our reservation was for just one night - a Saturday. When we arrived about 3:00, our room wasn't ready so they gave us a bigger room that was clean at no extra charge. Wonderful location right in the downtown area. Sunday morning buffet breakfast had a wonderful choice of food. On Saturday night there was an enjoyable combo playing dance music in the main dining room.", "title": "Lovely overnight stay", "user": "Jean S", "date": "May 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 160118436}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Spent a couple of nights at the Hotel Roanoke while working on a project. The hotel is nicely appointed, decent sized rooms, light & open feeling. Easy walking distances to local restaurants, bars there is a restaurant attached to the hotel. Bell service was fine and the staff is friendly and helpful.", "title": "Good Location and interesting rennovation.", "user": "Thomas S", "date": "May 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 160070542}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "We celebrated my parent's 50th Anniversary with a weekend at the Hotel Roanoke. I cannot believe how great this visit was for my family! We had 4 rooms booked, dinner in the Regency Room, and breakfast the next day. It was PERFECT!! They got us into our rooms EARLY, upgraded my parents to a suite for their special occasion, and did a FANTASTIC job taking care of us all. The dinner in the Regency Room was delicious and flawless, which is quite an accomplishment when feeding a family of 17. We took advantage of the hot tub in the cool, spring weather, as well as enjoyed being able to easily walk into and out of downtown Roanoke. Absolutely no hesitation giving this hotel the highest marks possible! It wasn't my first stay there, and surely won't be the last!!", "title": "Unbeatable 50th Anniversary", "user": "Joshua L", "date": "May 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160671889}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Overpriced - not clean - treated poorly. If you have money to burn and want to look like your something special, stay at the Roanoke Hotel. If not, there are plenty of other options in this beautiful valley!", "title": "Won't stay there again!", "helpfulness": 1, "user": "Kristin &Jim S", "date": "May 8, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 160670765}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "As appearances go, this hotel was definitely impressive. The decor and furnishings in the lobby and common areas were beautiful and inviting. Our guest room, however, could have been cleaner. Strands of hair from prior guests clung to our clothing and shoes, which I think is a sign of poor housekeeping. Overall, though, our stay was not horrible, but not the best either.", "title": "Nice lobby, unimpressive rooms", "user": "Tabrica R", "date": "May 6, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 160667164}, {"rating": 4.0, "title": "Classy Grand Dame", "text": "The Hotel Roanoke harkens back to the late 1800's but is now a modern accomodation which maintains its classic roots. The rooms are large and typical of the Hilton chain to which they belong. The attached conference center is convienent and a short walk takes you to old downtown Roanoke with its quaint shops, street market and restaurants. I stayed for a conference and the rates were reasonable. A good choice whenever visiting the area.", "user": "A P", "date": "May 19, 2013", "id": 161178895}, {"rating": 4.0, "title": "Classy Historic Hotel in Roanoke", "text": "This hotel was a surprise to me, as it is a historic hotel (Hotel Roanoke). I was expecting a typical DoubleTree hotel, but it seems that the historic nature of this hotel has been maintained, and is just managed by the DoubleTree by Hilton. The hotel looked like a castle inside and out, and bits of history were littered around the hotel (such as pictures with blurbs about happenings in Roanoke in the early 1900s.) The valet staff were neatly dressed, with their valet caps and shorts, and they were prompt and courteous. This hotel looks like it has a lot of space to move about, as it has a large lobby waiting area with ample, plush seating.", "user": "missjae15", "date": "May 19, 2013", "id": 161166250}, {"rating": 5.0, "title": "Family trip for VT graduation", "text": "They have a pool - unfortunately it was not open when I stayed, as it got to be 90 degrees a few of the days. They have a fair sized gym with modern equipment to get a workout in between meetings and meals.", "user": "sue13_1", "date": "May 18, 2013", "id": 161111647}, {"rating": 5.0, "title": "Wonderful landmark hotel", "text": "This hotel is in an excellent location, as it is across the street from the downtown Roanoke area, where you can walk across a bridge and have a meal or be entertained in their over a dozen eateries - very convenient.", "user": "dogwalkerNorfolk", "date": "May 17, 2013", "id": 161021388}, {"rating": 5.0, "title": "Get off the highway and stay here", "text": "Another plus is that this hotel provides a complimentary airport shuttle that starts running at 5:15am, for those who have very early morning flights (as I did.) Big plus if you don't want to call a taxi or wake someone up to take you to the airport.", "user": "Ann34618", "date": "May 17, 2013", "id": 160962105}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "The common areas of this property are beautiful and very rich in history. One actually feels like you have stepped back to 1882. The restaurant is a bit pricey but very good, as is the Pine Pub. Spa services are overpriced. My infatuation ended when I tried to settle into my room. I am a Hilton diamond member, and Hilton has been very good to me. First, my room was down one floor, although it is ground level, it felt like the basement. No upgrade, no robe, no working coffee pot, and a tub that would not hold water, the clock was one hour ahead, which had me up at 3:00 in the AM, instead of my desired 4:00 that I intended. One of those goofy clocks that an engineer has to fix (can set the alarm, but not the time without a key). The room was very small and the bed did not seem Hilton quality, as someone else mentioned. I also agree that the food in the \"Executive Lounge\" was very very sparse, and did not open until 6:30 for coffee. No place to get a cup of coffee before 6:30 as a matter of fact. I am glad I booked there, the staff was quick to fix my room problems, yet never offered to move me (I was there all week), nor did they offer to comp me a drink in the bar or anything....", "title": "Common Areas are Beautiful", "helpfulness": 1, "user": "daisy20071960", "date": "May 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 161895550}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "This is a great hotel with an interesting history. Because it is old, the rooms are small, but very well appointed. Staff were friendly, and all needs were met. Best part was the location - right next to the market square with tons of restaurants. Self-parking $7, valet $12.", "title": "Great Night in Roanoke", "user": "NicoleS0907", "date": "May 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161802094}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "My mom and I stayed at the Hotel Roanoke for a small one night getaway in April. We had a fantastic time overall. Downtown Roanoke has great restaurants and shops in walking distance from this hotel that make for a great stay.", "title": "Great mother-daughter stay.", "user": "Melanie L", "date": "May 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161589871}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The hotel is grand, interesting and beautiful--so much more fun than staying at a run-of-the-mill property. We spend lots of time exploring, and I feel like I took over 50 pictures as we walked throughout the hotel. There was a wedding going on which looked absolutely beautiful.", "title": "Good but not great", "helpfulness": 1, "user": "JRDamare", "date": "May 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 161484580}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Our two double-bed room wasn't ready when we arrived (we got their hours early) but they offered to put us in a king room which was fine for us. The room was spotless, and decorated well just like the rest of the hotel. Bathroom was super clean with great products. Bedding was very comfortable.", "title": "What a difference a year makes!", "user": "Anlycoar", "date": "May 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161192496}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "My husband and I stayed overnight at this fabulous hotel last week and I have to say it was one of the nicest hotels on our 2 week trip! We love the renovations they've done in the years since we stayed there last. The view was lovely, the room was nicely appointed and large enough for a very comfortable stay. Service was wonderful. You must eat in the Regency Room! True southern style cooking with a lovely lunch buffet and the most wonderful crab cakes ever!! And be sure to order Bananas Foster, done table side for dessert! This was a lovely stay and we will be back.", "title": "Fabulous Stay", "user": "totallymalinda", "date": "May 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 160835953}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Had wrong room at check in at first. Dirty wash cloth in floor. Staff took care of getting us right room. Rooms are not that nice for price. Long walk to rooms and parking is way off, requires valet not to go on a hike. AC unit really loud. Hair dryer was sticky/nasty Most of staff were great, hard working. very convenient to downtown Roanoke.", "title": "not worth the money in Roanoke va", "helpfulness": 1, "user": "Cindy C", "date": "May 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 161290463}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We were in town for a wedding. Hotel is pretty and the rooms are clean and reasonably sized. Prices are on par with Cleveland/Pittsburgh which was a bit surprising. Beds were comfortable and the room clean. If guests are in the hall talking or futzing around noise is somewhat amplified. EXTREMELY convenient to downtown Roanoke (just across a foot bridge).", "title": "Solid Hotel", "user": "Brian G", "date": "May 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 160678889}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "I was less than impressed with the check-in process. We arrived after driving 10 hours through the mountains. We walked in and were directed to the front desk. We waited around for quite some time without any service. There was a Hilton Rewards line, but there was no one available to check in other guests. Frustrated and tired, we walked out to our car and called Hilton to make the reservation and check in. When we finally reached the front desk (from the parking lot), we received average service. The employee we spoke with apologized and when we went back into the hotel, she offered us an Executive Level breakfast pass (breakfast the next morning was coffee, some fruit, and what looked like trays that used to be filled with pastries, although there were none left when we arrived, in a very small room with no seating available).", "title": "Beautiful, clean hotel with so-so service", "helpfulness": 1, "user": "Abbey3445", "date": "May 11, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 160409082}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "After our check in problems, the stay was great. The hotel is beautiful and very clean. We ate at the pub and it was excellent. We were highly impressed by the room and the view.", "title": "Beautiful Historic Hotel but Housekeeping is lacking", "helpfulness": 2, "user": "C H L", "date": "May 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 160220989}], "location": {"country": "United States", "city": "Roanoke"}, "stars": 4, "variance": {"poor": 38, "average": 63, "very good": 232, "terrible": 14, "excellent": 397}, "aka": "The Hotel Roanoke And Conference Center, a Doubletree By Hilton Hotel", "slim_ranking": 0.027027027027, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Built in 1882, the fully-restored Tudor-style Hotel Roanoke is proudly listed on the National Register of Historic Places. As a member of IACC (International Association of Conference Centers), Hotel Roanoke is pleased to offer world-class lodging facilities, including newly renovated guest rooms and 63,000 square feet of state-of-the-art conference space. The hotel's business facilities include 35 meeting rooms, a fixed-seat lecture hall, two boardrooms, conference center lounge and an elegant hotel ballroom which can accommodate up to 1,400 guests."}