{"user_rating": 5.0, "review_count": 200, "name": "The 1750 Inn at Sandwich Center", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "My boyfriend and I just spent a weekend at the Inn, and I highly recommend it. The Inn is a lovely old home and our room was pretty and spotless. The innkeepers, Jan and Charlie, are very warm and helpful--and they put out a slamming breakfast both days of our stay. Other nice touches include chocolate chip cookies, cognac at night, free soft drinks and bottled water all day. Sandwich is peaceful and quaint--do take a walk down the \"boardwalk\" to the beach. One note: don't bother with the nearby Belfry Inn Bistro--it's overpriced and pretentious.", "title": "A Very Hospitable Inn", "helpfulness": 2, "user": "linda528", "date": "June 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5336228}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "My husband and I spent 3 nights at this Inn. If only every where you stayed you had this excellent hospitality. Room was lovely as was the rest of the house. Very charming. Breakfast was excellent, freshly prepared by Jan each morning - a very healthy start to the day. Jan and Charlie who ran the Inn couldnt have been more helpful. I would recommend a stay here for anyone looking for a quiet get away.", "title": "Excellent, loved it.", "helpfulness": 3, "user": "claireuk", "date": "October 2, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3983516}, {"rating": 5.0, "title": "very romantic and great hospitality", "text": "I stayed at the Inn for 2 nights with my family. The rooms are all decorated with exquisite taste and the owners, Jan and Charlie, are just super accommodating! They were always so eager to help and recommend places to go/resturants to dine around the area. The breakfast Jan made was also fantastic! The food was light, made with local products, but extremely delicious! We will definitely go back again and again!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "June 23, 2004", "id": 2218533}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 0, "average": 0, "very good": 12, "terrible": 1, "excellent": 187}, "slim_ranking": 0.1, "description": "Romantic, Historic B&B located in the heart Sandwich, Cape Cod's oldest and most quaint seaside village. Come enjoy fireplaces, TV, hot tub, spa services, hearty & delicious breakfasts, great service, and many other amenities provided in a warm and inviting environment. Walk to the beach, fine dining, shops, & museums. Easy to daytrip to Nantucket & Martha's Vineyard. Sandwich: a year-round destination."}