{"user_rating": 4.5, "review_count": 27, "name": "The Heritage Inns", "reviews": [{"rating": 5.0, "title": "Beautiful - Exceeds Expectations!", "text": "I have travelled the world, and stayed at 5 star resorts from Zurich to Waikiki Beach. My fiance and I stayed here from 4/13 to 4/16. We stayed in the Magnolia North suite which was 2 very large rooms, one with a fireplace, sitting area furnished with beautiful antiques, and wall to wall windows, and the bedroom which had a beautiful hand-carved four poster bed, more fabulous antiques, and 2 person jacuzzi in a separate bath. This is a very clean, tastefully furnished B&B. We opted for breakfast each morning in our room. Breakfast was well prepared and delicious, including their signature chocolate muffins, omlettes, waffles, and crepes. We asked for, and received, very strong coffee each morning. Our last night we had hoped to dine at Guiseppes (the Italian restaurant located on the first floor of Magnolia House), but they closed early that evening. We were very dissapointed, but the restaurant host (manager?) was very apologetic, and did allow us to purchase a wonderful bottle of cabernet which we enjoyed on our balcony. We have family in Denton, and regret not finding this treasure sooner! We will definitely be back to enjoy the Heritage Inns. Thank you John & Donna!", "helpfulness": 2, "user": "ilona06", "date": "April 17, 2006", "id": 4981993}, {"rating": 5.0, "title": "Loved the Heritage Inn", "text": "My wife and I have stayed at the Heritage Inn B & B every year for the past 5 or 6 years at least 1 weekend per year. I have the highest regard for the Inn. We have stayed in most of the rooms and have had a wonderful time in each. No problems at all with the jacuzzi and plenty of hot water, comfortable beds and very romantic stays. The Breakfasts have been wonderful. Donna and John have always gone out of their way to make us feel comfortable. We will continue to stay there at our annual trips to JazzFest.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "December 23, 2004", "id": 2921374}, {"rating": 1.0, "title": "Food is good - that's about it!", "text": "I recomend the heritage inn cluster to anyone staying in Denton.", "user": "A TripAdvisor user", "date": "February 9, 2004", "id": 1639515}], "location": {"country": "United States", "city": "Denton"}, "stars": 2.5, "variance": {"poor": 0, "average": 1, "very good": 8, "terrible": 2, "excellent": 16}, "slim_ranking": 1.0}