{"user_rating": 4.5, "review_count": 853, "name": "The Regent Palms", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "My wife and I have just returned from our honeymoon at the Palms (July 18-25, 2006). We had an incredible time. After reading numerous reviews on trip advisor about various resorts in TCI (some favorable, some not), I was very nervous about booking my honeymoon at the Palms. My wife and I were thrilled with our choice. The rooms were beautiful, cleaned twice a day by very friendly and courteous staff, and enormous! We had a \"garden view\" room, which faced other buildings of the resort as well as the rear of the resort's restaurant, Parallel 23. Although we could have upgraded the room for an ocean view or ocean front, we chose not to because of the limited time we actually spent in our room. By the way, the 80+ cable channels (espn, food, cartoon network, oxygen, hgtv, mtv, ny-area nbc, abc, and cbs, and even two Canadian channels CTV and CBC) were great!", "title": "Wonderful Honeymoon Destination", "helpfulness": 15, "user": "rprice1014", "date": "July 26, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5515208, "likes": {"liked": "— The pool and beach access", "disliked": "— Spotty Service"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The pool is absolutely fabulous. It must be the largest, most exquisitely-designed pool on the Island. My wife and I had dinner at the Turks and Caicos Club, the Sands, and Beaches and none of their pools were even remotely compared. The pool attendants were wonderful, laying out 2 towels per sun lounger, with one rolled up as a head rest. The attendants even came into the pool to serve us!", "title": "A Wonderful Anniversary spent at a Wonder Resort", "helpfulness": 15, "user": "Landrover2", "date": "July 26, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5513236, "likes": {"liked": "— Can't name just 1 thing. The resort itself, the rooms, the beach", "disliked": "— N/A"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "The Spa is out of this world! I had the complimentry hot-stone massage, which I HIGHLY recommend.", "title": "Beautiful hotel with a few kinks to iron out", "helpfulness": 14, "user": "Kiwic01", "date": "July 26, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 5513031, "likes": {"liked": "— The rooms", "disliked": "— kids are allowed"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "I concur with everyone regarding the too-high prices for too-average meals. For a not-so-expensive, but very tasty lunch spot, please try the \"Conch Shack.\" It's about fifteen to twenty minutes from the hotel, but you won't spend more than twenty bucks (per person) and they have some great local fare.", "title": "Relaxation and Beauty!", "helpfulness": 18, "user": "downjr", "date": "July 23, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5499671}, {"rating": 4.0, "title": "The Palms Is A Great Place to Relax", "text": "The service, for the most part, was terrific. There were a few instances in which I had to repeatedly make requests before I would be provided whatever service I needed, but that I didn't happen very often. Again, I found the service to be overall great.", "helpfulness": 16, "user": "A TripAdvisor user", "date": "July 15, 2006", "id": 5468596}, {"rating": 5.0, "title": "What a gem!", "text": "We stayed here July 4 weekend. What a beach what a hotel. I loved this place. The infinity pool is the best Ive ever seen. So comfortable , quiet, peaceful. We met couples , singles, its such a great get it while its hot place, I think. The sand and water of this island is bar none. I have not found anywhere where the water is this blue and the sand this white, and not one rock, seaweed, dirt or trash is ever on the beach or in the water, gotta love that !! 20 yrs from now it will not be, I can assure you , was there in 97 , wow has it grown. The people are very nice here. Very peaceful, simple, serene. Also hear Parrot Cay if you can afford it is paradise, but so is this 5 star hotel!! Congrats to the Palms, service at its best!", "helpfulness": 16, "user": "30000ft", "date": "August 1, 2006", "id": 5538345}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "My wife and I just returned home from the Palms where we celebrated our 4 year anniversary on Provo. Before arriving on this island, I poured over reviews from previous travelers so I could get an idea what we could expect from our trip. I am here to set the record straight. There were many travelers who compared the Palms to the Four Seasons, saying that the property and the service at the Palms was on par with that of the Four Seasons. Let me illustrate my feeling on this comparison with the use of a metaphor. (Understanding that I spent my honeymoon at a Four Seasons Resort) Usually, when the circus comes to your area, they set up a large tent and put on a nice show, with some cool animals, good popcorn, a daring trapeze/high wire act and funny clowns. They also have those cute little games of skill where you can win a nice prize for your significant other. It really is a nice place to take the kiddies and all in all, a fun day! Now, i don't know if you are aware, but there is another circus that exists. They don't come to you and set up under a tent. You go to see them! Perhaps you have heard of \"Cirque du Soleil.\" If you have ever seen them, the word that comes to mind is \"WOW!!!\" The experience is flawless, the organization is flawless, the acts are flawless and the costumes are flawless. A performance by Cirque du Soleil leaves nothing to chance. Every portion of the performance from start to finish runs like a well-oiled machine!!! I hope you are beginning to see my point. Be careful about visiting a Four Seasons Resort early in your traveling career and then following the experience staying elsewhere. Doing so is like seeing Cirque du Soleil's \"O\" at the Bellagio in Las Vegas and then returning home and seeing your local circus under the Big Tent in the parking lot of your local mall. Now that I have set the stage (no pun intended), let me tell you about the Palms. As a member of \"Small Luxury Hotels of the World,\" the Palms is expected to provide its clientele with beautiful rooms, world class amenities, excellent dining and top-notch service. Remember that people are paying heavy duty $$$$ to stay at the Palms. Let's begin with the rooms. Note: I'm not going to spend time talking about Provo itself because i really want to focus this review on the property itself. Suffice to say, Provo itself, unlike the Spa at the Palms, is not exactly a well-manicured area. Here is my recommendation - when you arrive at the airport, ask the driver of your shuttle for a blindfold and keep it on until you arrive at the Palms. This will help you avoid having to see \"what I saw\" on my way from the airport to the Palms! That being said, the Palms \"is\" a beautiful resort. It is well landscaped and visually quite impressive. Upon our arrival, we were met with drinks and escorted around the property for our personal tour. Let me pause here for a moment. Up to this point of our trip, the Palms and the Four Seasons were consistent. I was impressed and couldn't wait to see our room. We had heard how beautiful the rooms at the Palms were. To make a long story short, we were very disappointed with this particular room. The blinds were broken, the keys didn't work and the room was not clean. The elevator on the way up to the 4th floor where our room was located made a noise which actually sounded dangerous. After seeing the look on my wife's face, I immediately wasted no time and went to the front desk and asked for whoever was in charge to accompany me \"on my own personal tour of our experience.\" I had this staff member accompany me up the elevator and into my room to witness exactly what we had witnessed. Upon asking to have our room switched figuring this room to be an aberration, this staff member was cooperative and understood our plight. We were told to have some food and drinks \"on them\" at the pool bar \"Plunge\" and a room would be prepared for us. The food that we had at Plunge was quite good(shrimp lettuce wraps and a Margarita Pizza). 4 hours later (i kid you not), no-one came to get us from the pool area so we went back to the reception area where we were told that our room was ready. I wanted to thank the staff member for helping us with our room change, however we were told that she had already left for the evening. As it turned out, the Palms came through. I have been told that good things come to those who wait (and wait we did). We were upgraded to an ocean-view penthouse room. They realized that we had been inconvenienced and quite frankly, did the right thing! If this upgrade did not occur, i think it would have really affected our trip. (Actually, i know it would have affected our trip - Provo is not known for its nightlife and we would be spending ample time in our room throughout the week.) The penthouse room was really beautiful. It had a large outdoor terrace with an outdoor bed and a gorgeous view of the water. The bed inside the room was very comfortable. Again, on par with the Four Seasons who i have always felt had the most comfortable bed in the industry after sleeping in one during my honeymoon. As far as rooms go, the only room we have ever stayed in that was nicer (and cleaner) than the room at the Palms was at the Four Seasons. I really think that the first room we were brought to was just a fluke. However, that fluke ended up getting my wife and I into a Penthouse Oceanview room. People have complained that the staff was weak when it came to providing extra lotions, shampoo, conditioner, etc. We had no such problem and never lacked for any products we actually asked for. If you want or need something, just ask for it and you will get it. If you don't ask for something, don't be surprised when it doesn't arrive. (The only resort where staff is able to read your mind and deliver things to your room which you need but haven't asked for yet, is the Four Seasons.) Enough about the rooms, let's talk amenities. The pool at the Palms is impressive. It looked impressive in the pictures and it is even more impressive in real life. For 1.8 million dollars, it should be!!! That being said, my wife and I were disappointed that the jacuzzi didn't get hot. We were told that the boiler was broken. During our stay, a tropical storm came through and cooled Provo off for two days. A hot tub would have been the perfect remedy but the thing wouldn't get hot. As far as those pods are concerned, we got on one for 1 day. That was enough. No big deal. The lounge chairs are very comfortable. Service at the pool area is really where the Four Seasons seperates itself from this or any other property. To compare the Palms pool service with the Four Seasons pool service is like comparing a club golfer to Tiger Woods. In time, perhaps the management team at the Palms will train their staff appropriately, however currently, systems are not in place to the degree that they could or should be for a property such as the Palms. The fault lies with management; not individual staff members who don't have the guidance or the experience to make such decisions. If there was 1 thing that the pool staff lacked, it was leadership! They just stood around not really knowing what to do. They were all nice people who tried to serve but lacked the proper direction to really make the pool experience spectacular for their guests. I think this can and hopefully will be remedied in time. This is a good time to talk about the Spa at the Palms. My wife and I had 4 treatments each during our 8 day stay at the Palms. The spa was fantastic. I thought the spa at the Palms was superior to the spa at the Four Seasons (my wife agrees). It actually seems like the spa and the resort are run by two different management teams. The spa is organized, clean and efficient to a degree that the resort never lives up to. The services are pricey but you get what you pay for. I was nervous about its location being close to the road, as others have said that the sound of cars driving by interfered with their treatments. We had no such complaint. The therapists were professional and very skilled. (I happen to own a wellness center and would hire any one of them any day of the week and twice on Sunday) The spa treatments were the highlight of our trip - hands down!!! As far as the beach is concerned, what can I say - Grace Bay is a beauty. No doubt about it! The beach service seemed better than the pool service. The attendants seemed friendlier and more organized. Perhaps it is because they get to look at that beautiful water. It's a good time to note that the complimentary, unlimited bottles of water was a first for me. I have never experienced that before (the Four Seasons didn't offer it). I thought that was a really nice thing to offer, especially considering how powerful the sun is during the summer season. As far as the food is concerned, we never did make it to the IGA. My wife wanted to stay away from the \"town\" at all costs so we just filled up on the complimentary breakfast and went out for an early dinner every night. That plan worked until we went to Hemingways on the Beach for a quick lunch. (more on that later) The restaurants we ate at included Magnolia, Anacaona, Grace's Cottage, Baci, and Coco Bistro. Note: remember, our first night at the resort, we had dinner \"on the Palms\" at Plunge because of our room issue. The food at Plunge is very good but be prepared to pay $18 for a burger. It's just that simple!!! Our favorite restaurant was Coco Bistro. The others were good, but not great! Be prepared to spend some $$$ if you choose to frequent these restaurants. (Baci was the most reasonable) The best drink I had on the island was a mango martini at Coco Bistro. It was far and away head and shoulders above the rest. I had 5 or 6 of them over the course of 2 days, as we ate at Coco Bistro back to back evenings. I was disappointed in the food at Anacaona but the ambiance is beautiful. The food at Grace's Cottage is good, the service is excellent but be prepared to pay for it!!! Magnolia was just good, not great as I expected it to be. I had heard that the sunset from this restaurant was amazing, but it actually was nothing with nothing! Baci had good food but their freshly baked garlic bread left much to be desired. The owner was not very friendly toward us because our concierge apparently forgot to make our reservation. If we didn't spend $$$ for a cab to get there, we might have actually left the restaurant, however, the food ended up being pretty good so we were glad we stayed. Coco Bistro had the best food, the best service and the best drinks. What else can I say!!! Did I mention those mango martini's!!! Finally, i need to give a shout out to Hemingways on the Beach. The Grouper Tacos at Hemingways are fantastic! If you visit Provo and do not get the Grouper Tacos at Hemingways, you would be making a major culinary mistake. Trust me on this one. The best $10 you will spend while on this island is on those Grouper Tacos! They really are delicious! Our original plan was to fill up on the complimentary breakfast and skip lunch. Hemingways Grouper Tacos crushed that idea. We ended up there for lunch 3 or 4 times over the course of our 8 day stay. My wife is telling me it's time to go to sleep, as I have been typing for quite some time. The truth is, I appreciated reading some of the reviews on trip advisor before my trip. It gave me good insight as to what could be expected from Provo and the Palms. I feel like it is my duty to pass along information from our trip as a way to \"pay it forward.\" I think this is an invaluable service. If you are someone who is looking to get away, stay in a nice place, enjoy a beautiful beach, visit a fantastic spa and are willing to pay $$$$ to eat out every night, then this is the place for you. By the way, we never did eat dinner at Parallel 23. I just couldn't find it within myself to spend $200 for dinner at the same place that we had a complimentary breakfast every morning!!! I was told the food was good but pricey with a capital \"P.\" If you are looking to be pampered with world class service, you will be sorely disappointed if you choose to stay at the Palms. You would be wise to invest some time in locating a Four Seasons Resort (or Ritz Carlton) if service is at the top of your list! I know that some prior reviewers said that the service at the Palms was right up there with the Ritz and the Four Seasons. Remember when I compared the club golfer with Tiger Woods earlier in my review. I do believe that on any given day, anybody can beat anybody. A club golfer could have an unbelievable round and beat Tiger through 18 holes. It could happen! But what do you think the chances of it happening twice are? Are you looking to get lucky and shoot the round of your life or do you want to go with the one who consistently day in and day out produces RESULTS!!! I think I may have underestimated just how good the service at the Four Seasons was until I stayed at the Palms. This is not to say that the service at the Palms was bad. Quite the contrary, my wife and I thoroughly enjoyed our stay at the Palms. It's just that the Four Seasons was in another league! I hope this review helps someone out there who is deciding if this is the property and the island for them. If service is not at the top of your wish list, i don't know if another property can match the Palms. Did i mention that pool and spa!!! Fabulous...", "title": "\"The Truth, the whole truth and nothing but the truth!!!", "helpfulness": 16, "user": "KO5O564", "date": "August 1, 2006", "detail_rating": {"front_desk": 2.0, "business": 5.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5535287, "likes": {"liked": "— Pool and Spa", "disliked": "— The Service / The Concierge"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "My husband and I just returned from an 8 day stay at the Palms. I will preface my review by saying we have stayed at the Four Seasons in Maui and were told this would be an equivalent experience. As others have mentioned there were certain areas where this hotel fell short. Let me start with the positives, though! The SPA -WOW! We both enjoyed 4 treatments, 3 of which were couples. I strongly recommend the mud wraps!!!!!! Ask for Rosanna, Consuela or Earl - all wonderful! Housekeeping was also excellent and we found them to be very generous with extra lotions, etc. The buffet breakfast, although offering a wide variety of foods, comes complete with TONS of flies. They should definitely consider putting covers over the foods. Flies on the cheese and bagels does make them appear less appetizing. As far as restaurants, I would not recommend eating at plunge for lunch-way overpriced. The Miami Vice is definitely a good drink though! You must go to Hemmingways ( a 5 minute beach walk) and eat the grouper soft tacos. We ate there almost daily. The service was great, freindly and the food really was fabulous. We ate at Anacaona, Magnolia, Graces Cottage - all so, so food with high prices. We LOVED Coco Bistro and ate there twice. They have the best desserts on the island, including chocolate creme brulee and fried banana and mango fritters with caramel sauce and vanilla ice cream. Baci had fair food but due to the \"unwelcoming\" greeting we received I would not recommend it or return again. As far as the pool, it is true. They ran out of towels on a daily basis. This is one area the hotel was consistent with - come early afternoon, no towels! How silly! The rooms also offer dvd players. You can borrow movies for free but don't bother. They have 4 movies available with 5 scratched copies of each. We couldn't even watch the full dvd of good will hunting. All in all we had a wonderful 8 days. The beach is awesome. We did a morning of SNUBA and loved it. Trust me, if I can snuba...so can you! It was a great experience! We also snorkeled at the hotel which was a lot of fun. Enjoy!", "title": "The Four Seasons it is not but possible on its way", "helpfulness": 23, "user": "funinthesun27", "date": "August 1, 2006", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5534970, "likes": {"liked": "— the view", "disliked": "— spotty service"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Personally speaking, the second time around to any destination is almost always a disappointment. Whether it's the food, the service or the hotel as a whole, nothing ever seems to be as perfect as it was the first time around. The Palms, however, is the exception to the rule.", "title": "Second Time and Counting...", "helpfulness": 17, "user": "rrnyc", "date": "July 31, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5531115}, {"rating": 5.0, "title": "Counting the days until we return!!!!", "text": "My boyfriend and I just returned from a 7 night/8 day trip to The Palms (July 15 to July 22) and we could not have asked for a more perfect vacation. Within moments of receiving our luggage at the airport, we were graciously greeted by a hotel staff member who helped us to the pick-up van. Charles, the driver, not only did his job with care and precision but also acted as a tour guide who showed us the \"hotspots\" and general attractions of the island.", "helpfulness": 20, "user": "moose11000", "date": "July 27, 2006", "id": 5520766}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "My wife and I just returned from our honeymoon at the Palms. We stayed from July 4-11 and had a wonderful trip. We landed and were greeted by a driver who took us to the resort. He was a very nice but we did not travel in the \"luxury escalade\" but rather a dirty van. When we were traveling to the resort I was a bit taken back by how under devolped TCI is. I mean many buildings are unfinished, the downtown area is sort of dingy looking, and there are a number of stray dogs and trash around.", "title": "Great place, a couple kinks to work out", "helpfulness": 17, "user": "DAMANDEL", "date": "July 15, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 3.0}, "id": 5468441}, {"rating": 5.0, "title": "Perfect Honeymoon Spot", "text": "However, when we drove into grace bay it was another story. You can tell this is an area dominated by high end resorts and in a couple years will be packed full of tourists and shops. Right now it is in it's infancy and we liked it like that. The resort was gorgeous driving up with palm trees swaying in the wind, bellman anxious to help, and open air lobby with marble and fancy furniture. We checked in and they gave us a nice tour of the grounds which are immuculate and then took us to our room. Now everyone has said the rooms are great and they are but since we booked through a third party travel vendor and I got us a pretty good deal we were given a garden view room with a view of the side of a building and the back of parallel 23. The inside was very nice and clean. We thought about upgrading but decided that we could live with the room because we were tired and wanted to hit the beach.", "helpfulness": 16, "user": "A TripAdvisor user", "date": "July 3, 2006", "id": 5422567}, {"rating": 3.0, "title": "Honest, Fair Review", "text": "The beach and pool are amazing and we really did'nt hit any problems except the first day where they ran out of towels. They told us because the hotel was full and that the next day they would only be at 70% and we should'nt have any problems. Odd...", "helpfulness": 17, "user": "texaschic77", "date": "July 2, 2006", "id": 5417433}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "The spa is incredible, very well serviced and great treatments. One of the best I have ever been to.", "title": "Lovely resort", "helpfulness": 16, "user": "mbenveniste", "date": "June 29, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5407702}, {"rating": 1.0, "title": "Not worth the money and time!!!", "text": "Plunge had some good food and the drinks were great. Pricey but then again everything on the island is. We were pretty disappointed in the food overall on the island. Many menus look the same and the places we ate all tried to be the next spago or ritz. All the food was really overpriced and not very good. One night we wanted to scale back from 150 dollar meals and went to the tiki hut ( which was 80 dollars with one drink each and horrible)", "helpfulness": 6, "user": "A TripAdvisor user", "date": "June 28, 2006", "id": 5406051}, {"rating": 5.0, "title": "Paradise", "text": "We stayed at the Palms on Easter Weekend. My husband, me and my two teenage daughters. we all loved it. From the personal trainers at the gym, the massage at the spa to the pool and beach. Had none of the problems others have talked about. Restaurants were good but did like Hemingways better. (Just a short walk to the right!) Snorkeling was OK down past Beaches to the left. There were always enough towels and shade canopy's on the beach. Everyone was very friendly and helpful. We left our camera on the beach, went back and it was gone. the staff was great and asked everyone till it was found! Can't wait to go back.", "helpfulness": 14, "user": "Pink8LongIsland_NY", "date": "June 27, 2006", "id": 5396333}, {"rating": 3.0, "stay_parameters": "Stayed June 2006", "text": "It’s remarkably easy to identify the pros of staying at the Palms. The oceanview suite was simply gorgeous; spacious, comfortable, tastefully decorated, two gorgeous balconies. We loved the kitchen with Wolfe stove (didn’t use it but it was a good looking stove) and refrigerator (perfect for storing cocktail necessities). The water is Discovery Channel perfect. The beach in front of the Palms wasn’t too crowded; further down, though, it turned into Cancun. The morning “continental” breakfast (included in the room price) was hardly the sweet roll and Tang you would expect, but included fresh fruit, scrambled eggs, pancakes, omelettes, potatoes. The Spa was magnificent. We had a couples massage in one of the massage cabanas overlooking the spa pool and it was life changing. I’ve never had a massage on a mini-waterbed mattress and thoroughly recommend it. And it was cool in the cabana despite the very, very hot day. And though there were some hiccups in the service (not enough towels in the room, forgot to provide soap, surly front desk people), overall it was more positive than negative.", "title": "Lots of Kiddos", "helpfulness": 10, "user": "Melanie11", "date": "June 26, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 5.0, "service": 3.0}, "id": 5392274}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "Recognizing that there is no such thing as a one size fits all vacation (in our case honeymoon) and refraining from the ubiquitous Tripadvisor posting “I’ve stayed at Ritz-Carltons and Four Seasons all over the world”, there were some substantial cons. The biggest con was that there was no separation of adult and child…anywhere. The pools, beach and even the “adults only” Jacuzzi and lounge chair area were filled with kids. No one, including staff or parents, policed the meager “adults only” areas. And, frankly, a resort of this kind should have areas where guests who want (and expect) to experience a certain ambience can. To that point, we were told on arrival that all of the pool and beach lounges were available on a first come, first serve basis and could not be reserved. Yet each morning all of the best lounges were “reserved,” with someone’s beach bag, water wings, snorkel gear, etc. At five am on the morning we left for the airport, half of the lounges had been “reserved.” Irritating. It did seem at times that the hotel was ill equipped to deal with crowds. Breakfast on the weekends was bedlam (also factoring in stroller logjam) and the beach did run out of towels on several occasions.", "title": "More pros than cons", "helpfulness": 24, "user": "Tina257", "date": "June 26, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 2.0}, "id": 5391522}, {"rating": 1.0, "title": "*SPA -----*", "text": "Overall, not a bad honeymoon. It would have been a better vacation if we had brought a couple of kids. If you can’t beat em, join em.", "helpfulness": 4, "user": "Urastar", "date": "June 26, 2006", "id": 5391124}, {"rating": 2.0, "title": "Not a 4-5 star resort", "text": "I was extremely concerned about the reviews I had read and wrote to management before our stay. I can't disagree that the service is the only thing stopping this lovely hotel from being a five-star hotel since the rooms and grounds certainly lived up to those standards. But I have to add that I think management is not only aware of the problems but working on them, and I think we may see continual improvements because of that.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "June 21, 2006", "id": 5373479}], "location": {"country": "Caribbean"}, "stars": 4.5, "variance": {"poor": 43, "average": 55, "very good": 192, "terrible": 26, "excellent": 537}, "aka": "The Regent Palms Hotel", "slim_ranking": 0.414634146341, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 5.0}}