{"user_rating": 4.5, "review_count": 107, "name": "The Kuleana Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "We stayed a week in October 2012. For a rental condo on the ocean, this place is a well kept gem! The parking was fantastic, The pool was so pretty day and night and it is all tile so you don't scrape your feet. The room was dark when I first walked in but once you open the curtains and turn on the fans relaxation settles in.. I found no need for air conditioning. My husband and I slept on the living room Murphy bed and enjoyed the moonlight views to the ocean waves crashing 50 feet away.. We stored all our gear in the bedroom. The front desk was helpful when we needed help due to a wet phone .. Just remember this is a do it yourself condo , if you want to be waited on, choose a hotel resort.. I will definitely stay here again", "title": "LOVELY PLACE", "helpfulness": 4, "user": "Jessica L", "date": "November 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 145103658}, {"rating": 4.0, "title": "Our current favorite!", "text": "We are regulars to Maui for 20 years now and for the past few visits we stayed at Kuleana. Beautiful grounds right on the beach, big pool, snorkeling is good with many turtles each morning and plenty nearby to see & do. I would recommend you look at the units on their site. Air conditioning is important to us and not all units have it. There are some dated units and some that have been remodeled. You can't find a better deal for this ideal location on Maui. As I write I'm looking at a gorgeous view and listening to the waves - total relaxation! Maui was just voted best island in the world for the 17th year in a row!", "helpfulness": 9, "user": "debinmonterey", "date": "October 25, 2012", "id": 143704731}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Tired of large resorts, then this condo is for you. From it's lanai there are incredible views of the ocean, sunsets, Lana'i, Moloka'i, the beautiful, tropical grounds and the all tile pool. Just off their reefs swim turtles, and just about a 5 minute walk north is a small beach where turtles beach and sun themselves. We stayed 10 nights and as usual did not want to leave.", "title": "Kuleana # 322", "helpfulness": 7, "user": "7910Jim", "date": "October 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 143390551}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "This property in West Maui is located about 15 minutes north of Lahaina, and on the coast across from the small regional Kapalua airport. You can rent via the management company, or directly from various owners via sites like Airbnb or VRBO. The furnishings and condition of the specific units therefore vary.", "title": "Excellent base location for West Maui visit and adventures", "helpfulness": 23, "user": "Western_Traveller", "date": "October 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 142405367}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "In this review I will only speak to the resort and area, not a specific unit. You will also want to try and get some info on specific units by unit numbers from TA and elsewehere, since it sounds like while most units are good, there may also be some less well-maintained units.", "title": "So lovely!", "helpfulness": 4, "user": "Judith j", "date": "September 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 141701365}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "My wife and I stayed in Unit #603 just last week, and I felt that I should post this review as soon as possible. Let me start with the bad, then the good.", "title": "Unit 603 is Amazing!", "helpfulness": 7, "user": "Andrew F", "date": "June 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162678659}, {"rating": 4.0, "stay_parameters": "Stayed January 2013", "text": "Negatives: Bathroom was small...that's it. That is the only thing we could find to complain about. This was such a minor inconvenience that it's hardly worth noting, but I felt I should be as honest as possible in this review. A prior reviewer complained about no soap in the bathroom. That was either a mistake by the cleaning service or a remedied problem, because we did have hand soap in the bathroom.", "title": "Excellent location, facility, and value", "helpfulness": 2, "user": "Nmbrsix", "date": "June 1, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 162643485}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Positives: Look at the photos of the view from the lanai and note that there are absolutely no camera tricks. Those photos aren't taken at a certain angle or in a certain light to make it look more beautiful. It is actually more beautiful in person than any picture could show. I could spend this entire review talking about the view. I have done my fair share of traveling (Kauai, Caribbean, Europe) and can say this is by far the best view I have ever had in a hotel/condo.", "title": "Average Resort with Above Average Grounds and Location", "helpfulness": 4, "user": "Forknknife", "date": "April 11, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 157376504}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The beach is also great. Depending on the surf/tide, my wife and I were able to simply float on the inner tube, noodles, or boogie boards provided by Anthony or use the boogie boards for actual boogie boarding when the waves were higher. The snorkeling off the ladder and at the second beach is also great. There are sea turtles daily. These turtles were so much larger than I ever imagined. In front of the condo was the only place on the island we saw them while snorkeling, and it was an unforgettable experience.", "title": "Kuleana Resort unit #41", "helpfulness": 3, "user": "sls58", "date": "March 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 155343911}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The complex itself is very nice with well-kept grounds. You will quickly learn in Maui, and elsewhere in Hawaii, that the condos and hotels are not like those in Florida or the Caribbean. The buildings are almost all older and not as attractive from the outside as the newer buildings elsewhere. There are a few newer buildings, but why pay for a pretty building with a lesser view?", "title": "Kuleana Resort #207", "helpfulness": 4, "user": "Neilzig", "date": "February 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 152745867}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "To start, I must confess...my family has owned timeshare here since 1977, so I am a BIG fan. I will tell you, however, that I have also \"rented\" here as a non-owner, and that is a completely wonderful experience as well! The staff at the check-in is great and friendly, and very helpful. Late last summer, my husband and came in three days earlier than our timeshare week so that we could be married on the beach, just the two of us plus the minister. It was so lovely! We stayed for three days in the unit below the one we have as timeshare owners, and it was very well maintained. I've always felt that The Kuleana has the best kept grounds on the island. The pool is fantastic! Over the years and many remodels to that pool, it's just perfect. The entire pool is done in smooth ceramic tile, so your feet are never torn up. The beach has a multitude of giant sea-turtles which come right up to shore to rest. Ahhh...Kuleana...my happy place!", "title": "The most beautiful grounds on the island!", "helpfulness": 1, "user": "Karen F", "date": "August 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170340492}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Out our back door was a patio and the ocean was right there. Beautiful sunsets every evening.", "title": "Quiet and relaxing resort", "user": "Submergable", "date": "July 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 170213140}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "Out our front door was the swimming pool. We had everything we needed right at resort.", "title": "What a jewel!", "helpfulness": 2, "user": "Bonnie S", "date": "July 16, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 167849919}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The grounds are gorgeous and well kept. Very quiet, would go again.", "title": "Wedding and family", "helpfulness": 2, "user": "nicolett77", "date": "July 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167118890}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We were very fortunate to stay at The Kuleana Club in early July, 2013! We had a perfectly nice one bedroom condo, with a totally equipped kitchen, plenty of towels, a nice TV, and comfortable bedroom, sitting room, and delightful balcony right on the ocean! Waves are so close here, they really crash! The private beach is small but sheltered, and there's a very nice pool as well. Only issue for us is that it was an unusually hot week, and there's no AC, but good fans and lots of circulation. Don't imagine this is usually a problem, and it really wasn't, just a fact to share.", "title": "One of the best oceans view yet from #411", "helpfulness": 2, "user": "diamonddor", "date": "July 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 166534244}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "My husband and I just got back from staying 10 nights in Unit 308 at Kuleana. This was our second time to the development and we were completely pleased once again! The location is perfect as it's close to so many great beaches and conveniences. However, the resort is quiet and relaxing. It's fun to go to Kaanapali Beach for the day and then come back to the Kuleana where it's quiet and less touristy! The unit we stayed in was great, it had recently been remodeled. We like staying the 300 building as it backs the parking lot. For us, this was convenient as we were in and out of our car a lot. There is some street noise at night but nothing that bothered us. Our unit was a ground floor unit (same as we stayed in last year). We like this because it's nice to just be able to walk off your lanai to go down to the water. It's also more convenient when you are bringing stuff in and out of the condo.", "title": "Relaxing condo in a great location!", "helpfulness": 3, "user": "scoutandb", "date": "February 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 151973023}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "There are tons of turtles right off the beach in front of the condo. There is a ladder to make entry to the water easy for snorkeling and swimming. The beach is rocky but it is a great place to sit and soak up the sun. The grounds are immaculate and there is always a maintenance person around tending to something at the resort. Our condo was booked through Harris Hawaii and they were really great to deal with. This resort is really affordable considering the location and is very well maintained! I highly recommend it - we are already planning to head back next winter for our third trip in a row!", "title": "Kuleana 616", "helpfulness": 1, "user": "cdhaar", "date": "February 10, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 4.0, "value": 5.0, "rooms": 5.0}, "id": 151816702}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "My wife and I were looking for a relaxing and rejuvenating time away, in my opinion if this is what you are looking for as well, you will not find any place better. This is not a five star resort however the resort, the pool and the grounds are all kept up very well. The kitchen has everything you need for the basic cooking needs, although a couple of wine glasses would be appreciated. The bed was more comfortable than any I have slept on anywhere while on vacation, the bedroom is a little tight but I think it is worth it to have the comfortable king bed . And the one thing that sets this condo apart from even the five star resorts is the view, when you are inside you can sit on the couch and look out over the small beach through the side window and when you are on the lanai it is almost as private as being in the condo and the views are incredible. At this time of year the whales were visible everywhere and several times they would breach completely out of the water fairly close to the condo it was amazing!!!", "title": "Kuleana 411", "helpfulness": 3, "user": "upnorthjodie", "date": "February 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151493839}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We stayed here for 4 nights in early February. It was a wonderful condomium and I would recommend it to anyone.", "title": "Best Holiday Vacation Yet!", "helpfulness": 4, "user": "msfrankfour", "date": "January 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 148949825}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The best part is the view. Many condos advertise \"beachfront\" or \"great view\" but this place truly delivers. There was NOTHING between our balcony and the ocean, other than a few feet of lawn, a few black lava rocks, then sand and waves. I could throw a stone from our balcony and hit the water (and I can't throw very far). Every day (actually every hour) we could see multiple humpback whales swimming past. Sea turtles are everywhere although we couldn't see them very well from our balcony. The best place to see them seems to be standing at the top of the sea ladder. They would come within one foot of the base of the ladder and poke their head up, as if to say \"hello!\".", "title": "Relax and Get Your Maui On", "helpfulness": 2, "user": "James M", "date": "December 30, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 148328774}], "location": {"country": "United States"}, "variance": {"poor": 5, "average": 8, "very good": 29, "terrible": 4, "excellent": 61}, "aka": "The Kuleana Hotel", "slim_ranking": 0.511627906977, "description": "The Kuleana Resort boasts a truly remarkable oceanfront location, on West Maui's pristine coastline, with a gorgeous panoramic view of the Pacific ocean and the nearby islands of Molokai and Lanai. We offer you a rare piece of vintage Hawaii with the convenience and comfort of today. For over 25 years, we have strived to make sure that our guests have the most unique Hawaiian vacation. The atmosphere of our resort is friendly, family-oriented, homey and fun. This rare gem sparkles with the beauty of the tropics that only years of aloha can provide"}