{"user_rating": 4.0, "review_count": 594, "name": "The Ambrose Hotel", "reviews": [{"rating": 5.0, "title": "Nice place, extraordinarily nice people", "text": "I echo all the other comments about the pleasant environment - and the very soft sheets....", "helpfulness": 3, "user": "Citydweller2", "date": "December 9, 2004", "id": 2873761}, {"rating": 5.0, "title": "LOVED EVERYTHING!!", "text": "BUT for me it was the employees who really made the difference. They were exceptionally helpful - especially Josh. I've travelled on business (a lot!) and stayed in many fancy hotels, and the attitude of the employees at The Ambrose was beyond anything I've ever experienced. I arrived with a broken foot and was worried about how I'd get around until I was introduced to the London Taxi, which definitely reduced the distance between the hotel and the ocean!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "December 2, 2004", "id": 2859241}, {"rating": 5.0, "title": "Ambrose a Good Choice", "text": "Great place, great value for money, we'd definitely return.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "November 21, 2004", "id": 2837791}, {"rating": 4.0, "stay_parameters": "Stayed September 2004", "text": "I decided to go with the Ambrose after reading all the reviews and loved it!!!! My boyfriend and I had a corner suite which included: your own big patio with a gas fireplace!, a huge bathroom that was shaped like a long hallway (tub on one end, sink and shower in the middle, and the toilet at other end.) The sheets were so soft!! Though the room itself was okay in size, the amenities and the sexy, romantic feel made up for it. One thing I didn't like was that the patio is not private. They run side by side with other rooms and the surrounding buildings are higher than the hotel, so other people could look down at you. But then again, MOST of them did have their curtains closed. If you are there for a \"special occasion\" make sure your room is not next to anyone. Still this placed impressed me and I will definetly come back.", "title": "Calm & soothing", "helpfulness": 2, "user": "welshbee", "date": "November 10, 2004", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 2817411}, {"rating": 5.0, "title": "A real jewell", "text": "Excellent 4-night stay. Very friendly staff, comfortable rooms, especially beds, tasty breakfast and handsomely-designed common areas. Free parking and breakfast make it a good value. Quiet location, but not in the midst of things (need to drive, not a good walking location, but that's LA).", "helpfulness": 2, "user": "A TripAdvisor user", "date": "October 28, 2004", "id": 2791719}], "location": {"country": "United States", "city": "Santa Monica"}, "variance": {"poor": 20, "average": 57, "very good": 225, "terrible": 19, "excellent": 273}, "aka": "Ambrose Hotel Santa Monica", "slim_ranking": 0.176470588235, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "The Ambrose Hotel. Unique . Influenced by design, yet also inhabits the sights, sounds and tastes of its surrounding neighborhood. Your Place. That warm feeling of being at home. In fact, the last thing we want to do is make you feel like a guest. Because truth is, we’re guest’s in your life… sharing space . Of something bigger. A memory. A stay experience. Luxury. With it comes authentic service and a feeling that you’re in a special place quite unlike anywhere else in Southern California, Santa Monica… or , the world."}