{"user_rating": 4.0, "review_count": 465, "name": "The Ritz-Carlton, Seoul", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "I am currently on a 2-week trip around the world with stays in 5 cities. I was looking forward to my 4-night stay at the Ritz in Seoul as it is a Ritz Carlton but was disappointed. I have stayed at several other Ritz Carlton locations (Hong Kong, Osaka, Laguna Nigel, Coconut Grove, Phoenix and Maui) and the Seoul Ritz is at the bottom of my Ritz list.", "title": "Subpar Ritz Carlton", "helpfulness": 2, "user": "paul8292", "date": "November 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 1.0}, "id": 10933687, "likes": {"liked": "— The sauna facilities are top notch.", "disliked": "— No temperature controls in room and the non-Ritz Carlton like appointments"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "The hotel was reasonably priced (180,000 won / approx $175) considering its service, cleanliness and value. Despite problems listed below, the hotel staff is attentive and the basic room rate is less than others I would prefer to stay at.", "title": "Comfortable, but not quite Ritz standard", "helpfulness": 1, "user": "waterstone", "date": "September 30, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 10019813, "likes": {"liked": "— price", "disliked": "— breakfast buffet"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2004, traveled as a couple", "text": "I was originally scheduled to stay at the Westin for 250,000 won but changed to the Ritz for the better price and perceived luxury accommodations. Knowing that in advance that I had to pay 50k won extra per night for access to the club lounge, gym and sauna I probably would have stayed with the Westin. I'm a platinum starwood preferred guest and receive these benefits for free. Club lounge and sauna was worth the extra 50,000 won for me but it would have been nice to know that the sauna would be closed on Monday.", "title": "Quiet luxurious getaway", "helpfulness": 3, "user": "anniecakes", "date": "July 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 2.0, "rooms": 5.0}, "id": 8204445, "likes": {"liked": "— clean and quiet", "disliked": "— location can be inconvenient"}}, {"rating": 5.0, "title": "Heavenly Reprieve from the City", "text": "The biggest problem I had with the hotel is central heating system and no AC/Temp controls in winter months. The problem was not isolated to my room as throughout my stay I heard people complaining to the front desk and lounge employees. My room got as hot as 31°C / 88°F (who needs sauna access?). The first day I complained I was told to open the window. Even with the window open and the outside temp 0°C my room never got cooler then 27°C. The second day I complained that I could not sleep which resulted in them bringing me a tower AC (more like fan) which helped a little. The 3rd day my room was 31°C and I insisted that they move me. If you can, ask for a corner, exterior room which will typically be cooler. The room they moved me to had a door to a balcony and also a window on the other room. Within a few minutes of both being open, my room new room was a frigid 15°C and the heat was much welcomed. Unfortunately on the last night, the hotel was doing some electrical work and needed to shutoff power twice between 12am & 6am. The result was the heat being turned off and for the first night I was actually cold.", "helpfulness": 4, "user": "John_and_Marianne", "date": "June 16, 2007", "id": 7858457}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "The greatest part of the hotel for me was the sauna facilities (sauna/steam/showers/soaking tubs). Very clean, typical Korean bathhouse/sauna. Large steam and sauna rooms and three great soaking tubs (hot, mild, cold). Unfortunately, the sauna was closed on my last day for cleanings/service.", "title": "A complete and utter rip-off", "helpfulness": 10, "user": "PhilExport", "date": "November 12, 2006", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "location": 4.0, "rooms": 3.0}, "id": 6110125, "likes": {"liked": "— price", "disliked": "— Extortionate prices"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "My wife and I stayed at the Ritz Carlton for 5 days as part of a 7 week vacation in Asia. We travel each year on vacation for 6-7 weeks so we are experienced travelers staying at best hotels. The Ritz has an impressive lobby area, a very friendly staff, and an excellent club level with 5 presentations. But if you are a tourist, not business traveler, there are problems staying here. First, it is far from all tourist attractions which are near downtown. It takes 25 minutes by taxi ($20 with deluxe taxi and $10 with regular taxi) without traffic and 2 to 3 times longer with traffic. Second, the immediate area is not for tourists. There are no department stores, national type restaurants, cafes to people watch etc. The area is called an entertainment area, but really for young people hanging out at subway station. Third, the hotel has no real conceige, has little tourist information, doesn't even sell postcards. Amuch better choice of hotel would be the Westin Chosun in the center of downtown. Other problems staying here are the very hard beds (Korean beds) which may be a problem at other hotels. They will add a comforters on top of the mattress which helps. Other problem is to be sure you stay in the renovated rooms. The unrenovated rooms air conditioning system is terrible. Also they have the old 1990 type TVs as well as furniture. Hope this helps you.", "title": "PROBLEMS IF TOURIST", "user": "JDK1700", "date": "September 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 1.0, "rooms": 4.0}, "id": 20212370}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "Stayed at the Ritz while attending a conference in Seoul. After a 13 hour flight from California, was met at the airport by the hotel car, nice car for the 1 1/2 hour trip to the hotel. As we got closer to the Ritz, the traffic got worse.", "title": "The Ritz in Seoul", "user": "goldboar", "date": "September 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 19862787}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "When I arrived at the hotel was met by a very friendly staff, check-in was a breeze. After checking in went to find a late night dinner. The hotel has 4 restaurants ranging from Japanese, Italian and a buffet for a verity. Choose the buffet, servers were friendly and food was good. Like any restaurant in a Ritz there going to be pricey.", "title": "Timeless", "user": "travelgoat53", "date": "July 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17573603, "likes": {"liked": "— The Location", "disliked": "— The Bar's are not 24hrs (I am not a Lush)"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The room was nice, fair sized for an Asian country. Had a flat screen TV and high speed internet. Not sure what others are used to, however, the bed was standard firmness for a hotel in Asia. When I did check in, the hotel clerk mentioned that other rooms were under renovation, so others that stayed at the Ritz may have stayed in one of those rooms.", "title": "Hard bed, old furniture", "user": "HKAIR", "date": "January 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 2.0, "cleanliness": 5.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 12316494, "likes": {"liked": "— The building", "disliked": "— The bed"}}, {"rating": 3.0, "title": "A tired Ritz, not up to standards", "text": "Overall my stay was very nice; the hotel is close to shopping and subway.", "helpfulness": 1, "user": "pauloregon", "date": "December 6, 2007", "id": 11289518}, {"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "The bed is very good and service attentive, but there's absolutely no way to justify the absence of free Internet service when you are popping $150 a night in the capital of arguably the best connected country in the planet.", "title": "No free Internet, no toothbrush, no way coming back", "helpfulness": 1, "user": "HippyHopper", "date": "April 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 28170617}, {"rating": 2.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "I was certainly appalled to check that you get shower gels but no other toiletries and toothbrush, toothpaste, razor and shaving gel are all separate, non-complimentary items showcased in a kind of \"7-eleven\" corner in the room.", "title": "Not a very pleasent stay...The hotel tried hard, but did not impress me..", "user": "Leonsin", "date": "March 30, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 1.0, "service": 3.0, "rooms": 2.0}, "id": 27094439}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled solo", "text": "I'd give up the sci-fi toilet for being able to brush my teeth any day of the week.", "title": "Ritz Carlton Seoul is still the best deal in town", "user": "Ellen K", "date": "November 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21665135, "likes": {"liked": "— Everything", "disliked": "— being charged for internet even though I was on the Club Level"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "This is not a rant, but given that in Seoul you are sooo spoilt for choice when in comes to high-end hotels, little details are all you need never to come back again.", "title": "Good service but dated facilities", "helpfulness": 1, "user": "q9rve", "date": "November 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 21445921, "likes": {"liked": "— The Service", "disliked": "— Nothing in particular"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "I have been to Seoul many times and usually stayed at COEX or Lotte hotel, however this time, all the kng-size bedroom were fully booked. Thus moved to Ritz-Carlton. The room was far from expectation. It was too warm. Although they did tried their best to cater to my needs, and upgarded me to a suite. But still the temperature in the room was non-ideal. I have to open the windows which faced the main road, it was very noisy...", "title": "Poor", "user": "LondonWolfeee", "date": "September 27, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 20430391}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "My wife and I stayed at the Ritz Carlton Seoul with my parents and sister-in-law from the 20th of May to the 27th of May. The property itself is quite nice, and is in the process of a major overhaul. The hotel is located in Gangnam a quiet suburb of Seoul if such a place exists. We stayed in an Executive Suite on a club floor, and my parents had a Club Parlour Suite. The club level is definitely worth the extra minimal investment. The club lounge features five meal presentations daily including: breakfast with made to order eggs, snacks, afternoon tea, appetizers and cocktails, and even chocolates with cordials. The service is excellent and very attentive, and the new GM at the property really understands customer service. He is an enthusiastic cheerleader for the chain, and under his leadership the property already has had a remarkable number of changes including the addition of a beautiful terrace dining area.", "title": "Ritz Carlton Seoul -- the star is the \"staff\"", "helpfulness": 3, "user": "philfna", "date": "May 22, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5191322}, {"rating": 2.0, "stay_parameters": "Stayed March 2006, traveled on business", "text": "The swiming pool / fitness club area was top notch with excellent service included with hotel stay. The spa is included with a club room; we didn't try the spa. The guest relations staff (concierge) is extremely concerned with making any guest's request a reality (reasonable or otherwise). Seoul is a city full of \"business\" class hotels, but the Ritz is the only luxury hotel. Luxury implies a certain amount of relaxed comfort and service tha the other properties lack. With the planned renovations including the new deck for the club are complete the property will again lead the luxury AND business segments.", "title": "Find somewhere else", "helpfulness": 6, "user": "4snickers", "date": "March 8, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "service": 4.0}, "id": 4595257}, {"rating": 5.0, "stay_parameters": "Stayed October 2005, traveled on business", "text": "I highly recommend the property.", "title": "My second home", "helpfulness": 7, "user": "Washand", "date": "February 13, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4458164}, {"rating": 3.0, "stay_parameters": "Stayed December 2005, traveled on business", "text": "Stayed at the Ritz the first week of March, in the lobby the hotel seems dated. Upon being taken to our room we realized how dated it is! The bathroom has water damage, with wood molding stained and dark coloring in the grout around the bath. Room is small and quite noisy on the 8 th floor facing the busy street. Same as the Anaheim Marriot in regards to year built and brick color marble features. Beds are horrible and I slept in the chair, however if you like a rock hard mattress this is the place for you. If you have back problems find someplace else. TV is tiny and AC not working. Service is good. Will never stay at the Ritz again as the mattress issue is the same at the Ritz Laguna location.", "title": "Rooms a little dated", "helpfulness": 5, "user": "CL5309", "date": "December 28, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "service": 5.0}, "id": 4307827}, {"rating": 3.0, "title": "OK, but not more", "text": "I have stayed at this hotel about 25 times over 3 years and so I can say that I am quite familiar with just about everything in it! What I like about this hotel is what most other reviewers seem to dislike...the rooms are decorated in a clasical style which I find very pleasing. The furniture is of fine quality and is solid and interesting, the pictures on the walls are limited edition signed copies of original paintings, the lamps are made from beautiful pottery, a CD player with classical and/or jazz CDs are provided, the quality of bed linen, carpets, curtains is high and the overall impression is one of comfort, quality and style. Yes, a little old-fashioned, but not at all poor standard. Deluxe rooms are compact but comfortable. Some parlour suites have bedrooms with no windows and others have large windows with impressive views (although Seoul is such an ugly city...), depending on the room configuration. I like the parlour suites best because they feel less like a hotel and more like cosy retreat to relax and enjoy life. I have only stayed in an executive suite once, and the style of the rooms was much more glass and modern. For that reason, I didn't like it as much, but the large whirlpool bath and extensive bathroom was great. In comparison to this Ritz, I find other hotels in Seoul, such as the Shilla and the Marriott, rather dull, modern and lacking in character.", "helpfulness": 8, "user": "kobri", "date": "December 9, 2005", "id": 4222608}], "location": {"country": "South Korea", "continent": "Asia"}, "stars": 5, "variance": {"poor": 24, "average": 56, "very good": 134, "terrible": 13, "excellent": 238}, "aka": "The Ritz-Carlton Seoul Hotel", "slim_ranking": 0.0363636363636, "description": "The Ritz-Carlton, Seoul is located in Gangnam, the heart of Seoul’s business, culture and fashion. It is close to Korea’s World Trade Center, the shopping district of Itaewon and several top department stores, and the cultural neighborhood of Cheongdam-dong, bringing guests unparalleled levels of satisfaction whatever the purpose of their visit. Its classical, antique-style design is inspired by that of the 18th century Palace of Versailles, while its unique exterior, which soars upward light a series of steps, following the contours of the land on which it is built, has become one of Gangnam’s local landmarks. A newly opened entrance, offering access directly from Sinnonhyeon Station, along Bongeunsa-ro, has added still further to the hotel’s convenience. The Ritz-Carlton, Seoul contains 375 guest rooms of 10 different types, including 47 Luxury Suites and 75 Club Rooms. Its guest rooms with balconies offer inspiring views of the city and great opportunities to sunbathe and hold a variety of parties. The Presidential Suite, a previously winner of the Best Suite prize at the Gold Key Awards for hotel design, is a favorite among VIPS visiting Korea and offers the very best in state-of-the-art facilities and unparalleled comfort. Decorated with works by international masters including Pablo Picasso and Roy Lichtenstein, the Presidential Suite offers a unique chance to enjoy some of the 20th century's finest art.The hotel contains six restaurants and bars: All Day Fine Dining restaurant The Garden, Chinese restaurant Cheehong, Japanese restaurant Hanazono, Oksan Buffet, The Ritz Bar, and Ritz Deli, offering a wide variety of fine dining experiences. The Garden, located on the hotel’s lobby floor, is particularly well-known for its outdoor garden, bringing a touch of nature to the heart of the city. From late spring to autumn, The Garden is popular for outdoor barbecues and a variety of other parties and wedding ceremonies."}