{"user_rating": 4.5, "review_count": 1426, "name": "The Royal Suites Turquesa by Palladium", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "We just returned from a 5 night stay at RS. From the airport to the transfers (Turinter) to check in, to drinks in hand, the experience was excellent. We were greeted with a cool punch type drink and checked in to the Honeymoon Suites. The bellman took our luggage to 3rd floor in bldg 50, room 5038 and it was a big WOW. The room was spotless, marble floors, white canopy bed, red hibiscus flowers on bed and in the bathroom area. We had a stunning view of the ocean from the rounded balcony. The jacuzzi tub was set against the wall and there were curtains you could let down if you wanted privacy. There were 2 comfortably chairs and a table to enjoy the beautiful view of the ocean and pool. By the time we got settled, our friends had been taken to their room. It was just like ours, only twice as big! They were in bldg 51, 2nd floor, Suite 5125. They were also impressed with their room. We were told to see the bulter about 5:00 to make reservations for restaurants. I now have a new best friend, Cely, I cannot say enough about her. She speaks excellent English as wello as German and probably other languages. She bent over backwards to make sure we had everything we wanted. Reservations at the a la carte restaurants was a breeze and she also made arrangements for the guys to play golf for the next 2 days with transportation included. She had champagne for us, pillows galore, and did it all with such a sweet and happy attitude. I told her I was very concerned about the service at the RS due to all I had read on this forum. She explained what had happened over the past month and said things were worked out now. We even had the bellman take us to all the restaurants without having to wait on the tram to come around. Of course, we tipped him well, and he was always looking for us to take us anywhere.", "title": "Wonderful Vacation, Beautiful place", "user": "travelingal54", "date": "June 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32567054}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Beach was absolutely beautiful. Soft white sand and many shades of turquoise water. Water was crystal clear, although I was disappointed there were no fish to see or shells to collect. There was a reef out by the ropes that people were snorkling at, but we didn't go out that far. We never had trouble getting chairs and we would get to beach about 10 or 10:30 every morning. There are lots of Europeans here and that means lots of topless women. This didn't bother our guys one bit!! We did walk to the shops one day and the people would try to get you in, but if you said no, or later, they wouldn't bother you any more. If you want some of their cheapy, cheapy stuff, you can really bargain with them--at least 1/2 or even more than what they initially tell you. Just go with a good attitude and enjoy the people. Talk to them and be friendly, but tell them \"no\" and they won't hassle you to buy their crap.", "title": "Oasis in the Caribbean", "helpfulness": 4, "user": "CAKM", "date": "June 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32496386}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Food was nothing to write home about. We are from Louisiana and our food is incomparable to any I have ever tasted. We love spice and flavor. The Royal Gormet was ok, lobster was probably the best food. We tried the Mexican and it was horrible. Do not waste your time. They didn't even have salsa and guacomole. The fajitas were tolerable, but the other foods we had were not good. The Japanese restaurant was really pretty good. The show cooking was fun and we had a good time. The chicken, beef, and shrimp had more flavor than other places. We ate at the Arrecife ?? the seafood place one night. I had a pasta appetizer that was very good, and sea bass for the entree. It was pretty tasty. I also asked for a glass of champagne and they brought the whole bottle iced down. I tried to explain that I just wanted a glass and he said that because we were in the RS, I got the whole bottle. Nice! We ate at the Torres buffet our last night and it was really good. I got a hamburger, and also some bow tie pasta with creme sauce. Both good. However, the best was the dessert. The girl was cooking what I thought was bananas foster, but it was with any or all the fruit she had-- bananas, pineapple, mango and some others. She sauteed them in butter, added honey, vanilla, and sugar, and Ummmmm delicious with a little vanilla ice cream on top.", "title": "Lovely location but may not go back...", "helpfulness": 5, "user": "weneedthesun", "date": "June 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 32486721}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We had a massage at the Renova spa. I had the combo and my friend had the deep tissue. We were not too impressed with it, but not bad at all. We also went into the casino a couple of times. My friend won $12.00 and we thought it was a good night!!", "title": "Not the Royal Treatment", "helpfulness": 4, "user": "scubadive1", "date": "June 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 32332783}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We went on a tour that I had booked over internet before we left. Punta Cana Mike's Best of Bavaro. It was fabulous, so personalized and only 7 of us. I enjoyed seeing the countryside and also the neighborhoods. We went to a secluded beach, Macau, and saw the local fishermen. They were cooking over wood fires, some god awful concoction of fish and leaves. Mike told us a British film crew was there recently and ate at this place. Okaaaaay. The sand was not as pretty here, but the water was still as beautiful. There were a few beach vendors (surprise) who pulled out the beads and coconut monkeys. They were really sweet, so I bought a coconut monkey from Sparkles. I will try to post his pic. We then went to the school and met the principal and some of the children and their mothers. School was out, but they still hang around and wait for Mike. They were adorable and I had brought a few toys for them. Also, my dentist had donated some toothpaste and toothbrushes that I handed out. The mothers loved this more than the kids. We took pictures of the kids inside the classroom with the principal. She had one of the little boys Georgy, sing for us. It was precious. Rest of tour was good, ended up at Steve's corner bar and we loved Carla the bartender. She was adorable. Then our day was over and we went back to the resort a little wiser than when we started.", "title": "beautiful", "helpfulness": 6, "user": "linbad2", "date": "June 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32284760}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "When I booked this trip the description on the Deluxe Junior Suites says Oceanview.", "title": "Wheres the Oceanview?", "user": "golfadddict", "date": "July 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 2.0, "service": 5.0, "rooms": 3.0}, "id": 33653985}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We were put back into building 53. We were a quarter mile from the ocean. We had a view of a small pool from our balcony. This is false advertising and would like an explanation from the management. I loved the hotel as a whole but would like to have what they said I would get in their room description. I want to come back but I do want the same room location!!!!!", "title": "Overall a nice, relaxing vacation", "helpfulness": 2, "user": "blklab1", "date": "June 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 33463891}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We stayed at the Royal Suites in the new section (building 56) from 6/21 through 6/28. Upon arrival we were greeted promptly and given a cool drink while we checked in. Since we arrived before the 3 pm check in and our room was not ready, we were taken to the Royal Gourmet for lunch. After lunch, we returned to the lobby to wait for our room for about an hour. This wasn't a big deal to us given that check in isn't until 3 anyway.", "title": "Beautiful beach and grounds; service lacking", "helpfulness": 3, "user": "mojo_and_fred", "date": "June 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 33372350}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Our room was beautiful, just as we had hoped. We did not have any problems with our room during our stay-- everything worked properly (AC, tub, bathroom facilities, etc).", "title": "Great Hotel!!!", "helpfulness": 3, "user": "MIAMICOUPLE030", "date": "June 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33271346}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We did have a small problem with our return transportation. When we arrived at the airport on Sunday, we were told to meet our representative from Turinter (through US Airways) in the lobby of our hotel at 9:30 am the next morning. We waited for about 45 minutes (in the Royal Suites Lobby since that was our hotel)....only to find that the representative had been in the lobby of the Palladium Palace and that we had missed him. Our butler (concierge), Jose Carlos' contacted him for us and we eventually met up with him later in the week.", "title": "Great Trip, Okay Resort", "helpfulness": 5, "user": "springbreak2005", "date": "June 19, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 32695078}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "My husband and I have traveled extensively throughout the Caribbean and Mexico and stayed in some very upscale resorts. The last being the Iberostar Grand Paraiso in the Riviera Maya.", "title": "Okay could use a little improvement", "helpfulness": 5, "user": "lm6868", "date": "June 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 31856014}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Let me start with the positive. The staff and service is very good. There is a language barrier if you do not speak Spanish so be patient. These people really try their best. We stayed in the new section in the swim out suites. We never saw a butler and had no contact. If this is important to you it will be a problem. The room is nice and is very clean. Make sure when you get your room someone shows you how to turn on the lights (have to insert key on the wall next to the door). Also, have explained the red and green lights for room service. The beach is beautiful, plenty of room never felt crowded with chairs and beds always available. We would go to the beach late morning and return to our room with the swim out pool in the afternoon. At both places someone is always there to take a drink order. Service was never a problem.", "title": "Wonderful Trip!", "helpfulness": 4, "user": "Nemoton", "date": "June 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 31672794}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "The down side for us was the food. We primarily ate at the Royal Gourmet. Once again, service was great but the food was mediocure at best. Very bland. The best entrees for us were the lobster thermidor and flank steak. Had the filet mignon but the cut of meat was just not good. Do not order the BBQ ribs. It is a piece of meat wrapped aroung the bone and chewy. The menu at the Royal Gourmet does not change. Room service menu was ok with the hamburger, pizza and chicken tacos being our favorite. The frozen drinks were like ice with a cheap mix and little alcohol. Actually ordered sangria in the afternoon and stuck to wine in the evening. Local beer is very filling and heavy.", "title": "Excellent service, beautiful hotel", "helpfulness": 7, "user": "adelaq", "date": "June 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 31340474}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "The worst part of this trip was going back home. The Punta Cana airport is in serious need of some help. We had to leave 4 hours before our flight to the airport. You actually need all this time and would not believe the lines and how slow the process is. Our stress level was fully restored at that point.", "title": "Could be great but they have a lot of work to do to get there", "helpfulness": 7, "user": "OhioTravelDiva", "date": "May 31, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 4.0}, "id": 31247687}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "This is just our opinion and to each his own. For a quick 5 day vacation we would go back to the Riviera Maya before Punta Cana. No offense to anyone, it is just our feeling that Cancun/Riviera Maya is so much easier to travel to and offers better luxury accomodations. Any questions, feel free to contact me. Just got home Saturday.", "title": "Beatiful Resort and Beach... Bad service...", "helpfulness": 7, "user": "tagin", "date": "May 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 4.0}, "id": 31234406}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "My wife and I stayed at the Royal Suites Palladium from 7/1-5/09 to celebrate our 20th wedding anniversary. It is our 5th time to the Dominican Rebuplic and 3rd time to Punta Cana, however our first adult only resort. My best advise for planning a vacation is to know exactly what you are looking for and then research resorts to find the highest rated one within your budget that meets your criterior. From our perspective, I will highlight what this resort had to offer and what you may expect.", "title": "quiet, relaxing and comfortable", "helpfulness": 2, "user": "twinms", "date": "July 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 34476558}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The Royal Suite section of the Palladium is a relatively small adult only section at the end of a very large resort encompassing 4 other sections.", "title": "Everything I expected", "helpfulness": 4, "user": "newvacationer", "date": "July 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 5.0}, "id": 34234816}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Check-in was quick and simple and after the paperwork was completed we were assigned and met our \"buttler\". Perhaps more appropriately termed a conciere to help with reservatinos and scheduling. None the less, very personable, friendly and helpful.", "title": "Wonderful Resort~ Very Comfortable Junior Suite in New Section # 53", "helpfulness": 4, "user": "nixona", "date": "July 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 34190092}, {"rating": 5.0, "title": "Sheer bliss", "text": "We were given a form to complete for choice of pillow, gift bottle of alcohol and preference for stocking mini bar, all of which were done promtly.", "helpfulness": 2, "user": "sswingfield", "date": "July 6, 2009", "id": 34079988}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We stayed in the \"older section\" because we wanted to be closer to the beach. We were in room 5247, third floor, second room from the end, closest to the beach. Overlooked the pool and could see the beach through the trees but not what we considered a true ocean view. This building abutes the \"real Dominican\" which was a little loud especially early in the morning(by 7:00am). The building across the pool is probably a little more desireable. Our room was very nice, clean, large and well appointed. Being on the third floor, the vaulted ceiling provided a nice open feeling. If sitting out on the patio, DO NOT close the slider, it will LOCK.", "title": "Wonderful experience.", "helpfulness": 5, "user": "dunhamr", "date": "July 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33825135}], "location": {"country": "Caribbean"}, "stars": 4.5, "variance": {"poor": 72, "average": 155, "very good": 328, "terrible": 39, "excellent": 832}, "aka": "The Royal Suites Turquesa By Palladium Hotel", "slim_ranking": 0.386138613861, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "The Royal Suites Turquesa is an exclusive VIP area of 140 luxurious rooms located within the Grand Palladium Resort in Punta Cana. Featuring private facilities and personalized service, the area includes an exclusive restaurant, concierge service and free Internet in the private lobby, air conditioned bar serving premium International beverages, exclusive pool with built-in Jacuzzis and bar service to the sun beds by the pool and at the beach, and much more. For adults only."}