{"user_rating": 4.0, "review_count": 668, "name": "The Fairmont San Jose", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2008", "text": "We selected the Fairmont for our recent stay based on the TripAdvisor reviews and other information, although it was slightly further away from the convention center than other options offered. Bottomline -- we made the right decision and friends visiting from the other hotels (such as the Hilton and Marriott) wished they had booked into the Fairmont.", "title": "Exceptional with some exceptions", "user": "Often_on_road", "date": "July 10, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17737225, "likes": {"liked": "— the bathroom and the location", "disliked": "— in-house breakfast buffet, lack of car service options"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "The hotel offered many, many pluses. However, there are a few items that keep this hotel from achieving truly world class status.", "title": "Great bargain", "user": "SFBayMommy", "date": "June 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 17350781, "likes": {"liked": "— location", "disliked": "— no hot tub"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "Lobby -- this is a big, active lobby. Dancing going on one night, other activities in other evenings. Nice option for the evening and quiet during the day if you want a spot to meet someone.", "title": "What a beautiful hotel to experience...just work on the service.", "user": "zoohouse", "date": "June 26, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 17238304, "likes": {"liked": "— The really cushy room", "disliked": "— Having to pay $14 dollars a day for internet service. Seriously?!?!?!?"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Size -- when booking, note that this is a big hotel that books large groups. However, the rooms, location, and pool are very nice for smaller groups and families.", "title": "Very nice hotel for the money", "user": "cuse1998", "date": "June 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16772717}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "Check in -- relatively fast. However, one of our two reservations was fouled up. We did not get exactly what was specified but the end result was close enough.", "title": "Great location for conferences", "user": "TravelGirlCork", "date": "May 11, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 15930366, "likes": {"liked": "— The room was great", "disliked": "— Having to pay for internet considering the overnight rate I had to pay"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "I had hoped the hotel would have been better. I stayed here years ago and remembered it as a fabulous pace. The furniture in the rooms were tired. The service OK. The location is great, two blocks from the convention center and across from the tech museum.", "title": "Good but not great", "helpfulness": 1, "user": "Teleman123", "date": "May 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 129389044}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "My family and I use to come to the Fairmont every year after visiting the Christmas in the Park exhibit. A couple of years ago, the four of us attempted to enjoy some hot chocolate in the lobby bar, but we were ignored. I went to the bar to ask for help. I asked one of the passing servers if we could get some help (and she said it was not her section). Our server said she would be right with us but after 30 minutes of waiting just to talk to someone at our table, we got up to leave.", "title": "Customer Service Needs some Work", "user": "Brian B", "date": "May 1, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 129204133}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "My wife and I have been involved in the hospitality industry since the early 1990's. We took the steps of going to the front desk to advise them of what happened (they gave us the GM's card - they really should have contacted the MOD to smooth things over). We then emailed, phoned and wrote a letter to the GM of the Fairmont San Jose (I believe he no longer works there) and received no response at all. We even attempted to contact him by email again one year later (and no response again).", "title": "Good business stay at the Fairmont San Jose", "user": "Podolano", "date": "May 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 129202984}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "We stayed there a couple of weeks ago and enjoyed the property. The rooms are very nice and spacious and the pool area was great (although we caught a bad weather date). When we initially pulled in to the front drive, no one came to help us (sound familiar?) The two valets were having a discussion with each other (personal business). A third finally came up after I had already taken all of our bags out of the car and my wife and kids had walked to the front desk.", "title": "Always stay here, great location", "user": "FamilyontheMove_12", "date": "April 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129120371}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "In my reservation comments, I noted that we would like to be contacted by the manager during check in or just after so that we could explain these issues. I don't think anyone read those comments because we did not hear from anyone.", "title": "Superificial in many respects. Expected more.", "helpfulness": 1, "user": "hexalite2k5", "date": "April 27, 2012", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "location": 5.0, "value": 2.0, "rooms": 2.0}, "id": 128945420}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "Very classy, grand when you pull in. Valet only (with unlimited in/out privileges). Walking distance to shops and restaurants. Nice lounge inside, if you would rather say in the hotel. Would stay again!", "title": "Beautiful hotel...", "helpfulness": 1, "user": "BakingBakers", "date": "May 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130070847}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Its one great hotel, well connected to most restaurants and offices. Good lounge area and courteous staff. Twin towers with many rooms and availability of cabs, ATMs, Cinema and Bus stations in the surroundings make this one a sought after place.", "title": "Great location", "user": "Ashish J", "date": "May 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129826816}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "I stayed at the hotel for 6 nights all was fantastic, the room and the service especially.", "title": "South tower", "user": "Benjamin S", "date": "May 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129710397}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Be ware however parking is 26$ and so is breakfast.", "title": "A nice place close to everything", "user": "jmurphy4564", "date": "May 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 129670923}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "The Fairmont is located right down town close to the convention center. I was there for that reason so appreciated the location and the fact that it was far enough away from the site to give me some space. I was on the 15th floor overlooking the pool. The room was fairly well appointed. Bed was comfortable and the bath large enough to \"take a bath\". Internet was ok but expensive for being in the heart of the Silicon Valley. I had two great meals when there. The first at Morton's across the road, a good old school steak house and the other in the Grill downstairs. I had the Sea Bass and it was great. I ate breakfast in the hotel once and waited too long and they seemed very disorganized. Afterwards I went next store for a nice croissant and a coffee at half the price.", "title": "Mixed bag of great hotel and mediocre customer relations", "user": "GoNoGo", "date": "May 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129611771}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "Loved this place. I stayed on business (conference, stayed 5 nights). This was a great place. The staff was great, made me a member of the presidents club so I received free internet the entire week. The cleaning staff even went so far as to move my shoes to the closet and fold any clothes I did not hang up. I had chocolate covered strawberries left the first night. I was on the 20th floor on a corner and had a great view. I ate at the Fountain restaurant for breakfast, it was slow but good food. It is near a bunch of restaurants, 2 museums (art and tech), and a park out front. I never once heard any noise from any of my neighbors and the bed was sooo comfy. I had 4 pillows and used all of them at some point. I had a great experience and thought my stay was great. I recommend to everyone!", "title": "Loved it!", "user": "kaybabee", "date": "April 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15151025, "likes": {"liked": "— all but the towels", "disliked": "— towels were rough"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "i have to say I was a little nervous reading some of the reviews, but my family and I decided to stay at the Fairmont Hotel in San Jose for 5 days in March.", "title": "Great Hotel!", "user": "tronomatic", "date": "April 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 15092663, "likes": {"liked": "— Location (movie theater 1 bloack away, restaurants and bars nearby), cleanliness of room, and frienliness of staff"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "The hotel was not very busy during the week as I believe there weren't any conventions in town.", "title": "Good hotel downtown SJC", "user": "nico_ch", "date": "February 26, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 13871303, "likes": {"liked": "— Modern, large and clean rooms", "disliked": "— The restaurant and bar"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "Overall, we loved the hotel!. The staff there was always courteous and helpful, from the check in staff to the concierge. We stayed in the new building as part of an upgrade offer from Lexus and the rooms in the newer part of the hotel were very comfortable and felt \"new\".", "title": "Not what you expect from Fairmont", "user": "dan_mcweeney", "date": "February 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "location": 5.0, "rooms": 1.0}, "id": 13617938}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "The gym in the hotel was excellent (open all the time) with a unversal set and plenty of treadmills, bikes, and the like. We were not charged for the gym, we just swiped our card.", "title": "Definitely four-star, including price", "user": "Elvenfair", "date": "February 12, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 13509779, "likes": {"liked": "— Service, location, lounge/lobby", "disliked": "— Price"}}, {"rating": 5.0, "title": "The Fairmont is a fabulous hotel!", "text": "My husband and I spent 3 nights at the Fairmont in October, 2008. The hotel was outstanding in comfort, cleanliness, service, and luxury. The room was very generous in size, and well laid out. The bed was extremely comfortable. The bathroom was large, with both a walk in shower, and a tub, and also had an adjacent make up area and a walk in closet. We had a great view, and even though we were right in the line of air traffic for the San Jose airport, and the planes came in very low above us, you could not hear them at all unless the window was open. My husband loved the large desk, off on its own, so that he could concentrate while working on line. I have no complaints, just 3 very minor things that would make the room absolutely more perfect. It would have been nice to have a mini bar fridge as the Starwood hotels have to keep water and soft drinks cold, for those times you don't feel like finding the vending machine. The shower was large but had virtually no place to put anything other than a bar of soap. A shelf for toiletries would be a great addition. The seated make up area was large, but poorly lit and the distance to the mirror was too far- an extended mirror that attaches to the wall and swings out at various angles (again like the Starwood-Sheraton hotels have) would have made it perfect. We loved the sunken bar area in the center of the lobby that had a live band playing every night. It was classy, and a lot of fun. The gift shop was well stocked with both necessities and souvenirs and gifts. The restaurants were excellent, both for brunch and for dinner. We absolutely loved our experience at the Fairmont and will definitely return - in fact we are planning our next trip already.", "helpfulness": 1, "user": "Travellers007", "date": "November 4, 2008", "id": 21554066}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "My wife and I stayed at The Fairmont during the San Jose half-marathon early October because the hotel was recommended by the event.", "title": "Nice property", "helpfulness": 1, "user": "Danny007", "date": "October 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 20854557, "likes": {"liked": "— Room comfort", "disliked": "— No free Wi-Fi connection"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "This was my first stay at a Fairmont property and I must say it was a good experience. The staff was very helpful and friendly. For example, there was no more parking stalls available at the hotel and a staff member was nice enough to recommend a very cheap option closeby. The hotel itself was immaculate! Very comfortable large rooms and nice beds.", "title": "Pretty good, not excellent", "user": "nyuszi", "date": "September 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 2.0}, "id": 20381847, "likes": {"liked": "— location, location, location", "disliked": "— periodic bad smell"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The hotel also has a very nice heated pool, a decent gym and a sauna. There are a few good restaurants attached to the hotel and the bar in the lobby is very spacious with flat screen TV's to watch some sporting events.", "title": "Loved it here...", "user": "princess121", "date": "September 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 20144653}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "However, I was not too impressed that such a classy hotel does not offer free Wi-Fi connection...", "title": "Loved the Fairmont", "user": "travelbugabbd", "date": "September 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19675067, "likes": {"liked": "— How comfortable it was- very nice!"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "I've stayed twice at the Fairmont San Jose, once in each tower. The location is perfect for business travel: just 10-15min from the airport, centrally located downtown with tons of restaurants, bars, movie theater, museums, all within walking distance. The lobby in the main tower is great for meeting coworkers for a drink. The rooms are spacious, clean, comfortable - quite adequate for business travel. The rooms in the second tower are newer and quieter. I see in other reviews that people had problems with the service (particularly check-in) - I had none of these issues - check-in and check-out were uneventful. The parking and breakfast is quite expensive so beware. You can have a good breakfast at a much cheaper price at several of the coffee shops or restaurants close by. The only reason that I didn't give it an Excellent rating is that it doesn't have anything that really stands out compared to some of the other large hotels in the area.", "title": "Great location and nice accomodations", "user": "sensfan12", "date": "May 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 130819593}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "This is a great hotel for a company offsite. The lobby area is very spacious and great to chat with a group of co-workers or 1:1 chats. Fairmont is very central yet located just a couple of minutes from the airport.", "title": "Impressive common areas, rooms are okay", "user": "cgoldsch", "date": "May 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 130583208}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "The room was not bad but unimpressive. Several hotels that cost less can provide more comfort.", "title": "a pretty package, but underwhelming", "user": "Cedate", "date": "May 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 130342107}, {"rating": 2.0, "stay_parameters": "Stayed May 2012", "text": "We booked our room online in advance requesting a room with two beds and a rollaway to accomodate the three of us in our party. Upon arrival we were informed that fire code would not allow a rollaway to be placed in that room. When complaining about it later, we were informed that there is no guarantee you will get the room you reserved. Where you are placed is based on what is available when you walk through the door. REALLY?!?!?!? What is the point in reserving a room if you are not guaranteed to get what you reserved? Wi-fi costs $14 a day, parking is valet only and costs $26 a day. Merely lifting the items in your mini-bar/refreshment center incurs a charge so beware. The grill on the alley served wonderful food but there was a delightful layer of dust on the lamps and ledges right next to the table. My manicure at the Day spa was extremely overpriced for what I received. The few positives: the room itself was clean and our housekeeper was delightful, the location is great (right in the middle of downtown), and our luggage arrived in our room very quickly. Luxury? Sure....if you have the extra money to pay for it. I think I will stick with the much cheaper options, at least I will get free wi-fi and a continental breakfast.", "title": "Not a good stay!", "helpfulness": 1, "user": "1234kiki", "date": "May 20, 2012", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 2.0}, "id": 130305302}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "We did not have a nice stay at the Fairmont this past weekend. We booked on THEIR website a deluxe double room in the tower (because I knew these were newer). When we arrived they had us in a king room so I requested the two beds we reserved. We ended up in the main hotel which is older. The room was clean - but the bathroom is due for an update. It has a tiny stall shower with old tile and an old fashioned metal soap dish leaving you no place to put shampoo, conditioner, razor etc. I could live with all of this without writing a negative review however the room we were put in had a connecting door to a group that decided to have a party. At 1:00 am Lady Gaga came blaring through the paper thin walls. At 1:30 am I called the front desk. They sent security who came and told them to turn down the music - but not to stop the party level noise - which continued until 2:30 am. I know the group was just having fun - but my daughter had an important event the following day and could have used a good nights sleep. When I called the front desk the next morning to tell them I was checking out and that I wouldn't recommend them putting anyone else in that room due to noise - the gentleman told me \"thanks for your feedback\". Ummmm how about some customer service? I wasn't looking for a free night - but an \"I'm sorry your stay was uncomfortable I hope you will be back\" would have been a nicer response. I have also stayed down the street at the Marriott and rooms were updated and QUIET...... Will be there next time!", "title": "Not what you expect from a Fairmont", "user": "ExperiencedTravelers", "date": "May 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 130303404}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled solo", "text": "I became a fan of the Fairmont brand when I stayed at the Chateau Frontenac in Quebec City and I joined their Presidents Club membership (frequent stay program). I have stayed at different Fairmont properties and they all excel in quality. San Jose was no different. The rooms are clean and beautifully appointed. If there is even the slightest thing wrong the staff not only rectify it, they insure they make it up to you with some type of comp/discount.", "title": "Fairmont knows their stuff!!!!", "user": "acsc", "date": "August 28, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19489844, "likes": {"liked": "— Clean, beautiful, classic", "disliked": "— Liked everything."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "They have added a day spa on the property so it added to the luxury of it all. The lobby bar is both classic and hip. The restaurants vary in range of price but it is also in a great location so you are not bound to stay and eat in the restuarants on site. It is across the street from the San Jose Museum of Art and San Jose Tech Museum. GREAT location, GREAT hotel, GREAT stay.", "title": "A step up", "user": "BillSJ", "date": "August 24, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 19298102}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "My wife and I were there for my company's party, and so we got a group rate of $129. For that price, the hotel is excellent. The room was large, with a great view. The bathroom was pretty elaborate. First, there's a little hallway with a makeup counter and mirror. Then the bathroom, which has a tub plus a shower stall. And the toilet has a pocket door for privacy, so two can use the bathroom at the same time.", "title": "Loved the Fairmont in San Jose!!!!!", "user": "lyk2ski", "date": "August 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18990005, "likes": {"liked": "— The large well appointed rooms", "disliked": "— Could use more TV channels"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "We got room service the next morning, which was fine. We lazed around all morning and checked out late.", "title": "More like a glorified Marriott", "user": "LillyPBellevue_WA", "date": "July 28, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 2.0}, "id": 18326806}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "This was my first stay at a Fairmont property and I must say I enjoyed every moment of it. The staff was very helpful and friendly. The hotel itself was immaculate! Very comfortable large rooms, nice beds and linens. The cleaning staff were so gracious to me I could use the entire review space to brag about them.", "title": "Experience San Jose Package", "helpfulness": 1, "user": "logansrun", "date": "July 15, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 17922916, "likes": {"liked": "— The beautiful bathroom, comfy linen and pillows, the lobby, & convenient locaation.", "disliked": "— My son was hoping for chocolates on the pillows & was disappointed-tried to put his own on but we stopped him. Smile."}}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "I stayed at the Fairmont over a long weekend for business. The hotel is lovely and rooms are newly renovated. The beds are very comfortable and the baths are modern and clean. I enjoyed my stay very much but I did notice that the meeting rooms were absolutely freezing while it was difficult to get my hotel room to cool down enough for me (and I am usually cold). I was unimpressed with sushi bar on site but the main lobby has a wonderful array of wines and cocktails. The drink list is 60 pages! For such an upscale hotel with a price tag to go with it I was nonplused to find out that Internet in your hotel room was $14.00 for 24 hours! (yes, they charged me twice.) It seems that cost could be wrapped into the room cost so that it seems complimentary. That said, the hotel and staff are great and the art museum is steps away. Ther are plenty of restaurants within easy walking.", "title": "Upscale hotel and meeting rooms with comfortable beds", "user": "skinnybirch", "date": "April 25, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 128581999}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "When I entered into the lobby, I thought wow what a nice hotel- palacial and European feeling but then when I got to the reception desk I was quite disappointed. The service was very mediocre like why was I bothering them. When I was checking out there was a line of 8 people, it moved relatively quickly but I was regretting not doing self checkout. The rooms are clean but a bit awkward. There arent towel racks where there should be. The shower doesnt have a shelf that holds all travel amenities. And most annoying of all, the lotion was half gone. I will try another place.", "title": "Average..Nice location, nice lobby, service was so mediocre", "user": "SCauwels", "date": "April 23, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 128489009}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Stay there every week on buissness and I must say it is GREAT.. The area around the hotel is super with lots of places to eat. I wish they had cheeper parking.. 26.00 is a bit much..", "title": "WHAT A GREAT HOTEL", "user": "BBMORR", "date": "April 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128180650}, {"rating": 5.0, "title": "How this hotel is not the top ranked in San Jose is beyond me..", "text": "This was the nicest hotel I've stayed at. Ever. I was in town for a conference at a local hospital and upon arrival was greeted by everyone in sight. Check-in was smooth with no issues. My room was on the 17th floor with an excellent view of the mountains. Very large room and bathroom, beds were super comfortable. There is an European bakery attached to the hotel that is AMAZING and reasonably priced. Very close to restaurants and I felt safe walking around the area by myself. If I had to make one complaint, is that the sink in the bathroom was a little slow draining. And that's extremely minor b/c it didn't effect my stay at all. LOVE the Fairmont.", "user": "Katie E", "date": "April 19, 2012", "id": 128167897}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "A few weeks before my stay I joined their Presidnet's Club to get free wireless Internet when I stay. They have this new thing where they email you and you can say you are on your way with an ETA. When you arrive there's no wait at check in they verify your ID and hand you your key card. Great! Our room was very nice on the 12th floor main tower. 2 windows, one faced east - we could see San Jose State campus & hills beyond. The other faced south. Great city views at night. Super quiet. Super clean. Beds were fantastically comfortable. 2 doubles with 4 pillows on each. Spacious room, nice bathroom with separate shower and bath. Love not standing in a bathtub to take a shower. Nice bath products. Whole experience was great. Will be staying again in June. Our room was behind the elevators but they arranged the room so that the wall shared with the elevators was the bathorrm. Then between the bathroom and the bedroom wall was a vanity area so by the time you got to the bedroom there was no noise at all from the elevators.", "title": "Lovely Hotel", "user": "suzie-travels", "date": "April 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128021083}], "location": {"country": "United States", "city": "San Jose"}, "stars": 4, "variance": {"poor": 38, "average": 98, "very good": 269, "terrible": 25, "excellent": 238}, "aka": "The Fairmont San Jose Hotel San Jose", "slim_ranking": 0.0833333333333, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Opened in 1987 in the heart of the city, this five-star, 541-room hotel has become the city's social center."}