{"user_rating": 2.5, "review_count": 214, "name": "The Roberts Mayfair", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Nice older hotel - it appealed to us for it's historic category, although we didn't have a chance to find out the particulars due to our short stay. Our king room was beautiful!! Very nicely appointed with separate sitting room and bedroom - 2 flat screens, and roomy. We were delighted to find that the bedroom window was able to open! Staff was very friendly and even gave us a free ride to the river casino! Outstanding!! Of course, we gave a nice tip to the driver!", "title": "Only a 1-night stay", "helpfulness": 2, "user": "LoveTheOldWest", "date": "June 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131148507}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "Its been several months since I stayed at the Mayfair and I do really hope they are renovating the hotel--especially the public spaces. Its in a great location with great \"bones\" and has the potential to be spectacular. My room was great, spacious and renovated--there were a few details that could be fixed (i.e. cracks in the bathroom walls, too much furniture in the bedroom and uncovered outlets), but I was only there for 2 days so it didn't bother me very much--I was out working most of my time in St. Louis. I will say that the elevators (I think there were 3) were almost never working at the same time. I understand there was a large volume of guests and the hotel is very old, but again, something that makes a big difference when you're on a high floor. I really hope things have changed since my stay because I think this old hotel has a lot of potential.", "title": "old hotel with lots of potential", "helpfulness": 1, "user": "myra405", "date": "May 26, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 130654507}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Stayed there for the Monavie Conference at the Conference Center. Appreciated the close proximity to all we needed. Rooms were eye appealing, were missing faceclothes the 2nd day but young Steve on the night shift made up for any thing that could have gone wrong. The other young man on night shift was great also. steve has a million dollar personality and was more than accommodating to our every need. I will stay there again because of HIS service.", "title": "A Pleasant stay", "helpfulness": 1, "user": "dixiemur", "date": "May 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 130649655}, {"rating": 3.0, "stay_parameters": "Stayed May 2012", "text": "We waited forever to check in and finally got to our room. It was a very nice and modern room with a nice living room. Loved the room. But there were empty beer bottles in there and door was open when we got there. I called down to make sure no one was staying there. The guy said to come down and he would give us another room. So we go back down and wait 10 min in line. Then he acts like", "title": "Rooms aren't consistent", "helpfulness": 2, "user": "eastwood8300", "date": "May 13, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 129858784}, {"rating": 2.0, "title": "old and tired", "text": "He is doing us a favor and gives us another room that is supposedly an upgrade. So we go back up and our new room is this ugly, old fashioned room that was 10 times worse than first room! Obviously our first room had been redone but second one hadn't! Now I wish I had just thrown away someone's empty beer bottles that were in the first room and just stayed there!!", "user": "Sc0ut2", "date": "May 7, 2012", "id": 129505763}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We stayed Aprii 25-29th during the FIRST Robotics World Championship.", "title": "I was worried by the other reviews", "user": "Sue Anne W", "date": "May 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 129250883}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "I was really worried about the mixed reviews I had senn after I booked the room.", "title": "Very close to convention center, but was that ever a wierd room setup!", "helpfulness": 1, "user": "Kemosabo", "date": "May 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 129179075}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Being there for the competition meant tons f kids, going to the convention center by 7:00 getting back late, very tired.", "title": "Pleasant Stay", "user": "Eileen W", "date": "May 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129146790}, {"rating": 1.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "The hotel was gorgeous & wonderful. The desk clerks were great. The hotel had a special room service menu for the competition knowing that tey needed kid (3rd grade - 12th grade) and family friendly food at reasonable prices. We were so close to the front door of the Convention Center! Wehad to do an unbelievable amout of walking from the center to the dome for each match & inside for everything. We walked to 10th & Washington for several restaurants & we got there from a MetroLink stop at 8th & Pine.", "title": "There Are Nicer Halfway Houses", "helpfulness": 2, "user": "Muttley1975", "date": "April 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 128027517}, {"rating": 1.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "We had plenty f towels. The 3rd day they didn't leave any I am sure with 4 kids plus per room they dwere still working on washing. I let the desk know & they showed up right away. We needed extra blankets too. no problem. We did use room service one night for 7 of us when we didn't get back until 8:40 to the room. 20 minutes & with a 2nd call to change our order..", "title": "will never stay here again", "helpfulness": 3, "user": "mike w", "date": "March 28, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 126883881}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Although this grand old hotel is described as “historic” and the lobby is traditionally furnished, the recently renovated guest rooms are contemporary and comfortable, representing the best of both worlds.", "title": "The Best of Both Worlds", "helpfulness": 1, "user": "Richard B", "date": "February 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125106912}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "After reading a few reviews, I was concerned about parking. Actually, the covered parking garage is just a few steps away, is safe and reasonably priced for a downtown location. I’ve traveled to other cities where parking was far more expensive.", "title": "enjoying my stay!", "user": "Jennifer C", "date": "February 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 123979985}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The staff was friendly and helpful. All in all, it was a pleasant experience.", "title": "Better than expected", "helpfulness": 4, "user": "feroccio", "date": "January 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122824670}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "A great couple of days in downtown St. Louis. I love the decor of the rooms. As historic as the lobby was the modern and clean room was quite a pleasant surprise. Huge tvs, fast internet, and really comfortable mattresses. The front desk staff was extremely helpful and pointed me to several excellent downtown eateries. The bell man was a hoot! Next time I travel to the midwest, I'll definitely check back in to the mayfair.", "title": "Awesome Hotel and Staff", "user": "hotdaddy", "date": "January 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122534568}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "I was really concerned because I was assigned this hotel by Priceline and I didn't want to pay for parking. It turns out that the hotel is very nice, room was spacious, clean and comfortable. Very charming if you like older hotels that have been remodeled.", "title": "Great service", "user": "mkw_09", "date": "January 2, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 122423173}, {"rating": 1.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "This hotel is just unfortunate. We stayed two nights and honestly it was two nights too long. I understand that they are doing renovations but none of the problems were related to the renovations. While I had read the reviews I did not find that the elevators to be that bad. They were small but that is the older style that is to be expected. I made it to and from my room safely so I can't complain. However, the room left much to be desired. For the price this room fell very short. The matresses on the two double beds were simply horrible. On one mattress you could actually feel the metal bar and each spring. The TV's worked occasionally and did not have common channels expected at hotels such as ESPN. There is no mini fridge, no vending machines anywhere we could find and the ice machines only worked on 5 different floors....not a problem except there are greater than 16 floors at this hotel. Despite turning the air conditioner as low as it would go our room never got cooler than 75 degrees.", "title": "unfortunate stay", "helpfulness": 1, "user": "romegnome", "date": "March 27, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 126724859}, {"rating": 2.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "I would never stay here again and encourage my fellow tripadvisors to stay elsewhere. Save your money and stay at a Super 8. The bed will probably be more comfortable and you'll have ESPN!", "title": "Not a good experience.", "helpfulness": 2, "user": "MelissaJ404", "date": "March 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 126570195}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Quite simply the worst hotel experience ever. Upon checking in, or trying to check in, they had no record of our reservation. The desk clerk was fantastic and got our problem straightened out. It did take him a while, he was the only one working. He handled the phones, people checking in and out and guest requests. If he had to run up to a guests room, the front dest was left un-manned. If I was rating this one employee, Steve, he would receive 5 stars. We visited with him several times during the first part of our stay. He was extremely pleasant and friendly to talk to and helped us out. He let us use the service elevator as there was no way we were fitting into the guest elevators with our luggage. Steve was top notch. Unfortunately, he was the highlight of our stay. We got to our room and the door was literally falling off the hinge, we had to lift it up to get it to close. No biggie, we can handle that. We got into the room and it was pretty hot. This was mid-March. It took me a while to find the temp controls, but I eventually did and set it to as cold as I could. We headed out for the evening for dinner. Upon returning several hours later, the room was just as hot and stuffy as when we left. We didn't actually complain, just went to bed. Hard to sleep in the heat, it was cooler in the hallways and outside than in the room. We had already unpacked and didn't want to change rooms, so we went on with our week, eventually opening the windows for most of our stay to cool the room. They didn't bother to clean our room the last two days of our stay. No fresh towels, no trash emptied and not beds made. Again, we didn't complain as we always arrived back to our rooms pretty late and didn't want to hassle with calling the front desk and complaining. We came back our last night and found all of our keys deactivated. Had to go back down to get them fixed. They told us not to store them with our cell phones. We hadn't, and two different people were carrying them (nowhere near their cell phones). Really wish I would have read these reviews before booking my hotel. The location was great, but there are several surrounding hotels to pick from, we will never stay here again.", "title": "Great stay with family!", "helpfulness": 1, "user": "Brittany M", "date": "March 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126411774}, {"rating": 1.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "We stayed at the Mayfair last week for a volleyball tournament. The hotel was a little over a block away from the venue, perfect for us. Staff was courteous and pleasant to a fault, and our room (a suite) large and spacious. elevators were quite small, but seemed to be fast so we never had to wait. We especially enjoyed the smiling face of Linda the housekeeper, whose patience with our 2 little ones (1 & 2) was commendable. The hotel was putting the finishing touches on repairs from a sprinkler mishap a week before, but we were not inconvenienced at all. All said, kudos to the staff who made our stay in this beautiful hotel memorable. Our daughters team wasn't bad either!", "title": "Very Disappointed", "user": "Edwin E", "date": "March 19, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 126365467}, {"rating": 2.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "Stayed here as part of a large group for volleyball tournament..First the front desk felt it was acceptable to give away previously booked rooms to others guests..The air did not work, the elevators are a joke, had to call the front desk to request for the room to be cleaned,(in fact the room was not swept during our 3-day stay as we found chips on the floor that were there when we arrived and departed) TV's did not work in several of the rooms our group occupied. Had an encounter with employee by the name of Stephen who was extremely rude and very unprofessional. With the exception of the maintenance worker who worked tirelessly to assist the staff could use a major dose of professional customer service training. I would recommend that you avoid this hotel if at all possible. There is a Drury Inn around the corner that will run circles around this dump!!!!! I will never return and my group has voiced their displeasure with the orgnaization running the event.", "title": "Would have been a good review, but...", "helpfulness": 1, "user": "juliefromkentucky", "date": "March 12, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 126002815}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 59, "average": 39, "very good": 46, "terrible": 50, "excellent": 20}, "aka": "Wyndham Roberts Mayfair", "slim_ranking": 0.723577235772}