{"user_rating": 4.0, "review_count": 16, "name": "The Foundry Hotel", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "This was our second visit to the Foundry, having recently moved to Bendigo. The first time was for lunch & I had salmon patties which were dry and mostly potato with the odd fleck of salmon. Overall unappetising, however, after a comment to the waitress, the meal was quickly changed to whiting fillets which were fine.", "title": "Very ordinary", "helpfulness": 1, "user": "Australians_Abroad", "date": "November 16, 2011", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 3.0, "service": 3.0}, "id": 120653136}, {"rating": 3.0, "title": "One great meal, One not so great", "text": "The second visit was for dinner and again, the overall experience was very ordinary. There were 6 of us, and while I don't usually buy softdrinks, I purchased a jug of lemonade for the table which cost $12 - I consider this a bit over the top for postmix that would cost about $0.50, but maybe this is normal price. I ordered the steak and much like the previous posting it came swimming in sauce, which was pretty bland for a green peppercorn sauce. The steak itself was requested as medium and wasn't even close, being significantly over-cooked to a well-done. I ordered the Banana & Sticky Date pudding with icecream and caramel sauce for dessert and the dessert itself wasn't very moist but ok. What was surprising was the iceream flavour was \"cherry ripe\". Not what I expected as you would normally get vanilla. Let me assure you the flavours do not go together. My wife ended up with Chocolate Mousse with Kahlua sauce plus the cherry ripe ice cream. Not a recommended combination either.", "helpfulness": 4, "user": "fouraussies", "date": "March 9, 2011", "id": 99483143}, {"rating": 5.0, "title": "Best Bistro Meal in a Long Long while", "text": "Other minor things which made the dinner even less enjoyable were - group booking standing around the tables, everyone talking made it very difficult for us to talk amongst ourselves.", "helpfulness": 2, "user": "dave0_1963", "date": "June 26, 2010", "id": 68717395}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "The drinks bar does not accept card payment (either eftpos or credit), and I had to set up a tab (for softdrink). When it comes time to pay, I had to again join the long queue at the food counter.", "title": "Fab!", "helpfulness": 1, "user": "surlamer_10", "date": "May 23, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0}, "id": 65032492}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "Finally paying for the drinks with cash and cashier tried to short change me.", "title": "Delicious. Outstanding service.", "helpfulness": 1, "user": "lollysmum", "date": "January 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "service": 5.0}, "id": 23366220}, {"rating": 5.0, "title": "Foundry Arms Hotel", "text": "If you are anywhere near Bendigo, Golden Square, or Kangaroo Flat and want a cold beer and a sample of country Victoria hospitality make sure you stop at the Foundry Arms Hotel. Located on the just off the main street directly across from Safeway and just down the road from the South Deborah gold mine tour", "helpfulness": 7, "user": "A TripAdvisor user", "date": "April 4, 2004", "id": 1763811}], "location": {"country": "Australia", "continent": "South Pacific", "city": "Bendigo"}, "variance": {"poor": 2, "average": 1, "very good": 1, "terrible": 2, "excellent": 10}, "slim_ranking": 0.612903225806}