{"user_rating": 4.5, "review_count": 365, "name": "The Grand Hotel Tralee", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "I am delighted to review this fantastic hotel, stayed here for Rose of Tralee Festival. I felt obliged to commend the staff of the hotel on their outstanding customer services skills and approachable nature. it was refreshing to deal with such a high level of professionalism carried out in a pleasant and professional manner. On many occassions both myself and partner were awed and highly impressed by their general knowledge, helpfulness and can do attitude. They often went over and above the call of duty and this I thank you for. I will not hesitate to recommend your hotel to potential guests and look forward to returning next year. Front desk, restaurant staff and Lucas the porter were extremely loyal and impressive employees whom should be highly valued for their courteous approach. Location is perfect and very central to everythinh tralee has to offer. pub is busy and food in rest and bar was very impressive. great atmosphere. Will def br going back!!!", "title": "Fantastic hotel, highly recommended", "user": "Grace92", "date": "August 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 77522659}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We were traveling through Ireland and drove into Tralee looking for a place to stay. We stopped at the Grand Hotel and we were amazingly happy with their pricing, friendliness, and especially the room. We were so happy that we decided to stay another night and just do not too much the following day. The manager was especially accommodating.", "title": "Great hotel and friendly management", "user": "rbciao", "date": "August 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77479220}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Although I didn't stay in the Hotel we ate in the restaurant on two consecutive nights and i have to say the staff were brilliant and very efficient. The food was beautiful and i would recommend that if you are in the area you go to the dining room. The bar food must be good as both evenings it was packed with visitors and locals so that is always a good sign. Prices were reasonable and choice was very good.", "title": "Brilliant Food", "user": "CYNDIFAN", "date": "August 17, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0}, "id": 75691187}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Friendly service, Beautiful and luxurious room, located down the street from the museum and rose garden, very relaxing and very reasonnably priced accomodation.", "title": "Amazing", "user": "Linda154943", "date": "July 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69610276}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "Highly recommend the full Irish breakfast, and we also enjyed the prime rib dinner in the Hotel restaurant.", "title": "The Grand Hotel is truly a grand place to stay in Tralee", "user": "patcanputt", "date": "June 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67078045}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "Husband and I stayed at this lovely place in April for 5 nights for leisure and to attend a convention nearby. So glad we did.the welcome was big and genuine from every staff member without exception from reception and waiting staff to the manager Eileen who took time to talk with us.Our flights were cancelled due to volcanic ash and the receptionist was so kind in helping us book trains.We had wonderful food at their restaurant-do eat there -its fantastic and you can have meals in the bar also,better than other place s nearby by far. Its central for shopping and the museum and tourist information and we dis afantastic trip of the ring of Kerry from nearby Killarney. And we got about quite easily from Farranfore airport by local buses so manged without acar which was a treat! Room clean and nice and a very good price ,but it was the attitude of the staff that made it so special for me. We'll be back!", "title": "Beautiful place ,beautiful people ,beautiful food ,beautiful value.", "user": "Jenny503866", "date": "June 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 66893137}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "An excellent hotel all round. Comfortable rooms, helpful attentive staff, superb food.", "title": "If you are in Tralee you SHOULD stay here!", "user": "Sme_Agen", "date": "June 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66538947}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "In the perfect location if you like the centre of town.", "title": "Another Great Stay", "user": "OleMissbanker", "date": "May 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65971483}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Only been to Ireland twice, but stayed here both times. Very friendly staff, good breakfast. Close to city's shops, pubs, Siamsatire, etc. Street parking generally available after business hours.", "title": "Fits the bill on every count", "user": "BazAxminster", "date": "May 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 65371577}, {"rating": 5.0, "stay_parameters": "Stayed May 2010", "text": "My wife & I had a fabulous short break in Tralee staying at the Grand. The service in the hotel was excellent. Nice music in the evenings, superb breakfast. If in the area again will certainly stay at the Grand", "title": "The perfect place for a break", "user": "kenneth_hodge", "date": "May 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64310960}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We are UK based and when we go home to Kerry, our visits alway include a trip to the Grand Hotel in Tralee.", "title": "Exceptional Service", "user": "ColchesterOffice", "date": "March 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 25429625}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "The quality of the food and the way that it is cooked and presented is consistently of a high standard. The menu is alway varied to suit all tastes.", "title": "Great Service/Value", "user": "veramurray", "date": "February 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 24716120}, {"rating": 5.0, "stay_parameters": "Stayed December 2008", "text": "The service is excellent and it would appear the same staff are there for a number of years, which reflects well on the hotel and management.", "title": "This place has crept into our hearts!", "user": "wendyjhenry", "date": "January 20, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23723780, "likes": {"liked": "— The staff were great", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "The Grand is very popular with both locals and tourists alike. Everyone is accomodated very quickly. This is down to the excellant organisation of the manager/manageress. As soon as people are seated they are attended to straightaway by friendly, efficient staff.", "title": "The Grand Hotel Tralee is the Best", "user": "PeteyMountSidney_VA", "date": "November 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 21946680, "likes": {"liked": "— Staff and room"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "We can not wait until are next visit.", "title": "Outstanding Experience", "user": "Higmont", "date": "November 17, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 21941207, "likes": {"liked": "— The Staff", "disliked": "— n/a"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "This hotel was great. It was centrally located and the room although small had all the things you might require. Iron hair dryer etc.", "title": "One of the most friendly hotels I never stayed in", "user": "Waterloomoo", "date": "October 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 47649038}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "However for us it was the friendly staff. No thing was too much trouble, we were doing the Scally Rally and it requires you to complete certain tasks. Like getting photos of certain Irish cuisine. Well while in the middle of the breakfast service the chef and the restaurant staff cooked up things we needed without a word. I have posted some photos of the girls in the hotel who kindly helped us.", "title": "Gave em the answer to my question before I asked.", "user": "jerrymac4112", "date": "October 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47242844}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Well done girls we scored full points.", "title": "Good location, otherwise fine", "user": "Suzanne5", "date": "September 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 41091258}, {"rating": 3.0, "stay_parameters": "Stayed August 2009", "text": "Played golf in the area and stayed 2 nites. Excellent location, great accomidations, food and beverages. Director / staff on top of their game. When I return will eagerly rebook .", "title": "I'll be Back", "user": "Mickadublin", "date": "September 5, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 39832206}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "The location of The Grand is perfect, literally right in the centre of town. Great.", "title": "Good Craic", "user": "Chitowngirl321", "date": "September 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 39682487}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "My wife and I recently went to Ireland and stay in a different spot every day for 5 days. On our 3rd day we stayed in Tralee at The Grand Hotel. We did not have any reservations and they welcomed us without any problems. The Grand has newly renovated rooms that are very appealing and modern, but most important the bed is comfortable and they gave us a room that was quite. They also recommended a very good restaurant that was moderately priced. Eileen Egan the manager chatted with us at night at the attached bar which is very nice. At the door I noticed a view awards that they had won. Just what you think of when you want to have a fine pint in Ireland, classy and warm with nice wood work and a few fireplaces. Also good company to tell your stories to. The best part about the Grand was the breakfast. The best one in Ireland easily and the best pace to stay in Tralee hands down.", "title": "The easy find", "user": "kfish02", "date": "June 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 31663100}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "First class hotel. The staff excellent and exceptionally helpful and friendly. Parking restricted to on street and free at night. However we where allowed to park our vehicles in the hotel delivery area car park at the rear of the building. We where on a bike tour of Ireland and the staff kindly allowed us to secure our bikes within the hotel. They could not have been more helpful.", "title": "Excellent with first class staff andservice", "user": "erganagh", "date": "May 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 29828714}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "My boyfriend and I recently traveled to Ireland. We drove all over the southern coast, staying each night in a different town. We did not make reservations as we wanted to be flexible with our itinerary. We first looked at the Imperial Hotel and were disappointed with the rooms and general decor. The hotel was very old and dark. We then went to the Grand Hotel where we were met by a lovely woman who was very accommodating. She was more than pleased to show the room to us before we booked. The price was cheaper than the Imperial and was cleaner, brighter and the staff was delightful. Breakfast was delicious; the staff was prompt and happy to make changes to dishes to meet our needs. We hope to find ourselves in Ireland again and would absolutely stay at the Grand Hotel again.", "title": "Absolutely lovely hotel with exceptional staff", "helpfulness": 1, "user": "mainedog", "date": "May 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29252224}, {"rating": 5.0, "stay_parameters": "Stayed April 2009", "text": "Mr. & Mrs. Stephen G. Raley", "title": "The Rehearsal Dinner for our Son's wedding was great!", "user": "rehearsal", "date": "April 30, 2009", "detail_rating": {"service": 5.0}, "id": 29092030}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Taneytown, Maryland 21787 U. S. A.", "title": "Check the room and if not suitable get a change", "helpfulness": 1, "user": "Mayo55", "date": "March 21, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 1.0}, "id": 26558277}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We found ourselves in Tralee at the end of a long driving day, and decided to stay at the Grand. It's well and centrally located. A comfortable sleep. Breakfast was comprehensive, well serviced, and delish. We didn't have a problem with noise, but perhaps that was because we were there on a Wednesday.", "title": "Average average average", "helpfulness": 1, "user": "VisitorTraveller", "date": "September 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 80212697}, {"rating": 5.0, "stay_parameters": "Stayed September 2010", "text": "On the downside, there's no parking except on-street, which you have to get up and rush out in the morning to pay for (before 9 am). No elevator, and lots of stairs. Our room directions were...go down the hall, up two flights of stairs, down another hall, through a door, up two more flights of stairs, down another hall. That was a LONG way to carry our bags. Expensive - around $150 for one night. Small room, tired decor, looked like it was also used for storage, as there was an extra foldup bed in the corner, which we didn't ask for or want. No view, the window looked out onto another window.", "title": "Excellent accomodation and service from a top class hotel.", "user": "PresBrayBasketball", "date": "September 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79490388}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "This hotel is only average, definitely not grand, but acceptable for a night or two.", "title": "The Grand Hotel - service at its best!", "user": "sancarlosgolf", "date": "September 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78665836}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "I stayed in The Grand Hotel, Tralee as part of a 22 person group. We were competing in a basketball tournament in Tralee and The Grand Hotel were able to offer us the best value accomodation. The hotel also provided excellent meals for our entire party on our arrival on Friday evening and also in between some of our matches on Saturday afternoon. The Hotel manager, Eileen, and her staff ensured that we enjoyed a hassle free, pleaseant stay in their wonderful hotel. I will definitely be returning again with other groups and I would highly recommend the Hotel to anybody else travelling to Tralee as part of a group.", "title": "The Grand Hotel played a major role in the enjoyment of our trip!", "user": "drdavevet", "date": "September 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78517413}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Great stay at The Grand. The accommodations were wonderful. The food was great. The staff went out of their way to make us feel comfortable. I would highly recommend.", "title": "lovely hotel and staff", "user": "Bittyboo1", "date": "September 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78351400}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "This was the second time we stayed at the Grand. We stayed for one night on a bed breakfast and evening dinner basis. The room was modern clean and really quite. The food for both breakfast and dinner was of a very high standard. However what makes this hotel is it's staff. The most friendliest obliging people I have ever came across. We stayed exactly one year ago to the day and it was only for one evening and when we returned this year the staff all remember us - unbelievable. So I have posted new photos as some of the ladies (not Anne she skipped off on Monday and didn't turn up for the photo shot ha ha ) Grand hotel keep up the good work.", "title": "Friendliest Place I've ever stayed", "user": "Waterloomoo", "date": "October 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85399330}, {"rating": 1.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We stayed here for 1 night and were very glad we hadn't booked for longer. The bed was so hard it was painful and the pillows were so hard we felt as though we could have been sleeping on bricks. There was no window or extractor fan in the bathroom, which meant we had to open the windows in the room after showering. Not a problem if we hadn't been overlooking the kitchen area with an overpowering stench of cooking fat and an extremely loud whirring sound from some sort of machine or cooling fan. So loud in fact that we went to a nearby pharmacy to buy earplugs. Need not have bothered as was worst night's sleep of our lives. On a positive note staff very friendly, with the exception of the woman who served breakfast. We had dinner in the bar and the food was lovely. The location is very convenient. Will NEVER EVER stay here again.", "title": "Poor", "user": "myself987", "date": "October 28, 2010", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 1.0}, "id": 85201506}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We arrived in Tralee and had not booked any accommodation. The Grand Hotel was in the middle of town and looked inviting. As soon as we entered the lobby and saw the big fireplace and the welcoming staff, we knew that this was where we wanted to spend the night. Staff was friendly, going above and beyond. We had dinner in the bar which was excellent and later that night were entertained by live musicians. The rooms were modern, spacious and most important very clean.", "title": "Best place for atmosphere, excellent staff and good food, very central location.", "user": "Kera1", "date": "October 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84580449}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Came across this hotel almost by accident. Cannot say enough good things about it. The staff including the manager just great. Had really good meals in the restaurant and very reasonably priced as were the drinks. Stay again - sure would.", "title": "Absolutely Fabulous", "user": "slwityk", "date": "October 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 82438346}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "Our golf foursome from Ontario, Canada was well received and cared for by the excellent staff, both in the Hotel and adjoining Pub. Good food menu at the Pub. The Grand Hotel is centrally located for our golf days at Tralee, Ballybunion and Dooks Golf Clubs, all within a 30 minute drive. The staff can also prepare you a carry out lunch for the road if required. The Hotel is centrally located and we enjoyed a liesurely walk around town for shopping or sight-seeing. Service was very efficient, the rooms were quite comfortable and have been modernized. In summary, we had a very pleasant stay at the Grand Hotel and would return again.", "title": "Great Value, excellent customer service, centrally located", "user": "Peterpatch65", "date": "September 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 80643927}, {"rating": 4.0, "stay_parameters": "Stayed August 2009", "text": "Staying at the Grand Hotel for nine nights in August me and my party received a very warm welcome from most of the staff. Whatever the time and the subject was as well, the management was always helpful and competent.", "title": "The name captures the spirit!", "user": "mectravel", "date": "September 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 39458588}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "Most of the rooms have been refurbished for about one year while the standard now is more of a four than a three star hotel as it is classified. When booking a single room be sure not to be accommodated in one of the non-refurbished ones.", "title": "Great Irish welcome in a beautifully refurbished town hotel", "user": "60celebration", "date": "August 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37799688}, {"rating": 5.0, "stay_parameters": "Stayed June 2009", "text": "In general the food is of an over-averaged level in terms of quality and preparation. Sometimes one wishes the chef have had the chance to gain some experience abroad. If you get tired of the cooked Irish breakfast, be sure to request an alternative such as cooked meat, cheeses etc. which is more popular with continental guests.", "title": "I've loved this hotel since my first stay: 1997", "user": "DonnaSonoma_CA", "date": "July 13, 2009", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 34661566}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "As the hotel is situated in the very centre of town do not expect to find the quietness of a country-side place. But the Grand is an ideal base for touring entire Co. Kerry while having the opportunity to visit a lot of shops and some nice pubs right next to this charming and traditional hotel as well.", "title": "Great Srvice in a traditional hotel with great pub.", "user": "acyacy", "date": "June 21, 2009", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 32816070}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "The hotel was located in the central area of Tralee and the bars and restaurants were used by many locals which was a good sign. Breakfast and evening meals were voted as excellent for quality and value by the group and catered for celiacs as well. Rooms had been beautifully refurbished and each room had a flat screened TV. We found all staff very friendly and exceptionally helpful - especially the manager. None of the entertainment - singing from the Pikeman Bar could be heard in any of our rooms.", "title": "Great Management and friendly staff=comfortable stay for 4 golfers", "user": "Cullane", "date": "June 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31963977}], "location": {"country": "Ireland", "continent": "Europe"}, "stars": 3, "variance": {"poor": 16, "average": 25, "very good": 94, "terrible": 10, "excellent": 220}, "aka": "Grand Hotel Tralee", "slim_ranking": 0.285714285714, "description": "A very popular spot with both guests and locals in keeping with the ambiance of the hotel it is a traditional style pub. we offer a lively breakfast & Coffee morning our in house French pastry Chef will tempt you with his freshly baked scones Irish Brown Bread Pastries and desserts. Our bar food menu is second to none and offers a wide and extensive choice to cater all tastes. The bar is a lively place to enjoy a pint & a chat at the end of a busy day. We also have a very popular Traditional Irish Music Session every Friday night."}