{"user_rating": 4.5, "review_count": 732, "name": "The Westin Beijing Chaoyang", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We stayed at Westin Chaoyang early February this year (had we known it would be so cold we may have booked later). We had a renewal suite which was more than comfortable and gave us plenty of space to stretch out for our 5 day stay. especially liked thein room massage chair (heaven after traipsing the streets of Beijing sightseeing) Food at the hotel was ok (overpriced and bad service in the main buffet restaurant) but we mainly ate in the club lounge (something we have never done in the past) as we were so tired and it was cold outside.", "title": "A welcome place to return to", "user": "mdemo", "date": "March 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 125839772}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "Service was very efficient, we had booked a 5am wakeup call and didnt answer as assumed it was a recorded wake up alarm, however less than 5 minutes later someone was knocking at our door to ensure we were awake and didn't oversleep, amazing!", "title": "Great value for 5 star quality", "user": "Lucumo21", "date": "March 1, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 125434399}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "we booked our private tours through Beijing Discovery tours which we found to be very efficient and well planned, it is run by an American called Jeff who has lived in Beijing for many years and has a good understanding of what visitors to China want, prices were similar to other tour companies but what made them stand out was the flexibility to produce tours to our exact specifications. would return to Westin and use Jeff's services again.", "title": "Weston at its finest", "user": "Fazzone", "date": "February 27, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 125289688}, {"rating": 2.0, "stay_parameters": "Stayed March 2011", "text": "I always stay at the westin in Beijing whenever in town. It's clean, modern, has great service and excellent facilities. The breakfast buffet is superb. Overall I highly recommend if you need to stay in that part of Beijing ( which I do for work). If you are there for holidays then a more central hotel may near wufujing area may be better, although taxis are so cheap so you can still get into the center outside of peak hour in about 20mins.", "title": "Worst service ever in a hotel", "helpfulness": 2, "user": "JiaqiG", "date": "February 23, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 1.0, "rooms": 5.0}, "id": 125097716}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Overall I highly recommend the westin chaoyang for any business travelers.", "title": "Great hotel", "user": "JennyKiz", "date": "February 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 125078626}, {"rating": 3.0, "title": "Large group & convention hotel", "text": "This is very much a hotel that caters for large groups and conventions - individuals tend to get lost in the vastness of the place. The standards are pretty good, with large bedrooms, with everything you need for a comfortable stay - Nespresso & Filer Coffee Machines, Kettle, complimentary WiFi etc... The restaurant is a vast buffet, where quantity prevails over quality - but it's perfectly acceptable. There is a very good gym and spa and healthy options available on Room Service (nice to see a hotel addressing health in travel). Staff are friendly, but a bit lost and service can be a bit hit and miss. The hotel is right next door to a Subway Station, so has good access to the rest of the city. However the neighbourhood does not offer a great deal. It's fine and efficient for a couple of nights, but steer clear if you like a hotel with personality.", "user": "Globaladventure", "date": "March 27, 2013", "id": 155852293}, {"rating": 2.0, "stay_parameters": "Stayed March 2013", "text": "Just checked in and what a horrible experience. If not that I prepaid the entire 2 nights stay would have left that instant. Being a 5 star hotel in China really does not mean anything if your service and attention is not up to par to 3 star hotels elsewhere in the world. I arrived at the hotel with my business partner where we showed them our prepaid voucher from Agoda for 2 nights. They were able to find my reservation and not my partner which seemed strange and their excuse was his reservation was rejected by the hotel. But they had his infomation in the system as arriving today 3/25 departing 3/27 which is the exact arrival and departure date on our vouchers. Instead of them contacting Agoda to clear the confusion they just stood there with no intention of helping. All this time my partner and I were only assuming they were checking to find out the problem. After 15 mins of us standing there in front of her, I asked what is the situation now, her response was\" oh, didn't you contact Agoda?\" that was it, I asked for the lobby manager who was just standing there I guess daydreaming and not paying us any attention. He came over and suggested we forward him the email confirmation which we offered to do in the first place and the lady never responded back. It was I good thing I speak fluent Chinese otherwise would definitely have a hard time figuring out what to do. Finally, I suggested that they give us the rooms first while they sort it out with Agoda where they finally agreed. Does it take a customer to suggest what to do in situations like this? Shouldn't the hotel take a more proactive approach in this and not have us standing there for 20 mins without telling us what they are doing? This is what one can expect from a 5 star in Beijing under the Starwood brand? For me in the future it will only be Intercontinental or Hilton or Marriott brands only. BTW, There is a Hilton right across the street at half the price I paid here includes breakfast and Internet. The rate I paid 300usd plus 15 percent does not include breakfast let alone internet. Internet is at 90rmb per day equivalent to 15usd. Now come on, for over 300usd per night one would expect free Internet. Stay away from this place. I know I will.", "title": "Awful, Stay Away!", "helpfulness": 1, "user": "cordonbleu99", "date": "March 25, 2013", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 4.0}, "id": 155570703}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "I've stayed here before for business trips and always found it to be comfortable with attentive staff and an excellent chinese restaurant. On my most recent trip I had a corner room which was truly excellent - very large room with equally large bathroom, including the shower cubicle which overlooked the roads below (perhaps not for everyone, but it does make showering a little more interesting). The room was also equipped with an osim foot massager which was an unexpected bonus as well as a bose sound system. We ate in the Zen5es restaurant which was surprisingly quiet, but the food was excellent and the staff very good. The gym is also very good - well equipped with a wide range of cardio and weights machines and also very spacious - in fact overall the hotel is well designed for space. If you want to stay in the Chaoyang district of Beijing then I would highly recommend staying here.", "title": "A great place to stay in Beijing", "user": "nickworld08", "date": "March 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 155388329}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We were lucky to win a prize in a lottery for a weekend stay is this great 5* hotel, the entrance is a little cool and modern, the staff is experienced and very friendly, the rooms are superb and luxury, and we most enjoyed the large buffet brunch also included in out stay, the hotel has only opened 2 years ago and many nice shops and restaurants settled in the large building, it is close to Sanlitun bar street if you are looking for other excitement.", "title": "Westin Hotel Beijing", "user": "Arie B", "date": "March 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155141053}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "Nice hotel, the rooms are spacious and the restaurant have a wide assortment of good quality food.", "title": "A good place to recharge", "helpfulness": 1, "user": "Francois C", "date": "March 15, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 154630601}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "this is a long time coming and i have nothing but good things to say about this hotel. I have been staying in this hotel ever since it opened right after President Bush visited. I would stay there almost every month but when my business stopped in Beijing, I stopped staying since March sadly. It is one of the best hotel I have ever stayed especially in Beijing, and i will always go back and stay if i ever have the opportunity again! Kudos to the hotel and it is the best hotel in China! The staff are fantastic and the lounge is a great place to hang out.", "title": "LONG PRAISES COMING", "user": "paullings", "date": "January 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149742600}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "The service at this hotel is really subpar for a Westin in Asia. At reception, it's very erratic, and the bellboys are not very helpful. All very unusual again for a hotel of this reputed calibre in the region. (For instance, the Westin Chosun is unrivaled in terms of service.)", "title": "Way overrated", "user": "asoloist", "date": "January 14, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 149690648}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The room was a decent size with a king size bed---with a very comfortable mattress. The housecleaning seemed quite good and consistent. Wireless connectivity was not very good; it died a few times in the late evenings when I was trying to work online and manage some conference calls with the US.", "title": "Our best experience", "user": "OrkneygalPenicuik", "date": "January 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148805709}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "The bathroom is a bit cramped, with a separate shower stall, bathroom stall, and a bathtub. But there's very good water pressure, and the bath fills up quickly. The usual amenities are available.", "title": "Comparison 3 Hotels Beijing", "helpfulness": 1, "user": "Travelhabits", "date": "January 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 148578452}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "Despite many claims, the gym is not impressive. First of all, they keep the temperature WAY too high so that you start perspiring even before you work out. The treadmills are clunkers, and the free weights selection is very very poor. They have a lot of machines, but they don't seem to offer much in variety. There is a pool as well.", "title": "nice place", "user": "RonHBristolUK", "date": "December 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 148355523}, {"rating": 5.0, "stay_parameters": "Stayed November 2012", "text": "Outstanding restaurant and service", "title": "Very good option in Beijing", "user": "Rogerio N", "date": "March 3, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 153604267}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Staff well trained and prepared ti assist international travelers", "title": "Best of the 5 Hotels I have tried in Beijing so far", "user": "JoeGnsx", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153105948}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Hi have being there several times and for sure I can see they keep the same high quality standards that is something hard to keep.", "title": "One of the best business hotels in Beijing", "helpfulness": 1, "user": "Hau C", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 153082087}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "The Westin in Beijing has some of the best service I have received anywhere. The food in the restaurant also keeps me coming back to this place over several of the other good choices in the area (I like it better than the JW.....) THe service in the restaurant is also most excellent as is the food--best hotel food I have had in Beijing--5 place I've stayed. The rooms are better than they need to be--luxury and very clean--can't say enough about how good this place is.", "title": "Great service and room", "user": "RayC888", "date": "February 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 151351461}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Westin Chaoyang is a business hotel located in the embassy area in Beijing by the northeast third ring. It's also within walking distance to the trendy night life of Sanlitun (two subway stations away). A subway station (line 10) locates right by the building that allows you to go to CBD (direct) or all other important business and tourist attractions with transfers. In this city with crazy traffic, being able to take subway is a nice alternative to save time even though the hotel is conveniently located.", "title": "Best hotel in Chaoyang district", "user": "Javier Clemente E", "date": "February 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151227704}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "On a short business stayover, I enjoyed exceptionally frindly service throughout the hotel from arrival to departure. My room was average size, well laid our, functional and clean.", "title": "Good Hotel, great lacation, room for improvement", "user": "Hongkon", "date": "January 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 151130818}, {"rating": 1.0, "stay_parameters": "Stayed January 2013", "text": "It maybe my very personal preference, but I do \"hate\" beds with thick heavy bedding tucked under the mattrass so tightly that it takes a major effort to undo it enough enjoy \"free movement\" under the covers, and get some air only to have the various layers all messed up.", "title": "A really bad experience - feels like being treated as a second class citizen", "user": "ZT31", "date": "January 24, 2013", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 150482802}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Added to that is a very high heat setting, (apprently very common in chinese winter) which takes very long to adjust. Therefore, the sleep quality was quite poor. Being a light sleeper, I also found the sound insulation relatively poor. Both, slamming doors of neighbouring rooms and traffic noise are audible throughout the night.", "title": "New and luxurious hotel", "user": "Ulrich B", "date": "January 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 150481094}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "As the hotel is in a perfect location if you are busy in the Chaoyang district, by requesting a quiet room and lighter bedding, these issues may easily be resolved.", "title": "Excellent stay", "user": "greenie-esplanade", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150456811}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Another minor point is the fact that, hotel services are only displayed on te TV, no printed directory was available. Bascally that's ok, a number of services however, such as in-room movies were \"under maintenance\" and contacting the relevant service departments on the high tech, touch screen telphone system is not an easy task. Finally on the drawbacks, the hours of the wonderful spa for in-room and at the spa services are, in my view, too short for busy travellers to enjoy.", "title": "Outstanding hotel with excellent service and good food", "user": "Orso52", "date": "January 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150077107}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "The Westin Chaoyang is conveniently located in CBD Beijing, has exceptional facilities and great service. The gym, pool and spa area are great. There is also a metro station directly in front of the hotel and, given the traffic in Beijing these days, this is a great convenience. I highly recommend this hotel to anyone traveling on business or holiday in Beijing.", "title": "Excellent choice", "user": "Jay M", "date": "February 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 124726937}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "I have stayed here several times, it so far is my regular hotel in Beijing. It is badly 30-minutes from the airport (quicker in good traffic), close to a diplomatic enclave with a very expat supermarket and some good restaurants (e.g., Samadhi, a terrific vegetarian restaurant), close enough to Sanlitun, and right on top of a station on Metro Line 10 which gets me to my office in Guomao conveniently. As a platinum member I usually get a smooth upgrade - a recent stay was at the corner room 1919 - and staff is pleasant enough.", "title": "Good, could be better", "user": "Mustihaveone", "date": "February 17, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 124716401}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "The reason I almost gave this 3-stars and definitely cannot give it 5-stars is the \"software\": there is room to improve. E.g., on my recent stay I arrived close to midnight and there was one person at check-in who spent 5 minutes on some idiot guests and their direction needs - she should have sent them to the concierge and attended to me. Next, 5 people lined up behind me and for some reason my room was taking longer to allocate or prepare - she gave me one and then changed my room and gave me another. I asked the girl to call a colleague to handle the long line and she tried, and the person behind me who went to the newly-opened counter got his keys and left BEFORE I was done. It was all I could do not to blow my gasket. These little things should come automatically. Ordering room service can be a painful experience having to repeat words like \"juice\" or spell out \"salt\" and \"pepper\" to get them to understand. Yes, I know, I could do the right thing and learn Mandarin but I pick an international chain and pay up for a reason, right? The breakfast at the executive lounge is great enough, but similarly, the service can be patchy and you may never get asked if you want coffee or even if you were, may not get served for a long time. Don't get me wrong, these are mostly annoyances, rather than issues, but I am writing to hopefully provide some constructive criticism.", "title": "Quite good. Even for the surroundings. Not to die for.", "user": "julesher", "date": "February 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124571259}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "It is simple things like these that the hotel needs to work on to improve a well-located, new, pleasant and well-connected hotel to its true potential.", "title": "pretty good but not great", "helpfulness": 1, "user": "JenAndAndrew", "date": "February 12, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 124472721}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "(If you want to get a sense for what exceptional, cosmopolitan service in China is, you should check out the Peninsula in Shanghai - now *that* is a hotel everyone else can learn from.(", "title": "Luxury Hotel, but culturally sterile", "user": "Joe L", "date": "February 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 124311491}, {"rating": 2.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I was staying at the Westin for one nig for business. The room was lovely but the service really let it down.", "title": "Nice room but terrible service", "user": "HelinskiSydney", "date": "March 15, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 126130927}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I had a tea in my room in the afternoon and a shower, when I returned in the evening, I found that the bed had been turned down and curtains drawn, but the dirty cups were still left on the desk and the tea bags and cups were not replaced, or even cleared away. The towels in the bathroom was similarly left in the bath and not replaced.", "title": "one of the best", "user": "reuvenam", "date": "March 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126037194}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "The concierge did not speak English well and when we asked him to call a taxi for us, showing him the address of the place we wanted to go to (in Sanlitun, which is a famous expatriate area and 10 mins walk away) and a google map print out of how to get there, he either didn't know where it was, or didn't explain to the taxi driver where to go, and we got dumped on the side of the street in a completely different place.", "title": "Best hotel in Beijing", "user": "Cyrusdgreat", "date": "March 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125971716}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "When we stored our luggage, we were given a wrong tag, so when we went back to the hotel to pick up our cases, the bell boy refused to release our bags, even though they made the mistake and we shows them photo IDs which matched the luggage tags on our cases, making us almost missing our flights.", "title": "Very Nice Hotel", "user": "Georgia F", "date": "March 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 125884341}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "In addition, the food in the restaurant was incredibly expensive and of mini mini size. The transfers to the airport was also very expensive by Beijing 5 star hotel standards.", "title": "Consistent with Westin ( a good thing)", "user": "Shortz", "date": "March 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 125875136}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I came to Beijing for business, but would come back just to stay in this hotel and relax. The facilities including the gym and indoor pool are excellent. The breakfast buffet is one of the best I have ever seen in a hotel. The rooms were quite nice and my room included the use of the club level. The club level happy hour gave a great opportunity to relax and enjoy a fairly ample section of Asian and western snacks. The concierge was always very helpful and can print a personalized taxi card for your destination. The hotel is super convenient to the airport express train and not too far from the famous Beijing sites. Highly recommended.", "title": "Now this is a five-star hotel!", "user": "badwaiter", "date": "March 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126609230}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "This is one of the great hotels ever stayed and very easily connected to the city by rail.", "title": "Great hotel", "helpfulness": 1, "user": "AB_11101", "date": "March 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126535701}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "The rooms are modern and are with world most comfortable beds. Internet service was flawless and Housekeeping was great.", "title": "Absolutely The Best Choice In Beijing", "helpfulness": 3, "user": "shanghaiist", "date": "March 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 126532896}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Food in all the restaurants is good especially at \"Grange\" and the Chinese restaurant. The Sunday brunch is most lavish ever seen; there is vast variety of food and drink served. It is value for money.", "title": "Great Hotel, Service, and OK Location.", "user": "global84", "date": "March 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 126395488}, {"rating": 4.0, "stay_parameters": "Stayed March 2012", "text": "The location is great, it is surrounded by few malls thus fulfills your shopping needs.", "title": "Decent hotel for business travel, the gym was the highlight for me", "user": "anilegna", "date": "March 15, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 126144947}], "location": {"country": "China", "continent": "Asia"}, "stars": 5, "variance": {"poor": 15, "average": 43, "very good": 249, "terrible": 8, "excellent": 417}, "aka": "The Westin Beijing Chaoyang Hotel", "slim_ranking": 0.00838788870704, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "The Westin Beijing Chaoyang is ideally located in the heart of Beijing and only a 25-minute journey from Beijing Capital International Airport. Commercial and shopping centres are also nearby. Hotel features 550 guest rooms and suites, Westin Executive Club facilities, offers 8 entertainment and dining options, 11 meeting rooms for events of various sizes and the signature Heavenly Spa."}