{"user_rating": 4.0, "review_count": 128, "name": "The Sungu Resort & Spa", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Waka Namya is located on the back of Blanco Museum. I didn't expect to find such a beautiful place in the middle of the mid-range budgeted bungalows up there.", "title": "well rested :)", "user": "orang-gunung", "date": "January 12, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 53247271}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "Very serene, we shared the semi-private swimming pool with the other 3 rooms, but they didn't seem to use the pool that often. Staff is friendly. The walk in shower is very nice. My partner was very excited to finally found a shower where he can just stand there as he was quite tall.", "title": "Waka Namya - Loved it", "user": "comocj", "date": "October 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 46692362}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "I have no major complaints about this small, charming hotel. The rooms/villas are arranged around charming small courtyards and pools. The staff is very friendly and helpful and it's nice get away from those big box hotels.", "title": "nice place, but disappointing nonetheless", "user": "esheng", "date": "May 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 2.0}, "id": 64475003}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "That said, this place suffers from one major problem - location. This is a small place, located away from the main drag. You don't really want to hang out at the hotel all day because it's very small and there's only one restaurant. But there's not much to do or see around the hotel either. There's no beautiful countryside and there isn't much in the way of shops nearby either - you have to take the hotel shuttle to the town, which is gross. There's been A LOT of development in Ubud in recent years. There is very little rice paddy at this point and just a lot of villas, hotels, shops, hawkers and TRAFFIC. So unless you're staying at a big resort, it's hard to get away from all the development and noise. Our first room was close to the street and we were awoken by roosters from the vendor across the street every morning at dawn. We switched to a more expensive villa which solved the problem, but still, hours of sleep lost. Next time I go to Bali, I'm staying at the beach.", "title": "Peace & Quiet - A Complete Relaxation !", "user": "Mike_Wong75", "date": "April 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 61749319}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The location of the hotel is perfect, not too far from the crowded Ubud central yet peaceful & quiet hidden in Jl. Raya Penestanan next to paddy fields. The staffs are friendly, polite and helpful. We arrived during a heavy downpour, the hotel staffs quickly sheltered us from getting wet with umbrellas before we got out from our car.", "title": "typical balinese", "user": "poppybognor", "date": "April 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 60161289}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The room we stayed was a single storey banglo unit with only bedroom and bathroom. We love the bathroom the most as it was the most romantic place for us to spend our private time together. The roofless shower area enables us to enjoy the sunny blue sky or starry night during shower. The floor with a sinked tub is unique and big enough for a soaking couple, but the downside is the slippery tiles. The mosquito net hung up makes the bed setting looks more romantic for couple.", "title": "Quiet, comfortable, great staff", "user": "Pippononlosa", "date": "March 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 59950146}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "The semi-private pools filled with clean chlorine free water was enjoyable. The breakfast and afternoon tea were great, especially the freshly bake pastries served for our breakfast. The only complaint is the long wait for the food to be served...but worth it since the food is yummy! The paddy field tracking was a wonderful experience with friendly and well English spoken guide, Ketut, explaining all details about paddy plantation in Ubud. Best of all is the free shuttle service to and from Ubud town by the hotel whenever you need it, a service which is worth 5-star.", "title": "Peace and Quiet in Bali", "user": "Vipars", "date": "February 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 56828069}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "My wife and I stayed there for one night .", "title": "Many promises but failed to do for customers", "user": "enjoylife154", "date": "May 7, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 29501589}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "product: small, but well-decorated in Balinese-contemporary style. Villa styles with sharing pool. Room is Deluxe Lanai , not so big, with open air bathroom, not so useful for us . felt like we were sleeping in the country side cottage. it was so silent that we could not hear anything but our own voices.", "title": "Quaint, Beautiful Hotel", "user": "diveaar", "date": "December 15, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 22760859, "likes": {"liked": "— Atmosphere, excellent service, private pool, rates, atmosphere, comfort", "disliked": "— Nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "Price: Abit overated, 165$/night . We could get one deluxe room in Conrad hotel in Bangkok!with this price. Pls consider carefully, ask for discount.", "title": "Worst Hotel we have ever stayed in", "user": "nannyhog", "date": "September 29, 2008", "detail_rating": {"cleanliness": 1.0, "front_desk": 1.0, "location": 1.0, "value": 1.0, "rooms": 1.0}, "id": 20460038, "likes": {"liked": "— Leaving the hotel", "disliked": "— Cleanliness & ambience"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Place: Silent, good for privacy-lovers, but abit far off from the town .if you like to walk around the cities, and have small budget for taxi, this could be tiring.", "title": "Over-rated and overpriced", "user": "Jacqueline D", "date": "July 24, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 18202618, "likes": {"liked": "— Staff constantly bugging you"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Promotion: Nothing special. I was abit dissapointed that they didn't set honeymoon as stated in the e-mail to me and no Birthday cake as they promised on my arrival. Nothing really. But I don't take it seriously. I wanna tell the hotel not to promise anything if you are not sure you can do it for customers.", "title": "Wonderful", "user": "ElaineCE", "date": "May 4, 2008", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 15629328, "likes": {"liked": "— Outdoor bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "This hotel was the perfect place to stay in Ubud. We stayed in a bungalow, upstairs was a king sized bed and downstairs another king size bed which my children shared. We all loved the out door bathroom. The staff were so friendly and helpful.They have a mini bus which they will drive you into Ubud in. Breakfast was great and you could upgrade at a small cost. We really loved the afternoon tea. Can't wait to go back again.", "title": "Lovely and relaxing", "user": "lidfam", "date": "September 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 41136053}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Good, clean hotel. Ideal for quiet traveller, looking for Indonesian village experience.", "title": "Ubud - Waka Package", "user": "CurveBar", "date": "July 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 34599650}], "location": {"country": "Indonesia", "continent": "Asia"}, "stars": 3.5, "variance": {"poor": 8, "average": 12, "very good": 58, "terrible": 1, "excellent": 49}, "aka": "Waka Namya Hotel", "slim_ranking": 0.464285714286, "description": "With choices of accommodations in Ubud: villas, private villas, resorts and hotels, the Sungu Resort & Spa is no new player. Formerly known as Waka Namya Resort & Spa Ubud, this hotel and resort has re-invented itself, and therefore upgraded many of its services and facilities to cater for its guests - the satisfied repeaters and the new ones seeking an alternatives of Ubud Resort or Ubud Hotel. Come and stay with us - Be a part of supreme, serene and sacred experiences.The Sungu Resort - the haven on the hill, within walking distance to the famed Antonio Blanco Museum, is nearby the artist village of Penestanan and is a short drive from the Rudana Gallery, many Ubud Art Museums & Cultural Centre and the downtown of Ubud. The Sungu Resort is serene and relaxing with welcoming friendly staff and management team who are always at your service. The Renovation has been done properly, To be in full operation on 1 July 2013, the resort is keen to await your stay with us with a full rejuvenating spa programs, children programs and creative art programs. Relax, rejuvenate, and rediscover yourself in a newly refurbished Resort, The Sungu Resort. This newly reborn Resort, formerly known as Waka Namya Resort, boosts new improved facilities such as New Duplex Villa Sungu ideal for 2 Adults and 3 Children. Another addition is the 2 Bed Room- Pool Villa Sungu also ideal for 2 Adults and 3 children. 2 Bed Room - Pool Villa SunguThis is a two storey-traditional Balinese style villa with amenities such as top floor is a big sofa bed in the queen size bedroom with, TV cable for kids, air conditioning. And in down stairs find a queen size bedroom, shared huge bathroom, open shower, bathtub with complete amenities such as a hairdryer, large fridge, mini bar and a telephone. This Balinese room is decorated with local art work, whilst in the outside terrace you can find a private swimming pool, beautiful tropical garden, ideal for 2 adults and 3 children; or, if you would prefer, 4 adults maximum. 2 Bed Room - Pool Villa Sungu is an excellent choice for your family. Each of the villas has an outdoor swimming pool decorated with green stone - a true wonderful appeal for a swim for adults and children. Have a swim and regain your stamina and wellness with the healthy sea salt treated pool. The Sungu Resort - Unique place to stay - feels like home"}