{"review_count": 30, "slim_ranking": 10.0, "name": "The Old Mill Hotel Restaurant", "reviews": [{"rating": 2.0, "stay_parameters": "Visited March 2013", "text": "I was taken to the mill by my parents and a friend for my birthday, a cake was to be brought in at the end of the meal while coffee was served, sadly the whole evening was a catalogue of mistakes from beginning to end, I was asked if I wanted ice with my drink, I said no.....it arrived with ice, my mother repeated her request for the meal, dessert, cheese and biscuits ending with the cake and coffee, the meal arrived with a delay of almost ten minutes between the meat and the veg arriving, veg and chips were cold, otherwise okay, while waiting for the dessert menu the cake was brought out! We repeated the request of the cake coming out at the end of the meal, we were told the knew nothing about it and then ignored, no dessert menu, no cheese and biscuits, no coffee!!!", "title": "Family birthday, completely ruined?,", "user": "crackerjack1995", "date": "March 1, 2013", "detail_rating": {"value": 2.0, "service": 1.0}, "id": 153476503}, {"rating": 4.0, "stay_parameters": "Visited February 2013", "text": "We made the decision to leave and have coffee at home, while trying to pay, two of the staff then walked away again, eventually the third person took the money.", "title": "Very nice", "user": "brooksbjcheshire", "date": "February 26, 2013", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 153224423}, {"rating": 3.0, "stay_parameters": "Visited December 2012", "text": "I would seriously reconsider taking anyone for a family occasion here if you want to enjoy your event!", "title": "Needs tweaking in a few places", "user": "Tourerbycar", "date": "December 20, 2012", "detail_rating": {"value": 3.0, "service": 3.0}, "id": 147770894}, {"rating": 5.0, "stay_parameters": "Visited December 2012", "text": "First visit - Had a lovely meal at the old mill was a bit reluctant to go after reading some of the reviews on here but thought make my own opinions - glad I did. My hubby had garlic stir fry lamb and chips from special board and with salad - very good food was hot and nicely presented. I had steak and mushroom pudding with chips and veg excellent - the lady that served us was very nice, we sat by the log fire and was very nice. Just one very very small negative I would prefer my food served on a plate and not in a dish but that didn't take away how nice the food was. Will definatly go again.", "title": "Fantastic little country pub great food and drink", "user": "Adam f", "date": "December 9, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 147049557}, {"rating": 2.0, "stay_parameters": "Visited November 2012", "text": "The two of us dined recently and we both ordered the haddock and chips. The menu is pretty standard pub grub with a few \"specials\" that aren't really exciting enough to tempt foodies like us.", "title": "Family Birthday disaster!", "helpfulness": 1, "user": "Donkstar", "date": "November 3, 2012", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 144373924}, {"rating": 5.0, "stay_parameters": "Visited April 2013", "text": "This is the 4th visit to the Old Mill Restaurant - an excellent menu with efficient friendly service. And each time the food has been oustanding, both in quality and value. Highly recommended (and the farm shop next door is excellent too!)", "title": "Great Food", "user": "dylan3spot", "date": "April 30, 2013", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 159280619}, {"rating": 5.0, "stay_parameters": "Visited January 2013", "text": "We went to the Old mill whilst passing by chance through Alsager and will definately be going back. It looks like your traditional old pub, lovely and cosy but offers a fantastic non pub grub style menu!", "title": "Lovely country pub with a surprisingly exciting menu!", "user": "Torroxcica", "date": "April 14, 2013", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 157705201}, {"rating": 4.0, "stay_parameters": "Visited April 2013", "text": "My boyfriend is a very fussy eater and they couldn't do enough to accommodate us, and even changed the sauce on my salmon with no qualms as I said I preferred creamy sauces.", "title": "Picturesque Setting - Lovely Bar", "user": "Alberta111", "date": "April 8, 2013", "detail_rating": {"value": 3.0, "service": 4.0}, "id": 156982489}, {"rating": 1.0, "stay_parameters": "Visited March 2013", "text": "Overall we had a brilliant meal with excellent service, can't wait to go back.", "title": "Terrible", "user": "DLP777", "date": "March 22, 2013", "detail_rating": {"value": 2.0, "service": 3.0}, "id": 155306772}, {"rating": 5.0, "stay_parameters": "Visited September 2012", "text": "The Old Mill is a traditional hotel and restaurant in Alsager, Cheshire. It is set in a semi rural location surrounded by farming fields and next to a mill pond. There are two entrances into the property but most people enter from the top doors after parking the car on the large car park below.", "title": "A Great Place to Dine", "user": "carteresca", "date": "March 14, 2013", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 154529926}, {"rating": 2.0, "stay_parameters": "Visited June 2013", "text": "I was taken to this restaurant along with my wife on fathers day by my son and daughter in law.", "title": "Could Do A Lot Better", "helpfulness": 1, "user": "G04it", "date": "June 24, 2013", "detail_rating": {"value": 3.0, "service": 2.0}, "id": 165039994}, {"rating": 1.0, "stay_parameters": "Visited June 2013", "text": "The building is situated at the end of a private drive opposite a pond. There is ample parking and outdoor seating and decking areas.", "title": "Have something to eat before you go. Terrible waiting time", "helpfulness": 2, "user": "CabhappyStokeonTrent", "date": "June 18, 2013", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 164412496}, {"rating": 4.0, "stay_parameters": "Visited April 2013", "text": "On entering the restaurant there was no one at the bar. After about five minutes we were eventually asked by a young waitress's if we would like to order a drink. We asked if we could order at the table and were shown to our seats, after she had shown us the specials board.", "title": "Very nice food.", "user": "pwllgmm", "date": "June 18, 2013", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 164372084}, {"rating": 2.0, "stay_parameters": "Visited June 2013", "text": "We were given the menus and then left for approximately 15 minutes before we decided to fetch our own drinks. My son asked for an orange juice and was served an orange squash which we returned, only to be told that we should have made it clear what we wanted. It's obvious the bar staff don't know the difference between juice and squash.", "title": "It lacks a good restaurant manger", "user": "Kris G", "date": "June 17, 2013", "detail_rating": {"value": 3.0}, "id": 164268977}, {"rating": 3.0, "stay_parameters": "Visited May 2013", "text": "A mature surly waitress eventually arrived to take our order but couldn't be bothered to take the menus away. I placed these together on the corner of the table to be collected later.", "title": "Service lets the place down", "user": "Mrs_N_Leeds", "date": "May 16, 2013", "detail_rating": {"value": 3.0, "service": 2.0}, "id": 160922804}, {"rating": 1.0, "stay_parameters": "Visited September 2012", "text": "Visited at lunch today with my 92 year old Nana for a carvery meal, the serving staff were lovely but the food was cold, chewey and very unpleasant. I eat out often and in a wide range of resteraunts and pubs but I have never had as poor an eating experience as I have had at the old mill today.", "title": "Polite staff- terrible food. Never again!", "user": "Alan C", "date": "September 23, 2012", "detail_rating": {"value": 1.0, "service": 4.0}, "id": 141028990}, {"rating": 4.0, "title": "Good food at reasonable prices", "text": "I bought my concerned to the manager and whilst he was very confrontational we did get a full refund.", "user": "Pjamesmorgan", "date": "September 16, 2012", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 140429042}, {"rating": 4.0, "stay_parameters": "Visited August 2012", "text": "Visited today with my dad. He had the fish and chips and I had the Mill burger. Portions were generous and the food was well cooked. Service was friendly and the ambiance welcoming.", "title": "really good food", "user": "rhodara", "date": "August 4, 2012", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 136234855}, {"rating": 3.0, "title": "lunchtime meal", "text": "We had 2 meals here: dinner and breakfast. The dinner was great! We had chicken with cheese topping and a vegeterian dish (Veggie Stover) was great. The coffee is really good too ! A very wecoming, warm pub atmosphere.", "user": "Peter H", "date": "July 30, 2012", "id": 135795589}, {"rating": 5.0, "title": "Just brilliant quality food all round!", "text": "service was quite slow but food selection was good and well cooked. Pleasant atmosphere and friendly staff.", "user": "Sonnyontheroad", "date": "June 1, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 131090489}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 6, "average": 6, "very good": 8, "terrible": 4, "excellent": 6}}