{"user_rating": 4.5, "review_count": 74, "name": "The Glass House B&B", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We stayed in the Garden room for two nights. Great location with easy walk to downtown Jasper. Nice, clean and comfortable room with private bathroom. You do not get a key to your room, so it remains unlocked while you are out - this was not a problem for us but something to be aware of. Breakfast was good but not the most nutritionally balanced - would be nice to add a boiled egg or something for some protein. Hosts were good, friendly and informative but gave us our privacy. We found this to be a good value for Jasper in peak season.", "title": "good B&B in Jasper", "user": "sloach", "date": "August 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 170623939}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We stayed at this wonderful B&B for 3 nights this July. We had the downstairs room, which is nice and spacious, tastfully decorated and smells of cleanliness. Taking one's shoes off at the entrance, Japanese style, is one more way the Fentons keep this B&B sparkling clean. The location is excellent and the highlight of the stay is of course the wonderful breakfast - every day with different placemats and napkins, a delicious fruit salad and wonderfully aromatic home-made breads and cakes which we then packed and nibbled on for the rest of the day. The Fentons are amazing hosts, who share their knowledge and experiences with their guests. In winter they travel to Ruanda to do educational work and in summer they educate their guests about the flora, fauna and trails around Jasper.", "title": "From charity work in Africa to home-made muffins - it's all in The Glass House", "user": "SaraJerusalem", "date": "July 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168610583}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "This is without a doubt one of the nicest B&Bs we've stayed in. Highly and warmly recommended.", "title": "First Visit To Jasper & We Will Be Back", "user": "Carol W", "date": "July 14, 2013", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "service": 5.0}, "id": 167585165}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Luv the hospitable & helpful hosts, luv the location, luv the decor and especially the cleanliness, luv the gardens and luv, luv, luv the continental breakfasts with fresh fruit, yogurt, homemade breads, muffins & scones. We hope to be back:-)", "title": "A Cosy and Comfortable B & B", "user": "Vivienne S", "date": "July 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 166201830}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Within walking distance of town,it was good after a long drive to leave the car and take a stroll around town. We stayed in the garden room which was comfortable with a nice en-suite bathroom. The breakfasts were a tasty selection of home baking with a different variety everyday, along with fruit juices and tea and coffee, and a brown paper bag available to take the leftovers with us for lunch. A great place to stay in Jasper and very good value.", "title": "Great base for exploring the surrounding area. Unbeatable Value.", "user": "ANGELA M", "date": "July 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 166136394}], "location": {"country": "Canada"}, "variance": {"poor": 2, "average": 5, "very good": 17, "terrible": 0, "excellent": 50}, "aka": "The Glass House Hotel", "slim_ranking": 0.0909090909091}