{"user_rating": 4.5, "review_count": 533, "name": "The Kapalua Villas", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "I stayed at the Kapalua Villas in November of 2005 for 3 nights. I have nothing but postive comments to make about a place like this. From the check-in process, to the rooms, to the service, the place is top notch. We booked a golf villa for 200.00 a night. Upon check-in we asked if we could be upgraded to a room with a nice view. Although still in the golf complex we recieved a room a with a great view of the ocean. Our jaws dropped when we entered the villa . It was bigger then our condo at home, with 2 huge bathrooms and a seperate kitchen and living area. Very clean as well. The patio/balcony was the size of most hotel rooms and offers spectacular views of not only the ocean, but also the mountain side. We ate breakfast and bought groceries at the Honoloa general store, which has great prices and a perfect selection of supplies for a short trip. One of the best features of the Villas is that you have access to the Ritz Carlton and Kapaula Bay Hotels as well. You can charge to your room at both of those hotels. They also allow use of the pools and other facilities. This was perfect for a three day trip because we spent a little time on each resort when we were there. Check out the snorkling on Kapalua Bay Beach, it is among the best in the world. The Kapaula Villas are highly recd. to people of all interests. One potential drawback is that Kapalua does recieve more rain and clouds then areas to the south. But the weather was perfect when we were there.", "title": "The Villas are simply great.", "helpfulness": 21, "user": "icem2829", "date": "January 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4349019}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "My wife and I recently spent a fantastic week in a one bedroom oceanfront Kapalua Bay villa (unit #21B3), rented through VRBO. It offered a commanding view of the ocean, Molokai, both the Bay and Plantation golf courses, and the west Maui mountains. We saw incredible sunrises from bed every morning.", "title": "We Love Kapalua!", "helpfulness": 33, "user": "Miney", "date": "January 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4329487}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "This specific unit was 2-story with a lanai outside both the living (lower) and bedroom (upper level). It had updated furniture and a newer, well equipped kitchen. The bed was huge and very comfortable. The only real weakness was the bathroom... while serviceable it was not updated (25+ years old I think) and would have benefited from new fixtures and better lighting. Also, there was no A/C, but strong trade winds kept the unit relatively cool.", "title": "Great place for family vacation", "helpfulness": 10, "user": "nzhang94404", "date": "January 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4327214}, {"rating": 5.0, "title": "Villas were great!", "text": "Oneloa Bay was a minute's walk from our front door. Beautiful to look at and nice to stroll, but IMO not a good snorkeling or swimming beach thanks to wind and surf conditions. It was only a short 7 minute walk to Kapalua Bay, where the sunning, swimming and snorkeling is fabulous. Several other great snorkeling beaches were nearby as well. A very nice swimming pool was just a 100 or so feet away.", "helpfulness": 12, "user": "KarenKearney", "date": "December 5, 2005", "id": 4164256}, {"rating": 4.0, "title": "Depends on the Unit--Stay away from Villa 20 G5", "text": "With several wonderful restaurants on the property, plus Kaanapali and Lahaina only a 15 minute drive away, there are countless dining (and shopping) alternatives.", "helpfulness": 21, "user": "A TripAdvisor user", "date": "December 1, 2005", "id": 4157437}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "Stayed in an ocean-front for $270-ish (G27-3) and it was the best bargain of the trip. Two-story condo... gigantic for couples, nicely furnished and spectacular views... oh my goodness... from the Master Bedroom, you sit up in the morning and see a panorama (Photo #1) of cliffs, ocean, even turtles swimming, just across from 20ft of well-manicured grass (Photo #2). We also stayed at other Hotels in Maui... and for the price and the amount of room you get with the views you get, this was a steal!", "title": "Incredible stay", "helpfulness": 10, "user": "lake_merritt", "date": "August 26, 2005", "detail_rating": {"cleanliness": 2.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3809928}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "The only negatives: The clean staff didn't seem to do a *great* job... dust on the floor felt a tad bit dirty, and the covers seemed a little dusty. Also, the front desk confirmed that getting high-speed internet access in the villa \"shouldn't be a problem\" when i made the reservation AND when i signed in... of course, when I called about how to access it from the room, we were then told quite emphatically that is wasn't available in this villa. Kind of annoying.", "title": "We were upgraded to a villa and it was amazing", "helpfulness": 3, "user": "choudie", "date": "August 25, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 3807412}, {"rating": 5.0, "title": "terrific room and view", "text": "Beyond that, there's no need to deal with the staff much (who were, outside of this experience, very friendly).", "helpfulness": 16, "user": "A TripAdvisor user", "date": "August 22, 2005", "id": 3795660}, {"rating": 1.0, "title": "Don't stay here", "text": "My wife and I went to Maui for the last part of our honeymoon and it was amazing. The hotel upgraded us from a garden view to a villa with an ocean view and pretty much a private beach. It was simply amazing. The view was amazing and it was great.", "helpfulness": 11, "user": "2sunflowers", "date": "July 27, 2005", "id": 3702398}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "We (3 adults and 2 kids) stayed at the Ridge villas Aug 13-20, 2005. Kapalua villas are grouped into golf, ridge and bay villas. The ridge units are on a ridge and every unit has an awesome ocean view and a large balcony. Our unit was very nicely renovated, with granite kitchen and bathrooms. Our 1 bedroom, 2 bath unit was about 1200 sq ft, roughly the size of the first floor of our home, and even has a washer and dryer! They provided everything, including laundry and dishwasher detergents. This condo truly is as convenient as a fully equipped home. We booked through Costco travel. I must say that there are probably a few units that are not as well maintained as each unit is individually owned and maintained. But you can always ask for a different unit if you're not happy.", "title": "Villas are a Good Value", "helpfulness": 17, "user": "dutchy49", "date": "July 21, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3690508}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "My wife and I reserved our Sept. 30 - Oct. 9 vacation in January of 05. We had talked about going to Hawaii since we met. We finally did it to celebrate our 10th wedding anniversary. We could not have been more pleased. We chose the Villas for the value, proximity to the water (Oceanfront), and the fact that we are self-sufficient and do not need to be fawned over.", "title": "Worth the wait", "helpfulness": 19, "user": "srebo70", "date": "December 1, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4156964}, {"rating": 5.0, "title": "Absolutely fantastic !!!!!!!!!!", "text": "We were lucky enough to get the Villa used in the brochure photo. I actually got to speak to the owner when she phoned in during our visit. The Villa was decorated in a very simple, classy manner (mind you the decorations are done by the individual owner of the villa).", "helpfulness": 11, "user": "A TripAdvisor user", "date": "November 8, 2005", "id": 4094360}, {"rating": 4.0, "title": "Our Favorite...", "text": "We were there too early for Whale watching, but based on the guest book in the villa, between November and April you can see them right from the villa. A school of Spinner Dolphins swam into the bay outside our villa and entertained all of us that were outside.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "October 2, 2005", "id": 3984750}, {"rating": 4.0, "stay_parameters": "Stayed November 2002", "text": "The service at Kapalua is first-rate. I saw a previous review completely ripping Kapalua and just want to say that I don't know what type of treatment some people expect or are used to, but the folks at Kapalua couldn't be nicer.", "title": "Nice, but ...", "helpfulness": 7, "user": "yankeedave", "date": "September 23, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 3.0}, "id": 3934271}, {"rating": 5.0, "title": "Great Place to Vacation", "text": "The only warning I have is DO NOT use Microsoft Streets and Trips for directions to Kapalua from the airport. The program had me take the UNPAVED, VIRTUALLY ONE LANE, TWO-WAY road on the northern tip of the island. This was highly dangerous, and I later found out will void your rental car contract. Take the road going south out of the airport and around the south end. It is longer in mileage, but will take you half the time (and not take so many years off of your life).", "helpfulness": 10, "user": "A TripAdvisor user", "date": "September 10, 2005", "id": 3893081}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "I recently returned from a wonderful vacation in Maui at the Bay Villas (rented thru Maui Beachfront Rentals). We rented a 2 Br 3 Ba ground floor villa and were completely satisified. The location is ideal, a short walk to Kapalua Bay for swimming, shore scuba diving (saw 5 large sea turtles on a single dive) and snorkling. The Ritz is a little farther but is walkable. Shuttles run throughout the properties between both hotels, the various villa and condo groups and the golf courses. Our unit was clean, well furnished and well stocked with not only linens and towels but cleaning supplies (laundry and dishwashing detergents) and paper products. It had a full and well supplied kitchen, satellite TV, central AC and everything worked properly. We had good views of the ocean from the dining area and outdoor patios. Ironwoods beach and DT Fleming beach are easily walkable and accessable from the Bay Villa area. Pool use at both the Ritz and Kapalua Bay hotels was permitted and all beaches in Hawaii are public. The Bay Villas were perfect for our family of 4 and far more private than a hotel. We often went to both adjacent hotels for evening sunset drinks and ate lunches at the poolside resturant at the Kapalua Bay hotel. Other recommendations in the area: Food at the Honolua store, great sandwiches and cold drinks for reasonable prices; Afternoon \"twilight\" golf at Kapalua Bay course, Shore diving in Kapalua Bay; Molokini diving or snorkling (diving was better)--100'+ visibility; Dining: Roy's, Pineapple Plantation and Kimos, all excellent.", "title": "Kapalua Bay Villa (33G 3-4-5) Wonderful Vacation!", "helpfulness": 21, "user": "godawgsfah", "date": "July 11, 2005", "detail_rating": {"cleanliness": 5.0, "rooms": 5.0, "value": 4.0}, "id": 3658553}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "We stayed at an ocean view 2 bedroom/3 bath Ridge unit during our Maui stay for 2 weeks and were quite pleased with the experience - this was our first time in a rented condo and we had some anxiety since we are typically hotel people on vacations.", "title": "Just Got Back from The Ridge", "helpfulness": 14, "user": "furgboutit", "date": "July 8, 2005", "detail_rating": {"cleanliness": 4.0, "rooms": 4.0, "value": 5.0}, "id": 3648665}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "Kapalua is a beautful, somewhat isolated area on the northern part of Maui and is very lush - lots of pine trees, grass, and hills. The Kapalua Villas appealed to us because we were getting a pretty large living area, 2 bedrooms and the ability to cook whenever we didnt feel like going to a restaurant. However, since the Ritz Carlton (a five minute drive or 10 minute walk within the Kapalua resort area) allows the guests of the Ridge/Kapalua Villas to use their pool and recreational facilities without a charge, we felt like we were getting many of the benefits of staying at a luxury resort while getting the value of a condo.", "title": "LOVED THE VILLAS! Went for our honeymoon...", "helpfulness": 9, "user": "Foodiegrl", "date": "July 7, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 3.0}, "id": 3646309}, {"rating": 5.0, "stay_parameters": "Stayed June 2003", "text": "The unit itself was pretty nice, although it could probably use a bit of a facelift some time soon (kitchen was a bit dated). Everything was very clean and worked fine upon arrival. We sprang for a unit with a/c, which we would recommend not so much for the heat, but because it is a humid area and the a/c helped to make things a bit more pleasant. By the way, the a/c is not a central unit. Each bedroom had a window unit which cooled down the bedrooms, but didnt do much for the living room. The unit was spacious and we never felt confined or cramped during the 2 weeks.", "title": "Love Kapalua and the Villas", "helpfulness": 11, "user": "CookinCO", "date": "July 5, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3638367}, {"rating": 5.0, "title": "Best Vacation Ever!", "text": "The view from our unit was magnificent - facing the ocean from a hill which was about a quarter mile from the shore. We had a very large balcony outside the living room and another two small balconies outside the bedrooms.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "June 29, 2005", "id": 3618774}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 40, "average": 35, "very good": 120, "terrible": 22, "excellent": 316}, "aka": "The Kapalua Villas Hotel", "slim_ranking": 1.0, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "The Kapalua Villas are located on the beautiful Kapalua Resort on the west side of the island of Maui. Offering 1, 2 and 3 bedroom condominium accommodations."}