{"user_rating": 4.5, "review_count": 909, "name": "The Brown Palace Hotel and Spa, Autograph Collection", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Stayed in room 705 for two nights. King bed. No view, but good natural light. Check in was easy. Room was ready before 3p which was nice as I’d travelled from east coast. Bellman was very helpful and helped me get a new room (I don’t like adjoining rooms). Ate at Ship’s Tavern – just so-so. Went to cigar bar which was fun. Good sleep quality and hotel was quiet while I was there. Good-sized flat screen TV with HD. The room could use more plugs – I needed to get creative for all my gadgets. Good shower and water pressure. Used wakeup call service and all went well. Did not do room service.", "title": "Helpful staff, comfy room, quiet - but why charge for wifi?", "user": "MaineIzzy", "date": "May 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 160192538}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Why do hotels – especially at this price point- charge for wifi? It’s ridiculous.", "title": "and take the tour!!", "helpfulness": 1, "user": "talary", "date": "May 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 160061005}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Easy wall to 16th Street Mall area – very nice for walking, not much for shopping (mostly chains + cheesy gift shops).", "title": "Very nice.....", "user": "Reasonable50", "date": "May 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 159916497}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Housekeeping was uneven – turn down first night was awesome, not so great the next.", "title": "Best place to go for dinner, drinks & a cigar", "user": "Beech44", "date": "May 5, 2013", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 159732779}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Got a blowout at spa – David was wonderful and did an incredible job with my hair. It was really pricey (usually pay $35 in NYC) – it was $72 with mandatory tip added (which was OK since David was awesome – but what if he wasn’t?)", "title": "Brown Palace is 5 Star Luxury With Wonderful Warm Staff", "user": "CalGal29", "date": "May 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159557798}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We visited the Brown Palace last month. This was a bucket item for us. We were greated by Jeff the front office supervisor were offered a glass of bubbly. Jeff was efficient and had our room promptly. The room was so nice and our only complaint was the heat. We are used to a very cool room. This was our fault as we never did ask for the heat to be turned down. They would have takne care of this request if we wold have asked. Our problem. Overall this was such a wonderful time. Thanks to Jeff for making our stay wonderful.", "title": "Trio to the Brown Palace Hotel Denver, Colorado", "user": "sherry k", "date": "April 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 158412911}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Sherry King", "title": "Old world elegance", "user": "Lazerojos", "date": "April 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158321713}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "The Brown Palace lives up to its name and reputation for excellent service. It truly is a palace. We had a king suite, corner room. I couldn't have asked for a nicer room. When checking in, I mentioned that we were celebrating two birthdays. The gentleman at the front desk had a treat sent up with a special note, making our visit so memorable. We enjoyed show tunes at the piano in the Ship's Tavern and a relaxing visit to the spa. I would highly recommend a stay at the Brown Palace. Everyone deserves a little luxury in their life.", "title": "Historic, Beautiful, Good Location", "user": "Charlie_Hotlanta", "date": "April 20, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 158310995}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "We stayed here for one night in March (two rooms) while we were visiting family. The hotel is older, but nicely updated. The lobby was large with a restaurant in its center and another off to the side. The room was large with a comfortable bed and nice, updated bathroom. They have done a nice job updating the hotel while keeping the charm (most of which was in the lobby area).", "title": "Did not want to stay - glad I did", "user": "beatricepugzilla", "date": "April 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 158265010}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "We had a few problems with the front desk upon checking in, and rooms were not ready when promised and the delay went on and on. Other than asking us to wait, they didn't do much to accommodate this inconvenience (no offer to get a table for us and coffee, etc.). After this shortcoming, however, all went well.", "title": "This is the place to stay in Denver!", "helpfulness": 1, "user": "djcurtisstrange", "date": "April 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158154684}, {"rating": 4.0, "title": "Different", "text": "Stayed here 1 nite (May1). I have stayed in many Denver hotels as i come here on business frequently - usually Marriott or Starwood properties. Room 702 a queen bed which was very firm. I expected the hotel to be noisy with the 8 floor atrium and antique doors, but it was surprisingly quiet. Room was small but functional tho few electrical sockets. They were very nice to provide a mini fridge. Bathroom was very small but an excellent shower (no bath). Worst hair blowers of any hotel, as my long hair got caught in it. Excellent location 1 short block off the 16th st mall. At least 3 restaurants in the hotel but i had business meals elsewhere. The have a hotel car that took me across town to my meeting which was very nice. The hotel is a fantastic historic site. The atrium and lobby are spectacular. Wish i had been able to use the spa. All in all, since i got a good rate, this was worth the try.", "helpfulness": 1, "user": "Mary V", "date": "May 2, 2013", "id": 159481320}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled solo", "text": "I have been to the Brown Palace spa multiple times over the last 5+ years and consistently have a great experience. Its starts and ends with the greeting at the front desk but all throughout my experiences (mostly facials), the staff is professional, courteous, and goes above and beyond to make my spa day most enjoyable. I highly recommend Shai Albright for a facial, she's fantastic!!", "title": "Best spa in Denver", "user": "pearsoca", "date": "May 2, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 159469688}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "my wife and I needed a relaxing weekend after dealing with a loss in our family. Concierge was so friendly and was able to get us into every activity we were wanting to partake in with very little notice. Upon arrival, they even upgraded us so that my wife would have a tub in the room! Never been treated so well at a hotel. This was a big splurge for us and to have such nice people genuinely care about us in this day in age was amazing.", "title": "amazing customer service", "user": "AB1234_5633388", "date": "May 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159457301}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "I am thinking we may put it into the budget every year as a getaway because the experience was so amazing! MUST DO TEA WHILE YOU STAY!!", "title": "Great Hotel", "helpfulness": 3, "user": "Beach80126", "date": "April 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158695689}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Every penny was worth it, even though it was a stretch financially for us!", "title": "Historic hotel with updated amenities", "helpfulness": 1, "user": "tbcwilliams2455", "date": "April 23, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 158636811}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We got married here on April 14, 2013 and stayed in the Roosevelt Presidential Suite. It was absolutely the best experience of my life. Absolutely beautiful hotel, lovely staff that are beyond courteous, and the breakfast we had on-site at Ellyington's in the morning was one of the best I've had. All of our guests who spent the evening also had fantastic experiences. If you appreciate old-world style and class, this hotel is for you.", "title": "Beautiful hotel, fantastic service", "user": "Tori R", "date": "April 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158055257}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "I just had the pleasure of spending a few days in Denver at the Brown Palace. What a gem! It is a throwback to the hotels of old, with the service to match. From the moment I walked in, I felt taken care of. The bellman actually showed me around the room. Imagine that. And got me ice. The concierge did an awesome job of finding a place for a particular need. The piano playing in the late afternoon/evening was superb and the pub and cigar bar were awesome. I would go back there in anytime. Much preferred over all the amenities of the new generation of hotels. What a great spot in a super location!", "title": "Classic Style Awesome Service", "helpfulness": 1, "user": "Lori P", "date": "April 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 157878269}, {"rating": 5.0, "title": "We were treated like a King and Queen", "text": "We grew up in Denver but never had stayed at the Brown Palace Hotel. My husband and I Decided to celebrate our 35th wedding anniversary by staying at the Palace. In honor of our anniversary, they upgraded our room to a two room suite also they sent to our room a bottle of champagne and chocolate covered strawberries. We ordered Breakfast in bed both morning and I love how they would call us to see how the service was. They called us several times throughout our visit to see if all of our needs were being met and if they needed to accommodate us in any other way. The tour of the hotel was very interesting and the tour guides were very friendly and informative. My advice and recommendation is that everyone stay at the Palace at least one time. The Brown Palace hotel is well worth the money spent and Experience.", "helpfulness": 1, "user": "Cathy L", "date": "April 15, 2013", "id": 157804151}, {"rating": 5.0, "title": "Love this historical hotel", "text": "This was my first stay here. The staff was very welcoming and informative. Everything was clean and inviting. I was surprised to find that the hotel has its own artesian well. I wish I could have attended the daily tour to learn more of the hotel's history. All of my needs were met in a prompt fashion. The bellman and valets are friendly and helpful. I did spend some time working in the atrium and found it very warm and comfortable. Sometimes a guest speaking too loudly would make it echo throughout due to the architecture. It is a beautiful place to stay.", "user": "Djkbwilson", "date": "April 13, 2013", "id": 157597211}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Ah, THe Brown Palace...still a real classic beauty.....we've been going there for 20 years. Truly an icon!!....Leroy, at the door is one of the greatest assets, who greats with warmth and his skills. From there, it's spotty, Regular rooms are a bit on the small side, we like to stay on the top 2 floors, but the size of room and bathrooms vary greatly and it seems the front desk doesn't know their differences...Yeah, i love my separate bath tub and my husband loves a real shower, not the shower over tub...there are many rooms on those floors that have that set up and with space. we specifically requested it this time and lo and behold you go to the room and it's has bathroom with shower over tub. they then had to have a bellman check on other rooms to see what their setups were and moved us to a much much smaller room, ....disappointed to say the least......we used to specifically request a room # as the only way to get what you want so i guess we have to go back to that....Another real anoyance is for a fine hotel not to have free access for computers.", "title": "Classic beauty but lost a bit of it's charm", "helpfulness": 1, "user": "montrosefoodie", "date": "April 9, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 157242746}], "location": {"country": "United States", "city": "Denver"}, "stars": 4.5, "variance": {"poor": 44, "average": 62, "very good": 160, "terrible": 31, "excellent": 612}, "aka": "Brown Palace Denver", "slim_ranking": 0.0689655172414, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Presidents, rock stars, executives, and discerning travelers all choose the one-of-a-kind ambiance of the historically luxurious Brown Palace Hotel and Spa, Denver's only four-star, four-diamond hotel. Guests are treated to grand architecture, 6 unique dining venues, a full service spa and salon, and distinctive accommodations. Experience Tradition With a Twist."}