{"user_rating": 3.5, "review_count": 31, "name": "The Valley Guesthouse", "reviews": [{"rating": 5.0, "title": "It's terrific - best place in Tibetan part of Kathmandu", "text": "Happy Valley Guest House is a great place to stay in Kathmandu - in the Tibetan area of that sprawling city. We have stayed twice at this up-scale guest house and highly recommend it. We had the penthouse room last time - with a roof level deck and looked right across at the Buddha eyes on the famous stupa close by. It is spotlessly clean, with western-style bathrooms - a very big deal in that country. The rooms are nicely decorated and comfortable. It's more like a small hotel than a guest house - although they don't have a restaurant there but will recommend the best places to eat nearby. The owners are Nepali and Tibetan and speak excellent English. They are very helpful and soon we felt like, and were treated like, family.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "November 8, 2004", "id": 2812452}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We ended up staying at The Valley Guest House after not being able to book a room at the Shechen Guest House. This turned out to be a bit of a blessing since the Tibetan Buddhists blow horns at various times through the night that we could slightly hear from where we were. They do however, have a great restaurant which is well worth a visit.", "title": "Great location for exploring the Bodhnath area", "helpfulness": 2, "user": "Samkirk9", "date": "April 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 28570598}, {"rating": 3.0, "stay_parameters": "Stayed November 2008, traveled solo", "text": "We booked the Valley instead having remembered reading some good reviews on TripAdvisor. It is in a convenient location only minutes away from the Stupa (to the North) in Bodhnath. We had a large room, with a three-piece suite, two double beds and a balcony with a view of the Stupa. The room was comfortable and whilst the bathroom was clean with western flushing toilets it was outside the room itself in the corridor, although still en-suite as a curtain had been erected around the room door and the bathroom door. It looks a bit odd at first, but it didn’t really detract from our stay here. For information there isn't a lift in this hotel.", "title": "Changed", "user": "Bin-weg", "date": "December 20, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 22865592}, {"rating": 4.0, "title": "Happy Valley Guest House", "text": "There is a garden area, a reading room on the roof as well as a great roof terrace overlooking the Stupa, Kathmandu and the airport in the distance, where you can watch flights take off and land. The staff were polite and room / roof service was efficient, but I have found staff friendlier in other hotels / guest houses we stayed in around Nepal, which surprised us given the reviews on TripAdvisor. The only thing I wonder about this place is why they dropped the ‘Happy’?? Maybe the place has changed hands as the previous review has mentioned.", "helpfulness": 2, "user": "Cybermate", "date": "May 9, 2007", "id": 7569142}, {"rating": 5.0, "title": "Great Place", "text": "Anyway, the area around the Stupa is much quieter than the rest of Kathmandu and you could spend hours wandering around the Stupa and surrounding streets and monasteries taking in the people, architecture and atmosphere. You can also take a pleasant half an hour walk to Pashupatinath to take in the atmosphere of one of Nepal's greatest Hindu shrines.", "helpfulness": 9, "user": "JohnPortland", "date": "March 20, 2006", "id": 4717826}, {"rating": 5.0, "title": "Clean and Quiet", "text": "I’m glad we chose to spend a couple of nights in this area, but like other places in Nepal the night life seems to wind up at around 10pm, but unlike Thamel there aren’t the odd places still open for a night cap.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "November 10, 2004", "id": 2817423}], "location": {"country": "Nepal", "region": "Central Region", "continent": "Asia"}, "variance": {"poor": 4, "average": 10, "very good": 10, "terrible": 0, "excellent": 7}, "aka": "The Valley Guesthouse Hotel Kathmandu", "slim_ranking": 0.661417322835}