{"user_rating": 4.0, "review_count": 231, "name": "The Fox & Goose Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Stayed her for 2 nights a weekend in February. I absolutely cannot fault this hotel. It was exactly what we needed for this trip. Our brief was a hotel in north London, near a tube station with parking.", "title": "Excellent base for London.", "helpfulness": 4, "user": "401Jen", "date": "February 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 152802197}, {"rating": 2.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Really pleased to have found this one.", "title": "Noisy and a little rude.", "helpfulness": 1, "user": "Thomas B", "date": "February 17, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 4.0, "location": 3.0}, "id": 152387820}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "The room was clean and well appointed, although not luxurious, It had everything one needed.", "title": "An Enjoyable Stay", "helpfulness": 1, "user": "Cassandra C", "date": "February 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 151849334}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The staff were consistently courteous and helpful.", "title": "ideal place", "helpfulness": 1, "user": "Patricia S", "date": "February 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151748437}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "We ate in the restaurant on night and I was very pleasantly surprised to find it was not mass produced 'chain pub' ( freeze/ reheat) food. The menu was interesting and our choices were excellent in taste and presentation. With the major bonus of some really excellent beer on tap. The bar area of the pub was busy with a good atmosphere. The restaurant area was divided off to enable a pleasant evening dining experience.", "title": "More than adequate", "helpfulness": 1, "user": "johnnymooney", "date": "January 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 150397074}, {"rating": 4.0, "stay_parameters": "Stayed May 2013", "text": "Stayed at this hotel the night of the FA Cup final, a short bus ride or 40 minute walk from the stadium with free on sight parking.", "title": "Great place to stay foe Wembley Stadium", "user": "joetopps", "date": "May 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 160464589}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Deluxe rooms spotless and very comfortable, all staff very friendly. Food in bar and restaurant was ok, nothing spectacular but good value.", "title": "A Marathon standard for a Marathon Weekend", "user": "GAIL B", "date": "May 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160203598}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Will definitely stay here again when visiting London.", "title": "Great hotel, great value, so easy to find.", "user": "Wendy L", "date": "April 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158360315}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Great room, fantastic reception and friendly professional staff who couldn't do enough for you! My husband and I booked the hotel as base for us to stay and prepare for the Virgin London Marathon this year and it turned out to surpass more than our expected requirements and live up to the reviews we'd read on this site.", "title": "perfect 1 night stay", "user": "Laura P", "date": "April 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157692590}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "On arriving at reception after a 3 and a half hour journey from Devon on a Friday evening we were both tired and slightly alarmed to discover that my telephone booking had been lost! However, the reception staff rallied around and the manager promptly rectified the situation and we were accommodated for our two night stay in a superb room with great facilities and afforded us the luxury of a quiet, undisturbed sleep. The manageress even 'threw in a complimentary drink for us each in the bar and breakfast the next day - a very generous gesture and very welcome!", "title": "Would love to return!!", "user": "weescorps", "date": "April 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 157687779}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Stayed three nights april in superior double on ground floor. Room quite small located at back of hotel with view of industrial unit about 7 metres away with hardly any natural light. Fixtures and fittings although relatively new felt cheap e.g. vanity chair wobbly, shower not very securly fitted to wall, shower/bath base thin felt as though it could easily crack toilet seat broken (meant to report it) its not what i would expect from a superior room. However, on the plus side the bed was very comfortable, room was cleaned well, hotel was easy to find just off the North Circular, location near to hanger lane tube was good, free parking onsite a big plus, nice staff and decent pub attached.", "title": "Good and Bad", "helpfulness": 2, "user": "Graham_bellingham", "date": "April 10, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 157340810}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Me and family stayed at this Hotel for one night for a party, and the experience couldn't have been better. We were welcomed politely and had a good natter with the staff as soon as we entered. The rooms were A*** class with perfect heating and lighting. The beds couldn't have been comfier, and the bathroom facilities were great. The garden/outside seating area was beautiful, with plenty of plants, flowers and shrubs in bloom to create an eden like setting. The bar/restaurant was beautifully layed out with pleanty of space to get around, and more than enough comfortable seating in all different shapes and sizes to suit anybody's fancy/needs. The decor was amazing, every attention to detail was perfect and the food was beyond mouth watering. The breakfast service was quick, polite, helpful and very attentive. The breakfast meals were stunning, every bite was perfect as a first morning meal. Overall, I would highly reccommend this Hotel, Bar & Restuarant, and will definitely come back!", "title": "Absolutely Wonderful!", "helpfulness": 3, "user": "Steven M", "date": "April 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156914339}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "I stayed here for two nights in March with my parents and grandmother, we had a superior double room and twin room, both on the top floor where all of the rooms have been redone. The beds were really comfortable, (new I think!) and the decor was very modern but with a luxurious feel to it. The bathrooms were spotless with a huge bath and powerful shower in our room, and a large walk in shower in my parents room. The complimentary items were lovely and of high quality.", "title": "Highly Recommend!", "helpfulness": 4, "user": "HanWills89", "date": "March 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154240629}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The staff were great and really friendly, they took the time to greet us each time we were through reception and were quick to replace a lamp for us when one was not working.", "title": "Fancy soap and hot chocolate!", "helpfulness": 1, "user": "Morganagh", "date": "March 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 154193674}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We had breakfast in the pub each morning which was really lovely! You could choose from continental which was a great selection, then you could have either a smaller breakfast of either bacon and egg, omelette, and another option; or you could have a full English breakfast (veggie option available). The staff were great and kept topping up our tea and toast all morning!", "title": "A little gem", "helpfulness": 4, "user": "Tracey W", "date": "February 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153185420}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "We arrived early. Blonde lady at reception not very welcoming. Did not get up off her chair, sat looking at us without any expression whilst I explained we were early and could we check in and leave our luggage and come back later for the key etc. She said yes to everything but was very inanimate. The other receptionist who we saw for the rest of our stay was much friendlier and helpful. Our twin room was clean and a nice size. The bathroom was a good size but had a hand held shower which kept falling off its stand mid shower. Lighting in the room is dim..there are many lights but all of them seem to have 30w bulbs - sure that is not the case but I dramatised to get the point across! Free wifi and free parking was much appreciated; you don't feel you are being nickled and dimed as they say. Was also nice to be able to have the pub attached for meals and drinks without having to go anywhere. We chose this hotel because it was only a 20 minute tube ride into London which is the distance lots of London hotels are to the centre, yet at a much, much higher price. Also because of the free parking; was a big plus being able to leave the car while we did our sightseeing and not be paying an arm and a leg for that too. It is about a 5 minute walk to Hanger Lane tube station and the area is well lit...I would be worried though walking to the hotel from the station late at night because you have to go down a tunnel or underground access way to get below the road and across the street...it was well lit but could be scary on your own; on the other hand if you are not a female on your own, probably nothing to think about. We had dinner one night at the pub; was very nice and reasonably priced. Oh...and they had a vending machine in the lobby which had a large variety of snacks and chocolates and bottles of Wine...very impressive - have never seen wine in a vending machine and as you can tell, I am a fan!", "title": "Good value for money", "helpfulness": 1, "user": "natmicstef", "date": "May 20, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 161272247}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Stayed here for 2 nights to go watch Bradford City at Wembley. Fantastic location as only about 1 mile from the ground by bus number 83 which stops outside the hotel. We had a superior room on the 2nd floor which was really lovely. Fantastic super king bed, lovely wet room style rain shower, flat screen tv, fridge, a safe. The 'pub' side of the hotel is great, lovely food, real ales, very reasonable prices too. The breakfast was good, nice produce, well cooked. The staff are very nice, friendly & helpful. The tube into London is at the top of the road, it took about 15 mins to get into London. Ask for a room not overlooking the car park as the double glazing is not very good. Had a brilliant nights sleep though as its quiet at night despite the busy main road. A great stay, highly recommend. There is ample parking, brilliant if you drive there.", "title": "Fantastic 'Wembley' weekend", "user": "maggie t", "date": "May 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161242564}, {"rating": 4.0, "stay_parameters": "Stayed May 2013", "text": "We stayed here for our trip to Wembley stadium for one night. Good parking facilities, pub serving food next door, bus stop for Wembley a few minutes walk away.", "title": "Nice enough hotel..", "user": "Annlou15", "date": "May 18, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 161067480}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "Reception staff friendly and professional, really comfortable bed and good facilities in the room i.e kettle, biscuits etc.", "title": "Lovely stay", "helpfulness": 1, "user": "Meghan L", "date": "May 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 160507114}, {"rating": 4.0, "title": "Great stay at the Fox & Goose", "text": "Only negative was that it could get quite noisy at night as the bedroom doors slam very loudly....multiply that by many rooms and it can get very annoying. Also walls appeared thin as could hear other people's conversations.", "user": "Jaco V", "date": "May 12, 2013", "id": 160478643}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 3, "variance": {"poor": 5, "average": 33, "very good": 97, "terrible": 0, "excellent": 96}, "aka": "The Fox And Goose Hotel", "slim_ranking": 0.183085501859, "description": "This attractive, traditional hotel has a typical English pub with terrace and garden, all just 3 miles from Wembley Stadium and Arena, and 6 miles from Central London. The Fox & Goose hotel is 10 miles from Heathrow Airport and 5 minutes' walk from Hanger Lane Underground Station (Central Line). Its excellent transport connections make the hotel ideal for business travellers and tourists. The comfortable rooms are air conditioned and have excellent facilities. The pub serves traditional meals, and during winter you can enjoy the cosy open fireplace. The Fox & Goose is 12 minutes by car or 15 minutes’ Tube journey from Loftus Road, home of Queens Park Rangers FC. Guests can enjoy free private parking on-site, and there is a 24-hour front desk and free Wi-Fi throughout the building."}