{"user_rating": 4.0, "review_count": 3784, "name": "THEhotel at Mandalay Bay", "reviews": [{"rating": 5.0, "title": "Wonderful Time at the Hotel at Mandalay Bay!", "text": "We recently stayed at the Hotel at Mandalay bay on November 4th. Originally, I had made reservations for a regular room on Vegas.com, but came to find out that for the same price, we could have gotten a honeymoon suite room for the same price if booked on the hotel's own website. I called and asked for an updgrade upon check-in. Upon arrival, the front desk clerk informed me that they were out of non-smoking honeymoon suites. After inquiring with her manager, they decided to put us in the penthouse suite. Not only was the room amazing, but the desk clerk was wonderful to us. Her customer service skills and attitiude were professional, attentive, and courteous.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "December 4, 2005", "id": 4160922}, {"rating": 2.0, "stay_parameters": "Stayed December 2005", "text": "My fiancee and I were in Vegas for only one night for a shotgun wedding, and the accomodations and staff at the Mandalay Bay made it one special night for us.", "title": "Could Use Some Help", "helpfulness": 7, "user": "kithsu_12", "date": "December 4, 2005", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "service": 3.0}, "id": 4160843}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "Our room was appointed with the best furnishings, toiletries, and a spectacular view.", "title": "My New Favorite Las Vegas Property!", "helpfulness": 8, "user": "HiTravelerKapolei", "date": "November 29, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4153736}, {"rating": 5.0, "title": "My new favorite", "text": "We will be staying at the Hotel at Mandaly Bay whenever possible!", "helpfulness": 6, "user": "ghperezpacific", "date": "November 28, 2005", "id": 4148771}, {"rating": 5.0, "title": "Perfect room", "text": "We went Mandalay Bay (THEHotel) to stay to celebrate my sister's 50th birthday. Check in was a nightmare. The hotel did not have enough staff so a line 50 deep formed. The wait to be checked in was close to 45 minutes - this was at 10 PM on a Thursday evening and we had come from the East coast! Also, it was never made clear that you could check in directly at THEHotel. They could use better signage. Other than that the room was perfect and the hotel is surprisingly accessible to other hotels on the strip. The food at some of the restaurants is extremely pricey and, also surprising, not very good. The wait staff, however, is very professional and very attentive. If we go back out to Vegas again we would choose to stay somewhere like the Bellagio where they had plenty of staff and very professional, courteous service.", "helpfulness": 3, "user": "bee-bum", "date": "November 27, 2005", "id": 4146943}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "I have stayed at Mandalay Bay several times but never Thehotel before. I was very pleased. The walk back to THEhotel was a little bit of a hike when coming from the casino, but the separate valet and the entry when coming from outside was convenient.", "title": "Enjoyed my stay", "helpfulness": 1, "user": "malvlover", "date": "September 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 118516640}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The room itself was nice, some of the furniture had seen a bit of wear but was comfortable. Having the bedroom separate and away from the hallway door was nice, no hallway noise!", "title": "Awesome view in the corner room suite", "helpfulness": 1, "user": "FRTravellers", "date": "September 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 118493940}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Bed was so comfortable I almost overslept my check out day! Curtains overlap and fit the windows well so there was no outside light to bother me.", "title": "Great Stay!", "user": "gp171080", "date": "September 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 118484318}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Bathtub was very deep (and clean), water nice and hot. Separate shower but the water pressure was a little low. Another reviewer mentioned a shower curtain liner being grimy...there are no shower curtains in these rooms! Glassed in showers....not sure where dalcy3 was as I am sure none of the rooms @ THEhotel have shower curtains.", "title": "Very much enjoyed my stay", "user": "sbenus", "date": "September 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 118465156}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Half bath in the entry (never used!) and full bath with double vanity and plenty of light. Very nice decor, dark woods and black marble tile on the walls.", "title": "One of the best hotels I have stayed in!", "user": "Sparky2511", "date": "September 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118441677}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We just returned from a family getaway to Las Vegas and booked into THE hotel at Mandalay Bay. We had friendly service from start to finish in a very nice hotel in a great location. The rooms were spacious & luxurious with a massive bathroom, 3 televisions and super comfortable beds. Our view was not great (freeway and fans) but we spent most of the day in the wave pool and lazy river - which were super fun but super crowded. All in all, a great experience. We would book this hotel again!", "title": "Very enjoyable experience", "user": "Darcy K", "date": "July 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135513713}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "I have stayed at The Hotel at Mandalay Bay for the past 7 years. Each time I go my stay gets a little worse. I am done. Here is why. Check in line took over 30 minutes. Come on, 30 minutes to check into a hotel? Just traveled 5 hours to get there. You think I want to wait on line 30 minutes to check in? I reserve a room with a king size bed. For the third time in a row I've been told at the time i Check in that none are available. After making a stink, they finally gave me a room with a king bed. So when I got to my room, there was no living room. All rooms are supposed to be suites. So now I go back downstairs and wait on line again and told I was given that room because I wanted a king bed. Now I'm very upset and insist on a king bed with a suite which is what I paid for. After going back and forth with a manager, presto, a king bed with a suite is available. Why did I have to get pissed to get this?", "title": "Fastly approaching Zero Stars", "helpfulness": 1, "user": "Don L", "date": "July 26, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 135480959}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Other issues.........carpets in the hallway are filthy. So are the ones in the room. A/C resets itself. I set the air to 62 at night. In the night it switches to 72. They used to provide nice shampoo, body lotion, conditioner and soap. Now its all crap.", "title": "End of the Strip", "helpfulness": 1, "user": "Discostuu", "date": "July 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 135217538}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Eat breakfast at The restaurant. Cold eggs. Next day breakfast at house of blues, cold eggs, next day at Red white and blue, cold eggs, next day at coffee shop in Mandalay, cold eggs. This place has gone to hell. Im done with them. Either I'm going to Palazzo or one of the Wynn properties. I'm done with these MGM properties.", "title": "Loved the room, service, cafe, and fabulous pool", "helpfulness": 1, "user": "FamilyBu", "date": "July 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135214711}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We arrived at THEhotel in December and were impressed with the whole complex as it is the part of the Mandalay Bay, however the pool areas were closed off.", "title": "Absolutely Awesome", "helpfulness": 1, "user": "JTLMWales", "date": "July 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 135111926}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "arrived after 20 hours of travelling only to be told that someone had the suite we had paid for.", "title": "worse start to my honneymoon", "user": "FALKIRKJULIE", "date": "October 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 1.0, "service": 3.0, "rooms": 3.0}, "id": 47985636}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "got a stamdard room ( which was nice) for the first night.", "title": "Superb!!!!!!", "user": "u21012", "date": "October 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 47917672}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "went to get our suite the next day only to be told that it was still occupied", "title": "Very pleasant stay but with some issues....", "helpfulness": 1, "user": "douliou", "date": "October 27, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 47901734}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "and if we want another room - suite we would have to wait to check out the again to check in-----as if but that is what we had to do.Charging items to the room was a nightmare for the first 4 days as they had not entered details correctly on the computer thus making us look terrible at the bar etc.", "title": "Mandalay bay", "user": "xvacax101", "date": "October 25, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 47739016}, {"rating": 1.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "If you want traquility because they say you have a beach at the hotel FORGET IT, music a big noise and at the weekend the Locals decend upon Vegas and GOD they love the sound that comes out there mouth,they would even talk to whoever they could just to hear themselves.", "title": "Poor service and smells bad. AWFUL", "user": "jt31sd", "date": "October 24, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 47670424}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "We'd stayed at TheHotel for 4 nights in December 2005 (9th-13th). We arrived at 10:30pm after extensive travel delays and were informed that they had no suites available but would give us a standard room and move us in the morning. This was a little annoying since they adverstise as being an all suite hotel, but since it was late we didn't really care. They knocked $50 off the rate and promised we'd be able to move \"first thing\" in the morning. Our main concern was that we had to be at a wedding by 1:30 the next day and wanted to be settled in our new room by them. Nothing available on the first try at 9:30am. At 11:30am we were told that check in wasn't normally until 3:00pm and that they were doing us a \"courtesy\" by moving our room at all. Things got a little heated at this point and we returned to our room. About 2 minutes later the front desk called to apologize and say they had a suite for us and we could move right away. Go figure.", "title": "Great Room, One Problem", "helpfulness": 13, "user": "vtgambler", "date": "December 15, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 4244324}, {"rating": 1.0, "stay_parameters": "Stayed December 2005, traveled on business", "text": "Other than the above problem TheHotel was great. The suites are top notch with a huge master bathroom, living room area, etc.. I've stayed at Bellagio and Venetian and I would say these rooms are better. Everyone else we dealt with was very friendly. We had breakfast at TheCafe a couple of mornings and it was very good. Unlike the main hotel there was never any wait for a cab or traffic congestion getting dropped off. Anyone who says its a long walk to get to the Casino probably hasn't spent much time in Vegas. It's no more then 3 minutes from the elevator.", "title": "Awful Hotel!", "helpfulness": 9, "user": "BJ1026", "date": "December 14, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 4242498}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "Feel free to e-mail me if you have any questions.", "title": "Excellent Loved THEhotel", "helpfulness": 9, "user": "waspkiller", "date": "December 9, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4229431}, {"rating": 4.0, "stay_parameters": "Stayed April 2005, traveled on business", "text": "AVOID Mandalay Bay like the plague! I will NEVER stay there again. I know that they give the WORST rooms to the AARP groups! And the reason that I say this is because I talked with a man about the room that I had. They could not (according to them) change my room due to conventions being in town. Because it is AARP and a discounted room, I was pretty much stuck with it. No apology, no leeway allowed apparently! I believe that AARP needs to address this issue with the hotels. We spent a lot of money in their casino but will not again.", "title": "Great style - great service - one NASTY little problem!!", "helpfulness": 20, "user": "victoriacar", "date": "December 5, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4161577}, {"rating": 5.0, "title": "Loved it!", "text": "I was put on the 21st floor ABOVE the air conditioning vents, back lots/parking, with thin windows, thin walls and a noisy, noisy, noisy room! The helicopters and small planes also fly that path constantly. The air in the room smells musky from former cigarette smokers with an ash tray still in there (I had asked for a smoke free room).", "helpfulness": 6, "user": "agovan", "date": "December 4, 2005", "id": 4161543}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "We enjoy staying at the Mandalay when we visit Las Vegas but we decided to avoid some of the crowds and move over to THE Hotel this time. We stayed 4 nights for a business meeting in the quietest hotel room I have ever been in. Check-in took only a few minutes on a Sunday afternoon. It took only a few minutes to notice that there was no hallway noise, no doors slamming, no kids running, just sublime silence. The suites are spacious and having 2 bathrooms was an unexpected plus! It takes a few extra steps to get to the Mandalay Pool and the casino floor but the room more than compensates for the added distance. THE Hotel will be at the top of our list from now on!", "title": "Our New Favorite HOTEL!", "helpfulness": 1, "user": "GOmaha", "date": "September 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 118609811}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "Our suite was devine..clean and ultra modern.....staff were friendly.", "title": "THIS HOTEL WAS AMAZING !!!!!!!!", "user": "kazlyn1", "date": "September 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118605502}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Like all Las Vegas resorts, THEhotel is HUGE. You walk forever between the actual room and whatever destination you might want to reach. We drove there from the airport (we actually DID need a rental car to visit nearby family . . . ), and there are NO SIGNS ANYWHERE suggesting which way to go for THEhotel vs. the \"regular\" Mandalay Bay hotel. So, we walked a LONG WAY the WRONG WAY to check in.", "title": "HUGE complex - NOISY room", "helpfulness": 1, "user": "Bruce_411", "date": "September 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 118604104}, {"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "At night, in the summer anyway, Mandalay Bay hosts huge name acts in their pool stage, so you hear VERY LOUD concerts all night, well past midnight. So, if you have any reason to want to sleep before, say 1:00AM, do NOT stay here. We traveled there for a wedding with our 7 year old twins. While it was a great place for the wedding, NOT SO MUCH for a place to stay.", "title": "Try somewhere else instead!", "helpfulness": 1, "user": "phil5466", "date": "September 25, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 118576874}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Reached THE Hotel after a 31 hour transit from China, looking forward to a wonderful stay at a luxury hotel charging $340/night.", "title": "My All Time Favorite Vegas Hotel", "user": "Newssss", "date": "September 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118564792}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Stayed at THEhotel at Mandalay Bay last weekend in October. Service was excellent and real suites were great. Half bath in entry way to living room. Door to bedroom and main bathroom with both large tub and shower. Very clean and comfortable. Housekeeping was always great and helpful. Ate at RM seafood and had a great meal and time. Cliff is an excellent server. Casino never felt smokey too me and all the staff were very friendly and up beat. Other places I had gone in Vegas this was not the case.", "title": "THEhotel does not dissapoint! Great stay.", "user": "vegasdragon", "date": "November 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 48671315}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "EyeCandy lounge is a great but if you can score getting passes to the Foundation room you get the best view of the strip and outstanding bar staff. Mix can be fun on top of THEhotel and has a great strip view also. I don’t consider the location to be a negative because I really don’t have to leave the property too much but if I do the traffic is much nicer near MB.", "title": "Excellent and very quiet compared to other othel in Las Vegas", "user": "Ermejo", "date": "November 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48666085}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "We spent three nights at the EHotel. We were given a suite with the view of the strip. The accomodation was excellent , comfortable, very clean , and above all very quiet. Different from the other hotels we visited in Las Vegas, the reception is far away from the casino floor and you are not boliged to walk through the casino to go to your room once you have checked in. This hotel has the swimming pool and restaurants in common with the Mandalay Bay Hotel. The swimming pool was disappointing as it was extremely crowded and no space at all between chairs. We had dinners at two different restaurants. The food was good but we found the prices to be expensive.", "title": "Great Hotel with Great Rooms....Customer Service could be better", "user": "tcouncil", "date": "November 6, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 2.0, "rooms": 5.0}, "id": 48646036}, {"rating": 5.0, "title": "Best Hotel Ever", "text": "The rooms have free internet but if you do not have a laptop with tou as it was our case, to use the internet in the business center it will cost you 1 dollar a minute and that was unacceptable.", "user": "Hovitez1979", "date": "November 6, 2009", "id": 48623566}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Overall our experience was positive and we would recommens thids hotel to our friends.", "title": "THE Hotel is a Cut Above the Others", "helpfulness": 2, "user": "TravelPeepChicago", "date": "November 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 48463899}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Errors with an early check in. Not a big deal. A mistake on the bill that takes 30 minutes to correct...crappy but not the end of the world. Small, overcrowded pool with $17 drinks...yuck. Bellhop walking into your room with a set of guests who intend to stay in your room...absolutely not. The hotel made so many errors on my trip I can't rate it better than average. I think what was most disappointing was the staff's response to the issue. I was given a credit that apparently didn't make it's way to my bill, which caused people to argue, disagree and be less than gracious when checking out. Oh well!", "title": "Great rooms, bad service, overpriced food", "user": "dawagner4", "date": "July 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 134585269}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "We stayed from 7/11-7/15 and we loved everything about the Hotel. The Hotel is located at Mandalay Bay. We were amazed at the size of the rooms1v They have a living room, huge master bath and a second bathroom in the main area. Huge tub in the room with a cool waterfall type faucet. Very comfy beds and great service", "title": "Beautiful All Suites Hotel.", "helpfulness": 1, "user": "Wyomingdan", "date": "July 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134533354}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The Hotel is very nice. The rooms are great. The staff is super. However, if you use the coffee maker in your room to make a cup of coffee, it will cost you $4. This seems illogical in a hotel with free valet parking for guests (and by the way, the valet service and staff are top notch). If charging $4 for what Motel 6 furnishes at no charge, is the only thing keeping the Hotel afloat, just up the room rate slightly, and give away the coffee. Guests will leave feeling better about their experience - which was pretty great in every other way.", "title": "A very nice place to stay, but don't expect free coffee", "helpfulness": 1, "user": "Jcjenkins3", "date": "July 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134294633}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "I attended a conference in June at Mandalay Bay. When I arrived, I was given a suite at The Hotel for the same price as the room I had booked at Mandalay Bay. It was simply wonderful. The suite had a half bathroom as well as a large full bathroom, complete with a TV on the wall. The suite also had a wet bar, plenty of closet and drawer space, a big TV in both the bedroom and living room, and a beautiful view of the Strip. It was quiet and nicely decorated. One of the closets contained robes and slippers.", "title": "stay at The Hotel", "user": "jenkinsc", "date": "July 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 134289931}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Stayed here August 2009 as part of our USA honeymoon roadtrip for 3 nights.", "title": "Great Vegas experience", "helpfulness": 1, "user": "LKA1979", "date": "July 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 134289031}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We were eager to stay again at THEHotel at Mandalay Bay, so we booked a 3 day anniversary trip to relax by the pool and experience some Las Vegas shopping. Our check-in was quick and easy, the room was well appointed, clean and comfortable. There were many more families and children during this visit but we never heard them-we only saw them at the pool! If you're looking for a quiet place to stay with some of the best suites around-you will enjoy THEHotel at Mandalay Bay. We will return!", "title": "Just As Good THIS Time", "user": "GOmaha", "date": "July 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135744795}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Hotel service personnel were excellent. They were personable and welcoming. Views from both rooms (all suite set-up with separate living area and bedroom) were impressive. The decor is very pleasing and the space is designed to provide optimum privacy. Really liked the separate guest bathroom and large on-suite bathroom. Again, it fostered a sense of privacy. As with most hotels, the prices for items from the honor bar are high but the wet bar is sufficient to accomodate your own refreshments. The bed and other room furniture is comfortable and the TV's were large though the volume on one of them did not seem to work so well. It did not matter to us too much as we did not use the TV's all that much. Valet service for the cars was close and efficient. In fact, it was one of the best in town. I have stayed at THEhotel several times and I find it a real deal for the quality of the experience.", "title": "THEhotel at Mandalay Bay", "user": "Carol C", "date": "July 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 135738319}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "The room sizes vary and are generous with space, The master bathtub was luxurious and novel. Rooms have all the basic amenities a suite should have accept: No speaker phones, Limited TV programming, A coffeepot with pay per brew coffee, No turn down unless you call for it each day. Cheap bath products (unexpected) Expect to wait 90 minutes minimum to check in (and the lobby is hot!) The staff were nice but there was no follow through on most everything we requested. .. Bell service was so slow that I eventually carried my own bags down - Room service food tasted awful , was sloppy looking and they forgot half of the few things we ordered. The one item that really badly impacted our entire stay was the wakeup calls that came in every hour on the hour and then fifteen minutes after that each morning until 11:30. Our sleep was crucial on this trip due to the 15 hour days we had to work.", "title": "Modern and spacious hotel rooms but lacking many details.", "user": "Jpresskin", "date": "July 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 1.0, "rooms": 4.0, "location": 4.0}, "id": 135644496}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We had an 11am wakeup call in and nothing else. We spoke individually with everyone and anyone including a supervisor, front desk manager, operator and guest services manager to ensure these loud incessant calls stop already because we were exhausted and we were unable to get back to sleep once the calls began. We were assured by 2 managers that the problem was solved and the calls would stop but the wakeup calls continued during our entire stay. It amazes me that although they said it was fixed that no one at that property could figure out how to stop these automatic calls from occurring. To make it worse a manager called us at 8:30 am to discuss the fact that her records show there is a do not disturb until 11:00 am on her records. If so then why was she calling at 8:30 am? Lovely rooms but terrible organization. This hotel really owes us a major apology!", "title": "Great stay!!", "helpfulness": 2, "user": "Grimace616", "date": "July 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135576573}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We were here at THE Hotel in july. We had a great time. I hear so many complaints from so many people cmon people stay at home if you want everything your way damn!!! Why do you come to Vegas, to lock yourself up in a rm? If thats the case stay at home and stop complaining. Well about our stay, we were there for the Khan vs Garcia fight and for the WWE so it was perfect!!! We got there and there was a long line for check-in but we checked in quickly 10 min and were in the room. Rooms were clean, nice view and comfy. We went out to shop, eat, play and got back in time to sleep. Next morning we went to the pool, beach, lazy river and it was lots of fun. Dont have any complaints about this hotel. The only thing was that we tried to get a late check out but it wasnt available but its all good. I know its a busy place. Would definetely go back there and recommend this place especially if you have events to attend to in the mandalay bay center its super easy and convenient.", "title": "Great Hotel", "user": "Veronica G", "date": "July 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 135561229}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Overall, the room was great with modern decor and a comfortable bed and couch. Great features include 2 bathrooms and a separate bedroom from the living room. However, if you decide to stay here, ask to stay on one of the top floors; we were on the 3rd floor next to a conference room and it was very loud in the morning while they were setting up for a conference. Also, be prepared to spend a lot of money on food and beverage. For example, if you drink the cup of coffee provided in the room, it will cost you $7; the bottled water was $8. They should consider at least providing each guest with a cup of coffee and bottle of water per day, on the house, considering the cost of the room and food. Next time go, we plan to stop at the liquor store before we check in to buy beer and water and stock the fridge. The best restaurant we ate at was Red Square, it was AWESOME! The service was great and the food was the best we've ever eaten! Food was good at Border Grill but the service was terrible. Food and service was great at Lupo. Overall, great place to stay, we were just a little sticker shocked.", "title": "Fun but pricey!", "user": "Kelly S", "date": "September 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 118387131}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "There is no doubt that this hotel looks really good - very cool lobby, restaurants. The suites are well appointed and probably the most comfortable couch I've ever met in a hotel room. Like many hotels, the way it looks doesn't translate to the level of quality.", "title": "Mildly disappointed", "user": "dalcy3", "date": "September 20, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 118367176}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I was disappointed in the hotel for a couple of reasons:", "title": "No smoke", "user": "carolineSeattle", "date": "September 19, 2011", "detail_rating": {"value": 3.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 118328081}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "1) The bathtub in my room was grimy as was the shower curtain liner - The liner needs to be replaced for sure and the tub really needs to be bleached.", "title": "Loved It!", "user": "adisneyrental", "date": "September 18, 2011", "detail_rating": {"value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 118268455}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "2) Construction outside of my room - I got in really late due to a flight delay and really needed to sleep in to prepare for a presentation. I was unable to sleep because of construction in the hallway outside my door - it sounded like people were scratching on the wall or something - turned out to be painters / scrapers - It was really disappointing that they would do this on the wall outside of a room that was occupied with the do not disturb sign on.", "title": "Great classy suites hotel without a casino feel.", "user": "KTinPDX", "date": "September 17, 2011", "detail_rating": {"value": 4.0, "location": 2.0, "service": 4.0, "rooms": 5.0}, "id": 118250153}, {"rating": 3.0, "stay_parameters": "Stayed September 2011", "text": "We generally receive excellent service travelling through the USA but not here. We arrived for our check in 30 mins early and our room wasn't ready - no big deal as the front desk would could us when it was. 2.5 hrs later - no call and no room charging whilst we waited, despite being given a card with approval for this. When we got to our room we found that coffee in the room would cost us $4 each cup (despite the fact that we paid a resort fee for services we wouldn't use). Our disappointment was echoed by other guests at check in - 2 different parties both requesting some type of compensation for their poor experience. We won't stay here again. Terrible service and over-priced.", "title": "Over-priced for the service.", "helpfulness": 1, "user": "CalleyBrisbane", "date": "September 17, 2011", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 4.0}, "id": 118229898}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "This is the only hotel we will stay in when at the strip area if Las Vegas. The rooms are all suites with a completely separate living room, with a gas fireplace, full bar, big screen tv and half bath. Then the bedroom is separated with a locking door, a huge bathroom a d large tv. Great if traveling with the kids. There is no casino unless you walk to the Mandalay Bay so there is no smoke in the lobby, elevators, halls or the rooms. The front entrance is sort of underground so it is very easy access and not in the heat in the summer. We have not been in the bars or restaurants but have heard they are very good. The front desk line is fast and efficient and best if all...awesome water pressure in the rooms. Like I mentioned this is the only strip area hotel we will stay at.", "title": "Huge suites/rooms and NO SMOKE SMELL!!!!", "user": "Bethannsd65", "date": "September 15, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118180190}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "We just got back from THE hotel and had a great time. Our friends were staying in Mandalay, so it was nice to compare the two rooms :) I actually liked the design of the Mandalay rooms better (brighter, funkier) and the standard rooms there are huge. It was nice for us to have the two-room suite, since there were three of us, but it was kinda cramped. We had a room right near the elevator, and the only noise we ever heard was the in-room air conditioning, which thumps on really loudly. Never heard another person on the floor though! I was expecting a long line to check-in when we arrived (as we've seen at other Vegas hotels) but when we got there, there was no line at all and we were checked in in minutes. Super fast elevators and never any lines (yes, there were lines to get onto the elevators at Mandalay!). The bathroom was HUGE and just SPECTACULAR. Loved the big huge bathtub!!", "title": "Nice hotel, awesome pool, but a hike from the rest of the strip", "user": "mrssmall23", "date": "September 15, 2011", "detail_rating": {"value": 4.0, "location": 2.0, "service": 4.0, "rooms": 3.0}, "id": 118153349}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Apparently early Sept is the perfect time to go to the Mandalay Pool, because we didn't have any trouble finding seats and there seemed to be plenty of empty chairs. Not a lot of kids or college kids. We tried to get a cabana on Sat and were told they were sold out, which is pretty impressive if compared to the lack of crowds every other day. Turns out the weather was crappy that day anyway, and they were going to charge us twice what we paid earlier in the week! We got cabanas on Thursday and Sunday - ours was in the West Lagoon pool - plenty of room for the 6-8 of us to relax, and cabana service was great. They could use some padded chairs with their cabanas - we went to the Mirage at the end of the week and their cabanas were SOOOO much nicer! But it was great to have a place to lock up our stuff, eat, and chill out in between pool runs. We brought our own tubes, which they blew up for us, but the cabana also came with tubes. Definitely worth the $300-400 that the six of us paid.", "title": "Good property, super crowded pool and bad restuarant service", "user": "VitaminM", "date": "September 14, 2011", "detail_rating": {"value": 3.0, "location": 4.0, "service": 2.0, "rooms": 4.0}, "id": 118114907}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "My husband ate at the cafe downstairs and said it was really good - way better than the red white and blue restaurant in Mandalay that we went to earlier (just average and overpriced). Room service food was average - nothing to write home about. I usually stay more center strip, so the biggest difference with THEhotel is that you wind up taking cabs everywhere. We did take the tram to Excalibur a few times, but that only gets you so far. Not sure if I'd stay here again, just based on the location. But if you're cool with spending your money on cabs, the pool is definitely worth it!!", "title": "Beautiful First Class Hotel", "user": "Handman", "date": "September 14, 2011", "detail_rating": {"value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 118112770}, {"rating": 4.0, "title": "Oh, baby! Worth it.", "text": "Much quieter than most resorts due to lovely lack of gaming. Staff are incredibly polite; immaculate suite; nifty amenities; cool toiletries.", "helpfulness": 1, "user": "vnogrl", "date": "November 21, 2005", "id": 4130734}, {"rating": 4.0, "title": "It was good but there were negatives.", "text": "I think it is worth your money for sure but there are negatives. The lobby is very nice with modern style art and it is nice to have a coffee shop in the hotel. I thinks parking is a big problem at Mandalay bay. If you want parking next to the hotel at Mandalay bay it is almost impossible. That way you have to walk through the casino and it gets very annoying. The layout is awful. It is really cool walking into the hotel. The elevators are also decorated with modern art. The rooms are worth the price and are nice. The service is exactly the opposite. They put us in a smoking room when we reserved non. You could smell the smoke and there were even cigarette burns on the sheets. That was really awful. The rooms are great. They are decorated modernly and with style. The sheets are some of the most comfortable sheets I've every felt. The TV is a 42\" plasma in the living room and a 27\" flat screen in the bedroom. All the rooms are suites with separate bedrooms and living rooms. All the rooms also have a half bath too for guest as well as a spacious bathroom. The main bathroom has granite and a enclosed toilet. There is also a 13\" plasma screen TV in the bathroom. The large bathroom has a glass enclosed shower and a deep soaking tub. I mean deep. The bathroom products are excellent over seven products in all. All in glass bottles and even oatmeal soap. The living room has a modern style desk couch, and 1 chair. The bedroom has a 2 closets with automatic lighting. They even put a label saying \"The TP\" on the toilet paper. It is a great hotel.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "November 20, 2005", "id": 4127779}, {"rating": 5.0, "stay_parameters": "Stayed November 2005, traveled on business", "text": "The suite we had was absolutely spotless. The decor was a little to contemporary for my taste. We had a nice view of the strip. Room service was excellent. The coffee shop and bar in the lobby were convenient and satisfactory. The staff very helpful and courteous at all times. The restaurants were expensive but worth the price. I was disappointed with The House of Blues food. Just adequate. Overall a fun experience. I would definitely stay at The Hotel again. Be ready to walk a great deal or take a cab.", "title": "The Hotel at Mandalay Bay", "helpfulness": 4, "user": "jetwhhs", "date": "November 16, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4121707}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "I'm a believer. Without going into a lot of detail, everything about this place was top notch and wonderful: decor in the guest suites and public spaces, furniture comfort (a completely different thing than decor) the food, and service (mostly). The hotel's association with Mandalay Bay gives guests full access to one of better, more upscale hotels with great amenities. The pool facility at Mandalay Bay is the best on the Strip.", "title": "The nicest in LV", "helpfulness": 8, "user": "machen", "date": "November 14, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4111747}, {"rating": 5.0, "stay_parameters": "Stayed November 2005, traveled on business", "text": "The spa on the second floor is beautiful, well-laid out, and staffed attentively. My wife liked her massage and other treatments but thought they were a bit pricey for what they were. Oh well. The gym was small but complete. The nominal daily spa/gym fee was annoying but was successful in minimizing traffic, so the facility was actually very calming and serene.", "title": "The Best in Las Vegas", "helpfulness": 13, "user": "ssnacksUSA", "date": "November 12, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4108383}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "I would like to start by saying that I did alot of research as to where I was going to take my wife for her 27th bday. After lots of researching, The Hotel at Mandalay Bay seemed like a great pick. And let me tell you, it was!", "title": "Amazing, one of the best hotels in Vegas", "helpfulness": 1, "user": "VancouverPimp", "date": "April 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 103638848}, {"rating": 1.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "It amazes me how people can put negative reviews on this hotel. They are either not well traveled and have ridiculous expectations, they have never been to other Vegas hotels, or are stuck up, rich snobs that would never be satisified no matter where they stay.", "title": "TRUST ME.. PASS ON THIS ONE", "user": "forgacs13", "date": "April 11, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 1.0}, "id": 103624042}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "I have stayed at The Paris, Ceasers Palace, The Rio, Planet Hollywood etc and a few others, and THE Hotel knocks them all out of the park. I have been into the Wynn, Bellagio etc and they all seem very nice aswell and I am sure are just as nice.", "title": "Good Hotel... Casual but upscale.", "user": "eos126", "date": "April 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 103487239}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The thing that I really liked about The Hotel, was the cleanliness! Everytime we came down from our room there were 6 or more people with dust mops cleaning the floors and another 3 or 4 people dusting tables, ledges etc. This place smelt and looked clean 24/7. We could never smell any smoke and overall, this made a huge impression. I LOVE the fact you pull right up to the lobby, just like a regular hotel, so you can avoid the Casino etc.", "title": "Lovely hotel would def stay again", "user": "Happyegg29", "date": "April 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 103383849}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "We arrived on a Thursday around 1pm....we were upgraded to a V Suite free of charge. We requested a room with a view of the strip and on the quiet side of the hotel. We were given exactly that. The V Suite is awesome, as the layout is better than the standard room as the bedroom curves around the corner of the building. The room we had was 32916 and I highly recommend this room. Nice view of the strip and corner view. ***PLEASE NOTE, if you are looking for a quiet room, make sure you request to be on the wing of the builidng that is not below THE MIX nightclub.***", "title": "Great room, generally poor service", "user": "njtraveler118", "date": "April 5, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 102987624}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "Amazing hotel, we had a TEHsuite with two beds, living room, big tub, shower all very luxurious. Great pool with beach, wave machine and lazy river. Remember to take your own tube/floaties because it’s expensive when you get there.", "title": "loved it", "helpfulness": 1, "user": "Debbie Y", "date": "October 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 5.0}, "id": 47567457}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "The hotel is quite a walk from the (man made) beach. You need to walk through Mandalay Bay & Casino.", "title": "3rd time back! November 1st, 2009", "user": "HappyHamptons", "date": "October 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 47526335}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Be prepared to pay for everything, including gym facilities!!!!!", "title": "Elegant and away from the noise", "helpfulness": 2, "user": "Jancake", "date": "October 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47361346}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Stay mid week for a bargain.", "title": "We always love our experience here. Luxury, quiet, quality.", "user": "pharmdeity", "date": "October 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 47299618}, {"rating": 1.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "THEhotel Resort and Casino in Las Vegas offers unmatched luxury, fine dining, renowned entertainment next store in the same hotel of the Mandalay Bay, personal service, and gaming excitement dreams.", "title": "Service was as bad as the SEWER SMELL that lingered throughout the hotel.", "user": "Mitch1976", "date": "October 18, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 2.0}, "id": 47165212}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Upon arrival to this hotel we drove up to the vallet and let them take care of the car. We only had to tip the guy a couple of bucks and they parked the car for us and brought our luggage to our room. Reception were very professional when checking in and helped any way they could. We had booked The V Suite and even though it was a little more in price on their website it was well worth it. The lounge had a great view and was large enough to have a party! The bedroom was very modern and comfy,another great view, huge TV in the room as well as the lounge - a smaller TV in the bathroom. The room has a safe which is free to use. The Bathroom we thought was the best part of this room, the bath was like a swimming pool and both me and my partner could fit in fully submerged. His and her sinks and a seperate shower. The toilet was part of the bathroom but in its own room (oh forgot the bathroom by the front door!) Lots of freebee shampoos/body lotion etc.", "title": "Fantastic hotel - especially if you have a suite!", "user": "Rovers2009", "date": "November 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48440204}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The Hotel at Mandalay Bay links directly to The Mandalay Bay and is a lovely hotel. It has its own beach and wave pool (this was very busy but we still found two sunbeds together) The hotel is at the end of the strip when the Encore and Wynn is the other end. Unless you cut through the hotels you have to walk on the road to get to the main part. Their is a bus called Duce which is cheap and is hop on hop off and is stops directly outside the hotel.", "title": "I guess this counts as intimate for LV", "helpfulness": 1, "user": "drabs", "date": "November 2, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 48359057}, {"rating": 5.0, "title": "Great Hotel", "text": "All in all this hotel is amazing and were definately going back.", "user": "Route66Wiltshire", "date": "November 1, 2009", "id": 48233297}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "The rooms are nice - ours had a small living room with a half bath, in addition to the bedroom and very large fix-fixture bathroom. It's connected by a 2 minute walk to the Mandalay bay casino. The spa is nice, but kind of dark and eerie since there are no windows. The gym is a very odd light...I preferred the gym at Mandalay Bay, which is a little bigger and gets natural sunlight. The gym is $20 per day, or $30 if you want to use the jacuzzi and soaking tubs.", "title": "Nice hotel, not a great location", "user": "PCDVC", "date": "October 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 48190796}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Room service was pretty quick, but an omelet was $20 and not very good. Also, they charge $2.50 per person for silverware, etc, which is a little strange.", "title": "Beautiful Disappointment", "user": "Foodlover9", "date": "October 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 48061658}, {"rating": 5.0, "stay_parameters": "Stayed March 2011", "text": "As I'm typing on an iPhone i will keep this brief. This hotel was lovely. Stayed in one of the suites for 4 nights 11th-15th march 2011 room 18803. It was huge, lots of space, two toilets, flat screen tv in bedroom, bathroom and lounge. Free wi Fi, lush soft mattresses on huge beds, free extra soft robes, etc etc. Very very nice. Also free parking which is always good and we hired a car to go to the canyon so that was handy. The actual hotel is a separate building to the Mandalay bay itself but it only takes a moment to walk across. Mandalay bay is where the casino and pool and most other amenities are such as restaurants, buffets etc. There are a couple of cafes in THE hotel but you are close enough to everywhere to be able to have the choice as to where to go. The hotel is on the south of the strip very very close to the airport. Infact you will be a stones throw from the hotel when you land, so very quick transfer times also. The hotel has a free monorail from Mandalay bay to the Luxor and the Excalibur which takes only a minute, or you can walk. We walked a lot of the time as the weather was lovely and why wouldn't you ? However most people over there didn't walk much and you will see clearly what I mean when you go! There is so much to see and do in las Vegas I wAs surprised and never for a second bored. We managed to cram so much in to 4 days. If you are going then the Hoover Sam and canyon are a must if you have never been before. Hoover dam by car is about 35 miles. Great pictures!! The shows are amazing!! Check out 'o' at the bellagio. Other free must sees whilst you are there include the wonderful fountains of bellagio show. Outside the bellagio hotel on the strip, it's a water fountain show to music and it's fabulous. Also, the volcano show at night at the mirage hotel is well worth 10 mins of your time. Last show at 11pm! They feed lions at the MGM grand hotel throughout the day, worth popping in for ten mins. There is a monorail that goes from the MGM grand hotel right up to the north of the strip it's 5 dollars single ride. We did it for the experience but if there are a few of you it's cheaper and faster to get a taxi. The fares are all set by the government so very fair. Back to the hotel, there are lots to choose from on the strip and some look very tacky indeed. This hotel wasn't at all. It's five star, comfortable and well cleaned with all the little luxuries thrown in for free. The only pain is the 18 dollar per room per day resort fee. They all charge it though so don't blame this hotel too much and some fees are more than this. Luckily if you book through virgin holidays for either the package or hotel only, as we did, you don't have to pay them!! I could go on about this lovely place but the phone battery is about to die. Happy to answer any hotel or location questions just send a message! Oh, don't use the mini bar it's a complete rip off, don't even accept the key from reception when they offer it!! And don't use the hotel phones it's about 10 dollars per minute for calls abroad!", "title": "Going back in June it was that good", "helpfulness": 2, "user": "scott_cop", "date": "March 23, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 101204718}, {"rating": 1.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "The rooms are OK. The front desk staff -- not so much. There were lines there at all times. The desk is down a long hallway and the hotel is too far away from the convention center and restaurnts. Areas were dark, deliberately so, but made it feel like a cave. With so many other places to stay, I wouldn't stay here. Four Seasons was much more convenient and nicer if you must stay in this area.", "title": "Terrible service, too much walking", "helpfulness": 1, "user": "flc101", "date": "March 18, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 1.0}, "id": 100612813}, {"rating": 1.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "I stayed at the Hotel at Mandalay Bay as my professional association was having a convention there. I reserved a room with a king sized bed, and, close to the elevators as I have a problem walking. When I arrived, I was given a room with two queen sized beds (no big problem) but, it was at the end of the hallway. When I complained to the front desk, the girl took a totally I do not care attitude. Finally, after complaining to someone else, I was moved the next day.", "title": "DISGUSTING AND POOR SERVICE", "user": "bnj1225", "date": "March 15, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 100271249}, {"rating": 1.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "The rooms were very worn and dated. They claim the change the bed linen every day, but do not. One day, I left a small drop of blood on the sheet when I was testing my blood sugar level. The same sheet was there the next day. The living room of the suite I had was very small. Food is horrificall expensive in all of the restaurants. At at discounted rate of $249 a night, it was certainly not a pleasant experience. I will never stay there again. Also, they want to charge you $18 a day for the Internet access, a newspaper (which I never received) use of the health care facility (which I never had the time to use) and a free drink in one of the restaurants.", "title": "So disappointing", "helpfulness": 1, "user": "2_Tosa_Travelers", "date": "March 14, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 100145269}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Where to start.... There are so many nice things to say about THEhotel, but our room was not one of them. Upon arriving to our 5th floor suite, I wanted to open the curtains to get a view of the Strip, only to find our view was that of a very nice brick wall and the other window had a view of the convention center parking lot. We were awoke daily at 7:00 a.m. by the noise of trucks backing up and forklifts performing a load-in for a convention. Wow, I had booked this trip four months in advance and this was the best they could do? We had some very nice robes hanging in the closet for our use during our stay. Unfortunately, I did not pay close enough attention and slipped it on after a shower. When my husband was going to put on his robe, he noticed that the robes were not clean. The robes were heavily stained inside and had hairs imbedded in the fabric. YUCK!!! I notified the hotel and they eventually brought clean robes for us to use. We never did receive an apology for wearing someone else's filthy clothes. Finally, the concierge somehow screwed up inputting information on my credit card and my credit card was froze due to the credit card company thinking there was fraud. The most amazing thing is that on our way home I received a survey of our stay. I have never received a follow-up to the survey. Lesson learned, I will never stay at THEhotel again.", "title": "Nice stay, excellent amenities", "user": "j9logan", "date": "March 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99826761}, {"rating": 5.0, "title": "Swank Digs on Southern End of the Strip", "text": "Cool, understated (earth tones/dark woods) decor in spacious luxury suites and urban/modernist chic provided here. Plasma (LCD?) screen TV. Lots of black, somewhat cave-bunkerlike. Comfy lounge/cafe area, away from the din of the nearby Mandalay Bay casino. Friendly, efficient staff. Room service food quality is average; good food and atmosphere at House of Blues, great food and ambience at 3950, great vodka (over 100 varieties) and atmosphere at Red Square - all a 3 minute walk from TheHotel. The Bathhouse Spa is wonderful - don't miss it! A little inconvenient if you want to stroll around the center Strip area - taking the tram to Excalibur, crossing over to the MGM Grand to catch the monorail to head 2 to 3 stations north might take about 20 minutes. Would stay here again for the $149-169 special!", "helpfulness": 8, "user": "SusanOb75", "date": "November 27, 2005", "id": 4146186}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "I was wondering what to expect after reading some of the negative remarks back in August and September. We spent our wedding night at Thehotel on November 5th. I was very excited to get an early check-in at 10:30am on a Saturday morning. Everyone was so pleasant and helpful. My luggage arrived very quickly and the bellman offered to show off the features of the room. We had a corner suite strip view. Very impressive!! I loved the modern chic decor and the calla lillies everywhere. We tipped the maid just to make sure we were well taken care of. The maid was very helpful in assisting us with ice. Our room was spotless. If you want turn down service please be sure to call and request it. When we came back later that evening after the wedding, I was impressed how the maid had our bathrobes laid out on the bed. Very nice touch. It is not a far walk to the casino.. I don't know what these people who talk about walking and walking are talking about. Maybe they need exercise or something.", "title": "It's the Bomb-Digity....", "helpfulness": 13, "user": "jefritz", "date": "November 25, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4144087}, {"rating": 5.0, "title": "Simply the best", "text": "We did order room service which was a bit pricey but that is generally expected. When we were at the Ritz in New Orleans in August, room service was a lot more money.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "November 23, 2005", "id": 4139057}, {"rating": 3.0, "title": "Service could use some help", "text": "We hosted a cocktail party in our room and a lot of our friends who flew into Vegas for our wedding were very impressed with our room.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "November 22, 2005", "id": 4136565}, {"rating": 5.0, "title": "In love with TheHotel", "text": "That bathtub! That was to die for. I filled it up with bubbles so high that by the time we got in it we were both lost!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "November 22, 2005", "id": 4136449}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "As a frequent summer traveler to Vegas I try to stay in a different Strip property each time, hence my first visit to The Hotel (Mandalay Bay). My cab ride from McCarren Airport to what should have been one of the closest properties was an outrageous $25! (\"magically\" only $15 going out) Upon arrival @1300 on a Monday, the check-in was quite fast and smooth, I had a 'V' Suite on the 22nd floor and loved it! the floor to ceiling windows in living and bedrooms gave me magnificent views of both the strip and mountains. I was immediately taken by the earth tone dark decorative style of the room, the Keurig coffee maker was a brilliant touch! all the staff I encountered greeted me warmly which I appreciated. My pool experience was both good and bad, I was somewhat surprised at The Wave Pool, all the pictures/videos Ive seen made it appear larger, of course it was over-run with kids which was to be expected, loved the beach sand. If I were made Dictator I would immediately institute a rule that Europeans using North American pools are expressly forbidden from wearing Speedo's! please, not after I've eaten! some of that imagery will scar me for life. I would have to say my over-all experience was a good one especially since Mandalay rewarded me with $400 in slot winnings :)", "title": "The Good, The Bad, and The definite Ugly!", "helpfulness": 2, "user": "Doug95B", "date": "July 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 134977351}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "We ended up at THEhotel at Mandalay Bay really by chance. I'm guessing Mandalay Bay was full because they rebooked our two rooms at Mandalay in the adjoining tower: THEhotel.", "title": "In a city of superlatives.... this is not (but still quite good!)", "helpfulness": 2, "user": "copa777", "date": "July 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 134926437}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "There is no much of a difference staying at THEhotel. It's just a different tower than what they dub Mandalay Bay. All the same restaurants and pools are still accessible.", "title": "Best hotel in Vegas - by far", "helpfulness": 1, "user": "NaomiBTravelin", "date": "July 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134920164}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Mandalay Bay has one structural problem: when it's full, the two elevator banks are overloaded. At any time of the day or night there may be 50 people waiting to take one of two banks of eight elevators. This really got to be annoying. When we tried to leave, we had to pass up the first three elevators because they were already packed!!!", "title": "#1 Family Hotel in Las Vegas??? If you are over 48\" tall.", "helpfulness": 1, "user": "BusTraveler2012", "date": "July 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 134771818}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Also, there were often long lines at the front desk at Mandalay (though in fairness, the lines moved much quicker than at the Cosmopolitan Hotel). This brings up one of two main advantages of THEhotel:", "title": "We'll be back", "helpfulness": 1, "user": "HappyHammer69", "date": "July 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 134588650}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "Stayed here the last few days of a week long trip. My husband and I had an excellent time here. The suites are spacious and the extra bathroom is great when traveling with a man. Easy to get from the suite to the casino floor and this great little yogurt place, YOGURT IN.", "title": "THe Hotel is THe Great Place to Stay", "user": "thinkn333", "date": "March 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 99825049}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We spent some time up in the bar area, MIX. Worth taking some time. Excellent view of vegas and you can sit outside, enjoy the fantastic view, stay warm and still here the music.", "title": "Spectacular hotel, great rooms", "helpfulness": 1, "user": "areview28", "date": "March 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99820692}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "Housekeeping was good.", "title": "Great hotel & value!!", "user": "TarHeelsareBest", "date": "March 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 99797781}, {"rating": 3.0, "stay_parameters": "Stayed February 2011", "text": "I booked a basic king suite at THEhotel and was amazed at its size. There was a half bath off the entrance and a very large bathroom off the bedroom including shower, bath, and two sinks. The large lounge area had a wet bar, sofa, lounge chair, and desk. There were 3 televisions and a DVD player. Furnishings were very upscale and the view was great. Quite a value for $120 plus tax. You are charged a $20 per night resort fee which includes two drinks, fitness center access, Mandalay pool access, and fast Internet. THEhotel's lobby is right off a shared garage with the Mandalay, so you don't have to walk through the casino to get to your room. If you park on a higher floor of the garage, take the elevator down to the first floor and cross the garage first floor to directly enter THEhotel. Highly recommended.", "title": "Nice but no value", "user": "dbefus", "date": "March 5, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 99050982}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "This is the 2nd time staying here. One of the nicer hotels. I got a nice suite for same price as regular room at Mandalay Bay. Room was clean and had no noise issues. Highly recommend this hotel", "title": "Stay at the Bay", "helpfulness": 2, "user": "showme7or11", "date": "February 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98379642}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "We reserved a room for Mar 25/11. We decided to use the sports lounge for our free drink ticket, the service was terrible. We had to get our own drinks while 4 waitress's stood around chatting with each other. Although the bartendter was great, we decided not to go there again. We liked the the room, the king sized bed and mattress was great. Room was very quite eccept for some party people inthe hallway at 3:00 AM in the morning. The best experience was the buffet, food was excellent. price without drinks was approx. $65.00 for both of us without drinks excluding drinks and extra tip for a very talkative waiter. Self parking is also very good, no complaints.Location is good if you have your own vehicle to get around. We called the front desk about checking out early in the morning, they said not to worry, we would get a receipt e-mailed to our e-mail address. Today is April 3/11 after 4 request I still do not have a receipt. The lady I spoke to in accounting was not friendly at all, to the point of being rude. Although she did assure me that I would receive a receipt promply. Since speaking with her I have sent in 3 additional requests for a receipt but absolutly no response. I can accept the poor service in the lounge, maybe the girls where having an important meeting. But I cannot accept the problems with getting a receipt for the room.", "title": "Never Again!!", "user": "gambler60", "date": "April 3, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 102659637}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "I was upgraded to a one bedroom suite with an amazing view. It is perfect for a business traveler since there is a separate valet in the back and you don’t have to walk through the casino to get to your room. There is a coffee shop right by the elevators and the front desk is just around the corner. The stuff was very helpful and accommodating. The room felt more like a furnished apartment than a hotel.", "title": "Great Las Vegas hotel for a business traveler", "helpfulness": 1, "user": "AA75", "date": "March 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102068438}, {"rating": 4.0, "stay_parameters": "Stayed March 2011", "text": "On arrival received free upgrade to a suite so this hotel was already impressing me. The Hotel has nice clean hotel rooms with all the features needed for the business traveller. Soft furnishings are comfortable and the showers are warm and powerful. Unfortunately the noise travels up and down the hall way and into your room so it can be annoying if your trying to sleep. The lighting in the lobby is very dark and to find the front desk can be difficult for first timers. Overall I liked the place but don't really like Vegas so won't be coming back.", "title": "Interesting Name for a Hotel", "user": "Njsa", "date": "March 26, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 101633298}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "Girlfriends weekend away was spent in the beautifully appointed THEhotel at the Mandalay Bay. The large suite accomodated all 4 girls, had 2 bathrooms and a separate bedroom with 2 queen beds in addition to the main living room. We were treated like Queens for the weekend, with champagne and chocolate covered strawberries, what more can you ask for?", "title": "Luxurious stay - first class service", "helpfulness": 2, "user": "fishiana", "date": "March 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 101425724}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "The wave pool and sand in the Mandalay Bay were exceptional! The two hotels are connected, but there are separate lounges, and restaraunts for each. What a great complex, it made up for the fact that it was on one hand of the strip. The only thing that would have made this even more perfect is for it to be situated in the middle of the strip.", "title": "No plans to stay anywhere else in Las Vegas", "helpfulness": 2, "user": "pagriego", "date": "March 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101257938}], "location": {"country": "United States", "city": "Las Vegas"}, "stars": 4.5, "variance": {"poor": 230, "average": 364, "very good": 1037, "terrible": 175, "excellent": 1978}, "aka": "Thehotel At Mandalay Bay Hotel Las Vegas", "slim_ranking": 0.0962962962963, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.0}}