{"user_rating": 3.5, "review_count": 683, "name": "Thistle Manchester City Centre, The Portland", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We stayed in the Thistle in Manchester for four nights... was supposed to be all inclusive holiday but it turned out to be a disaster..... the staff decided to change the booking price challenging the ref numbers given on booking... they took the full payment on the credit card on the first day of the stay so we had no come back on the fees they were charging... upon challenging the amount there was no senior staff available and the reception staff were completely dismissive of the complaints and would not make any effort to help... we feel we were ripped off with no proper appology from any member of staff... it is not a hotel i would reccomend or stay in again", "title": "exceptionally bad customer service in the hotel.... brought down the holiday", "user": "mmcgrath3", "date": "July 14, 2008", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 17875266, "likes": {"liked": "— the food", "disliked": "— the staff"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "Right in the centre of Manchester and no more than a 10 minute walk from Manchester's Picadilly station. Get a cab if you have cases though - cost you £5 or £6 and better than back strain! The hotel is quite grand and at some point in time quite a bit of money was spent on making it look nice and modern. Things come full circle though and it's time some more money was spent on it to bring it up to date! The hotel is comfortable though the rooms seem on the small side - functional I guess. I was on a business trip so just using the room for sleeping in. The hotel has all the facilities you would expect of an establishment that caters for both the business client and the tourist. Bars, internet access, restaurants, etc etc. Unfortunately one thing that stands out for me though was how ruthless the staff on reception are in terms of making sure you pay for everything you have - immediately! I had a meal in my room that I tried to book to my room. This was declined and I had to go straight down to reception to sort it out and pay. It would appear they like to get the money out of you asap. Apart from this slight down point the hotel is good in most every other way. Good central location for finance and business centres and ideal for shopping. Value for money? Not bad for a city centre hotel. Shop around and see what else you can get? Yes - I would. There are several other hotels of similar standard in the same area and at the end of the day they're all trying to get your business!!", "title": "Functional", "user": "hooglemeister", "date": "July 1, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 17417233, "likes": {"liked": "— It was in Manchester which is where I needed to be!", "disliked": "— The guys on reception and their robotic attitude to customers"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "From the website the hotel looks promising, however I was very dissapointed.", "title": "Customer service not a priority at the Thistle!", "user": "Sambobsquarepants", "date": "June 6, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 16719096, "likes": {"liked": "— Pool", "disliked": "— everything else"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "Firstly there is no carpark and you need to allow £11 a night to park in a grotty urine soaked carpark.", "title": "Basic, but handy for city life", "user": "DoubleBubble", "date": "May 13, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 15983345, "likes": {"liked": "— Central location", "disliked": "— No air con"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "On arrival I found the staff to be rude, and throughout my stay I wasn't made to feel a welcome guest. The reception manager disagreed with me that the advertised time for the leisure facilities, Its quite different from what they are (Sunday the pool shuts at 12pm) and I had to ask daily for someone to offer me a cup of tea at breakfast.", "title": "The Excellent Thistle", "helpfulness": 1, "user": "Essexblue", "date": "May 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 15936746, "likes": {"liked": "— The food", "disliked": "— The bed"}}, {"rating": 1.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Stayed for two nights and will never return. On the Saturday the hot water was broken and remained so all day. On the Sunday morning the fire alarm went off at 05:30 so we had to evacuate for half an hour. If it had been a drunk setting it off I'd say, \"Hey it happens\" but it was due to the previous days issue with hot water so it was the hotels own fault.", "title": "Dumpsville", "helpfulness": 2, "user": "Angry-Rebel", "date": "January 14, 2008", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 12598298, "likes": {"liked": "— Location", "disliked": "— Rundown nature of hotel and some rooms"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The entire hotel is grubby and in need of renovation. The bar is about the only nice area but during our stay they only had two beers on tap (all of the other taps were covered off and not working).", "title": "Average", "helpfulness": 2, "user": "hunkahairybear", "date": "December 23, 2007", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "location": 5.0}, "id": 11912553, "likes": {"liked": "— Location", "disliked": "— Everything else"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "Had problems from the 1st minute, had to ring them for directions. On ringing hotel, the guy had no idea what was next door to his own hotel. Eventually we found it and were advised that our car would be parked for us and we checked in. BE ADVISED THIS COSTS £11 TO PARK!!!! This wasnt explained on arrival. We couldn`t get into our room as the card wasn`t working when we did get in the room was small and stunk of fags, we asked to be moved and indeed we got another room. This was also small. Our next door neighbours were talking all night and unfortunatly the walls were VERY thin so this was a problem. Breakfast next day was poor, we had to wait 20mins for a table and it was a bit of a free for all. Toast had to be ordered, which came after we ate our meal. Also be aware in Manchester there must be a butter shortage given the amount we got. WILL NOT GO BACK.", "title": "Run down and worn out", "helpfulness": 2, "user": "Objectivisttraveller", "date": "December 5, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 11264155, "likes": {"liked": "— Location", "disliked": "— Tatty cold room"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "There were few other choices by location and price at the time given it was a short notice trip, but for £110 I expected a bit more (though I had stayed there a year before). The staff at the front desk were helpful and so was concierge when I phoned to ask for a blanket. However this place is badly in need of refurbishment or demolition. So what's wrong?", "title": "Niceley Situated Hotel But In Need Of A Facelift", "helpfulness": 1, "user": "SteveHammer", "date": "November 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 10843257, "likes": {"liked": "— The breakfast", "disliked": "— Nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "1. Toilet continuously flowing, all night long, trickling sound.", "title": "Grubby", "user": "L Smith", "date": "November 6, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 10647594, "likes": {"liked": "— Leaving", "disliked": "— The rooms"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "As a wheelchair user I'd booked an accessible (or as they put it 'disabled') room, and although I was traveling on my own on business this meant I had to have a double room.", "title": "Disappointing", "helpfulness": 1, "user": "ClaireCarlisle", "date": "May 10, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 15876649, "likes": {"liked": "— Location, very central", "disliked": "— wheelchair access, uncleanliness,"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "On arrival at the hotel someone showed me to my room. The door opened into the room and the bed was in front of you, then to the right the door to the accessible bathroom opened outwards into the main room. The problem was that there was no room between the bed to allow the bathroom door to open outwards into the room, and definitely no room to get a wheelchair through the door into the bathroom, and I couldn't even get round the bed to get to the tea/coffee making facilities, TV etc. When I told the man this he was surprised, I said I was booked into the accessible room, he said this is the disabled room! We agreed that if he moved the bedside table furthest from the door and moved the bed over then I’d have room to get round the bed, open the door to the bathroom etc, so he did that. However when he'd moved the bed that revealed loads of dust on the laminate floor under the bed, and a telephone socket pulled out of the wall, and stuck back on with brown tape.", "title": "Should Have Stayed In A Travelodge", "user": "Shell_J", "date": "May 1, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "location": 4.0}, "id": 15549365, "likes": {"liked": "— Location", "disliked": "— Poor Value For Money"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "I went downstairs to check out the pool only to find out it shut at 8, despite the in room literature saying it shut at 8.30. As someone else has said, it is tiny, I didn't know they did pool so small! It didn't really seem worth getting changed for.", "title": "Don't go just for the pool", "user": "freakyjouk", "date": "April 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 15489444, "likes": {"liked": "— Location", "disliked": "— Pool is a dissapointment"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "The buffet breakfast was ok, but for a 4 star hotel disappointing.", "title": "Excellent", "helpfulness": 1, "user": "excellentCorkIreland", "date": "April 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 15185769, "likes": {"liked": "— location", "disliked": "— nothing"}}, {"rating": 2.0, "title": "Not great but cheap and central", "text": "I stayed at the Thistle recently as I was attending a conference at the nearby Midland Hotel (sadly they had no more rooms available).", "helpfulness": 1, "user": "Beckie08", "date": "April 7, 2008", "id": 14850660}, {"rating": 2.0, "stay_parameters": "Stayed July 2008", "text": "There are major exterior renovations going on right now, and all you see is scaffolding. Old, shabby hotel. Rooms are small. TV did not work well. Just not a lot to say.", "title": "Do not bother", "user": "bayhomes", "date": "August 17, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "location": 3.0}, "id": 19050697}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "About 6 blocks from the train station, so location is ok. Right downtown near Picadilly Gardens. Not much to see or do. About 30 minutes from airport.", "title": "Hot in the city", "user": "KfromBelfast", "date": "August 14, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 18963343}, {"rating": 1.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "My inital thought was \"not too bad\", particularly after having read the reviews. The hotel is centrally located, I found the staff friendly and the room was clean, if fairly small.", "title": "seriously out-of-date and overly expensive hotel", "user": "rachelshears85", "date": "August 4, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 18597503, "likes": {"liked": "— the breakfast", "disliked": "— the price, the room, it all needs to be completely refurbished"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled solo", "text": "My main problem was the lack of air conditioning, I ended up being far too warm at night so left the window open on the second night and there was so much noise it was hard to sleep.", "title": "Very Good Hotel", "user": "volnak", "date": "July 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 18443860, "likes": {"liked": "— Clean room, excellent customer service, excellent location", "disliked": "— Pool too small, lobby too small, no computer room."}}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "The fire alarm went off at 7 am and all the guests were evacuated for about 20 minutes. Obviously this was not the hotel's fault, I believe it was a small fire, rather than a drill, but I was surprised that this was not later mentioned by any of the staff or by a explanatory note to the room when they sent the bill to my room. The whole thing was very disorganised with no member of staff approaching guests to explain what had happened etc..", "title": "Stayed in Better Hostels", "helpfulness": 1, "user": "PA2008", "date": "July 22, 2008", "detail_rating": {"front_desk": 3.0, "service": 1.0, "business": 1.0, "cleanliness": 1.0, "rooms": 1.0, "location": 4.0}, "id": 18128012, "likes": {"liked": "— n/a", "disliked": "— air con units"}}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 68, "average": 175, "very good": 230, "terrible": 89, "excellent": 121}, "aka": "The Portland By Thistle, Manchester Hotel", "slim_ranking": 0.406779661017, "description": "Located in Piccadilly Gardens in the heart of the city, we’re just five minutes’ walk form Picadilly Railway Station close to some great attractions, the Arndale Centre, China Town the Arena and Manchester central are all a short walk away. The Portland was one of Manchester's first hotels and has a modern feel. Just Gym with a plunge pool and Jacuzzi is available in the hotel."}