{"user_rating": 4.0, "review_count": 584, "name": "Thompson LES - A Thompson Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "I found Thompson LES to be comparable to other boutique hotels I have tried in most respects, with the notable exception of their service, which greatly exceeded my other experiences.", "title": "Service was outstanding - New Years 2013 stay", "user": "Worldbeatconnection", "date": "January 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 150609772}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "In particular, our reservation was complicated as we had three rooms booked using booking.com, we changed the names under which the rooms were booked, we cancelled a room, we arrived at different times so the confirming credit cards were not always from the people who were staying the room, etc. This created a few billing issues a the end which I do not attribute to being the fault of Thompson, more to do with the complexity of the transaction(s). They remained professional, cordial and helpful at ALL TIMES during the discussions that I had with various staff, in particular Sebastian at the front desk, with whom I spoke numerous times. In fact, they were helpful on premise, by email and by phone. They also tried to make sure we understood what the next steps were and made recommendations for follow-ups that were beyond normal service requirements. They never made us feel as though we were being unreasonable and apologised numerous times for any adjustments that needed to be made. In other hotels, I could imagine a somewhat less courteous approach would prevail.", "title": "Cool hotel, Hot location", "user": "ibuk01", "date": "January 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 150331499}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "In terms of the rooms, etc., they were reasonably sized and decorated for an upscale boutique hotel. The bar service was also excellent.", "title": "Trendy stay in the LES", "user": "Megan M", "date": "January 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 150269415}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "The gym was slightly cramped, but functional and did not feel so much as if it were in a basement (which it is).", "title": "My favorite hotel in NYC!", "user": "JShelby1", "date": "January 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 150218302}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Hats off and a big thank you to them!", "title": "An absolute glamour gem!", "user": "christy5769", "date": "January 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149996912}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We stayed for 5 nights in February and had a wonderful time at the Thompson LES. Its incredibly central and so much is walkable from here. i would 100% disagree with any review that says the hotel is noisey. I stayed on the 8th floor (apparently the bar/club is on the 7th) and i didnt hear anything for the entire time. Nor did i hear anything from the restaurant. The hotel never felt busy or crowded and was always spotlessly clean with very friendly staff. I asked for a late check out and it was obliged, we also arrived early and our room wasnt ready but another one was found straight away as we were keen to get in after a long flight. Everything about the room (a junior studio suite) was perfect - great shower, great bed and lighting and fab TV plus great views. Best hotel ive stayed in in NYC.", "title": "Great stay in perfect location", "user": "Sara28London", "date": "February 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152974554}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "As a life-long New Yorker - until 2 years ago - I never really stayed in NYC hotels.", "title": "Feeling Important", "user": "ChristianColasuonno", "date": "February 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 152819285}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Ive been to plenty hotel bars, but never the rooms ;)", "title": "Quick getaway at a great hotel!", "user": "Maryhrava", "date": "February 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 152631990}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "However, now that I moved out and come back for work - I finally get to see what I was missing.", "title": "Great stay", "user": "Nicole V", "date": "February 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152442467}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "The Thompson LES was all - class. Rooms weren't big - but they were sleek, modern and chic. I was definitely digging it.", "title": "Great Experience", "user": "vinny d", "date": "February 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152435206}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Helpful and polite staff (bellboys, cleaning crew, concierge, front desk etc).", "title": "Perfect", "user": "Fernandohamaoui", "date": "February 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 152205444}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled solo", "text": "The room was pretty great. Well furnished, good size considering other hotels in New York. Great View. At first, when reading the other reviews at trip advisor I was worried regarding noises at night. I simply asked for a room for from the bar. I recommend this hotel.", "title": "Great rooms, outstanding service and great LES location", "user": "Janet B", "date": "February 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152192024}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "Stayed at the Thompson LES in February 2013 for 2 nights. On check-in, the front desk staff was extremely friendly and helpful. My room was gorgeous and very comfortable and quite large for the price by NYC standards. The staff was friendly throughout my stay. This is a great location in the LES. Only a few blocks from Starbucks, the Tenement Museum and Clinton Street Bakery. I would highly recommend this hotel.", "title": "Great Lower East Side Experience", "user": "MattForrest", "date": "February 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152001871}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "Staff was very on point, helpful, and happy. Casual yet classy in a good way. Enjoyed every aspect of my stay there, and will definitely return to another Thompson property in the future. Check their facebook/social media channels for special perks & rates!", "title": "Excellent stay", "user": "jerseygirlDublin", "date": "February 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151988269}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "I have been meaning to write this review for some time,...i stayed in this hotel in March 2012 and was very impressed by it. The rooms were very modern and clean and comfortable. The location of this hotel is ideal for blending in with the locals. some great bars and restaurants close by and has a subway station right across the road so its very easy to get around the city. This was my first time to New York and staying in this area made the trip even more amazing...i would definitely recommend this hotel for anyone wanting to mingle with New Yorkers and not base themselves in the usual tourist spots. The staff at LES were extremely helpful and polite.", "title": "AMAZE-ED", "user": "Nevine R", "date": "February 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151482381}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "I stayed at the Thompson LES in September for my birthday. It was absolutely perfect. There was a better room than the one I had booked so they offered me a great deal and I took it. It was a corner room, which had a breathtaking view of the city, a view of the pool and some privacy. I went in the pool the next day, which is just an amazing gem to have in the middle of NYC. The staff was so helpful and friendly, it was one of the best hotel experiences I've ever had. We hung out at the hotel until we went on a booze cruise out of the South Street Seaport, came back and wound down on the balcony as we looked at the night skyline. Bed was really comfy and the room was very well-kept. There's no place I'd rather have been with my friends to celebrate my 25th birthday. I'll be returning in a few weeks to stay for a night for a concert at Terminal 5 and I can't wait. THANK YOU!", "title": "Thompson LES September stay", "user": "GratefulKait", "date": "February 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151465786}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "We stayed here for a weekend and it was an excellent choice. Friendly and helpful staff! Wonderful view of the LES, the rooms were very elegant and comfortable. we'll be staying here each time we come to the city from now on!!", "title": "Birthday Weekend", "user": "Cristin912", "date": "February 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 151461239}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Very modern, clean and comfortable room with modern bathroom. Separate shower, toilet and wash areas make it convenient. Fantastic views. The restaurant has excellent food and very good service. Good location in Manhattan and easy access to Chinatown, Little Italy and Lower East Side location. Only negative was the daily $15 fee for internet. It's one of the few places still charging fees for internet.", "title": "Weekend Stay", "user": "Marty K", "date": "February 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 151248325}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "The staff exceeded expectations: we had checked into our room but there was an issue, so within minutes Justine placed us in another room (suite upgrade) and made sure all our needs were met. This doesn't happen all the time and it was greatly appreciated. Valets were very helpful, friendly as were the bartenders and waitstaff. Room was large, very cool, and had a great view of lower Manhattan. I look forward very much to coming back and staying at the Thompson LES. Robert", "title": "Visit weekend of 1/25/13", "helpfulness": 1, "user": "robertvol77", "date": "January 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 150865066}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The Thompson LES is an excellent hotel for exploring the Lower East Side. The rooms are modern and comfortable, and the staff is friendly. The hotel is close to amazing bars, restaurants, and shopping. We'll be back.", "title": "Excellent Hotel on the Lower East Side", "user": "Joseph O", "date": "January 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150765084}], "location": {"country": "United States", "city": "New York City"}, "variance": {"poor": 36, "average": 73, "very good": 151, "terrible": 26, "excellent": 298}, "aka": "Thompson Les New York City", "slim_ranking": 0.194130925508, "description": "This wonderful New York hotel is located less than five minutes from the 2nd Avenue Lower East Side subway station.Featuring modern decor, an outdoor pool, 1,200 square foot fitness and renewal center along with Blue Ribbon’s famous Sushi Izakaya Japanese restaurant, the property is sure-to-please.The modern rooms at Thompson LES start at 325 sq. ft. with many being 550 sq. ft. going up to their beautiful Thompson Loft at 2,000 sq. ft giving all travelers plenty of room to spread out.All rooms feature floor-to-ceiling windows with black accents. They are equipped with a flat-screen TV and an iPod docking station. A minibar is provided and late-night In Room Dining is available. At Blue Ribbon, guests may enjoy sushi and other Japanese appetizers along with fresh signature dishes such as pork ribs, fried rice and a selection of roasted meats.Business center services are available through the concierge desk. The hotel has valet parking and complimentary coffee in the lobby each morning until 9:30AM for all guests.Above Allen, an exclusive terrace lounge for hotel guests and members only, is located on the 7th floor of the hotel.With the hotel being just a 15-minute walk to Little Italy, 20-minute walk to Greenwich Village and a short subway ride to Times Square, the Thompson LES is a wonderful option for anyone traveling to New York City.We look forward to welcoming you soon!"}