{"user_rating": 4.0, "review_count": 593, "name": "Thong Ta Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "A seven hour layover is always a chore. This little gem goes someway to ease the pain. Simply book a room (around $30 AUD) and you will picked up from gate 4 and transferred to the hotel in around 7 minutes.", "title": "Simple offerings", "helpfulness": 1, "user": "Brett F", "date": "September 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 5.0, "service": 3.0}, "id": 117565740}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Rooms are large and clean. Small Shower and bathroom, checkin and checkout is typical Bangkok Crazy....lots of people doing the one chore...no sense of urgency but what do you expect fro 30 bucks?", "title": "Relaxing hotel near airport", "helpfulness": 2, "user": "GradStudentSpouse", "date": "September 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117528819}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "I managed a shower, 1 hour massage (for about $20) and three hours sleep! That is how to spend a 7 hour layover!", "title": "Decent hotel", "user": "echan159", "date": "August 28, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 2.0, "value": 3.0, "service": 3.0}, "id": 117356894}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "Always use this place for short stopovers..markets and food stalls everywhere outside if you want to stretch the legs and tempt your belly!", "title": "perfect for airport tranfer and affordable", "helpfulness": 1, "user": "Abbiecus", "date": "August 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117101777}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "This hotel made life easy, with a shuttle to and from the airport. We thought \"resort\" was a bit of an overstatement, as this seemed more like a comfortable hotel without resort amenities. However, there were nice touches like English novels to read in the lobby and fun towels folded like elephants in the rooms. There was a spa area, but it didn't seem to be open, plus for a massage, there were plenty of more affordable shops nearby.", "title": "Was OK", "user": "rebecca l", "date": "August 20, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 3.0, "service": 4.0}, "id": 116975680}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "My second stay this year in this hotel which offers free pickup and return to airport.", "title": "Close to Airport", "helpfulness": 2, "user": "degilbo", "date": "August 18, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 116898564}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Again a overnight stay to catch early flight next day up country from Bangkok.", "title": "Good deal !", "helpfulness": 1, "user": "Fairtraveleverywhere", "date": "August 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 116628315}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Good clean hotel with relatively cheap tariff . Good room size and facilities.", "title": "Perfect for the airport", "helpfulness": 1, "user": "misst23", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 2.0, "value": 5.0, "service": 5.0}, "id": 116248702}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "My first stay was in hotel building and this one in resorts units. Both were OK without any issues.", "title": "Great value", "user": "samargatha", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115920431}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Internet booked package included free internet and breakfast.", "title": "so convenient for an overnight stay", "user": "pambicoot", "date": "July 22, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 115646531}, {"rating": 1.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "We stayed here for one night for an overnight stay on our way to Chiang Mai. I asked to reserve two rooms on-line. They processed one and I sent a follow up email to make sure we had two rooms for our family. The email answer stated that two rooms were reserved but I could pay for the second room in cash upon arrival. I did. They charged me on my cc for both rooms, as I saw on my statement, so I paid for three, not two rooms. I sent them a copy of my cc statement with the two charges and after many denials, they admitted they a mistake had been made and would refund my cc. They never did. I contacted my cc company and with copies of the emails, was able to obtain a refund. Very dishonest practice on the part of the the staff at Thong Ta. I cannot recommend that anyone stay here.", "title": "Double charged. Would not refund my money despite showing them the credit card statement.", "helpfulness": 5, "user": "Knows", "date": "September 19, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 2.0}, "id": 118342624}, {"rating": 4.0, "stay_parameters": "Stayed September 2011", "text": "If you have to stay for one night only, if your flight is in the morning, if you just want to relax in the clean, big room - what else do you want than $20/night spotless quiet hotel? One of the many nice hotel near airport-round trip transfer included into your room rate and breakfast too ( gonna check it right now).", "title": "Great deal for those at transfer flights", "helpfulness": 2, "user": "MarushaMarusha", "date": "September 17, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118250496}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Tip: as many travelers noticed there is a nice street food corner in 2 min walk from hotel. BUT also if you walk a little bit further there is a great market with clothes, various colorful wicked stuff (so Thai!) and endless rows of FOOD. They start cooking after the sunset, and it's worth checking out for sure. Perfect for the bunch of local flavors and tastes if you don't have enough energy/don't want to spend money traveling to Bangkok centre/famous night markets/Chatuchak weekend market.", "title": "A good place to stay near the airport.", "user": "Ohmytravels", "date": "September 13, 2011", "detail_rating": {"value": 4.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 118052903}, {"rating": 4.0, "title": "Excellent value for money, very convenient for a quick stopover", "text": "It may be in a horrible area, next to the Lad Krabang motorway, but it's relatively cheap for a mid-range hotel and has a spa you can use to knead out those muscles suffering from a long haul flight. The front desk has friendly enough staff who greet you with a smile but haven't seemed to filter out scamming taxi drivers. The first cab they called tried to charge us 1000 baht to take us into town, probably five times the price. Luckily the next cab we got had a meter. The shower head fell off in our bathroom but the rooms are nice, decorated with Thai wooden furniture and ornaments. There are cheap food stalls round the corner to grab a snack and a 7-Eleven for anything else you may need.", "helpfulness": 1, "user": "teejaydfromaus", "date": "September 9, 2011", "id": 117864110}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "First time to Bangkok and the hotel's complimentary shuttle service was very easy to spot and welcoming. They have nice modern vans and the reception staff speak good English. The room was large, clean and comfortable (I had room 201). The towels and linen are a bit tired, and air conditioner noisy, but for the low cost of this hotel, including breakfast, wifi and transfers, I have nothing to complain about. Would recommend it to others who are looking for a quick stopover.", "title": "OK for one night if you just need to connect your flights", "user": "Orins D", "date": "September 2, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 3.0, "service": 4.0}, "id": 117571769}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "I stayed here on my way back home. I had to fly from Laos back to BKK since there are no flights from Laos to the US and stayed just one night. It is everything you want in an airport hotel. Great service, convenient a 7 Eleven & an internet cafe near by and good food at the restaurant.", "title": "Great for getting to the airport and sleeping in", "user": "Wandering_Creampuff", "date": "July 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115543760}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "The computers in the lobby are useless so ask where the internet cafe is if you need it. They have great connection for 15 baht an hour!", "title": "Good choice for staying near BKK airport.", "user": "ahirut", "date": "July 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 115289852}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "It can be a bit confusing to find the driver or pick up location---they are at level 2 exit 4, BUT behind the escalator where there are seats and you'll see a bunch of different groups all waiting and ask around to see which one is the Thong Ta Resort girl. There is actually no one with a sign or anything, apparently it is against the rules of the airport which makes no sense, so you have to seek them out.", "title": "Excellent Value", "helpfulness": 1, "user": "yumidesign", "date": "July 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 115274948}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Clean & comfortable with free transfer to & from , great choice.", "title": "Good choiche", "helpfulness": 2, "user": "Márton T", "date": "June 6, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 3.0}, "id": 111711938}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "As supposed to arrive very late, I stayed at Thong Ta again, for the second time. Even at 2:30 am, meeting hotel staff and check-in was fairly smooth. The room was simple but spacious and clean. Wi-fi works well in room.", "title": "Nice hotel-good value", "helpfulness": 4, "user": "ladybird108", "date": "May 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 109896269}], "location": {"country": "Thailand", "continent": "Asia"}, "stars": 2, "variance": {"poor": 37, "average": 93, "very good": 342, "terrible": 22, "excellent": 99}, "aka": "Thong Ta Hotel Bangkok", "slim_ranking": 0.386394557823, "description": "Thong Ta Resort is conveniently located less than ten minutes from the Bangkok International Airport. It is surrounded by the wonderful garden. With the kind smile of your hosts, you will be made to feel special and welcome to live out the holiday of your dreams. Enjoy your leisure time in and around the resort. Indulge in a traditional Thai massage at the spa, a meal of your choice at the pub or restaurant and shopping at Seacon Square, 30 minutes away."}