{"user_rating": 4.0, "review_count": 440, "name": "Thornton Hall Hotel & Spa", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Stayed here for one night on a dinner, bed and breakfast basis. The setting is absolutely lovely and the grounds are very well kept with a nice rural view. We enjoyed a nice meal in the restaurant - the service and food were excellent although the drinks expensive (an eye watering£24 for the cheapest bottle of wine). The breakfast was also very good quality. The leisure facilities were very good and we particularly liked the outdoor jacuzzi. The one thing that was a disappointment was the room. The bathroom had been recently refurbished and was nice, but the rest of the room hadn't been done at the same time and the furniture and decor was all a bit late 1990s. There was also evidence of poor cleaning - dusty carpet and an empty shampoo bottle on the floor by the window. There was no air conditioning and the doors to the room were made of cheap wood veneer. This might sound like nit picking, but when you are promoting yourself as a four star establishment the little touches are very important, and some parts are now clearly in need of a re-fresh. I would go as far as to say that, from the outside, some of the accommodation looks like the apartments you'd find at a holiday camp. It is for that reason that I am only giving it a three star rating.", "title": "Setting lovely, rooms average", "helpfulness": 3, "user": "Peejdj", "date": "August 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 137788432}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Booked last minute through late rooms because of the location and it looked an okay place. We got given a garden room on the first floor with a balcony and Wow what a room, could not of picked a better one, even a tv in the bathroom (flash) decorated very tastefully and clean.", "title": "just perfect", "user": "steve_lightoaks", "date": "August 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136965971}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The dinner in the Lawns Restaurant was top notch and included in our package just pay extra for wine and extras. The pool and facilities at the spa are first class and hot tub outside was a nice touch. All the staff from front desk to waiters were so pleasant and helpful and made our stay just perfect, just wish we had stayed longer. But we will return as we enjoyed every aspect of our short stay, thank you all so much just carry on with what you are doing, top marks to you all", "title": "Lovely Break", "helpfulness": 1, "user": "Seren E", "date": "July 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135891716}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "After visiting thornton hall 3 times now I am never disapointed. We always do the dinner bed and breakfast package and the food always wows me. It's always such a pleasent experience which is why I am now planning my next trip already.", "title": "The Pelling Wedding - Pulford Suite", "helpfulness": 2, "user": "Baz P", "date": "July 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135824619}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Why is this Hotel not 5 star seriously!!! We have just had our Wedding Reception there staying two nights and are lost for words to describe how happy we are to of picked this Hotel for our wedding. The only negative we have is that it went to quick so if you are thinking of having your own Wedding or thinking of having a weekend break, cherish every second of it. A special mention to Dave Pike our Banqueting Manager - Toast Master for your all your hard work in making our day wonderful along with all his staff and the wedding team.", "title": "Excellent Wedding Venue", "user": "Teresa C", "date": "July 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135692900}, {"rating": 4.0, "stay_parameters": "Stayed July 2012", "text": "We stayed here on a few occasions and it never fails to impress. We recently stayed on a 'sunday night deal'. We got dinner, bed & breakfast for £120, including full use of spa, pool & gym. We asked for a garden view room, which we got. We were impressed with the room. Lovely & modern complete with flat screen tv (and another lcd tv built into the wall in bathroom!) comfy bed, double wardrobe, patio balcony area to sit outside. Very nice! Our evening meal included in the price was @ 'The Lawns' restaurant. It was divine. The drinks are a bit pricey so expect this (£24 bottle house wine). The food & service from James & Katie (and staff) was first class tho and could not be faulted. finshed with coffee & chocolates! The spa & pool is also really nice. The facilities are clean & modern. The spa pool is actually outside in the gardens, overlooking fields in the countryside. We really enjoyed our little break & we will definitely be going back soon!", "title": "Lovely hotel, beautiful location, excellent service..", "helpfulness": 1, "user": "discokidda", "date": "July 9, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 133816621}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "I attended a wedding at this hotel and also stayed the night. The room was nice, not amazing, but in keeping with the hotel's surroundings. There was also a TV in the bath, which is a nice touch although I didn't get to use it. My only grumble would be the key cards not working on at least 3 occasions, to which I was told it was my mobile phone. I didn't have it on me.", "title": "Wedding and stay", "user": "Chris G", "date": "July 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 133492481}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The wedding was very nice too, going smoothly. All in all a nice hotel with lovely outside gardens.", "title": "Lovely stay!", "helpfulness": 2, "user": "WirralCatherine", "date": "June 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 132537048}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We booked this hotel at the last minute on the day of our wedding anniversary. My husband asked when booking if anything special could be thrown in and was told by the member of staff that she would speak to the manager. Unfortunately no reference was made to the anniversary and nothing was added during our stay. We stayed in a modern room in the old part of the hotel which had a comfortable bed and a lovely smart new bathroom. We paid £169 for D, B & B. The dinner was lovely and the dining room was very elegant. The food and service could not be faulted apart from a pavlova dessert which was a case of style over substance. The staff were charming and efficient. The young female waitress who served us cheese was very knowledgeable. We had a lovely but expensive wine (£62) which was probably 3 and a half times the cost price and drinks were generally expensive. Breakfast was lovely and was also taken in the restaurant. I only wish we could have stayed longer to use the spa facilities. We paid £3.99 to rent a recent film in our room which we enjoyed. i noticed on leaving that there was a June deal which would have cost slightly more which would have included afternoon tea and a spa treatment. I wished the lady on the desk had let us know about this when booking. Overall, we felt a sense of occasion on staying here and the staff were professional and friendly. Even though it was expensive we thoroughly enjoyed our stay and would return.", "title": "Wedding", "helpfulness": 2, "user": "busterCheshire", "date": "June 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131552279}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We got married at Thornton Hall on May 18th 2012 and had a fabulous day, Laura our wedding co-ordinator was brilliant from day one and helped me with any type of query or question I had, she also put up with me mythering her as the wedding drew closer! All the staff at the hotel were great and our wedding ceremony and reception was perfect. Dave our toast master was great on the day and took care of everything for us! Beautiful location and excellent staff. Thanks to everyone for making our special day very special!", "title": "The staff and facilities made our wedding day extra special", "user": "rach2982", "date": "June 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131421802}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Sorry Thornton Hall, but I had hoped for more. Me and my fiancee visited you but didn't let you know we were looking for a wedding venue (to avoid getting unduly good levels of service). Room was dirty in the corners and under the bed, food was tepid and staff were often uninterested in our requests - had to ask 3 times for more cream for coffee.", "title": "not clean, not great", "helpfulness": 3, "user": "Andy S", "date": "July 25, 2012", "detail_rating": {"cleanliness": 1.0, "service": 3.0}, "id": 135373869}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "Needles to say, we won't be spending our wedding day in your establishment.", "title": "Another Perfect Break!", "user": "clw18", "date": "July 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 135324723}, {"rating": 5.0, "title": "Relaxing Break", "text": "Thanks for saving us the embarrassment of our friends and family putting up with your aloof attitudes.", "helpfulness": 1, "user": "Innov8_Safety", "date": "July 23, 2012", "id": 135159716}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "I have just stayed at Thornton Hall for the 2nd time with some friends on a spa break, to celebrate a friends 40th. Once again the whole trip from start to finish was wonderful. The lesiure facilities are fabulous, and we especially enjoyed sitting in the outdoor hot tub enjoying the sunshine. We had dinner in the Lawns and I can honestly say it was one of the best meals I have ever had. We arrived early on the Saturday and our room was not quite ready so the receptionist suggested we left our luggage with her and go and enjoy a glass of wine in the gardens, which we did!!! We found all the staff to be friendly and helpful and will definately be returning - hopefully soon!", "title": "Fawlty Towers with a swimming pool...", "helpfulness": 4, "user": "thecatsmother_123", "date": "July 22, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 135046797}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Me & my Wife stayed at the this hotel 22/07/12 for my 31st birthday surprise. The room, service & restaurant where excellent & we fully intend to return. We paid £160 for the two of us which included use of the Spa facilities, dinner & breakfast. We would recommend this hotel & will be returning! The trainee manager was very polite.", "title": "A Beautiful Wedding venue!", "user": "Alan L", "date": "July 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134090922}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Delightful spa break overnight for a chic pre wedding sojourn ...ambience & food superb in the restaurant ('compliments of the chef extras ' a nice touch) both dinner & breakfast & was also very good in the spa bistro.The restaurant staff attended to your every need with quiet efficiency. rooms comfortable & clean (tho no air conditioning). The staff were so accommodating & friendly throughout including the housekeeper when she swopped our rooms for twins rather than doubles immediately.", "title": "delightful spa break", "user": "elainegwasd", "date": "June 6, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 131394024}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The spa was relaxing, treatments adjusted to your requirements, always on time & run efficiently so we all co-ordinated with each other.The indoor pool (good access with rails/ steps etc & early opening at 6.30) excellent & out door hot tubs overlooking field with cows tranquil & cosy. We joined in some of the classes (aqua was fun, spinning hard & abs a glutely not too straining) & were made to feel welcome by all the instructors. Changing rooms spotlessly clean with fluffy robes & slippers provided. Once again the warmth & willingness of the staff to ensure you enjoyed every aspect of the spa was evident- even down to the ride in a buggy when we were late (sorry!)", "title": "Lovely stay", "user": "freyajames", "date": "June 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131347894}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "for our manicure to get us to the lodge a little quicker.Nice to walk in to the little village (5 minutes walk ) & took a short detour (drive) to Port Sunlight (4 miles away) to see the historic village & museum. Well worth a visit & would come back without hesitation & I live 4 hours away!", "title": "wedding day", "helpfulness": 2, "user": "sally h", "date": "May 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130544441}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "We stayed at Thornton Hall for a family wedding and everything was fabulous.", "title": "Successful business trips", "helpfulness": 1, "user": "MrandMrs007", "date": "May 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 130289604}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "The reception and food were excellent and the staff were all very welcoming.", "title": "Girlie hen weekend", "helpfulness": 2, "user": "catpee81", "date": "May 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129466289}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 30, "average": 52, "very good": 96, "terrible": 19, "excellent": 243}, "aka": "Thornton Hall Hotel Thornton Hough", "slim_ranking": 1.0, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Luxurious Spa Resort - 20 minutes from Liverpool and Chester. Free high speed Wifi throughout the hotel, including all bedrooms, Smart TV's now in every bedroom offering a huge selection of channels and interactive services, free car parking. Nestled in the Wirral Countryside and conveniently located for Manchester, Merseyside & North Wales. Our luxurious four star hotel offers state of the art conference facilities for up to 650 delegates & event management along with one of the finest Spas in the North West, offering an amazing array of spa treatments and spa packages to suit everyone, both Holistic and Clinical treatments. 20 metre pool, outdoor Hydro Spa Pools, Gym, Sauna, Steam Room, Tranquility Suite and New Rasul Room, makeup styling Suite and additional dual treatment room. Plus Golf Breaks playing at Heswall Golf Club one of the finest courses in the region. Delighted to be Headquarter hotel to the R&A Open Golf Championship 2014."}