{"user_rating": 5.0, "review_count": 35, "name": "Three Tree Point Bed and Breakfast", "reviews": [{"rating": 5.0, "title": "Great place to stay", "text": "We recently stayed at the Three Tree Point B&B and it was just right for us. We were there for several nights. We were in the cottage which was not in the main house. The view of Mount Rainer and the water was wonderful, even with the utility wires in the way. The food was great. You prepare your own breakfast so you don't have to get up and dressed at a set time. There was fresh fruit and fresh pastries every morning, along with eggs, cheese, yogurt and juice. Lovely, big chairs to sit in and two great outdoor sitting areas. There was a washer/dryer. The house was on a dead end street so it was very quiet. We were very comfortable and will stay here again when we are back in the Seattle area.", "helpfulness": 1, "user": "May100", "date": "August 31, 2007", "id": 8590077}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "After 10 days traveling through Canada and the US we arrived at this gem overlooking Puget Sound for a six night stay. Nothing can prepare", "title": "Heaven on Earth!", "helpfulness": 5, "user": "timothyroberttozer", "date": "June 13, 2007", "detail_rating": {"business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7843396, "likes": {"liked": "— Where do I start!", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "you for this beautiful location. It’s absolutely perfect. Views are stunning; the neighborhood is green, quiet and peaceful. We stayed in the cottage and its home from home. Nothing is missed by owners Penny Whisler and her husband Doug . Spotlessly clean, beautifully decorated and equipped you'll want for nothing. Yet it’s still close to Seattle, its attractions, and only a short drive to SEATAC airport. (No sound of planes here though!). We loved every minute of our stay. Can’t think of anything to complain about except not being able to stay longer! - We've traveled a fair bit worldwide and NOTHING has come even close to this beautiful cottage. Thank you Penny & Doug for an experience we will never forget.", "title": "Beautiful property, with a breathtaking view...", "helpfulness": 5, "user": "jester176", "date": "June 1, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7729429, "likes": {"liked": "— Overall experience was phenomenal...", "disliked": "— That we had to leave..."}}, {"rating": 5.0, "title": "What a find!", "text": "To say that staying here for the four days that we were in Seattle was a pleasure would be an understatement. The first thing that obviously gets your attention is the beautiful scenery you are surrounded by...not only do you have Puget Sound in front of you, but you have the Olympic Mountains as a back-drop on one side and Mt. Rainier on the other. On top of the fact that you couldn't ask for better surroundings, the service and amenities were truly exceptional. The cottage was beautiful, with wall-to-wall windows to take in the views through and plenty of cozy spots to relax and unwind in. Penny, the innkeeper, was very helpful with our arrangements as well as suggestions of places to check out. We were able to start off every morning with a great breakfast using the wonderful ingredients provided to us (the fruits were delicious) which were cooked in our fully stocked kitchen.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 7, 2006", "id": 5437809}, {"rating": 5.0, "title": "Best kept secret", "text": "We could not have asked for a better place to stay to start our honeymoon. The views were spectacular, the cottage was ideal for anyone looking for a romantic place to stay while in Seattle and the service provided was truly world-class. We will definitely be staying here anytime we are in the area.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "October 28, 2005", "id": 4069565}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled solo", "text": "Loved, loved, loved the Three Tree Point B&B. One of my best B&B experiences EVER. I would return any day and have already recommended it to all my friends & family.", "title": "Perfect Peace and Rest at 3 Tree Point", "user": "Sunkissedjasmin", "date": "December 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22840337, "likes": {"liked": "— Views, beautiful rooms, well-stocked fridge, knowledgeable innkeeper, privacy, quiet"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Perfect views of the Sound (Mt Rainier, anyone?), amazing sunsets, walks along the old Indian trail down to the water, and Penny will provide you with lots of info on the Seattle area if you need it.", "title": "Perfect Romantic Getaway Spot!", "user": "CA_Ambassador", "date": "December 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22768338, "likes": {"liked": "— Scenic View", "disliked": "— Slow internet access"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "I booked two nights at the 3 Tree Pt SUITE after a 10-day stay at the Hilton (after my spouse left the Seattle area earlier due to flight ticketing complications).", "title": "Relaxing Retreat at the 3 Tree Point", "user": "SeattleMotorCycleGuy", "date": "September 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20355506, "likes": {"liked": "— Amazing views", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We should have stayed all 12 days at 3 Tree Pt, given the free parking & breakfast goodies that Penny (my innkeeper) laid out... (it's $20 per day parking @ the HIlton, no breakfast, no free internet access, plus B&Bs in the Seattle area only charge 9% tax unlike the hotels that charge almost 16%.)", "title": "Perfection! Don't miss it!", "user": "KHeidegger", "date": "July 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17521391, "likes": {"liked": "— Everything!", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We would have saved so much money, because we could have cooked at the fully-equipped kitchen @ the 3 Tree Pt. :-(", "title": "Excellent place", "helpfulness": 2, "user": "bevier", "date": "September 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8658470}], "location": {"country": "United States", "city": "Burien"}, "stars": 3, "variance": {"poor": 0, "average": 0, "very good": 3, "terrible": 0, "excellent": 32}, "slim_ranking": 0.6, "description": "Welcome to Three Tree Point Bed & BreakfastLocated on a quiet hillside overlooking Puget Sound, you'll be greeted by spectacular panoramic views of majestic Mount Rainier and the regal Olympic Mountains. Surrounded by this breathtaking scenery, enjoy one of our two private, independent guest accommodations, and experience a Seattle visit that will not soon be forgotten, and one you'll wish to repeat often. Experience the peaceful tranquility of a true Northwest retreat."}