{"user_rating": 4.5, "review_count": 1325, "name": "Tiara Park Atlantic Lisboa", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "I stayed at Tiara Park for 4 nights. Upon an early morning arrival, I was told that there were no rooms available, please come back after 1pm. I understand this, since the hotel was fully booked, so no complaints there. Sure enough, at 1pm I received a key to a very stylish and comfortable room, with a lavish bathroom as well.", "title": "A lovely hotel, with quality & good service", "user": "mijansso", "date": "July 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 133990827}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "The staff service was very kind and with a sense of manners & style, so I was very pleased with this. The hotel bar, decorated much like an old british colonial gentlemen's club somewhere in South-East Asia (if only the doorway to the hotel lobby would be closed & panelled with wood as well, then the illusion would be perfect!) was an absolute delight, serving many local specialities in terms of drinks, as well as very nice international food items to enjoy in a peaceful atmosphere.", "title": "Perfect all around", "user": "apatahunga", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133928691}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "There are many excellent supermarkets and shopping malls within 10min walking distance of the hotel, and the downtown/old city can be reached in 30 min walking. Coming back you do notice that it is all the way an uphill walk..so be prepared to return by taxi (I found portugese taxis most honest & reliable in all of the mediterranean region, not one single problem or attempt to fiddle with prices).", "title": "Very nice Hotel", "helpfulness": 1, "user": "RaS82", "date": "July 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133281270}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Tiara park would be perfect, if there was a spa/pool in the same building. All in all, it is a luxurious & stylish hotel well worth considering when staying in Lisbon.", "title": "Superb luxury hotel", "helpfulness": 3, "user": "Tymax", "date": "July 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133249850}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "Seeing Lisboa without xmas lights was offset by great atmosphere and service in the hotel. Not in the heart of old city, but close enough even by walking. Room was extremely clean and staff very friendly.", "title": "Good business hotel in lisbon", "user": "Reduzum", "date": "June 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 133093713}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "We had a two great experiences when staying at Tiara in Porto and Lisbon. Big rooms, very clean, excellent lobby and restaurant. Our friends were travelling with their baby girl and the Hotel gave them a bigger room taking fresh for the girl (we arrived quite late and restaurants and shopping centres were already closed). Would definitely recommend and stay there again.", "title": "Excellent", "helpfulness": 1, "user": "GioSousa", "date": "April 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 157272646}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Very nice and cosy rooms but a little on the small side. The service was excellent. All the way well earned 5 stars and well worth return visits.", "title": "Fantastic", "helpfulness": 2, "user": "M R", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 157071092}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Centrally located, in walking distance to centrum, right next to a nice park.", "title": "Great Location, Great Service", "user": "Kathy G", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157061587}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Nice comfortable rooms with great view of the city! The hotel staff are very friendly and helpful as well. You can't beat the location either. Walking distance to a lot of places and accessible to public transportation.", "title": "Tiara is not really a great hotel, but at a great location", "helpfulness": 1, "user": "Bandaru75", "date": "April 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 157004402}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Stayed in Tiara from Nov 9, 2012 to Dec 5, 2012 on a business trip. We (along with other colleagues) moved to Tiara from Novotel, just to be in the centre of the city where we could find few restaurants close by for our dinner. Though our need is met, Tiara is not really a great place to stay, particularly for long stays. One major advantage is its close proximity to Edward VII Park (may be the biggest in Lisbon), at a walk able distance to many attractions and a Metro point. The place around the hotel is very peaceful. One of the city tour bus starting point is just around 200 meters away from the hotel. Hotel gives you high speed broadband. Morning walks to Edward VII Park and spending few hours in the small cafe in the middle of the park listening to the excellent music played there is must for any traveler.", "title": "Very comfortable, great location", "helpfulness": 2, "user": "Lazy_13", "date": "April 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 156909452}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "This was our first experience with this hotel chain. We were highly impresed by the quality staff and the hotel facilities in general. Very well located, across \"Estufa fria\" Park and in an excellent area close to other similar prestigous hotels.", "title": "One of the best options in Lisbon", "helpfulness": 1, "user": "Roccox", "date": "April 15, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 157857544}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "If we have the chance to visit Lisbon again, we'll stay at Tiara again.", "title": "Close to perfect", "helpfulness": 1, "user": "40chester40", "date": "April 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157765071}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Great stay in this wonderful hotel. The hotel is modern the room was great and with a view over Lisbon. Only down side was the bar as i ordered a local hot sandwich and it came out cold and the cheese hadn't melted. Also badly organised for early check out. It took to long as i wanted to get to airport asap. Everything else was great friendly staff great hotel", "title": "Five star and great value", "helpfulness": 1, "user": "Larry S", "date": "April 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157580252}, {"rating": 4.0, "title": "good hotel in business area of Lisbon", "text": "We stayed here between cruises. We arrived at 10am expecting to have to wait quite awhile for a room plus somehow we were booked for 2 rooms instead of 1. The staff sorted it all out and had us in an upgraded room by 10 after 10. Amazing! Service was impeccable throughout the hotel, especially the bell staff and the restaurant staff. The room was quite large and the hotel was very quiet. It's located on a small park next to the Four Seasons hotel. Value for the money was excellent. The lobby is quite nice as are all the common areas.", "helpfulness": 2, "user": "kimberleycaldwell", "date": "April 11, 2013", "id": 157403399}, {"rating": 5.0, "title": "Excellent service", "text": "My husband and I stayed in Lisbon for a long weekend and booked this hotel due to the good reviews (ranked 2nd at the time of booking) coupled with a 3 for 2 offer.", "helpfulness": 1, "user": "Carlos A", "date": "April 10, 2013", "id": 157330851}, {"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "My wife and I stayed here as part of a conference. The room had a fantastic corner view out over the top of the city with the river in the distance. The room was well equipped and the en-suite bathroom was great. We missed having a kettle but this often seems to be standard for hotels outside the UK.", "title": "Beautiful hotel with excellent service and a great view over Lisbon", "helpfulness": 2, "user": "ManFromManchester", "date": "June 28, 2012", "detail_rating": {"cleanliness": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 132974907}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The food in the hotel was really very good. Breakfast was a very substantial buffet with hot and cold selections available. There was a lunch buffet on offer as well as bar snacks. The evening meal in the restaurant was fine cuisine (small but delicious portions). I cannot comment on the price of accommodation, food or drink as all this was arranged through the conference organisers.", "title": "Great hotel for stay in Lisbon", "helpfulness": 2, "user": "PortCreditVillager", "date": "June 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 132969674}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The staff were all very friendly and helpful and special requests were dealt with promptly. Staying here was genuinely a pleasure.", "title": "Very nice hotel", "helpfulness": 1, "user": "Jeff A", "date": "June 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 132945670}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We booked this hotel as part of the package, was happy to see hotel is exactly the picture showed from reviews. Clean and modern interior and comfortable rooms.", "title": "Nice surprise", "helpfulness": 1, "user": "FoodTravellingLove", "date": "June 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132929561}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Near the Pombal square and Edward 13 park, where many tour bus depart, including the shuttle to Freeport outlet mall.", "title": "Lovely rooms", "helpfulness": 1, "user": "jimmyt090", "date": "June 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 132547172}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "I chose the hotel based on reviews here and I was not disappointed. Service was good, my room was large with a wonderful view over the park and the city. Breakfast is not cheap but the same price as in other 5-star hotels and it is great: diversity of food and very good quality.", "title": "No bad surprise", "user": "Christophe C", "date": "June 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 131089689}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "There are a couple of things I found a bit tacky for this type of hotel: terrible music in the lifts (it makes you feel you are shopping in a supermarket) and old fashioned watercolors hanging on the walls like in a cheap hotel. It is also pity that there is no spa or swimming pool like in many 5-star hotels in Lisbon.", "title": "Perfect", "user": "MrJoshuaTree", "date": "June 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 131074544}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Well located - we were on 12th floor overlooking the city. Hotel is near Marques de Pombal Place - the hop on hop off tour starts here so it's a good starting point if sightseeing. It's 7 mins walk to a metro stop (metro very easy to navigate in Lisbon). If really up to it it's a gentle stroll down Ave. Liberdade - the central boulevard with many designer shops.", "title": "luxury hotel", "helpfulness": 1, "user": "perch123", "date": "May 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 131017193}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Hotel is v clean, tidy and well presented. Rooms are comfortable - all you'll need in them. Food/ breakfast was also very good - buffet breakfast was included in our rate. Check in and out was efficient. Taxi from hotel to airport took c. 10mins at a cost of c.€8 (ripped off to the tune of €17 by taxi man on way from Airport so be careful! Not the hotel's fault obviously I should say).", "title": "Pure bliss", "user": "Classy_Chica", "date": "May 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 130793719}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Some other review has rated this 'terrible' because the hotel is on a hill!! Hello? Lisbon is on 7 hills and is notorious for it's hills. Yes there is a hill but it's nothing to anyone reasonably fit/able bodied. Don't think it was fair to rate it terrible because of the adjacent geographical features.", "title": "Modern, plush, but not quite five star", "user": "severus", "date": "May 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 130770723}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "An excellent compromise between price, quality and location in Lisbon. Hotel acts like a legitimate four star business hotel but caters to many international tourists. Even with the high volume turnover of the guests (tourists) the service quality of the staff does not suffer. Hotel is very clean, well maintained, fashionable. It is located in a business rather than historic area but, with the cheap price of taxis in Lisbon, this is not a problem. The neighborhood is quiet with family restaurants within walking distance. The rooms are clean and well appointed, the shower is hot. The internet is complimentary.", "title": "just the facts, ma'am", "helpfulness": 1, "user": "notnecessary", "date": "April 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 158699997}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "We did a 7 day Duoro River Valley Cruise with Uniworld and it began with 3 nights in Lisbon. We chose to fly in an evening earlier and decided to stay at the host hotel for that night also, so we had 4 nights at the Hotel. The check in was the easiest we've ever encountered and the staff was magnificient. They went well over normal professional service and everything was accomplished with a smile! The included morning breakfast buffet was absolutely fabulous. The rooms (there were 3 couples with us and we saw all 3 rooms) were excellent with beautiful views toward the river. The location was great - easy walking distance of many many restaurants, a huge mall, and easy to get to all public transportation. About 20 minutes from the airport.", "title": "April in Portugal", "helpfulness": 2, "user": "pshurd", "date": "April 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158597214}, {"rating": 5.0, "title": "The best quality and price combination in Lisbon", "text": "Stayed here after our original choice did not work out and were so glad we did. Rooms are spacious, bathrooms have 2 sinks, nice shower/bath combination. Extra outlet in the safe...odd, but useful. As stated in other reviews, the views are fabulous. Room is very quiet, staff excellent. Breakfast was included in our rate and it was very good. Coffee with milk is poured with hot milk, true cafe au lait. We would definitely stay here again.", "helpfulness": 1, "user": "Nancy N", "date": "April 18, 2013", "id": 158097028}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "This nodern hotel in Lisbon is well located, near a major park, has very comfortable rooms and good conference facilities. It is not long on charm, but if you're looking for an agreeable stay in an up-to-date facility with a friendly and helpful staff, this hotel could be for you.", "title": "Classy five star hotel", "helpfulness": 1, "user": "kazzole", "date": "April 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 158004734}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Luxury hotel, helpful staff not stuffy or standoffish, fantastic views over Lisbon. Spotlessly clean, everything you could expect. Breakfast is extra at £20 each so we went out to eat which got us up and out. There is a huge park across the road with a cafe and restaurant, the Park metro is a further 200m past that.", "title": "Welcoming Hotel", "helpfulness": 1, "user": "Pl0dder", "date": "April 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 157895776}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Having stayed here before and with only 5 days in Lisbon wanted somewhere we knew we could rely on, we paid extra to stay in the one of the executive rooms by booking the 'River View' which because we were on the upper floors meant you can see the river from your room. Not sure what facilities a standard room gets, but the exec. rooms come with a decent Nespresso machine and a selection of pods so you can wake up to an espresso first thing, a great range of Dior toiletries and a decent bed, all make the stay a little more pleasant.", "title": "Away from the crowds", "helpfulness": 3, "user": "TheOxfordTravellers", "date": "April 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 156900952}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Although we arrived on an early flight, which meant we got to the hotel mid mourning, they gave us a room without asking which meant a quick shower and change before exploring the city.", "title": "Great location, lovely views of the park!", "user": "DanJamLondon", "date": "April 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 156818041}, {"rating": 3.0, "title": "Good Hotel but Not a 5-Star", "text": "Because it's a little distance away from the town we took breakfast in the hotel which is not bad for €10", "helpfulness": 2, "user": "Imran H", "date": "March 31, 2013", "id": 156167198}, {"rating": 4.0, "title": "Great rooms", "text": "Location is at the top side of the park which means the nearest Metro is a 7 minute walk away but has the advantage of being away from all the traffic and pretty quiet.", "user": "tangybird", "date": "March 31, 2013", "id": 156145107}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Oh, and finally, an hotel that gives you free WiFi", "title": "beautiful hotel", "helpfulness": 1, "user": "travel l", "date": "March 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156090480}, {"rating": 3.0, "stay_parameters": "Stayed June 2012", "text": "Initial impression on arrival was that the hotel and our room was lovely, but a few things took the edge off during our stay.", "title": "Mixed experience", "helpfulness": 3, "user": "79sgrif", "date": "June 22, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 132524543}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We were booked in for 4 nights as part of our honeymoon, no acknowledgement of this by the hotel, but we did get the high floor requested.", "title": "Good Hotel - excellent location", "user": "logman1000", "date": "June 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 132234291}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The room was pleasant but no folder of information to tell us what the restaurant offered, or time of check out etc - this would have been useful.", "title": "Did not disappoint", "user": "mrskat99", "date": "June 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131487082}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Room serviced each day but on day three no spare loo roll provided and the cleaning cloths were left in our bath.", "title": "Amazing service and real hospitality attitude!", "user": "DMelnikov", "date": "June 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131456298}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Hotel is in a good location, near the tube, the airport bus and the park. It's a short climb up a hill, but that's good for burning off all the pastries you find in Lisbon.", "title": "Very comfortable stay", "user": "ShedUpperMan", "date": "June 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 131142431}], "location": {"country": "Portugal", "region": "Estremadura", "continent": "Europe", "city": "Lisbon"}, "stars": 5, "variance": {"poor": 23, "average": 55, "very good": 402, "terrible": 11, "excellent": 834}, "aka": "Tiara Park Atlantic Lisboa Hotel Lisbon", "slim_ranking": 0.0727272727273, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "Located in the heart of the Portuguese capital, the Tiara Park Atlantic Lisboa celebrates the life and history of Lisbon. Located just 7 km from the country’s main international airport, the hotel offers a range of unique experiences inspired by a totally new style of luxury."}