{"user_rating": 4.5, "review_count": 728, "name": "Tigerlily", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2012", "text": "We had a really nice stay at this hotel, which was a surprise treat from my husband for my birthday. We loved the decor. The shower was amazing and the bed really comfy. We had dinner in the restaurant. My husband had a fantastic steak. Our waiter was great but I don't think there was enough staff on as there was a big party in. we did have to wait a while for our food, which we didn't mind as we a were in no rush. My only other small negative was there was no ice In the room. Someone did come round 3 hours after we checked in but by that point we were heading out. We did have a lovely stay, it felt very special & would recommend to others.", "title": "a welcomed change", "user": "caza30", "date": "April 6, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 127343561}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "My husband and I spent 2 nights at Tigerlily as part of a tour around Scotland. We found out about the hotel on the Mr & Mrs Smith site and thought it looked very luxurious, just right for a honeymoon. The hotel is only part of the establishment, there is also a restaurant, bar and club. Its decoration is very modern and is uber cool with hot pink fabrics, statement mirrors and sparkling disco balls hanging from the ceilings. Our room was beautiful and had everything you could possible want including a fully loaded ipod and GHD hair straightners!", "title": "City chic", "user": "LisaC22", "date": "March 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 126778967}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "The rooms are situated above the bar/restaurant area. We couldn’t hear any music or noise to disturb us and enjoyed the close proximity so we could stumble upstairs after several cocktails in the bar.", "title": "Fantastic night with Cocktail Making & Superb Meal", "user": "Claire M", "date": "March 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126671860}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The restaurant and bar is very chic with plenty larger’s on tap and a good choice of dishes on the menu at reasonable prices (2 courses for £15). Breakfast is also served in the bar and restaurant area which feels a little strange seeing it in the daylight and spotting the drunken alcohol stains on the chairs from previous nights. Breakfast itself is wonderful. Freshly cooked and served to order, the choice is varied and the cooked breakfast very tasty.", "title": "Go on...you know you want to!", "helpfulness": 1, "user": "WelshWAG", "date": "March 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126536863}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The hotel doesn’t have guest parking however there is some street parking just outside. This is pay & display and is fairly expensive (reasonable I suppose for City parking). Be careful when parking your car, we parked up temporarily outside the hotel simply to unload the suitcases and returned to a parking fine. The attendants are extremely vigilant!", "title": "An absolute pleasure", "helpfulness": 1, "user": "Anna L", "date": "March 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126391838}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We stayed at this beautiful and hip hotel in 2010. It was a little pricey but we were only there for a couple of days and it was so worth it. The hotel itself was gorgeous with its lounge, bar, restaurant and breakfast area. The breakfast was AWESOME and very American, which is great because it Europe breakfast is normally not what we are used to. The staff were all very polite, spoke perfect english and accomadating. The room was AMAZING!! It was huge with a huge and very comfortable bed. I believe it was the most comfortable bed that I have ever slept in. The rainforest shower was also wonderful. I have nothing bad to say about this hotel, our stay here or Edingburgh. It was a truly wonderful experience", "title": "Wonderful experience", "user": "KarlaDL", "date": "March 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126205280}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Stayed at Tiger on Monday night, beautiful room to relax in, soft towels, quality soaps etc, they had reserved a table for my meeting which was quiet, staff could not have been more helpful, decided to stay for dinner (one of the good decisions that day), food was exquisite with excellent choice of wines. Woke the next morning refreshed and ready for the day. Overall a very restful experience with very attentive staff a venue not to be missed if coming to Edinburgh!", "title": "Great night in the city", "user": "cujimmi", "date": "March 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126087945}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "Just had one night dinner, bed & breakfast @ this hotel and would recommend it to everyone. It's not just a hotel it's a wonderful experience, saving up now to come back :)", "title": "Excellent", "user": "Labradoodl", "date": "March 14, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 126074949}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "We stayed in a luxury double room with Tigerlily's spring break offer. The room was very clean and spacious. It had good lighting and mirrors and a proper hair dryer! Very important to women (take note other hotels!!) We were offered breakfast in our room free of charge which was a real bonus. Our deal included a bottle of wine each night delivered to our room and a 2 course dinner. The food was delicious, the staff very pleasant and helpful. The bar and restaurant was buzzing and lively. Cannot fault our experience and thoroughly recommend.", "title": "A vibrant, trendy hotel in the heart of Edinburgh.", "helpfulness": 1, "user": "Sonic27", "date": "March 7, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 125763948}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "I booked Tigerlily in Edinburgh as a weekend treat for me and my wife. We have both stayed there previously in a luxury double room and I had booked the same type of room again, but we received a bonus of being upgraded on check-in to a Junior Suite. This room was amazing and it was a shame we were only staying for one night as you could easily spend a week in this room to make the most of the features and space. It came with a flatscreen TV on the wall, a DVD player and iPod and dock. The bathroom was enormous and had the largest walk-in shower that I have ever seen. Our room, on the third (top) floor of the hotel was very quiet. All of the incidentals, such as towels, dressing gowns, cushions, etc. were of a higher quality than you usually get in hotels.", "title": "Unique and special", "user": "KB_the_truth", "date": "March 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 125658782}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "My husband and I recently stayed at Tigerlily and we had an excellent time. The room was modern with a huge comfy bed, a full length mirror for getting ready, robes, slippers and lovely smellies in the bathroom. The walk in shower was one of the best we have experienced in a hotel.", "title": "Fantastic stay but...", "user": "AshleyM48", "date": "April 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 128242842}, {"rating": 5.0, "title": "Amazing!", "text": "We loved the fact that we could order breakfast in our room for no extra cost, always a bonus when you want to make the most of a lie in on your stay! The breakfast was lovely.", "user": "ReviewerAberdeen", "date": "April 16, 2012", "id": 128009436}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We were lucky enough to get a fantastic deal for dinner bed and breakfast, and I have to say the food was delicious. The waiter who served us at dinner was very friendly provided a brilliant service. We did not feel rushed at all, just perfect. The only criticism we have is that what we paid for dinner bed and breakfast, we would normally have paid just for the room only and in the current climate we do not think we would ever spend that kind of money for a room only offer.", "title": "fantastic stay", "user": "carol072", "date": "April 15, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0}, "id": 127908868}, {"rating": 5.0, "title": "Superb Edinburgh hotel", "text": "We had an amazing stay, well worth the money we paid, but we certainly would not return unless we got another deal like that!", "user": "SDH71", "date": "April 14, 2012", "id": 127850118}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We got a deal voucher for dinner, bed and breakfast and had a fantastic stay. Located on George street the location is ideal. The standard of the rooms is fantastic, they have really though of everything. The decor in the entire hotel is stunning, the room was gorgeous with a huge double bed, iPod stereo complete with music downloads, dressing gowns and slippers, shaving and toothbrush kits to buy if you've forgotten anything, mini bar at the same prices as the bar, hairbrush and straighteners, alarm clock, swivel tv to view from the bed or seating area, and free breakfast room service. The restaurant was excellent with fantastic service, and in morning when they forgot our coffees they gave it free of charge which was the standard of service we experienced throughout our stay. Cannot fault this place, and although pricey it is well worth it.", "title": "Don't rest on your laurels!", "helpfulness": 3, "user": "emmetyak", "date": "April 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 127476573}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We stayed at the Tigerlily in August 2011. We were informed at check in that we'd received a complimentary room upgrade. The room was huge, the bed was comfy, and the shower was terrific. The decor was trendy yet comfy. The service was top notch - everyone was friendly and professional. You are within walking distance of everything a tourist must see in Edinburgh. A great experience; I'd highly reccommed for couples on vacation.", "title": "Very Cool Hotel", "user": "kristintx", "date": "August 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116591433}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We have stayed at Tigerlily every year for the last four years (Fringe) and am delighted to say that each year, it's consistently fabulous! Still trendy and cool and the hotel is not looking dated/tired in any way. Staff excellent this year-always love the little extras in the rooms (GHDs, iPod, White Company toiletries, fruit and biscuits). Great location with the added bonus of amazing cocktails to kick start your evening. Looking forward to next year already!", "title": "Still great!", "user": "BubblingBrook", "date": "August 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116389645}, {"rating": 5.0, "stay_parameters": "Stayed October 2010", "text": "If you want a cool hotel in the centre of Edinburgh, look no further than this place.", "title": "Cool Hotel", "helpfulness": 1, "user": "FalkirkBairn1", "date": "August 4, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 116277771}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We have stayed twice and would certainly consider staying again. The Black Room is really smart.", "title": "Would Recommend!", "user": "Will186534", "date": "August 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116212052}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Cracking rooms, excellent facilities and wonderful evening meals.", "title": "Beautiful room, friendly service, gorgeous food", "user": "BridgetsTrip", "date": "July 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 2.0, "value": 4.0, "service": 5.0}, "id": 116080843}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "My husband and I stayed on a DBB special offer including Bottle of Sparkling wine and handmade chocs. When booking I was given the opportunity to pay a little more to upgrade our room type from a standard to a Georgian Suite. I accepted the offer. When we arrived we were \"Wow-ed\" by the first impressions of the hotel and from the exceptional welcome from Gordon, the receptionist. After completing the necessary paperwork Gordon personally showed us to our room, which I thought was a lovely gesture. Our room and all its facilities certainly did not disappoint us and I am so glad I paid the extra to upgrade. Our meal was perfect and the waiters service was falutless. I could go on at length about our stay but the best way of judging a hotel and its standards is actually to try it for yourself. Working in the hospitality industry I can be the worlds worst hotel guest however I can honestly say I could not find fault in anything about our stay. My husband and I will be back and probably for longer. Thank you Tigerlily for making our anniversary a special one and one that we will always remember.", "title": "Absolutley Wonderful", "user": "Lomondsmum", "date": "July 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116065835}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "Brilliant location for walking around Edinburgh and then returning to the luxury of a fabulous hotel.", "title": "Fabulous Hotel, wonderful location.", "user": "eddiethe4th", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115969782}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Food stunning and bar lively. Beautiful rooms with very comfy beds!", "title": "Perfect treat", "user": "Gemcs", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115959644}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Will certainly go back next time we are in Edinburgh.", "title": "Amazing Treat!", "user": "eivissasunset", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115869402}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Fabulous city break place to stay.", "title": "The best room I've stayed in and best meal I've ever had!", "helpfulness": 1, "user": "Ashlingm", "date": "July 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115663143}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I was travelling with a group of 12 persons and we booked this lovely, hip and boutique hotel in Edinburgh. I last stayed in this same hotel when I visited Edinburgh about 2 years back. The location is near perfect within walking distance of the centre of the city of Edinburgh and also walking distance to the old part of town. The Tigerlily is a lovely small and intimate hotel. Reasonable rates for the size of rooms (which are generally large and clean with varying \"themes\") and the breakfast is impeccable. The reception staff are most helpful and courteous too. In the evenings, the lobby gets very crowded and busy (and noisy) with all sorts of yuppies coming in for drinks. All in all, a very good stay again and kudos to the staff and management. The only one criticism I have is that the wireless Internet access in the rooms is very weak and slow.", "title": "Still a great place to stay ...", "user": "SingaporeGuy10", "date": "April 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 128583541}, {"rating": 3.0, "title": "A Nightclub. With Rooms.", "text": "From the outset, I must stress that the bedrooms here are truly divine (as outlined by other reviewers). The 'breakfast in bed' option is also a bonus.", "user": "Chicken_Dinosaur", "date": "April 24, 2012", "id": 128536926}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "However, this is somewhat overshadowed by the bar/restaurant/club downstairs, which seems to be of main importance to all concerned at the hotel. When you check in, you are dealt with at a desk by staff who have one eye on the bar area behind them (and ear pieces to communicate with the table staff)- it's unlikely that you'll ever have their full attention when staying here; the hotel part seems secondary. We arrived 5 hours before check-in time and, whilst waiting for the sun to come out, warmed up on one of the sofas in the bar area (it was empty, but with 4 or 5 staff members present)- not once did a member of staff come over to offer us anything to eat or drink. They barely acknowledged our presence.", "title": "Georgian Suite!", "helpfulness": 1, "user": "David D", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128438023}, {"rating": 5.0, "title": "A very good place to eat", "text": "This hotel has no public spaces (when I say 'public', I mean for use of hotel patrons only)- the bar/restaurant/club is for anyone who rolls in off the street- and you will find that it will be heaving on Friday and Saturday nights (we were lucky in having a quieter room at the front- but some of the rooms will be badly affected by the noise).", "user": "Joe-Jane", "date": "April 22, 2012", "id": 128337387}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "If you don't like being 'thanked' by the bouncer when you pop out in the evening (as you might when leaving any generic nightclub) and then have to show your ID to the bouncer to get back into your hotel later that night, don't stay here! I'm not sure the door staff are even aware it's a hotel.", "title": "Tantalizing Tigerlily", "user": "HolidayHotspots", "date": "April 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128242950}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We stayed in the mini-georgian suite this month and had to say that it was a lovely wee treat. The staff are superb - very well trained, knowledgeable, polite and helpful. Our room had a romantic gas fireplace, complete with flat screen TV, DVD player and fully-loaded i-Pod. I was also delighted to discover that the room had GHD straightening irons as I had forgotten to pack mine. The bathroom was huge with a lovely powerful shower and luxurious White Company toiletries. Our bed was as wide as it was long - great for a nice peaceful sleep! The only 'down side' was that we didn't find the pillows particularly comfortable. It wasn't the end of the world, just a wee niggle.", "title": "Brilliant beautiful boutique hotel", "helpfulness": 1, "user": "waughthewaugh", "date": "July 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115627574}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "We had a couple of drinks in the bar - very nice, looks like it is favoured by the hip younger-working crowd and after a dinner out at Cafe Anduluz, we returned to choose a DVD and retire to our room to watch on our large TV!", "title": "Excellent Stay", "user": "Uroshnor", "date": "July 17, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 115437795}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "Breakfast the following morning was in the restaurant. Again, in keeping with the rest of the hotel, this was very trendy and chic. The staff were very attentive and we had a lovely, tasty breakfast - thoroughly recommend the breakfast grill.", "title": "Absolutely Stunning", "user": "Compulsive*Shopper", "date": "July 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115359984}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Parking in Edinburgh is notoriously expensive, and so it is not the hotel's fault that my parking for less than 24 hours was over £26. I guess Edinburgh City Council has to pay for the tram system somehow...! My advice would be for you not to hire a car if you are in Edinburgh as parking is expensive and most places are within walking distance/short taxi ride away.", "title": "Busy, buzzy and stylish: if that's what you're looking for I recommend it", "helpfulness": 1, "user": "MH18", "date": "July 10, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 115217575}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "We will definately be back to this hotel. It is fun, funky and fabulous. Excellent central location with lovely helpful and friendly staff. I think this hotel would be fine for couples with children - we certainly saw a few while we were there and the families seemed to be quite happy. If you are looking for a romatic getaway/girlie weekend, this is certainly a hotel to check out.", "title": "Nice boutique hotel excellent located", "user": "Goeres", "date": "July 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115205811}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We loved it here. Great Room - lovely breakfasts - spotlessly clean - helpful friendly staff.", "title": "Great Boutique Hotel", "user": "Jan_AbbotsLangley_UK", "date": "August 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117126342}, {"rating": 2.0, "title": "Restaurant and Club with Rooms!!! Not a real Hotel....V. Noisy.", "text": "Stayed here couple of weeks ago and expected much more. It is actually a restaurant/club with rooms above. The first night we got NO sleep there is a disco directly underneath the rooms and unless you are on the top floor you'll hear it.. The disco goes until 3am and I called repeatedly to the reception to find out what was going on. On our last night I realised the disco is owned by the hotel.......Make your mind up!! You can't be a hotel and a club!! Sooo greedy.No regard the for the guests.", "helpfulness": 4, "user": "Salford66", "date": "August 18, 2011", "id": 116922523}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "The rooms are nice and have good tea and coffee facilities. But on the negative side there is no real hotel.....the bar area is sort of attached to the restaurant and the music is booming all the time, there is no chance of relaxing and having a nightcap, there is a real lack of space for the hotel guests to relax unwind. The check-in area is a tiny counter and the restaurant, bar and club seems like the main business and the hotel is secondary. I like to enjoy the hotel completely not just my room so if that is what you want stay at The Missoni, I wish I would have. This is place is NOT a hotel and would maybe be good for a gang of girls who want to party, not for familes, business or couples.", "title": "Fabulous!", "user": "Hellini", "date": "August 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 116850635}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Having been to Edinburgh several times, I can honestly say this is my favourite hotel in the city. The location on Georges St cannot be beaten, especially if you wish to be close to the best shopping and bars that Edinburgh has to offer. Stayed in room no. 11 (delux double) and it was amazing. The beds are uber comfortable. The little extras in the room include an i-pod loaded with tunes, fresh fruit, The White Company toiletries, a GHD hair straighteners and someone comes to fill up your ice bucket when you have checked in. The bathroom is vast but did not have a bath tub which may bother some people. The bar is THE place to be and be seen in Edinburgh and has a club downstairs \"Lulu\". We ate in the restaurant and the food was excellent. The hotel and restaurant staff could not be faulted. As this is a boutique style hotel with a popular bar and nightclub I would not particularly recommend it for families. A very slight din could be heard in our room from the bar but it did not bother us. I would suggest booking a room on one of the top floors if you are noise sensitive. We took advantage of the Sunday Escape offer. I'd recommend signing up for special offer emails in advance if you intend on staying here - we received 50% off all main courses in the restaurant by doing so. Fantastic experience.", "title": "Place to go", "user": "mpkp", "date": "August 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116709701}, {"rating": 3.0, "title": "Nice hotel, but we didn't expect the nightclub downstairs!", "text": "Excellent boutique hotel, great staff, bar, restaurant and rooms. Easy access to new and old town.", "user": "LondonNDB", "date": "August 12, 2011", "id": 116632405}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 19, "average": 51, "very good": 155, "terrible": 5, "excellent": 498}, "aka": "Tigerlily Hotel Edinburgh", "slim_ranking": 0.0890410958904, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}}