{"user_rating": 4.5, "review_count": 25, "name": "Tiger Tops Tented Camp", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2007", "text": "So, there is no mini bar, no TV, nor even electricity! But what you do have is an unforgetable wildlife experience in the heart of the Chitwan National Park.", "title": "TigerTops is Tops", "helpfulness": 7, "user": "Peter R", "date": "April 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 7389573, "likes": {"liked": "— Wildlife watching", "disliked": "— Bumpy jeep safari"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007", "text": "To go out on an Elephant safaris at sunset and sunrise and see Rhinos, 3 sorts of deer, wild boar,etc. and..... yes we were lucky and saw a tiger. That memory will stay with us for ever, the elephant quivered as she got a scent and we were off crashing through the jungle till there it was so magnificent and beautiful. I managed one rather blurred photo as I was so intent on watching it and then it was off.", "title": "A great experience!", "helpfulness": 12, "user": "Jobie", "date": "April 12, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7338747, "likes": {"liked": "— The syle, the safaris, the staff, whole experience.", "disliked": "— Might give the jeep safari a miss next time... better to walk!"}}, {"rating": 5.0, "title": "Difficult to find fault with anything", "text": "As well as the Elephant safaris there were jungle and birdwathing walks, a jeep safari ( a bit long and bumpy) and a chance to help bath the elephants.", "helpfulness": 33, "user": "A TripAdvisor user", "date": "May 11, 2005", "id": 3460632}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We spent three days and two nights at Tiger Tops Tented Camp and were looked after from the moment we arrived at Magauly airstrip with fresh salads served upon our arrival. This was welcomed following our long drive from Pokhara, especially as it’s another half an hour or so before you get to the tented camp. This journey is the start of the safari adventure: after a ten minute drive you hop onto a boat to cross the river and then you’re in Chitwan National Park. Transfer onto an open top jeep and there’s a 20 / 25 minute journey through forests, grasslands and rivers to our home for the next couple of nights. The guides are keen to show you wildlife even on the transfers. We arrived and then there’s a five minute walk to the tented camp making you feel like you are right in the bush.", "title": "A great stay in the heart of the Jungle", "helpfulness": 4, "user": "Samkirk9", "date": "April 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 28634460}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "There is a dining room / bar with a terrace overlooking the grasslands of Chitwan. You are quite high up which gives great views over the grasslands, and Rhinos can walk close to the camp. The tents are then spread over to the left and right of the dining area, all of which overlook the same grasslands. We were in tent number 1 which had views over a watering hole in the distance. This tent is also set on it’s own (3 & 4 were next to each other). I’ve read other not so positive reviews on here and don’t really agree – the tents are great and comfortable, even more so than some of the hotels we stayed in. The beds are comfy, there’s furniture in the tents to put things on, as well as an enclosed area for dressing / bags and beyond that there’s a very nice bathroom. Water is provided in a flask and they even put a separate flask in the bathroom for you to brush your teeth. There are a couple of chairs and a table outside the tent for you to relax and take in the sights and sounds of the Park, although there are so many activities that there’s little time for this. There’s no electricity here, which is great, but you will need to make sure batteries are charged prior to arriving. Instead there are hurricane lamps, which are lit for you whilst you eat in the evening and your bed is even turned down for you.", "title": "The Great Wildlife", "helpfulness": 3, "user": "rxchiu", "date": "March 8, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 14150490, "likes": {"liked": "— Friendly staff and variety of activities", "disliked": "— None"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The staff are very polite and informed and want to make sure that everything is comfortable for you. The food here is excellent, three courses in the evening and breakfast and Dhal Bhaat for lunch and it was some of the best food we ate in Nepal. The staff stay up until the last person goes to bed (the early starts mean that this isn’t that late though). The only thing I would say here is that the drinks are expensive.", "title": "Basic, but brilliant", "helpfulness": 2, "user": "Henso", "date": "November 9, 2007", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 10715534, "likes": {"liked": "— location, location, location!", "disliked": "— damp sheets"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007", "text": "In terms of activities, as soon as we arrived we had half an hour before we were on our elephant safari for a couple of hours. We saw deer – hog and spotted, rhino’s, wild boar and lots of birds – oh and a tiger foot print!! It was a weird experience riding on the back of an elephant, slightly uncomfortable but it’s a great way to see the grasslands, forests and rivers. The following morning we were driven to the Tiger Tops Lodge to pick up some other guests for our half an hour river trip, where we saw gharial crocodiles and not much else really. There is a jeep drive involved in this again where wildlife was pointed out. Early afternoon we had a talk about the elephants, and rather worryingly at first were able to get close to the elephants – we had a treat for them so they were well behaved – they are amazing creatures though. We were then able to get involved with the bathing of them in the local river.", "title": "A Great Experience!", "helpfulness": 3, "user": "Mwingereza", "date": "November 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 10696766, "likes": {"liked": "— Superb staff, great atmosphere, all the activities", "disliked": "— Too many insects at that time of year"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Following that we went on another jeep safari, which was probably a little too long in the end especially as the wind gets all the dust up at that time, but we were all probably a little disappointed that we didn’t see any tigers – we knew that was unlikely though. We did see the usual – rhinos, wild boar, deer, peacocks, monkeys and lots of birds and butterflies. Our final activity was an early morning elephant safari, which was now rather more comfortable than the jeep. This was our last attempt at seeing a tiger, but again no luck. We made up for that though as it was great watching the sun rise on the back of an elephant plodding through the jungle.", "title": "Not Up To Its Reputation", "helpfulness": 2, "user": "djonce", "date": "July 4, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "business": 1.0, "cleanliness": 2.0, "rooms": 3.0, "location": 4.0}, "id": 8056648}], "location": {"country": "Nepal", "region": "Central Region", "continent": "Asia"}, "variance": {"poor": 2, "average": 1, "very good": 4, "terrible": 1, "excellent": 17}, "aka": "Tiger Tops Tented Camp Hotel", "slim_ranking": 0.238095238095, "description": "Tiger Tops Tented Camp lies deep in the heart of Chitwan National Park - a small camp with style and comfort complementing the expert local naturalists and nature guides who escort all guests on wildlife safaris by elephant, jeep, boat or on foot to unfold the rich diversity of flora and fauna."}