{"user_rating": 3.5, "review_count": 94, "name": "Tilghman Island Inn", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We had a wonderful visit to the Tilghman Island Inn. We were a bit concerned w/ some of the previous reviews, but have learned to take reviews w/ a grain of salt...there is always SOMETHING to complain about, but we'd rather just enjoy our time away!", "title": "Wonderful weekend getaway!", "helpfulness": 1, "user": "gon2jamaka", "date": "October 15, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 5958796, "likes": {"liked": "— lovely view", "disliked": "— this is just picky, but one of us had to get clothes on to get coffee in the a.m."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "As others have mentioned the road to the inn is not overly exciting, and the first view of the front outside is nothing special. The inside however is inviting, and our room was lovely. Because we were celebrating our 10th anniversary we chose the most expensive room, but I think as long as you stay on the water side all of them are good (I say waterside just because the view is so amazing!) We had a nice sized room w/ a fireplace and a large bathroom w/super roomy Ultra bath. The water view was wonderful from both inside the room and on the balcony. We saw many birds, including a bald eagle right from the back lawn. Watching the water flow by was certainly very relaxing. We attended a food and wines of Spain weekend, which was a special event at the inn. The food was gourmet and the different wines were very good. We certainly learned about spanish wines and will look to buying them in the future. The inn is very casual as it's a boating community. The other couples that we met were really nice and we enjoyed talking to them while at the inn's bar. The inn is sizable enough to not feel like you are the only people there w/ the inn keepers, but small enough that you get personal attention from the staff, who were friendly and approachable.", "title": "Refreshing lack of chintz", "helpfulness": 3, "user": "SJKS", "date": "September 5, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5770000, "likes": {"liked": "— The food", "disliked": "— The price"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006", "text": "The inn is about 15 minutes from St. Michaels. We spent saturday in town looking at all the fun shops and had a great casual meal at the Steak and Crab rest. on the water. (we highly recommend their bloody mary and orange crusher!) After several hours of walking around the shops it was great to head back to the quiet of the inn and just read and enjoy the view before a cooking demo and later dinner. We would def'ly recommend the inn to friends, and anyone who enjoys good food in a relaxed atmosphere. We hope to return.", "title": "Nice place", "user": "mittar", "date": "August 15, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5613080, "likes": {"liked": "— Able to relax, very calming, great food", "disliked": "— Difficult bartender"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The staff is very accomodating and friendly. The room was clean and welcoming - feather comforter and crisp clean sheets. The jacuzzi bathtub was deep and inviting. And while it rained for most of the weekend, we still enjoyed a beautiful secluded view of the bay. Perfect for a relaxing weekend getaway. We had the tasting menu for dinner one night - it was superb. The food was inventive, fresh and thoughtfully presented. They have a great chef in the kitchen - we would return just for him.", "title": "Beautiful, Relaxing, Culinary Delight!", "helpfulness": 5, "user": "VA-Fields", "date": "July 31, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 5532244, "likes": {"liked": "— Location - beautiful, peaceful, relaxing", "disliked": "— NO Cell Phone Service - Sprint or Verizon"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2006", "text": "If you want flowery shabby-chic, this is not the place for you. But if you want well-appointed with just a hint of quirky to make it all interesting, then try it. We are certainly glad that we did.", "title": "A Dump ", "helpfulness": 6, "user": "LisaJ7676", "date": "June 29, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 3.0}, "id": 5409309}, {"rating": 2.0, "title": "Not what we were expecting at all", "text": "First, let me preface this review by saying that we did not actually stay at the Tilghman Island Inn. We were debating between the Inn & George Brooks House in St Michaels and could not have been happier that we chose the George Brooks House. We had originally selected it because we wanted to be closer to town with restaurants & shopping. We were certainly glad we did because Tilghman is a 20-30 min drive from all of the activities, great restaurants, etc in the area.", "user": "NicoleandKyle", "date": "June 21, 2009", "id": 32811384}, {"rating": 5.0, "title": "A Perfect Spot for R&R", "text": "My husband and I decided we would go to Tilghman Island Inn for a drink and possibly dinner to check it out and see if it was somewhere we wanted to book for a future stay. When we arrived, the parking lot was entirely made of mud and very difficult to avoid. I was shocked by what the hotel looked like - I had assumed from the website that it was more upscale than it actually is. It is in need of a repainting & looks quite weathered. Upon stepping into the lobby, it also appeared worn and slightly decrepit. Our first view was of two waitresses or serving staff members having a cigarette together behind the building. We walked into the small bar area where a bartender was fixing drinks. He didn't welcome or talk to us, but simply carried on with his business. He left the bar area to deliver the drinks and then did not return for the remainder of our visit. Another gentleman came in with a pitcher of water and asked if we were there for a drink. He mentioned that he was serving drinks to a larger party outside and we would have to wait for a drink. We mentioned that we didn't mind and asked if we could have drinks outside. He explained that he wanted to leave the outdoor space for the party to spread out if they wanted. Note that all of the outside tables & chairs were empty except those to the far left on the inn. He said we could have a drink inside thereby defeating the purpose of us wanting to watch the sunset & enjoy the weather.", "user": "Jeff_Cynthia", "date": "October 5, 2008", "id": 20651116}, {"rating": 5.0, "title": "We didn't want to leave!", "text": "We had been considering having dinner at the Inn, but the dining room was completely empty on a Friday night at 7:40 PM???? We quickly decided against it based on the level of service we got.", "user": "sailingboat", "date": "August 28, 2008", "id": 19466272}, {"rating": 5.0, "title": "Rain, Relaxation and Love", "text": "I can certainly tell you that we won't be returning to stay here!", "user": "lizeagleson", "date": "May 12, 2008", "id": 15971203}, {"rating": 5.0, "title": "We go there every year", "text": "We spent three idyllic days and nights at the Tilghman Island Inn on Chesapeake Bay in late August 2008--my wife, myself, and our two grown daughters. Our girls are a few years out of college (they are still willing to be seen with us and hang out with us in public, for which we are eternally grateful, and much-blessed). All four of us lead busy lives and work hard to make our livings. At least once a year, we seek an opportunity to spend time together and enjoy one another in a setting that affords us refuge, an unhurried pace, and a measure of peace. This was our first visit to Tilghman Island Inn; it won't be our last. The food is absolutely superb, the atmosphere relaxing, the owners and staff friendly, sincere, genuine, attentive, and warm. We did not take our dogs (the place is pet-friendly) but we enjoyed throwing the tennis ball to Jasmine, the standard poodle who is the inn's unofficial (or maybe she is the official) ambassador of good will. We had thought about staying in nearby St. Michaels, about 10 miles away. We're very glad we stayed on Tilghman (though we did enjoy a great dinner at Bistro St. Michael's one evening); also liked the quaint 1950s-style luncheonette on Tilghman called Two If By Sea (this is not a recreation of a 50s luncheonette--this is the real thing). Tilghman Island Inn is a pleasant blend of the intimacy of a B&B with the amenities of a larger hotel (it has about 20 rooms). We were blessed with good weather throughout our short stay; the sunsets alone made the visit worthwhile. We were also blessed to stay in a place where the management and staff take pride in taking care of people as well as taking care of details. That kind of effort always shows.", "user": "pups", "date": "May 8, 2008", "id": 15822390}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The Inn is located near the end of Tilghman island, Maryland. Fairly isolated and quiet, right on the Chesapeake Bay. This inn is VERY dog friendly. The staff is very helpful and friendly as well. We stayed on the lower floor which I believe are the dog friendly rooms, since the dogs are not allowed upstairs. Dogs are not permitted in the dining room or the pool area. But they are allowed in (and at) the bar and on the deck. We had dinner with our dogs in the bar. There are two small tables in the bar area for as well as seats at the bar itself and a piano for requests for the piano player. There are also seats near the fire place for relaxing as well. While in the bar you can see and hear the house bird, I believe it is a cockatiel named Gwen. You will also see the house dog, a standard poodle named Jasmine. We did not eat in the restaurant, but I could see it was very nicely appointed with many paintings from a local artist. The food was excellent. The bar serves an ala carte version of the dining room menu. A bit pricey, but still top notch. The rear deck, boat dock and lawn area were all clean and well kept. There are a number of Adirondack style chairs on the lawn for relaxing while watching the sunset. The deck has several tables with umbrellas. There is also an outside bar. There is also tennis court on the property.", "title": "Quiet, relaxing and dog friendly", "user": "beagleworld", "date": "September 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8739178, "likes": {"liked": "— Quite, relaxing, great room, great food, friendy staff and VERY pet friendly", "disliked": "— Light outside the door on all night."}}, {"rating": 1.0, "stay_parameters": "Stayed September 2007", "text": "The room was easily twice the size of a standard hotel room (compared to the Sheraton, Hyatt or Hilton). It had a California King bed, armoire with a small TV, love seat, private jacuzzi, two sinks and vanity separate from the large shower and toilet. The room has large (though older) air condition/heating unit that worked very well. I did not see the upstairs units, but they all had balconies overlooking the grass marshlands across the inlet from the hotel.", "title": "Didn't stay in the inn-just ate here. Terrible experience!", "helpfulness": 2, "user": "Chamounix", "date": "September 3, 2007", "detail_rating": {"value": 1.0}, "id": 8615123}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The only issues we had were that when we came to the bar to have dinner (we wanted to keep our dogs with us), we were told they were not serving dinner in the bar because the dining room was very busy that night and the owner did not to overburden the staff. At that moment, the lady I made the reservation with, spoke to the owner explaining that we asked specifically to eat in the bar prior to our arrival. He immediately agreed and had our table set for dinner. The meals were slow in coming out but we understood that from the dining room being so busy that night. The only other bother was the walkway light outside our door was on all night and shown through the door blinds lighting the room. No real fix there.", "title": "A special place for a relaxing rest", "user": "erntravels", "date": "June 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8023319, "likes": {"liked": "— The quiet, remote location overlooking the water", "disliked": "— needed a little more attention to housekeeping details, like replacement toiletries"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Regardless of the issues, the staff went out of their way to make us feel welcome and comfortable. I highly recommend the Tilghman Island Inn to those who are looking for a quiet, relaxing place to stay, especially for those with dogs.", "title": "Perfect Getaway: Beautiful Place, Incredible Food, & Friendly Owners & Staff", "user": "deblynne", "date": "May 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7546219, "likes": {"liked": "— The friendly service and beautiful decor", "disliked": "— not applicable -we loved it"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "My husband and I just got back from a long weekend at Tilghman Island/St. Michaels. Our dinner on Sunday night at the Tilghman Island Inn was the worst dining experience we have ever had! And we eat out a lot!", "title": "Badly needed get away!", "helpfulness": 1, "user": "CCTigers", "date": "February 20, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 6819664, "likes": {"liked": "— Relaxed atmosphere", "disliked": "— A little expensive"}}, {"rating": 5.0, "title": "great get away", "text": "We loved it !! I took my boyfriend there for a romantic weekend getaway. It was peaceful, quiet, and the food was great. The staff was very accomodating. I highly reccomend it.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "June 27, 2006", "id": 5396304}, {"rating": 5.0, "title": "Like Staying With A Friend", "text": "This was one of the best experiences we have had on a trip. We literally felt as if we were staying at a friends house. This inn is pet friendly, although I couldn't convince my husband to bring our FurBaby along.", "helpfulness": 5, "user": "tojojijo", "date": "March 5, 2006", "id": 4584794}, {"rating": 5.0, "title": "The best place I have ever stayed", "text": "They were so friendly at the inn that I felt that they had invited us to stay over for the weekend. We were greeted by Jasmine (one of the inn's 2 dogs), who wanted to go outside for a while.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "February 13, 2006", "id": 4457285}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "The room was nicely appointed and warm. The restaurant was great. It had a very nice view of the water and the staff was grand. The food was so good and presented very nicely. One of the great things about the restaurant is that it has no stuffy dress code, but is an upscale dining facility. One of the Best things about it is that it is totally non-smoking. The bar is also non-smoking and has a resident bird, Blanche. One of the nights there, they had a piano man playing. And a fire in the fireplace. It started snowing very hard while we were there enjoying drinks by the fire. Very romantic.", "title": "Never Disappointing", "helpfulness": 5, "user": "DragonShadow", "date": "January 18, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4361990}, {"rating": 3.0, "title": "Lots of potential, but....", "text": "I have no idea what some people might have been expecting when they gave the Tilghman Island Inn a bad review, but I find it very hard to believe that they stayed in the same place that we did!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "November 21, 2005", "id": 4131070}], "location": {"country": "United States", "city": "Tilghman"}, "variance": {"poor": 11, "average": 9, "very good": 26, "terrible": 11, "excellent": 37}, "aka": "Tilghman Island Hotel Tilghman", "slim_ranking": 0.833333333333, "description": "The Tilghman Island Inn offers 18 luxury rooms, waterfront and dock access, a spa and tennis courts. The restaurant has continued to receive the Wine Spectator's 'Award of Excellence' since 1996. Sit back and relax to the sounds of the bay and watch the sail boats drift by while delighting and indulging your palate."}