{"user_rating": 4.0, "review_count": 348, "name": "Timberline Lodge", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "I have wanted to stay at the Timberline since seeing it on the 'Great Lodges of the NW' on PBS. The lodge did not disappoint. Everything about the public areas is huge & gorgeous: the two level fireplace, the timbers supporting the structure, the picture windows, the furniture.", "title": "Timberline Lodge is a gorgeous old lodge", "helpfulness": 1, "user": "vacation_addict_Ohio", "date": "September 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 41359315}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The Cascade Dining Room is very expensive for dinner but the food was good though limited selections (a splurge), the Breakfast buffet is a good value. The selections in the Ram's Head Lounge were very good and much more reasonable. And you can't beat the view (either outside or of the lodge).", "title": "Amazingly beautiful!", "user": "olior", "date": "September 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 39789695}, {"rating": 5.0, "title": "Fabulous Food", "text": "Our room was a queen on the 3rd floor (with elevator) was quite roomy with a great bed and furniture. The bathroom had been recently updated - only problem is no counter surfaces. There was a noisy fan or generator or something that seemed to be right above our room (ear plugs were provided which was a clue).", "user": "nangwynn", "date": "September 4, 2009", "id": 39741548}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "The staff were all extremely nice, polite and helpful (the previous room occupants seemed to have removed everything portable and housekeeping hadn't seemed to notice so we had to ask for things and they were prompty delivered).", "title": "Would like to visit in winter", "user": "robdehulster", "date": "August 31, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 39374422}, {"rating": 1.0, "title": "Extremely Interesting Property, but horrible hotel.", "text": "The weather for our stay was horrible: mid 30's and driving rain - so we didn't ever see Mt Hood or do any hiking, but I'd go back just to roam around the lodge again! Course I have to save up for a year or two to be able to afford it.", "helpfulness": 7, "user": "waterman222", "date": "August 18, 2009", "id": 38069350}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled solo", "text": "I read many reviews here and some people make me want to ask \"did you really go there?\" It's not the Four Seasons or the Hilton it's a 72 year old mountain lodge. When I arived it was 6F and blowing 55 mph gusting to 70. Less that 4 minutes after getting to my room the front desk called and said we are moving you. I had booked a twin room but the last night I had to move to a queen room because of the wedding on Friday. They moved me to the queen room at the twin price for the week. Some rooms were having problems with the wind and blowing snow so the staff was moving fast to re-locate people to rooms not so affected by the blowing wind/snow storm. At times you could feel the entire building shaking. My new room was on the far end of the west wing and very nice.", "title": "It's all about expectations", "helpfulness": 2, "user": "treynolds37", "date": "December 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 51179885}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "I read reviews where some said the staff was rude and really didn't care if you were there or not. I will agree with some reviewers that the walls are thin but It was dead quiet at night in my room everynight.", "title": "Wedding Bells", "user": "lightyear84", "date": "November 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48953816}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "I would say the number one thing that impressed about TL was the staff.", "title": "Wedding Weekend", "user": "spearitOregon", "date": "November 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48943982}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled solo", "text": "From Grace and Kristin at the front desk to all the great staff at the Rams Head - Brad, Blair, Joe, Jenna and Teresa. Thank you all!!! As a solo traveler they couldn't have made me feel more at home. Yes the food was a little bit more expensive but you have to remember they are 6,000 feet up on a mountain and have to ship everything up there. I didn't go to the Cascade Dining room I ate and the Rams Head and across the parking lot at the WyEast day lodge where they had great dogs, burgers and the baby-back ribs!!! (thanks Tina)", "title": "Wonderful Hotel", "user": "RNMPennsylvania", "date": "October 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47645715}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "I would reccomend this lodge to anyone looking for a special place to visit not the usual hotel etc. Climbing, skiing and really good snowshoeing what more do you want?", "title": "Great choice", "user": "kljones45", "date": "October 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 46934471}, {"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "My husband and I just returned from a three night stay. Although the view was spectacular and the bathroom in the room was very nice, the stay was totally ruined by the most uncomfortable bed ever! We paid over two hundred dollars to stay at this lodge and the stay was ruined by our inability to sleep. The bed sagged in the middle, was lumpy and also had a six inch thick feather topper on it. We took that off every night, but it did not help. When I asked the front desk if they had any bed boards, the young woman replied \" oh we have those great feather tops and that should help\" No, I said it makes it worse. They had no bed boards and pretty much disregarded our complaint.", "title": "The Worst Bed in Forty Years of Travels", "helpfulness": 1, "user": "zinfanatic", "date": "July 27, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 35958673}, {"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We checked in to the Timberline for a one night stay in a room with a queen, private bath. The Lodge is lovely and rustic but unfortunately we did not get the \"quiet escape to the mountains\" experience that we were hoping for. Upon making the reservation, we should have been informed that a wedding would be going on. (I now know that they do quite a few weddings here.) After a very long drive, tour of the lodge, and a late lunch, we returned to our room for a nap. A lovely breeze was coming in the window when all of a sudden a huge crowd gathered underneath our window for an outdoor/indoor wedding reception. It was so loud that we couldn't even rest. We could see the writing on the wall and knew that this party would be going on for several hours into the evening. All of the surrounding rooms were occupied with people from the wedding. After speaking to 2 very nice girls at the front desk, they got the manager and I am happy to say that he did offer to give me a comparable room in a different wing. I then inquired about the option to check out and to my surprise he said that it was an option since he did not anticipate any difficulty in re-renting the room. So, we opted to check out and we lost a $25 deposit. Overall, we were pleased that the management was willing to work with us. But, I do feel we should have been informed of the wedding that would be going on when I made the reservation 2 weeks prior. The room and bathroom was clean but quite small. Aside from the noise from the wedding reception, it is a noisy place in general. You can hear even a quiet cough from the person next door. It is the only hotel I have ever stayed in that gives you 2 sets of disposable ear plugs in the room. (That should be a red flag!) But I must admit, the view is quiet pretty if you don't mind the noise.", "title": "Not what we expected", "helpfulness": 1, "user": "WendyJ", "date": "July 21, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 35425088}, {"rating": 2.0, "title": "Things to avoid to have a great time.", "text": "Just returned from a nice weekend on Mt Hood. You might want to avoid the 2nd floor rest in the lodge the food selection was not that great and the servers didn't really seem to want to be there, like we were imposing on them to serve us. We wanted to try the pizza rest on the bottom floor the Blue Ox but on a busy sat they closed early for some reason? The place has one very redeeming quality as the main dining breakfast service was outstanding and the people there were great - Eat there for breakfast. I also rec going to Gov Camp for breakfast to Huckelberry's as they were great and not that far.", "helpfulness": 2, "user": "travelerwashingon", "date": "July 20, 2009", "id": 35248381}, {"rating": 4.0, "title": "It's all about the location!", "text": "Also don't forget your ear plugs for the rooms, there was someone banging on a door saturday night at 3am for a half hour from some wedding - was wondering where security was as he was yelling....", "helpfulness": 1, "user": "KarenGH", "date": "July 17, 2009", "id": 35038250}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "The Magic Mile sky ride people were also great....", "title": "Worst service ever!", "helpfulness": 2, "user": "67Rambler", "date": "July 14, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 2.0}, "id": 34694812}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "Timberline Lodge has the luxury of being expensive because it does not have a large number of rooms and its location is amazing; however, it is not worth the price. I would suggest making a trip up to the Rams Head bar to catch the views and maybe sit by the fire. The rooms are small and if you get the room that has space for a crib or rollaway be forewarned that it sits off the stairwell so it is very noisy. I explained this to the front desk and they didn't do anything about it. Also, we ate dinner at Cascade, which was ridiculously expensive for the service we received.", "title": "Gorgeous but not worth the money", "user": "aaronostergaard", "date": "October 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 5.0, "service": 2.0, "rooms": 1.0}, "id": 46639509}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Timberline Lodge is what a sky lodge should be; rustic, warm, cozy, but also, spotless, friendly, beautiful. The staff is wonderful - food excellent. It is nice there are 2 restaurant choices; one upscale and one more casual. The setting on Mt. Hood is beautiful. We were visiting during \"off season\" .... I can imagine how the skiers would love to stay for days!", "title": "Stay at least once!", "user": "WhaleWatch", "date": "October 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 46568395}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We very much enjoyed our stay- that is why I am taking the time to write a quickie review. The hotel was clean and pretty- very well cared for. Loved our pretty bedroom with fluffy white comforters and mini falt screen TV. Best part for me and my young sons was the spectacular pool and hottub- so excellent- clear, clean water, crazy view of Mt Hood.", "title": "fabulous setting/ loved the pool!", "user": "hrvr", "date": "October 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 45591354}, {"rating": 2.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We will definitly be back- the summer special helped get us there. We hiked the day before then did the Adventure Park in Government Camp.", "title": "Waaaaay too overpriced", "helpfulness": 1, "user": "suzieq77", "date": "September 29, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 5.0, "service": 2.0, "rooms": 2.0}, "id": 45422237}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "$250 for a teeny, tiny room and even tiner way, way outdated bathroom that was not particularly clean. I don't care if it is a historic lodge, it was dated and desperately in need of renovation both inside and out. Food was expensive and of marginal quality. If the room had cost less, it would be easier to overlook it's shabbiness.", "title": "There is no place like it!!!", "helpfulness": 1, "user": "tangoguy2009", "date": "September 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 44083498}], "location": {"country": "United States", "city": "Timberline Lodge"}, "variance": {"poor": 32, "average": 32, "very good": 112, "terrible": 13, "excellent": 159}, "aka": "Timberline Hotel", "slim_ranking": 1.0, "description": "A historic hotel."}