{"user_rating": 4.0, "review_count": 622, "name": "Timhotel Paris Gare de l'Est", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "I thought this hotel was great. It is incredibly convenient to Gare L'Est, and I thought the neighborhood was very safe. If you walk a bit past the hotel there are a bunch of upscale bars and restaurants and a nice bakery (down the street a bit on your right). The hotel itself has a very nice lobby and cafe/breakfast room, and earned big points by having a loaner laptop which you can borrow and surf the web on for free.", "title": "Cute, convenient hotel with great staff", "user": "tashy1019", "date": "September 18, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 42727665}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Rooms are totally standard, small but normal for Europe/Paris. My only complaint is that the shower curtain had mold on it that really smelled once the curtain was wet. Everything else was great. I would totally stay here again, it's so convenient and affordable.", "title": "Not a nice part of Paris and very small, but very clean and friendly", "helpfulness": 2, "user": "NickBrenton", "date": "September 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 2.0, "service": 3.0, "rooms": 1.0}, "id": 40125405}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "My wife and I chose the Villa St Martin for our honeymoon in Paris for 5 nights. Now we didn't want to spend a lot on a hotel as we wanted more money to spend in Paris, our two finalists were a hotel near the Luxembourg Gardens and this one, we chose this one as it was a touch cheaper and from the website looked fantastic. Probably a good move now I think about it!", "title": "Excellent Paris Hotel and highly recommend it for the average traveller", "helpfulness": 3, "user": "Sandgroperwun", "date": "August 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 37126536}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "I emailed the hotel before we went to confirm the reservation as it was our honeymoon and I didn't want to be chucked in a 2 star down the road as some people were! I received a lovely email saying it was confirmed and thanks for choosing them for our honeymoon, they were honoured.", "title": "Great Hotel, Good Value", "helpfulness": 3, "user": "moulins23", "date": "August 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36475604}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "On the day of our wedding we travelled to Paris and our flight was delayed 2 hours, by the time we walked through a busy airport terminal and two metro stations we managed to get to the hotel at 10:30pm instead of 7:00pm of course not the hotels fault but we were exhausted. When we got there we were greeted by a charming woman and a lovely foyer, the hotel looked fantastic, and we were then congratulated on our wedding that day but received nothing? I know it's a little bad to shave points for not upgrading or something similar but we didn't receive a thing, no flowers, no champagne, no room upgrade, nothing! Everyone I know who stayed in a hotel on their Honeymoon has had something! The hotel was quite empty as well so a room upgrade would have been ideal! We shrugged this off and were sent up the lift to our room, after walking around the 3ft wide corridors for 15 mins sweating in the Parisian heat and lugging a 20kg suitcase around I went back down only to be told we were on the other side of the hotel on the top floor, there was no lift this time and we had to walk up stairs, we stayed optimistic and decided it was our honeymoon and we would forget that as it had been a long day.", "title": "Very good stay", "user": "searcher008", "date": "July 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35700672}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "We have just returned from a stay in this marvellous hotel. The staff are wonderful very helpful and very friendly. The rooms are very comfortable, very clean and a joy to stay in. Breakfast was buffet style and plentiful. No kettle in room but drinks available from bar all the time. We would recommend this hotel to anyone and will most certainly return for another stay.", "title": "The hotel ticked all boxes", "helpfulness": 1, "user": "CPlant", "date": "July 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35387728}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "I booked this hotel via Airmiles, having looked at many reviews of many hotels in Paris.", "title": "Friendly, well located hotel - a parisian gem", "helpfulness": 1, "user": "angep1969", "date": "July 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 34072040}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "It is fair to say that Parisian Hotels are not renowned for their roominess and the Villa Saint Martin is no exception. I'd booked a double and it was tiny - even to the extent that the bathroom was so small it contained a shower only - no problem with this except that it was so squeezed in that my partner was unable to actually get into the cubicle. No matter though as, upon booking in, the incredibly helpful receptionist had pre-warned us that the room was very small and offered to swap us to a twin room the next day. This was duly sorted out whilst we were out sightseeing and the new twin room was a vast improvement. Much bigger and with a fancy shower you could fit two into!!", "title": "nice but small rooms", "helpfulness": 1, "user": "deuce1011", "date": "July 6, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 34039447}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The hotel is located within a stone's throw of Gare De L'Est and about a 15 minute walk from Gare Du Nord - so was ideal for us as we travelled in by Eurostar. The area is not the swankiest Paris has to offer but I felt safe and secure at all times and there was a good selection of bars/restaurants nearby. (Would recommend La Bulle as a place to eat - not cheap but the food was stunning - and just a short walk north up the canal).", "title": "Nice hotel with convenient acces to metro and tourist bus", "user": "mwilliams205", "date": "June 21, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 32775924}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "we had continental breakfast included which was plentiful and just what I would expect with the usual selection of cheese, ham, fruit, bread, croissants etc.", "title": "Clean, comfortable base of operations. Helpful staff.", "helpfulness": 1, "user": "vballmdbkr", "date": "May 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 3.0}, "id": 30546507}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "The location of the Hotel is fantastic; as others have said, it is just around the corner from the Gare de L'Est, and therefore the entire metro system. The staff were friendly and polite.", "title": "OK Hotel, not great.", "user": "Montyspaw", "date": "March 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 26021454}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Our room was the main problem; tiny, with a double bed we had to squeeze past the windows and the bed to go backwards and forwards. The bed was really uncomfortable (and I can usually sleep on a washing line!), and considering we ran the Paris Half Marathon one day while there, we still couldn't get a decent full nights sleep. The room was clean enough, but smelt of cigarettes (the plug-in air freshener just wasn't enough), and we could hear every move made by our neighbours.", "title": "Great location for Gare de l'est and Gare du Nord", "user": "Nasher78", "date": "March 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 25809277}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with friends", "text": "Breakfast was adequate, but mysteriously every evening we went to the bar for a cup of tea, the hot water machine had 'broken down', and yet was somehow working again in the morning!", "title": "great find, loved the area, wonderful gem of a hotel in canal saint martin area", "user": "pjs536rome", "date": "February 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25201904}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "I appreciate that these are small gripes, and our overall stay was a pleasant one. It's these little things that niggle, however, and make what could have been a very good experience into an average one.", "title": "Good location, clean and small.", "user": "Bogacha", "date": "January 29, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 23991219, "likes": {"liked": "— Cleanliness, friendly staff.", "disliked": "— small rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "Hotel is in a great location for Gare de l'est (2 minute walk) and Gare du Nord (10 minute walk). Rooms are small but clean, with a nice bathroom (bath very small.. but at least it had a bath). Plenty of choice for breakfast, staff helpful and pleasant. Perfect for a weekend stay in Paris.", "title": "Great value for its money!!!", "user": "pipi1982", "date": "January 28, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 23977650}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "I liked the hotel, rooms are comfortable enough, considering that one wouldn't want to spent all day in the room. I didn't like the sheets on the bed; would appreciate individual sheets rather than a big 2-person sheet. I missed a minibar. Further everything was fine. Staff well informed and friendly; English speaking. Bar and breakfast were perfectly in order.", "title": "Fine hotel, reasonable price", "helpfulness": 1, "user": "Joh_AnnZevenaar", "date": "May 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 30501528}, {"rating": 3.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Good hotel, value for money. I would recommend the hotel to friends visiting Paris and arriving on train.", "title": "Small but Cozy", "helpfulness": 1, "user": "Nina W", "date": "May 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 29730778}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "Hotel staff were always helpful and greeted you everytime you walked past reception. Our room was TINY with a pretty view of the courtyard. It did it's purpose, it was warm and comfortable. It took a while to figure out how to use the shower! Breakfast was the standard European fare (same everyday). Try the croissants! The area was eccentric and certainly not touristy. But it's close to the Metro and Gare du Est (you can walk there), it was easy to the touristy bits of Paris. I would recommend exploring the area during the day, some cool little boutiquey odds and ends stores. At night, stick to main roads, it just felt a little unsafe. Wireless internet available.", "title": "Great for Eurostar arrivals, to far from Paris sights.", "helpfulness": 1, "user": "MelindaRenteria", "date": "April 22, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 2.0, "service": 3.0, "rooms": 2.0}, "id": 28588864}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Good location if arriving from London on the Eurostar Train. Location to far from all the top 10 Paris sights. The metro is close to the hotel. Rooms are a bit small could use a renovation more updating. Breakfast was ok not many choices. Staff was friendly. We had friends staying in the Latin Quarter they were very close to the attractions. I would suggest staying in the Latin Quarter it is very quaint and close to the city center. The Villa St Martin is to far North in the city, just taxi down to Latin Quarter.", "title": "Great Value 3*** Hotel", "helpfulness": 2, "user": "LifeWorkbalanced", "date": "March 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 26624670}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Villa Saint Martin is a great value 3*** Hotel particularly for an expensive city like Paris. It is well located for metro/train and bus journeys from Gare de L'Est which is about 200 metres away. The Reception staff were most helpful and friendly at all times. We had a fairly large room at the back of the hotel with the adjacent school backing on to the picturesque Saint Martin canal. The room decor was fine apart from a prominant rainwater ? stain on the curtains. An unexpected bonus was the 42\" flat screen LCD tv which had several decent English/US films during our stay. The bathroom had a half sized bath which was a bit cramped for 6ft plus but nevertheless much appreciated after pounding the streets for hours looking at the sights. The Breakfast room was fairly small and can get busy at times but is available from 0630 which is useful for early departures or excursions. The buffet style cold breakfast included a good range of hot drinks,fruit juice, cereal, fruit salad,breads,pastries, hams etc which were regularly topped up. We will definately stay there again and have no hesitation in recommending Villa Saint Martin to others.", "title": "Excellent value for money", "helpfulness": 1, "user": "BUCEPHALES", "date": "March 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 26116670}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 3, "variance": {"poor": 17, "average": 77, "very good": 284, "terrible": 17, "excellent": 227}, "aka": "Villa Saint Martin Hotel", "slim_ranking": 0.268265476854, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.0}}