{"user_rating": 3.5, "review_count": 1246, "name": "Titanic Beach Spa & Aqua Park", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "I booked this holiday on the spur of the moment as a diving destination without first checking on Tripadvisor - BIG MISTAKE.", "title": "Stay Away", "helpfulness": 2, "user": "G04it", "date": "November 14, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 1.0, "service": 1.0, "rooms": 2.0}, "id": 49195923}, {"rating": 1.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "After we booked we read loads of dubious reports about this hotel, most of which are true.", "title": "Don't Go!!!!!!!", "helpfulness": 2, "user": "Gooner011", "date": "November 11, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 4.0}, "id": 48970771}, {"rating": 2.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "I can only assume that the people who rate this hotel are limited in their experience of a decent 5 star.", "title": "My partner is still sick, two weeks after we returned!! Filthy hotel", "user": "Smianj", "date": "November 10, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 2.0, "service": 3.0, "rooms": 2.0}, "id": 48895407}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "We have travelled the world and a good definition of a 5 star hotel can be found on Superpages.Com, and is as follows,", "title": "not too bad", "helpfulness": 1, "user": "samdani", "date": "November 4, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 48511855}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "5-Star Rating: A luxurious hotel, offering the highest degree of personal service. Elegance and style abound, and rooms are equipped with quality linens, VCR, CD stereo, jacuzzi tub and in-room video. There are multiple restaurants on site with extensive, gourmet menus, and room-service is also available 24-7. A fitness center, valet parking and concierge service round out the experience.", "title": "Beautiful Hotel", "helpfulness": 3, "user": "LouiseK78", "date": "October 31, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 48172910}, {"rating": 2.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "This hotel has great amenities for swimming a great water park for children great clean rooms but here we go..... its full of russians iggnorant ,arrogant russians with no manners lunch times are a joke its a bun fight with piles of food left on tables by greedy peasant russians, there is no chance of sitting down with your partner to eat a meal you set your table go for your food to find a russian sat there, you queue they do not and do not expect to have to.Staff do not clean tables mainly because they cannot cope with the ammount of people in the so called restraunts.", "title": "lunchtimes absolute chaos", "user": "watson1963", "date": "October 15, 2009", "detail_rating": {"cleanliness": 1.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 46929859}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "Its a shame but Im sorry russians do not know how to behave with their new found freedom and wealth stay away if you are English find a hotel with the Germans, French anybody but russians", "title": "FANTASTIC HOTEL WITH WARM FRIENDLY STAFF", "helpfulness": 1, "user": "valley_homes", "date": "October 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46927982}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Have just returned from LTI Titanic Beach and was so impressed just had to write a review. The beach is paradise, warm and clear with the most amazing coral reefs.", "title": "restuarants have the biggest problems but hotel beautiful", "user": "mrsturtleHampshire", "date": "October 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 2.0, "rooms": 4.0}, "id": 46908751}, {"rating": 2.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "My son usually dives every holiday however he said he didn't need to this holiday as he saw a bigger variety of sea life just snorkelling from the pier. The aquapark was excellent with no queues and helpful staff and kept the family entaertained for hours.", "title": "5 Star Facilities. Terrible Food, Drink and Service.Awful.", "helpfulness": 3, "user": "eagleye7", "date": "October 13, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 2.0, "service": 1.0, "rooms": 4.0}, "id": 46738021}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "I just couldn 't complain about this hotel, to wake up and be right by the glorious red sea and have your own aquapark for me was a dream, i guess some other reviewers are just hard to please!", "title": "Great Holiday", "helpfulness": 1, "user": "chater01", "date": "October 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 46557532}, {"rating": 1.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "Absolutely the worst experience I have ever had with regarding cleanliness, food and staff abuse. I am a frequent traveller to Egypt - 3 times in the last 12 months, so I am experienced in what to expect. There was not enough crockery or glassware to supply customers with - when it was provided it was filthy (plates at dinner service was still wearing the tomato sauce and mustard from lunchtime serving...yuk!) plastic/acrylic drink glasses were so dirty that the scum marks gave the appearance of FROSTED glass, you couldn't see through them! Shortage so severe that there was a scramble to actually obtain a plate at mealtimes -if us brits have a problem with russians - you should try dealing with a bunch of ANGRY russians! Staff abusive, even fighting amongst themselves on complex - this was a daily occurance. Childrens slides didn't work for 12 days out of 14 - my grandson was devastated. No lifeguards at children's pool although 2 based at every adult slide?? No hot water throughout our stay - reported 5 times and to the general manager's secretary and resident manager - who eventually sent an engineer who said it was a fuse - but didn't fix it! Adult slides were great - only acceptable service in the entire hotel. I was told that this hotel is no longer under the LTI banner ( hotel has a new owner apparently) by the general manager's secretary, I would say it very likely it has lost the franchise because of its disgusting standards (my own opinion of course!) If you haven't booked yet -THEN CHOOSE ANOTHER HOTEL. If you have booked - I hope the new management can improve standards because as it stands service cannot get much worse. Room cleaned only a handful of times and then after 5.30pm (it was getting dark and the pools/slides closed at 5pm) sheets only changed because a supervisor was sent to the room by the management for a check - supervisor was not pleased and instructed the bedding be changed there and then, cleaner was not going to change the pillowcases though until I insisted. Should you need to use a doctor.... do not use the one onsite - thoroughly unscrupulous and refuses British medical insurance! Takes the insurance details, tells you he is contact with them - but refuses to submit the medical report required.until you have paid the bill in full, you don't find this out until you check out of the hotel and are then presented with his bill in full - only then does he write the medical report - he strung us along with his lies for 6 days! Our insurance company contacted him immediately and he also told them he had submitted the written report - this report was not written until he had fleeced us for the money first. The hotel condones this????????", "title": "Don't do it!!!!!!!!!!!!", "helpfulness": 1, "user": "grrowler", "date": "October 25, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 3.0}, "id": 47694215}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "just back from the titanic beach spa and aqua park,had a fantastic time.the hotel is huge and very clean..everyone tries really hard to please and works for buttons.", "title": "FANTASTIC WILL BE GOING BACK(to many moaners on this forum)", "helpfulness": 1, "user": "connor06", "date": "October 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 47681885}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "ROOM-our room was very big with a balcony,looking on to pools and sea.mini fridge was filled everday,with water and fizzy drinks.room was cleaned everyday .", "title": "Here's the real truth", "helpfulness": 1, "user": "sainsy", "date": "October 25, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 47681748}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "POOL-the pools stretched from the hotel reception,to the beach.they were always clean.", "title": "Good watrepark but bad food choice!!!", "helpfulness": 1, "user": "sergey7777777", "date": "October 24, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 47625444}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "ALL-INCLUSIVE-was 24hrs a day .", "title": "The very best hotel I've been to, yet!! Should be 6*", "user": "globetrotter2755", "date": "October 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47623049}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Hotel is spacious, clean and has an air of slightly dated luxury is some areas, although well maintained and there are also some modern touches. Our room was large with lots of storage (bring your own coat hangers) and the beds were very comfortable. Aircon worked fine and an extra card key was supplied when asked. Safe was free and easy to use. Bathroom was clean (apart from loo brush). Fridge topped up with water and soft drinks daily. Towels and bedding changed regularly and when required. Walk in shower was quite good - a fixed shower head on the wall which could have done with a bit of a soak in soda! Some of the fixings were a bit rusty- but it was satisfactory. We had hot water all the time, but a few others didn't during our stay. (Make sure you run water for about 5 mins before you ask reception to resolve it!) Pools are huge - lots of space and very comfortable sunbeds both by the pool, waterpark and beach. Quite a walk down the pier to snorkel - but there was a little golf buggy you could jump on if you saw it. You see people regularly cleaning the pools, hotel and garden areas. Not many toilets on site - so we sat near our room, kept the patio door open and popped back in when we needed to. Bar service was quick and good - the bar just by the sweeping marble staircase was very quick, as was the pool bar whose staff brought drinks around most of the day. It's good that service is quick as sometimes they only have the smallest of glasses to serve the drinks in (just a bit bigger than shot glasses!) However, they will give more than one drink at a time and are quick anyway. Self service of soft drinks in restaurants, bars and pool / beach bar. I had a Cleopatra, scrub, facial massage (normal price £55, said I could have it for £40 and I said I'd only pay £30 and she came back later and said her manager said that was ok - but not to tell anyone!) Also I had the painful but effective facial with hair removal and pedicure for £40. The ladies changing area in the spa isn't brilliantly clean and there are male staff oggling women changing through open doors - even walking through! No privacy or closed changing areas. The hotel is at the end of a long strip of hotels...with some shops outside. We were only there 1 week and just wanted a relax, so didnt take the shuttle into the Marina area (don't like being hassled) It's only 15mins from the airport to the hotel and there are lots of unfinnished building sites in between, with lots of rubbish and rubble lying about. Lots of brightly lit shopping strips and malls in the area too. The private transfer booked on Alpha was very cheap and the service we got was worth every penny. He met us as we came into the terminal (our name was on his clipboard) He whizzed us to a cubicle with no queues to pay for our visa, to the front of the queue at passport control, (explaining to bemused holidaymakers that they had to wait for their whole coach to be ready, whereas we didn't!) Our cases were waiting for us and we must have only been in the airport all of 15 mins max! We didnt bother with the entertainment or activities - but from what others said, it's what you'd expect when abroad. I've left the restaurant till last as everyone we spoke to felt it let the rest of the hotel down. Food: 1 days choice was very poor, other than that, reasonably good choice of hot food. Lovely bread, pastries in the morning, the usual eggs, pancakes and omlettes. Hot breakfast choices were good. The choice of salad was restricted somewhat. Always a barbeque with either fish, burger, crab, steak Slightly watery icecream every day. Some food cooked in front of you such as stir fry, eggs, or meat cut in front of you. Desserts were lovely with again, only 1 day being poor. The problem with the restaurant is with the managers....they haven't organised things propertly at all. The people who clear the tables work hard, but there is no-one making sure tables are clean and laid ready for diners as they come in. The men who lay the tables don't seem to work very fast. The impression we got from the Rose restaurant was that after 8pm, they wanted people to eat in the other restaurant, to give them an easy time. I'd seen a supervisor telling diners to go next door on a few occasions. 3 supervisors of varying seniority seemed oblivious to there being no clean tables waiting for diners, staff bringing out extra bowls for soup, where there were no spoons and diners wandering around trying to find somewhere to sit. If challenged, they seemed to like to shout at the staff who were working hard and then stand around chatting again....I don't think they've understood the PROACTIVE concept at all! When asked for soup spoons - the senior manager brought out 12 - about 5 people were waiting and within 10 mins, no more had been brought out and more people were waiting yet again. I think they should be able to resolve the problems with the managers in the restaurant - so overall, I would say to people that if you can get the holiday at a reasonable price and can keep the problems in the restaurant in perspective, you will have a lovely holiday!", "title": "Enjoyable holiday - restaurant needs organising tho!", "helpfulness": 1, "user": "roundyFlint", "date": "October 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 47592622}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "Stayed at this hotel from 30 Sept-14 Oct with a friend. Got a great deal £600 for 2 weeks all inclusive so cannot complain!!!!!!!!!!!!!!!!!!", "title": "Excellent!", "helpfulness": 4, "user": "x-natalie-x", "date": "October 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 47547336}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "This was the ideal getaway to relax and chill out in the sun! The hotel was absolutely stunning with the biggest swimming pool i'd ever seen!!!!!!!!!!! We had a twin room which was extremely spacious with 2 3/4 beds and a sofa bed. A flat screen tv with numerous movie channels to watch. The bathroom was immaculate with a large walk in shower. The balcony had an excellent view over the beach and waterpark so no complaints about the rooms. Upon arrival at hotel i had asked for a nice room and we were offered a bungalow with water surrounding it, but unfortunately it was only available with a double bed! We turned this town for the twin room, but once i saw the bungalows which were truly beautiful i'd have shared the bed with my friend hahah! SO if you get offered one of these- jump at the chance!", "title": "not the best", "user": "sodpot", "date": "October 22, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 47472229}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "I was also very impressed that you were issued towels for the sunbeds, this was the first time i had seen this and thats definately a plus for me! Also, very impressed that the sunbeds had wee matresses on them! The recreation attendants were VERY VERY helpful and one in particular (Aysam) made lying at the pool very humerous!", "title": "Great Hotel - Massively let down by the food.......!!", "helpfulness": 1, "user": "William-Mae", "date": "October 18, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 47137729}, {"rating": 2.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The beach was not that much to rant about if im honest- you had to walk a good 50m to reach any water! Tho it was very beautiful! The beach bar was always fullof british at lunch times as this seems to be the place to go for lunch! (hot dogs, chicken in a bun, pizza)", "title": "beautiful hotel, service worst ever...............", "helpfulness": 1, "user": "catlyne", "date": "October 17, 2009", "detail_rating": {"front_desk": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 5.0}, "id": 47095588, "likes": {"liked": "— we had a bungolow with pool", "disliked": "— serice"}}], "location": {"country": "Egypt", "region": "Red Sea and Sinai", "continent": "Africa", "city": "Hurghada"}, "stars": 4, "variance": {"poor": 133, "average": 221, "very good": 422, "terrible": 76, "excellent": 394}, "aka": "Titanic Beach Spa & Aqua Park Hotel Hurghada", "slim_ranking": 0.263157894737, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Titanic Beach Spa & Aqua Park is located on the amazing sandy shores of the red sea, offering it guests a wide variety of fabulous activities making it a dream come true vacation. The resort will have the biggest Aqua Park in Hurghada, with its numerous water slides, wave pool, rafting river, an endless adventure of pleasure."}