{"user_rating": 4.0, "review_count": 330, "name": "Tivoli Jardim Hotel", "reviews": [{"rating": 2.0, "title": "not as i expected", "text": "first impression: dirty room. furniture is not in good condition.", "user": "faricas", "date": "July 10, 2011", "id": 115207427}, {"rating": 3.0, "title": "Mixed feelings", "text": "bed was small and not very comfortable. we asked for a king size bed but they gave us a twin. the room service is the worst i have tried. waited more than 1h30 for them to pick up the phone.. not professional at all.", "user": "iliasv", "date": "May 15, 2011", "id": 108332762}, {"rating": 3.0, "title": "Compact but Clean", "text": "we had dinner in our room but the menu is not what i was expecting. just a few options with no interest at all and very, but very expensive. you simply can go around the corner and find some nice restaurants with wonderful food at a reasonable price.", "user": "worldgypse", "date": "May 13, 2011", "id": 108139780}, {"rating": 3.0, "title": "Some good, some bad", "text": "staff has a lot to learn when it's there...", "user": "ScotinNorway", "date": "May 13, 2011", "id": 108113815}, {"rating": 2.0, "title": "Disappointing", "text": "breakfast is nice and plenty.", "user": "BarrieDunnLondon", "date": "May 11, 2011", "id": 107769342}, {"rating": 5.0, "title": "Great location, very good service", "text": "We stayed at Tivoli Jardim for a weekend in April. I had chosen this hotel for the location and it was perfect. We could walk to the square of Restauradores, and there were plenty of buses and a metro station to take us everywhere else, including to the airport, on the main avenue.", "user": "Neuforce", "date": "April 4, 2011", "id": 102720538}, {"rating": 3.0, "title": "Disappointed", "text": "The hotel is a no-surprise 4 star hotel, with the typical equipment (wi fi, tv, coffee maker, etc), a pleasant balcony, and the typical features of such hotels. Clean, bright, modern.", "user": "emliju", "date": "December 29, 2010", "id": 91020035}, {"rating": 3.0, "title": "50/50 experience", "text": "The staff was very friendly and welcoming.", "user": "jb1933", "date": "December 6, 2010", "id": 89193054}, {"rating": 5.0, "title": "Very nice hotel.", "text": "Having stayed here many times in the past we were most disappointed - the recent refurbishment has made the hotel modern to the point of being stark and cold. The room was miniscule - maybe we were unlucky with that. The room was also fvery cold and did not warm up even by the next morning leaving the bathroom so cold you had to be extremely brave to shed clothes and take a shower. What a shame as this used to be a great place to stay - we will no be booking this one again.", "user": "Nil A", "date": "December 5, 2010", "id": 89106666}, {"rating": 4.0, "title": "Smart hotel in a good position and the pool was a big plus", "text": "My husband and I stayed at Tivoli Jardim while in Portugal on our vacation after Thanksgiving. We spent two nights there at the end of November and enjoyed our experience very much - kind and helpful staff, super comfortable bed and pillows, a fun and trendy good restaurant/bar, great location for touring the city, etc.", "user": "KernowTraveller9", "date": "November 10, 2010", "id": 86623813}, {"rating": 4.0, "title": "central friendly and confortable", "text": "I have stayed several times in this hotel, so there were no surprises.", "user": "edgarsz", "date": "November 25, 2011", "id": 121017486}, {"rating": 3.0, "title": "Well located, average room, staff could be more friendly.", "text": "The hotel is modern, rooms are nice and comfortable.", "user": "Planetorexplor", "date": "October 24, 2011", "id": 119691769}, {"rating": 4.0, "title": "Convenient and well-kept", "text": "The location is ideal, just off one of the central avenues of Lisbon , but not on the avenue itself sparing you the noise of the incessant traffic.", "user": "Anders_Sto", "date": "October 18, 2011", "id": 119443180}, {"rating": 4.0, "title": "good room, great location", "text": "On the other hand part of the rooms facing the front of the hotel , when their windows are open, can hear the workings of some huge air conditioner compressors of the building next door.", "user": "peterinholland", "date": "September 28, 2011", "id": 118697885}, {"rating": 4.0, "title": "Great location. Great value. Would rec it.", "text": ".", "user": "milestogo26", "date": "August 22, 2011", "id": 117084073}, {"rating": 4.0, "title": "Nice hotel, small but modern rooms, tiny lobby, good breakfast.", "text": "Review - Hotel Tivoli Jardim", "user": "sunluva7", "date": "August 15, 2011", "id": 116762919}, {"rating": 4.0, "title": "Good Hotel, Great Location", "text": "This hotel in central Lisbon was the first stop of several on a family vacation through Portugal. Hotel Tivoli Jardim is the little sister hotel of the larger and grander Hotel Tivoli Lisboa next door.  The hotel was clean and modern, and the staff was pleasant and helpful.  Standard rooms are modern, nicely decorated, but a little small by American standards.  The lobby area is also very small.  With the exception of two clamshell hanging chairs located beside the reception desk, there was no place to sit and relax.  However, one flight up is a small lounge/bar with additional seating.  Our stay included breakfast, which offered a nice selection of fruit, cereal, yogurt, bacon, scrambled eggs, sausage and pastry.  Guests staying at Hotel Tivoli Jardim are welcomed to use the facilities at Tivoli Lisboa next door, including a pretty outdoor pool, but with a somewhat inconvenient hike up several levels of steps, but well worth the walk.  This lovely, inviting pool is round, surrounded by trees and greenery and includes bar service, and is a popular place to relax for guests from both hotels and, as such, lounge chairs are scarce during the mid-day hours.  Consequently, it was difficult at times to find a vacant chair or lounger.  Otherwise, it's a lovely hotel oasis.  For guests who don't mind small rooms and a less than inviting lobby, the hotel is a fine stopover for a short stay in Lisbon.", "user": "Sloan_Chace", "date": "August 1, 2011", "id": 116121149}, {"rating": 2.0, "title": "Ants all over the Dining Room", "text": "Had seven nights here at the end of July. The balcony rooms were \"a must\" for us and those at the Tivoli Jardim are usable (table and two chairs) and in the shade in the hot afternoons. Our room was clean and comfortable though we had to live out of suitcases for the week, as there are no drawers in the room (at least we didn't find any) and there is limited hanging space.", "user": "james23London", "date": "July 25, 2011", "id": 115744301}, {"rating": 5.0, "title": "A Prazer", "text": "The room is equipped with a Nespresso coffee maker and it's a 1E charge per cup (it's an extension to the mini-bar). It will make hot water too.", "user": "AndrewCrown", "date": "July 20, 2011", "id": 115566447}, {"rating": 4.0, "title": "Great location and very nice hotel", "text": "The staff are friendly and helpful, our breakfast was included and was of a high standard with a good range of fresh food on offer.", "user": "Hoya91", "date": "July 10, 2011", "id": 115210580}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "I have stayed in this hotel several times and reviewed it as well. I has kept its very high standards.", "title": "location , confort and value for money", "user": "edgarsz", "date": "November 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 184883754}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "It is very well located, off one of the main avenues, but not on it, so much quieter. Rooms are comfortable and very well maintained . Staff is very friendly and helpful. Wifi is free for members of their frequent stayer program and you can join for free on the spot.", "title": "Nice hotel", "user": "Kokkaria", "date": "November 2, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 183254417}, {"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Try to stay on a high floor facing the back, far away from the air condition machines on the front of the hotel. Very good value at the rate offered at this time.", "title": "Not bad ,not great!", "helpfulness": 1, "user": "Anvers", "date": "October 23, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 182143532}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "Nice hotel in a good area. Clean, comfortable, rather small room but we had an extra bed in it. Balcony and pool in a nice garden. Expensive breakfast.", "title": "A Good Hotel in the Centre of Lisbon", "helpfulness": 1, "user": "RonnieI48", "date": "October 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 180196139}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "The hotel is very quiet as it´s on a dead-end street just behind the \"sister-hotel\" Tivoli on the main street.", "title": "Convenient location, quiet backstreet, small bathrooms.", "user": "Alan K", "date": "October 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 179841801}], "location": {}, "stars": 4, "variance": {"poor": 20, "average": 59, "very good": 154, "terrible": 4, "excellent": 93}, "aka": "Tivoli Jardim Lisbon", "slim_ranking": 0.413636363636, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Tivoli Jardim reopens totally remodeled with new bright and contemporary decoration where the lines are based on fresh and natural themes. This oasis in the centre of Lisbon meets the most demanding of tastes with new rooms and exceptional facilities for both business and pleasure. The new colours of this welcoming 4 star hotel, are warm and comfortable but with a balance which creates soothing and restful settings."}