{"user_rating": 4.5, "review_count": 77, "name": "Toloman Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "As with some other reviewers I usually choose a 4/5* hotel and all inclusive, and I have never been to Turkey before and was unsure about going. However, the information and pictures on the hotel site, together with the reviews read, just gave me a really good feeling that it was worth taking a chance. I am so glad that I did as it proved to be one of the most enjoyable holidays I have ever had.", "title": "One of the best holidays I have ever had", "helpfulness": 3, "user": "LuluIsleofWight", "date": "October 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 46725308}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "(Remember my review is for late season. Bitez Bay and the resort, although enjoyable in every way for me, would be louder and busier at the height of the season.)", "title": "CRACKING LITTLE HOTEL", "helpfulness": 1, "user": "JIFFYS", "date": "October 2, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 45664559}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The hotel (booked through First Choice/Thomsons) offers B & B but there is an option for HB if you wish. I chose this and it turned out to be tremendous value.", "title": "Brilliant place to chill,great staff who make you feel welcome", "user": "westyBodmin_Cornwall", "date": "September 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 45516439}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "I do not like it to be too hot and always go early or late season abroad. I went for 2 weeks (with my husband) from 19th September. The first week end/week was rather busy at The Toloman Hotel and Bitez as it was a religious festival - but it was nothing like as busy as it would have been in the summer season. Having Turkish people/regulars from as far afield as Istambul proved to us that the Toloman was definitely a favourite with them and other English guests who were also regulars. The second week was much quieter and extremely relaxing.", "title": "A great time......again!", "helpfulness": 1, "user": "KAH365", "date": "July 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 34732673}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The hotel has 31 bedrooms behind its' attractive open air restaurant area where good food is served virtually all day and long into the evening for anyone. (The buffet breakfast is none too exciting but completely adequate and, if you prefer, they will cook you a full English for a small charge. I enjoyed it and as it is served from 07.30-10.30 there is no need to be picky.) In front of this area is a not too wide public promenade and you can sit and watch the world go by at your leisure. Then in front of this is the beach area with sun beds, parasols, swings and huge cushions and bean bags to lounge upon. The waiting staff - who give impeccable service and are extremely friendly and helpful - will attend to your needs in this area too.", "title": "This is a SUPER PLACE to go for a lovely Holiday", "user": "sunnygeorge", "date": "July 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 34321707}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Just returned from a two week stay at this hotel. As other reviews have mentioned, the location is perfect - just a pathway separates the hotel from the beach. There is also a lovely swimming pool at the rear of the hotel - this tended to be very quiet in the mornings but busier in the afternoons with families returning from the beach. Breakfast was taken in the restaurant at the front, overlooking the sea - a super start to the day! Breakfast was the same every day - cheese, ham, boiled eggs, yoghurt, jam, cake, which we found to be a reasonable choice.", "title": "Super hotel", "helpfulness": 1, "user": "robert28", "date": "July 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 71088930}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "Rooms were small but clean, with towels changed every two days, and beds every three days. We had a room overlooking the garden and it was very peaceful. (Must mention here - there's a lovely family of cats that live in the garden - mum and her three kittens, two ginger and one grey. They are such fun to watch and I'm sure would really appreciate some scraps of food!)", "title": "Great holiday location", "helpfulness": 1, "user": "DeadlyHampshire", "date": "July 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 70002187}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "We had the bed and breakfast option but I believe that if you have half board you can swap your evening meal for lunch. We ate at the hotel most lunchtimes so would probably choose half board if we went back. The hotel food at lunchtime was very good - salads, sandwiches, omelettes, baked potatoes - and very reasonable. We also ate here one evening and again the food was very good, and reasonably priced.", "title": "Total Chill-out", "helpfulness": 1, "user": "jackiecarman", "date": "July 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69947893}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "As far as the other restaurants in Bitez - many of them are very similar with huge menus covering everything from Chinese, Indian, Mexican, Italian - even Turkish sometimes! By far the best was the Black Cat (done separate review on that). Wasn't keen on the Golden Spoon although it was always very busy. Almera was very good, and run by a couple of really nice blokes. Beware of the little chap trying to get you into the Sultan. He kept offering us free bottles of wine, discounts. When we eventually went to eat there and showed him the 15% card he said the menu had changed a couple of days before and the offer was no longer valid! We did eventually get the discount but didn't bother going back there.", "title": "Fantastic, chilled out hotel - just as good a second time!", "user": "ShellandRoss", "date": "July 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69651752}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Found the restaurants off the main strip to be better quality and value. Pedesa and Blue Moon were very good, but one of the best meals we had was at the restaurant at the Sirca Apartments. It's a bit off the beaten track (road leading from the back of the Ambrosia Hotel) but worth the extra few minutes walk.", "title": "Best Chilled Holiday Ever", "helpfulness": 1, "user": "PamWill", "date": "July 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 69475240}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Just returned from one week in Hotel Toloman in Bitez. Everything was just as it had said on the trip advisors from other people. The staff were so friendly and helpful and nothing was never too much trouble. We stayed for one week Half Board which is worth having as it is so inexpensive. Although a couple of evenings we went out to eat just for a change. It was quiet in the evenings as the season has not quite started yet. The hotel is set directly on beach front so if you enjoy just a very chilled holiday this is ideal for you. We went to Bodrum which is very nice but was very busy. Lots of restaurant s and an amazing harbour. We went to Turkey several years ago and enjoyed it then - and will continue to keep going back forever. We just love this wonderful country.", "title": "Holiday to remember", "user": "great21", "date": "June 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 66765669}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "we had a wonderfull holiday here hotel right on beach spotless clean staff very friendly barney and ercon where great .our favotite eating place was the lemon tree excellent food you must have a visit to the turkish baths and do the boat trip", "title": "relex enjoy", "user": "sylvia040", "date": "June 4, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 66465727}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "Just returned from our two week holiday and can honestly say all the previous reviews are true. My wife and I had very bad tummy upsets for a couple of days and Barney made us mint tea with fresh mint from the garden. Although we only went B&B we ate at the hotel 3-4 evenings and found the food to be excellent, as well as being cheaper than just about anything else on the strip. We would love to return in which case we would opt for half board. A few days into our holday the Toloman were forced to remove many of the cushions from the beach under threat of a fine from the local council. This was a pity as some of the charm was lost, although it still looks lovely. The only negative thing I can say about the Toloman is its neighbour, the Okalyptus hotel, whose barman insists on playing beat music at max volume, driving even their own residents away. Twice I asked the barmen to reduce the volume but he seems to be deaf as well as stupid!", "title": "So good you want to keep it to yourself", "user": "AndrewSouthsea", "date": "June 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 66356480}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Ahmet's boat trip (£15) is fabulous and yes, you do need to book early.", "title": "Most relaxing holiday ever", "user": "MoiraDevon", "date": "June 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 66302556}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We went on the one day trip to Ephesus which was great except for a very naff coach. Thomson's rep, Emma, was mortified and sorted the issue to our satisfaction. Emma calls her customers 'her babies' and nothing is too much trouble. If you are visiting Bitez with Thomson/First Choice, please take Emma some Cadburys Dairy Milk and English teabags.", "title": "you can not beat this hotel for a late season get away, just perfect", "helpfulness": 1, "user": "bertyNottingham", "date": "October 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 47543964}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "The Toloman was a lovely hotel. Room was homely and clean, balcony overlooked the garden which was surprisingly green. There were fig trees, olive trees even tomatoes growing. The staff were friendly and helpful. It's right on the beachfront. We went B&B, breakfast was Turkish, lots of lovely bread, cheese, tomatoes, very enjoyable. We also had toast and jam. Our highlight of the holiday was Liz and Ahmets boat trip where we did loads of snorkelling and saw many fish and even saw dolphins. Bitez itself was really relaxed, loads of restaurants, no nightclubs, if you want that sort of holiday go to Gumbet. Finding Turkish cuisine can be tricky as the restaurants serve everything but we did eat well with a bit of looking, we had excellent meals at The Lemon Tree, The Black Cat and Fishermans Place (a little further along past Lemon Tree). We got a litte fed up being pestered to into restaurants but even then everyones very good natured with it, they just want the business, we solved this by walking along the shore line and avoiding the entrances. All in all, we had a really relaxed, chilled time.", "title": "Excellent value for money, great place to chill", "user": "sallycourgette", "date": "July 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 69455418}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "I wont ramble but keep it short and sweet! Toloman hotel certainly lives up to the hype! We found the hotel very clean and much nicer then what you would expect from a 2 star. The staff are amazing, very friendly- nothing is too much trouble. The grounds and view are lovely-eating breakfast and dinner overlooking the sea what more can you ask for!!", "title": "Most Awesome, Friendly and Relaxing place ever!", "user": "liljules", "date": "June 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69259499}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "Food was excellent-lots of choice on the half board would def recommend this option. The restaurant and bar staff are fantastic and really look after you. Bitez is chilled out and just very relaxing the beach is lovely too .I would also recommend Liz and Ahmets boat trip it will be a trip you will never forget and is well the worth money. Book it via the Toloman.", "title": "Great Hotel", "user": "MichelleR85", "date": "June 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 68168365}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "So alas we are home again- was very sad to leave Bitez and the Toloman and all the amazing people we met there. Special mention to Barney, Oz and Erkan who work at the hotel who made our time there even more amazing. Hope to see you all next year were looking at dates again already!- bring on the Efes Beer!", "title": "lovely hotel", "user": "nellbern", "date": "June 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 67721554}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "Julia and Ben", "title": "Great Holiday", "user": "santissima", "date": "June 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 67620032}], "location": {"country": "Turkey", "region": "Turkish Aegean Coast", "continent": "Europe"}, "stars": 3, "variance": {"poor": 4, "average": 5, "very good": 24, "terrible": 1, "excellent": 43}, "aka": "Toloman Hotel Bitez", "slim_ranking": 0.176991150442}