{"user_rating": 3.5, "review_count": 65, "name": "Tommy Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "We were supposed to stay only 3 days at the Tommy resort, but stayed longer. Fantastic bungalows, the best of Staff. Food cheap and really good.. Nice pool..Nice beach and so close to the bungalows. Really feels like paradise. I have never been so relaxed before. We fellt like we were leaving our family behind when we had to say goodbye to the staff. They had such a great sense of humour and were so nice to us. It's a family owned resort and they are improving alot these days making the resort better and better. It's a really social resort, you will meet a lot of people here. It's not the cheapest on the beach, but the best.. Try the shakes that are fresh made and they just opened up a pool bar where you can enjoy a nice drink.", "title": "Fantastic Tommy Resort", "helpfulness": 2, "user": "MacphersonCopenhagen", "date": "August 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8535000, "likes": {"liked": "— The staff, pool, beach and the bungalows. Everything was perfect."}}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Bit of a late review, but figured I would still put in my two cents.", "title": "Good find for the price", "user": "LMcC123", "date": "October 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 46586746}, {"rating": 4.0, "stay_parameters": "Stayed September 2009", "text": "We found this place after deciding we really didn't want to stay at Palita Lodge next door.", "title": "Tommy's was the best", "user": "UsaLoveAsia", "date": "October 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 46173793}, {"rating": 1.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "The other property has good reviews, but I think they are solely based on the high end rooms (which are beautiful) and the staff. Not our experience though, since we ended up booking a bug infested lower end bungalow there.", "title": "Very good location, rubbish rooms!", "user": "El_Traveller_01", "date": "July 8, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 1.0}, "id": 34231341}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Anyway so we went looking for new accommodations and found Tommy's. The prices were similar (affordable), but the hotel rooms were much cleaner, brighter, and offered more security (in room safe). I had a great sleep in the bed there, and the air con worked well. There was a bit of an issue with the toilet, but the staff fixed it right away. The only other thing was the water pressure was a bit weak, but over all I was happier with the room compared to what we had booked next door, and the staff was always nice when we came into the lobby.", "title": "good location,better price!!!", "user": "ianbowyer007", "date": "June 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 33395155}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "(I still rated this a 3 star because it's was clean and comfortable, but nothing fancy.)", "title": "Amazing!", "user": "mjwilks", "date": "June 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31862206}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "Stayed at Tommy for one week in July 08. The staff are very kind and accomodating. There was a complimentary omlet breakfast every morning and an endless supply of towels and bottled water to the room.", "title": "Tommy is the best on the beach", "user": "kristadawg", "date": "September 9, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 19921676, "likes": {"liked": "— It was on the beach and in the middle of the action", "disliked": "— we arrived the day of the full moon party and could not get a room until the next day. You had to arrive several days in advance to the party to obtain a room. It cleared out and our room was available right after though :D"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "It is located right on the beach where the Full Moon party is. No worries though they have the whole beach cleaned within two days after the party.", "title": "Location location", "user": "Gonski", "date": "August 7, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 18702458, "likes": {"liked": "— Locality", "disliked": "— Bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "The rooms were clean and comfortable with cool air conditioning and english tv channels. They also did laundry very cheap and had internet, travel agent, and spa on sight. The pool was huge and clean right on the beach and directly in front was vollyball nets and a beachfront retsaraunt.", "title": "Great Service and Location!", "user": "kaoniko73", "date": "July 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 17631277}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We had a group of about 12 people. So the staff of the resort taxied us around on private tours. They took us to a mountain top restaraunt, snorkeling at KohMah, and to see elephants. They also helped to arrange us with a Trip to Koh Tao for more snorkeling.", "title": "amazing", "user": "CoxFamily07", "date": "May 27, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16434861}, {"rating": 5.0, "stay_parameters": "Stayed December 2007", "text": "The best part about the resort was they let us have a wedding there. They set up the ceremony on the beach, ordered the flowers, supplied audio equiptment and of course served the food. The have a hollowed out saleboat that has a mini nightclub inside of it with a huge bar and dancefloor on the top. This is where the wedding was held.", "title": "100% Fantastic!", "helpfulness": 1, "user": "elaine08Scotland", "date": "March 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14222646, "likes": {"liked": "— the people", "disliked": "— me falling ill"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The haad rin beach is absolutely great for swiming. Regarding the Tommy beach-bungalow I must say following: the bathroom/toilet was very dirty and the air-condition did not work all the time. The staff of Tommy's Resort is very unfriendly and not helpful at all. All they want is your money and they do not care if you like it or not. This poor attitude from the staff takes away some of the fun of staying at Tommy's unfortunately. That is my opinion.", "title": "Great location - poor customer service", "user": "MrJ09", "date": "April 21, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 28469899}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We came to Hadrin a few days before the full moon party and I'm so happy because it was so much fun. The location is perfect and the evenings in the beach before the party were great. the service is 100%, they were so helpful with everything from cloth we lost to travel and general info. We stayed at the rooms in the second Flore to save money and it was very good and clean room, just near the swimming pool (that was a very nice one) and I could see the beach from the balcony. The breakfast was average but the food in the restaurant was fine. I would defiantly come beck (next time with my kids..)", "title": "wonderful hotel, I didn't want to leave..", "user": "EfFerri", "date": "April 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27852859}, {"rating": 2.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Just back from a month in Thailand and spent five days at Tommys Resort. We paid 350 euros for a 'superior' bungalow with TV and air con. I agree with the other reviewers on it being a great location for Full Moon and I also agree that the staff were really friendly however thats were it ends. The bungalow smelled musty. We had cockroaches and we also had a mouse. The pool looks lovely but after seeing a guy gather all his flem in his mouth and spit it in the pool I decided not to go in. TV didn't work for most of our stay and we ended up checking out a day early and moving on to Koh Tao. If you're 18 years old and don't mind the odd coackroach then this is the place for you but personally I thought it was a kip. This was my second time in Koh Phangan and if I ever go back I would definitely stay on the sunset side of Hadrin. Its only about a 10 minute walk away and is so much nicer.", "title": "don't believe everything you read", "helpfulness": 1, "user": "shudson", "date": "January 23, 2009", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 23827837, "likes": {"liked": "— That we had a toilet for full moon party", "disliked": "— it was a kip"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "This was my first time staying in Koh Phangan and I loved every minute of it.", "title": "Best Resort in Koh Phangan", "user": "pokemyhonts", "date": "September 25, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20373840, "likes": {"liked": "— Location", "disliked": "— travel time..but it was worth it"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "A large group of us arrived to the resort the day after Full Moon party . The staff was very accomidating and helped in any way possible. They Arranged private tours and helped with bookings for snorking. I would recomend this resort for anyone headed to Had Rin.", "title": "The best accommodation on Haad Rin Nok", "user": "craigieboy123", "date": "September 17, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 20134635, "likes": {"liked": "— Location", "disliked": "— Price (but as they say, you get what you pay for)"}}], "location": {"country": "Thailand", "continent": "Asia"}, "variance": {"poor": 9, "average": 4, "very good": 21, "terrible": 7, "excellent": 24}, "aka": "Tommy Hotel Koh Phangan", "slim_ranking": 0.483516483516}