{"user_rating": 4.0, "review_count": 87, "name": "Torre di Renda", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "We were hot and tired by the time we arrived at Torre di Renda. Ready for a bath and a bite to eat and a good bed. We got it all. In excellent fashion. I wish it hadn't been dark by the time we arrived. There was a beautiful pool, if one had any energy left - a beautiful tree lined path to follow, and a dog that would play until someone dropped. AND the view. Beautiful. It was the perfect end to a day filled with the wonder of mosaics.", "title": "Cool, High, Heaven on a Hill", "user": "JJtheScrivener", "date": "November 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 185016790}, {"rating": 3.0, "title": "Stairway to the stars?", "text": "A steep walk from the parking area and then carrying luggage up three flights of stairs may have taken the shine off this stop on a recent tour. Room was mediocre with no view that others talk about. Meals and Breakfast average. Staff very remote and not approachable. Not worth the effort. I have been to other remote agriturismos that offer more warmth and accessibility.", "user": "Michael C", "date": "October 18, 2013", "id": 181485536}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Stayed for just one night at this lovely agriturismo perched on a hill. Awesome views, delicious dinner, nice breakfast. Quiet and charming place out in the country with a big terrace overlooking the valley. Much cooler climate than down in the valleys, so a light jacket or sweater was needed in the evening.", "title": "Delightful!", "user": "islandreams", "date": "October 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 181292047}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "Stayed here with a large group on a recent Rick Steve's tour. The staff were very accommodating, including hauling our luggage up and down the steep hills to the bus. The views from the extensive terrace and from our room were amazing, and the group dinner we had there was great. It's a shame we were only here for one night, but we packed a lot of enjoyment into that night.", "title": "Fantastic Views, Great Food", "user": "MrVTX", "date": "October 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180113817}, {"rating": 4.0, "title": "Great views!", "text": "We stayed at Torre di Renda for 1 night September 2013 and we were pleasantly surprised. It took a while to reach the hotel from Piazza Armerina along narrow twisty roads but the views across the countryside and Piazza Armerina when we reached the hotel at about 8.30pm were fantastic. We had an evening meal which was delicious and the house wine was really god. The breakfast the next morning was served outside on the patio area. It was delicious with cheese, ham, bread, croissants and a bowl of fresh fruit. We did not stay long enough to explore the grounds or try out the swimming pool but we could happily have stayed there for longer. They have 4 dogs - one of them a very friendly black Labrador.", "user": "134karen", "date": "October 4, 2013", "id": 179752817}], "location": {"country": "Italy", "continent": "Europe"}, "variance": {"poor": 4, "average": 10, "very good": 30, "terrible": 4, "excellent": 39}, "aka": "Torre Di Renda Piazza Armerina, Sicily, Italy", "slim_ranking": 0.363636363636, "description": "Torre di Rendait is an ancient villa of the XVI century become subsequently, in the XVIII century resides Episcopalian, today restructured by the actual owners the Cavaliere Phillip Golino and her brother Ignazio.Torre di Renda she offers you the heat and the hospitality that only a management family can offer.Surrounded by 130.000mq of wood I give it is possible to sight foxes and rabbits. It rises on a hill dominating through a splendid and suggestive panorama on overall the city of Piazza Armerina."}