{"user_rating": 4.0, "review_count": 85, "name": "Tower House", "reviews": [{"rating": 4.0, "title": "Great Location B & B", "text": "You won't find better located accommodation in Oxford - right in the middle of the city close to the Bodleian Library yet in a reasonably quiet location. The building is old and attractive and is well furnished in keeping with the style of the property. I found my room to be very comforatable. However, it is important to bear in mind that this is a limited service establishment - no room service, no lounge or bar for guests and continental breakfasts are the only meal provided. As there are countless places to eat and drink close by the limitations were no problem. Like some other reviewers, I thought the electric shower was poor. However, unlike one reviewer I found the place to be spotlessly clean. Quality accommodation is in short supply in central Oxford so nowhere is cheap but I would say this provides a relatively good value and friendly option.", "user": "Blackstone", "date": "February 1, 2011", "id": 95173987}, {"rating": 2.0, "title": "Over Priced and Hotel needs to be taken from the title its a B+B!!", "text": "The room itself was nice, the shower was poor it was a trickle at best, when you pay £120 pounds a night you would expect better value for money it isnt but on the plus side it was in a good location", "user": "YOGIMACK", "date": "January 24, 2011", "id": 94258625}, {"rating": 3.0, "title": "helpful and central but not very clean", "text": "This is a bed and breakfast. Welcoming, friendly and reliable. The bedrooms are furnisehd in something approaching period style as the building is 17th century. Quiet despite its very central location. The one minus point is the hygiene. Sheets stained. Bathroom grubby. The shower did not work.", "user": "irene099", "date": "August 28, 2010", "id": 77191484}, {"rating": 5.0, "title": "Pleasant Guesthouse with Splendid Service", "text": "I arrived early and the hostess was most helpful in allowing me to keep my luggage in the office while the room was being cleaned. The hostess also loaned me an alarm clock for an early departure the next morning. Due to my early departure I missed the breakfast, but there was tea and biscuits in my room. I stayed one flight of stairs up in the Jade Room with private bathroom. The room was a nice size, clean with a comfortable bed. The Tower Hotel is in the center of town, the plus side is I could walk to everything, the downside is the noise at night, but I was so tired I didn't mind. When I come back next year, I'll try the breakfast.", "user": "2smiles", "date": "July 18, 2010", "id": 71407604}, {"rating": 5.0, "title": "very old, very comfortable and very central.", "text": "Thank you for your warm hospitality.", "user": "kez93", "date": "July 6, 2010", "id": 69973311}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We used this hotel for a one night stay as we had tickets for a gig at the O2 Academy (Ben Taylor) in Cowley Road a good 20mins away, but its not a bad walk over the river, past the punts with plenty of restaurants between the hotel and the gig venue.", "title": "Tiny 17th Century Guesthouse in a perfect location.", "helpfulness": 1, "user": "Sally065", "date": "October 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 45872632}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The Tower House is tiny and hidden away in Ship Street, right in the centre of Oxford – a brilliant location for visiting all the local attractions. However, if you come by car (which we did) you have to unload on double yellow lines keeping a watchful eye out for the vigilant traffic wardens! Parking in Broad Street around the corner is free after 6pm but charges start again at 8am so you have to be up early to get your 1 hour ticket on before the traffic warden gets you –and they will! The proprietor suggested a street 5 mins walk away that gives you 3 hours for £3 from 8am (Mansfield Road) Best idea is to use Park & Rides (surveyed overnight I believe) where parking is free and its just £2 return on the bus.", "title": "Ok, but...", "helpfulness": 1, "user": "Antoñito", "date": "August 7, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 37011599}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "For a Central Oxford Hotel the £110 was reasonable and our room, the ‘Yellow Room’ was small, old fashioned, slopey & creaky in a characterful way. The bed was comfortable and there was ample hot water. No views of the ‘dreaming spires’ but interesting roofs, nooks & crannies nevertheless. The only downside was that the excellent television had been placed right in front of the wall mirror which made hair drying awkward. (It would only have taken an hour or so to move the mirror 2 feet to the right and slap a coat of paint on the wall to cover the mark it would leave behind and it would have made such a difference!)", "title": "Unbeatable", "helpfulness": 2, "user": "Suborno", "date": "May 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29358793}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "The breakfast was continental - but there was plenty of it. Hot toast of your choice, warm croissants, Danish pastries, fruit, yogurts, cheese, ham etc. The proprietor was friendly and helpful (particularly with parking and left luggage next day)", "title": "Brilliantly located and welcoming", "helpfulness": 1, "user": "PhilosopherLondon", "date": "April 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 28756658}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled solo", "text": "Overall The Tower House is a great little hotel/guesthouse full of old world character, would definitely stay there there again.", "title": "Lovely Stay", "helpfulness": 2, "user": "hushed_presence", "date": "April 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 27609424}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled solo", "text": "I travelled to Oxford by train and needed a place to stay that was central, comfortable and reasonably priced. Tower House Hotel fitted the bill beautifully. Over 3 nights I stayed in two rooms due to my late booking: both reasonably small but quaint, clean and comfortable. One came with an ensuite and the other required sharing a bathroom. Both arrangements were fine. Breakfast was a generous continental style. The hosts were exceptionally helpful, including offering to wash and dry several items of clothes for me at no charge! Wi fi access in the bedrooms was good. Tower House made a great visit to Oxford just perfect.", "title": "Charming B&B/hotel in great location", "user": "Vicki S", "date": "July 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69952029}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "This was the third and last night of our trip to England for a friend's wedding. After the prison cell like EasyHotel in Luton and the relative luxury of the Corinium hotel in Cirencester then the Tower House was a different experience, and a good one.", "title": "Charming, comfortable and superb location", "helpfulness": 1, "user": "WillRos", "date": "February 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 56146571}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled solo", "text": "We arrived way earlier than we had told them, so had to wait for 6 minutes for Jonathon to come back from buying his new steam iron, which he proudly unboxed and demonstrated for us. It was fun.", "title": "magical, tucked away, restful and full of character", "helpfulness": 3, "user": "gracec10", "date": "January 7, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 52836882}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "As other reviewers have noted, it's hard to say whether you would call this a hotel or a B&B, but whatever it is classified as we had a great time there and found the service to be excellent. Jonathon stayed up late to fix his PC so that he could print out a route map which we had misplaced, so kudos to him.", "title": "Charming guesthouse matching Oxford's medieval appeal", "helpfulness": 2, "user": "Paul_Harding", "date": "December 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 51204916}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "He also solved the problem of the strange noise in our room which turned out to be my nasal hair trimmer in my rucksack which had somehow managed to switch itself on. The usual jokes about vibrators ensued, but all in good taste.", "title": "The only place I will stay in Oxford", "helpfulness": 2, "user": "JudeZip", "date": "November 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48342023}, {"rating": 2.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We stayed for 3 nights in the Jade room. This \"hotel\" has no reception, no foyer in fact no facilities whatsoever. You ring a door bell and arrive into a very narrow hallway. Yes, I agree with other reviewers that the property is old and quirky but it is also very shabby in parts. The stair carpet needs replacing, plaster is peeling from walls and the ensuite certainly needs a revamp. We had the smallest shower possible and while the new floor tiles were good quality the rest of the tiling needs a serious overhall.", "title": "Certainly not a hotel, a poor value bed and breakfast", "user": "pgb2", "date": "February 20, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 3.0}, "id": 24864082}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled solo", "text": "I am annoyed that we were charged hotel prices for what is a basic B&B in an old property.", "title": "Wonderful place, excellent location", "helpfulness": 2, "user": "ricer3dad", "date": "November 24, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22144269, "likes": {"liked": "— Location (it was very close to everything I wanted to do in Oxford).", "disliked": "— ? (I can't think of anything...)"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The location was central but on each night we stayed there we were awoken by groups of students heading home from the pubs. Tuesday night in particvular was very noisy and anti social.", "title": "A piece of Oxford history", "helpfulness": 2, "user": "RachelAllen", "date": "November 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 4.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 22008337, "likes": {"liked": "— the character", "disliked": "— nothing"}}], "location": {}, "stars": 3, "variance": {"poor": 5, "average": 11, "very good": 37, "terrible": 4, "excellent": 28}, "aka": "Tower House Hotel", "slim_ranking": 0.337662337662, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "description": "The Tower House Hotel is a Seventeenth Century Guest House, situated on a quiet street in the heart of Oxford city center. Oxford is a delightful city, famous for its dreaming spires, ancient University colleges and beautiful architecture. The hotel is two minutes walk from all the major tourist attractions. The Hotel has seven unique rooms, each one is individually designed and furnished with period antiques. The hotel is steeped in history, the bastion of the medieval city walls form part of the dining room and the front of the hotel overlooks Jesus College."}