{"user_rating": 3.5, "review_count": 1713, "name": "Town and Country Resort Hotel", "reviews": [{"rating": 1.0, "title": "Very unhappy", "text": "This hotel is old and the decor out of style, but even worse the rooms are in very poor condition. The wallpaper is falling off, the capet dirty, stained, and worn. The plumbing is very bad condition. This should be a $39 hotel, not a $119 hotel. I travel a lot for business and the Town & Country goes down as the absolute worst dump I've stayed in.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "November 9, 2004", "id": 2814346}, {"rating": 4.0, "title": "We were pleased....", "text": "We went to the Town and Country on a work related trip. We stayed in \"the bungalows\" which by all accounts are superior to the towers. As long as you realize that they are not \"bungalows\" you will be fine. They must just be a newer wing of the hotel. I would gladly go back to stay in the bungalow rooms. The most important thing would be to make sure to ask for a downstairs room. The downstairs rooms have a small clean courtyard with tables. It would have been nice to sit out there to sip coffee or read. The upstairs were we stayed was like any other hotel room. The room was clean, well maintained and nicely furnished. Our room cost included a daily breakfast buffet which was really great. The trolly is located at the rear of the property. The trolly can go north as far as the San Diego Misson and south to the TJ border/Mexico. There were at least 2 grand malls, Gaslamp district, Seaport village and Old Town San Diego accessible by this inexpensive trolly. We took a cab to have ocean view dining at Pacific Beach. The round trip cab ride was $30.", "helpfulness": 1, "user": "travelwhere", "date": "November 1, 2004", "id": 2798982}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "this is a big hotel of a different era (as noted by other reviewers)....while dated the place is clean but it's unfortunate little details seem to be a problem for much of the staff.", "title": "interesting hotel", "user": "Northern_GA_Guy", "date": "March 25, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 126625394}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Check-In", "title": "Nice Resort Hotel for a Small Conference", "user": "Fishperson", "date": "March 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 126587836}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "All of my charges were being taken care of by someone else however they asked for a credit card at checkin - when I stated all of my charges were being paid for by someone else the desk clerk acknowledged that was correct (not sure why they'd need my credit card then)", "title": "Great stay in Hotel Circle", "user": "Tara C", "date": "March 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 126516132}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Guest Room", "title": "best place in San Diego", "user": "Carino O", "date": "March 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126295904}, {"rating": 1.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I'll just say the decor is interesting", "title": "Not Impressed", "helpfulness": 2, "user": "floatingsoul", "date": "March 18, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 126294641}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "This resort caters to conferences and conventions. It also tries to position itself as a place that is convenient for families. The old tagline is to pick one thing and do it well... T&C should heed that advice. After reading other TripAdvisor postings, I can see how there are so many different feelings about the same property.", "title": "A more comprehensive review here... If all you need is a bed, take a look.", "helpfulness": 8, "user": "YetAnotherTraveler", "date": "October 21, 2006", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 5981519, "likes": {"liked": "— I always wondered what hotels were like in the 70's - now I know!", "disliked": "— Musty Smelling Room"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "I've broken my review into a few sections to help you consider the property:", "title": "Run for the hills! This place is horrible!", "helpfulness": 6, "user": "vacationhereIcome", "date": "October 13, 2006", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 5948457, "likes": {"liked": "— Leaving", "disliked": "— The rooms"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled on business", "text": "Check-in", "title": "Just Fine", "helpfulness": 6, "user": "John D.M.", "date": "August 29, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 5723603, "likes": {"liked": "— View from large balcony"}}, {"rating": 4.0, "title": "Worked out just fine for us...a nice suprise", "text": "Check-in is hit or miss. I sailed right through with an early arrival (10:30am) and they were very helpful. A colleague arrived at 11:30am and had to wait four almost 5 hours... they kept saying a room would be ready on the hour... only to keep repeating that every hour until 4pm.", "helpfulness": 3, "user": "newyorker88", "date": "August 27, 2006", "id": 5713357}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Bumped?", "title": "no, no run away...", "helpfulness": 3, "user": "ricky1", "date": "August 20, 2006", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 1.0}, "id": 5627595, "likes": {"liked": "— nothing", "disliked": "— no concept on customer service"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "After reading some of the reviews here, I was a little nervous about what my stay at Town and Country might be like ... it was wonderful! From the gorgeous setting to a pleasant, clean room, to a very attentive staff ... my five days couldn't have been better. I was in a second floor garden room -- very nice accomodations. Had dinner a Kelly's Steakhouse one night -- delicious ribeye. Breakfast on the patio at Trellises was delightful. And evenings at Charlie's were a lot of fun, primarily thanks to the great staff. Speaking of staff ... a special shout-out to Cory at the front desk and Jake at the concierge station ... very professional, very friendly, very helpful! The meeting facilities were excellent (a little too much A/C some of the time, but you can always put on a long-sleeved shirt or sweater!), and staff members were very good about giving directions (or actually accompanying you) to the widespread meeting spaces. All in all, I was very happy with Town and Country ... I stayed two extra night on my own ... and I would return in a heartbeat!", "title": "Great conference experience ...", "helpfulness": 2, "user": "StuEmc2", "date": "July 17, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 5476292}, {"rating": 3.0, "stay_parameters": "Stayed June 2006", "text": "We stayed in the Royal Palm Tower for 7 nights. I chose a room in the Royal Palm Tower because most of the negative reviews on Trip Advisor seemed to be about rooms in other parts of the hotel. We stayed at this hotel several years ago so I was prepared this time for the dark, dated rooms. (The walls & carpets are a fairly dark shade of blue.) I'm not sure if the bathroom had been updated but it was bright & cheery. There was a sink in the actual bathroom area & an additional vanity/sink right outside the bathroom - it was handy having 2 sinks. Our room was large & our air conditioning worked fine . All the rooms in the Royal Palm Towers have balconies - most look out at the resort but a few just look at concrete walls. We were on the 2nd floor & enjoyed our balcony a lot because it was shaded by the ground level trees. Parking is definitely a problem but because we never got back in the late evening, we could always find a decent parking space. We ate breakfast & a couple of dinners in the attractive Terrace Cafe - food is ok. The nearby mall (walking distance) has a food court and several popular chain restaurants: California Pizza Kitchen, P.F. Chang's, The Cheesecake Factory & Uno Chicago Grill. It is very convenient to take the Trolley to downtown - we took it to Petco Park. As other reviewers have mentioned, the grounds are very attractive with lots of beautiful plants.", "title": "Enjoyed our balcony", "helpfulness": 1, "user": "TZK", "date": "July 7, 2006", "detail_rating": {"cleanliness": 3.0, "rooms": 3.0, "value": 3.0}, "id": 5438017}, {"rating": 1.0, "title": "The Worst Hotel Ever..Buyer Beware!!!", "text": "My family and I made reservations for a two queen bed room. I called the day of check in to let them know that we would be arriving after midnight and I was told that was just fine. We get there and a big group of people attending a conference was checking in. My husband stood in line behind a couple that apparently did not have a room. The front clerk said he would give them someone else's room that had not checked in. He gave them a two queen bed room. Then my husband goes to check in and they have no rooms. I had to argue with them for over 30 minutes and wouldn't you know it...they found us a room. However, the front clerk referred to the people who had reserved that room as \"poor bastards.\" Very Distasteful. This is how they see their customers. They told me that even though I held the conformation in my hand for a two queen bed room (I had already paid as well) they could not guarantee me a room or the specified accomodations. It is a first come first serve faciltiy. And I could not get reimbursed for the money I paid should I be put in a cheaper room. The front clerks did not know how to run the computer and they were very rude. They almost put us in a room that was already occupied!!!! I could not believe it. TOP THAT OFF with $12.00 a day parking fees that is not posted anywhere. We stayed three nights and paid $390.00 for the room and parking. There was no microwave or refrigerator. Parking was awful and overcrowded. All the employees were rude and seemed to HATE their job and the people who chose to stay there. I would never recommend this place to anyone. As the front clerk told me, \"We get our business mostly from conventions and that is who we cater too. So we can never guarantee a reservation because someone may need the room before you.\" There are so many other BETTER hotels right next to this hotel. THIS PLACE SUCKS!!!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 3, 2006", "id": 5419502}, {"rating": 3.0, "stay_parameters": "Stayed June 2006", "text": "Roses are the theme at this resort. Roses that are beautiful, multi-colored and \"Humongous\". My wife and I live in Ewa Beach and just returned from a four night stay at the Town and Country during the month of June. I've read many reviews about this hotel, many good, many bad, which made us a little skeptical. However, we thought,", "title": "A Hotel with Charm", "helpfulness": 4, "user": "Ewa Beach", "date": "June 26, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 5392456}, {"rating": 2.0, "title": "find a better value", "text": "(1) the Town and Country had an excellent location to the areas we wanted to see,", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 13, 2006", "id": 5338772}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "The service at Town and Country Resort was really great!", "title": "Excellent Service and Beautiful grounds", "user": "Veronica M", "date": "March 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 126789664}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "I was there for a meeting and the staff was very attentive to our needs.", "title": "Great Family Vacation", "user": "Patricia S", "date": "March 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126788618}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "And the beautiful grounds were a definite plus!", "title": "some good some not so good notes", "user": "Jennifer C", "date": "March 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 126779532}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "I would definitely return and have another meeting there.", "title": "interesting reviews", "user": "kandy746", "date": "March 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 126777666}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Great Customer Service, very clean, very friendly, great location, I stayed in a suite, walking distance from the mall.", "title": "The Good, The Bad, The Ugly", "helpfulness": 1, "user": "SiouxBarrett", "date": "March 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 126657442}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "My 13 yr old son & I vacationed here from Ohio, and felt right at home as soon as we walked in the lobby. The staff was very friendly and accomodating. The rooms were clean & the grounds were very well groomed. The location is just a couple miles from SeaWorld which was very convenient. We will be back to SD in the fall & are looking forward to staying at the Town & Country again!", "title": "Great time", "user": "Matt S", "date": "March 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126978667}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "The rooms are old and the hotel is very big! but everything works well..", "title": "Old, expensive but good for a congress", "user": "cloyola", "date": "March 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 126938935}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Director of Sales & Marketing Katherine McCarthy worked a minor miracle to accomodate our last-minute decision to stay at the Town & Country for the IPC-APEX tradeshow. Rooms were clean and well-appointed, and we were greeted with wonderful gifts baskets. Hotel staff most delightful!", "title": "Great stay at Town & Country Resort Hotel", "user": "Roger U", "date": "March 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126917534}, {"rating": 1.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Our stay at Town and Country was a very pleasant experience. We have already booked rooms for 2 future events.", "title": "A sad start", "helpfulness": 1, "user": "Pad B", "date": "March 28, 2012", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 126815848}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "RNU", "title": "Great birthday", "user": "moncinna", "date": "March 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126812593}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Think of a colllege campus on steroids -- there are multiple hotel towers and separate wings. All room access is exterior corridor style. LOTS of walking, with two major conference center buildings and numerous meeting buildings. I never did find the Spa or bar. Rooms are very clean and real maintained, but design tends to be more formal...many of our attendees referred to expecting to see the Rat Pack. However, the gardens are fabulous and the staff is superb. Wait staff supported formal dinner functions flawlessly, and no matter where you went, someone was offering to be of assistance. AV support was excellent, lighting was good, and support of a large food show was very good. One hint: Sinks in bathrooms are REALLY low; I'm only 5'2\" and had to bend to brush my teeth, so if you're tall, expect to do a LOT of bending over! :-) Plenty of hot water however. The pillows are awful - think ancient and hard!", "title": "This is a conference center...not a typical resort.", "helpfulness": 1, "user": "EJPVA", "date": "April 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127218168}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "This hotel is obviously an outdated resort, but the rooms and grounds were still very clean and well kept, just looked like the rooms were out of the 80s. I would rather have that than a dirty room. The hotel staff was nice. My only complaint is that this hotel has a terrible parking situation. It shares parking with the convention center, so be prepared to drive around looking for a spot when there is an event. It was also a very confusing layout. These are my reasons it got a 4 star rather than a 5. Parking should be free if you are a hotel guest.", "title": "Outdated, but very clean", "user": "IRoseA", "date": "April 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 127165146}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "I stayed here during a conference and was excited about staying at a place that was going to be so nice. The webpage does not look like its webpage at all. The rooms are old and the hotel grounds are very large and confusing. The 1950's never left this hotel, the 1950's floral and gold chandeliers are in need of a great deal of upgrading. There are tents in the back parking lot that hold the \"old broken\" furniture and mattresses that the hotel owners will not let the hotel get rid of. It is like having a garbage dump right in your face during your time at the hotel. The staff is great though and attempted to make up for the shabby hotel. They offered discounted attraction tickets and even drove us to the store for free.", "title": "average hotel", "helpfulness": 1, "user": "WendyAlaxParker", "date": "April 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 127146445}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "e stayed at the Town and Country for three days, and the room was adequate. It was clean and the beds were made regularly, but there was little or no hot water in the bathroom sink. Plenty in the shower, but washing up was cold.", "title": "At the hotel for a symposium - okay, but could have been much better.", "user": "Susan T", "date": "April 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 127105972}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "We ate at the cafe three three times out of necessity, but ate elsewhere after that. The cafe was loud, understaffed, and overpriced, but the manager Anna was all over herself willing to try to make up for the terrible food and service we received. Unfortunately, we were too burned to return and try again. The deli served Starbucks coffee and was open until 10PM each night. Good.", "title": "Town & Country - A great place to stay in San Diego for work or fun!", "user": "AnnieVanPelt", "date": "March 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126980743}, {"rating": 3.0, "stay_parameters": "Stayed March 2005", "text": "Stayed here not out of choice. After reading reviews on here and seeing website, opted for Garden rooms since they were the cheapest and possibling were going to be the nicest.", "title": "Good and bad", "helpfulness": 6, "user": "LVSaint", "date": "March 27, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 3.0}, "id": 3305152}, {"rating": 2.0, "title": "Bad business travel choice", "text": "Rather pleasantly suprised when we saw our room (close to check in, just down path, side of lobby). Seemed to be recently decorated, not at all shabby, clean and generally nice (although colonial decor a bit OTT and unneccessary). Looked out onto garden and pool and close enough to where we parked car.", "helpfulness": 9, "user": "Garrideb", "date": "February 9, 2005", "id": 3174368}, {"rating": 2.0, "title": "Not one of my favorites.", "text": "Bed seemed to be new, very firm (maybe too firm)", "helpfulness": 3, "user": "A TripAdvisor user", "date": "January 17, 2005", "id": 3012750}, {"rating": 2.0, "title": "Dirty, run down and overpriced", "text": "Some of the bad...", "helpfulness": 3, "user": "A TripAdvisor user", "date": "December 3, 2004", "id": 2862166}, {"rating": 5.0, "stay_parameters": "Stayed October 2004, traveled on business", "text": "There is no guarantee that if you order a king online you'll get it (I booked via their website where you'll get a cheaper room than calling them directly). It's first come first serve.", "title": "Very Pleasantly Surprized", "helpfulness": 6, "user": "Jennifer L", "date": "November 23, 2004", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 2842079}, {"rating": 2.0, "title": "Nice in the 80s but pass now", "text": "Your first look at this hotel will be a worn lobby that has been out of style for quite a while. The furniture is worn and the walls have scratches. I must say that they do have nice pools if you like to swim but the rooms need to be redone. If you like to swim this is the place but if not pass and look for something that is newer and it better shape.", "helpfulness": 3, "user": "timsilver", "date": "August 12, 2006", "id": 5604201}, {"rating": 1.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "After staying in SD several times over the years at nice hotels, a friend convinced me to try this place. Going to SD for a convention and work, I booked their nicest room on the web site three weeks ahead, and confirmed it a week before on the phone.", "title": "Stay Away!", "helpfulness": 7, "user": "XRD", "date": "August 9, 2006", "detail_rating": {"front_desk": 1.0, "value": 1.0, "location": 1.0, "service": 1.0}, "id": 5581724, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "My work has me traveling the world 100-200 days a year. After a long day’s work, and making it through the extra traffic to get there, I find they've sold my room out from under me. Explanation was \"First come, first served.\" After doing a Seinfeld reservation routine with someone who had canned answers, I figured they really didn't care. As I made other reservations in the parking lot I heard there were a thousand rooms there. I guess quantity makes up for quality? Last time I go through the grist mill on hotel circle. Stay away.", "title": "great location and vacation", "helpfulness": 2, "user": "laxplayer123", "date": "August 7, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 3.0}, "id": 5573512, "likes": {"liked": "— the pools for the kids", "disliked": "— next to the highway... and the trolly station in back"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "My family stayed at this resort for 2 nights, 3 days. When we first arrived we cringed up because it was right near the highway. One member of the family thought that it was just a small motel but she was definitly wrong. It is a huge complex with many restuarants and 4 pools which are great. When we really got into the resort part it was amazing you couldnt even see the highway or hear it. It was like a little secluded place. The food was ok...not the greatest but a not horrible. There is a great spa which is very elegant inside. All the staff were very efficient. And worked in a fast manner to measure up to our needs. The grounds are beautiful with palms, bird houses and gorgeous gardens and gazebos. The only real turn off to me is that the trolley is right behind the hotel and just random people can get off the trolley and walk right into the hotel and use all their facielities. I thought there should be guards and key cards for you to get into the pools and buildings. Our san diego experience was very good....although it may be a little to much of a convension center it still made our vacation meet our expectations", "title": "Pleasantly Surprised", "helpfulness": 5, "user": "UFTAMU", "date": "July 24, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 5503949, "likes": {"liked": "— Location", "disliked": "— Cost of on-site parking"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "We were vey skeptical of this hotel due to the number of negative comments but had no other choices since all other hotels under $200.00/niight were sold out for our weekend travel date. If you prefer the modern, sterile hotels, this place is not for you. The property is a \"throw-back\" to the family resorts of the 1960's and '70's with tremendous class and character.", "title": "Most horrific experience- think twice before booking!", "helpfulness": 3, "user": "Reviewer12345", "date": "July 23, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 5501274, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 4.0, "title": "The Town & Country is consistently good", "text": "I have stayed at the T&C many times and I won't stay anywhere else in San Diego. I have always found the staff to be friendly and helpful, and you will not find a more beautifully landscaped hotel in San Diego. It is a great place to just relax. I can sit by one of the pools for hours and just enjoy the scenery. My friends and I were in town for two nights to watch some baseball at Petco Park. We had wonderful garden rooms, and spent Friday evening enjoying the live entertainment at Trellises. It is a bit of an older crowd, but who cares. Some people complain about the price, but some of the lesser hotels around the Hotel Circle area are just as expensive. Also, if you think the T&C is expensive, try one of the hotels downtown or near Seaport Village.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "May 22, 2006", "id": 5188909}, {"rating": 3.0, "title": "Nice Hotel/Resort", "text": "The T&C also has the most convenient location on Hotel Circle, as the trolly station is directly across the street. You can park your car at the hotel and take the trolly most anywhere you want to go. (Petco Park, The Convention Center, Old Town, Seaport Village, The Mexican Border)", "helpfulness": 7, "user": "A TripAdvisor user", "date": "April 1, 2006", "id": 4826560}, {"rating": 2.0, "title": "Town & Country Is Overpriced.", "text": "The Town and Country has charm and character, and I recommend it", "helpfulness": 5, "user": "A TripAdvisor user", "date": "March 23, 2006", "id": 4726808}, {"rating": 1.0, "title": "Don't stay here", "text": "We have just returned from a few days at the Town & Country Resort in San Diego,CA. It is rather nice. The service of the front desk is wonderful and efficient. Instantly the property is pretty big in parameters. The decor at the front desk needs updating. They have security which is nice for parking etc. Parking is very limited though. They have construction and renovations that are taking up the parking spaces so that was a hassle. Great for the renovations not so great for parking! Our room was nice and spacious but the decor again has got to be updated carpet and all - whew! Not sure what design theme was colonial ? something don't know? Felt like we stepped back into the 60-70s. The bathroom shutter door (which limits privacy) stuck to the floor. The bathroom is very spacious. The wallpaper has to go. There was mold and water buildup around the showers and the sink was multiple cracked. They had a really nice linen closet for extra linen/towels etc. The bed was wonderful great pillows. Sleeping was good! They have multiple pools on the property which ducks enjoy too! Our room was centrally located to restaurant/cafes and near the convention center. Not good when it rained though. The restaurant was really good. Breakfast was excellent! Service was excellent! Dinner/late night eating had unlimited options for late dining but very limited service and wasn't sure we'd get our food but once we did it was good. We ate only at the Terrace Cafe. They have multiple levels of eateries sitdown table cloth, family cafe, deli to go. Which was really nice. Had room service one morning only - it was horrible. Everything was cold! Overall this is a average good hotel/resort it was very, very convenient for shopping there is a mall maybe 5 mins away. Grocery store 5-7 mins away including post office and other conveniences. Restaurants very close 5 mins (Cheesecake factory, Joe's Crab shack, a bunch others worth perusing) Its location is very central to all your needs. We can recommend this property for accommodations but they really need to look at updating their location. Check them out! This is great for couples and families with kids!", "helpfulness": 8, "user": "carribeanfreak", "date": "March 15, 2006", "id": 4625938}, {"rating": 4.0, "title": "Nice Hotel", "text": "Town & Country is overpriced for what you get. We could have stayed at a budget hotel and got the same type room (or maybe more updated).", "helpfulness": 6, "user": "A TripAdvisor user", "date": "February 27, 2006", "id": 4559338}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 180, "average": 269, "very good": 444, "terrible": 192, "excellent": 628}, "aka": "Town And Country Hotel San Diego", "slim_ranking": 0.440740740741, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.0}, "description": "Located in beautiful Mission Valley, the heart of San Diego. Convenient, central location provides easy access to all of the city's sites, businesses & attractions. 6 miles from Lindbergh Field and ten minutes from Old Town, Zoo, Balboa Park, SeaWorld, beautiful bays & beaches. On property you will find tranquil grounds adorned with picturesque gardens & scenic walkways in addition to a full service spa, fitness center, 3 pools,large sunning deck and whirpool,4 restaurants & trolley stop. Shopping & golf adjacent."}