{"user_rating": 3.0, "review_count": 41, "name": "TownePlace Suites Boston Tewksbury/Andover", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "So far so good. The place is not perfect, but the staff is very willing to accommodate my reasonable concerns. I knew about and picked the place because of the monthly lower cost for my short term job. The free internet is good for emails, slow for heavy graphics web page and downloads. I especially like the healthy nutritious breakfast. For the last 4 months, that's what I have had every morning and looks like it is going to be for a while. I hope submitting this does't jinx my continue stay. Services matches up cost.", "title": "I have stayed there since the end of November 2009", "user": "lingling2000", "date": "March 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 59186220}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "I stayed in this hotel on 3 different nights throughout the month. On all three occasions the rooms were very clean and looked recently updated to some extent. The staff seemed to try to be helpful when asked. I was placed in a wheelchair accessible room and after I left the office the manager came out and informed me she had found another room for me. The gesture was very nice. The breakfast was not much, just muffins, nutri grain bars, coffee, and apples. The location is nice, right by the freeway, but not close enough that any noise is heard. The bed was comfortable. The one thing that I did not like is that the TV was very small. It looked out of place in the room and was hard to even see. I don't think they upgraded the TV's when they upgraded the rest of the room. Overall a nice clean stay considering we were in Tewksbury. (You have to remember this is a tier 1 Marriott hotel so it is nice for a tier 1)", "title": "Not bad", "helpfulness": 1, "user": "freq_wrld_travel", "date": "August 6, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 36924496}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Our first experience with a Townplace Suite was not overwhelmingly positive. In concept, these appear to be stripped down Residence Inns. We were greeted by a brusque, rather aggravating desk attendant. There was a problem with our reservation--a form had not arrived via fax for our stay--and the attendant was simply not helpful or understanding about the situation. After assuring her that everything would be squared away, we were given the room key. The room we were assigned was nice. It seemed clean and the bed was comfortable. The room, however, had a very strong, somewhat rank odor. We opened every drawer, every door, looked under the bed to see if there was anything dead in the room. Finding nothing, I opened the windows and turned on the bathroom exhaust fan to try to clear the odor while we ate supper. On return, the room seemed better so closed the windows and shut off the fan. Within 30 minutes, the smell was overpowering. I called the desk, explained the problem, and was told, \"I called your room and asked how everything was after you got here. Now something is wrong?\" I explained that I thought we could simply air the room out during dinner but that it had not worked and room smelled. On the other end of the phone were numerous grunts and sighs and I was told they couldn't do anything tonight--all the staff had gone home \"hours ago.\" I was again made to feel like I was the problem and that I was somehow unreasonable. After a short conversation, they agreed to assign us a different room, which smelled fine. After about 1.5 hours in the new room, my head cleared and my nose stopped running. The new room did not have wash cloths in the bathroom and had an ant infestation. We stayed, rested fine, and reported both things to the office the next morning. The night staff had made no record of the odor in room 210 for the day manager, so I reported this as well. The day staff was understanding and accommodating. I would not stay at this particular hotel again, though. The breakfast was two kinds of cold muffins, some Granny Smith apples and coffee. Not quite the \"grab and go\" breakfast that one would expect. Some advice: spend the extra bucks and stay at Residence Inn if you are doing a Marriott hotel.", "title": "Not bad, not great, just average", "helpfulness": 1, "user": "15Tubaman", "date": "July 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 34361526}, {"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "This is one of the most pathetic excuses for a hotel I have ever seen, and it is mostly because of the terrible people who work there. They seem to have the attitude that if you have the \"Marriott\" name then you don't have to do anything for the guests, which is exactly how they act. Don't dare to ask the staff for anything extra likes sheets, towels or room service that is above their minimal levels. If you do ask, they look at you like you have three heads, you can see they don't really want to do it, it is only grudglingly that they will end up doing anything. Also, the place is very dirty. We purposely left some dirt on the floor to see if the housekeeping would vaccum it, and of course it was still there when we came back. When I brought this fact up to the front desk they could not believe it, and continued to insist that they cleaned the room right. The supposed \"grab and go\" breakfast is really a big joke. They consistently ran out of the few things they were supposed to have, and the muffins for two months on end were always blueberry. I know these guys buy in volume, but can't you buy some different muffins? This hotel is also a training hotel for Marriott, so invariably you get an inexperienced trainee who does not know what they are doing, and this always happens at the worst time.", "title": "This place is a nightmare do not stay here!", "helpfulness": 3, "user": "Dave933", "date": "December 20, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 22868467, "likes": {"liked": "— Nothing", "disliked": "— Terrible attitude of the employees there."}}, {"rating": 4.0, "title": "Clean and comfortable", "text": "All in all, there are several other hotels in the area and I would avoid this Townplace Suites at all cost. Unfortunatelyit was too late for us.", "helpfulness": 2, "user": "sun044", "date": "October 14, 2008", "id": 20886544}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We stayed at the TownPlace Suites in Tewksbury for 4 nights and used it as a home base while visiting Boston and the surrounding areas. Having stayed at many Marriott’s previously, I can say with 100% confidence that this hotel does meet the standard of other Marriott hotels. That’s not to say this hotel is horrible or anything, it’s just average. The front desk staff was helpful, the room was clean, and it was relatively quiet except for the dog barking across the hall. Our building reeked of smoke for the first 2 days in what is supposed to be a non-smoking hotel. The breakfast was also a disappointment compared to other Marriott hotels. The breakfast consisted of juice, cereal, muffins, and that’s about it. The hotel is in a good location for visiting Boston and the surrounding areas. This was an average hotel and definitely not up to the Marriott standard.", "title": "Not up to the Marriott standard...", "helpfulness": 1, "user": "Nevermore52", "date": "November 2, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 120070262}, {"rating": 3.0, "title": "Good, quiet, inexpensive but not my favorite", "text": "I often visit Tewksbury because we have family in the area. In late October we stayed here for five nights for the first time.", "helpfulness": 1, "user": "j0yrenee", "date": "October 29, 2011", "id": 119857075}, {"rating": 1.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Pros: rooms (two adjoining suites) were relatively quiet (no road noise - could sometimes hear persons above us walking on the floor but not too loud) and inexpensive. Breakfast is continental - yogurt, prepackaged muffins, cereal - was grab and go but the choices are good. The room's decor is quite lovely and the bathroom fixtures and shower curtain were new and stylish.", "title": "DO NOT stay at this place.", "helpfulness": 2, "user": "bubbles531", "date": "October 23, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 119618853}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Cons: NO WIFI. Cable TV was out when we arrived and front desk staff were completely unaware. Rooms have no dressers for you to store your clothes. No rollaway beds available. Blow dryer in bathroom would only work for about eight minutes and then not come on again. Exercise room is not well equipped: who wants to work out with three mismatched weights and a noisy treadmill that flashes a \"belt needs waxing\" message? Prices in the lobby \"store\" are a rip off - I purchased a bottled water and diet Pepsi (both 16 ounces) and the price was $5.", "title": "Basic Lodging near Boston", "helpfulness": 1, "user": "mgmvt", "date": "September 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 118602085}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I will start by saying Simone at the front desk was very nice. But that is the only nice part of this place. We were planning on staying 1 month as we sold one house and are waiting to move into the next. It's my husband, myself and our 17 month old. When we checked in we didn't have any extra garbabe bags and seeing how I cook a lot we needed bags. It took them 12 HOURS to bring us bags. They has a desk in the room, I asked for 2 extra chairs so we could sit at the table to eat instead of the floor. They left a voice mail saying we will have them on Monday IT'S SUNDAY AND STILL NO CHAIRS. We had our room refresh Thursday....no toilet paper, we have been using napkins for TP. I asked for extra towels, still waiting for those as well. We are moving hotels needless to say.", "title": "Convenient with comfortable beds at a reasonable price", "user": "RebeccaKiraHannah", "date": "August 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 117142666}, {"rating": 3.0, "stay_parameters": "Stayed June 2012", "text": "We stayed in a 2 bedroom suite for 23 very long days while waiting to close on our new home. We=Husband, me, 18 month old and our crazy cat. Not a lot of room but we made it work. This is a no frills option but budget friendly compared to Residence Inn or furnished apt. We negotiated our daily rate since we were there for a few weeks. I'll just cover pros and cons:", "title": "Budget Friendly Basic Temp Housing Option", "helpfulness": 1, "user": "Daphne418", "date": "July 20, 2012", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 134944731}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Pros: great staff that tried to make the best of it for us; functional kitchen for quick meals- dishwasher, stove, oven etc.; decent sized bedrooms - we moved bed against wall to put crib in it, good closet space, work desk in larger bedroom; very quiet... Only had 1 bad neighbor that slammed door for the 2 nights they were there. Quick free breakfast in morning - just cereal, hot coffee and fruit; Location was close to 495/93 and plenty of local dining options. Free wireless was fine for work and downloading basic work files.", "title": "hit or miss", "helpfulness": 3, "user": "DrMoSwitzerland", "date": "May 30, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 130943157}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Cons: No green space to sit and relax or kids to play; Cleaning service is spotty as previous review mentioned; rooms are dated and worn but we had toddler that destroys everything so no biggie for us; small living room so we ended up most of time in bedroom as not to wake our", "title": "Friendly, Reasonable Rates, Close to Raytheon", "helpfulness": 1, "user": "W E", "date": "April 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129044440}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "toddler.", "title": "wonderfull and friendly", "helpfulness": 1, "user": "bikemaster202", "date": "November 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120665846}, {"rating": 3.0, "stay_parameters": "Stayed September 2011", "text": "It wasn't that bad but it was tough... As there is nothing better than sleeping in your own bed.", "title": "Filthy carpet,trash&cigarette butts outside", "helpfulness": 4, "user": "oceana101", "date": "November 13, 2011", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 120528916}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We have Elite status with Marriot and wanted to try another Marriot brand hotel in this area and chose the TownePlace Suites Boston/Tewksbury/Andover. On the positive side, Simone at the Front Desk was friendly and welcoming. On the not so positive side, we checked in on Thursday. After being out all day Friday, we came back to our room that had not been serviced so I took the dirty towels to the office for an exchange and reported the no service problem. Saturday after being out all day, the same problem so back to the office to exchange towels and report the problem once again. Sunday the trash was emptied, the towels changed, room sprayed for freshness and the bed not made.", "title": "Disappointing", "helpfulness": 2, "user": "fudgbug", "date": "July 30, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 3.0, "service": 2.0}, "id": 116030389}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "When I went to see what was available Monday morning before checking out for breakfast one of the housekeepers was in the office area so I asked her, \"What is \"refresh service\"?\" She explained that daily the trash is emptied, towels changed, and beds made. When I told her that we had been guests since Thursday and that had not happened, she asked for our room number and I told her. She said \"Oops! That was my room yesterday. I forgot to go back and make the bed!\"", "title": "Comfortable suites", "user": "jessecj", "date": "July 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 3.0}, "id": 116012923}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The grab and go breakfast is OK if you like cereal and some bars. I don't eat sugar or starch.", "title": "Nice hotel for long stays or just passing by!", "user": "Jazz009_87", "date": "June 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 114580533}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Next visit to this area, we will go back to the Fairfield Inn that is just up the street.", "title": "amazing bed...", "user": "kalileahmp", "date": "December 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88793920}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "We have family nearby and this is our choice for accommodations. The suites are comfortable and the location attractive. Amenities are limited, and the location probably is not good for Boston visitors, but for business or family travel in this part of town, this works out well for us.", "title": "Perfect for a temporary place to stay", "helpfulness": 1, "user": "Liser79", "date": "August 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 74117392}], "location": {"country": "United States", "city": "Tewksbury"}, "stars": 2.5, "variance": {"poor": 4, "average": 16, "very good": 13, "terrible": 4, "excellent": 4}, "aka": "Towneplace Suites Boston Tewksbury/Andover Hotel Tewksbury", "slim_ranking": 0.714285714286}