{"user_rating": 4.5, "review_count": 122, "name": "Townhouse Boutique Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Getting to hotel was pretty easy, at the airport take the train to Zurich Hauptbahnhof HB, at the main station take the exit Bahnhofstrasse- first side street Schützengasse on your left.", "title": "cute, clean & great location", "user": "lalalatracy", "date": "December 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147634480}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "it costs 13.50chf (approx) and the ticket can be used for 24hrs on trams, trains and boats within 2 zones.", "title": "A lovely experience.", "user": "DrGnommi", "date": "November 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146390335}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "Hotel is clean, comfy and has all amenities- Molton Brown toiletries, cotton balls, as DrGnommi mentioned, real hair dryer, dressing gown, towels etc.", "title": "A good value for money", "user": "FRANCISCO7", "date": "October 27, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 143855587}, {"rating": 4.0, "title": "Townhouse update", "text": "Rooms are quite big for city hotel, though there is no wardrobe or minibar in room, however there is a mini bar & kitchen in the lounge on 5th floor, just note down your room and what you took, or there is a supermarket in the station.", "helpfulness": 3, "user": "hammersb", "date": "September 29, 2012", "id": 141577780}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We love the location and convenience of this hotel, if you love small, cute hotels, this is a good choice.", "title": "A bit of a surprise", "helpfulness": 5, "user": "WickedTraveller41", "date": "September 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 141262734}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "The main reason for us to choose Townhouse Boutique hotel was that it was very very closed to the train station and at a reasonable cost, We were traveling with party of 5 people including one child and one infant and so the top priority was convenient location.", "title": "Very good location and Most importantly very friendly helpful staff", "helpfulness": 1, "user": "ISWC", "date": "June 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164365802}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "When we arrived at Zurich, we walked to the hotel from Zurich HB Railway station. With four 20kg+ luggage and two kids, obviously it wasn't easy but luckily we can pull the luggage on wheels all the way to the hotel without the need to go up or down any steps.", "title": "Comfortable, central and excellent value", "user": "SussexVoyager", "date": "June 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163572836}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "We went up to the reception situated on the 5th Floor of the building and we were greeted with a very friendly and helpful staff. We booked two rooms. Out of the staff own initiative, the staff in the hotel upgraded one of our room , so that the two rooms are next of each other. We went to our room and before we rolled our languages into our room, we couldn't resist taking our camera out and took photographs. The rooms were very beautifully decorated. It is also good in size (I must say the room was little bigger than expected ,Originally I did have a expectation of a smaller room because it is “Boutique hotel)", "title": "A hideway worth finding", "user": "airbus0320", "date": "June 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163259515}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "The hotel is situated just off Bahnhof strasse the main shopping street of Zurich, the good bit is everything is at close proximity, not so good is the view of the room. Our room’s windows do face the office block in the next building. The issue can be easily solved by drawing the blind. Anyway with the beautifully decorated room you don’t really need a windows’ view!", "title": "Convenient and Wonderfully Decorated", "helpfulness": 1, "user": "mmfitzwalth", "date": "May 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162311873}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We went to Zurich in second week of June and we do need to cool off the room by opening the windows in the evening. A fan was provided but for us we didn’t really need it. We didn’t see air-condition in the room but there were radiator for the winter.", "title": "Good location, but noisy and 'just-for-show'", "helpfulness": 4, "user": "travellerfromholland", "date": "May 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 160420233}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "I stayed at the Townhouse twice within the last 6 months. It's a 2 minutes walk from the main station (7 to 13 minutes train ride from the airport, depending on which line you take) right off Bahnhofstrasse. The building itself doesn't look like much but as soon as you get out of the elevator to the reception desk (5th floor), you will notice that this is not your average hotel.", "title": "English charm in the middle of Zürich", "helpfulness": 1, "user": "Firedragon_1976", "date": "April 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 157854226}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Staff are friendly (funny even) and there is a nice honesty bar next to the reception area where you can get tea & coffee (free) as well as an assortment of different juices, toast, pastries, jams, yoghurts etc., so if you don't want to have breakfast elsewhere, you can easily assemble one there for a very reasonable price and eat in your room. As for those: both times I stayed in the Townhouse, I entered my room and got the urge to sing Rule Britannia - which is a good thing in my books. There's an iPod dock, free WiFi, a nicely sized TV set and a DVD player (you can borrow DVDs at the reception). The beds are high and comfy, bathrooms clean with ample space for toiletries. I got a jr. suite last time, so I had a nice little table to work (and have breakfast) on as well as a comfy couch to enjoy a cup of tea and watch TV later.", "title": "Delightful Place to Stay with One Caveat", "helpfulness": 1, "user": "Gearhead85", "date": "April 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 1.0, "rooms": 5.0, "location": 5.0}, "id": 156630361}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Travelling for business can be tedious, so if you are sick of generic hotel rooms and prefer something homey, this might be the place for you. I certainly will stay there again the next time I go to Zürich.", "title": "A gem in Zurich!", "helpfulness": 1, "user": "Nadine H", "date": "March 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154606996}, {"rating": 5.0, "title": "Five Star Service", "text": "This hotel has many great things going for it with one exception. Since most reviews focus on the positive, I will start with the one disappointing aspect of my stay before listing the hotel's many attributes.", "helpfulness": 2, "user": "hammersb", "date": "February 10, 2013", "id": 151817946}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "I adored this hotel from the moment I stepped in until it was time to go to sleep and discovered that the bed was terribly uncomfortably. Simply put, it was a cheap mattress on a cheap frame. The single bed was also surprisingly narrow. It is really too bad that after all the thought and attention that went into this hotel that they would skimp on something like the mattresses.", "title": "Lovely convenient hotel", "helpfulness": 1, "user": "zhu J", "date": "February 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 151456854}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "Quiet place in the center of Zurich. Two steps from Bahnhofstrasse, couple minutes from Bahnhof. Small clean rooms. Nice old England disign. Many thanks to lovely ladies who looks after us! Next time will stay here.", "title": "Almost home", "helpfulness": 1, "user": "Askar K", "date": "January 25, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 150618836}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "we were travelling by train so the location was perfect for us. The hotel is down one of the side streets off the main shopping street and is in a quiet location. The rooms can be quite smaIl but the bed was excellent and very comfortable and the bathroom a decent size for all that the room was small. There is a coffee shop opposite for breakfast though they have tea/coffee making faciliteis in reception with an honesty box arrangment. The old town is a couple of minutes walk over the bridge and you couldn't really ask for a better location to be in. I would recommend it for both holidays and business travellers alike.", "title": "excellent location", "user": "mashkitty66", "date": "January 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150588479}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "The hotel is just a few steps from the main Zurich train station. Transfer to/from the airport is very easy. Unfortunately I arrived on a Sunday around 8:15 am and the receptionist was running late. The clearning ladies let me in and I had some herbal tea in the living room. So the 15-minute wait was not bad. My room was very basic and the bed does not have a headboard. It was reasonably comfortable after a long flight from US. Though it is called a B&B, breakfast is actually a la carte (yogurt, snack) for additional charge. After walking around Zurich and seeing how everything costs double of US, the hotel seems adequate for the price. I will probably try something different next time. Zurich is relatively compact and easy to walk to places.", "title": "Basic but Convenient", "user": "hopscotch2012", "date": "January 20, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 150122548}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled solo", "text": "I was in a double on the fifth floor where the little lobby is located, facing the street. The room was very clean, the bedding comfortable, the unique furniture was functional and inviting. A rack for clothing (there was no wardrobe in the room) was about to come off the wall, but such things happen.", "title": "Perfect Little Place for Short Stays in a Great Location", "user": "Ruebi", "date": "January 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 149807327}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The tiny bathroom is functional. I repeat: It's tiny. If you spend an hour or so getting ready in the mornings, do not choose this place. If you need a clean place to clean up, shower, and shave, you've got it.", "title": "Great location, fuss-free", "user": "AidanGCM", "date": "December 23, 2012", "detail_rating": {"value": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0}, "id": 147936297}], "location": {"country": "Switzerland", "continent": "Europe"}, "variance": {"poor": 1, "average": 14, "very good": 48, "terrible": 1, "excellent": 58}, "slim_ranking": 0.145161290323, "description": "The Townhouse is a small boutique hotel with 23 rooms and 2 spacious junior suites. It is located in the very heart of Zurich, a block away from the main train station where direct services take you to Zurich airport in less than 15 minutes. Upon arrival, you will already notice the difference. Check-in takes place in our living room on the 5th floor. This is also the place where you can relax in comfortable couches, browse through the latest magazines, or help yourself to a drink from our honesty bar. The refrigerator is stocked with healthy snacks and you can make yourself a tasty Italian espresso at the coffee machine."}