{"user_rating": 4.0, "review_count": 44, "name": "TownePlace Suites Charlotte University Research Park", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We usually like to stay at Marriott properties; this trip we had our dog with us. Wanted the Residence Inn, but it was booked full. Was pleasantly surprised at the TownPlace Suites. Staff was friendly and accommodating, rooms were clean, although plain decor, as expected. Simple continental breakfast was sufficient. The location was great, just off the I-85 freeway where you could get to just about anywhere. They charge a $75 pet fee, so the rate of the room at about $80 was ok. I would not have wanted to pay more, along with the pet fee. We will stay here again when in the Charlotte area with our dog.", "title": "Decent Place for Pets", "user": "tahiti98", "date": "September 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 8826709, "likes": {"liked": "— Location, pet policy", "disliked": "— Plain decor"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2005", "text": "We have stayed at this hotel 4 different times over the past 3 years. It is in a quiet location just of I-85, and very close to University Place and lots of restaurants. The rooms are large and very clean. It has a kitchen, so you can fix food if you want to. They also have donuts in the lobby in the mornings. All of the staff was pleasant and saw to any of our requests.", "title": "Great location", "helpfulness": 9, "user": "auntrose50", "date": "June 3, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 2149506}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "I appreciated and enjoyed the fact that I was able to feel relaxed and comfortable the way I would at home. Customer service was very good and very accommodating. I thought the queen bed was also comfortable. My husband, however, did not think the bed was comfortable; but, it's differrent strokes for different folks. He did like the room, however, and was also satisfied with customer service.", "title": "I Like It!", "user": "SincerelyBloomfield", "date": "November 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 120549683}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "When we got into our room, we saw that it was not the one bedroom suite that I had reserved. We were, I think, placed in a Standard or Studio Suite. Michael, at the front desk, did not give me a hard way to go. He asked me did I want a one bedroom or a two bedroom. I said a one bedroom is fine. He said, well I thought I would give you a bigger room, and he apologized for the mistake. I asked how much more for the two bedroom? He said, for the same price. I said okay. Because of this gesture, I know that my husband and I will stay here again. Thank you Michael!!", "title": "Great Place to Stay with Family", "user": "kenniman1951", "date": "September 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 118484713}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "I would also like to say thank you to Takia at the the front desk. She too was accommodating and extended herself as well. Thank you Takia!!", "title": "Excellent, excellent, excellent", "user": "BLULUC", "date": "July 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71716278}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "Better than a hotel, more like a vacation rental. Clean rooms and friendly, helpful staff. Good location. Will defiinitely be back.", "title": "THE BEST IN CHARLOTTE METRO AREA", "user": "mlangone", "date": "July 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70192710}, {"rating": 5.0, "stay_parameters": "Stayed June 2010", "text": "Felt like home. Clean. Friendly customer service. Highly recommend. Beds are so comfy.", "title": "Great Stay", "user": "CKeen", "date": "June 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 66871671}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "I stayed at the TownPlace Suites in University Research Park for four nights in early May 2012 while in town on business. I usually stay down the road at the Courtyard (a very nice hotel), but for this longer stay, I opted for the combination of lower rate and suite convenience. The facility stands out on both accounts.", "title": "Suite convenience, terrible sound control, wrapped up with a very different \"vibe\"", "helpfulness": 1, "user": "DrewKnightWV", "date": "May 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 129752858}, {"rating": 1.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "As others have noted, the physical plant is a little -- or in places, a lot -- worn and dated. My room was actually reasonably spacious and was clean enough (couple of gross hairs stuck to the wall in the bathroom, which probably shouldn't bother me, but did), and frankly, the maid service every day was very good and more than I probably expect in a suite hotel. The kitchenette couldn't be more basic, but it was extremely convenient and allowed me to eat a couple dinners \"in\" after a quick trip to Trader Joe's -- which is something of a luxury after weeks on the road.", "title": "Worse ever experience", "user": "danderfield", "date": "May 9, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 129624137}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "One thing that is notably bad at this hotel: Sound control is dreadful. My first night there (a Sunday evening), it sounded like there was a very energetic party going on two doors down, and some of the joyful noise filtered through my door. The next night, the person above me was some mutant form of thunderfooted bumblebee who apparently brought his home weight set with him and delighted in dropping said weights between sets. It was very jarring. And my third night, the couple in the next room decided to have -- how does one delicately put this on a family site? -- the congress of a lifetime. From my place on the other side of the wall, I can tell you it was a brief but spirited performance by all participants.", "title": "MEH...like what someone else said, not up to Marriott standards.", "helpfulness": 1, "user": "THERREN D", "date": "May 6, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 129454284}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Actually, over the course of days, an interesting pattern emerged for me. As a business traveler (and a classic introvert by nature), I tend to favor quiet, comfortable hotels where I can slide in and out with zero friction. If I don't see anyone else, that's perfectly OK by me -- I come and go at odd hours anyway. Imagine my surprise, then, when I noticed that many of the other guests at the TownPlace seemed to gather together in front of the lobby (where they sell a limited selection of beers) in groups of five and ten, chatting and sipping and smoking cigarettes and generally, recreating the scene at a small sports bar, but standing outside near a hotel parking lot instead. (I would say that the demographic of this particular Marriott runs toward the trades and service people -- which is quite different than the Courtyard a mile down the road). Honestly, not my scene -- but if you like that kind of thing, I think it did look like a pleasant distraction if you're away from home and friends for a few nights.", "title": "Not up to Marriott standards....", "helpfulness": 2, "user": "vinmarine1", "date": "April 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 128301610}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Would I stay there again? Tough call. Convenience is high, comfort is adequate, general noise level is just too high for my tastes.", "title": "Average Stay", "user": "snwbnnyinoz", "date": "January 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 122415183}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "I stayed at this hotel for one night prior to attending off site training for my job. Check in was short and easy, the hotel did offer menus for restaurants that delivered and they have a little store by check in that had drinks and snacks. When I walked in my room it was freezing so I had to turn the air off. The furniture and TV were a little dated but everything was clean. While I wouldn't call it a four star hotel it was definitely fine for just a business trip. The staff was very nice and had great customer service.", "title": "Nice & okay- a little dated but very convenient", "helpfulness": 1, "user": "Stategrl52282", "date": "May 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 64724934}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "This hotel had very nice front desk staff that welcomed us when we arrived, they had a nice lobby with snacks and drinks available for purchase along with coffee 24 hrs. We booked a 2 bedroom suite for the space and was very satisfied with how clean the room was and the comfort of the sofa and the beds. I liked how the suite had multiple windows that we could open and let fresh air in, felt like I was in a little apartment. The internet was a little hit and miss with the signal but overall it worked pretty good. It was nice to see they provided a breakfast with cereal, waffles, sausage biscuits (my favorite) and bagels, toast, etc. The price for the suite was not bad either compared to other hotels that offered 2 bedroom suites, which are few and far between. I would recommend this hotel and would not hesitate to stay here again.", "title": "Nice quiet hotel with 2 bedroom suites!", "user": "acdavis", "date": "February 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 56916418}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "The suites are usually nice as the layout of bedroom, sitting area and kitchen is great for long or short stay. We booked a two bedroom suite and one of the rooms smelt of dog urine. We asked if they had any rooms not previously used by pets but apparently they can all be used but are thoroughly cleaned. We put up with it for one night but had to change to a new room the following day as it was unbearable. The staff on the weekend was limited and disinterested as even when we had not got a coffeemaker we had to fetch one ourselves, as the only member of staff was manning the checkin desk. The second room was clean and as expected from the brand. Breakfast was plentiful although the room was used by the staff to stand around for a chat.", "title": "Make sure your room hasn't been used by pets", "helpfulness": 3, "user": "TANYA66", "date": "July 4, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 33866013}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "At $99 + tax for a 2-bedroom unit, the TownePlace Suites was a very good value. I was a little surprised that it only had one bathroom, but our group of 3 adults and one child managed just fine. The living area is a bit smaller than a 2-bedroom Staybridge or Residence Inn, but we really didn’t spend a lot of time there. The rooms were clean, check in & out was very easy and the front desk staff was very friendly. The free breakfast also was not as big as a Staybridge or Residence Inn, consisting of waffles, cereal, bagels, toast, yogurt, microwavable sausage bisquits, juice & coffee. The breakfast room only had 3 tables with room for about 8 people and it was full both mornings we stayed. We took our breakfast back to our room to eat it. The location near UNC Charlotte on the north east side of Charlotte was very convenient for us because we were coming from Greensboro on a Friday afternoon and I-85 always seems to be slammed when you get close to Charlotte. And it was slammed at every interchange from the first Concord NC to our exit. And it would have been slammed if we had to drive farther into Charlotte. It was also convenient for us to get to the Charlotte Merchandise Mart on both days, taking about 20 minutes on the interstate or on surface streets like we did. It is right next to a Macaroni Grill and there are many other places to eat (Cheddar’s, Chili’s, etc) right across the interstate.", "title": "Good Value", "helpfulness": 1, "user": "PapaJerryW", "date": "June 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 33452975}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We probably would have paid a little more to stay at a Residence Inn or Staybridge Suites, but the nearby Residence Inn didn’t have a 2-bedroom unit and the two Staybridge Suites in Charlotte are on the other side of town.", "title": "WOW!", "user": "ABC123Yes", "date": "March 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27156901}], "location": {"country": "United States", "city": "Charlotte"}, "stars": 2.5, "variance": {"poor": 4, "average": 8, "very good": 11, "terrible": 4, "excellent": 17}, "aka": "Towneplace Suites Charlotte University Research Park Hotel Charlotte", "slim_ranking": 0.494047619048}