{"user_rating": 4.0, "review_count": 90, "name": "Toyoko Inn Sinagawaeki Takanawaguchi", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "We stayed here our first night in Tokyo, primarily because we had a late arrival at Haneda and wanted to head out to Kyoto first thing the next morning. This hotel is across the street form Shinagawa station. We took the train from Haneda and had no trouble at all finding it (you can see it as the train pulls in).", "title": "Good bang for the buck", "user": "mfnyc", "date": "October 25, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 182393797}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "As mentioned, the room is small, and the bed, VERY firm. But the room is clean, quiet, and has all the basics. The breakfast, which is included, was decent. Fresh baked croissants, scrambled eggs, among other options, and good coffee (and tea). We had breakfast early, and did not have any problems finding a place to sit, but the area is small and seating is limited.", "title": "A Bargain", "user": "Nancy255103", "date": "August 20, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 173143668}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "The one problem we did have was elevator access with luggage in the morning. There's just 1 small elevator and each time it reached out floor it was packed (rush hour). fFter a few tries, we decided to take get the elevator on the way up, when it's empty.", "title": "convenient and perfectly located", "user": "f64CM", "date": "August 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 172044790}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "The only other issue we had was, they request you contact them of a late arrival. I did note it in my reservation that I made on booking.com but wanted to confirm. I emailed twice, and did not get a response. We tried calling, but language barrier was too hard to handle over the phone. I finally asked a friend living in Tokyo to call for me. Other than that, for the price and convenient location, it's a great option, although I think it may be too cramped if it was an extended stay.", "title": "Toyoko Inn hotels for me whenever i'm in japan", "helpfulness": 2, "user": "Jenjenkay", "date": "June 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 163138089}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "In a city like Tokyo it is not easy to get a low price and yet descent hotel so Toyoko Inn Sinagawaeki is great. Although Shinagawa does not have much to offer when compared to Shinjuku, it is a very descent suburb and is very accessible by the subway to every part in Tokyo. We particularly like the breakfast in this Toyoko Inn. It is a treat to get their house baked croissonts instead of the usual rice and pickles in the other toyoko inns.", "title": "Convenient and cheap", "helpfulness": 2, "user": "wilfredwong", "date": "May 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 161781916}], "location": {"country": "Japan", "region": "Kanto", "continent": "Asia"}, "variance": {"poor": 1, "average": 26, "very good": 49, "terrible": 0, "excellent": 14}, "aka": "Toyoko Inn Sinagawaeki Takanawaguchi Hotel", "slim_ranking": 0.478260869565}