{"user_rating": 4.0, "review_count": 1324, "name": "Traders Hotel Singapore", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "From the moment we stepped in the hotel we had fantastic customer service. Fresh fruits, baby cot and an upgraded room made our stay even better. The deluxe room is a bit tiny though. The staffs were efficient and helpful.", "title": "Excellent Hotel, Friendly Staff .. My baby simply loves it !!", "user": "BBLu", "date": "July 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 35568659}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Baby Elliot loves the king size bed which was very comfortable, he fell asleep as soon as his head hits the down pillows.", "title": "Great location but didn't get what we booked", "user": "NewieTraveller", "date": "July 23, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 35543806}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The location of the hotel is not too far from Orchard Road, but one still have to rely on a cab to get to the central shopping district.", "title": "Thorougly enjoyable stay", "user": "freyaspapa", "date": "July 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 35469301}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Overall, we had a great stay at this hotel and our only disappointment was that we only found out that the hotel actually connects to TANGLIN MALL on our last day :#", "title": "Great Service, clean, modern and accessible", "user": "Bob009", "date": "July 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 34433215}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We had been recommended this hotel by a friend who has stayed there on a number of occassions. It's location is excellent easy walk to Orchard Rd and all the shopping districts, easy to get transport etc, howeer we had booked a non-smoking room with queen size bed, we instead got a smoking room with twin beds, on returning to reception to say that we are not happy with the room and that we add booked non-smoking, queen bed we where offered a upgrade with breakfast package for a lot more money, when this was refused we where told that nothing good be done as hotel booked out, staff member was very un-helpful. We decided to stay because we where flying out next night for europe so only staying one night. There is a shopping centre behind hotel where you can get a good breakfast for way less than what hotel charges. The only thing I can say about Traders is truly excellent location", "title": "Compact but functional room, ideal location and great facilities", "user": "Trippy21", "date": "July 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 34058349}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "I stayed here for a business trip and I must say the rooms are incredibly cramped. The distance between the bed and the TV felt like less than 2 feet apart. I lost count how many times I kept bumping into the furnitures and went home with bruises.", "title": "Small rooms & not so perfect location", "user": "cyinmin", "date": "September 18, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 2.0, "service": 3.0, "rooms": 2.0}, "id": 42702956}, {"rating": 2.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Walking to Orchard takes 15 mins at least, and thats not even the middle section of Orchard..", "title": "a souless transit hotel", "user": "kathywestmids", "date": "September 10, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 1.0, "service": 5.0, "rooms": 1.0}, "id": 40624500}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "Big mistake to stay here unless you like big chain hotels without much character. Though described as close to Orchard Road and the malls, it is 20 mins walk to top end of Orchard Road and same distance to the metro station - not good in 32 degree heat. it is attached to a small mall which is ok, but be aware that if you stay here to shop (as we did) it is a long way to the better malls on the Orchard Road. It's also a long way to the main sights in the colonial district, the marina, chinatown, little india etc, though taxis are cheap (unless you want a 20 minute sweaty walk to the metro). No decent restaurants or hawker centres nearby (fast food only in the mall) and the hotel's chinese restaurant is about the best there is in the area. We asked for a no smoking room and though the whole floor was supposed to be non smoking, the room stank of cigarette smoke, though reception quickly and efficiently moved us to another room. The whole hotel smells damp and musty though. On our first trip to Singapore we stayed at the Scarlet in Chinatown which was similar price but 5 star standard. Though there is a business centre for access to PCs, it has restricted opening hours, and though advertised in room as open at 8am, doesn't open until 10am - again staff were very good and opened it up for us to check in on-line and print our boarding passes, and also to assist another guest who was there on business and not happy about lack of facilities.", "title": "Traders Club service was very disappointing", "user": "211traveler", "date": "September 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 40115004}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "This is my first time staying at the Traders chain (have stayed at several Shangrila's with good experiences) and since this was a busy business trip, I figured I would not get to enjoy the hotel as much and the Singapore Shangrila is a bit out of the way. I must say i was rather disappointed with their service, especially since I chose to stay in the Traders Club, which was advertised as to have \"a higher standard of accommodation, personalised service and a host of special privileges and amenities\" for the frequent traveler (quote from their website). The hotel appeared aged but rooms--smaller than expected--were generally well kept up; location not central on Orchard road but fit my purpose. To make a long story short, on Day2 of my 4D stay, my room had a leak that was not fixable and I had to move--not once but 3 times (I forget!) since I had some specific requests--THAT'S why I chose the more expensive Traders Club rooms instead of one of their regular rooms!! So after spending about 1-2h repacking and moving around and re-unpacking, you would think that the hotel would be bending over backwards to apologize for this. Yes, I did get a phone call from the manager to apologize for the inconvenience, but that was IT.... Nothing special or 'personalized' about the service!! To be fair, the quality of the food (bkft & evening cocktails) was quite good, but the service was definitely disappointing, especially given that this was Traders Club, especially given that this was Singapore, service city of the world as they like to think. Anyway, a sorely disapointing stay which will make me think twice about staying at this chain again.", "title": "small rooms, no soul", "user": "jamesy168", "date": "September 6, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 39900472}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled solo", "text": "the rooms are small with little to offer. the plus is free internet and located at the very end of the Orchard Road shopping area, near the embassies and botanical garden", "title": "Pleasant location, friendly staff", "user": "UkSinglegirl", "date": "August 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 37887761}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "This was the second time I have stayed at the Traders and they made sure they greeted me as an old friend... This is their trade mark; the location is ok but doesn't have the views of Clark Quay, the rooms are small compared to other Singapore hotels BUT the rooms are v clean, the service is excellent and the staff seem to remember who you are and greet you as an old friend which I love.", "title": "Small rooms, great service", "user": "PandEKew", "date": "October 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 3.0}, "id": 45596916}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "The spa is well worth a visit for reasonably priced massages and facials - I recommend the Executive package - for equivalent of £45 for 90 minutes - great value and attention to detail.", "title": "Excellent hotel!", "user": "CostieraAmalfitana", "date": "September 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45486081}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Free wireless is included and is super fast - plus you are moments from Orchard road and the Tanglin Mall.", "title": "Nice and fairly priced", "user": "ebennike", "date": "September 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 44931385}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "Traders in Singapore is a superb hotel - efficient and courteous staff, well located, pleasant public rooms and the most incredible breakfast.", "title": "Great staff, good value for money", "user": "alwyn1", "date": "September 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 44535281}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Rooms may be small - but they are exceptionally well-designed to make best use of the available space. We, as most visitors, spent more time exploring the wonderful city - don't think many visitors to Singapore would wish to spend long periods of time in their hotel room. Distance from Orchard Road was easily walkable - even in the heat and humidity. Alternatively, taxis always available at the door of the hotel. Mall linked via walkway from hotel offered pleasant shopping (cafes, ATM, pharmacy, supermarket, clothes etc) literally on the doorstep.", "title": "AMAZINGLY FRIENDLY AND VERY PROFESSIONAL HOTEL", "user": "JillyBean22", "date": "September 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 43398313}, {"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "The good:", "title": "Disappointing overall", "user": "eddie299", "date": "August 13, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 37585000}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "1) Breakfast - vast choice of food with good quality", "title": "nice room, out-of-center location", "user": "Eric_wolf", "date": "August 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 1.0, "service": 4.0, "rooms": 3.0}, "id": 37543582}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "2) Nice pool area", "title": "Good value for no frills package", "user": "Staidthere", "date": "August 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 36450221}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "3) Spa", "title": "AN EXCELLENT PRIZE", "user": "CCMom123", "date": "July 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 36072464}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "The bad:", "title": "The upgrade was a lovely surprise", "user": "istana", "date": "July 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36038475}], "location": {"country": "Singapore", "continent": "Asia"}, "stars": 4, "variance": {"poor": 46, "average": 230, "very good": 617, "terrible": 29, "excellent": 402}, "aka": "Singapore Traders Hotel", "slim_ranking": 0.173611111111, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.0}, "description": "Traders Hotel Singapore is located in the fashionable area of Orchard Spring, just a 5-minute stroll to the main shopping and entertainment district on Orchard Road. All guestrooms have been stylishly designed with an array of business facilities for the traveling executive. There is also a wide choice of cuisine and for the health-conscious, it offers a fully-equipped fitness center and 30-meter pool. Traders Hotel, Singapore represents a subtle blend of western comfort and Shangri-La hospitality with genuine value for money."}