{"user_rating": 4.0, "review_count": 2897, "name": "TradeWinds Island Grand Beach Resort", "reviews": [{"rating": 4.0, "title": "Good Hotel, Good location", "text": "My partner and myself stayed at the Tradewinds for 1 week in October and were very pleased with the hotel. It was more basic that we are use to, but it was clean, comfortable and centrally located.", "helpfulness": 1, "user": "Michelle_74", "date": "October 31, 2007", "id": 10469535}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "We paid for an upgrade to a beachfront room and really found it was worth the extra couple of dollars. Sunset was fab and it was great to get the sea breeze from the balcony. Be warned - The balcony is very small and just enough to seat two.", "title": "Great Family Resort", "helpfulness": 1, "user": "ankisha", "date": "October 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10420604, "likes": {"liked": "— View of beach", "disliked": "— Slow service at times"}}, {"rating": 3.0, "title": "its an ok..3 star defnitely not a 4 or 5 star", "text": "We used one of the beach restaurants, however found there were lots of good choices outside the hotel so we ate out most nights. We consulted the Concierge re: locations and they never let us down with their suggestions.", "helpfulness": 2, "user": "262626NewYork", "date": "October 27, 2007", "id": 10375462}, {"rating": 5.0, "title": "perfection", "text": "St. Pete’s is quite, peaceful and a lovely beachfront holiday. After spending a hectic week in Orlando, it was a nice change, however it was difficult to wind down after such an action packed first week.", "user": "WalesWelshie", "date": "October 25, 2007", "id": 10320050}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "Overall, a good stay and would recommend this hotel. It is not luxurious, but it is well located, clean and comfortable.", "title": "Better than expected - much improved since my last visit", "helpfulness": 1, "user": "ec92", "date": "October 24, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 10295594, "likes": {"liked": "— Huge 2BD/2BA suite!", "disliked": "— Never saw a list of activites or the spa menu?"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "This was our 4th time back (in 20 years). We came first to a conference as a couple. We've been returning to that conference every few years as our kids grew. The Tradewinds has always been a great escape. The first pull is the fairly warm winter weather (it's never quite as warm as Hawaii or Mexico, though). The resort is a great spot with 4 pools, the beach and the gulf. We've graduated from the paddleboats to swimming pools to jetskis and parasailing. So there was always plenty for kids from 2 to 12, and perhaps a bit older.", "title": "Always a great escape", "helpfulness": 2, "user": "MikeyBikey", "date": "April 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127415268}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "The resort is large, generally well-maintained (a nice recent makeover). It is a guaranteed fun time for anyone with kids. They are bound to meet other kids to hang with. And the Tradewinds has always been a reasonable value. So I would definitely recommend the place.", "title": "Just right for a girl's weekend", "user": "KMC-NC", "date": "April 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127328063}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "We have been opting for the larger suites which give us a little kitchen for breakfast and we have a living room to spread out in. It is in a decent enough location (30 minutes from Tampa Airport). This last trip we did some off-site activities (several off-site restaurants, saw Winter at Clearwater Aquarium, and saw the Dali Museum). But we we always happy to return to the Tradewinds for their pools and beach.", "title": "Blissful Spring Vacation", "helpfulness": 1, "user": "carahm", "date": "April 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127317246}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Perhaps the only limitation is that dining here isn't high end, but it is reliably good. The Italian place on site is good. But there are a couple nicer places to eat within walking distance (Don Gaspar and Cafe Luna), as well as some great places in St. Pete.", "title": "One of my Favorites", "helpfulness": 2, "user": "sandm4", "date": "April 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127309578}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Really impressed with this property! For the price, location and amenities...just right. Went for a girl's long weekend and we were pleased with the level of service, quality of resort and friendliness of staff. We constantly saw staff cleaning up and everyone greeted us as we went around resort - amazing what offering a smile does when greeting people too! Enjoyed the cabana chairs and the water was blue, clear and amazing...did not know it was basically to your waist for quite a distance out...so nice. If you cannot make it to the Caribbean - this resort and location will make you feel like you are...gorgeous sand, sun and sea! We ate at the resort and off the resort - all restaurants walking distance..enjoyed Salty's Beach Bar at the resort too - great bar staff! Favorites on resort would be the Awakenings Coffee for our morning Starbucks fix, Flying Bridge for lunch al fresco next to paddle boat lagoon, and Bermudas..off resort we especially enjoyed Agave's, Skidder's and Sea Critters (not walking but short drive from resort).", "title": "Very pricey!!!", "helpfulness": 1, "user": "Jackie G", "date": "April 5, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 127273494}, {"rating": 3.0, "stay_parameters": "Stayed March 2012", "text": "The hotel room is nice but there was no balcony just a window view of the ocean. The hotel has many separate buildings making it hard to find your way around. Drinks are expensive. Staff is friendly and helpful. They have 5 pools but very small. Beach cabanas are great", "title": "Nice rooms but the hotel layout is a big puzzle", "helpfulness": 3, "user": "Exquisitey", "date": "March 31, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 127018258}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "We brought the whole family to the resort for Spring Break. The Hotel I must say had the same feel as a resort in Mexico or the Bahamas with just as many amenities. The beach was awesome and was very flat and it was very even when walking out into the ocean. There were plenty of things to do and many very good restraunts that were very convienient. The elevators were very slow and we utilized the stairs when we could. Housekeeping was a little slow in tidying the rooms because they would concentrate on getting the rooms of checked out guests cleaned first. We loved the barcrawl tshirts which is something you obtain by drinking an adult beverage at one of the five bars located on the resort property. The drinks were reaonably priced and not watered down and I must say the exotic drinks were some of the best I have ever had. We had a two room suite which we wished would have been a little bigger but it was acceptable. The balcony was very narrow and the deck chairs could only sit sideways so that was a disappointment. We did not spend a lot of time in the room because of all of the activities and things we were doing so it really wasn't that big of a deal. The resort was really crowded but we never had difficulty finding loungers,cabanas, or even getting into the pools. When we did eat at the resort, there were not long waits to be seated and the food was good but a little pricy. The water activities and Kids Club were also a bit pricy. I must say I did a lot of research on the resorts in Florida and the reason we picked the Tradewinds was for the KONK club. We were not impressed and in fact it was our biggest disappointment. The staff were not familiar with the activities and they were in some cases very cheesy. We had a 5, 6 and 10 year old. We checked into the video game activity but the staff were unfamiliar with the gaming system they had, what games they could play, or even what an evening of video games looked like so we could get some type of picture of the activity before we paid $30.00 to attend. We participated in the tie dye tshirt activity which was not coordinated very well. There were two staff for 15 kids and there were no protectors for the kids and they had dye everywhere. My kids had to sit and wait for a long time because of the lack of staff assistance. We participated in a candy activity where the kids filled tubes of candy with colored sugar. It was over within 5 minutes and there was no interaction with the kids by the staff. We participated in an ice cream pop activity. Our children were the only kids who attended. The ice cream was melted and to soft to put on a stick so they plopped it on little plates and told the kids to put thier toppings on it and eat it but they didn't have spoons. They handed the kids tounge depressors and told the kids they would have to use them to eat the ice cream. The staff member looked all over the kids club for spoons but couldn;'t find any. Eventually the melting ice cream was disposed of in the trash because it could not be eaten without a spoon. We were going to attend the sea glass jewelry activity but when I stopped over to ask the staff what the beads looked like to see if it would even be worth it, the staff member did not know where the glass was and did not even know what the activity entailed. Our final and last go at the activities was feeding the fish. We thought it would include something fun and exciting but my kids were horribly disappointed when they found out it consisted of throwing some fish food in the fish tank in the KONK club and they couldn't even reach it so the staff had to do it. We just decided the activities cost to much for the quality of the program and decided not to attend any more. We will definitely return and recommend the resort to other family members!!!", "title": "Spring Break 2012 Family Vacation", "helpfulness": 3, "user": "stephanie j", "date": "March 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 126944105}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We had an outstanding experience at the TradeWinds Resort. We had a great room with a balcony. The staff was very friendly, and helpful. We never left the resort, except to go for a walk on the beach. We really enjoyed all the restraurants, and bars. We really liked Beef O Brady's the food was excellent, and the service was outstanding. Trade Winds is the Perfect place to go and relax. It was a great beach vacation. We will be back every year.", "title": "Best Resort in St. Petes", "user": "Patty R", "date": "March 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126943418}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "This is an excellent resort. We had a great time and will be back again many times I am sure.", "title": "Florida Vacation", "user": "Marshall C B", "date": "March 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126921849}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "The staff is amazing and ever so friendly!! Bell hop (door man) Albert took care of my family as soon as we arrived at Tradewinds Island Grand. Checking in was a breeze, the front desk was so helpful. We stayed in the pool side suite which was amazing and our 2 1/2 year old daughter was in haven with the pool just out side the sliding glass door. Rooms were very clean and beautiful. Tropical music playing outside really puts you in vacation mode. The Rum Rumrunner drink (adult) @ salts beach bar is haven in cup. A must try is Bermudas Steak and Seafood! Upscale casual dining restaurant and very kid friendly. My husband had the chef cut Ribeye, I had the crab stuffed lobster, and my daughter had the kiddo cheese burger. The service was great! our server noticed my daughter was restless and hungry and he brought her meal asap!!! A step above and beyond. When served our meals my hobby and I were amazed! and tasted so much better then they look. Top quality food! I actually took a picture of my dinner...tee hee. Tradewinds Island Grand does it right, and has thought of everything to insure a perfect beach vacation. Thank you tradewinds Island Grand we will be back next year.", "title": "Best vacation ever!!!!!!!!!!!!!", "user": "JillpahoskiTungl", "date": "March 28, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 126873114}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Stayed 4 nights in a 2 bedroom suite with my wife and daughters. We loved the common areas of the resort from the pools to the beach but the rooms could definitely use some updating. The balcony was very small and the kitchenette was miniscule. However, the convenience of good on-site dining plus fun bars and a great kids camp/activities schedule would make me come back again. We had previously stayed at the Don Cesar but Tradewinds has the family experience nailed down! The beach was beautiful and the water was calm. Great for morning sea-shelling but watch out for stingrays as we scared a few of them by rushing into the ocean. A school of dolphins joined us at the buoy on our last day. What a treat!", "title": "Nice Family Hotel", "helpfulness": 5, "user": "bigblueinflorida", "date": "September 7, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 8673358, "likes": {"liked": "— Beach!", "disliked": "— Quality of room furnishings/overall feel of rooms"}}, {"rating": 5.0, "title": "Best Place to stay on the West Coast of Florida", "text": "This is the seventh year our group has met at the TradeWinds Island Resort. Each year the staff and management go over board to accomidate each and every guest. The friendlyness of the staff just make you feel that you are visiting neighbors. All of the facilities are 1st Class. It is good to be recognized by by your first name when you meet the bartenders at the Tiki Bar and the waitresses in the Flying Bridge. The rooms are more than adequate, clean and always attended to when needed. The turn down service in the evenings is nice but the chocolates on the pillowcase are an extra treat. Service at the TradeWinds is hard to match and I travel extensively throughout the year and look forward to our meeting in August to again visit my new \"neighborhood\".", "helpfulness": 2, "user": "Bongo52", "date": "September 5, 2007", "id": 8660987}, {"rating": 4.0, "title": "Lots of Family Fun on the Beach", "text": "We visited the Tradewinds Resort in July. We treated my Grandma for her birthday. We were joined by my Mom and my three-year-old son, so we had most age categories covered! We stayed at the Island Grand. When we first arrived, we were disappointed. There was a large convention being held at the hotel, and they allowed the lobby to be converted into a trade show full of exhibits. In all of my travels, I've never really seen this before. Usually, conventions are held in private rooms or sections of the hotel, but not first thing when you enter. Perhaps it was great if you were part of the group, but not exactly the vacation escape that we were hoping for. We arrived around 2 pm, and we waited for atleast 45 minutes to check in.", "helpfulness": 7, "user": "SunDollyOz", "date": "September 3, 2007", "id": 8614985}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "ROOM:", "title": "We loved it and wonderful for pets!!!", "helpfulness": 6, "user": "HeatherSand", "date": "August 25, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 5.0, "value": 4.0, "rooms": 5.0}, "id": 8504020, "likes": {"liked": "— Cheerful, colorful and fun", "disliked": "— The parking availability is deplorable. The roped of a huge section for valet parking and it was hardly used. Very dificult to find a spot on your own."}}, {"rating": 3.0, "title": "Had better value for money", "text": "We had a room on the seventh floor with an ocean view. Once we stepped out of the lobby building, I felt much better. The resort is large, so it didn't have the crowded, frantic feel that we first encountered. The room was very clean and newly decorated. The colors were bright and tropical. You entered through the bedroom with 2 double beds into the living area with kitchen, dining table and sofa. You can actually stand on the \"balcony\" and perhaps fit a chair sideways, but it is not a full balcony. The view was gorgeous. The white sand and blue waters were beautiful. I grew up in this area, but I never get tired of it.", "helpfulness": 2, "user": "Tonacy", "date": "August 23, 2007", "id": 8484055}, {"rating": 5.0, "title": "This was a Vacation...not time away!", "text": "We stayed for 8 days at the Tradewinds Grand in St. Pete Beach, Florida. We had a two bedroom suite with kitchenette facing the Gulf of Mexico. We had never stayed in a resort/motel before and it was a real experience, especially for my 83 year old mother-in-law who couldn't believe someone would clean your room, make the beds daily for you and even wash your dishes that were in the sink. Their employees were excellent and more than willing to help us or guide us somewhere. There were also employees walking around asking us if we needed something even when we were just walking around the grounds. They had planned activities for children that our two grandchildren (6 & 7) really enjoyed and it gave us a break to be adults. Altogether it made a very memorable vacation for all of us. We truly believe you get what you pay for, and this was no exception. We came back feeling like we had had a vacation, not feeling like we needed a vacation from being on vacation. The sunsets were phenomenal and the Tradewinds grounds were just beautiful as well and kept up very nicely. All of the different kinds of floral plants and trees were a real treat to view. We got some really nice family pictures with backgrounds you only see on picture postcards. We hope to return next year as we really liked the area and really enjoyed ourselves as a family.", "helpfulness": 1, "user": "FVHTN", "date": "October 21, 2007", "id": 10193885}, {"rating": 5.0, "title": "Most RELAXING Vacation ever....", "text": "We Had the most enjoyable stay at the Sandpiper Resort in Sept. of this year. Beautiful white sand beaches, 4 star room and very friendly and courteous staff. The room was very clean with a kitchen and living room area overlooking the beach pool and the Gulf of Mexico.", "user": "jchiefsfan", "date": "October 21, 2007", "id": 10193102}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "I would highly recommend this resort as I will stay there again for sure!", "title": "Nice hotel on beach", "helpfulness": 1, "user": "SilverSpring11", "date": "October 12, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 10071202}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Nice hotel on the beach. Plus: clean rooms, many activities included in resort fee, hotel on beach.", "title": "best beach around", "helpfulness": 4, "user": "dobergirl", "date": "September 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10004764, "likes": {"liked": "— beach", "disliked": "— convention"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Negatives: if you aren't going to do a lot at the hotel resort fee is high at $25/day. Pools small (but big beach), rooms a bit small and walls a bit thin.", "title": "Something For Everyone", "helpfulness": 7, "user": "jw1054", "date": "September 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8682712, "likes": {"liked": "— the variety of options for things to do", "disliked": "— hot water sometimes did not work correctly"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "My 16 year old daughter and I were very disappointed with our stay at TradeWinds. I had a bad feeling at check-in when we were hackled by conference men in the lobby. We experienced the same treatment from swingers while walking to the beach through the outside bar area (which is the main thoroughfare)and from hotel construction workers. We had a standard room facing parking lot and could hear EVERYONE walking past and carrying on to 4 AM on exterior hallways. Housekeepers monopolize elevators and won't even smile or greet guests.Our room was decorated in dark colors,yucky carpet, a small window that if you opened curtain for light everyone could peek in. Turned on TV and it instructed us how to order porn..Really? We checked out early, moved down to the Grand Plaza Hotel. For less money we got a room with a balcony (all rooms have them), tiled room that was done in light airy colors, a gorgeous view of the Gulf and piece of mind! NO ONE bothered us and all we heard at night was the waves thru the doorwall.", "title": "great for party people...not me", "helpfulness": 2, "user": "siestamom", "date": "April 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 127159552}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Thus was by far one of the better vacations I have been on in past few years. The staff was very nice and helpful and the hotel and grounds were spotless", "title": "Awesome Vacation", "user": "Richard H", "date": "April 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127140675}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Tradewinds is amazing!!!!!! We have been going for the last 13 years and it's always wonderful for my family and friends. Over the years it continues to improve with extra childrens activites and remodeling. The kids are so busy they don't want to leave the resort. They played kinnect beachside, watched movies poolside, did numerous activites at the kids club, bounced on the bungee trampolines, did paddleboats, won hula contests, played cards in the pool with staff, played bingo, got their hair braided beachside, did parasailing, waverunners and made beach sandcastles, and attended the pirate shows and made shark tooth necklaces with Redbread the pirate, and their favorite is the 3 story inflatable slide on the beach and newest addition the ocean waterpark. They picked this again over Atlantis in the Bahamas, they said theres more to do!!! You will LOVE this childrens haven!!!!!!", "title": "Paradise for all!!!!!!!!!!!!!!!!!", "helpfulness": 1, "user": "Kim F", "date": "April 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127116640}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "Our family had the best vacation, we loved Tradewinds Island Grand Resort,", "title": "An excellent place to stay!!", "user": "Tlb461", "date": "April 1, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 127104308}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "On beautiful St. Pete's beach, Fl. The rooms were very nice, and were kept very clean, excellent service! The restaurants were the best, with very good food! Loved the on sight shops, fitness center, mini golf, peddle boats,", "title": "Very Pleasant Stay.....", "helpfulness": 1, "user": "Jeter611", "date": "April 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 127077032}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Tradewinds Island Grand is EASILY your best beach vacation you will have. If you find this resort coming up for a decent price, stop looking, stop researching and BOOK THIS SPOT before prices go up. My wife and I and our 2 year old toddler just back from spending a week there. This was our second visit, and it was even better than the last one. We've been to 5 star Cuba, and 4 star Barbados in our past, and I must say on every account this was a superior vacation, I will highlight why below.", "title": "Slice Of Paradise", "helpfulness": 3, "user": "SunDogToronto", "date": "April 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127268931}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "BEACH: The beach is spectacular. Firstly, It is extremely wide and seems to go on forever spanning multiple resorts and condos. It is well groomed and maintained white sand. The water is within the Gulf of Mexico, so the waves are not as choppy and easy for anyone to wade into at most times. The sunsets perfectly behind the ocean as this resort is on the west side of Florida. In a word, spectacular.", "title": "Gorgus resort", "user": "beckconnie", "date": "April 3, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 127192065}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "STAFF: All the staff are so friendly and helpful. When they say they will do something for you they actually do it right away. During our Caribbean trips, they all reassure you that they are working on whatever you asked for, but they work at a snail's pace.. From the bell men, to front desk, to the cleaning staff, just the best.", "title": "A Fun Family Beach Property", "user": "KR0703", "date": "April 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 127188934}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "FOOD: Maybe because its not all inclusive is why the restaurants on site actually care and serve spectacular food. I believe its very difficult to have great food at any all-inclusive. There are many options to eat off the resort as well, so I suppose they know that and try to make an amazing dining experience. We ate at the fine dining Palm Court, and while pricey, and perfectly cooked/seasoned NY strip. We also ate at Bermuda's and had amazing fish tacos, and one of the best burgers I have ever had. We ate dinners normally at 9:00-9:30 and food quality seemed to always be fantastic no matter what time we ate.", "title": "Absolutely LOVE this place. We stay there every year.", "user": "Chris_Pedersen_417", "date": "April 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127186205}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "POOLS: There are 4 pools, one of which are adults only. The kids area near the supervised kids area, has a kiddy wading pool perfect for our little one. If your child is 4+ there are incredible supervised activities for them, so mom and dad can enjoy a little r & r on the beach with a cocktail or two.", "title": "TradeWinds is the best!", "user": "carynallen", "date": "April 3, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 127183587}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "My family and I had the pleasure of staying at TradeWinds Island Grand Resort on Oct. 6th thru Oct. 8th, 2007. The resort is absolutely beautiful. Everybody that was employed at this property was very friendly and helpful. The resort has everything a person could ever want. It would be possible to fly in to tampa, take a shuttle to TradeWinds and never leave. The beach is just beautiful! One morning I got up with my daughters and went out on the beach and was looking for shells. We heard some people talking about something out in the water. We looked, and a group of dolpins had come up pretty close to the waters edge to feed. What an experience. And if you go to TradeWinds, the best place to lay and relax is in the hammock where the live web cam is. My husband laid in the hammock and talked to his brother here in oklahoma while his brother watched us play in the sand on the web cam. This resort goes over and above any place i have ever stayed. I would highly recommend that everyone stay at this resort. You won't be disappointed. It was my first stay, but it won't be my last! The view from our balcony was so pretty and relaxing. Every night we would sit out on the balcony and listen to the live music from the tavern on the property. It was a very relaxing trip. There are several pools to choose from. You can paddle boat. This resort even has beach toys if you choose to build sand castles. Everything has been thought of. Give this resort a stay.", "title": "TradeWinds Island Grand is AWESOME!!!!!!", "user": "skchannel", "date": "October 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10294736, "likes": {"liked": "— The room was super nice. But oh the property was just beautiful.", "disliked": "— The parking. It was sometimes hard to find a place to park in the limited parking area."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "For more than 30 years we have been fortunate to visit the beautifully preserved St. Pete area several times throughout each year, staying at a relative’s condo or various resorts. The TW exemplifies resort hospitality at its finest. The environment holds your interest, the accommodations are impeccable, and the staff are friendly and professionally responsive to your every need. Our 10-day stay in a Tropical View, One Bedroom, with Balcony provided the space and comfort we sought; decorum and furnishings were tasteful, comfortable, and clean. The TW amenities, dining options, and myriad activities include something for everyone—couples and families! Simply put, the TW pays attention to detail, and that is a huge undertaking considering the resort size—its gardens and grounds, pools, and gulf beachfront property. In striving for excellence, the TW artfully and skillfully executes welcomed extra special efforts that make each guest feel “Grand!”", "title": "The TradeWinds Island Grand is \"GRAND\"", "user": "skchannel", "date": "October 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10291826, "likes": {"liked": "— The room was super nice. But oh the property was just beautiful.", "disliked": "— The parking. It was sometimes hard to find a place to park in the limited parking area."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "[--]", "title": "Can't wait to return", "user": "FenwickIslandBound", "date": "October 23, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10266196, "likes": {"liked": "— Absolutely beautiful location"}}, {"rating": 5.0, "title": "very nice", "text": "My husband and I stayed here for 3 nights. We wish we had booked a longer stay. The staff was helpful.Housekeeping did a wonderful job. We booked a tropical view room . We had a view of the paddle boats, a pool and the gulf----lovely!", "user": "PAULBOUNDS", "date": "October 23, 2007", "id": 10263149}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "For those that complain about the prices there are options. A Publix grocery store is very close by and the room has a microwave, coffeepot and refrigerator. We grabbed yogurt , muffins and fruit salad at the store-breakfast! The resort has a small store that stocks bread and various sandwich items, baked goods ,cereal etc.----you could easily save money on breakfast and lunch. As for the stocked mini bar in the room---teach your kids the meaning of the word NO . We ate at the Flying Bridge restaurant on premises--service was terrific-good food--prices were fair.", "title": "Beautifull gulf side view", "user": "lyndasbabyland", "date": "October 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10234486, "likes": {"liked": "— enemities"}}], "location": {"country": "United States", "city": "Saint Pete Beach"}, "stars": 4, "variance": {"poor": 205, "average": 292, "very good": 644, "terrible": 145, "excellent": 1611}, "aka": "Tradewinds Island Grand Beach Hotel Saint Pete Beach", "slim_ranking": 0.266666666667, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "TradeWinds Island Grand, on the Gulf of Mexico, is located directly on the white sand beaches of St. Pete Beach — voted the No. 1 beach destination in the U.S. by TripAdvisor's 2012 Travelers' Choice Award — and is certified as a Florida Green Lodge. Our recent $20 million renovation included our lobby as well as all 585 guestrooms and suites. Located just 30 minutes from Tampa International Airport, Island Grand offers a variety of recreation activities including JetLev flight center, motorized surfboards, Splash Island Waterpark, children’s programs, paddleboats, tennis, a 3-story tall inflatable waterslide and more. Lounge next to one of our 5 heated pools or sip on your favorite libation at Salty's Poolside Beach Bar. This beachfront setting has a hint of the Island tropics and offers a beach vacation where you run out of vacation before you run out of things to do. All you have to do is pack your things — we’ll pack your stay."}