{"user_rating": 4.0, "review_count": 156, "name": "Traders Hotel Puteri Harbour", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2014, traveled with family", "text": "The hotel is next door to Hello Kitty Town and has a free shuttle bus to LEGOLAND which is about 10 min away. There are regular tour buses from Singapore that stop at the Hello Kitty Town and LEGOLAND. The hotel is large with 3 building blocks which are connected through walkways on every floor. The room is standard size and the facilities are ok. There are quite some shops on the ground floor - restaurants, Starbucks, drugstores etc. It seems more are to open in the future. A 7-11 type convenience store is next to the entrance. We bought some sandwiches and cakes from the hotel's own shop on the ground floor. The harbor view from the swimming pool area on the top level (4th floor) is quite nice, and the area around the harbor is spacious and walkable. The staff is all courteous and helpful, although some might have limited language skills.There is not much around the area (a few buildings that are still being constructed) and most guests come for the theme parks, but the hotel is a perfect place for relaxation too.", "title": "Convenient and spacious", "user": "lizzylizzy", "date": "January 4, 2014", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 189638937}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "Enjoy my stay in this chic hotel. Go try it. Eateries are coming up there even though the development is not totally completed. Try Legoland and Hello Kitty Town since they are so near. Prepare to wait a while when eating out as service can be short handed during peak timings.", "title": "Awesome Stay", "user": "Joe A", "date": "January 2, 2014", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 189319675}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "If your trip plan to kitty world and legoland this is the best hotel recommended. Same compound with kitty world and just 10 minutes to legolandand they provide the shuttle from hotel. A lot of eating place here and good bars.", "title": "nice place", "user": "Obed031", "date": "January 2, 2014", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 189311790}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "hotel room is spacious and clean and modern. they have a sofa bed which can be converted to a sleeping bed at night which is good for my husband as I hve 2 young kids sleeping and sharing the same bed.", "title": "trader hotel puterin harbur", "user": "Maydianne Y", "date": "January 1, 2014", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 189275700}, {"rating": 1.0, "stay_parameters": "Stayed December 2013, traveled with friends", "text": "Given its distance to Singapore, I think Traders Hotel Puteri Harbour is a great place to stay if you are visiting Legoland, JPO, or the neighbouring Hello Kitty Town. For me, I choose THPH to unwind, and stayed 3 times in 2 months. The visits were not very pleasant though.", "title": "5-star hotel, 1-star service/facilities", "user": "zac_koh", "date": "January 1, 2014", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 4.0, "rooms": 1.0, "location": 3.0}, "id": 189237875}], "location": {"country": "Malaysia", "continent": "Asia"}, "stars": 4, "variance": {"poor": 6, "average": 18, "very good": 60, "terrible": 7, "excellent": 65}, "slim_ranking": 0.0263157894737, "description": "Opened on 1 June 2013, Traders Hotel, Puteri Harbour, Johor, Malaysia is a contemporary deluxe city hotel located in Nusajaya, Johor. It offers 283 guestrooms and suites with complimentary broadband and Wi-Fi, spacious bathrooms and other modern facilities. The hotel’s close proximity to family theme parks (LEGOLAND ® Malaysia and Puteri Harbour Family Theme Park) and its exciting food and beverage outlets as well as elegant meeting and event facilities will please today's savvy and passionate travellers."}