{"user_rating": 5.0, "review_count": 56, "name": "Tranquilo Bay", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "We visited Tranquilo Bay in March with another family and would recommend it to other adventure loving families. Although Tranquilo Bay is remote and minimalistic, it is well designed and not rustic. It is a location for families that like to explore and be active. It is not suited for the sit by the pool and drink mai tai crowd.", "title": "Great small family get away", "helpfulness": 4, "user": "lwohara", "date": "May 17, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 16137345, "likes": {"liked": "— REmote location", "disliked": "— lack of beach or pool"}}, {"rating": 5.0, "title": "Can't Get any Better than Tranquilo Baqy", "text": "The positives: We loved the remote location that is accessible by boat. One of the highlights of the day was riding home in the afternoon after a side trip and enjoying the breeze and views. The day trips were enjoyable and well planned and gave us a unique opportunity to be with some of the native Indian tribes. We felt safe and comfortable and the owners had a nice relationship with the locals. The land is still unspoiled and it is a unique opportunity to be in the \"middle of nowhere\" with amazing views and scenery.", "user": "Starman01", "date": "April 20, 2008", "id": 15171593}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "The food was very good and surprisingly varied given the remote location of the lodge. The food was appealing to both adults and children and they accomodated our daughter's request to not eat fish.", "title": "Exceeded Our High Expectations!", "helpfulness": 1, "user": "LaurieToronto", "date": "January 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12620378, "likes": {"liked": "— The staff", "disliked": "— Going home after the vacation was done"}}, {"rating": 5.0, "title": "amazing eco lodge in paradise", "text": "The rooms were spacious and well cooled with the air condtioners running. They look out on to a beautiful lawn with a view of the ocean. Every room was its own individual bungalow so neighboring noise was not a problem. It is a buggy area and bug spray is a must after 5 pm but it was not anthing that hindered our trip. The sun is very, very strong so excellent sunscreen is the most important thing to pack in your bag. The owners graciously loaned us the ultimate sunscreen and it saved us from future sunburns. We had very nice weather and only half of a day of rain. Do not believe the weather forecast that says it rains everyday!", "helpfulness": 1, "user": "kerryNewYork", "date": "January 8, 2008", "id": 12444368}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Negatives: This resort is a family resort run by families so if you are not interested in interacting with children or other families, it is not the right spot for you. The young owners were very friendly and my children loved being with them. However, every cocktail hour and meal is spent with them in one communal dining hall. If you want privacy and a spot to relax with your cocktail, you have to be in your room.", "title": "Incredible comfort in the middle of the jungle", "user": "trace217", "date": "January 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12394067, "likes": {"liked": "— beautiful location", "disliked": "— limited options for eating"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We enjoyed our stay at Tranquilo, surrounded by the jungle and rain forest, with a very nice cabin/villa set in verdant gardens. The owners have created a splendid place - much with their own sweat and toil - and obviously enjoy all that they do.", "title": "FOUR TRANQUIL DAYS........", "user": "davidfisher", "date": "February 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125050829}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Pick up at the airport, and a 25 minute boat ride to Tranquilo and suddenly you're there - walking through the mangroves up to the main building where a cold beer and warm welcome awaits you.", "title": "The perfect private island!", "helpfulness": 1, "user": "djaba", "date": "January 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122949539}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "The two resident naturalists, Ramon and Natalia, are great enthusiasts - and I was especially grateful when Natalia rescued me following over enthusiastic paddling, I managed to overturn mid-ocean!", "title": "Awesome fun fantastic vacation!", "helpfulness": 1, "user": "Mary B", "date": "January 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122850308}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "A great place - perhaps our main constructive suggestion would be placing some benches around the large gardens so guests could more easily quietly enjoy seeing and hearing the birds and the extraordinary three toed sloths.", "title": "Paradise found off the beaten path.", "helpfulness": 1, "user": "Jami H", "date": "December 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122045948}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We have found what might be one of the few remaining Shangri-La's in the world. Tranquilo Bay is just such a place.....few people, no roads, and no TV. This plush island is an unbelievable place to spend the morning or afternoon absorbing nature at its best. Birdwatching is awesome here! You can also snorkel, kayak, swim or just explore the amazing flora and fauna.The owners were helpful, friendly and hospitable and their bright and well-behaved children were delightful. Our guide Ramon was extremely knowledgable, but most of all, he had genuine warmth and real dedication to preserving the local ecology. He was a pleasure to be with. All in all, it was an enjoyable and exciting vacation.", "title": "Our Second Visit to Tranquilo Bay", "helpfulness": 2, "user": "reigns", "date": "July 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115285585}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We are lucky enough to have visited a number of eco resorts around the world, especially in Africa. We were very impressed with Tranquilo Bay, when we stayed for four days in January. The rooms, service, activities were all first class. I really recommend a boat trip and day at the beach at Zapatilla Cayes. I also fell in love with Fula, the lab, she is a real sweetie. Many thanks to Renee, Jim Jay, Stephanie and Natalia for sharing your paradise with us.", "title": "Wonderful Time at Tranquilo Bay", "user": "globalsafari", "date": "January 31, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54806827}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Tranquilo bay is located in the rain forest overlooking the ocean. The pictures definitely do not do it justice; the rooms and views are much better in person. The staff go out of their way to make your stay memorable. They are very knowledgeable about local culture and the natural wonders that surround the area. This place is a true gem, and the people who run it are truly exceptional.", "title": "lovely place with excellent service and attention to detail", "user": "surgeon71", "date": "December 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50717719}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "This is a one-of-kind experience on an island that is 30 minutes by boat from the mainland. Close to adjacent islands that are somewhat developed, but why leave paradise?", "title": "Oasis . Adventure. Luxury.", "user": "DebbieWotiz", "date": "September 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 40711734}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Owners/Developers of property tend to every detail including a robust greeting by the family labradors, private lodgings that are comfortable and appointed perfectly, meals that are a fusion of American style with Panamaniam influence and a passion of knowledge about the island, the wildlife, Panama itself and the ocean that lies beyond this amazing property. Be prepared for a muddy hike around the property (it is a rain forest,, bring hiking shoes or trail runners) and an open boat ride with a center console and a canopy, but no head . Bring rain gear if the season demands it and come with an appetitie for homemade bread, desserts and great company with staff and family.", "title": "Tranquilo Bay is amazing!", "helpfulness": 1, "user": "Miller12346", "date": "March 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26461201}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "My wife and I have traveled to many foreign countries together, and this is (by far) one of the most amazing places we have ever been. The wonderful staff, the beautiful natural surroundings, and the comfortable accomodations make Tranquilo Bay an incredible place to visit. We would live there if we could.", "title": "An excellent all-inclusive eco-adventure resort", "user": "ebpett", "date": "March 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 26132291}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "My husband and I spent seven heavenly days and nights at Tranquilo Bay 16-23 April. I must say, it was absolutely one of our most memorable vacations ever!", "title": "BEYOND PERFECTION", "helpfulness": 4, "user": "Jeanne-Chiarmonte", "date": "May 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106908528}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "I began corresponding with Renee in May 2010. She was so kind and patient in her e-mails . I had alot of questions for her and she was so helpful .I think she knew immediately by my explanation of the type of travel we enjoyed that we would be a good fit for Tranquilo Bay.", "title": "Superb Ecolodge!!!", "helpfulness": 3, "user": "FayFay908", "date": "February 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97130335}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "As soon as we confirmed our reservation, Renee sent us a questionnaire about the types of food we preferred. I am a very picky eater (Renee will confirm this!!). I was allowed to express our likes and dislikes. One can also report if on a special diet, has a gluten intolerence, etc.", "title": "SUPER ECO ADVENTURE HUB", "helpfulness": 2, "user": "Wold", "date": "November 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 86302902}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "We flew from Buffalo to JFK. On Saturday, we flew Taca JFK to San Jose, Costa Rica, and then on to Panama City Tocumen. A private transfer is provided by Tranquilo Bay to Panama/Albrook, We then flew to Bocas Del Toro and were transferred by boat to the resort.", "title": "The Utimate Vacation", "helpfulness": 1, "user": "reigns", "date": "April 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61040766}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "In Bocas, we were greeted by Jim,Renee's husband. One of the resident guide, Natalias was with us. The boat ride was wonderful!", "title": "Just Perfect", "helpfulness": 2, "user": "MinusThirty", "date": "April 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60814392}], "location": {"country": "Panama", "continent": "Central America"}, "variance": {"poor": 0, "average": 0, "very good": 1, "terrible": 0, "excellent": 55}, "aka": "Tranquilo Bay Hotel Isla Bastimentos", "slim_ranking": 0.214285714286, "description": "Tranquilo Bay is a deluxe lodge providing comfort and adventure in the jungle. Our packages include activities, delicious meals, beverages, transportation and very comfortable accommodations. Contact us directly for reservations."}