{"user_rating": 2.0, "review_count": 129, "name": "Travelodge Ft. Lauderdale", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed June 2006", "text": "worst hotel i have EVER stayed in by far! and thats saying something!", "title": "dont even go there girlfriend!", "helpfulness": 1, "user": "qprjames", "date": "July 5, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 5429136}, {"rating": 1.0, "stay_parameters": "Stayed April 2006", "text": "do not stay in this dump whatever u do. funnily enough, the hotel right next door to this one which is just set back from the road is cheeper and much much better!", "title": "The absolute pits.........", "helpfulness": 4, "user": "5inavan", "date": "April 27, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 5013838}, {"rating": 1.0, "stay_parameters": "Stayed April 2006", "text": "A nightmare! If you could sleep. Besides worrying about safety, the conditions were atrocious! The bathroom door was delaminating, so any attempt at functioning was accompanied by a horrendous noise. There were cigarette burns everywhere (linens, sink, tub) in a non smoking unit, as well as cigarettes (unsmoked) under the bed. We had to push the beds together since the rollaway we requested months in advance wasn't provided, and noone slept. The poor cleaning was evident upon moving the beds. The traffic noise was terrible, and the a/c unit was struggling to provide comfort even in a not so warm weather situation. My family protested vehemently about spending the night, but given our travel plans, we arrived too late to modify them. I would never stay at this location again.", "title": "Horrible is too nice a word", "helpfulness": 5, "user": "ZarahL_8", "date": "April 20, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 4990838}, {"rating": 1.0, "title": "don't waist your hard earned money", "text": "Just about everything was broken in the room (including the a/c in Florida!) and water was leaking from above. The bathroom water came out brown even after running it. The place had a musty filthy smell. Worse yet were the ghetto people who seem to live here: blasting boom boxes and \"hanging out\" all night. The management office locks its door at night and who can blame them? Considering how shoddy this place it, the rates are no bargain. I paid before seeing the room and am not hard to please but almost screamed when I entered it- it was like someone tried to wreck it. Heed the sign \"NO REFUNDS\"", "helpfulness": 7, "user": "A TripAdvisor user", "date": "February 3, 2006", "id": 4412201}], "location": {"country": "United States", "city": "Fort Lauderdale"}, "stars": 2, "variance": {"poor": 24, "average": 31, "very good": 16, "terrible": 55, "excellent": 3}, "aka": "Travelodge Ft. Lauderdale Hotel Fort Lauderdale", "slim_ranking": 0.857142857143}