{"user_rating": 3.0, "review_count": 367, "name": "Travelodge Belfast City", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "Spot on location! Near to the bus station and lots of nice pubs (crown and robinsons) BUT it is noisy due to the pubs. The room itself was basic but you get what you pay for. The windows definately need to be replaced and it was very chilly and obviously that didn't help with the noisy pub goers outside. Would recommend it for friends and groups who want to be within the city centre and like pubs but probably not families or couples that need a good nights sleep!", "title": "perfect location but it is noisy!!", "user": "louthemoo", "date": "November 7, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 86300426}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "hotel was reasonably priced and clean, find your own parking spot on the street, as no parking is available on site, remembering that pay and display starts at 8.00 am.", "title": "noisy hotel", "user": "kingcheeseAustralia", "date": "October 31, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 2.0}, "id": 85447776}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "even though we were on the 4th floor the noise until 2.30am from the adjacent nightclubs kept you awake, then the garbage truck and street sweeper started at 5.00 am. so you only get about 2 hours sleep.", "title": "great location but rooms need urgent attention!", "user": "missesh", "date": "October 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 84813171}, {"rating": 1.0, "stay_parameters": "Stayed October 2010, traveled solo", "text": "I stayed here for one night with my husband and 3 young children - we are on a tight budget & we got an extremely cheap deal here. Im well aware that you get what you pay for, and on the plus side, the hotel is in the best possible location for exploring on foot. The staff were very friendly and knowledgeable & the place on the whole was very clean. However - we were put on the 7th floor (top) in a very small room that could barely sleep 2 comfortably never mind 4 and a cot. But I didnt even mind that - the problem was that the window were all open when we arrived and I immediately went to close them incase any of my inquisitive youngsters decided to explore. The reason they were open was that the locks were all broken and the windows were loose. So, I was terrified in case any of the kids went near them, most importantly but also it meant the street noise was much worse because the windows wouldnt close. Also, in the bathroom, the plugs were missing & the shower/tap knob came off in my hand. the latter two things werent really problems but they could be so easily fixed, in minutes - so why not just fix them? But the windows ??? Hardly slept a wink all night. That said, if I got the same great price & the problems were sorted, Id go back - its a clean bed in a great spot at a fab price. But I wouldnt pay the full rack rate - theres good deals around in better hotels.", "title": "NEVER AGAIN!!!!!!!!!", "helpfulness": 1, "user": "SCOOBY67FALKIRK", "date": "October 11, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 83059192}, {"rating": 2.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "well, stayed here for 1 night and now wish I hadn't, firstly it started off when i got into bed, felt a terrible draught from the window area , got up to have a wee look, turned out that the window didnt seem like it had been fitted properly, with this in mind it exacerbated the noise of the nightclub nearby, went down to speak to people on desk to see if i could get moved, he said unfortunately the hotel was full that night and couldnt go anywhere, instead told me to put towels round the window to kill draught/noise, bearing in mind that i had been up from 4am (sat morning), was still awake at 3pm on the sunday morning, just wasnt in the mood to argue, then sunday came and when i woke up happen to look up at the ceiling and lo and behold i had noticed a plastic bag wrapped around the smoke detector, wee while later i happened to take a plastic bag out of the rubbish bin to put my own rubbish into the bag, yep youve guessed the bucket hadnt been emptied, and finally fault no 4 the soap dish, was like something you see on kim and aggie, dried in soap with hairs.", "title": "Not a great hotel", "helpfulness": 1, "user": "spikydu1", "date": "October 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 83026081}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "i recently stayed in the belfast travelodge, i was staying with my good friends on a shopping weekend, first impressions on reception was very clean and welcoming. reception staff, seemed very willing to help. next getting into the lift i was very impressed, sweet smelling and once again, spotless. in my room, i have to admit alot of effort had went into the cleaning, there where a variety of little details that had went into it, such as the loo roll had been folded into a point, the pillow cases had been folded over at the top, the bin had been tied, it was a pleasure to see such effort, everywere was gleaming! and very nice smelling as said previously about reception. on the second day of my stay i got to meet the cleaner when coming to clean my room, and she was genuinely lovely, so helping and wanting to please me with everything that i might need. i late got into the lift with one of the staff, who carried a clip board with her, she was so pleasanly lovely and was filling me in about the new things that where going to be happened to the hotel to improve it further, i had a brilliant time and i wouldrecommend it to anyone", "title": "great stay, lovely rooms & hotel staff", "user": "jane776", "date": "September 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 81095827}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Given the location we were prepared for late-night noise. We overlooked a square and adjacent was Fibber Magee's pub/club. As expected, noise of live music on Friday and Saturday nights but quieter on Sunday and Monday. Our original room had a TV which was not working properly. We reported this and were moved to an adjacent room immediately. Don't bother with the hotel breakfast option - there are many cheaper choices within 5 minutes walk. The day ticket on the city buses is very good value if you want to get away from the city centre.", "title": "Basic accommodation, central location.", "user": "MerkinMaster", "date": "September 22, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 80552943}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "Usually I research my planned accommodation on Trip Advisor before travelling, but this was a last minute break. Bad move.", "title": "Wish I had done my homework before booking", "user": "Mikkaau", "date": "September 2, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 78007691}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "Unfortunately, although this hotel is very well located, it is the location which is it's downfall. Way too noisy at night, with live music from nearby bars into the early hours and this is followed by street sweepers and garbage trucks a little later. All makes for poor sleep quality.", "title": "Clean with excellent value for money.", "user": "p_delaney77", "date": "August 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 76564180}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "The cleanliness is the most concerning issue. The small garbage bin in my room had not been emptied prior to my arrival and I was horrified to see a used condom in it! In the bathroom a small amount of toothpaste had not been cleaned from the basin and despite the room being 'serviced' for me the next morning, the toothpaste remained. The bin, thankfully, was emptied after I mentioned it to the room attendant.", "title": "A good budget hotel", "user": "The_traveling_gypsy", "date": "August 13, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 75043117}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled solo", "text": "The hotel is located in city centre Belfast. It's conveniently located near public transport--many buses within a couple of street radius. There is a bar/restaurant across the street, and a restaurant connected to the hotel. The staff is helpful in arranging tours around Belfast. The rooms were ok, on the small side, but bed was good and new flatscreen tv. Wifi connection was good--about 10GBP per day. The main problem with the hotel is that it's very noisy in the area near the hotel until late at night(4am on Sat. nt, 1am on Sun nt.)", "title": "Decent Room, Loud Area", "user": "hkmny", "date": "July 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 1.0, "rooms": 3.0, "location": 2.0}, "id": 69662607}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "I stayed at the Hotel, for a nice long weekend with the girlies, we were pleasantly surprised how actually central the Hotel was, just a few mins walk to the bus and train station and to all the nightlife, just what we were after!! When we checked in, the room was a good size, basic but clean, bathroom cld have been slightly bigger tho!! Staff at the Hotel were so friendly and helpful and nothing was to much bother for them. Overall we had a fab time, and definately will be returning in the near future!!!", "title": "CHEAP & CHEERFUL", "user": "twilight186472", "date": "July 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 69565429}, {"rating": 2.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "I stayed at the Travelodge on 16th June prior to moving onto the Malone Lodges for a weekend wedding.", "title": "Crummy not yummy- simply bad-will not return!!", "user": "Rendell1980", "date": "June 26, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 68745777}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "Possibly the worst experience that I've had booking with late rooms. Having worked in similar hotels myself I was expecting high standards. First room had ripped and dirty carpets with fag burns and pee stains. Headboard off wall, dirty windows which were loose. Twin beds had smelly stained sheets and mattresses were stained with (?urine). Bathroom full of others hair and second hand soap left in a rusty soap dish. Massive amount of mildew, dirt and cobwebs found in shower area. Bare electrics exposed above sink with broken light. Toilet had skid marks in bowl and pee on seat. I found a used tampon left next to toilet.TV outdated broken buttons dirty/marked, Aerial socket off wall.", "title": "Excellent", "user": "Titch1872", "date": "June 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68425554}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Second room not much better, room musty and smelling of smoke, Couch stained and ripped, cigarette butts found underneath. Double bed had broken feet and damaged base. There were long dark hairs on sheets-we're both brown/ short haired. Carpets were still stained, with pits and folds-(?Secondhand-off cuts). Walls scored and dented. Faulty light switch in bathroom (strobe effect!). Holes in wall tiles. Handrail above bath loose-extremely unsafe. Again hair found in sink and bath. Old TV faulty, buzzing sound- dirty/dusty. No remote-come on!! this is the 21st century! Waste bin had old takeaway rubbish smells.", "title": "good value", "user": "HsiTing", "date": "June 22, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 68297426}, {"rating": 2.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "stayed for 3 nights; yes it was noisy - that was more from the recycling lorries at 4am than people! Not the biggest problem though; I had accidentally pre-paid for two breakfasts on the morning of the return flight; we had to leave the hotel at 5.30am. I asked what to do about claiming back the money and was told to keep the vouchers and contact Travelodge on my return, which I did. 2 months on and several emails sent (all of which have been opened) and I'm still waiting for a reply. it's not about the money it's the fact that they feel they can ignore you once you've paid and left! won't be staying at any Travelodge anywhere in the future.", "title": "I'm still waiting to be reimbursed!", "user": "wbrewin", "date": "August 13, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 75012306}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Have stayed in a number of travelodges because you know what you're getting. This one was slightly poorer than other travelodges in terms of cleanliness, but was still good value - was the cheapest hotel that i could find in belfast. The location was great. (few mins walk to city centre) Unfortunately, there's no parking or even discounted parking which can significantly add to the cost of a stay in belfast - especially if on a tight budget which is why you would stay in travelodge. There is a \"hostely\" feel to the hotel but it is comfortable. One negative point was the noise from the nearby bars at night, which are very close. Chances are that this would not be an issue as you will probably be out yourself, but there was no aircon in our room and we had to leave the window open. Belfast is a great city, by the way.", "title": "Great location. Accommodation basic.", "helpfulness": 1, "user": "formal6", "date": "July 27, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 72639496}, {"rating": 2.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "I have to laugh at some people these days....has everyone forgot that you actually do get what you pay for, if something is very cheap it is for a reason, the recession does not change that!", "title": "I won't complain because it was soo cheap!", "user": "SarahTwells", "date": "July 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 1.0, "value": 5.0, "sleep": 5.0, "rooms": 1.0, "location": 5.0}, "id": 72116350}, {"rating": 2.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "This hotel is in a great location - perfect for anyone who just needs a clean bed for the night.", "title": "Great Location in the Centre of the city", "user": "thewaterboy", "date": "July 15, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 71029353}, {"rating": 1.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "Stayed overnight at Belfast during a drive around Northern Ireland. The hotel was conveniently located, such that we could park the rental and walk down to the city centre. Parking is on the road however, but as it was Bank Holiday weekend, there was no parking fee enforced.", "title": "Stay here if you don't want to sleep", "user": "hayley101", "date": "July 13, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 4.0, "location": 5.0}, "id": 70709791}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "Belfast"}, "stars": 3, "variance": {"poor": 69, "average": 100, "very good": 89, "terrible": 64, "excellent": 45}, "aka": "Travelodge Belfast City Hotel", "slim_ranking": 0.772727272727, "description": "Travelodge Belfast is the ideal location to base yourself while working or visiting Belfast. The train and bus stations are across the road from the Travelodge, which features on all major routes. The universities of both Queens and Ulster Belfast are within a 10 minute walk. There is a vast array of restaurants, pubs and clubs locally."}