{"user_rating": 3.5, "review_count": 317, "name": "Travelodge Perth", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Stayed here 13-14 Nov 2011. Stayed on 9th Floor. There intermittent problems in the availability of water (&hot water too). Especially during my morning shower, the taps ran dry. There was no hot water and no cold water too. After waiting for many minutes, the trickle started again and I barely managed to clean up myself. This is not a pleasant experience, particularly during the busy morning period when I had some appointments and meetings to attend.", "title": "Good location, room facilities need improvement", "helpfulness": 1, "user": "jstmSingapore", "date": "November 19, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 120798664}, {"rating": 2.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Other than the lack of assured water supply, there were no other problems. The counter staff during my check out on 14 Nov was very helpful and even arranged to call a taxi for me.", "title": "Cheap and cheerful but not clean and a bit run down", "helpfulness": 1, "user": "JDE260767", "date": "November 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 1.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 120772435}, {"rating": 5.0, "stay_parameters": "Stayed November 2011", "text": "However, I will not stay there again due to the fear that I may be stuck in the shower without water!", "title": "Just the place I needed on a trip for work - good location too!", "helpfulness": 1, "user": "chinwag", "date": "November 11, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 120456117}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Service good and friendly. Rooms have good facilities but are not well cleaned (hairs in the bedding etc) and are a bit run down. Bed was old and sagging and creaked and carpet had stains, bathroom had mould. On the plus side, when the TV didn't work, they fixed it immediately after I reported it.", "title": "Value For Money", "helpfulness": 2, "user": "watertay", "date": "November 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 120360694}, {"rating": 3.0, "stay_parameters": "Stayed October 2011", "text": "Stayed here for 2 nights on a business trip. Rooms are very good, AC sockets are easy to access, the lighting is not bad either. Location was near enough to anything needed. It allowed me to rest as well as get extra work done.", "title": "Clean, good location, but very three star", "helpfulness": 4, "user": "nomi90", "date": "October 5, 2011", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 118958455}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "My husband and I stayed over for a mid-week getaway in Nov 2011 as we both had some time off work. We ended up eating at the Armada restaurant which is downstairs at the hotel 4 times in 3 days... it was that good! We're foodies and have been trying a different restaurant/cafe every week for abotu 2 years now, and this is now our favouriet place.", "title": "AMAZING FOOD! Best restaurant in a hotel hands down, & v.reasonable prices", "helpfulness": 2, "user": "lovecat", "date": "February 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124372917}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "The most impressive thing about this hotel is the quality and price of the food - I can pretty much guarantee that you won't find better quality food at such reasonable prices anywhere else in Perth (especially at hotels). My husband loved the Nasi Goreng and had it 3 times, and I had the special arancini balls which are different to the usual ones you get, they had hazel nuts and gorgonzola and proscuiotto. The chicken fahita (spelling?!) was delicious and the caesar salad was the best I've ever had bar none.", "title": "One of the better value hotels in Perth", "user": "WimK1234", "date": "January 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 123771167}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "As for the hotel is pretty good, definitely not luxury but adequate for a comfy and spacious place to stay. The check in staff are lovely and efficient, and the restaurant waiting staff are good. I would stay there again (mainly beacuse of the restaurant). The only thing is that the breakfast is pretty average, but it was thrown in with the room so can't really complain, since the rates are pretty good considering the usual Perth hotel prices!", "title": "Really good for our demands", "helpfulness": 1, "user": "Brita S", "date": "January 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 123549389}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Friendly service. Rooms weren't too bad. The breakfast was a bit pricey so we chose to avoid it and just go to the cafes near by. Gym facilities are good too.", "title": "great short stay", "user": "BrianBARROW", "date": "January 22, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123458311}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "We were just staying one night after the flight over from Europe, and the room was really big and comfortable. We arrived late and there was no problem with the night check in.", "title": "Great staff; great attitude; great room.", "helpfulness": 2, "user": "WestyTweedValley", "date": "January 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122903586}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Booked this via lastminute.com as a secret deal - 4* in the hear of the city. I see now that they have to hide the name as nobody in their right mind would stay there twice.", "title": "2 Stars at most ...", "helpfulness": 1, "user": "MelandAus", "date": "October 4, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 118913783}, {"rating": 2.0, "title": "Booked a \"superior\" room at this hotel", "text": "The location was very handy .. but the room was terrible. It had the textured cement ceilings and musty, tired carpets. The airconditioning unit outside was so loud (not ours - we didn't have it turned on) that we had to move the bed away from the window to sleep.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "September 27, 2011", "id": 118639950}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Whilst moving the bed - our king turned out to be two singles pushed together ... no problem except that each single was made up separately using double bed sheets folded over and they were ripped. Just awful. Would rather stay at a caravan park than stay here again.", "title": "Not 4 Stars.....", "helpfulness": 1, "user": "billichka", "date": "September 24, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 118522863}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Booked a \"superior\" room at this hotel..What a joke. The room was far from superior.Apart from very small the room had peeling paint, bath towel holder was loose, toilet seat was just sitting there not screwed on, light fittings with no light in it, no body lotion, not even a pool or spa available. We also had the sound of the air conditioning going all night and a window that looked at a wall", "title": "Nice clean hotel and well-located", "helpfulness": 3, "user": "LemonJane", "date": "September 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 118477221}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Paint peeling off bedroom wall and dirty windows are not what I expect from a 4 star hotel.", "title": "dissapointing value for money", "helpfulness": 2, "user": "Maxymax11", "date": "September 18, 2011", "detail_rating": {"value": 2.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 118267541}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "The service was very good and the reception girls were very obliging. It is only a short stroll to the Mint, the city mall, Bell Tower and Ferry & train services. The free red bus stops right outside and is a good way to get around the city centre. We pre booked on Hotels.com.au and got a better deal than the Travelodge website. The rooms were clean and a lot had a balcony. There isn't any great views from the balcony but the fresh air is nice.The bed was comfortable enough. It's not 5 star but good value at $115/night for a superior balcony room.", "title": "Great location", "user": "OutbackAussie", "date": "August 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 74856003}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Stayed here one Friday night at the end of our WA holiday and loved our room on the 7th floor. Had a balcony looking out to the cathedral, which was lovely to sit out on and enjoy a glass of wine. The bed was nice,large and comfy, and the room was spacious with plenty of room for our luggage. The bathroom was small but clean, with a bath,hairdryer and nice large towels.", "title": "Great Service, Clean and Comfy.", "user": "Juzshmee", "date": "August 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73692932}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The staff at reception were friendly and helpful and we were able to store our luggage before and after checkout.", "title": "A very convenient and comfortable stay", "user": "ShropshireSkiers", "date": "July 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 71609334}, {"rating": 1.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The Hotel is in a great location,easy walking distance to the city centre, shops,cafes and ferry terminal.", "title": "Horror Story from start to finish - cheaper than others for a reason.", "helpfulness": 4, "user": "TheoJones", "date": "July 6, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 69932795}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled solo", "text": "The only complaint we had was with the staff in the restaurant. The food was nice but the staff seemed to be in a hurry for us to leave. They completely cleared off our table as soon as we finished our main meal without even asking if we wanted desert or coffee. And were nowhere to be seen when we wanted to leave. We waited about 10 minutes then just left.", "title": "beautiful room overlooking historical church", "helpfulness": 1, "user": "SunSyd", "date": "June 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68399766}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "Stayed 9 days in June 2010 with wife and young son . Excellent staff attitude at ALL levels. Friendly, helpful accommodating. Entertained all our requests, even stored my bought meats to bring home in restaurant fridge. Cosy ,modern ,QUIET,convenient(bus just outside), homy hotel.Walk 8minutes to Mall. Rooms 'recently' refurbished but cosmetic job. Was still good. Had a 9th floor BALCONY room with a lovely view of the Cathedral.Nice bathroom. Rooms adequate size but wardrobe is too small!- for one person really. Pullout spring sofa bed was TERRIBLE! Could feel all the bumps. Charged AU $40 per night for it! Rooms adequately equiped with the usual iron,board, clock radio, flat screen TV, good size mini fridge but no starionary. Internet in room was AU$12 for 1 hour blocks. Was told that different floors have different internet .Used business center internet at AU$2 for 20 mins for quick emails. Business Center was cosy and comfortable with 2 terminals and printer with paper. Never had to wait to use. Gym was modern ,condusive and adequately equiped with towels,music,water cooler. Had a nice outside view. Nobody seems to use the gym - pity. Restautant was nice and cosy. Excellent , delicious American breakfast but the same selection everyday! Enjoyed it though. Will not stay again only because of HORRIBLE sofa bed - pity. Will highly recommend for only a couple.", "title": "Travelodge Perth- pleasant stay,recommended for 2 people only.", "user": "rozilin", "date": "June 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 68265587}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "We decided to stay in Travelodge Hotel based on the positive reviews. Although we have been to Perth several times, this hotel has one of the most spacious room which exceeds our expectation and with very comfortable beds. Bathroom is clean with very basic essentials. Location is great especially with the red cat service (free bus service to the malls) is right at the door steps. The down side is that house-keeping needs to be improved as little details like the wardrobe is dusty and there are strands of hair. The reception wasn't as helpful nor informative. However, overall we felt it is still value for money as we like the size of the room.", "title": "Great Rooms", "helpfulness": 1, "user": "LeeTina", "date": "June 20, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 68068536}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "I am a frequent traveler, i always picky when it comes to choosing a hotel. But i have to say I'm very satisfied with Travelodge Hotel. I stayed for a pleasant 4 nights. The front desk is friendly and very helpful, the hotel and room interior is very nice as it is just newly renovated last year. the Hotel located about 10 minutes walk from the city, but places right in front of the free city shuttle bus, so it has the convenient of location but not the busy and noise of the city street. And all of this i got for less than $100 per night. Probably one of the cheapest hotel rate in Perth. Two thumbs up for Travelodge Hotel.", "title": "Two Thumb's Up", "helpfulness": 1, "user": "Mr_A_Indonesia", "date": "June 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 67893176}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled solo", "text": "I spent a couple of weeks here in April. Without exception, everyone I encountered on the hotel staff were friendly, helpful and efficient. I was made to feel very welcome and that no request I had was too much trouble.", "title": "I have already recommended this hotel to friends", "helpfulness": 2, "user": "surrideo", "date": "June 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 67431791}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "I had a very comfortable stay in a clean and modern looking balcony room looking out over Hay Street. My room had all of the amenities I needed and I thought this hotel very good value for money. The hotel has a business centre, small gym and guest laundry. It also has a bar/restaurant and there is the option to breakfast at the hotel. I recall there are a couple of food options nearby (I didn't use them so can't comment on whether they are good or open regularly); the majority of the city's cafes and restaurants are a walk/taxi ride away.", "title": "Reasonable hotel for a couple of nights", "helpfulness": 1, "user": "GlendaSinging", "date": "June 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 66932865}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Clean well placed hotel at a reasonable rate. It was within easy reach of the city's main attractions and for those looking for a reliable but inexpensive place to stay it is worth a look. The road was a bit noisy (but it is a city!) and the view of the Cathedral is quite nice. The breakfast is not cheap and would recommend sourcing elsewhere.", "title": "Adequate hotel in good location", "helpfulness": 1, "user": "MGteam", "date": "February 28, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 57326272}, {"rating": 2.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "Stayed here for a night with a colleague and chose it primarily based on price as Perth hotels are notoriously expensive.", "title": "Pity this hotel isn't as clean as the rest of the city", "helpfulness": 1, "user": "TravelWizMelbourne", "date": "February 24, 2010", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 57031955}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled solo", "text": "Arrived early in the morning so understandably our hotel rooms weren't ready so we came back after 2pm. On entering my room, it was clear that only a very superficial clean had taken place. There were no toiletries in the room (although one shampoo, one conditioner and a box of tissues were delivered to me when I rang down to reception), there was tissue on the floor of the room, there was no hand towel and the carpet had definitely not been vacuumed.", "title": "Great Perth CBD Hotel", "user": "IntrepidTraveller35", "date": "February 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 56817648}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "When I tried the hair dryer, this didn't work, so another call down to reception only for them to send up a man to try and fix the hair dryer - no luck - so he went away again to go and find a portable one (which is what I'd asked for the first time!)", "title": "Good stay - we got what we expected", "user": "Erica L", "date": "February 21, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 56643004}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Overall, a disappointing experience and I wouldn't go back to this hotel.", "title": "Great place to stay in handy location", "helpfulness": 1, "user": "Blondie247772", "date": "February 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 55261667}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "I just recently stayed at the Travelodge in Perth for almost 2 weeks and to be honest i didnt find the rooms that bad they are moderatley refurbished in line with the other travelodges i have stayed at. I must say the water pressure was terrible but you get use to it. The breakfast was excellent, room service was terrible we ordered the chicken and it was cold and soggy so we learnt that lesson. They should look at supplying a parking pass for guests although there was plenty of street parking and not that expensive just a hassle when it expires every two hours. Im not sure why people complain about the noise of traffic i was on the 7th floor and couldnt hear a thing.The only thing that would stop me staying there next time is they dont have the kitchenette facilities which makes it very hard for when you have a 5 month old they supply a cot but not a microwave or bottle warmer. But i would definitly recommend this hotel to any one the staff are very helpful and its in fantastic location.", "title": "I don't see what all the fuss is about", "user": "John S", "date": "January 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 122442855}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Stayed for a couple of nights here having found a cheap non-refundable rate online. I would have moved to another hotel if I could have got my money back because the first thing I noticed was the hair on and around the toilet.NOT cleaned properly. Then I discovered a toenail clipping on the carpet... also some other debris and several stains.", "title": "Dirty room... :-(", "helpfulness": 4, "user": "Sudzs", "date": "December 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 1.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 122258489}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "The bed cover had a tear in it and there was a suede effect pillow case which definately was not cleaned as it smelt of someone elses old perfume and scalp! VILE!!!", "title": "3 night stay", "user": "maigheo", "date": "December 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 122210440}, {"rating": 3.0, "stay_parameters": "Stayed November 2011", "text": "and on top of that, the room was small and there was very little storage space, especially in the bathroom.", "title": "Expensive for what it is", "user": "ejw3039", "date": "November 22, 2011", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 120899341}, {"rating": 2.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "But I do have to mention that the staff on reception were very pleasant and helpful but the rooms need a deep clean AND should be cleaned properly on a daily basis.", "title": "Over-priced and in need of some TLC", "helpfulness": 1, "user": "JonandTracyBaker", "date": "November 22, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 120897916}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "I had to stay in Perth with my 1 year old to be close to my husband, who was having surgery at Royal Perth Hospital. Very close to the hospital, but also close by to the city shops as well.", "title": "Clean, comfortable, quiet", "user": "sas02", "date": "May 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 64874437}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "There is an IGA within walking distance and a bottleshop. Restaurant is a little pricey but good. Had brekkie here 1 morning but preferred the ham & cheese toastie that I got for $4 in one of the coffee shops a block down the road!", "title": "Very Good Value", "user": "bellalisa", "date": "April 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 61649965}, {"rating": 5.0, "title": "good value", "text": "Staff were nice and helpful.", "helpfulness": 1, "user": "Lankyswan", "date": "March 9, 2010", "id": 58120618}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled solo", "text": "Room was quiet and clean.", "title": "Speak to the right person (i.e. no Heather) and things go well.", "helpfulness": 1, "user": "benabouttown", "date": "March 4, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 57691228}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Would definitely stay here again.", "title": "was ok", "helpfulness": 1, "user": "weeclairey", "date": "March 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 57416739}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 4, "variance": {"poor": 39, "average": 87, "very good": 134, "terrible": 14, "excellent": 43}, "aka": "Travelodge Perth Hotel", "slim_ranking": 0.413793103448, "description": "The new generation 4 Star Travelodge Perth is ideally situated in Perth's CBD, a short stroll from City Malls, Swan River, Perth Concert Hall, with a free city CAT bus stop at the footsteps of the Hotel."}