{"user_rating": 4.0, "review_count": 1222, "name": "Travel Inn Hotel New York", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "I read some reviews at tripadvisor so I decide to reserve at this place, since it was close to Broadway,", "title": "Maybe in other time was a good hotel", "user": "Dvoyager1", "date": "September 17, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 140536561}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Hotel was pretty noisy, avoid to stay by 6th floor above they have their old aircondition machine, also you can hear next room conversations (and much more), carpet smells weird, we ask to change room but was full the place;", "title": "Exceedingly accommodating staff, great parking, nice pool, good location, nice hotel.", "user": "SerendipitousTourist", "date": "September 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 140275759}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "Beds are really old, clean but old, their staff is kind of rude,", "title": "Didn't get to stay here but I'll still leave a review! :)", "user": "GothicblueCJ", "date": "September 13, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0}, "id": 140205098}, {"rating": 1.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "the good thing is the parking, and is close to Times square, plays and piers.", "title": "Unbelievably bad", "user": "Kevn E", "date": "September 13, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 140158488}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Elevator partially works, wifi is not free,", "title": "Good Value for NYC", "user": "FrequentVirgin", "date": "September 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140069577}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We stayed at this hotel last July for a week with our two girls then 14 and 11. We loved everything about this hotel......this hotel was the easiest to get to from the Lincoln tunnel, we drove 10 hrs from Ontario. We arrived around noon and parked the car for the week and started walking ! Around 3 we went back to the hotel to check in and have a swim in the pool, I had asked for our room to be on the same floor as the pool and to our luck it was right outside our door !!! We enjoyed the pool everyday for a few hours after sightseeing and thought the hotel was in the best location. There is an underground grocery store half a block away, the deli connected to the hotel was excellent, near the end of the week they knew what we wanted to order and if my husband went down to grab us bagels before we set out for the day we could always find an apple, banana or grapes in our bag !! The hotel room was small but we didnt expect it to be huge, it worked for the four of us for the week......everyone that worked at the hotel was very nice, when asked for extra towels or internet we had zero problems. They helped us hail a cab and the man that worked in the parking garage was a wealth of information. Over all we would stay at this hotel again for sure on our next trip to NYC. The price is right....parking is included...roof top pool in NYC....what more could you ask for :)", "title": "Excellent stay at the Travel Inn !!", "user": "candle_maker_2004", "date": "September 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 141274248}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "My buddy and I came here for 4 nights in late august to watch the blue jays beat the yankees at yankee stadium. The hotel was in a very good location and was a couple blocks from the subway and times square. The best part of the hotel is the free parking in their 2 level parking garage. It may be hard to find a spot though, you may have to make your own. When you arrive in your car, make sure you come southbound so that the hotel is on the right side. It can be very tough making a left turn here in NYC traffic. When you pull in, park at the side doors before the ramp so that you can go check in. They will give you a parking pass when you check in. Your car should be safe in the garage throughout your stay. When you first go to your room make sure you take the correct elavator because there are 2 sides to the building and there are some rooms you cant access from each elavator. The rooms are pretty clean and is good value considering you probably wont spend too much time in your room anyway. The maid service is constantly cleaning but may leave a pizza box in your room. Our view was of the subway track but we didnt really care. The TV channels are pretty bad and is the only place ive ever seen channels with decimals in them like 42.27 instead of just 42. When we left it smelled like someone pissed in the garage like in the seinfeld episode. If you are driving here and dont need a first class hotel I highly recommend travel inn.", "title": "Free parking - Beauty", "user": "markyj93", "date": "September 24, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 141180941}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "As this was our first time in New York we have nothing to compare the Travel Inn to, but what we got ticked all our boxes.", "title": "Ticked all the boxes", "user": "gwindles", "date": "September 24, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 141124696}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Check in was prompt, our room was on the 3rd floor overlooking the pool, one elevator was out of order but we never had to wait to long for the other one, in saying this most of the time we used the stairs when coming down which brought us into the car park and out between the hotel reception and the deli next door. As we had a double double we found the room big enough, with a microwave, fridge, iron and ironing board, hairdryer, clock radio alarm and a flat screen tv, we left the window open during the night so it could be noisy but you are in the middle of town so what else can you expect ! The beds were comfortable and clean and there were fresh towels everyday and the toilet was'nt tiny with a shower over the bath which was a blessing for a good hot soak to ease my aching muscles and bones every night", "title": "Experience of Travel Inn", "user": "Mark M", "date": "September 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 140616992}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "It was a short walk to the Port Authority bus station and subway and not much further to Time Square where you get the hop on hop off buses and the other way you had the yellow water taxi, the circle line cruises, the Intrepid and Space Shuttle exhibition and the cruise terminals. We also walked to the the Empire State Building and Macy's which is a bit further away and we also done part of 5th Avenue from Central Park but that is a bit of a trek.", "title": "below average", "user": "Jenny0709", "date": "September 17, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 1.0}, "id": 140550042}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "This was the first time that my family and I went to NY. We opted for this hotel mainly because it had free parking (within the hotel). This having been said, we were pleasantly greeted by the parking attendant. The only perk was to leave our keys with the attendant due to possible moving of our car within the indoor parking lot. We didn't really feel comfortable with this, but he reassured us that he would find a spot where he would not have to move our car for the duration of our stay. SInce we were not going to use our car in NY, we retrieved our keys and all was good.", "title": "Wonderful Stay !", "helpfulness": 2, "user": "Silva_Lamothe_Family", "date": "August 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138619170}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We had a room with 2 beds (for our kids and for us). The room were very nice rooms, very clean and well decorated. The bathroom was a complet bathroom with tub and it was furnished with complimentary soaps and many clean towels. The bathroom was just as clean and the rest of the room. No complaints there !", "title": "nice stay in a great location", "helpfulness": 1, "user": "talkinghorse55", "date": "August 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 138613919}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Our room was located across from the pool. The pool closed at 7 pm as to not bother any guests. What is wonderful, I thought, about the pool it that it has a roof covering half the pool which my kids loved because they could still go swimming under the covering protection when it rained. There was also a lifeguard present.", "title": "Fantastic value, central, free parking and outdoor pool!", "helpfulness": 3, "user": "HaskelUK", "date": "August 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 138508025}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "Next to our room, was a mini fitness center and an ice machine. The television was functional and it offered an array channels. The location of the hotel couldn't be better. Across the street it a police station and it is about 5 minutes from Times Square. We even took advantage of the free security box at the front desk to put our passports and other valuables.", "title": "almost perfect!", "helpfulness": 3, "user": "vanblair", "date": "August 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 138158159}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The room service maid was cordial (I believe her name was Isabella or Elizabetha)....she was so respectful and polite, as was the front desk staff. One front desk clerk (I don't remember her name) advised us on places to eat (which btw was great) and places to visit. She helped tremendously !", "title": "We were happy here!", "helpfulness": 2, "user": "Erin F", "date": "August 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 137566452}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "I arrived in NY after a grueling 14 hour flight to find that the hotel had over booked! This is after having made my booking weeks in advance, and provided all necessary card details for pre-authorization! No calls, no emails, not even a courtesy gesture to warn me in advance! Then they auto book me into a 'sister' hotel, that stinks to high heavens, and that is a whole 40+ blocks away. For a business traveler, with such little time to spare on inconveniences as what they put me through, I would not recommend this hotel.", "title": "Deeply Disappointed!", "helpfulness": 1, "user": "LwandaMagere", "date": "September 7, 2012", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 139673374}, {"rating": 1.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "I repeat, for a business traveler, avoid this hotel, you will be disappointed.", "title": "Dirty and outdated", "helpfulness": 2, "user": "mtlminou", "date": "September 6, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 3.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 139614305}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Just checked out from this hotel. First room, we killed 3 roaches, they offered us another room (that's it, not even a sorry) and first thing I did in the second room, I killed a spider and found a pest control box under the bed. Since wi-fi is not free, I bought a 24h access for 6$ but the connection didn't work or was really slow 90% of the time. So I called reception, the lady told me to call the tech support, an outsourced provider that tells me that they can't do anything about it because my device is a mobile (an ipad), sorry I didn't plan on bringing a desktop. Finally, the elevators were broken half the time so you have to walk the stairs that were hot as hell since only the rooms have A/C.", "title": "2nd time at this hotel, sorry ...but that was the last one", "helpfulness": 4, "user": "4Runners67", "date": "September 6, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 139561272}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "I was attracted by the good reviews, free parking and pool but I wasn't expecting roaches. The management is probably gonna write a response about how surprise they are and how they're gonna correct issues and all. But the truth is that if they are so proactive and attentive to the quality of their hotel, they would show more concern when people bring up the problems at the hotel and not wait for tripadvisor to show it.", "title": "Great location inside NYC with PARKING!", "helpfulness": 2, "user": "BrusselsSprouter", "date": "September 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 139422436}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Last year (2011), we went at this hotel. A that time, we did have a good time. Of course, I totally agree with people: free parking, outdoor swimming pool, small fridge in the room,10-15 minutes walk distance from Times Square and the same for the USS Intrepid. So this year, when I made my reservation, I know exactly what to expect. I know, that rooms are just OK, that elevators (only 2) for the back part of the hotel (level 4 to 6) are slow and more than tiny, and when you have finally succeeded to put your luggage cart in it, you can barely get in it. I did also know, that bathroom in rooms are tiny also. I know, that for the price (about $200 per night in peak season, including the interior parking), you have to compromise on something. This year, I found that mattresses were unconfortable and make a lot of noise when we rolls over (by the way, my wife and I are really far from overweight). I also did notice on our arrival, that this year, they place huge rat traps (about 6) in their ourdoor gardens (3rd floor) adjacent to the swimming pool. But on our last night we discover 2 small rat traps under our beds (I've got pictures to prove it). We've got a hard time to sleep that night, and were really happy to know that, that was our last night. Next morning, I mentionned that to the clerk, when I was checking out. She just told me, that \"it's in case of...and that is just as a measure of protection\".", "title": "Great Location", "helpfulness": 1, "user": "TravellingFamily2941", "date": "September 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 139371320}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "this was our 2nd stay at the travel inn and it was just as good as the first. I booked last Jan for our stay over new years this year. This time our room was on the 6th floor and it was very nice...even abit bigger than the room we had the first time. This hotels location is the best. When we drove into the city it is so close to the tunnel and easy to arrive at. The man working the underground parking lot...same man as in 2011 is super friendly and helpful. Parking is a breeze...as was check in. We arrived at 9 am on new years eve day and knew our room would not be ready so we parked and started walking knowing our vehicle full of our stuff was safe. We went back around 2ish and our room was ready and we checked it. We were back and forth the next 2 days all the time....because this hotel is so close to times square, the theatre district and all the restaurants. Our room was clean and comfortable, I put our garbages and towels out in the hall for the housekeeper the next day when I heard her out there and we got fresh towels and garbages back. Wifi worked well. Deli beside our hotel is a nice feature to have so close. Our stay was great and we will return !", "title": "2nd stay and it was great !", "user": "candle_maker_2004", "date": "January 3, 2014", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 189525906}, {"rating": 3.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "I chose this hotel for the free parking, proximity to Time Square and ease to get to once entering the city. This hotel had all 3. Just a short walk to Time Square - maybe 4 blocks. Very close to Bryant Park which was very nice at Christmas. And the parking was FREE - although a tight squeeze getting in a spot and leaving the garage. The room was big for the city and the area felt safe. There was a police station across the street so you will hear sirens. There was also some sort of hammering and vacuuming from about 2-3am. We were there on a freak warm spell, 70 degrees in Dec. and the room stayed warm, would not cool. The beds were terrible. It was like sleeping on a board. The staff was nice and hotel pretty clean and well maintained for an older hotel. They used very scented products which irritated my asthmatic child a little, but this was just the lobby.", "title": "Free Parking", "user": "Mandy W", "date": "January 2, 2014", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 189381064}, {"rating": 4.0, "title": "Great Hotel, Truly Recomended", "text": "We stayed there for a week and I have to say I was happy to have chosen it. Great location, just three blocks away from Times Square and if u plan to visit the city properly u can take a walk practically anywhere, 5th avenue, Rockefeller center, maycs, Empire State Building, and u have train stations close, don't rent a car and use public transportation (trains are better) it's cheaper and u don't have to deal with expensive parking and traffic. The only thing I didn't like abt the hotel is that they charge you the internet connection ($6 a day) and in the room I was staying the signal was awful, I had to be glued to the window to connect, fix that and it's a 5star hotel. Recommended!", "helpfulness": 1, "user": "Eduardo B", "date": "December 31, 2013", "id": 189150496}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "The hotel was very conveniently located a short distance from Times Square. We were at the hotel during Christmas 2012. The hotel room was clean and adequate for our use. The hotel room was for us important issues, refrigerator and microwave. Heating device not found the kind of control that the temperature would have been appropriate. There was always either hot or cold. Otherwise, the hotel was very good. Across the street was a shop and a small walk from a variety of places to eat. I can recommend this hotel for a trip to New York.", "title": "Good place to stay", "user": "Antti S", "date": "December 31, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 189142708}, {"rating": 3.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "The location is a long walk to Time Square but doable if you are a walker. The price was good compared to other hotels in the area. I learned that if you want a reasonable quiet room you must stay on the inside by the pool. We had such a room and it was OK even though you can practically carry on a conversation with the room next to you. The 2nd night of our stay the heater started smoking. They said we will need to pack up and move to another room - we had no help with this and the room we were put in was across from a police station and was ridiculously noisy. They were not willing to discount our stay. What happened to all the great staff we have heard about in other reviews?", "title": "Great location but......", "user": "Guccigrandma3", "date": "December 30, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 189076070}], "location": {"country": "United States", "city": "New York City"}, "stars": 2.5, "variance": {"poor": 61, "average": 220, "very good": 635, "terrible": 53, "excellent": 253}, "aka": "Travel Inn New York", "slim_ranking": 0.6230248307, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 3.5, "rooms": 3.5, "location": 4.5}}