{"user_rating": 2.0, "review_count": 121, "name": "Travelodge - Edmonton West", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "I booked my stay at Travelodge without checking out this website. BIG mistake! The rate I got was spend 2 nights get 15% off. Well in the small script what you dont see is if you book with this \"special\" rate you cannot get a refund for any reason. No cancelations, No Modificatins, No refund for no shows. My parents offered for us to stay at their house so I tried to cancel the reservation since it would be better to stay somewhere for free than in a dump like this hotel sounds. Especailly for the 700 bucks we are giving them.. I wonder what will happen when we go there and we hate it. We are booked for 6 days and I dont know what to do.... I dont care I will never stay at any Travelodge again", "title": "So Scared", "user": "jcawthorn", "date": "December 18, 2008", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 22840413, "likes": {"liked": "— Couldnt tell ya", "disliked": "— Staff"}}, {"rating": 1.0, "title": "Disgusting dump", "text": "We checked in at 1pm and could not stay there past 5pm! It was terrible, the halls were dingy, in our first room the deadbolt didnt work on the door, the door jam was busted, very tiny and not clean at all! The carpet was digusting, the mattress/boxspring was falling apart, It was -35 below and the air conditioning unit was not insulated-you could literally see outside through the cracks! We were freezing! I demanded being moved to another room and found the same dinginess, the freezing air was traveling through the air conditioner, the sheets had other peoples hair-I doubt they were ever washed, AND THE TOILET WAS OBVIOUSLY NOT CLEANED! Disgusting!!!!. We were NOT going to stay there so we packed up and went to the Front desk, we told them we could not take the hotel and we were freezing! The desk clerk said my credit card would not be charges because we were only there for 4 hours...I'll be checking my credit card to make sure I was not charged! The clerk did not even fully ask why we were leaving. DO NOT WASTE A DIME THERE!!!", "user": "mercedy", "date": "December 15, 2008", "id": 22764548}, {"rating": 1.0, "title": "Dont stay here!!!", "text": "I booked this place sight unforseen through another website and did not know about tripadvsor. The place is run down, carpets were dirty and the air conditioner was so noisey I had to turn it off. There were beer cans in the stair ways and the place seemd it was very tired and needed to be knocked down for a new place. On succeeding trips to Edmonton other hotels were recommending to people not to stay here and I dont blame them one bit at all. I won't stay here at all ever again.", "user": "rickster0728", "date": "November 14, 2008", "id": 21849375}, {"rating": 1.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "When we walked in to our suite I said to my husband right away that if there were going to bed bugs in a room, this would be it. We had a room that allowed for our dog to join us, and at first we thought that perhaps the room was dirty because it was a pet room. After reading other reviews I realized our room was really no exception. Though I looked, and looked for signs of bed bugs and did not find any, there was a white powder along the base of the walls. We brought all of our clothing home in garbage bags, and washed everything, including our dog once home. I have been seriously praying that we didn't bring any unwanted bugs home with us. We would have moved to another hotel in a heartbeat but everything was booked throughout Edmonton due to a rodeo thing. I would NEVER stay there again, and I was relieved to leave the place. As it is I have noticed bites from something on myself and my children. I sure hope they are remnants only from that room, and the pests stayed there.", "title": "Stay Away!!!", "helpfulness": 1, "user": "homeisbestCalgary", "date": "November 13, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 21830462, "likes": {"liked": "— Absolutely Nothing", "disliked": "— Everything"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "As a business traveller I booked the hotel sight unseen . While I requested a non-smoking room, the smell of smoke was prevelant in the hallways and elevator. The hotel seems dingy and tired. The room itself was very outdated and it looked like it had been years since being refurbished. I would call it less than basic and its' clenliness doubtful. I was supposed to stay for 5 nights and left after one. The front desk was not even interested enough to ask why I was departing early.", "title": "terrible!", "user": "lisa-lisa2", "date": "October 5, 2008", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 1.0}, "id": 20651106, "likes": {"liked": "— nothing", "disliked": "— the room"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "We booked this hotel for 2 nights in advance just because it was a Travelodge. I've stayed in them as a kid and always thought they were great, until this stay.", "title": "very dissapointed", "user": "saintkColdLake", "date": "August 20, 2008", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 19178704, "likes": {"liked": "— bed comfortable enough, and maintenace came to fix things right away; close to West Ed Mall", "disliked": "— rooms very, very run down; they should have had our room ready for us since we booked ahead"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We were to have two adjoining rooms-one for our family and the other for my in laws. When we checked in that evening our room had not been cleaned at all. We had booked those rooms in advance, they should have known, and the room should have been cleaned. The cleaning staff was all gone for the night so we were given another room down the hall from our family. The A/C was not working in that room and there were no other rooms available, so they fixed it while we went to supper. The next morning, our toilet quit working on us. Maintenance came right away again and fixed it. We requested to be moved back into the original room we were supposed to have as soon as it was cleaned, but had to wait for the room supervisor to check the room to make sure it was cleaned before we moved it. Where were they the day before to check it???", "title": "Disgusting", "user": "phenelia", "date": "July 28, 2008", "detail_rating": {"front_desk": 2.0, "location": 3.0, "value": 1.0}, "id": 18355415, "likes": {"liked": "— did not feel safe."}}, {"rating": 1.0, "title": "pls. dont saty !!!!", "text": "The rooms are in much neeed of renovation. Besides the problems with the A/C and toilet, the shelves in the closet were warped and ready to fall down; rugs very old and dingy looking even though they were just vacuumed; some drawers would not open in the dresser, shelf above the toilet and hook behind bathroom door were barely hanging on the wall; the doors stuck-you had to slam them shut to lock them; the windows only opened 3' for fresh air.", "user": "hutgurlie", "date": "July 25, 2008", "id": 18258947}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "Over all, very dissapointed, and we will never stay there again.", "title": "Not Again", "user": "lwu22qq", "date": "July 1, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 17411368, "likes": {"liked": "— Wear and tare"}}, {"rating": 3.0, "title": "Better than expected", "text": "I was shocked by the condition this hotel was in. When we first walked in I wondered if there was any point in having reserved a non-smoking room since the overwhelming odor of smoke saturated every surface of the dingy hallways. People loitering in the lobby and staggering drunk down the halls gave the appearance that \"accommodation\" was not the only industry this hotel was involved in.", "user": "RubyAlberta", "date": "April 24, 2008", "id": 15313884}, {"rating": 1.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "We stayed here as a last minute trip and it was aweful. Room had a wierd odor, paper thin walls and we heard all the noise coming down the hallway all night, tiny rooms. For $130, we didn't expect a palace, but a decent room for the night. The pool is so tiny. Hot tub wasn't working. Very sketchy people around the hotel. We will never stay here.", "title": "A Dump", "user": "dutchie95", "date": "April 26, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 3.0, "rooms": 1.0}, "id": 28836850}, {"rating": 2.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "We have stayed in Edmonton every year for the past 13 years because of the shopping and my kids love the WEM. We have used the Travelodge many times but this last time I think it has drastically plumetted! We usually stay in the east tower with the newer rooms but this time were stuck with the other tower because I booked basically while driving there (we did a spur of the moment trip). I must say that the Smitty's there has taken advantage of being in a hotel because their breakfast menu was extremely high priced and I dont think that I would have been able to spend less than 60 dollars for breakfast for myself and my young sons (6 & 3). We chose to eat elsewhere. The pool area was not very clean and the floors were so slippery we saw 4 children fall and get injured in a fall during the hour we were there.", "title": "Nice hotel but has gone downhill", "user": "momwithlove", "date": "March 29, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 1.0}, "id": 27027580}, {"rating": 1.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "The rooms were not updated at all and there was a funky smell to all the bedding. I know we were just there to sleep but I dont mind relaxing in a room after a long day of shopping but we avoided the hotel until we had to go there to sleep. We probably would have changed rooms but the hotel was full. We did however check out earlier than normal to find a place to feed the children and to finish our shopping.", "title": "worst hotel ever", "user": "greatmom12", "date": "March 6, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 25718277}, {"rating": 1.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "I doubt we will stay there again just because its gone downhill so much over the past years. I know that it has never been this bad before. Although I do have to give it one hurrah: this hotel does not demand that a person have a credit card to check in which is great for travellers who do not carry plastic.", "title": "I would rather jump off a bridge!!!!! than stay here!", "user": "sheister72", "date": "March 3, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 25482382}, {"rating": 3.0, "stay_parameters": "Stayed February 2009", "text": "This is a disguisting horrible run down hotel that doesn't deserve to be affilated with any chain.....take your money somewhere else and allow yourself a good night sleep - horrible rooms, horrible smell, horrible EVERYTHING!!!!", "title": "Excellent location, otherwise \"meh\"", "user": "SaskyGal", "date": "February 22, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 2.0}, "id": 24988091}, {"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "We stayed at this hotel for two nights and it was the worst experience I'ever had at a hotel! I knew as soon as we walked up to the front door that it was a big mistake.. There were very sketchy people outside the door that I am sure were all on drugs. It seemed like there were a lot of drunk people hanging around the lounge and I'm pretty sure that a lot of them actually live at this hotel.. Yuck!! The smell is overwelming and the hotel itself is dirty and very outdated. I wouldn't even let my children take there shoes off in the room because of how dirty it was. Never again will I waste my money on a travelodge.", "title": "Awfull!! Do not stay here!!", "user": "llove2travel", "date": "October 1, 2008", "detail_rating": {"front_desk": 1.0, "location": 3.0, "value": 1.0}, "id": 20545806}, {"rating": 1.0, "title": "Bedbug Alert", "text": "I was given a room that was infested by bedbugs. I stayed in the room the first night. The second night a friend who was an experienced traveler suggested I check for bedbugs. I took the headboard off the wall and saw a disgusting and large number of bedbugs. I went to reception and demanded another room. They were unconcrned and only after loud and continued demands did they give me another room. Three days after staying in this room my bites began to show, well over 100. I have thrown away all my lugage and clothing. Had my laptop cleaned and arrived home with the clothes on my back praying they did not dome with me.", "user": "AndrewPND", "date": "October 1, 2008", "id": 20538652}, {"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "Stayed in room 228 the week of September 08-13, on business & was absolutely horrified. If I were not a new employee with my company, I would have called my travel department & demanded they move me to a new hotel immediately upon arrival!", "title": "Disgusting Dump- Avoid at All Costs", "user": "sensfantoronto", "date": "September 15, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 3.0}, "id": 20085000, "likes": {"liked": "— ood location near restaurants, shopping, West Edmonton Mall", "disliked": "— Dirty hotel & rooms, rude staff, beggars & drifters all around, loud drunks in hallways at night."}}, {"rating": 1.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Hotel & room were very run-down, dirty & old. Ceilings sagged, paint chipping, linens were dirty, window opens only one or two inches, a/c unit was very loud, tv was old, etc...", "title": "Do Not Stay Here!", "user": "HeresMyReview1", "date": "September 3, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 19723317, "likes": {"liked": "— Nothing", "disliked": "— My expensive personal items disappeard from my luggage while staying in this hotel."}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Front desk staff were rude & short each time I had any dealings with them.", "title": "Disappointed - 2 star at best", "user": "mattie291Manitoba", "date": "August 24, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 19309692, "likes": {"liked": "— Location", "disliked": "— Cleanliness, poor first impressions (all entrances seemed to be blocked by construction)."}}], "location": {"country": "Canada", "city": "Edmonton"}, "stars": 2, "variance": {"poor": 23, "average": 22, "very good": 19, "terrible": 53, "excellent": 4}, "aka": "Travelodge - Edmonton West Hotel", "slim_ranking": 0.863636363636}