{"user_rating": 2.5, "review_count": 453, "name": "Travelodge Central", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We have just return from our 3 weeks in US. The last stop were at Travelodge Central, SFO.", "title": "Bad choise", "user": "KlausDenmark", "date": "July 20, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 1.0}, "id": 18072926}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "We tried 14 different hotels on our trip, and this last stop was by fare the most expensive, and the worst experience - even Motel6 in Barstow is better than this one.", "title": "The price is alright", "user": "amccarty", "date": "April 1, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 14699464}, {"rating": 1.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "Our complaints are: small and dirty rooms, very noisy from street and other rooms, noise from others taking a bath, interior is damaged, neigborhood is rough, breakfast was only coffee, sweet cereal, Sara Lee cakes.", "title": "Bed Bugs!!!!", "helpfulness": 2, "user": "ratchicken", "date": "March 31, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 14673603}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "We paid 740 usd for 3 nights - one room with 2 beds. Expedia had Hilton for 1.000 USD - damn! that was a wrong choise!", "title": "Good Location & Free Parking - But Run Down", "helpfulness": 1, "user": "lipsticktraces", "date": "March 22, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 14447963, "likes": {"liked": "— Location and reasonable (but not great) price; free parking and good wi-fi access", "disliked": "— Condition of the facilities and the noise at night"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled solo", "text": "I stayed at the Travelodge for 3 nights during spring break with my boyfriend, and his siblings. We were all on a budget but we still wanted to stay close to downtown. The hotel itself was fine, it was pretty clean, and it was close to the BART (Bay area rapid transit) which we used often. The walk to Union Square was lenghty but manageable however it is through a rougher neighborhood. We instead often opted for the bus or subway which ran almost every other minute. It was also close to the Haight area which was great for dining. The biggest problems we had with the hotel were:the water heater sounded like a jackhammer everytime the water was used, the continental breakfast was orange juice, coffee, and pre-packaged sara lee style sticky buns, lastly, some of us ended up having bug bites on our arms and such, but we have no way of telling what it was from. For a budget hotel, this is what we expected, but it does not exeed any expectations.", "title": "What you pay is what you get", "user": "Limktraveller", "date": "March 13, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 2.0}, "id": 14269597, "likes": {"liked": "— Locatio", "disliked": "— Need to update rooms"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled solo", "text": "I went to San Francisco to visit downtown and the Castro District. This location is right in between-PERFECT. That's pretty much the only thing I was happy about.", "title": "It's got it's ups and downs", "helpfulness": 3, "user": "MinnyBean", "date": "October 4, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 5.0}, "id": 10040709, "likes": {"liked": "— Location", "disliked": "— Cramped rooms"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "First off, the hotel overcharged me through a \"temporary authorization\" on my credit card. In fact, they overcharged me by about $300. This put my credit line into jeopardy for the two days that the authorization stayed in place. I don't think this was necessary.", "title": "You get what you pay for .........", "helpfulness": 2, "user": "LERAustralia", "date": "September 12, 2007", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 8704530}, {"rating": 1.0, "title": "Don't use their website unless you want to get ripped off", "text": "Secondly, the rooms were ultra small, I can't even begin to describe it. The bed was a king size and there were (literally) only inches of walking space between the bed and the TV/drawers. Hotel room was able to fit a chair on th side of the bed, and a very small desk, making it even more cramped.", "user": "wanderer8", "date": "September 6, 2007", "id": 8666789}, {"rating": 1.0, "title": "Beware of this hotel", "text": "My air conditioner/heater looked like it was built in the 50s and did not work. I'm glad it wasn't too hot or too cold! The walls hadn't been painted in awhile and there were a lot of chips.", "user": "tripp_man1", "date": "August 1, 2007", "id": 8269988}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled solo", "text": "The bed was not unbearable, but comfort is not the word I would use to describe the hard mattress.", "title": "made a reservation called canceled it thenext day got charged n e way", "helpfulness": 1, "user": "robbywillcoxaz", "date": "July 20, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 1.0, "rooms": 1.0}, "id": 8207679, "likes": {"liked": "— nothing", "disliked": "— n/a"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled solo", "text": "After walking from the BART station at 16th & Mission I was a little concerned but the area seemed to improve as I neared the hotel.", "title": "Great Location", "user": "Cargodess", "date": "December 23, 2006", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 6485262, "likes": {"liked": "— It's location to the Castro neighborhood", "disliked": "— The carpets need to be cleaned, my white sox were not so white after walking the room for a bit"}}, {"rating": 3.0, "title": "a great place to shower and rest!", "text": "Upon arrival I checked in without a problem, located my room and found it to be quite nice and reasonable considering the apparent age of the building. Since I would be sharing the room with a friend I had requested a smoking room and even so it was still nice, clean and not full of the usual smoker signs.", "user": "reddog221", "date": "December 3, 2006", "id": 6321975}, {"rating": 1.0, "title": "dump with a capital D", "text": "This hotel location proved great for my visits to the Castro neighborhood as well as downtown San Francisco and is located on the Muni F line which features refurbished street cars from the US and abroad. It was very easy to get around the city and outline suburbs.", "helpfulness": 2, "user": "naulie", "date": "November 7, 2006", "id": 6083439}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled solo", "text": "There were only a few room issues that were taken care of quickly, a bad cable for the t.v. and how to turn the shower on-an un-usual way to turn it on that I'd not seen before. However with a quick call I was helped. On the last two days the ice machine had gone out so that was a slight annoyance. Customer service was good and the maids were on top of it, however my main concern partly my own fault was that I had a late night flight and had the issue of luggage/boxes and security. I had requested the room until 5pm for my airport trip, since I had not thought about it and included it in the original trip plan the hotel assisted with my need but for full price. Live and learn, if leaving late and need the room to hold stuff, rest book it with the original booking to avoid getting hit a big one day bill.", "title": "Adequate motel, poor location", "helpfulness": 4, "user": "Electricwireless", "date": "September 19, 2006", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 1.0}, "id": 5817827, "likes": {"liked": "— Value for money", "disliked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006", "text": "If you are looking for a place to just kick back and have room service this is not the hotel for you. if you are looking for a hotel that is somewhere just to sleep and shower then it is the place for you. the only problems we had were that we called ahead and booked a reservation two days in advance and someone personally went there to talk to them on the day we were to arrive i called to check and make sure my reservation was confirmed. the guy on duty told me there was no such reservation made. We got it straighnted out and things were better from there on. Also the heater when it turn out made a loud clanking sound. other then those two problems everything went well.", "title": "Myth Dispelled", "helpfulness": 5, "user": "ARothenhouse", "date": "September 7, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5778519}, {"rating": 5.0, "stay_parameters": "Stayed August 2006", "text": "To get the full San Francisco experience, you must visit the Castro at least once. After staying in nice areas like Nob Hill, Russian Hill and Pacific Heights on previous trips to the City, I decided to try something a little different. The San Francisco Central Travelodge sat right on the boarder of Castro so it seemed like the ideal location. The nightlife in the Castro can get crazy so it was nice to have a hotel so close by. The hotel itself met all my needs. Close proximity to a lively area, yet only a trolley ride away to Union square. The rooms were clean and the cheap parking was a plus. If you want to visit the Castro, then stay at the SF Central Travelodge.", "title": "Impressed", "helpfulness": 1, "user": "RicPlank", "date": "September 6, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5774260}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Unfortunately hadn't read any of the reviews before I booked this hotel. We had regularly stayed in Travelodges in the US and had no problems. We had just come from 14 nights in a Travelodge in LA with no problems.", "title": "Awful!", "helpfulness": 5, "user": "CCodge", "date": "August 18, 2006", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 5621694}, {"rating": 2.0, "title": "Would not stay here again!", "text": "It was a disaster from the minute we arrived! We were accosted by a homless man in the carpark who threatened to punch my partner if he didn't give him money. The kids and my mother were terrified and we hadn't even checked in yet! The man on reception was rude and unhelpful and as we got back to the car (with the kids securely locked inside), a fellow guest came and warned us about staying there. We got into the rooms ( we had 2) and they were both tiny, had sloping floors, dirty carpets and nowhere to hang our clothes. We immediately spent 2 hours on the phone finding somewhere else to sleep. Finally found somewhere else (another Travelodge, which was wonderful) but it still meant spending 1 night there. We were kept awake by screaming, loud music and varying other 'night time' noises. When we checked out in the morning and complained to reception, the man there said they had called the police to stop the noise and it wouldn't happen again. Needless to say we didn't have any faith in that assurance, and we would have been correct as other reviews have said that this type of noise is common place.", "helpfulness": 3, "user": "1hdsoftail", "date": "July 22, 2006", "id": 5495678}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "It's cheap for SF but not at the expense of safety. Not for families and not for people of a nervous disposition!", "title": "Couldn't have been happier.", "helpfulness": 5, "user": "gothgimpbadcooking", "date": "July 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 2.0}, "id": 5432760}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled solo", "text": "Hotel is typical motor inn/lodge style, with rooms right off the carpark. Appears a little open to the elements at first glance, I was expecting homeless people at my door, but this didnt happen. The guy on the front desk is clearly in the wrong industry, his customer service skills are few and far between Dont expect any flexibility with check in, he wont let you in the room before 2pm, and am sure would charge you if you checked out after 11am. Unfortunatly, I believe he is the manager!", "title": "Good value, good location", "helpfulness": 2, "user": "dasberliner", "date": "April 29, 2007", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 7480073, "likes": {"liked": "— Price, was $42 U.S on tripreards.com", "disliked": "— Awful service at front desk"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007", "text": "Room is comfortable, well maintained and has plenty of cable channels to choose from, and maid service is efficient. 3 blocks to the Castro makes location perfect. The downside of this, if you go three blocks the other way, you hit the Tenderloin, which even on busy Market Street, is downright scary. Problem is if you want to walk to Union Sq, its right through the Tenderloin, whilst do-able by day, is suicidal by nite.", "title": "Price appropriate, good location, clean enough, recommended", "user": "clorgmail", "date": "April 23, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 7419296, "likes": {"liked": "— Price, location", "disliked": "— Front desk staff"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "We live in San Francisco and this is our go-to place for friends when they need a couple of nights. The rate is amazing for the location and quality of room and space. Just checked out this morning for our friend from Hong Kong, $44/night ($50 total-tax!) for a Sat and Sun night stay. During busy weekends they are about $186/night, and that's TOO much. If you can get a $80/night and under rate, go for it. $10/night for parking and free wi-fi.", "title": "good price", "helpfulness": 2, "user": "wondRR", "date": "April 12, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 7339127, "likes": {"liked": "— clean, low price", "disliked": "— low quality"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2007, traveled solo", "text": "Ask for a room on second level and only accept rooms that are facing Valencia Street. Don't bother with their breakfast, just walk around the corner to a DeLessio Markey for wonderful baked good and hot food.", "title": "Great price for a downtown two star motel", "helpfulness": 2, "user": "chgodude", "date": "February 22, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 6826115, "likes": {"liked": "— Good public transportation", "disliked": "— Some noise from nighttime traffic"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "This is a wonderful motel to just crash and sleep. We have never had any threat issues (in room or parking lot) but remember you are not in Kansas. It's still a big city and you are staying in a 2 star motel, be prepared to roll with the punches.", "title": "Mixed Review", "helpfulness": 2, "user": "travel-lite-949", "date": "February 5, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 6745629, "likes": {"liked": "— Location", "disliked": "— Staff"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "This is an average lower price hotel (2 dbl paid $65/n average). Parking is extra ($10/n). I've stayed here several times over the years.", "title": "reasonable price, great location for public transport, avg older hotel", "user": "MasAmicus", "date": "March 2, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 13987586, "likes": {"liked": "— price"}}, {"rating": 1.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "Physically the place is an older hotel that has been remodeled couple years ago to meet corporate standards. Somewhat worn. Marble tile bathroom. Doors lock securely. Check window locks. Like most in the area hotel only has heat and fan, no AC.", "title": "Good place gone bad", "helpfulness": 2, "user": "CaveatConsumers", "date": "February 25, 2008", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 1.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 13843793, "likes": {"liked": "— Clean", "disliked": "— Lack of parking, rude and lazy staff that does only bare minimum"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Mgmt is lax about service and you must ask for bag check or iron.", "title": "Average Hotel That Suits Budget Travelers", "helpfulness": 1, "user": "Brazildude", "date": "January 30, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 13114662, "likes": {"liked": "— PRICE AND LOCATION", "disliked": "— SMALL ROOM"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Check your room at check in and ask for another if something is wrong. Room cleaning service was honest and efficient. Most guests are tourists there for the price. Some of the guests are crashing 20 somethings or flopping lower class.", "title": "Been there for second time", "helpfulness": 1, "user": "Creanda", "date": "January 17, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 12735870, "likes": {"liked": "— price", "disliked": "— Age of building and noise"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "Access to public transport is great and right in the middle of many areas. Right off market so Muni/Bart is easy to get to for uptown/city excursion, mission/castro(walk to grocery store, window shopping/", "title": "Place works for me", "helpfulness": 4, "user": "SFCityGuy", "date": "November 30, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 11169384, "likes": {"liked": "— Location"}}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 2, "variance": {"poor": 80, "average": 88, "very good": 75, "terrible": 172, "excellent": 38}, "aka": "Travelodge Central Hotel", "slim_ranking": 0.868085106383, "description": "Located in the heart of San Francisco, on Market Street, midway between downtown and the colorful Castro District, our hotel is the perfect place for travelers to stay when visiting San Francisco. All our rooms feature in-room coffee, safe and hairdryer, telephone data port, and cable television with HBO/CNN/ESPN. Guests also enjoy a free continental breakfast and weekday USA Today newspaper in the lobby."}