{"user_rating": 4.5, "review_count": 131, "name": "Trecius Guesthouse", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "The hotel only had one room left when we booked, so we stayed in it with our two teenaged daughters--and survived! The room was great, and the location is perfect. The staff got us tickets for an Auschwitz tour and an overnight train to Prague; all we had to do was reimburse them. The hotel kept our luggage after checkout and allowed said daughters to hang out and use the wifi until we left for the train at 9pm (short walk to the train station)--a very friendly and accommodating place!", "title": "Service with a capital \"S\"", "user": "Forza10", "date": "June 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 69123555}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "My sister and I stayed in the Trecius Pension in Kracow for three nights. The central location in old town, and proximity to the train station, were a big plus. Once at the pension, we could walk everywhere. The Trecius Pension is small (just 6 rooms), but the rooms are well kept, clean and neat. The Pension itself was quiet, although there was some street noise from rowdy visitors. There is no elevator to the second floor Trecius, but the manager helped us with our bags upon arrival. I would definitely recommend Trecius to anyone staying in Kracow, and would stay here again.", "title": "Best value in Kracow", "user": "myscreen01", "date": "June 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 67598851}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "The room was basic but the bathroom was nice. The staff prepared breakfast for us every morning and helped direct us to our destination for the day. They also ordered a taxi for us on the morning we were departing. We were located only a block from the Market Square.", "title": "Very conveniently located and the staff is very helpful.", "user": "Mar023", "date": "June 15, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 1.0, "location": 5.0}, "id": 67585497}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We spent 5 nights here in mid-May and thoroughly enjoyed it. Due to full booking, we had 3 nights in room no.3 and 2 nights in room no.1, both very good. Very friendly and helpful staff - Peter and Anya - and very well situated. Shame about the weather but we can't blame them! Only small gripe is about the covering over the walls on the outside of the building, which means that you can't get a good idea of what the weather is like from inside the rooms, otherwise would definitely use again if we return to lovely Krakow. Good value..", "title": "Most enjoyable", "user": "trishEngland", "date": "June 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66738858}, {"rating": 5.0, "stay_parameters": "Stayed May 2010", "text": "Great central location with very helpful staff. Their arranged tour to Auschwitz was excellent. Our only complaint was the breakfast.", "title": "great stay", "user": "rblacki", "date": "June 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66479430}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "My most recent trip in May was my second time staying at Trecius Guesthouse.", "title": "2nd time at Trecius Guesthouse.", "helpfulness": 1, "user": "Kathleen1819", "date": "May 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109524176}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "The location is excellent - within walking distance to the train station and just a block from Old Town Square.", "title": "Great", "helpfulness": 1, "user": "davedavies162", "date": "May 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 108426116}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled solo", "text": "One of the reasons why I is returned is the price and the cleanliness and quality of the rooms. But the biggest reason was the excellent service provided by all the staff. They work very hard to make sure you have everything you need and are happy with your room arrangements.", "title": "Service fit for a king", "helpfulness": 1, "user": "rgbluej", "date": "April 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 104809124}, {"rating": 5.0, "stay_parameters": "Stayed April 2011", "text": "I did have breakfast at the guesthouse every morning. It is plenty to eat and carried me through to mid-day before I ate again. Once again, the staff is very attentive to make sure you have everything you need.", "title": "Thumbs up to the Trecius ... An awesome stay in Krakow", "user": "hoollycow", "date": "April 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104375279}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "There is some street noise but being so close to the square it is to be expected. The noise can best be described at \"happy noise\" - folks enjoying themselves and walking around the city.", "title": "Excellent Quality, Value and Location", "user": "captainautocad", "date": "April 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 102817791}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "We picked up a recommendation for the Trecius guesthouse in a booklet attached to the Lonely Planet magazine. Making a booking via the internet was easy and correspondence with the Trecius very helpful, including tips on how to get into town from the airport and in particular which taxi company to take and where to find it at the airport", "title": "Excellent family guesthouse, ideally located in central Krakow", "user": "DandF18", "date": "February 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 98409833}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "Because we stayed for four nights we had a discount on the price and a further discount for paying in cash. The guesthouse was on the upper floor of an old townhouse and ideally located in the centre of Krakow, only a few minutes' walk from most of the main attractions.", "title": "FANTASTIC PLACE", "user": "Sue C", "date": "December 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 90930772}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Just after our arrival we realised that we had left a rucksack in the taxi. The owner of the guesthouse immediately jumped into his car with my husband to try and follow the taxi to the nearest taxi rank. They didn't find the taxi, but the owner then telephoned the taxi company on our behalf and succeeded in tracing the rucksack. He then insisted that it be delivered to us as soon as possible - and it arrived within 20 minutes. Without his help I don't think we would ever have managed to trace it; and certainly not so quickly.", "title": "So good we went back", "user": "jospanner", "date": "November 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 87112190}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We found the Trecius and its staff delightful and helpful with tips for restaurants, getting to the station, times of buses to the Salt Mines and Auschwitz and the owner even drove us back to the Airport when we were leaving - for a fee, but much easier than going by taxi. We also enjoyed the breakfasts and were within easy reach of restaurants for the evening.", "title": "Excellent Staff, Service and Value", "user": "Patrick35051", "date": "November 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 87071358}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "The only small disadvantage was that the centre of Krakow is very lively at night and there are people walking around talking until the early hours. Without the earplugs provided in each bedroom, we would have been kept awake. The other small detail which was a bit strange was that the beds were only made and the rooms cleaned every other day.", "title": "If you're looking for somewhere convenient, friendly and relaxing......this is the place for you!!", "user": "leenbeckie", "date": "October 29, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 85237562}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled solo", "text": "This is a great value just a short walk from the main square. Very friendly and helpful staff. Only drawback was the street noise at night, but ear plugs are provided. Room was very adequate and two breakfast options are provided for a small charge. Location is within walking distance of Krakow's Galleria, as well as the train station. A nice, friendly and comfortable guest house.", "title": "Great Value in a Great Location", "user": "CyclingGeo", "date": "October 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 84389633}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We stayed four nights at Trecius, and for us it couldn't have been a better choice. Small and informal, and a bit odd in configuration, the guest \"house\" is on the second floor of a large building which is in the middle of extensive, long-term renovations. The rooms are mostly very basic-- the last night we had to take Room 7, for which the bathroom is through another vacant room and across a hall (and priced accordingly). So you won't necessarily get elegance or charm if that is what you are looking for, but the very friendly and helpful staff and convenient location nevertheless make up for whatever it lacks in amenities. The breakfast was very basic, but all we needed. The building is right in the Old Town, on the corner of Florianska Street, so there couldn't be a better location for exploring. But be aware, the location also means there can be quite a bit of noise from the street at night, particularly for an hour or so when the bars let out, so they provide ear-plugs for guest use. We never found it kept us awake, but it could be a problem if you are a very light sleeper.", "title": "Good location, great value", "user": "bzavitz", "date": "August 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 75945549}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Loved it. Great location. Reasonable price. And the people were very helpful and tried to steer us away from getting taken advantage of. Recommended. The only slight downside to the location was the noise from the streets, but that wasn't a big deal.", "title": "Good location, even better people", "user": "RobertoEscobar", "date": "August 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 74916238}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Parking and transportation can be tricky in any of these bigger cities, and Trecius provided GOOD directions, maps, and advice to make our arrival and stay a delight. They had great breakfasts and a quiet location just off the old square in oldtown Krakow. Although not a fan of TV on trips, having a nice one in our spacious room allowed us to catch the USA in the World Cup during our stay. They also have \"Krakow in your pocket\" guides which proved to be very helpful. I recommend staying here if your trip includes Poland", "title": "Marvelous B&B, great location near square, HELPFUL and friendly staff", "user": "pauleklund", "date": "July 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 71047641}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "We arrived worn out, disgusted, and disgusting, yet we were ushered kindly into peaceful refuge in an old stone building, in a room with high ceilings, thick walls, tall windows, and a sparkling bathroom. It was mere steps to the Barbican Gate or to the Old Town Square, and yes, people were walking around and making noise sometimes in the street below. But they were speaking, and singing, in Polish, so that was a benefit!", "title": "Trecius provided perfect assisted recovery from the indignities of air travel.", "user": "jzdro", "date": "July 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69574381}], "location": {"country": "Poland", "region": "Southern Poland", "continent": "Europe"}, "variance": {"poor": 2, "average": 3, "very good": 38, "terrible": 0, "excellent": 88}, "slim_ranking": 0.0754716981132}