{"user_rating": 5.0, "review_count": 138, "name": "Trehaven Manor Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "I won't write a long review here - I really just want to endorse what everyone else says about the place: outstanding hospitality from lovely people; close attention paid to every detail; and an attractive old building in a delightful location. We messed them around at short notice and had to cut our stay from three to two days (see our Hell Bay Hotel review for the reason why!). So I fully expected to still have to pay the full amount because they didn't manage to re-let the room, but was delighted when they waived payment for the third night. Looe itself was a revelation - great to see a small town so \"alive\" with acitvity. And the hotel, just on the edge of the town, is the perfect peaceful antidote. But be warned, stay here and you will never want to stay again in the second and third rate corporate hotels which fall so far behind gems like this. And if you are reasonably fit don't miss walking along the Cornwall Coast Path towards Polperro. It's a beautiful walk with an excellent tea room half way and can be easily completed in a day.", "title": "Great stay in Looe", "helpfulness": 2, "user": "Blackstone", "date": "July 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8101349, "likes": {"liked": "— the owners", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "If there is one thing that you will remember about your stay in this lovely little hotel, it will be Ella. From arrival to departure, she was a picture of friendliness and helpfulness. Cream teas upon arrival (they were the best we had in Cornwall) were a foretaste of the culinery bounty which lay ahead. The cooked breakfast was consistently good and enough to set you up for the rest of the day - the freshly baked croissants were excellent too. The staff were both polite and helpful at all times.", "title": "The hostess with the mostess", "user": "moz77", "date": "June 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8025694, "likes": {"liked": "— The owner"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Throughout the stay Ella recommended where to go and eat out, gave us maps to help us find our way round, and was always willing to enter into a bit of light-hearted craic. She was the perfect hostess and her hard work, dedication and professionalism with which she runs the hotel makes her worthy of every success in the future. If you are staying in Looe, stay here - you won't be disappointed.", "title": "A home from home", "helpfulness": 7, "user": "U2fan", "date": "June 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7937364, "likes": {"liked": "— It's welcoming staff", "disliked": "— The steep path / steps to get onto the main road!"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "Trehaven Hotel has got to be one of the nicest hotels I've ever stayed in. Ella, the owner, is the perfect host and makes you feel so welcome and at home as soon as you step through the door. Every member of staff we met during our staff was helpful and totally charming.", "title": "super b & b", "helpfulness": 1, "user": "go'connor", "date": "May 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7715624, "likes": {"liked": "— large room , great position, and special hosts", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Ella's complimentary home made cream tea on arrival was the perfect \"pick me up\" after a long six hour car journey to get there. Whilst you're sipping your tea, she runs through the restaurants in the local area and advises which ones to avoid!", "title": "Lovely B & B", "helpfulness": 2, "user": "Mildredmoo", "date": "April 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7345170, "likes": {"liked": "— It was clean and fresh and the service was first class.", "disliked": "— As we said, just the mattress - but that might just be us!"}}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 0, "average": 0, "very good": 6, "terrible": 0, "excellent": 132}, "aka": "Trehaven Manor Hotel Looe, Cornwall", "slim_ranking": 0.0677966101695}