{"user_rating": 5.0, "review_count": 218, "name": "Tres Sirenas Beach Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We would have loved to spend more time in this delightful spot, but were booking in January for March--and with only four rooms, Tres Sirenas is booked far in advance. Although there's a three-night minimum, Lisa had two nights available between other bookings, and we took them, based on these reviews and the inn's website.", "title": "Crashing waves, fabulous location, wonderful hosts", "user": "wunderwoof", "date": "March 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26464793}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "We had one of two Ocean rooms. There are also two suites. Small pool and hot tub with cushioned lounges right outside the sliding glass door, and the beach just beyond that. Normally the surf isn't too rough here, but it kicked up our first evening, and we got to listen to waves through the night. Just wonderful. There's a hotel next door that has a bar playing music at night, but it wasn't too loud and stopped promptly at 10pm on weeknights. A grocery store and some beach restaurants are within walking distance. But you'll need a car. No on-site parking, okay street parking.", "title": "Couldn't have been better.", "user": "The_Leske_Gang", "date": "March 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25654696}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "The room isn't spacious but is plenty big enough, has a microwave, small refrigerator, TV, hair dryer, comfy chair with lamp in the corner. Bring a book light--in our room, there was a lamp on only one side of the bed, so the person on the dark side has a tough time reading in bed.", "title": "Awesome Boutique Inn in an Awesome Location", "user": "sadiecutie", "date": "March 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25551096}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Breakfast was yummy, served at tables outside each room. While in Rincon, go watch the surfers while having lunch or happy hour at Calypso Cafe. And we also had a wonderful dinner at the restaurant at the Lazy Parrot.", "title": "Enjoyed our time in this lovely inn", "user": "ohiotripper", "date": "March 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25508786}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Thanks Lisa and Harry. Usually we don't return anywhere because there are so many other places we haven't been yet. But your delightful inn just might lure us back. --S and T", "title": "Beautiful accomodations and relaxing atmosphere", "user": "TravelBug1029", "date": "February 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25214084}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "We just returned from a 5 day stay at Tres Sirenas and cannot wait to start planning our return trip! We enjoyed everything this tranquil and beautiful Inn has to offer ... fabulous location with unbelievable sunsets, falling asleep while listening to the surf right outside our room, relaxing on the beach or by the lovely gardens by the pool, enjoying all of the local restaurants and activities recommended by our incredible hosts, snorkeling, kayaking, delicious breakfasts ... I could go on forever about what a fantastic time we had.", "title": "Perfect Get-Away!", "helpfulness": 1, "user": "dormobile109", "date": "February 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24247237}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Harry and Lisa are the consummate hosts. Just to give you an idea of how helpful and friendly they are ... once we returned home from our trip, we realized that we had forgotten our camera on the beach on our last day there. We emailed them right away, and they immediately responded ... full of understanding at how upset we were to lose the photos from our trip, and are still trying to help us locate it! That level of kindness and concern is pretty rare, and it's part of what makes Tres Sirenas such a wonderful place to stay.", "title": "Bears Repeating", "user": "nickpeg", "date": "February 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24077427}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "While this may seem redundant, I feel it bears repeating since I always check the site for the latest reviews prior to traveling. Everything about Tres Sirenas is great: location, service, rooms, breakfast and views. My husband and I just spent five days here and loved it. The beach, pool, kayaks and comfortable patio areas will have you wanting to spend all your time here. And, there truly is no need to leave if you call Anna Can Cook as she will deliver your dinner to your room or patio. However, you will not want to miss having a late afternoon drink at Tamboo (another gorgeous view), dinner at Smilin Joes and Casa Islena Tapas (outstanding food), and watching the surfers from the lighthouse or the Calypso. One more plus, the oceanview room included a mini fridge, microwave, sink, and coffeemaker stocked with the essentials: coffee, cream, corkscrew, wine glasses, plates and silverware.", "title": "The Best", "user": "TheSecretDiner", "date": "January 26, 2009", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 23932571, "likes": {"liked": "— Location right on the beach", "disliked": "— Leaving"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with friends", "text": "We are not easily impressed, but our recent visit to Tres Sirenas has us satisfied at a new level. This Inn's location is right on the beach allowing for easy access for miles of sea glass hunting. Here the surf is moderate allowing for swimming. The Inn has kayaks for the guests. Daily breakfasts consisting of various fruits, pecan/banana pancakes, or omelets are served at your private outside table. This is a very upscale private (4 room) that we reccommend. Since it usually runs with 100% occupancy we suggest booking early. Oops, almost forgot, it faces west for killer sunsets.", "title": "LOVE LOVE LOVED this Inn", "user": "misslee337", "date": "December 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22804187, "likes": {"liked": "— The hospitality", "disliked": "— My stay was too short!!"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "I can not say enough about this wonderful find!", "title": "Best place to stay, best vacation!", "helpfulness": 1, "user": "slarty62", "date": "November 23, 2008", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 22101886, "likes": {"liked": "— Being beachfront.", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "We just returned from the most wonderful vacation at the oceanfront property, Tres Sirenas Inn in Rincon, PR. [--]The place was gorgeous, the accomodations lovely and the rooms were so beautiful and comfortable. The owners Lisa and Harry were so on top of everything, so hospitable and fun. They gave us the name and number of a great masseuse named Jeff who came to our room. It was THE BEST massage I have ever had (and I've lived in LA and NYC). Another night, we didn't want to go out to dinner or cook in our kitchen, Lisa gave us the name of a woman who cooks gourmet meals AND DELIVERS THEM TO YOUR DOORSTEP! it was amazing. We found the people who lived and worked nearby friendly and helpful. We always felt safe walking or driving the area! We will return again and again.", "title": "LOVED LOVED LOVED Tres Sirenas", "user": "caliali46", "date": "November 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21732910, "likes": {"liked": "— The rooms, the ocean, the service", "disliked": "— we loved everything"}}, {"rating": 5.0, "title": "Great Spot, Great Value", "text": "They views are incredible and we just really loved it!", "user": "Perelman", "date": "October 28, 2008", "id": 21336433}, {"rating": 5.0, "stay_parameters": "Stayed October 2008", "text": "Was lucky to see this small bed and breakfast in Travel & Leisure. Called and stayed for three nights. The drive down the block doesn't prepare you for the breath-taking setting right on the beach. Lisa was a very winning hostess and the private pool was great, with the waves breaking just on the other side of the wall. Lots of lizards, pelicans, Frigatebirds. Two-minute walk to a classic beachfront bar where they prepare their coconuts with eye-opening machete chops. Really liked Rincon as well and Harry and Lisa directed us to excellent restaurants.", "title": "Woonderful!", "user": "SariC16", "date": "October 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21033095}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Absolutely wonderful! Can't say enough about how lovely this inn is. My boyfriend and I stayed in the Sea View Apartment for 3 nights and it was heavenly. Thanks, Lisa and Harry!", "title": "I want to move there!!!", "user": "oxymoron613", "date": "September 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20370199, "likes": {"liked": "— The views, owners, food, atmosphere!!!", "disliked": "— That we couldn't stay longer!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "This was the most amazing place that I've ever stayed. My boyfriend and I stayed for 4 days at the Inn, and we loved it. The views were amazing, the rooms were exceptionally clean. Harry and Lisa (the owners) were very nice and accomadating without being overwhelming. It was very quiet, and we had a blast. The breakfast was so good it became one of the things that we looked forward to everyday! Overall, great place...geat experience. We would travel back in a heartbeat!!!", "title": "Perfect Honeymoon!!", "user": "ricosgirl08", "date": "August 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18924770, "likes": {"liked": "— The view, the awesome breakfasts, the owners", "disliked": "— nothing, not a thing!"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Beautiful location, welcoming owners, calm sleep with pleasant wave whisper, delicious breakfasts on the terrace of the ocean-front suite - everything was just perfect.", "title": "Magnificent getaway.", "helpfulness": 1, "user": "NYC_Firegirl", "date": "July 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18321296}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Just returned from our stay at Tres Serinas. The gourmet breakfast on the ocean front terrace each morning at 9:00 was a beautiful way to start the day! The inn shares kayaks, snorkeling equipment, surf boards, etc. The owners, Lisa and Harry were very generous with ideas and suggestions for restaurants, tours, and activities. Very relaxing atmosphere -- we will definately return.", "title": "Great Get Away!!!", "helpfulness": 3, "user": "dwcjmc", "date": "June 14, 2008", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 16927263, "likes": {"liked": "— clean, spacious, comfortable suite!", "disliked": "— can't think of anything"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Our 4th stay at Tres Sineras beach front Inn was simply stunning! Upon arrival, we received a warm greeting from the Inn Keepers, Lisa & Harry. You are immediately taken back by their beautiful surroundings and their incredible Inn. Lisa prepares the best gourmet breakfast and every day was a special treat. Harry was so accommodating in showing a beginner how to kayak around the ocean front. They have 3 kayaks for guest utilization. There recommendations for restaurants are simply well worth it. Sushi at the Pool Side Bar and Seafood at the Ship Wreck with restaurants was delicious! Lisa, you were right, Sushi in Rincon was a special surprise! Our 16th Anniversary dinner at the Horn Dorset Primavera made the trip well worth it! In Rincon, you can kayak, snorkel at the steps beach, dive at desecho island, charter a catamaran or just simply enjoy the grounds at Tres Sineras. Lisa & Harry are so accommodating and there recommendations are the best! Lisa, the Chayote restaurant recommendation in Miramar was succulent! Every visit has been special and our 5 nights during this trip was even better! With all gratitude & love, we thank you for a memorable vacation! Tres Sinreas is the number 1 Rincon ocean front Inn and is highly recommended for a special get away for couples and family. We always look forward to our next visit, Ed & Mileida from Hell's Kitchen NYC.", "title": "Tres Sineras, Rincon, Puerto Rico Number #1 Ocean Front Inn", "helpfulness": 2, "user": "eramos917", "date": "June 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16853653, "likes": {"liked": "— Tres Sineras is a beautiful ocean front inn with the best gourmet breakfast every day!", "disliked": "— No negative comments at all"}}, {"rating": 5.0, "title": "Tres Sirenas is Delicious", "text": "We just returned from 5 nights at Tres Sirenas. We met my sister and brother-in-law there to celebrate my 50th birthday! What a great time we had. I had never been to Puerto Rico and wasn't really sure about it until we arrived at the Inn. Harry and Lisa greeted us and showed us to our Oceanfront room/suite that was so clean and very warm. It had everything we needed and more. All four of us have done enough of the Big Hotel/Resort thing and staying at an Inn was just the right thing. Harry and Lisa are available when you need them, but give you privacy so you can enjoy your own group. We did a bit of everything...Snorkeling, beach, pool, napping and eating and drinking WAY too much. The Ocean is right in front of the Inn and you can listen to the sounds or jump in at any time. I was surprised how many good restaurants there were in Rincon and it was the off season! Lisa was so wonderful to book us a catered dinner on her patio at the last minute because we decided we didn't want to get dressed up for a fancy dinner to celebrate my birthday!! The food and the ambience were wonderful and I so appreciated her efforts. Also, her breakfasts were fantastic, and I'll be dieting this week to counter the effects of my indulgence. All in all a wonderful trip, a wonderful Inn, and a great town. I highly recommend it!!", "helpfulness": 1, "user": "YanniNc", "date": "June 5, 2008", "id": 16707711}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "Our vacation to Rincon, Puerto Rico was amazing and Tres Sirenas made our experience second to none. We stayed in the pool suite with our toddler (20 months) and it was just perfect. The suite was spacious, clean, and quiet with a beautiful view (and so tastefully decorated). Lisa and Harry were so incredibly gracious and helpful, but not intrusive to our peaceful, relaxing vacation. Breakfast was excellent with special accomodation for our daughter. The property is intimate and inviting. We will most definitely return!!", "title": "Tres Sirenas is second to none!!", "helpfulness": 1, "user": "octoberose", "date": "June 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16662823, "likes": {"liked": "— Peaceful, intimate, inviting setting", "disliked": "— We had to leave."}}], "location": {"country": "Caribbean", "city": "Rincon"}, "variance": {"poor": 1, "average": 2, "very good": 12, "terrible": 4, "excellent": 199}, "aka": "Tres Sirenas Beach Hotel", "slim_ranking": 0.1, "description": "Tres Sirenas Beach Inn, located directly oceanfront, is a full service Bed & Breakfast in the heart of Rincon. This Small Inn offers the discerning Rincon visitor who wants to stay on the beach an intimate lodging with only five exclusive and elegantly appointed units in all. Decorated in a West Indies style, each of which feature breathtaking direct oceanfront views. Two full apartment suites with full kitchens, living rooms, Private Master bedrooms, with additional sleeping lofts, and private oceanfront verandahs are offered for guests who enjoy space on Holiday. Amenities include daily gourmet breakfast served on your verandah, maid service, pool, unheated Jacuzzi, premium cable TV, wireless internet, A/C, Fans, mini fridge, microwaves, DVD library, complimentary snorkel equipment, Paddle boards and kayaks for rent, lovely gardens, onsite spa services, concierge service, private chef catering, Cooking Lessons, Private Yoga Lessons and convenient location on the best swimming beach with many nearby restaurants and Beach Bars to enjoy. Featured in Travel & Leisure, Conde Nast Traveler, NBC Today Show, designated Best Beach Budget Lodging, Fodor's Choice, 2011, 2012, recommended by Frommer's. It is recommended for travelers who want to wake up on the beach, and enjoy the sounds of the waves lapping on the shore as they sleep. If you are coming to enjoy the Caribbean, stay on the beach in this small family run business, with great Innkeepers."}