{"user_rating": 4.5, "review_count": 326, "name": "Trigony House Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Booked online having read reviews on trip advisor. Stayed one night breaking our journey to Aberdeenshire. The room was good but dinner was really excellent with attentive staff. Breakfast was similar. Will definitely return", "title": "Friendly and homely", "user": "David P", "date": "April 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 158186498}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We have stayed at Trigony House Hotel on a number of occasions now. We recently returned from a 3 day stay with our dog and young baby. The trip was relaxing as usual. The staff could not have been more friendly or helpful. They went out of their way to accommodate us - even offering us breakfast earlier than it is usually served because this suited our needs (with our baby waking up early!) We ate 3 meals per day at the hotel as it so worked out, and the food was of a very high standard. There was a large party eating in the restaurant one night and the service was still very efficient! There is a great option of eating in the bar area for those who wish to have their dog with them - although the restaurant tends to be more popular (it is the same menu throughout). Our room was clean and comfortable (our only complaint would be that the garden suite is very difficult to book as it is so popular and we'd prefer to stay in that room due to its size and the amount of stuff we have to take with us with a baby!)", "title": "Relaxed & Welcoming", "helpfulness": 1, "user": "RSMEdinburgh", "date": "April 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 158127303}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Why do we love this hotel?", "title": "Cosy and friendly", "user": "Vicki B", "date": "April 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 158057163}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "It is cozy, friendly and relaxed. The food is great - and there is a great wine list too - even the most reasonably priced wines are of a really high standard. Nothing is too much trouble for the staff of the hotel. The grounds are lovely for a quick stroll around. The hotel is dog friendly but does not smell of dog at all! In fact the hotel is very clean and the rooms are all individual (we've stayed in most of them!) I really don't know why people have left negative reviews - we've been here many times and the standard has never fallen short of our expectations.", "title": "Escape to the country!", "helpfulness": 1, "user": "CharFarr", "date": "April 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 158002858}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "We stayed here in early April for 2 nights on a 'tour' of Scotland. We booked as the website advised the Hotel was dog friendly - and it most definitely was... dogs allowed everywhere other than restaurant. doggy treats in the room, walks, water bowls and enough space in the rooms to let the dogs wander.. the staff are friendly, the views are lovely, the recommended walks are very enjoyable and the food was wonderful.", "title": "Cosy, comfortable hotel in beautiful surroundings.", "user": "Annie H", "date": "April 14, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 157718133}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Three of us stayed one night on a dinner, bed & breakfast basis. We received a warm welcome on our arrival and spent the afternoon in the beautiful gardens before having dinner in the restaurant. Our room was elegantly and comfortably furnished and very quiet. We chose the two-course menu at dinner. The quality of the food was excellent and all the dishes were attractively prepared and nicely presented. Breakfast was similarly of good quality and we were offered a range of breakfast options. We really enjoyed our stay at the Trigony House Hotel and would not hesitate to recommend it to others.", "title": "A delightful hotel", "user": "M0nB1", "date": "June 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 164829247}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "At the end of May we returned to Trygony hotel for a second visit taking our Border Collie dog with us. We were made to feel very welcome and dog biscuits were waiting in our large deluxe room for Milly. We had a very comfortable bed with nice linen and a good bathroom. However the paintwork in the room was very tired and although the room was very clean the areas around the door handles etc were grey.", "title": "A character hotel with great food and a warm welcome", "user": "Angela P", "date": "June 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 164351825}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "In the restuarant overlooking the garden the food was all freshly cooked, nicely presented with detail given to combining flavours and using very good quality ingredients. The staff were very friendly and efficient. At breakfast we highly recommend the smoked salmon and scrambled egg.", "title": "Slightly disappointing", "user": "LadyGAxbridge", "date": "June 13, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 163878753}, {"rating": 1.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We can't wait to return again to this hotel it is complete relaxation in a very nice setting.", "title": "Expensive", "helpfulness": 1, "user": "Kevin M", "date": "June 10, 2013", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 163544555}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We were given a warm welcome on arrival and given a choice of rooms, we chose room 6 which overlooked the pleasant garden. It had comfortable twin beds, a sofa and adequate space. The bathroom was a good size having a bath and overhead fixed shower. Unfortunately we could only get cold water from this shower but the bath mixer delivered all the hot water we required. Dinner was very good. Breakfast was not self-service, unlike everywhere else we had stayed in Scotland. Also, the service was rather slow and haphazzard. We had a long journey in front of us so were anxious to leave promptly but even then the bill was a long time being prepared. Overall a pleasant enough stay but compared with all our other hotels in Scotland it could do better.", "title": "Good Overall but could do better", "user": "alison14210", "date": "May 18, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 161054566}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "My husband & I have just returned from a very relaxing & enjoyable stay at Trigony. From the minute we drove down the lovely driveway we knew we'd done the right thing booking there. All the staff are friendly & helpful. The building itself is warm & welcoming, especially with the log fires roaring, from the lovely staircase to the dining room overlooking the beautiful garden the house has character. Our room was upstairs, overlooking the garden & hillsides. With a lovely chaise lounge by the window we really made use of the beautiful views with Bottled water, lovely beverages & homemade shortbread provided too. In the bathroom we found locally made toiletries which smelt gorgeous. We ate in the restaurant both nights, it was only going to be the 1st night but the food & service was so good we couldn't have found better elsewhere. While we looked at the menu we were treated to a glass of free champagne & olives with the most delicious home made, warm, melt in the mouth cheese biscuits, yum. Words fail me on the breakfast. There was a great range of choice, including a huge cooked breakfast which had the best ever haggis in it. All the food was delicious from the home made bread to the local cheese & home made oatcakes. I was a bit worried about the welcome dogs comments, as not overly keen on them, but although we saw the owners dog, which was very well behaved & quiet & the occasional visitors one in the hall way or bar, we didn't hear any barking and certainly not bothered by any. It was a delightful stay & we will hopefully be back as soon as we can.", "title": "fabulous 2 night stay", "helpfulness": 1, "user": "lisacolsh", "date": "May 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161007539}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We stayed for 2 nights in a smallish garden room. Lovely view over the small formal garden/terrace which was extremely colourful and well maintained. It's a comfortable hotel, not a glamourous top end one (if you want that then book Knockinaam Lodge and be prepared to pay much much more). Service attentive, decor pleasant and there are nice lounge areas to enjoy a drink or coffee in front of the fire. Food menu more ambitious than most country house hotels and on the whole it hits the mark, with generous portions and a good use of local ingredients. Genuinely interesting wine list with a range of prices. On the whole excellent vaue for money and would return.", "title": "Comfortable country house hotel", "user": "Wombat1972", "date": "May 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 160445983}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We had a great stay at Trigony House and so dog friendly. Our two small dogs being made very welcome with their own welcome pack. We stayed for six nights and enjoyed excellent meals each day. We loved the spicy haggis for breakfast and the delicious homemade marmalade and raspberry jam (you can order and take a jar home - well worth it!) Coming in from a cold walk on the hills to the warmth of a log burner and cup of hot chocolate taken in the lounge was perfect. Our superior room was spacey with a good outlook onto the hills. The owners and staff are very friendly and switched on to what guests like on a break away. We are planning to return again this year to see the flowers out in the beautiful gardens. Trigony House we feel has something special to offer.", "title": "Fab Trigony House", "helpfulness": 1, "user": "Nancollas", "date": "May 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 160151310}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We stayed 3 nights and it was wonderful in every way. The beautiful garden was a treat to look at from the dining room and the food was first rate, fresh and well cooked. Walking from the Hotel offers a good variety of loops and Adam has provided good maps and directions. Our room was not large, but clean and comfortable. The bath was spacious, clean and had lovely organic soaps. We would return again in a heartbeat and just wish it wasn't so far away.", "title": "Wonderful in every way", "user": "E F", "date": "May 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160029749}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We stayed at Trigony House for 3 nights during April 2013. We found the staff extremely friendly and helpful, the food wonderful and the venue has plenty of character. The entrance hall is decorated in mellow, warming tones of wood and the wood burners make the hotel very cosy. Our room was comfortable and clean. There are walks from the hotel which allow guests to explore the locality and it`s scenery at their own pace. The local people are very friendly and will have a conversation or at least acknowledge visitors in passing. Trigony House has a unique charm and visitors appreciate this. This venue is well worth a return visit.", "title": "Enjoyed our stay", "user": "Durhamwalkers", "date": "April 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 158293727}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We stayed for 1 night in July on our way back South after a holiday in the Highlands.The house is a lovely 1700s hunting lodge, beautifully kept, with a lovely garden and fabulous location in the low hills of Dumfries. The original owner must have laid out the trees in the garden 200+ years ago and we benefit from them now. We had the Garden Suite, which was spacious and very well appointed. The best bed I have had in a hotel for many a long year. The suite even had a private area of the garden where we could sit and enjoy the weather.", "title": "Rleaxed stay in lovely house", "user": "wine_searcher", "date": "July 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168040009}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Service is excellent - not obtrusive, but staff appear whenever you might want them. When we arrived we were greeted by Adam (proprietor and chef), who came out of the kitchen to welcome us. Drinks in the evening could be served in the garden - perfect for a warm summer's evening. If I want to be picky, the residents' lounge could have been laid out better, but this is a touch of timelessly elegant living of a country house hotel at its best.", "title": "Only 2 nights wished we could have stayed longer", "helpfulness": 1, "user": "John J", "date": "July 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167047554}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "The food was terrific. The cuisine is imaginative and beautifully constructed, and a chance to try dishes one would not find in the ordinary course of events. Some ingredients I really did not think would go together, but they did. A really lovely meal.", "title": "Extra Special Touches", "user": "lauraandhercamera", "date": "June 29, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 165647126}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "My wife, myself and Joe our greyhound took the opportunity to have a 2 night break at the Trigony whilst our teenage daughter who was on an outward bounds course. Upon arrival we had a friendly greeting before being showing to our room where there was a welcoming pack for the hound. The room overlooked the garden, both bedroom and bathroom were clean. The food at the Trigony was fantastic and the service excellent. Both my wife and myself had an enjoyable and relaxing stay and will have no hesitation to return to the Trigony for a longer stay.", "title": "An amazing experience", "user": "Robin E", "date": "June 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164933678}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "This is one of those places where you can tell someone has thought long and hard about those extra little details that make your stay really special.", "title": "Great", "user": "Denise H", "date": "June 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164916352}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 9, "average": 20, "very good": 61, "terrible": 7, "excellent": 229}, "slim_ranking": 1.0, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Trigony is a relaxed laid-back country house hotel in the heart of south west Scotland. With an ideal location to enjoy exploring this hidden corner of Scotland, from the dramatic Solway Coast to the rolling hills of the southern uplands. Our award-winning rustic cuisine, open log fires, beautifully landscaped gardens and friendly local staff all combine to create the perfect holiday."}