{"user_rating": 4.0, "review_count": 70, "name": "Trinity Bed & Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Trinity B&B's an excellent choice of accomodation in Rome. The room was huge (very unusual in Rome) clean and contained a fridge,Tv Lcd Sat. There's free wireless. Also unusual was the availability of an elevator.The area was quiet at night and is mainly residential, which made it safe. To be in easy walking distance to the Closseum is fantastic. The breakfast in very good and it's served in your room, fantastic thing!!. Close to restaurants (I recommend RomAntica accross the road, wonderful restaurant where you get 10% discount), and coin-op laundry.Great Staff !!.Overall, there was nothing to complain about and I would definitely stay there again. Highly recommended.", "title": "Great Place !!!", "user": "VictoriaWW", "date": "November 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49789171}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "This is not a hotel but an apartment in a building block consisting of offices as well as apartments. One of the apartments is used as a bed and breakfast service called B&B Trinity. The owners dont stay there but they speak English well and provide you with all the help you may need over phone.The best feature of this B&B is that the rooms are spacious. Our kids had a field's day inside. The room and the bathroom are sufficiently clean. The air-conditioner works efficiently. But the breakfast which comes with the room is just about sufficient for small eaters. It's very well-connected by metro( only two stops from Termini). The only downside of what could be a smooth stay is that the manageress in charge of B&B Trinity doesnt speak English at all.However that doesnt come in the way of her services. In fact we found her to be efficient. B& B Trinity is value for money.", "title": "Luxury of space", "helpfulness": 1, "user": "Mi2n", "date": "June 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 32240263}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Only a 10 minute walk from the colosseum, 2 minutes from nearest Metro. The owners were very friendly and helpful. Checkout is normally 11am but as our flight wasn't until 11pm they let us hang on to the keys so that we could leave our luggage and have a shower before we travelled. The breakfast was beautiful fruit filled croissants and crisp bakes with jam, coffee, and juice; a traditional continental breakfast!! The bed was comfortable and the room and bathroom was clean, what more can you ask for!!!!!!! And the restaurant across the road is good too!!!!", "title": "ideal location, clean, very friendly and kind.", "user": "kazzy69", "date": "June 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 31934929}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled solo", "text": "I sayed at this B&B for one night. It was clean and the location was ok and very close to the metro station. I had a TV in my room but all of the chanels were in Italian.", "title": "Awfull Breakfast", "user": "Looti", "date": "June 3, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 16650941, "likes": {"liked": "— Location", "disliked": "— The staff were not friendly, the breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We arrived at the train station and met with tourist information desk, they were very helpful. The B & B is about a 10 minute walk, but not too bad. The B & B is on the 2nd floor and very charming. I think it only had about 6-7 rooms. The person who greeted us spoke little english, but we knew where we needed to go. The B & B is only 2 minute walk to the metro, which was nice. Rome is very big and metro access is a plus. We were given keys to all doors and access was never a problem.", "title": "Good value, great location", "user": "kinoxl", "date": "November 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 85608372}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We saw the Colleseum and the forum on the first day. Tip #1, get the roma pass, it saved us a whole lot of time and $. We literally walked past hundreds of people at coloseum and Palatine/forum. They have special lines for it. It also gives you free metro rides for 3 days.", "title": "Wonderful Experience", "user": "joeandde", "date": "October 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84337831}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "We came back for an afternoon nap, this was a negative side. While the hotel is many blocks from the train station, a vibration in the windows can be heard upon arrivals, which are frequent. Couple this with a parking lot next door and noise from floors above made taking naps not enjoyable. Sleeping at night was better as trains are less frequent and let's face it, you're really tired after walking around Rome.", "title": "comfortable stay and convenient location", "user": "elle98", "date": "October 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82336206}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We did the Vatican the next day, (buy tickets beforehand) again saved alot of time. We saw Trevi fountain, spanish steps and Panteon. We did not see St. Peters square due to some stupid school children event.", "title": "Great little place on the Esquiline Hill.", "user": "N2RUINS", "date": "July 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 72068002}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "We had to leave very early the next morning, and the owner brought us our breakfast early and even offered a wake up service at 4:30am. She never came, but we were up already. I also spoke with her before we arrived as I had to change dates, she was very accomodating.", "title": "Clean and comfortable", "user": "MANDI51", "date": "July 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 70785028}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "Hotel location is fantastic - Less than 5 minutes to metro station, 10 minutes walk to Colosseum, 15 minutes walk to Termini train station. The staff is dedicated to guests satisfaction. Everything that was said, had been done exactly as promised. Museum reservations were arranged perfectly well in advance. Taxi to airport came 5 minutes before arranged time. Very efficient management! Good breakfast for not very food demanding people. Excellent coffee. Room is very spacious with high ceilings. All appliances worked great. The Hotel itself is an interesting Rome experience.", "title": "Great Place", "user": "gprasov", "date": "June 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68069608}, {"rating": 5.0, "title": "Excellent trip location", "text": "A great, safe hostel in a decent location about 10 minutes walk from hostel to Colosseum and other attractions in Rome. Definitely a good place to stay when visiting Rome. Really enjoyed my stay here. The room was nice and clean . The staff is very friendly and helpful, speaks both English and Italian.", "user": "racianu", "date": "June 9, 2010", "id": 66935328}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "This is not a hotel, but a suite of rooms in an apartment. Stayed here for five days. Large room, clean, and a 10 minute walk from the historical sities. Perfect! Breakfast is light, which is fine for me. Staff was friendly and helpful. Lots of local resturants that are good nearby. Good find for the seasoned traveller.", "title": "Great Value", "user": "profjung", "date": "June 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 66581964}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "Most of the prior reviews accurately describe this B&B. Large room was adequate for 4 people. Great value for a family of 4 staying in Rome. It was very convient to the Metro which was important to us since that was our main means of transportation. It is close enough to the Colosseum to walk. This B&B is really 3 rooms of a larger building that has another B&B and office space. The owner spoke fluent English & gave us her business card in case we needed anything 24 hours a day. The recommendations for restaurants was helpful. Breakfast was adequate. I would stay here again.", "title": "Great value for family", "user": "bedford123", "date": "May 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 65732351}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "My wife and I had a great time. The room we stayed in was big with 3 beds a tv and a Fridge. It took 10 minutes to walk to the Colosseum, 5 Minutes to the bus and subway. What a great time we had. Location was great and the restaurant across the road called the romantica, we ate hear 4 times during our 7 night stay and you get a discount for staying at the Bed and Breakfast. I will say breakfast was a bit small but for the price it held us over tell a mid day snack. Everyone was great and we felt welcomed. If you need it and we did we got a massage next door for $30 EUR. It was worth it as well.", "title": "We loved It", "user": "Scott B", "date": "April 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 60326424}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "variance": {"poor": 4, "average": 4, "very good": 29, "terrible": 1, "excellent": 32}, "aka": "Trinity Hotel Rome", "slim_ranking": 0.280861640431}