{"user_rating": 4.0, "review_count": 300, "name": "Tropical Breeze Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Good value for money, super clean rooms, loads & loads of towels. Complimentary hot and soft drinks all day in the reception. Great location close USA no 1 beach and just yards from Siesta village. 100% recommended!", "title": "Great stay at Tropical Breeze!", "user": "mooshkin", "date": "November 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121049961}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Looked on line found the resort,called and they answered all my questions.Brought my new girlfriend up for a short visit.When we got there we found the resort and the employees to be very nice and willing to help.I rented the Honeymoon Suite,it was perfect,large and roomy!The Resort is a 5 min. walk to the beach and all the best places to eat.You can`t go wrong with the Tropical Breeze Resort.We will be back,this time for a longer stay.Thanks for a Great visit!", "title": "First Getaway !!", "user": "Kenny M", "date": "November 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120720038}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "We came all the way from northern Illinois to get married on Siesta Key beach. We hired Siesta Key Events and one of their preferred vendors was Tropical Breeze Resort. After reading the terrible reviews on the internet, I was very sceptical to book all 20 people that were joining us. I was reassured by Tammie from Siesta Key Events, that many of their brides have booked there and were happy. She was right! I couldn't have been more happy with our decision and her recommendation. We stayed in The honeymoon suite (114). It was HUGE. More than enough space. Our 16yr old and 4yr old boys had room 108. Our 21yr old and 19yr old daughters (and 2 boyfriends) stayed in 109. A little small for 4 adults but totally worked. My mother and stepfather stayed in 101, the best room of all the 1 bedroom resort suites (I think). They gave us a break on rooms, and our honeymoon suite that was at least 4x the size was the same price as the rest! The free breakfast in the morning isn't much, but it's not worth talking about here. There are 3 pools on the property. all clean but on the small side. The location is phenomenal!!!! We will definitely be returning!!! I can't rave enough about how perfect it was for our guests. Amy and Mic", "title": "Our wedding stay", "user": "Amy M", "date": "November 16, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120674076}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We held our wedding weekend celebration at the Tropical Breeze Resort and it was unbelievable! The hotel was beautiful and worked out great. Just about 100 yards from the beach (sunset point where we were married) and within walking distance to all of the restaurants, bars, laundry and market.", "title": "Perfect Wedding/Family Gathering Place", "helpfulness": 3, "user": "VMT0708", "date": "November 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120470957}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "We rented the entire pool house and rooms 130 – 160. All of the rooms have queen/king size beds and most of the rooms have a full kitchen with granite counter tops. The pool house has a common area with a huge kitchen, two dinning room tables, and two couches. It was the perfect gathering place for all of the events for the weekend.", "title": "Love this place", "user": "Valerie L", "date": "November 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 120231173}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Spent 3 days/2 nights at the TBR over Thanksgiving and it was the perfect getaway! We live an hour north of Siesta Key and have heard great things about this resort from friends - and needless to say we were not disappointed! Booked a one-bedroom suite and loved it! Separate bedroom and living room - plus a full kitchen (with glasses, silverware, etc) - made it feel like our own little beach cottage. And the location is perfect, walking distance to the beach and to the little village of Siesta Key with lots of bars, restaurants, grocery store, and shops.", "title": "Loved Siesta Key and Tropical Breeze Resort!", "user": "Livelife2fullest", "date": "January 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 122437013}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "Favorite things about the resort:", "title": "Wonderful people, amazing location, perfect vacation spot.", "user": "Metcamk", "date": "December 30, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 122306114}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Location! Close to EVERYTHING You Need for Relaxing Beach Vacation", "title": "Photos Don't Do it Justice", "helpfulness": 1, "user": "skygazer6", "date": "December 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121838753}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Super nice staff", "title": "An Excellent Place To Host A Wedding", "user": "Jon B", "date": "December 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121683244}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Quiet and relaxing", "title": "Great family gathering place", "user": "FUSD_11", "date": "November 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 121060087}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Being a native of Sarasota Florida, sometimes we don’t take advantage of the paradise that we live in. So, my husband and I recently decided to take a little break from our daily routine and booked a room at the Tropical Breeze Resort. I was really surprised at how cute the accommodations were. We stayed in room 164, which was a little efficiency that opened up to a tropical courtyard. The room was clean and the front-office staff were very friendly. We acted like tourists, taking advantage of the short walk to the beach and all of the festivities that Siesta Key Village has to offer. So, all I can say to my fellow Sarasotans is, if you are looking for a weekend getaway, It’s in you own back yard at the Tropical Breeze Resort.", "title": "Paradise in our own back yard", "helpfulness": 1, "user": "Nancy S", "date": "October 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119755269}, {"rating": 1.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "I live in Sarasota and stayed at Tropical Breeze 7 years ago before moving here and loved it, so when my sister and her 6 year old and 2 year old came for a visit, I told them to stay there. They are very low maintenance middle class people from the middle of Oklahoma and normally stay at Extended Stay or Best Western. They booked a room for two nights but left after the first, cutting our visit short because this hotel was so filthy. The kids' feet were black within the first 10 minutes of walking around the room which was a suite with a kitchen. There were pubic hairs stuck on the bathroom door which was right in your face when using the restroom. The fold out couch was so hard and thin that my six year old nephew wouldn't sleep on it because the springs poking through hurt so bad. The sheets kept popping off the mattress, had holes in them and the blanket they brought had a hole in it. The bathroom door could only be opened halfway before hitting the bed. My 90 year old grandmother, who was staying in a seperate room couldn't wash her hair because the shower was a \"trickle\". The ammonia odor was so strong, we smelled it before we opened the door to her room and it was sickening once inside. My sister was in room 109 which cost $167 after taxes for one night and my grandmother in 119 for $132. The reservation was made for two rooms a month out on the same credit card, yet they wouldn't even put them in adjoining rooms because all the rooms were \"booked\" once they arrived.", "title": "Filthy hotel, ruined a family vacation!", "helpfulness": 5, "user": "daisyj333", "date": "October 24, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 119671458}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "I don't know who is giving such high reviews for this place. Not only will I not recommend this hotel to anyone again, I will warn everyone I know to avoid it.", "title": "Good location, needs updating", "helpfulness": 1, "user": "shick66", "date": "October 17, 2011", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 1.0, "location": 5.0}, "id": 119389885}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "This was our second time staying at Tropical Breeze. This year I asked to be closer to the beach... we were placed in room 274. Nice ocean view from the room, but these rooms definitely need updating. The couches were old and dirty, the bathroom was old, closet doors would not close, vanity doors did not close. We were disappointed in this room. The best thing about this hotel is location.. short walk to town and a few yards to beach.", "title": "Quaint hotel, excellent location....only one complaint", "user": "DdbB99", "date": "October 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 119238234}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "This was the first time I have visited the Siesta Key area and first time in this hotel. We stayed in room 108, the one bedroom suite right next to the registration office. I would definitely consider returning to this hotel. The best thing about the hotel is LOCATION. It is a two minute walk to eat and shop and a less than 5 minute walk to the beach. The public beach is a short bike ride away and well worth the extra time to get there. The hotel staff was friendly and very quick to meet our needs. The continental breakfast was a little disappointing....juice/coffee and muffins. We grabbed muffins for snacks and went next door to the Broken Egg for a full breakfast. The hotel itself is really quaint. The screened in patios were really nice, especially for our two little dogs. The suite was a little cramped on room. The bed pretty much took up the entire room and we had to squeeze by it to get to the bathroom. The bathroom was clean and had adequate space. The biggest issue was the bed is on wheels and on a tile floor. Not suitable for honeymooners!", "title": "Another Fabulous Stay A Tropical Breeze", "helpfulness": 1, "user": "cbaymartin", "date": "October 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118910395}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "We stayed in room 155 and were in town for a wedding being held at the resort. The room was very nice and spacious. Having the kitchen was a nice surprise as well as the small sofa in the bedroom area where we could watch TV. I loved this location and how quaint it seemed. Being able to walk everywhere we wanted to go in Siesta Key was a real bonus and we will definitely be back.", "title": "Great location and convenient access to shops and beach", "user": "Jennifer G", "date": "September 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 118747221}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We stayed in a 1 bedroom 1 bath 1 kitchen condo. There was plenty of room but it was configured oddly so much wasted space. The bathroom was something out of the 1950s at best, but relatively clean. Staff was friendly and the location is great. My only complaint is that I have stayed in Maui for less per night and had a MUCH nicer, larger, renovated room. Not a bad place to stay if you need a full kitchen. The pools were much nicer in the photos than in reality.", "title": "Seemed over-priced", "user": "Jennifer_Wright", "date": "September 24, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 118536134}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "If you are looking for a chain hotel thankfully this won't suit, because it has an individual charm close to the wonderful beach.", "title": "Want to return next year", "helpfulness": 1, "user": "John P", "date": "September 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 118462969}, {"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "My wife and I travelled Florida and this was the nicest place we stayed at. Particularly enjoyed the service of chairs and parasol being ordered and delivered to beach area \" nice touch \".", "title": "Horrible trip", "helpfulness": 4, "user": "JanArt32779", "date": "September 6, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 2.0, "service": 2.0}, "id": 117771544}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "It's proximity to Siesta village with great bars makes it an ieal choice, and one we will make again next year when we return.", "title": "Wonderful", "user": "MisterMJL", "date": "September 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117766984}], "location": {"country": "United States", "city": "Siesta Key"}, "stars": 2.5, "variance": {"poor": 26, "average": 31, "very good": 92, "terrible": 24, "excellent": 127}, "aka": "Tropical Breeze Hotel Siesta Key", "slim_ranking": 0.846153846154, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Your ideal choice for Sarasota & Siesta Key Beach Hotel and vacation rentals, the Tropical Breeze Resort on Siesta Key provides lodging directly near Siesta Key Beach. Choose from our unique Tropical Breeze Resorts accommodations featuring efficiencies, one bedroom and two bedroom suites. We're also \"pet friendly!\""}