{"user_rating": 3.5, "review_count": 353, "name": "Tropicana Aruba Resort & Casino", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "It is my understanding that this property was formerly a timeshare called The Aruban. Although we requested a renovated room, our request was not honored. We are used to a much higher standard. The room was circa 1980's at best. You can find pictures online. The positives are that the room was clean and a one bedroom roomy apartment. Contrary to what other reviewers have said, all of the appliances were in working order, the shower had good water pressure and the bed was comfortable. The hotel is across the street from a supermarket and across from beautiful Eagle Beach. Location could not have been better. All of the other hotels were sold out as we booked last minute so we chose this for the location. Our room was on the first floor with the back door facing the courtyard where the barbecue is. There was a creature that sounded like an alarm going off that kept me up most nights.", "title": "In Need of Renovation", "user": "Dragonfly945", "date": "August 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 173023784}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The hotel staff were not very friendly and made us feel a little uncomfortable.", "title": "Continues to improve", "user": "vacationer827", "date": "August 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 171542001}, {"rating": 1.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We happened to be walking through the reception one afternoon and were given an invitation to go to a manager's reception in the casino. They served complimentary drinks and appetizers and had a slot tournament that was fun.", "title": "Buyer beware!!!!!!!!!!!!!!", "helpfulness": 1, "user": "Chris P", "date": "August 8, 2013", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 5.0}, "id": 171331452}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Pablo was very nice and the weekend concierge was wonderful!", "title": "Peaceful Paradise", "user": "candace g", "date": "July 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 168645017}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Overall, this hotel is run down in need of major renovation and it doesn't appear to be happening any time soon. For us, the location made up for the accommodations.", "title": "Family Fun!", "helpfulness": 1, "user": "JSLinNYC", "date": "July 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 168447427}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "My wife and I purchased a timeshare at The Aruban, now the Tropicana, 5 and 1/2 years ago after being shown a beautifully updated unit. We were told the rooms were in the process of being updated starting with the first floor units in the building next to the waterfall pool.", "title": "Where are the room upgrades???", "helpfulness": 1, "user": "Bill_Sack", "date": "July 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 168222379}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Well, here we are in July 2013 and the only upgrades we noticed in our building were new curtains and a new small rug on each side of the bed. We were EXTREMELY disappointed to check-in, open the door to our unit and see the same old kitchen, dated bathroom, nicked up floor tiles and a bedspread that looks as if its from 1978.", "title": "just got back from Tropicana....", "helpfulness": 2, "user": "jenniko078", "date": "June 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165339947}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "On the bright side, the units are a good size and are kept very clean. The beach is a short walk away and the pool area is relatively quiet and relaxing compared to other resorts. Will keep our fingers crossed that the room upgrades eventually happen.", "title": "My weekend stay at the tropicana", "user": "Angela K", "date": "June 25, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 165250739}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "our stay was great can't wait to come back. there was free wifi in the lobby area....actually i got it in my room and by the waterfall pool...i guess it depended how close to the lobby your room is to get it in the room. Tropicana is close to Eagle Beach which was amazing...my 10 year old loved the pool and beach. the waterslide pool was closed for renovations, we were looking forward to that pool area, but to renovate something, it obviously has to be closed. I would definately recommend Tropicana to anyone. oh, btw, the rooms have kitchenette's (toaster oven, two burners, fridge)...i reccomend going to Super Foods it's close. You can reserve a grill at Trop. All food, resturant or not, is expensive in Aruba. and my daughter and I had a massage at the spa, that was great too.", "title": "Lovely week", "helpfulness": 2, "user": "david G", "date": "June 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 165245289}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "The Tropicana has the best price ,its clean,nicerooms,kitchen so you can do your owngrocery shopping andhave a snack or breakfast inthe room. There was an electric stove but no pan or pot. The machine with drinks was outof order. The hotellobby is not comfortble,and there is only one person helping,so long waiting time for check inn when its bussy.There was no explanation of what there is to do in the hotel,no explanation of how it works with the towelhut etc. No excuses were made for the pool that was not available because it was under construction. I was told I had to keep my tropicana bracelet on for all those days!I did not like that. There is no WI FI in the rooms unless you pay $10 for 24hours! All calls are being charged onthe roomphone,even local calls,very expensive! It wasso nice and bussy at the la cabana with games at the pool and live music etc. But at the tropicana there was nothing to do! so overall it was a nice room,but I didn't like the treatment of the working personel,not very friendly and always sweatty and very occupied! angela,suriname.", "title": "Vacation Aruba 2013", "helpfulness": 1, "user": "Rocco B", "date": "June 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 164789477}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled solo", "text": "My first visit to Aruba to see a friend and I selected the Tropicana point blank due to the nightly rate. Upon arrival the property appeared very nice and clean. Staff at all encounters were all professional and friendly in every encounter.", "title": "First time Aruba", "helpfulness": 4, "user": "Cargodess", "date": "September 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 176094466}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "I was especially pleased that the room was the size of a 1 bedroom apartment, clean and in good repair. The property as a whole was well maintained and it was clear the Tropicana was already hard at work on updates.", "title": "Good Location good Price", "helpfulness": 2, "user": "tony46085", "date": "September 6, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 176058492}, {"rating": 1.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "I visited Busters Bar/Grill and Casino one time during the visit, this was the most obvious part of the complex that needs an overhaul, however again staff was friendly and the facility was clean.", "title": "Dirty", "helpfulness": 4, "user": "Markjoynolanbrayden", "date": "September 5, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 175982203}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "Overall we had a positive stay here. Our room was clean and the hotel had 2 huge pools. We got there early (around 1 PM) but our room was not ready yet. We were aware that the hotel's check in was at 4 PM but we figured we would try to check in early. We did have to wait but were able to check in at 3PM, which is still 1 hour early than check in time. Luckily there was a supermarket conveniently located behind the hotel on the other side of the highway where we purchased food.", "title": "Vacation in Aruba Timeshare Owner", "user": "GQNY73", "date": "September 4, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 175756545}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Throughout our stay here I cannot say we had any complaints.", "title": "a tale of 2 rooms", "user": "G B", "date": "September 3, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 175624450}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "This is our 4th time in Aruba and the 1st to stay at the Tropicana. We were exchanging our time share week at the last minute and this was the only property available.", "title": "4th Time in Aruba - Would not stay here again", "helpfulness": 1, "user": "sue391228", "date": "August 31, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 175030722}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We were very disappointed in the property. Interval should not even consider this being average. We walked in and the room reeked of bleach. Apparent they had just cleaned the ceiling due to something being on it. The managment would NOT confirm it was mold, however, there was other evidense in the room of this. The rooms are outdated. The kitchen has no light and the bathroom harkens of the 1970's. Colored tub and sink and styling. Really?? No storage in the bathroom either. The outside of the building needs serious pressue washing as there are stains and dirt. We were told we had such a wonderful room because it was directly in front of the pool, however, the pool is closed due to lack of maintenance. The maintenance custodian told us it was green and they were trying fix it.", "title": "Always the best of times in Aruba!", "helpfulness": 3, "user": "4Starfish2013", "date": "August 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 174908678}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Really needs to be thoroughly renovated and we will not return to this property.", "title": "It's OK", "user": "traveling_mom-Boston", "date": "August 29, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 174684079}, {"rating": 4.0, "stay_parameters": "Stayed August 2013", "text": "We just got back from our week long trip to Aruba! This is our third trip to Aruba and we have stayed in the Trpoican Resort all three times, we own a timeshare in this resort. They are putting a lot of time and effort in improving the resort. The pools are very beautiful; nice and clean. We ate at the resort multiple of times...Pizza Bob's was amazing, we had the best pizza there! Also, we ate at Buster Sports Bar and Grill in the casino very delicious food for a great prices! The resort is a two minute walk to Eagle Beach. It is one of the most beautiful beaches in the Caribbean. The room is dated, but you don't spend much time in the room itself because most times you are outside enjoying beautiful Aruba! Our room was recently painted, the curtains were replaced and there were new mattresses on the bed and pullout couch (very comfortable)!! The staff and workers around the resort were extremely friendly and we received a daily maid service which was awesome! Also, the spa services were great, we especially enjoyed the massage service offered under the waterfalls by the pool.", "title": "Great Family Vacation on a Budget!", "helpfulness": 2, "user": "Ella411", "date": "August 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 174422038}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We stayed 2 weeks in Aruba at 3 different resorts - Divi Village, Paradise Beach Villas and here. Tropicana came in last. It's OK but our room was VERY outdated with lots of cracked tiles and mold in the bathroom. At least someone recently caulked everything. The kids loved the slide in the pool. Free wifi in the lobby - but it's open air. The resort just seemed \"tired\". Great supermarket across the street with good prices. I was surprised at the reasonable prices and selections on wine (we brought 6 bottles from home thinking it was going to be outrageous).", "title": "Return to Happiness", "helpfulness": 3, "user": "grundoboy", "date": "August 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 173364256}], "location": {"country": "Caribbean", "city": "Oranjestad"}, "stars": 3, "variance": {"poor": 27, "average": 61, "very good": 137, "terrible": 32, "excellent": 96}, "aka": "Tropicana Aruba Hotel", "slim_ranking": 0.6, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.0}, "description": "Bon Bini!Experience a world of limitless adventure and sun-filled days in Aruba. The Tropicana Aruba Resort & Casino is just a short stroll to the white sands of Eagle Beach and centrally located in the low-rise district away from the crowds. In addition to lounging around on one of the Top 10 beaches in the world, Tropicana Aruba Resort & Casino is near a myriad of entertainment options, numerous attractions, live cultural events and of course, shopping. When you need a break from the action, grab a book (or turn on your tablet) and check out the pool. Don't forget to stop by The Crazy Parrot Pool Bar & Grill and we'll serve you up a frosty beverage of your choice. Should you need any assistance making reservations or scheduling activities, our friendly on-site concierge staff will be happy to assist you. We can even create a special package of events tailored to your specific interests.We look forward to welcoming you! Sincerely, Brian StedefordGeneral Manager"}