{"user_rating": 3.5, "review_count": 495, "name": "Tropicana Inn & Suites", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We loved being so close to Disneyland that we could return to change clothes or take a nap. However, our room smelled like vomit, there was no elevator to haul our luggage (and later stroller) up to the second floor, the beds were hard and the bathroom had no tub to bathe the kids in. There was also no internet service, which my husband needed for work, so he had to go down a few doors to McDonalds which was unhandy. The staff at the front desk was not very friendly and spent much of their time on the phone or talking to each other while making the guests stand and wait and wait for service. I was happy with the free parking, the location and the continental breakfast but there are other nearby hotels that I have been happier with. This was our first stay at the Tropicana and we have mixed feelings about it. I don't know that we would return.", "title": "Not very pleased with the Tropicana.", "helpfulness": 5, "user": "Andrea007", "date": "August 2, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 8282106, "likes": {"liked": "— Location, free parking, free breakfast", "disliked": "— Smell, no elevator, no tub, no internet, rude staff"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "Literally IT IS ACROSS the street from Disneyland's entrance! You can't ask for a better location! Sure you could stay at the Sheraton or the Hilton but who wants to sit around and wait for a shuttle?? With shuttles there is a cut off time. Why not walk back and fourth at your own convenience? Thats what we got here. When we were tired we walked to our hotel and walked back to Disneyland. It was clean with plenty of parking.", "title": "Clean Mattress and an Excellent location", "helpfulness": 5, "user": "Linda_NSanDiego", "date": "August 2, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8277845}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "Now about the Mattress..I hate sleeping in hotels because of course it is gross (if you think about all the previous occupants). What I liked about this hotel was that they covered their mattresses with a kind of a plastic cover (I don't know what material it is) underneath the sheets and blankets. This meant that the mattress (the part that probably doesn't ever get washed) was covered and could easily be cleaned with some disinfectant spray. This was very comforting to see.", "title": "Fantastic location and value", "helpfulness": 4, "user": "bvgirl", "date": "June 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8003277}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Stayed here in mid May for 7 nights. Had 2 teenagers who thought the internet in the shop was great. Best location for parks, bus to other places and restaurants. We could walk everywhere. Great reception when we arrived and they held our luggage as we arrived 8am. Front desk very helpful as we are from Australia and had lots of questions. Rooms good size, clean and it was great having the bathroom basin separate to the shower and toilet. Sons loved the hot spa and pool. Would recommend to families. Cant beat the location!!!!!!!", "title": "Budgetary Delight", "helpfulness": 4, "user": "Canuck1533", "date": "June 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 8001333, "likes": {"liked": "— Close proximity to Disney", "disliked": "— No outside sitting area, aside from the pool"}}, {"rating": 4.0, "title": "Great Place to Stay!!! San Jose, CA", "text": "We stayed in late May, The hotel was very busy, but ran smooth. The rooms were clean, tidy, and comfortable. Pool area was small but appreciated. The corner store and coffee shop were very well used.", "helpfulness": 1, "user": "MartinezVacations", "date": "June 21, 2007", "id": 7958281}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Well....the Tropicana IS right next to the Disneyland entrance...and they DO have a handy mini-mart....and the staff IS very nice......however.............", "title": "Not worth the extra money!", "helpfulness": 6, "user": "lprinaz", "date": "November 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 10948735}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "The rooms are VERY so-so, with our room needing quite a bit of cosmetic repair as far as moldings, grout, tiles, etc. goes.", "title": "Tropicana was just right!", "helpfulness": 2, "user": "Peterlover", "date": "November 15, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10830327, "likes": {"liked": "— Location couldn't be better, convenience shops come in handy", "disliked": "— poor lighting in bathrooms...but, really, i could care less"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "If, at the continental breakfast you should want COLD cereal or milk, you must pay $1.00 for each.", "title": "Great Location, Average Economy Hotel", "helpfulness": 6, "user": "jls1986", "date": "October 28, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 10393172, "likes": {"liked": "— Location", "disliked": "— Lack of Customer Service in Staff"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "If, in the lobby, you should need the internet and/or a printer, you must pay....heartily! Almost $6.00 for 15 minutes, $10.50 for 1/2 hour!!! So, if you need to print a boarding pass for your airline trip home, be advised to save enough out of your budget to pay for this AND maybe some cereal and milk!", "title": "Nothing Special - Just Okay", "helpfulness": 4, "user": "TripHHH", "date": "October 21, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 10205599, "likes": {"liked": "— Close to Disneyland", "disliked": "— Awful breakfast, high-priced mini mart"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "The cable TV was TERRIBLE! Some sort of constant interferance kept us from ever actually seeing the end of a program!", "title": "We had a great stay!", "helpfulness": 4, "user": "SEAtoJHM", "date": "October 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 10092936}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "We stayed at the Tropicana Inn for 4 nights. I was a bit concerned about the hotel when I booked it online because of the price. I was pleasantly surprised to find that it was very nice. The lobby was pretty, and well decorated. The rooms were very clean and modern.There was also a great little store there that had stuffed Disney Animals, t-shirts, food, drinks, you name it! The pool was also nice. The best feature was that it is directly across the street to the Disneyland Park entrance! No shuttles or anything! It was so nice to be able to walk back & forth from the Parks and our room throughout the day. It is not a 5 star hotel, but it served its purpose since we were out & about most of the time. There are also a lot of restaurants within walking distance- IHOP, Denny's, Tony Romas etc.", "title": "Great Buget Hotel", "helpfulness": 4, "user": "aimee_80", "date": "January 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13084598, "likes": {"liked": "— Location", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Very happy with our stay for the price we paid (under 100). Was not sure about the room after reading a couple of reviews but we were very", "title": "Great Place for Disney", "helpfulness": 3, "user": "Zammit", "date": "January 7, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12404309}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "happy. I guess some people are looking for the Ritz everywhere they stay if you are then stay there not at a place that costs under 100. Bed was a little stiff but room comfortable and clean. Did not care about Breakfast so not an issue for us. Great to have the little shop on site that also has internet that hardly anyone uses so easy to get on. Shop is a little pricey but what do you expect! Disney is leteraly", "title": "Tropicana Good Value for Price", "helpfulness": 2, "user": "akquilter", "date": "January 6, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 12392753, "likes": {"liked": "— Convient location", "disliked": "— Contiental Breakfast needs improving"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "a 5 min walk from your fron door. cant only 1 or two hotels 20 seconds", "title": "Great Hotel, Great Location", "helpfulness": 1, "user": "Jo0723", "date": "January 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12310149, "likes": {"liked": "— Location", "disliked": "— N/A"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "closer. Plenty of food nearby (1 or 2 min walk) IHOP, McDonalds, Dennys, Subway etc.", "title": "Great Location", "helpfulness": 5, "user": "dkpm4", "date": "December 27, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 2.0, "location": 5.0, "value": 3.0, "rooms": 3.0}, "id": 11976872, "likes": {"liked": "— Location", "disliked": "— Hard beds, staff lacking customer service"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "I rely on Tripadvisor for information so I feel that you all should know what can possibly happen if you have any issues come up involving this hotel. We stayed at the Tropicana from Oct 5-8, 2007. This hotel lacks customer service oriented staff...I was informed upon arrival that I had booked two reservations. I informed him that I did not and am very computer literate and quite familiar with online bookings. This \"discussion\" went on for awhile. I had to tell the rude front desk man to stop insinuating that I was a liar. Eventually he went in the back to talk to some mystery person. This person never emerged to provide any sort of customer service but rather sent a message that if the room sold out that nite I would not incur a charge. This after I heard another front desk person telling someone that they always sell out and he should book the last available room while it was still available. A little customer service goes along way but the staff at this hotel doesn't know the meaning of customer service. The situation could have easily been defused and they would have had a satisfied customer.", "title": "Never Again at Tropicana Inn", "helpfulness": 3, "user": "stix7125", "date": "October 9, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 3.0}, "id": 10057069, "likes": {"liked": "— Location - Close to Disneyland", "disliked": "— Staff"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007", "text": "The room was very tiny and in need of renovation but it was clean. The walls are paper thin you can hear everything from the surounding areas. The bed was very firm. They cleaned the in-room coffee maker after the first night but never placed additional coffee packets in the room for the remainder of our stay. The closet door was broken & kept falling off its track. The AC is on the noisy side.", "title": "Great Location", "helpfulness": 3, "user": "sln", "date": "September 16, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 8721360, "likes": {"liked": "— The location.", "disliked": "— The air conditioner froze up."}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Good enough place for the $89 we paid (before taxes). Very short walk across the street to Disneyland; convenient mini mart for the toothbrushes we forgot to pack. Yes, the mattress was very firm and even after being tired from all the walking we did at Disneyland we kept waking up at night because of the mattress. They gave us the handicapped room without telling us first, which was ackward for us (no tub, shower sprayer weird, the bathroom floor was WARM!?, tall toilet, no handy hook on the back of the door). The only other \"problem\" was the air conditioner kept freezing up and didn't cool the room at all when that happened. Room was clean and people at the front desk were polite. Didn't try the continental breakfast. We'd stay there again just for the cleanliness and location.", "title": "Look somewhere else !", "helpfulness": 6, "user": "DisneylandFriend", "date": "September 5, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 8661956, "likes": {"liked": "— Location to Disneyland", "disliked": "— Staff"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We go to Disneyland every year and have stayed at the Tropicanna a couple times. This year was our last ! When we got to the hotel we were a day early and upon checking in presented cash for the one night until our hotel voucher through Disney and AAA took in effect; we requested to pay cash on the spot and were told not to worry about it; they would collect it when we checked out 8 days later - I tried to pay again but they said NO! After a couple days into our visit as I was doing some online banking I noticed they had charged our visa that I had presented to them over a year ago ! They adamantly denied they had charged the card since we DIDN'T give it to them during this current years stay. I asked to speak to a manager who NEVER called me back to address my concerns of not only allowing me to pay in cash the day we checked in but also they had kept credit card info on me w/o my consent and charged the card. Then after I was upset w/o a phone call or visit from the manager; we came home from the park one evening to find that our maid had left our door not only unlocked BUT open - this happened twice during our stay and I have still yet to here from anyone from the hotel to address these issues. The continental breakfast also has very stale - day old muffins !", "title": "Great Value at the Tropicana", "helpfulness": 5, "user": "TheWarg", "date": "August 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8518658, "likes": {"liked": "— Price and location", "disliked": "— No compaints"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Puyallup, WA", "title": "Good hotel, would recommend", "helpfulness": 3, "user": "kosonovich", "date": "August 22, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 1.0, "location": 4.0, "value": 3.0, "rooms": 4.0}, "id": 8467988, "likes": {"liked": "— the location", "disliked": "— the breakfast and the front desk staff!"}}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 34, "average": 102, "very good": 231, "terrible": 27, "excellent": 101}, "aka": "Tropicana Hotel", "slim_ranking": 0.351351351351, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 5.0}}