{"user_rating": 4.0, "review_count": 5708, "name": "Tropicana Las Vegas - a DoubleTree by Hilton Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The Tropicana is not the flashiest on the Strip, but we had a nice 3 night stay here for a modest price. Staff was helpful and the room was nice. Not extravagant or exceptional in any area, but good value and we really enjoyed the location (we enjoy walking). The pools looked amazing, but obviously we could not enjoy them in the December.", "title": "Nice stay for the money", "user": "radiohokie", "date": "December 14, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121746922}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "We had a fantastic experience at the Tropicana - I have stayed in many casinos on the strip and the Tropicana can not be beat for their customer service!!! They have recently remodeled and the hotel is very clean. The Tequila bar and show is the best! Also check out the mob experieince - definitely worth seeing!", "title": "Best stay ever!", "helpfulness": 3, "user": "Candy W", "date": "December 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121737994}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We decided, at the last minute, to go to Vegas for the NFR (rodeo) and had to pick from the remaining hotels available. This hotel was relatively cheap and the pictures looked good so we booked it. Walking in I was struck by how much white paint was everywhere. The place definitely lacked atmosphere, in fact, it reminded me more of an Indian Casino than a Vegas one. I was greeted at the front desk by a very friendly clerk, indeed every one of the employees here were exceptionally nice and accommodating. The check-in went very fast and easy and he pointed me to the Paradise elevators. After seeing the lobby I wasn't really expecting the room to look as good as the pictures on their web site but I was wrong. The room was clean and the bed was very comfortable. There is a resort fee of $14.99 which includes Internet and local calls.", "title": "Hotel 4 stars, Casino 2 stars, employees 5 stars...", "helpfulness": 1, "user": "paulala", "date": "December 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 121736552}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "Dining: We went to dinner twice at Bacio and loved it both times! My husband ordered the New York steak and it was huge and tasty. I had the pasta with clams and ate every bit of it! There is also a little deli called Pellegrino's that had such great customer service. The first day there I ordered a BLT and the next day I went back the kind woman remembered my order from before. How many places can you say that about? There is also a Starbucks, a prerequisite for my husband and I LOL!", "title": "best value for money Ive found on the strip", "helpfulness": 2, "user": "KarenB_007", "date": "December 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121706738}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Would I go back here? Yes, if I couldn't get into the Golden Nugget, but it would not be my first choice.", "title": "The NEW Tropicana", "helpfulness": 1, "user": "Laurie H", "date": "December 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121697617}, {"rating": 3.0, "title": "OK", "text": "Just OK. Really overpriced meal options. It can be a very, very long walk to the room from the front desk and casino. The room itself was OK but the bathtub was peeling and the hot water in the shower took a long time to reach lukewarm, it never made it to hot.", "user": "Michael L", "date": "December 2, 2013", "id": 186604456}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "I stayed here for a conference for 2 nights. Check in was a little slow and the desk wasn't the friendliest. I had a room in the tower with a very nice strip view although it was a long walk from the lobby. We ate at the steakhouse for dinner one night and it was fine, although pricey. I found the restaurant choices lacking compared to other nearby hotels. I didn't spend any time in the casino here, but it looked very nice. Overall this is a good, basic hotel. It doesn't have the same amenities as some of the bigger strip hotels but it was more than adequate.", "title": "Nice stay", "user": "ThegreatEye", "date": "December 2, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 186511211}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "We booked the hotel for its fabulous pool - very disappointed to find out it was closed. Couldn't have used it anyway as the weather was so bad, but think we should have been informed prior to booking. Also disapointed that the Italian restaurant was only open at weekend. Desk service was slow although concergie was friendly and found the croupiers excellent. Hotel should have supplied useful info about the hotel for guests to read 24 hour Starbucks, when the restaurats open & closed etc. Room was a good size with very comfy beds. Reasonable standard for a reasonable price.", "title": "janeandsamA very wet Vegas.", "helpfulness": 1, "user": "Jane B", "date": "December 2, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 186509345}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "Stayed here on business and was allocated a room at the far end of the building/adjoining tower, so it was quite a walk to get to through the casino, up an escalator, along a corridor past restaurants, so quite a drag, literally, with a couple of cases in tow.", "title": "Tropical business stop", "user": "AiryTraveller", "date": "December 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 186482961}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "Although on first inspection my room looked dated but was nice and bright, with plantation shutters at the windows. King bed and lots of storage and large TV. The bathroom had a large oval bathtub, with shower above and large vanity sink area. Sadly I had the most annoyingly loud fan that came on every time you put on the light so if, like me you leave light on during the night to find your way in the dark, it was noisy all night too. This was also a nuisance as I like to have a bath mainly, so wasn't relaxing for a soak with that buzzing away all the time.", "title": "Newbies to Vegas", "helpfulness": 1, "user": "ctpagirl", "date": "December 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 186474930}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "Stayed here for 3 nights. It is great value for money, we payed $200 + tax and resort fee for 3 nights. Whilst it is on the strip, it is at the very southern end so its a 10-15 minute walk to the centre of the strip. I would have preferred to be up near the bellagio and aria hotels, but they cost twice as much so its a bit of a trade off. The rooms were clean, I had a suite which was large but unfortunately had airport views. If you don't mind being slightly away from the action then this hotel is for you.", "title": "Good value on the strip", "helpfulness": 4, "user": "bellmeister", "date": "December 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 121872248}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "I go to vegas a fair amount but this was my first stay at the remodeled tropicana. For the rate I paid ($30/nt on weeknights + the $15 resort fee) I think this is the best value I've had in vegas. The remodeled rooms are nice, esp. the bed. I'm a little surprised they seem to have cut some corners in spending on the bathrooms but its not a big deal. Even the pool area looked really nice and because its not surrounded by towers seems to get a lot of sun.", "title": "What a deal", "user": "Ahmedam", "date": "December 18, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121866407}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Its got a decent location on the corner of the strip and tropicana blvd. You can cross the skybridge into MGM. 5min walk to NY/NY and 15min walk to City Center if you cut through Monte Carlo (Aria, etc.)", "title": "Nice but still needs work", "user": "raidergirl", "date": "December 18, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 121861621}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Resort fee a bit disproportional to the rate I was paying but it includes internet and gym so if you use those things you get your money's worth on that also.", "title": "good rooms and price, bad customer service", "user": "may0529", "date": "December 17, 2011", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121839993}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "Only downside is not much in the way of food options but given proximity to MGM this hardly matters. The outdoor patio at Nikki cafe looked very appealing if the weather was a little warmer.", "title": "A servicable hotel for the right price", "user": "casaraton", "date": "December 17, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 121835795}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "My husband and I just returned from our 1st trip to Las Vegas. We stayed at Tropicana 11/3 to 11/6 and we were very impressed and happy with our choice to stay here. Our room was great...clean and spacious. Employees/service were very nice and helpful. Check in was quick and the hotel/casino itself is very bright and welcoming. The size of the place is just right...not too big & crowded! I would highly recommend this hotel! Very close to the airport and strip and several other hotels/casinos. I will not hesitate to go back to this hotel again! Thanks Tropicana for a great stay!", "title": "Great stay at Tropicana!", "helpfulness": 1, "user": "Jane C", "date": "November 7, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120290522}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "The Tropicana is now my new place to stay when I go to Vegas. Rooms were clean. Service was excellent. Casino was clean. The renovation is very nice. There is tram access to other venues which made it nice to go meet up with friends who were staying at different properties. Rate was good. Definitely my new Vegas place to stay.", "title": "Great place to stay!~", "helpfulness": 1, "user": "Jerome E", "date": "November 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 120288200}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "I had been staying for over 20 years and had worried about the need for a facelift - I was pleasantly surprised to see how much they had done and how beautiful everything looked. The staff is fabulous, the rooms are quite comfortable and the casino has a fresh clean look - the pool is amazing and overall it is a GREATdeal - if you prefer a comfortable, clean not loud, not smoky; you will not be disappointed. I hope to keep coming for another 20 years.", "title": "I love the new look", "user": "Fabulous55", "date": "November 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120285288}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "The Trop is a nice hotel. Rooms are large and very clean. Location is right at the south end of the strip near MGM.", "title": "Nice Hotel", "user": "NottsPanther75", "date": "November 7, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 120277347}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Our room in the Club Tower overlooked the strip and was very quiet although our friend's room overlooked the airport and was a bit noisy.", "title": "poor view", "user": "romagerry", "date": "November 7, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 120275409}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Check in: We waited about 30 minutes to check in but there was a lady bringing us free water and apologising for the wait.", "title": "Good Location", "helpfulness": 1, "user": "Spinny4", "date": "December 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 121694386}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "Room: Our room was in the club tower which was quite a walk from the main casino. However, it was very quiet there and the room was good. The beds were really comfy and there was a large flat screen tv. We couldnt open our safe on the 1st day so we called down and someone promptly came up to sort out the problem.", "title": "Tropicana once again great..", "helpfulness": 1, "user": "herminator", "date": "December 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121679922}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The only small thing was that there was some mould in the corner of the bathroom and the shower head was half hanging out of the wall but it still worked fine. The room was clean every day and plenty of shampoo and conditioner.", "title": "Loved it!!!", "helpfulness": 2, "user": "bruce l", "date": "December 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121671463}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "Casino: The casino is small is comparison to other hotels but meant it was only a short walk through which was good in my opinion. It was really really smoky which meant we didnt spend much time there.", "title": "Great location, lovely rooms", "user": "tea-babe", "date": "December 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121654549}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "Bar: The bar was expensive so we didnt actually drink there but the music was pretty decent. Only annoying thing to us was that they kept putting sports and the rodeo on the tv but i suppose that is what Americans like best.", "title": "Redefining affordable luxury!", "helpfulness": 10, "user": "highdesertwanderer", "date": "December 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121642000}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "After reading so many positive reviews re this hotel, I booked this hotel on the strenghth of them---it did not dissapoint! It is extremely good value for money, and unlike other hotels the whole place is bright and airy The rooms are spacious and as loads of people have remared---the beds are brill! It is also in a good location as it is near the airport, so at the end of our stay, we could relax here knowing that we did not have to 'build in' extra time to get within distance of the airport. the main reason I would stay here agin is that it is obvious that the staff are seriously out to please the customer. We had a couple of small issues that were resolved instantly---Nicole, the general manager clearly takes customer satisfaction seriously! Would definitely recommend this hotel!", "title": "Loved this Hotel!", "helpfulness": 2, "user": "jenscotland", "date": "August 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116207414}, {"rating": 2.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "The remodeled Tropicana is an okay hotel even while they are remodeling. But the MOB style resort fee stinks. I;m sick of paying hidden fees as if it doesn;t count. Do not stay here. Go somewhere where they are honest!", "title": "Great Hotel BAD RESORT FEES", "helpfulness": 1, "user": "sportingreview", "date": "August 2, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 2.0, "value": 1.0, "service": 3.0}, "id": 116190804}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Had a problem with our rooms when we checked in they were suppose to be adjoining and they weren't so we were upgraded to 2 suites instead. Hotel is going through a complete makeover great family hotel. Only downfall was alck of shops and restaurants almost always had to go off site.", "title": "Can't wait to go back!!!", "user": "bosco8988", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116190790}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We haven't stayed at the Tropicana Las Vegas in years and can't believe the incredable changes. The staff are pleasent and helpful. The lobby is all new with brass & marble. But the best part is the all new room decor, furniture ans amminities. Go to the website and see what I mean. We were in Room #1801 and couldn't have been happier. Flat Screen TVs, sleek & contemporary furniture, nice new carpet and walls. This is a brand new hotel! We could see east & west on Tropicana Blve and North & South on Las Vegas Blvd. The view at night was stunning! We're going back soon!", "title": "Can't believe the changes!", "user": "Stanman1803", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116187593}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I read every review out there before booking into the Trop for the 4th July weekend. They have done a fantastic job of renovating the place - the lobby is lovely and bright, friendly check in staff (no line at all), the hallways are really nicely decorated in a South American theme and the rooms are excellent - 10/10 (and I never give a 10!)", "title": "Fanastic Renvoation - Best Deal on the Strip but very stingy gambling rules", "helpfulness": 3, "user": "manhattanspace", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116180281}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "This hotel casino is on the strip right next to MGM. They ve renovated it 3 years ago. Looks almost new and has a fresh feel to it.", "title": "Clean and spacious on the strip", "helpfulness": 1, "user": "AlexSantiag0", "date": "November 29, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 186245673}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "I travelled with my wife and toddler son. It is almost in the southern end of the strip but you can still walk around the strip easily from here.", "title": "Good for Business Stay", "helpfulness": 1, "user": "gatordave007", "date": "November 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 186165624}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Has free parking and internet. Would surely recommend it.", "title": "Tropicana Americana", "helpfulness": 2, "user": "Btravels123", "date": "November 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186064829}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled solo", "text": "I was there while parts of the hotel were under renovation so there was some construction activity in the restaurant/ concession area. Room was good and the location was fine. Being on the South end of the Strip, it's easy to get in and out if you're there on business.", "title": "Great location!", "helpfulness": 1, "user": "Traveler J", "date": "November 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 186030086}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "It's middle of the road as far luxury goes. It's not the Wynn ut on the other hand, it's not Hooters hotel either. A good value at a decent rate.", "title": "Most improved hotel and casino on the Strip", "helpfulness": 3, "user": "ClaudeC", "date": "November 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 186024129}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "We had a group of people going for a long weekend and the hotel was great! The Penthouse suites are awesome for the price- we also got the three rooms that were joined for friends/family and it was perfect. The manager Jeff was awesome in the booking process and checked back with me several times to make sure everything was good and if we needed anything. Casino isn't as big as others- but MGM is a 5 mintue walk. Location is great as everything on strip is within walking distance. The hotel pool was big and perfect cold temperature! A/C in the room was an issue the first night- but we called and they immediately sent someone up- they changed the filers and then it was nice and cold in the room! Only negative about the bar in the suite is no sink- that would have been a great addition. The master bathroom is HUGE and gorgeous views- the whole room did! Only thing I didn't like was the stairs- the carpet and going round and round made you a little sick but that might not be all their fault!", "title": "Great hotel- rooms are nice, pool is awesome and price can't be beat!", "user": "merdmb", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116168789}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "This was my third time to Las Vegas and found this hotel being is favourite I have stayed in. The hotel is the south end of the strip, but is still linked to many nearby hotels/casinos, as well as the monorail and bus links. We stayed here for approx 5 nights in May, and thoroughly enjoyed it. The check in was a good experience with the front desk clerk giving us an option of which room we would like. The room was very clean and spacious and the fittings were all up to date and modern. The room over-looked the strip and also the Nikki beach bar.", "title": "Great Stay at the Newly Upgraded Tropicana", "helpfulness": 1, "user": "kiwigirl08", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 4.0, "service": 5.0}, "id": 116156231}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The pool area was very nice and a great area to relax. There was also a turn down service for the first couple of nights we were there which was a nice touch. The only problems I found with this place was the long distance from the hotel lobby to our room, and the noise generated from the Nikki bar club at night. However overall I found this hotel very comfortable and will definitely be back!", "title": "Loved the Service!!", "user": "stine808", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116155862}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I was extremely impressed with the Tropicana. I had booked my boyfriend and I one of their less expensive rooms and was hoping for the best. But, when we got there and checked in, the man helping us noticed I was on crutches and moved us to a room that was more centralized. The perk of this move was we were moved to one of their newly renovated rooms that were just fabulous!! The reason I chose Tropicana was because I had read the reviews on this site and liked that their management team got involved to handle negative and even positive reviews. I could really tell they cared about their patrons. Upon arriving at Tropicana, this was confirmed. I didn't get the name of the person who upgraded us but am grateful for his attentiveness. I'll always look back fondly on this Vegas vacation.", "title": "we loved the tropicana", "helpfulness": 1, "user": "mel08_10", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116139710}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "we had a wonderful time at the tropicana. staff was very friendly, service was great.", "title": "great service,great rooms, great food!!", "user": "carbomb4290", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116139497}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Just returned home from a 5 day stay in Las Vegas at the Tropicana Hotel. This hotel has just completed at major face lift. It was very bright, clean, and welcoming. We loved the grounds and property. The front desk staff are very friendly and helpful, as well as everyone else we came in contact with during our stay. This was our 4th time in Vegas and we enjoyed the smaller hotel feel as we found it faster and simpler to get around in. The Tropicana Hotel is in a great location, right on the strip, where the action is. This is our favorite end of the strip, we love it here. While we loved staying at the Tropicana, we also like to pop over to the Luxor, Excalibur, and New York, New York Hotels as well. Staying at the Tropicana makes it easy to do this as it is right across the street, and next to the MGM as well. I would definitely recommend this hotel to stay at.", "title": "Las Vegas & Tropicana, Great experience", "helpfulness": 5, "user": "Culture-Shocked", "date": "August 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116366370}, {"rating": 5.0, "stay_parameters": "Stayed May 2011", "text": "As an added tip to your Vegas stay, we really love the meals at the Pyramid Cafe at the Luxor Hotel across the street. We find the prices to be very reasonable here as well as great home cooking. This was our 4th year visiting the Pyramid Cafe as well.", "title": "A knight to remember", "user": "Masonjr1", "date": "August 6, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 116360824}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Don't forget about the shows in Vegas. If you want to conserve your money go to the 1/2 price ticket boothes at 10am for tickets that did not sell out for shows that coming evening. You will find a booth at the front of the M&M's store and one down at the Fashion Show Mall.", "title": "Well Done Tropicana!", "helpfulness": 1, "user": "GoHawks2013", "date": "August 5, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116318836}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Also make sure to visit Fremont Street, you'll be glad you did. The canopy light show on the world's biggest TV screen, plus the live entertainment, and everything else that goes on down there, is totally awesome. Not to mention also Fremont East with its old neon signs and Vegas's famous Gold and Silver Pawn Shop from the TV show Pawn Stars being just around the corner. This area is a must to go to.", "title": "We loved it and will be back", "helpfulness": 2, "user": "iriskozak", "date": "August 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116313002}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "This year, while in Vegas, we did the Scoot City Tour to Red Rock Canyon. We had a great day. Our tour guides were fantastic, the day was fun, and the scoot city scooter cars were awesome. I heard it said that you will look like a bunch of Skittles getting down the road, and that we did.. way cool!", "title": "AMAZING", "helpfulness": 2, "user": "rosanneyoung", "date": "August 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116309053}, {"rating": 4.0, "title": "Nice Improvements", "text": "We stayed here a few years ago and the improvements done are good. As Hilton Diamond members we got comp breakfast in the restaurant which was nice and unexpected. The rooms were clean and spacious. We that a nice strip view. Last time the rooms were very dated they have been updated but still have the feel of the old Tropicana. I would definitely stay here again.", "user": "jennyprovo", "date": "December 1, 2013", "id": 186465192}, {"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "Desk service was awful, not friendly at all. Door man was the best, helpful with finding cheap and good food close by. Rooms are remodeled, but it doesn't appear as if they have spent much money in doing so, the bathroom tub walls were already cracked along the grout with mildew. Getting to the pool in the off season was a joke, ropes, locked gates and turn a rounds galore, we finally made it after a 20 minute adventure.", "title": "Good time", "user": "TroynTonya", "date": "December 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 186459320}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "After staying in Las Vegas in 5 other hotels this is last on my list to stay again. The price however is hard to beat.", "title": "A taste of LV at the Trop", "helpfulness": 1, "user": "jennyandmike", "date": "December 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 186406203}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "My husband has always wanted to visit Las Vegas and after a wonderful cruise we had 3 nights at the Tropicana to finish the holiday. We were not disappointed and glad we chose this hotel as it a is a retreat from the madness is Las Vegas. It is calm and peaceful but friendly and approachable.", "title": "Newly renovated", "user": "tracey m", "date": "November 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186384511}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled solo", "text": "Check in was quick and we were given a room in the club tower which is quite a walk but luckily our room was close to the lift, sorry elevator! The room was clean and comfortable with all you expect in a hotel of this standard.We had breakfast in the Ocean cafe which was really good with everything you would wish including a fantastic selection of fruits. We also ate the last night in the Biscayne restaurant which we got at a discount plus free drinks as members of the Tropicana club. That was good too.", "title": "Good Stay", "helpfulness": 1, "user": "Tara S", "date": "November 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 186396000}, {"rating": 2.0, "title": "Mr. Grinch?", "text": "What's up with the Tropicana not having any Holiday decorations around the hotel??? Not one Pointsettia, not one wreath, not one jingle bell .... nada, zip, zilch. Not even Holiday music playing! If not for Starbucks, one would think the Tropicana doesn't \"believe\" :(", "user": "Anna S", "date": "December 16, 2011", "id": 121797683}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "I thought for sure that being the \"new\" Tropicana the owners would go all out. I'm terribly disappointed and apparently many of the workers are as well. When I asked an employee why no decorations anywhere, I got a shoulder shrug with an \"I don't know\". Shame, shame, shame on the owner/management. You turned the building pink for the entire Breast Cancer Awareness Month, maybe you should now turn it green ..... Mr. Grinch! Your customers and employees deserve to celebrate ..... just sayin!", "title": "Remodeled and doing a great job!", "helpfulness": 3, "user": "traveler51", "date": "December 16, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121794105}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Stayed with the family for a birthday celebration ...long weekend begining of November.", "title": "Acceptable.", "helpfulness": 1, "user": "HappyKampersToo", "date": "December 16, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 121789032}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "Was SO surprised at the remodel...pictures were true to form and hotel was spotless...", "title": "Good enough for us", "helpfulness": 2, "user": "1947res", "date": "December 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 121783121}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Restaurants were excellent had wine pairing at the Biscayne and price fixed menu at Boccia was a treat....Morning buffet was pricey but when service was slow were comped a meal...thanks Trop!(Didn't even ask or complain...) Unfortunately, spa was not open that weekend due to some delay but when we did mention it at check out we were comped the resort fee...Had a blast at the tables...our pit boss Manny was a riot and our dealer made the night go by so fast no one got up from the table...And their penny slots were LOOSE! We all won at one machine or another...Guest Services on the casino floor went out of the way to please....After staying at the pricey Venetian in August...it was a pleasant surprise to see what Trop was out to offer! On the whole a great weekend for a great price....We'll definitely be back!!!", "title": "Liked this hotel!", "helpfulness": 1, "user": "Janneke24", "date": "December 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 121767671}, {"rating": 2.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Based on numerous positive reviews I found on Tripadvisor and other online review sites, I decided to celebrate my wife's birthday at Tropicana. It was our first night out in almost three years - we have a 2 1/2 old twin daughters. So, we were really excited about our trip.", "title": "Simply Overrated", "helpfulness": 4, "user": "juhoney76", "date": "November 8, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 2.0}, "id": 120318356}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Overall, the hotel wasn't so bad. However, the positive reviews I've been reading seem overrated. I stayed at room 1123 at Paradise Tower during the first week of November. The wait line at the check-in was ridiculous. When I arrived (4 p.m.), there were three people in front of me, and yet it took 30 minutes for someone to help me with check in. Anyways, we checked in to room 1123, located on the 11th floor overlooking south side of MGM Grand.", "title": "Great All Around!", "helpfulness": 1, "user": "Lara A", "date": "November 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120314463}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "The room did not feel spacious. The room was clean with simple tropical-themed decorations. Nothing special. I upgraded to City View room for $25 more but the view overlooking MGM was not spectacular. Of all the things that were renovated, the bathroom tiles were not remodeled. It looked dirty with lots of old stains. The bed was comfortable; however, two things kept us waking up at night - the noisy heater and lack of black out curtains. The plantation shutters looked nice but they kept letting mornight sunrays through our room. The heater, every time it would turn on, would make such a loud noise that it would wake us up.", "title": "Tropicana updated", "helpfulness": 1, "user": "bingo3", "date": "November 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 120310279}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The hotel staff were not all that friendly as many reviewers said. They were not rude, but I didn't find them particularly friendly or nice. There were just doing their business. In addition, the hotel ceiling on the northern portion by a snack shop and a restroom (leading to 2-story motel structure) was so low that I felt claustophobic (and I'm 5-7). The ceiling was probably 6 foot and 2 inches high and anyone who's taller than that could not have made it.", "title": "Would definitely stay again", "user": "Palamino2", "date": "November 7, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120307567}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "In addition, the hotel has a very small, I mean VERY SMALL casino! For the size of the hotel, the casino should have been at least three times bigge than its current size. I didn't want to play there. Other people probably thought the same - the casino was virtually empty on Sunday evening. One crap table - no players, one roulette table - no players. Four or five blackjack tables - some action there. Only about 20 people seemed to be playing the slots. The hotel guests appeared to be much older compared to other hotels in Vegas (average of 65-75 years old). Consequently, the cocktail waitresses were also older (60-70) wearing awkwardly revealing uniforms. I didn't want to see cleavage of someone who is older than my mom.", "title": "Lovely Hotel", "helpfulness": 1, "user": "Trueam", "date": "November 7, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 120297794}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Just returned from 6 days in Vegas at the Tropicana hotel.Not as busy as some of the others which is nice because after visiting the big ones it's nice to come back to smaller one,i say a smaller one but it still has 1600 rooms.Clean bright and nice rooms with 2 queen size beds,the only small moan would be that there is no tea or coffee facilities but i take my own so no big thing.What can i say about Vegas, well it's a adults play ground fantastic just like you see on TV but what did surprise me was how clean it was it was spotless and the shopping malls so clean the floors sparkled.A visit to the grand canyon is a must and also you have just got to go in the Venetian hotel,luxurious amazing with gondolas threw out the place with lovely ceilings.Another thing is the shows,you must see a show or two they are great to see.The only down side would be that the prices of drinks in the hotels are expensive but it is Vegas.To cap it all it is a place that you have to visit once in a lifetime,amazing.", "title": "well worth a visit", "user": "gary006", "date": "November 7, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120270615}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "I usually stay on the north end of the strip (Mirage, Encore, Etc,) I wanted something on the south end this time since people I had to meet up with were at Mandalay Bay. I had heard that the Trop had been remodeled and decided to give it a try after getting a great internet price. It was well worth it. The whole experience was great from check in through check out. I was able to get a free upgrade to a small suite from a deluxe room. I did have to stay in the Club Tower which is a bit of a walk but not a problem as it is so bright with lots of windows overlooking the pool along the walkway. Right from the front entrance to the room everything is either white marble or orange, red and brown carpeting. I for one did not feel that the coconut scent in the casinos and public areas was overwhelming. It was a refreshing break from the usually smokey casinos I have encountered. The casino is not as large as some others but is easier to navigate without getting lost. I mostly play slots but there seemed to be a lot of action at the tables during the 5 days that I was there. I really liked the slot area that was off by itself between the two escalators, the ceilings were higher and it was cooler in that area. The cocktail waitresses were for the most part very attentive, efficient and friendly. I did not get to experience the restaurants as all of my meals were covered by other people at other hotels but the menus and the food looked delicious. The room was very nice with a corner view of part of the strip and the MGM Grand. I could also view part of the airports take offs and landings but the sound didn't seem to be an issue. If you want ultra fancy then this hotel may not be for you but I have done it both ways and the Trop makes you feel comfortable and welcome I will be staying here again as soon as possible.", "title": "The Trop was the perfect spot", "helpfulness": 2, "user": "lotsoslots", "date": "November 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120255322}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "I sent my mum from Australia and her best friend for a 9 night stay. They report that the room was absolutley beautiful and far beyond their expectations. Plantation shutters, very spacious overlooking the garden and pool. The staff could not have been more helpful and obliging going out of their way to ensure that two older ladies were having a nice time and all was good. Beyond this, on the day they were due to depart, they were caught in a traffic jam and missed the return flight to Australia. The Manager took control of the situation and arranged for them to board the next available Virgin flight which was not available for another two days. The Management made certain that they were looked after at no extra cost during the extended stay, absolutely wonderful service. Well done Tropicana Management and staff. Take a bow! We will be over in the near future and we would not consider staying anywhere else.", "title": "above and beyond", "helpfulness": 2, "user": "kidgeeridge", "date": "November 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120255083}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Many thanks,", "title": "Continues to Impress", "helpfulness": 2, "user": "sa78258", "date": "November 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120251231}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Vicki White", "title": "Wonderful hotel with some great service", "helpfulness": 2, "user": "realistic5", "date": "November 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 120246021}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "This hotel has come a long way from it's run down former self but sadly some of it's biggest problems still remain.", "title": "It's just the little things", "user": "CouleeCat", "date": "December 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 186654555}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "Yes it is all glammed up with beautiful furniture and furnishings and boasts a couple fine restaurants and adequate casino. The staff is impeccably trained in customer service, and the location on the strip isn't too far from the main action but....", "title": "Thanksgiving 2013-Las Vegas", "user": "Janet D", "date": "December 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186700280}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "We'll start with the first room in the southeast Club Tower. Upon checking into our non-smoking room we noticed a heavy, stale cigarette smell that permeated all the fabric in the room, including the pillows, and the fine furniture was covered in a layer of dust. We thought, no big deal, but by morning we felt like we had slept in an ashtray. This area of the hotel also faced the airport which didn't cause any bothersome noise, but the Speedway Track across the street greeted us with racing motors, making sleeping in a problem.", "title": "Stay in the Bungalows", "user": "LovesToTravel2_11", "date": "December 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 186600570}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "We went to the front desk and asked if another room might be available. A very helpful clerk appologized and said that floor was directly below the smoking floor and sometimes it seeps down. He issued us a beautiful corner room facing northwest this time. Quiet, spacious and partial strip view. We were very pleased until we tried to control the temperature. Outside it was in the 40's and in the room, about 60 degrees but the system would only blow out more cold air no matter how high we adjusted the thermostat. I called the front desk and said the heat doesn't seem to be working and was told \"there is no heat in that part of the hotel, I can send up an additional blanket if you would like.\" What? No, I'm not interested in sitting around wrapped in a blanket thank you. Next room please.", "title": "New Tropicana has a lot to offer!", "user": "mukherab", "date": "December 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 186595165}, {"rating": 3.0, "title": "You get what you pay for... An honest and fair review", "text": "This time in the bungalows overlooking the pool. Finally they got it right. Same great room but with heat and a small balcony.", "helpfulness": 1, "user": "Brandi E", "date": "December 2, 2013", "id": 186589099}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "What more can i say...this place is amazing now. The overhaul it has had in the last couple of years has made it one of the best value for money hotels in Vegas. All of the staff are so friendly and helpful and a massive thanks goes to Lyra Hynie for everything she has done for us. Our room was upgraded to a city view room which was huge! The pool area is lovely now and in general the improvements here are top class. Mr Yemenidjian should be VERY proud of all his staff and his amazing hotel. Would stay here again in a heartbeat", "title": "An amazing place to stay", "helpfulness": 1, "user": "Aawharris77", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 116272044}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Total remodel. Beautiful!! Had the best vacation ever. It was our anniversary and Hotel sent us a bottle of champaign and dipped strawberries with a very nice card!", "title": "Perfect vacation!", "helpfulness": 2, "user": "babsbrister", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116267990}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "Located across from Excalibur and across from the MGM that has a monorail stop, the Tropicana has a new, updated, fresh look and feel. Bell staff are helpful in getting stuff to your room and check-in is a breeze. The room is spacius and the beds comfortable. But simple amenities in the room are lacking--no coffee maker, no micro, no fridge. Bare minimum freebies and no offering of more if you forget things. It's clear they want you to use the Starbucks downstairs. I would try to stay at the Cosmopolitan next time. It's located closer to food courts and other casinos. The monorail is pricey and doesn't take you to all hotels. It's HOT during the day in the summer. Free parking at the casino garages make the car a better option in the summer. The Italian restaurant at the Venetian was EXCELLENT and Jersey Boys was an outstanding show. The line to visit the \"Pawn Stars\" pawn shop was around the building, so we gave up on that!", "title": "Nice location, new room furnishings but no in-room amenities...", "helpfulness": 2, "user": "tc-AYP", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116257947}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "We stayed here for 5 nights my son loved the pool, I found it to be very quiet and the only problem I had was we had to do alot of walking to get to the middle of the strip. Also they add on resort fees which add up after 5 nights", "title": "Nice Pool", "helpfulness": 1, "user": "manycats", "date": "August 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 116235500}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "The hotel staff was very accomodating, efficient, and friendly. The new remodelled rooms were very nice.", "title": "We loved it and did rebook for next year.", "helpfulness": 1, "user": "Sande9", "date": "August 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116211183}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "I met my son and is wife from Chicago to celebrate his 55th birthday over the past weekend....We have all stayed at many of the nice hotels on the strip and decided to try the Tropicana this time..We really have no complaints, except maybe the loud music in the casino at all times...Wish it had been a little softer and not blaring all the time...Maybe I'm showing my age...We arrived at about 2:00pm Friday and had an easy check-in, thanks to nice \"MEL\" and also Nicole Marshall whom I had contacted earlier...They were both so pleasant and made sure my son/wife were in a suite in honor of his birthday and their 30th Anniversary....I had a regular room and we were both in the Paradise Tower so it was handy. Nothing wrong with my room...It was clean and airy and the furniture was in good shape..I certainly have no complaints with the room or amenities of the hotel..We will certainly plan to stay there again on our next trip to Las Veas. The casino is small but you have the option to go to the larger casinos right around ...I didn't chose to, but my kids did and came back liking the smaller casino best.", "title": "Just back from Tropicana", "user": "punky1933", "date": "November 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120362124}, {"rating": 2.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "I would not hesitate to recommend this to anyone...Just give it a try and realize you are getting \"alot of bang for your buck\"....ENJOY.", "title": "Sadly Disappointed", "helpfulness": 2, "user": "Nicole S", "date": "November 8, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 2.0}, "id": 120356326}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "We came to Vegas for the first time ever for our 10th Wedding anniversary, we did some research into hotels and were very excited to see what people said about the Tropicana online and that it was rated #16 out of 281 hotels, either the Tropicana are paying employees to go on and add these comments or people really have low expectations of what a good hotel is.", "title": "Fantastic Stay", "helpfulness": 2, "user": "divebunnyLondon", "date": "November 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120353339}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "#1. Check in took us around 20 minutes in line as they had one person on the desk, this person was not at all friendly, we were so excited to be there and felt disheartened when the lady gave us attitude.", "title": "New Trop", "user": "NaddieNewfoundland", "date": "November 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 120341424}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "#2. When we got to our room, there was no hot water in the bathroom so we called to the front desk muliple times and did not get any answer. The bathroom we had in room 1559 was BADLY in need of a cleaning, there was mould in the grout the floor tiles were all cracked the filters in the ceiling and wall was very dirty and the toliet would barely flush.", "title": "South end of Strip", "helpfulness": 2, "user": "Beaver25", "date": "November 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 120331097}], "location": {"country": "United States", "city": "Las Vegas"}, "stars": 4, "variance": {"poor": 260, "average": 819, "very good": 2011, "terrible": 152, "excellent": 2466}, "aka": "Tropicana Las Vegas Hotel Las Vegas", "slim_ranking": 0.207407407407, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.0}, "description": "Prepare to be surprised! The Tropicana Las Vegas - a DoubleTree by Hilton redefines the expectations of today’s global travelers with a recently completed $180 million transformation which provides a true resort experience. In addition to a vibrant and exciting motif with a South Beach, Miami rhythm and vibe, the transformation of the hotel, resort and casino includes a fresh redesign of every best-in-class room and suite, the casino, the conference center and exhibition hall, several new restaurants, bars, a new poker room and race and sports book, and the recently debuted Glow®, A Mandara Spa and fitness center. In spring 2012, Tropicana Las Vegas introduced a new comedy club, Laugh Factory Las Vegas with first-class entertainment from performers like Murray the Celebrity Magician and Gallagher. Tropicana Las Vegas is not affiliated with any other property or brand."}