{"user_rating": 4.5, "review_count": 116, "name": "Trout Point Lodge of Nova Scotia", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "We just got back from 2 days at the Trout Point Lodge. It is in a beautiful wilderness setting, and fits into the forest environment. The furnishings/design were very attractive, and the food was wonderful. We took a kayak trip down the lovely river which runs next to the lodge, and couldn't have found a more striking natural environment. We also enjoyed swimming off the dock in the river, and sitting in the wood-heated hot tub. We've never been anywhere quite like this, and would highly recommend it.", "title": "Unique and wonderful experience", "helpfulness": 3, "user": "tripwoman", "date": "July 11, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3658642}, {"rating": 4.0, "title": "Great location, so-so meal", "text": "We stayed here in 9/03 for our last night in Nova Scotia. After seeing their website, we looked forward to this stay very much. The location is very rural, quiet and beautiful. We stayed in The Granite Suite, the nicest of the lodge and it had a huge fireplace, sitting room, two person jacuzzi in the bathroom, and a twig canopy bed. It was a bit damp with all the stone and they could've used more area rugs to warm/cozy up the room a bit.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "March 4, 2004", "id": 1705318}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "The location is truly remote, breathtaking. We were upgraded from the Granite Suite to the River Bend House, and while the house was enormous and we rattled around a bit, the upgrade was appreciated and we can certainly confirm that it would be a terrific place for family and friends looking for adventure. While not impeccably clean, it was adequate (noting that this is a lodge and not the Four Seasons). I did have a chance to see the other rooms, and while austere (again this is a lodge), were clean and nicely appointed. While the beautiful surroundings were what drew us, we were excited to dine at the main lodge. We were not disappointed, by far the best swordfish we have ever had. Everything from the starter course (soup) to desert were extraordinary. We sat at a common table with other truly lovely guests and judging from the oh's and ah's we were not alone in our opinion. Service attentive. Everyone had a wonderful time. Von and Charlie truly run a remarkable lodge worth the few miles of gravel roads.", "title": "Amazing Location & Dinner", "helpfulness": 6, "user": "ANGshire", "date": "September 12, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 5792790}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "My husband and I stayed at Trout Point Lodge in August of 2006. One of the main reasons we decided to stay at Trout Point was because of the free use of mountain bikes, kayaks and the availability of hiking trails. We found two mountain bikes: both with flat tires. The kayaks were in poor shape and the one lone paddle boat was filled with dark dirty water. We never did find the \"beautiful\" hiking trails. A rustic bridge to walk on was roped off because it had collapsed.", "title": "Never Again!", "helpfulness": 30, "user": "RoseBower", "date": "September 10, 2006", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "rooms": 3.0, "location": 1.0}, "id": 5787685, "likes": {"liked": "— The lodge was beautiful from the outside", "disliked": "— No security. Not at all what was described on their website."}}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "A few of our other complaints were: no keys for the rooms, dead bolts on the doors that did not work, no phones or televisions in the room, and spiders and spider webs everywhere.", "title": "not worth the money...", "helpfulness": 27, "user": "foodcritic67", "date": "August 8, 2006", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 5578561}, {"rating": 2.0, "title": "Not worth the money", "text": "The dinner was nice, but it wasn't until after we ate that we learned our meal was $95.00 not including the wine. When we checked out in the morning a 15% gratuity was added to the entire bill.", "helpfulness": 23, "user": "EBStorey", "date": "October 3, 2005", "id": 3986835}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "And.........the final straw was seeing the young man at the main desk dressed in his pajamas because he had overslept that morning.", "title": "Wonderful!", "helpfulness": 2, "user": "05", "date": "September 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3943495}], "location": {"country": "Canada"}, "stars": 4.5, "variance": {"poor": 7, "average": 5, "very good": 12, "terrible": 7, "excellent": 85}, "aka": "Trout Point Lodge Of Nova Scotia Hotel", "slim_ranking": 1.0, "description": "A member of Small Luxury Hotels of the World in Atlantic Canada's largest wilderness area, the lodge offers unpretentious gourmet dining, spacious guests rooms, cottages, and outdoor recreation including canoeing, river swimming, star-gazing, kayaking, and hiking. Guides available. Trout Point Lodge is rated 5 stars by Canada Select."}