{"user_rating": 4.5, "review_count": 1087, "name": "Trump International Hotel & Tower Chicago", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "This hotel is gorgeous, rooms are decorated with very good taste, pillows and beds are amazing, however the best part of Trump Chicago is their staff.", "title": "The best-", "user": "mrsregino", "date": "December 25, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 148039546}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "All of them are super helpful, they are always trying to make your stay more enjoyable.", "title": "It was over the top...Good that is.", "helpfulness": 1, "user": "Jebmills", "date": "December 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147816560}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The brunch buffet at 16 is not to be missed.", "title": "Trumptanstic! We were Trumped.", "helpfulness": 1, "user": "pkmiles", "date": "December 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 147795966}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "I was a little surprised how small the lobby was when I checked in....nothing bad just a little unusual. From there the rooms and survice were First Class. I had a room that had a great view of the city and was well appointed all the way down to the coffee maker. The staff had speculator customer service ever to the point of being over the top but who does not like to be spoiled rotten even now and then. Great location about a block and a half from Michigan Ave. Highly suggest this place if you want to be pampered.", "title": "Amazing", "helpfulness": 1, "user": "dellis0914", "date": "December 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147604734}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "We went for a couple's stay and were both pleasantly surprised with how great this property is. We stayed for about 4 nights and right away were pleased with the decor, they were just setting up Christmas decorations and the front of the hotel was just beautifully done, especially at night when the parking structure turns on red and green lights. The staff were all very well trained, with great customer service. The room was large, we stayed in a suite and the living area is very spacious and equipped with a small kitchen (I guess it's a condo hotel) and the bathroom was huge. The housekeeping was first rate, these kind of rooms are hard to clean but they hit every mark. We even had a fabulous view of the river and when there was some kind of light parade at night we had the best view. The only thing you might want to consider is the location. It is a great location but farther away than the Pennisula e.g. from the shopping. Beautiful decor too, understated and modern.", "title": "Amazing experience", "helpfulness": 1, "user": "Triplemama", "date": "December 16, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 147543804}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "My husband and I stayed here for his 60th birthday and from the time we pulled up to check in until we pulled away, our stay was perfect. All of the staff were so friendly and helpful and surprised us on many occasions by calling us by name. We enjoyed a couples massage which was relaxing and romantic and dined at Sixteen for a delicious gourmet meal. They have spent time considering the traveler which makes too many small details to mention but which sets this hotel apart from the others. Another overnight will be in our near future. Fabulous!", "title": "Perfect Birthday Celebration", "user": "Christiann52", "date": "May 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 107357266}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Stayed here for one night. Chose the Trump Int'l Hotel & Tower because it was across the street from a restaurant where we were meeting family. The service at this place was spot on. Literally five minutes after check in, the doormen, concierge and front desk staff was calling us my name. They handed my boys Trump Hotel, Chicago baseball caps on the way to the elevator and were gracious without being gratuitous. We were in room 1429, a spa room which means big bathroom I think. The room itself was done in a more contemporary way than I typically like - more like the Park Hyatt Chicago than the Four Seasons or Ritz Carlton. There were coffee stains on the end tables, but other than that, the room appeared clean and well kept. My absolute biggest issue with the room was the all the gadgetry. Never did figure out how to turn on or off the bathroom lights. The phone only worked as a speaker phone. Curtains open with buttons. A heavy, frosted sliding glass door to the bathroom that didn't shut completely. But back to the service - turndown was perfect, leaving popcorn, root beer and water. Upon leaving, the valet brought our car and it had four bottles of cold water, one in each cup holder. All inexpensive touches, but certainly nothing that I seen at the Park Hyatt or Four Seasons in Chicago. Room was $475 for a Sunday night in keeping with other hotels of a similar brand. After *many* contiguous nights at the PH and FH in the past, they had no idea who I was or cared to be bothered. Bring someone tech-savvy to figure out the room, or take the time to ask the bellman, and all will be good.", "title": "Impeccable service, rooms just good", "helpfulness": 1, "user": "detroitmom", "date": "May 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 106754077}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Great suite (900ft²), booked through What A Hotel.com. Overall price ended up being very reasonable. We had the most fantastic rooms with views towards Lake Michigan a downtown. What A Hotel also provided some credit for hotel restaurant, which meant we paid almost nothing for breakfast during stay.", "title": "Has the views and the service", "user": "19202009", "date": "May 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106634118}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "The hotel has excellent spa/gym facilities. Pool is a decent size. Changing rooms well serviced.", "title": "One of the best places to stay in Chicago!", "user": "Polarhq", "date": "May 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106593543}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "Concierge staff polite and friendly, particularly to our 6-year old.", "title": "Absolute Perfection", "helpfulness": 2, "user": "InternationalAhole", "date": "April 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 105415134}, {"rating": 4.0, "stay_parameters": "Stayed December 2012", "text": "Have stayed here a few times, love the location, size of rooms (suites), view of the lake, and staff.", "title": "Upgrade the concierge staff PLEASE", "helpfulness": 1, "user": "Sintragirl", "date": "December 1, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 146581363}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "But the concierge service is not at par for the property. I can't rely on anything recommended by any of the people at the desk.", "title": "High Touch!", "user": "Jerry G", "date": "December 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146529141}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Love the Audi car service, nice touch.", "title": "Truly spoil yourself!", "user": "Gwen K", "date": "November 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146317547}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "The mattress in my suite needs replacing, dips too much from use.", "title": "Wonderful Stay at the Trump", "helpfulness": 1, "user": "eteyemd", "date": "November 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146292954}, {"rating": 5.0, "stay_parameters": "Stayed November 2012", "text": "But overall it is good value.", "title": "True 5 star, one of the nicest suites I have ever stayed in :-)", "user": "ajalwinter", "date": "November 25, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 146181786}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Nice hotel, pretty rooms but we couldn´t sleep two nights due to loud music (didn´t know were it cae from) we called frot desk, did not do much...at the check out we complaindes again and ericka at front desk just said \"I am sorry...\" easy to say....but when you are leaving the kids home to have a vacation, pay a five star hotel and want to have a nice rest, and don´t get it , you expect they respond in another way .", "title": "nice hotel bad servic from front desk", "user": "linamuni", "date": "May 24, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 4.0, "location": 4.0}, "id": 109729399}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "The should care about their guests experiences", "title": "Very Enjoyable Experience", "user": "LTtravelUSA", "date": "May 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 109460205}, {"rating": 5.0, "stay_parameters": "Stayed May 2011", "text": "Great place to stay. Property is well cared for and the attention to detail shows throughout. Don't pass up an opportunity to stay here!", "title": "Location, unsurpassed views, and unbelievably quiet room", "helpfulness": 1, "user": "Frick", "date": "May 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109013588}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "My daughter and I won tickets to Oprah's Surprise Spectacular, so I wanted to find a hotel to make the trip extra special. Each time we visit Chicago, I like to try a different hotel. Trump International had a special rate for a three-night stay and that's what convinced me to give it a try.", "title": "Best hotel I've ever stayed in !", "user": "ASDLondon", "date": "May 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108706366}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "We arrived in the evening, escorted to our room by a bellman who showed us the details of our room. When he opened the curtains (electronic, by the way), the view took our breath away.", "title": "\"The Perfect 25th Birthday\"", "user": "bambinaxo", "date": "May 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108312536}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "If you are looking for a beautiful hotel in the best location in the most wonderful city .. look no further (yes, it was great!) ... treated like royality, everyone from check in to check out treated us like they would Mr Trump... service and surroundings were impecable. Professional and kindness combined to make our whole family feel welcomed and special. Chicago was fabulous.. the museums, public art (THE BEAN is awesome), shopping, taxi drivers and shop keepers very friendly and helpful. so much to do and see, and having the trump as \"home\" was a treat.", "title": "a beautiful place in the best city in the world", "user": "travelinMaxwells", "date": "November 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146153570}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We stayed at the Trump Hotel as a Thanksgiving staycation. Upon check-in, we were double upgraded to a suite (booked room through our credit card's hotel program) with a west and suth facing view. The room was approximately 1500sf and was absolutely incredible. We had a separate bedroom with the nicest spa-like bathroom I have ever experienced (glass enclosed shower, deep soaking tub) including a tv (yes, a tv!) built in to the mirror. The bedroom had a bose radio along with a pillow menu. The first evening we dined in Sixteen (a holiday tradition) and utilized a spa service the following day.", "title": "Awesome Experience", "user": "Steve321", "date": "November 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146145587}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Never wanted to leave!!!", "title": "Great experience", "user": "heikeanna", "date": "November 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 146014939}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "We chose the Trump Int. during our trip to Chicago, Detroit and Toronto.", "title": "White Glove Service", "user": "MeganPat", "date": "November 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145953552}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Excellent room and service, central location, nice architecture.", "title": "Excellent stay!", "helpfulness": 1, "user": "TJW2017", "date": "November 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145826781}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "We have stayed at Trump towers several times, but this was by far our best visit. I was traveling alone with my 3 boys 13, 10, and 4. Upon arrival they welcomed us with trump kid's clubs baseball caps. We had a suite which had a bedroom with a kingsize bed and then a living area with a pull out couch, full kitchen and, 2 bathrooms. The master bathroom has a tv built into the mirror and I never have had 3 boys fighting over who was going to take a bath next. The room was very spacious with great views and floor to ceiling windows.", "title": "Favorite hotel in Chicago - great place to stay with children", "user": "cosmokat", "date": "April 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104411362}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "The kids arrived back from dinner in the evening to beautiful hand-dipped chocolate cookie creations with milk. They also have kids size bath robes and slippers.", "title": "Great Location!", "user": "TerriDougherty", "date": "April 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104394286}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "They have a great pool and a nice workout area. The staff is attentive and prompt when you ask for service.", "title": "Plush, Sexy, Location ... Fabulous", "user": "foodiehotelguy", "date": "April 11, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103696880}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Previously, we would book at the Four Seasons, but since the arrival of Trump, we have been staying here and have been very pleased with the level of service.", "title": "THE BEST PLACE TO BE", "user": "rolf_eckert", "date": "April 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102942826}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "This hotel has some of the nicest rooms I've ever been in. We had a room with a view of the Chicago River and Lake Michigan and the bathroom was all marble. The bed was comfortable and the resaurant in the hotel was great for breakfast. We were in Chicago to see the Cubs game and to see The Blue Man Group so we were just there for the week-end but it was a great trip. This hotel is so beautiful I highly recommend it if you're going to be in Chicago anytime soon.", "title": "Excellent hotel at superior location", "user": "Luk4000", "date": "April 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102427490}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "Stayed here for one night while in town for an interview. I don't stay at many properties of this caliber so that's probably why I was so blown away. Still, I held the hotel to a much higher standard than any others I've stayed in. Check-in was seamless and I was escorted to my room by the bellman. The room was gorgeous and sort of resembled those at the Wynn in Las Vegas. It was a huge room, beautifully appointed and had a full kitchenette. I was impressed that the wireless internet was actually free to use and wouldn't cost me $12/day. Bravo Trump! The bathroom was also extremely spacious and had a very unique shower/bath tub layout with top-of-the-line fixtures. After settling into my room, I had dinner in the bar section of the fine dining restaurant. I waited too long for my meal and when it came out, it was not as I ordered. Feeling very irritated, I asked them to correct my entree and send it to my room since I had been waiting a while. They delivered the food promptly but it was only ok. I've eaten in many fine dining restaurants and was not impressed by this one. I had my shoes shined using the complementary shoe shine service and requested the morning paper of my choice. I had a fabulous night's sleep in the very comfortable bed, and used the fitness center in the morning. The fitness center, hands down, was the best equipped hotel gym I've ever used. They had plenty of hand weights and a Smith press machine which I used for pull-ups. It was great! My room was impeccably clean expect for right next to the toilet paper dispenser. There was a tiny brown smear on the wall which disgusted me because I can only imagine what bodily fluid could cause a small brown smear. Other than the restaurant and the smear, I was blown away by the hotel and wished I could have stayed longer. I felt very pampered.", "title": "WOW", "user": "LuvSLO", "date": "June 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 112019747}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "We are just returning from a four day stay at the Trump Hotel in Chicago. We have stayed at many 5 star hotels...Ritz-Carlton, Four Seasons, St.Regis, etc. None compare to the amazing service of the Trump Hotel! From check-in to checkout service was exemplary. Keep up the good work. Thanks!", "title": "The BEST hotel EVER!!!", "user": "ShalS99", "date": "June 6, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 111829774}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "I have stayed at various 5-star-plus properties in the last few years, however, the experience at Trump International Hotel in Chicago surely ranks among the top stays. And this is only partly due to the fact that this recent addition to Chicago's hotel market is brand new and thus offers stunning architecture combined with all the modcons one would expect nowadays.", "title": "Amazing level of service in an amazing hotel", "user": "FuenfsterneTiger", "date": "June 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 111734490}, {"rating": 3.0, "stay_parameters": "Stayed June 2011", "text": "Yes, the rooms are spacious, have spectacular views, are well designed and very, very clean. However, what sets this place apart from the crowd - and here the owners seem to have taken a leaf from \"The Four Seasons\" philosophy - is the spotless service provided at each and every point of the stay. Here, I would like to single out the excellent Concierge Desk staff - I have yet to stay at a hotel with as many \"Clefs d'Or\" concierges (the ones with the crossed \"golden keys\" on their lapels) on duty as here at the Trump. Their friedliness, their attention to detail, their knowledge of the ever changing city was absolutely flawless. Their dinner recommendations (and I am not an easy customer) were fabulous.", "title": "Way overpriced!!!!", "helpfulness": 3, "user": "Djsilver1", "date": "June 4, 2011", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 4.0, "service": 3.0, "rooms": 5.0}, "id": 111381826}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "I have enjoyed every second of my stay at this great hotel - and I am looking forward to coming back soon.", "title": "Nice Decor and good customer service", "user": "supreeth007", "date": "June 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111278495}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "Decor", "title": "Luxe", "user": "Jodi101", "date": "December 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147350661}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "Beautiful and contemporary decor. Tastefully decorated.", "title": "FANTASTIC", "user": "Natalie F", "date": "December 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147340622}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Service", "title": "Nice, but not what I hoped for.", "helpfulness": 1, "user": "Shan7k", "date": "December 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 147123977}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "Kind service that treated you like a VIP.", "title": "True Luxury", "user": "jyyanks", "date": "December 8, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147007186}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Turn Down Service", "title": "Pure Luxury!", "user": "travelgir0183", "date": "December 4, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 146784219}], "location": {"country": "United States", "city": "Chicago"}, "stars": 5, "variance": {"poor": 15, "average": 39, "very good": 126, "terrible": 8, "excellent": 899}, "aka": "Trump International Hotel And Tower Chicago", "slim_ranking": 0.0301204819277, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "description": "Poised along the Chicago River at the juncture of the Loop and North Michigan Avenue, Trump International Hotel & Tower® Chicago is downtown’s most enviable address. The Chicago boutique hotel joins a list of landmarks, including the Magnificent Mile, Chicago River and Millennium Park. Soaring 92 stories, the structure of polished stainless steel and iridescent-tinted glass is a showcase of bold style and engaging design. Inside this luxurious hotel, impeccable style and spectacular four star services define the experience. Guests will enjoy a higher level of luxury with unrivalled hospitality and detail-oriented amenities, including personal attaché service. 339 graciously appointed guestrooms and suites await, with custom designed furnishings, floor-to-ceiling windows and fully equipped kitchens. Our signature, Michelin rated restaurant, Sixteen, features elegant, modern-American cuisine, complemented by sweeping lake, river, and city views. For an important occasion, the sophisticated surroundings of the Grand Ballroom or Conference Rooms will offer the perfect venue to make a lasting impression. The 23,000 sq. ft. Spa at Trump features an array of four star services with treatment rooms and spa hotel suites overlooking the Chicago skyline. All within walking distance to the best of downtown Chicago, from the exclusive shops on Michigan Avenue to the historic sites along the Riverwalk. An icon of definitive luxurious style, the Trump Chicago Hotel® brings sophistication and elegance to the heart of Chicagoland."}