{"user_rating": 3.5, "review_count": 1530, "name": "Trump Taj Mahal", "reviews": [{"rating": 1.0, "title": "Not a good expierence on September 11, 2004", "text": "I always have the buffet at the Taj Mahal when I visit Atlantic City. This past Saturday I was there, September 11th, the buffet was TERRIBLE, the food was not hot, not close to warm, the ribs were tough, the chicken dry, roast beef???, very little choice of vegetables, no crab legs. I was very disappointed, again this was my first and hope the last bad expierence, I felt you needed to know. Horrible, Horrible, terrible, terrible. I usually don't do this but I need to comment on the lousy meal.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "September 13, 2004", "id": 2526246}, {"rating": 2.0, "title": "Nothing special", "text": "Elaine Mitchell", "helpfulness": 18, "user": "FanaticTripPlanner", "date": "September 2, 2004", "id": 2509773}, {"rating": 4.0, "title": "large rooms", "text": "We recently stayed at the Taj because we got a complimentary rooom. The whole place is over the top tacky and garish. Check in was the fastest we have had in AC. The room had an 80's decor- lots of mirrored closets, mirrored headboard, black lacquer furniture, smoked glass, etc. but did not show significant wear and tear. We did have a nice ocean view from the room and the bathroom was pretty clean and was all marble. There were lots of stains on the carpet and the sheets were paper thin, scratchy and stained. The bed was hard as a rock so we didn't sleep well. The upholstered dining chairs were full of dust.", "helpfulness": 10, "user": "peace through travel", "date": "August 21, 2004", "id": 2480091}, {"rating": 2.0, "title": "Not what it used to be!!", "text": "I would say it was comparable to a Sheraton. The clientele was mostly middle class to blue collar, most wearing sloppy shorts and tee shirts. The Bombay cafe breakfast buffet was truly inedible from the eggs to the waffle sticks to the pastries.YUK! We had 2 comps for the Sultan's dinner buffet but there were literally hundreds of people in line so we ate at the Stage Deli instead which was empty but excellent. I would never pay to stay here. It is no comparison to the Borgata which is first class all the way. This was just way too tacky for us and nothing special although most people will probably be amazed at all the marble, gold and glitz. The dealers were not friendly at all. Most of them did not even make any conversation. There were a lot of non smoking tables which I appreciated.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "July 29, 2004", "id": 2332915}, {"rating": 2.0, "stay_parameters": "Stayed July 2004", "text": "This was our 1st time staying at the Taj, the check in went very smoothly and the staff was very friendly.", "title": "Loved it, but!!!!!!", "helpfulness": 14, "user": "Groove", "date": "July 23, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 2.0}, "id": 2317309}, {"rating": 5.0, "title": "Loved the Taj Mahal", "text": "We were in awe when we got off the elevator of the 49th floor it was all mirrors, and our room was very nice.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "April 7, 2004", "id": 1768998}, {"rating": 2.0, "title": "SLOTS ARE VERY TIGHT", "text": "When we came back to our room that night there was loud music coming from the room next door and we immediately called downstairs, security came up, and the music was shut off, but then the people next door kept opening the door in between our room and theirs and making loud comments and the music came on again, so we called downstairs and security came up a 2nd time but no one answered the door, so the young security officer called his supervisor who came up and could not get in the room so he had to take his key and enter and when he got in there was no one there, they had gone out and left the music on just to aggreviate us.....Security told us they would come around during the night and check the noise.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "April 4, 2004", "id": 1763408}, {"rating": 1.0, "title": "wost experience", "text": "So just wanted to let people know that the walls are very thin and you can hear your neighbors next door.", "helpfulness": 24, "user": "A TripAdvisor user", "date": "March 15, 2004", "id": 1726156}, {"rating": 5.0, "title": "Second time just as good as the first", "text": "Other than that experience I would stay there again.....", "helpfulness": 13, "user": "SpikeNiki", "date": "February 16, 2004", "id": 1651354}, {"rating": 4.0, "stay_parameters": "Stayed October 2004", "text": "Stayed at the Taj twice, once with my husband and once with my teenage girls. (my daughter wants to go back after her high school graduation instead of a party). We loved the room decor, restaurants were classy, chandeliers were spectacular, casino's were alot of fun. We are going back this month but no comp rooms left when we are going so we are trying Trump Marina, we figure we cant go wrong since The Donald really knows how to put together a hotel.", "title": "love the Taj", "helpfulness": 9, "user": "rubyrd", "date": "April 9, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3345659}, {"rating": 4.0, "title": "First time stay", "text": "I was just reading some of the reviews regarding the hotel and feel that most probably came on a very bad day for everyone. I recently visited the Taj Mahal, along with my boyfriend, for the very first time right after New Year's. We have been patrons of Harrah's and Showboat for years. I have to say that I was very impressed by the cleanliness of the room and the friendliness of the person who checked us in. I don't remember her name but I think she was one of the managers and Halina, who gave us our key and checked us out the next morning, was exceptional kind and professional. I can see where you have bad experiences on occassion. On one of our visits to one of the aforementioned hotels, we had to call someone to come reclean our rooms because the floor was not clean. So the point I'm trying to make is that problems occur everywhere. I'm sure all of these hotels strive to provide the best service possible to everyone. As for attitudes of workers, these individuals have to deal with hundreds of people wanting them to move mountains to accomodate their needs. I'm sure they do their very best to assist but customers can be RUDE too! If I had to assist these individuals, I would have to bite my tongue. Therefore, possibly appearing to be rude. We personally experienced an episode in the Sultan Feast where a waiter was severally harrassed by a patron. Despite the verbal abuse from the patron, he was very respectful to the customer. Everyone around saw what was going on. I actually commended the waiter for how he handled the situation. We will return!", "helpfulness": 12, "user": "A TripAdvisor user", "date": "January 7, 2005", "id": 2988425}, {"rating": 5.0, "title": "Had a great time!", "text": "I went for a few days for my birthday Dec 13, 2004. We bumped up to a suite for only $50 more. It was WELL WORTH IT!! Had a hot tub right in the bedroom and 2 very large rooms. Amazing views of the Ocean all around. The room could be updated, very 80ies, but clean. The staff couldnt be nicer. I was disappointed that on Monday, Tuesday nights hardly any of the restaurants/bars were open. The place was very quiet. If you want a nice room, great price, Stay here!", "helpfulness": 10, "user": "srny", "date": "December 17, 2004", "id": 2897526}, {"rating": 1.0, "title": "food poisoning of october 10,2004", "text": "On October 9, 2004 approximately at 3:30p.m. I arrived to the Trump Tajmahal Casino, with all my intention of enjoying the evening, like I do every wednesday for the last two years. Little did I know that I was going to experience a evening of HORROR and Distress. Around 6:30 p.m. I visit the Bombay Restaurant to have dinner, I order Chicken Cutlet Parmigan with pasta, no sauce because I do not eat Sauce, I finished dinner around 7:30 and I hen went back to the casino to play for a few hours, after 2 hours I started to feel nauscious, i then decided to drive back home by 9:30p.m., I arrived my home around 11:45p.m. still feeling very light headed and dizzy, around 12:30 p.m. I tried going to bed to get some sleep but it was impossible, by 1:45 I started throwing up and this continued till 3:30p.m. until I was rushed to the Emergency room of the Saint John's Queens Hospital on Queens Blvd, New york where I was diagnoised that I had FOOD POISONING, I spent all night and next day in the Hospital and discharged late Sunday, to date I am still suffering from my stomach, but the worse experience was when I returned to the TajMahal casino the following Wednesday, October 13, 2004 I went back to eat at the Bombay Restaurant around 2:00p.m.and I bumped into a Full Food inspection conducted by inspectors and this was actuall confirmed by the waiter serving at the time. I personally enjoy going to the Trump TajMahal casino but I really feel there should be more inspections done when it comes to FOOD. My experience is not wished for no one. Thank you Mr. Donald Trump.", "helpfulness": 16, "user": "A TripAdvisor user", "date": "October 28, 2004", "id": 2793525}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "My wife and I have been staying at the Taj for the last 3 years or so. With our ‘play’ we always get a good complimentary room from our fantastic casino host. Check in has never been a problem and the staff has, for the most part, been very nice. Our rooms, sometimes suites on the 14th floor, have always been clean with a great marble bathroom. The average rooms have a 21” TV but the all the suites have been supplied with 35” TV’s for your viewing pleasure. They also come with cathedral ceilings, oversize marble shower, lighting on dimmers, and a great view of the ocean. On the down side, it is close to their Casbar Night Club. You will here muffled loud music till 2am.", "title": "Safe bet in Atlantic City", "helpfulness": 29, "user": "scott104", "date": "July 24, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3696922}, {"rating": 1.0, "title": "Loyal - Never Again", "text": "If you get a room by the elevators, no matter what floor you are on, I promise you that you will here them all night long. The cable that is attached to the elevators produce a low, quiet “hum” when they move. It’s not loud but very evident in a room with no sound. This is a problem for most people but, as strange as this may sound, the noise puts me to sleep! I think this was a design flaw. They didn’t anticipate the cable hum at high speeds and provide sound reduction foam in the elevator shafts or in the adjacent rooms.", "helpfulness": 51, "user": "A TripAdvisor user", "date": "July 8, 2005", "id": 3647583}, {"rating": 5.0, "title": "Living the life.", "text": "The casino’s exterior is gorgeous with chandeliers that cost more than a million each. For dining there is a buffet for $19.95 per person, The Casbar Café 24 hour deli for hamburgers and sandwiches, and Dynasty that offers Cantonese, Chinese and Sushi dining pleasures. Mark Anthony’s Steakhouse will serve fantastic steak dinners and gourmet pizzas in an elegant setting that is very quite. Hard Rock Café is right on the premises for casual dining in an atmosphere that made Hard Rock famous.", "helpfulness": 13, "user": "JOSEVI V", "date": "June 15, 2005", "id": 3558020}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "One of the events was the Valentine’s Day Dance in 2005. It was spectacular. Three gorgeous ice carvings, surf and turf dinner, and a great musical entertainment. The site to see over 1000 people getting served simultaneously by hundreds of waiters is something else. Another event my wife and I attended was the Lady Luck dinner, where you actually got to vote on who would represent the Taj Mahal as a spokesperson.", "title": "What a great place! 80's glamour...loved it!!", "helpfulness": 14, "user": "meesterbond", "date": "June 8, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3539038}, {"rating": 4.0, "stay_parameters": "Stayed May 2005, traveled on business", "text": "We never had a problem with room service until our last trip. We received our food on a broken table but were quickly replaced with a new one. Room service wait can be from 45 minutes up to 1 ½ hours. The food is always consistent. Room service is available 24 hours every day.", "title": "Nice and comfortable - try not to be too close to the elevators", "helpfulness": 15, "user": "pandjdmura", "date": "June 2, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "service": 2.0}, "id": 3522382}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 194, "average": 316, "very good": 503, "terrible": 154, "excellent": 363}, "aka": "Trump Taj Mahal Hotel Atlantic City", "slim_ranking": 0.183333333333, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 4.0, "location": 4.0}}