{"user_rating": 4.0, "review_count": 1472, "name": "Tryp Barcelona Apolo", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The Check-in took forever, and although Ryan was very pleasant and had a good sense of humour, efficiency was not in their vocabulary. He did, however, manage to upsell us the breakfast at 50% off. This was ok - nothing special. Fruit, pastries, nduja, chorizo, fruit juice, and the restaurant was quite nice, but typical mass buffet breakfast. Quite badly signposted so took me a while to realise where the toast facilities were (no-one told you how to go about getting your food, yu kind of just had to dive in).", "title": "Like a Premier Inn, tbh", "helpfulness": 3, "user": "JDawesome", "date": "July 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 133504738}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The rooms were clean. The beds were a little firm but thats personal choice. The ceiling tiles were a bit grim but I have seen worse. No tea and coffee making facilities though so drank all the water in the fridge. The room was at the back, so nice and quiet. The TV only had BBC world news as an english speaking channel, and whilst you don't go away to watch TV, the night it rained heavily it would have been nice to order a film. The safe took a while to master, but once we had figured out you have to hold the door shut until it stops whirring, we were fine. Room service was generous, and came quickly. The hotel iself is ideally placed for the metro, and I recommed you get familiar with it as soon as possible. I didn't until the thrid day of our 6 day stay. Its literally outside the hotel and will make all the difference for your sight-seeing activities. Beware, the road leading to La Rambla, where the Palau Guell is situated, is in a red light district. It was fine, loads of people around, but an eye-opener for my 15yo daughter! This is a 4 star hotel, yet it didn't feel that far removed from a Premier Inn to be honest, but the basics - clean room, comfortable, well located - were there. Service is slow and the staff, apart from Ryan, were quite brusque and did not crack a smile, but apart from that, this was a good place to lay your head at the end of the day.", "title": "very good hotel & location", "helpfulness": 2, "user": "minasmith", "date": "July 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 133496985}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "My boyfriend & I visited Barcelona on the 11th of june for 5 days. We stayed at the Tryp Apolo hotel. Staff were very helpful, very nice room although we had 2 single beds stuck together, would have preferred a proper double bed. Location is perfect, 5 min walk to la rambla, around 15min walk to the marina & la barceloneta (the beach), metro just outside of the hotel, only used it once to go to Montserrat, we enjoyed walking most of the time. Taxi fare from/to airport cost us roughly €20-€25 We tried the breakfast once, perfect for those who enjoy a huge breakfast, around €11, many coffee places around the hotel to enjoy a coffee/tea + toast for €5. The tour bus was brilliant so you must do it!! So many restaurant to choose from at the Marina with the most beautiful view of the Port (especially at night). We absolutely loved it, there is everything for everyone in Barcelona. We would go back again & again...", "title": "Dedicated, friendly staff are the making of this place", "helpfulness": 2, "user": "Josie F", "date": "July 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 133259559}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We were slightly sceptical about staying in this area of Barcelona but enjoyed five nights which surpassed our expectations. On arrival we ate in ,ordering a room service meal for the first time ever. The food was excellent, beautifully presented and courteously served. The room itself was well looked after in a quiet part of the hotel. The chambermaids were so pleasant and efficient. The breakfast room was always busy and again, the staff were so obliging and quick to spot the needs of residents. Food was plentiful and there was a wide range providing excellent value for money.The bar area is immediately at the side of the entrance. The bar manager is a very capable multi-tasker who is always pleasant. Will definitely stay here when we visit Barcelona again.", "title": "VERY GOOD", "helpfulness": 2, "user": "CHRISTIANA13", "date": "July 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133222132}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "FRIENDLY STAFF, GOOD LOCATION, CLEAN.We did not paid for breakfast but there are so many restaurants in the area to get a good and cheap breakfast.There was a metro station outside the hotel.The price was good!", "title": "Pleasure trip - Retired Couple - mid 60s", "helpfulness": 1, "user": "Oscar R", "date": "July 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 133214301}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "We stayed in the hotel over the Easter Holidays in 2005. The rooms were spacious and clean with all the facilties you could need. There was a fantastic buffet breakfast which could keep us going till dinner.", "title": "Good base for a lovely city", "helpfulness": 7, "user": "ThePaz", "date": "August 15, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3762656}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "We were allowed into the room early which meant we could throughly enjoy our first day.", "title": "excellent hotel", "helpfulness": 14, "user": "looby02", "date": "May 29, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3507597}, {"rating": 2.0, "title": "Find a better hotel in Barcelona", "text": "There is a metro stop right outside the Hotel which is a good way to explore this beautifull city.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "May 21, 2005", "id": 3491238}, {"rating": 4.0, "title": "Great stay", "text": "The only bad thing about the whole trip was Barcelona Airport. It seems to be very badly organised - allow plenty of time to check in. There was even a fight in the check in queue!!", "helpfulness": 8, "user": "A TripAdvisor user", "date": "May 10, 2005", "id": 3455885}, {"rating": 3.0, "stay_parameters": "Stayed June 2012", "text": "I would rate this hotel as 2.5 to 3 stars . Not renovated, poor air conditioning. Staff is not prompt.", "title": "Not recommend to stay there", "user": "oriet8", "date": "July 14, 2012", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 134383764}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "After returning to Barcelona 10 years after first coming here I thought I would treat my girlfriend to a nice hotel for her first visit.", "title": "Not as good as expected", "helpfulness": 2, "user": "Srobbery", "date": "July 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 134355698}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Arriving on the train to Estacio de Barcelona-Sants it was a short 10 minute taxi ride which cost around €15. We had arrived before the normal check-in time so enquirer if we could check in or if we had to wait. The receptionist was able to offer 3 rooms at that time, and as we are non-smokers this took the choice down to one. We were given a room facing towards a side road on the first floor. The room itself is very basic and outdated. The air-con is nice and cold, and fairly quiet so that was a bonus but even that has a stain above it as if it's previously blown out smoke!", "title": "Ideal situation", "helpfulness": 2, "user": "Carol R", "date": "July 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 134290830}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "The bathroom is the biggest let down, there are numerous cracked tiles and the shower unit above the bath is shabby. On the ceiling in the bathroom and just by the door also has polystyrene tiles, which I'm pretty certain have been banned in may countries due to the fire risk!", "title": "A good base for Barcelona", "helpfulness": 3, "user": "TF1_12", "date": "July 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134221378}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "We also have 2 single beds pushed together to make a double/king size bed, which has meant rolling over is a bit of a risk!", "title": "Somewhat disappointing!", "user": "nbct", "date": "July 12, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 134201233}, {"rating": 4.0, "title": "Nice Downtown Barcelona hotel", "text": "While visiting Barcelona for the 2006 F-1 race we stayed at Tryp Apolo with another couple. Hotel was very nice, rooms adequately spacious, bathrooms clean and nicely appointed. Some degree of street noise but not terribly objectionable. Location is convenient to walking to the waterfront and Las Ramblas area (15 min.) Staff generally helpful though a bit brusque. Doorman's recommendation for dinner nearby was excellent and the Front Desk staff suggestion for dinner at the waterfront (La Fonda) was absolutely superb! Would choose this hotel again.", "helpfulness": 10, "user": "WorldCruzr", "date": "May 20, 2006", "id": 5184707}, {"rating": 3.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "I stayed at Tryp Apolo for 4 nights. The hotel in it self is quite ok, little run down but nice people and good service.", "title": "Ok Hotel", "helpfulness": 4, "user": "Twingomine", "date": "May 14, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 5.0}, "id": 5067929}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "The hotel is close to WTC but to close to La Rambla for my tast. The connecting roads to this area are in the late evenings and nights a dangerous place to be.", "title": "Very Nice Hotel", "helpfulness": 6, "user": "THERESA", "date": "April 4, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4933209}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "If you like quietness, as I do, ask for a room at the backside not fasing the street and higher up. The hotel has maximum 6 floors. Do not expect a excellent view, but you cant get it all. And quietness is worth something I think:-)", "title": "excellent hotel", "helpfulness": 4, "user": "clio3", "date": "March 16, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4627384}, {"rating": 3.0, "title": "nice, but you can find better", "text": "Stayed at this Hotel for 2 nights with a group of 45 Students. They were very nice to Us and the Rooms were very clean and well stocked with whatever is needed. The Breakfast served in the Morning was Fantastic. I really took advantage of the wide varitey of Foods that were served. I especially enjoyed the Salami's and Ham's they had available. The bake goods were outstanding and all very fresh and made right there at the Hotel.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "March 15, 2006", "id": 4619722}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Hotel staff was friendly and efficient. Rooms were clean but street noise was a bit bothersome. Close enough to walk to La Rambla. It was fine for one night.", "title": "Barcelona", "user": "Greg B", "date": "July 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 133211701}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We stayed at the Tryp Apolo Hotel on June 8th before our cruise and for two nights after. The accommodations were very good with a great buffet breakfast. The thing that impressed us the most was the excellent service at the front desk. We were especially pleased with Ryan Ford and Miguel Sanchez. They helped us with general information, excellent restaurant recommendations and travel tips. All of this was done with such a friendly patient manner that we really felt special. When we return to Barcelona we definitely will stay there again and we definitely recommend it to others. Sharron and Ron Nolan", "title": "Excellent Service", "helpfulness": 1, "user": "sharronPrescott", "date": "June 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 133072242}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "I booked this hotel as I was attending a Music event in Barcelona. It is very well located near the bottom of Las Ramblas and Port Vel.", "title": "Great Value Hotel in a Top Location", "user": "TimTheGuest", "date": "June 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 133024495}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Rooms are spacious, quiet and well equipped. The bathrooms are ok but could use some updating. The breakfast is amazing! Very good buffet of hot and cold foods so definitely worth the money.", "title": "Excellent cost, brilliant location, slow check in!", "helpfulness": 1, "user": "Claire_wLeeds", "date": "June 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 132959584}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "My only criticism is the huge queue at reception most of the time. I think they need a bigger desk and more staff.", "title": "Excellent", "helpfulness": 3, "user": "Jeny F", "date": "June 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 132759793}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Loved this hotel- everything about it- the service, location, breakfasts, staff- all great for what we wanted.", "title": "Couldn't have had a better stay", "user": "glamourpuss1000", "date": "July 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133986323}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Check in quick, friendly and helpful, no problem that we arrived well before the check in time. We were given a very useful map that helped us as first time visitors to Barcelona.", "title": "Break", "helpfulness": 1, "user": "Safar49", "date": "July 8, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 133760626}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The reception area is airy and comfortable, we didn't use the bar as we went out most of the time.", "title": "Dodgy location", "user": "Mangosalad", "date": "July 8, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 1.0}, "id": 133730462}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We stayed for 4 nights in a very comfortable room which was well equipped and although we were at the side close to the night club, the noise didn't bother us.", "title": "Great value and location!", "helpfulness": 2, "user": "Emma18100", "date": "July 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 133627481}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The location is wonderful as you are only a short walk to the centre of everything and it's easy to find your way back (just look for the 3 chimneys!). The subway is right outside, there is a taxi rank outside, the street opposite takes you straight to the Ramblas and there is a police station half way along it so we never felt worried using it. If you come out of the hotel and go back past the taxis down the road it brings you to the foot of Montjuic which is a lovely walk.", "title": "short break", "helpfulness": 1, "user": "glenn h", "date": "July 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 133586445}, {"rating": 3.0, "title": "Decent Hotel, not the best location", "text": "We stayed there just afer Christmas 2005. The hotel itself was decent enough, the choice for breakfast was excellent. The area the hotel is in is not the best, during the day it is fine but at night there are quite a few dodgy characters hanging around. Having said that, we never experienced any problems. There is a metro station very close to the hotel (Parallel) so you don't have to risk the streets of the neighbourhood if you don't want to. Overall I would say it's a fairly decent hotel but I don't think it was value for money as I was told it was a 4* but the room was fairly basic. I would suggest your money would be better spent on staying at a hotel right in the centre.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "January 17, 2006", "id": 4357678}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "This hotel was quite nice for the price we paid. The staff were very efficient and polite. Unfortunately, we were dissapointed with the breakfast, the variety was very poor compared to other hotels in the Sol/Melia/Tryp chain. The coffee served was terribly weak too. Location-wise, its pretty central but just off the main areas to provide some peaceful sleep at night. The english channels on the TV were all pay per view, and you price includes 4 movies, a bit too much unless you are planning to spend your holiday in the hotel room! The other channels are mostly Catalan, Spanish or German. All in all, I would stay at the Apolo again but only if they had a VERY special offer.", "title": "Nice hotel, but........", "helpfulness": 7, "user": "Gibfamily", "date": "January 3, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 4319993}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "Have just returned after 3 night break between Christmas and New year and can only praise this hotel. Location is first class. We were concerned about reviews highlighting area round about but walked to and from La Rambla day and night, using back street opposite hotel. Never felt threatend once (maybe its because of the main Police Office being in the area) and in fact used several of the small bars and retuarants which were great value. Try the 101 in the steet opposite the hotel or the local bakery directly opposite the hotel on Par alel....great coffee and pastries for 1.50 euro at brakfast time.", "title": "Surprised by the poor reviews!", "helpfulness": 32, "user": "gordie 123", "date": "January 2, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4317122}, {"rating": 2.0, "title": "Disappointed with the Apolo", "text": "O.K. there are a couple of strip clubs nearby and the area is a little run down but it all adds to the charactor.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "December 20, 2005", "id": 4252143}, {"rating": 5.0, "title": "Great Location", "text": "Room and service in the hotel was great, room was clean well decorated and quiet (try to get a room at the back)and is used by mainly business people and air crew.", "helpfulness": 17, "user": "A TripAdvisor user", "date": "November 12, 2005", "id": 4107031}, {"rating": 4.0, "title": "A great base", "text": "My hubby and I spent 3 nights here last week.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "December 15, 2004", "id": 2883149}, {"rating": 5.0, "title": "Loved this hotel and will recommend", "text": "It's away from the madness of La Ramblas and Catalunya, but close to it at the same time.", "helpfulness": 6, "user": "vivvy", "date": "November 28, 2004", "id": 2850818}, {"rating": 5.0, "title": "great hotel", "text": "The metro is on the doorstep of the hotel and we found it really easy to use, fast and unthreatening. You are only 2 stps from Catalunya (about 5mins on metro).", "helpfulness": 6, "user": "A TripAdvisor user", "date": "November 3, 2004", "id": 2804232}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Stayed at this hotel in August 2006. Accommodation good and clean, breakfast very good, bar prices high. Our room on 4 floor looked onto a building site and the noise from thousands of young persons leaving a nightclub at 5.30 in the morning was incredible. Traffic noise most nights from the main road outside the hotel was loud. The area surrounding the hotel seemed quite intimaditing and we felt you had to be careful making your way to either La Rambla or the waterfront. Thoroughly enjoyed the hotel just the location slightly off putting. Would consider staying their again. Staff friendly although they would not change currency for us.", "title": "Hotel Very Good location dodgy", "helpfulness": 5, "user": "anjiej", "date": "August 9, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 2.0}, "id": 5581526, "likes": {"liked": "— Clean", "disliked": "— Location"}}, {"rating": 4.0, "title": "Would recommend", "text": "We flew in a day before our mediterranean cruise and stayed at the Tryp Apolo which was recommended to us by our travel agent. Had no complaints. The staff was friendly and helpful. The room was clean and true to the picture on expedia. Location was great, metro stop just a few steps from the hotel, within easy walking distance of Las Ramblas and the waterfront, short cab ride to cruiseships.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "June 10, 2006", "id": 5330750}, {"rating": 3.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "Stayed here late May 2006 for a works conference, so I had no choice over the location or price. Our group of 26 arrived and in front of us there were a group of 40 checking in so it took a while but we had pre allocated rooms so it wasn’t too bad. A gentleman on reception gave a wondrous recommendation for a nearby lunch restaurant which served tapas (and I don’t even like tapas) I wish I had kept the name.", "title": "Not bad, not great", "helpfulness": 8, "user": "luxurytraveller21", "date": "June 9, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 5328162}, {"rating": 2.0, "stay_parameters": "Stayed June 2006, traveled on business", "text": "The rooms are really average for a 4 star hotel more like 3 star but no major complaints. Don’t expect much of a view; mine was of a building site. I know you don’t come away to watch TV but I do like to have English station on sometimes and the majority are French and German. Also a warning for parents is that there are some ‘hardcore’ channels just on regular TV, which was a bit shocking for this English prude.", "title": "Mediocre", "helpfulness": 12, "user": "justlivingthedream", "date": "June 4, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 5299164}, {"rating": 2.0, "title": "Nice Hotel, Bad Location", "text": "My first time in Barcelona, but I didn’t really get to see anything because of work. The hotel is within walking distance of most areas.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "June 4, 2006", "id": 5297833}, {"rating": 3.0, "stay_parameters": "Stayed September 2005, traveled on business", "text": "This is a great location if you want to visit Las Ramblas. Its only a 5-10 minute walk. The room I stayed in was pretty good for European standards but could've been a bit bigger.", "title": "Great location, but not a 4 star", "helpfulness": 2, "user": "frenchy1124", "date": "April 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 7280394, "likes": {"liked": "— cleanliness, big bathroom", "disliked": "— the size of the room"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "I was only here one night and from what I could hear there was a lot of street noise.", "title": "Nice hotel but Front Office Staff not trustworthy", "helpfulness": 2, "user": "TerryLondon", "date": "February 26, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6841553, "likes": {"liked": "— location", "disliked": "— Staff Member - Ryan Ford - Front Office Staff"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "I recently stayed there from the 20-22nd Feb for 2 Nights. The Hotel was nice, but 1 member of staff 'ryan ford' was a conman. We were there to see the barcelona / liverpool football game. Tickets were on sale at the stadium for 73 euro. Ryan Ford Charged us EUR 200. He first told us that he could arrange tickets for us but at a EUR 30 premium - which was fine. He then informed us the next day (after giving him money) that it was impossible to get tickets but that he would keep trying. In the meantime we were able to buy tickets from the football club itself. Later that morning, he called us to say he had tickets, but the price was now EUR 200. So, what do we do.....? we had to pay him more money to get tickets we didn't want and then we had to sell the tickets to other people for EUR 200, even though tickets were available at the stadium.", "title": "Lovely Hotel but street noise is a big problem", "helpfulness": 7, "user": "schoolgirlsweekend", "date": "October 31, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 2.0}, "id": 6033321, "likes": {"liked": "— Cleanliness and breakfast", "disliked": "— Unbearable noise from outside during early hours of the morning"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "If you ask me, i think and feel that this was a very good scam. I would not recommend staying at this hotel as I do not trust Ryan Ford.", "title": "We loved the Tryp!", "helpfulness": 5, "user": "JourneyKat", "date": "October 10, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5936559, "likes": {"liked": "— Alarm clocks are not provided, so bring your own if you need one."}}, {"rating": 4.0, "title": "not a bad hotel", "text": "Four of us stayed for 2 nights (Wednesday and Thursday) and our rooms were located on the side of the hotel. The noise from young people talking, shouting, laughing, drinking etc. from approx. 3.30a.m. to 5.30/6.00a.m. on the pavement/street outside our window was unbearable and kept us awake.", "helpfulness": 8, "user": "wisekatebushfan", "date": "August 15, 2006", "id": 5615028}], "location": {"country": "Spain", "region": "Catalonia", "continent": "Europe"}, "stars": 4, "variance": {"poor": 103, "average": 316, "very good": 672, "terrible": 54, "excellent": 327}, "aka": "Tryp Barcelona Apolo Hotel", "slim_ranking": 0.435946462715, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}}