{"user_rating": 3.0, "review_count": 453, "name": "Tryp Barcelona Aeropuerto", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "We stayed one night in this hotel arriving about 11pm, the air con wasnt working, so we moved rooms, we had 4 rooms in all, the air con was stillnot working, but we had had enough by now. So we opened the window in desparation to cool down, about 4 am, my friend woke and had been bitten at least 14 times on her face and eye lid, and her face was swollen and eye was completely shut from swelling. The next morning went to breakfast, which was cold. When we checked out we explained we had had to open the window because there was no air con working and breakfast was cold and we were not happy, the did give us 50% off the price of our room, but the damage was done by this time. we were staying in Barcelona from 04/06/09 to 08/06/09 and my friends face did not look any better for 3 days. I cant fault the cleanliness of the Hotel, but surely the air conditioning is important to most people who stay in Hotels in a hotter country than ours. We wouldnt reccommend this Hotel unless you have a guarentee that the air con is working.", "title": "Clean Hotel, Shame about the Air Con...????!!!!!!!", "user": "winnipeg08", "date": "June 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 1.0}, "id": 32121157}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We stayed at the Tryp Barcelona for one night because we arrived late into Barcelona airport. We rang the hotel once we arrived to check where to get the bus from. It arrived shortly afterwards to take us to the hotel. The room was comfy and modern. The lobby was a big space but managed to feel quite cosy when we popped down late for a drink and a decent club sandwich. Staff were helpful in giving us information on how to get into town.", "title": "Good airport hotel", "helpfulness": 1, "user": "vickyross6", "date": "June 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 2.0, "service": 4.0, "rooms": 3.0}, "id": 31883697}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We stayed at this hotel because we had an early morning flight out of Barcelona, and it was much cheaper than hotels in the city itself. It would have been nice if the airport shuttle came more often, but when it did come, it was very convenient. The decor was very sparse and modern, but the room itself was very comfortable. Definitely the most comfortable bed we had during our trip. The hotel restaurant was closed for no apparent reason (according to the hours it should have been open). We ordered room service instead, which was nice, although the food was nothing special. We also had some difficulty ordering since we did not speak much Spanish and the staff taking our order did not speak much English. In the morning, that shuttle came on time and we got to the airport with no problem. It was perfect for staying overnight near the airport, but I would not recommend it if you plan to spend more time in Barcelona.", "title": "Comfortable Airport Hotel", "user": "digiacomo", "date": "June 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 31482263}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Don't you love a grouchy driver who won't wait for hotel guests, asks the guests to get the porter trolley and get them to push the trolley into the hotel? If you do, then Tryp is your destined stay! Aside from that, the hotel is alright. Not great, but a good value stay for under a hundred euros (breakfast not incl, as we had to leave before the buffet opens).", "title": "Awful service with the shuttle bus driver, otherwise ok", "user": "dot927", "date": "May 31, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 31187765}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Stayed one night after our cruise. Very stark, modern furnishings-but comfortable bed and overstuffed chair. Great room service - food was hot and tasty. I asked for a table and they brought one ASAP. Early am to airport - free shuttle much appreciated, also free continental breakfast in lobby at 0500. Adjacent to freeway, so traffic noise with open window. One bonus - one block to a service station with a restaurant that served decent tapas and light meals outside of the traditional Spanish dining hours so we could eat at 1130.", "title": "Stark, but Comfortable", "user": "Kauai22", "date": "February 10, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 24445550, "likes": {"liked": "— Near airport, free shuttle", "disliked": "— few restaurants around, freeway noise"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "My first and last stay at a Tryp hotel. The room was small and had not been cleaned. The a/c did not work and the window cannot be opened more than 2 inches before it hits the curtain rod. There was only one bath towel for two adults. We were on the third floor across from a door marked Office 3 which banged constantly as maids went in and out. The woman on the front desk disagreed with me when I asked a question about confirming my flight and was quite rude until I showed her how to do it. Nor did she apologize for her mistake. We went to the snack bar for a meal which took two hours until we realized that the waiter was also tending bar at the same time. Bad vibes all around.", "title": "Don't stay here!", "helpfulness": 1, "user": "pstar11", "date": "October 3, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 1.0, "service": 1.0, "rooms": 2.0}, "id": 45763695}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We stayed here the night before a flight, and it was perfectly decent. There was no pool, which is a downside since there is literally nothing else to do (aside from a tiny gym, which doesn't allow children), but the \"family room\" with bunk beds for the kids, and another room (sans door) for the parents was nice. The kids loved the little gift that the hotel had waiting for them. The bathtub's jacuzzi \"spa\" setting didn't work, the slippers and robe were missing, the drain was broken and the shower head fixture was missing, but other than the bathroom defects, the room was fine. Good lighting (a nice change), comfortable beds, decent linens, great air conditioning, and spacious enough for a family of 4. Definitely a good place for a pre-flight night. The wakeup call was timely, and the shuttle to the airport was also fine.", "title": "Decent airport hotel", "user": "JMS18", "date": "July 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 34858940}, {"rating": 2.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "I've stayed in this hotel many times (more than 10) since 2007 as it's next to the office of my company.", "title": "Not for stays longer than one night", "helpfulness": 2, "user": "BusinessTravelere", "date": "June 30, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 1.0, "service": 3.0, "rooms": 2.0}, "id": 33595653}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled solo", "text": "Location:", "title": "I Appreciated the Friendliness of the Staff", "user": "gdwishes4u", "date": "June 17, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 32541098}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "When we got to the airport and told the taxi driver to take us to this hotel, he told us there was a premium charge. The hotel was so close (less than 5 minutes drive) that it was not worth his time to get out of the line, drop us off and return to pick up passengers who were going on to other Barcelona hotels.", "title": "Good Hotel to Connect to a Flight, not a Tourist Hotel", "helpfulness": 1, "user": "criancadodeus", "date": "January 5, 2009", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 23301859}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled on business", "text": "So we paid the price.", "title": "Good for an airport hotel", "user": "PaulBaileyPBAUK", "date": "December 9, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 3.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 22570933, "likes": {"liked": "— Convenience of location"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "I believe there is shuttle service at the hotel, so if you are staying, you may ask to be picked up.", "title": "Great Hotel near the Airport", "user": "E_Panama", "date": "November 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 2.0, "rooms": 4.0}, "id": 21933427, "likes": {"liked": "— Close to the airport", "disliked": "— Faw away from everything else"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "When we got there, the room was stark, but clean. The hotel itself is very stark and minimal. However, we needed to get to a flight the next day and had the shuttle took us free of charge at 4 a.m. We checked out of the hotel around 3:30 a.m. and that was not a problem.", "title": "Mismanaged overrated hotel", "helpfulness": 1, "user": "Hegu", "date": "August 28, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 19453298}, {"rating": 1.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "So if you are staying there to catch a plane, it is great. If you are looking for a vacation spot, you may want to keep looking.", "title": "Don't stay here - NO AIR CONDITIONING", "user": "sprucewood", "date": "August 11, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 2.0, "rooms": 2.0}, "id": 18838648, "likes": {"liked": "— Clean and modern", "disliked": "— No air conditioning"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The hotel is in an industrial estate near the airport. It's OK for an overnight, but not for a lengthy stay. The room was spacious and clean and, at 82 euros, was not expensive. The free airport shuttle service is handy if you want to connect with the Aerobus from the airport to Barcelona (4 euros each way). Breakfast is a bit pricey at 14 euros, but there was good range of hot and cold food. However, the hotel is obviously well-used and it is showing some wear at the edges. Also, the air-con in the room was so poor that it was ineffective. Yet, according to the hotel's \"servicios technicos\", it was not faulty.", "title": "OK for an overnight", "user": "AirCon66", "date": "July 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "location": 3.0}, "id": 17850938, "likes": {"liked": "— proximity to airport", "disliked": "— poor air-con"}}, {"rating": 1.0, "title": "Don't stay at Tryp Bacelona", "text": "We just returned from a brief say at Tryp Barcelona Aeropuerto. The hotel was recommended by AAA as one of the finest hotels in the city, and proudly lists a 4-star rating on the door. It also has a 4-star price (200 Euros per night).", "helpfulness": 5, "user": "LLarwood", "date": "April 29, 2008", "id": 15461001}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The hotel is near the airport (a plus), but on a broken street filled with construction. 3 of our 4 taxi drivers could not find it immediately (even with GPS).", "title": "Splendid stay", "user": "Miguel_Liliana", "date": "March 4, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 14054981, "likes": {"liked": "— The shuttle service", "disliked": "— The location"}}, {"rating": 3.0, "title": "Have you said 4-star?", "text": "Here are a few of the real negatives: Trash not emptied, towels not complete and not changed, no soap or amenities, floor dirty, toilet running, shower handle fell off into the tub, towel rack self-disassembled and partly fell into the tub. Add that to: far from a taxi stand, no concierge, no gift shop, no material in English and the 4-star rating becomes a joke.", "user": "marko5210", "date": "November 30, 2007", "id": 11156713}, {"rating": 3.0, "title": "I was hoping for a good stay here", "text": "Don't stay here.", "user": "Sidgul", "date": "November 21, 2007", "id": 10953923}], "location": {"country": "Spain", "region": "Catalonia", "continent": "Europe"}, "stars": 4, "variance": {"poor": 58, "average": 125, "very good": 156, "terrible": 59, "excellent": 55}, "aka": "Tryp Barcelona Aeropuerto Hotel Barcelona", "slim_ranking": 0.750957854406}