{"user_rating": 4.5, "review_count": 237, "name": "Tucker House Inn", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "I am a frequent B & Ber, so I have a decent base of comparison, i would rate this B & B overall as slightly above average...with explanation. This was my first trip to the San Juans, understanding of their laid back lifestyle...I come fron the East Coast and live on the beach, so I completely have ingrained in me the beach type/outdoorsy lifestyle. We stayed in the Goose on the Pond Cottage - it was quaint, and roomy and had all the conviences of a home away from home. Full kitchen,decent size bedroom, small bath. It was a bit \"rough\", for a B & B with island pricing, it should have been less musty, not had tattered bath rugs and an old worn, stained shower curtain (in a very small shower only, anyone larger than 5'7 and a large frame would have an uncomfortable time taking a shower - very small and narrow.) I understood the rustic theme, still, old, weathered and time to sweat the details update is needed. The website and brochures show several hot tubs, but it seems things have been changed around and now there is only one - so the only hot tub was at the sister property (now seemingly being connected via walkways and stairs to this lower property) The problem is, it is on an elevated deck next to someones suite - right outside their bedroom window (I believe could have been part of their suite at one time, but is now used by all) and not wanting to be rude and rev up the hot tub at 9pm at night on these poor people, we unfortunatly passed on what we thought would be a great relaxer after the great outdoors all day. Breakfasts were okay - I certainly wouldn't call them outstanding in comparison to many B & B's I've been through throughout California and the East Coast. Not to be wasteful, I also think it's a good idea for them to check to see if you'll eat raw fish, so we wouldn't have wasted the raw salmon and eggs that were served one morning - I certainly felt bad about that. Overall, this B & B is clean, and the location is outstanding. I guess the impression left with me is that you are paying for location, because the accomodation and amenities are just above average...I would certainly stay here again, the hosts were nice, again you can't beat the location; maybe another room(?) or the Harrison Suites (the newer sister property) would justify the rate, I guess I just expected to to be a bit nicer all the way around....", "title": "Not Quite Sold", "helpfulness": 3, "user": "kasey363", "date": "August 18, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 5623571, "likes": {"liked": "— Location", "disliked": "— Bathroom accommodation/amenities"}}, {"rating": 5.0, "title": "Just like coming home", "text": "My wife and I had a wonderful stay at Tucker House. Anna Marie and Staff spoiled us with creative, and excellent home cooked meals and an immaculent room. The room was very rustic and serene. We felt like it was a home coming just for us.", "helpfulness": 1, "user": "goirish1975", "date": "August 9, 2006", "id": 5579829}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "Tucker House has a great location only a couple of blocks from the ferry. The owners of this B&B are also owners of Harrison House Suites, which is where breakfast was served (essentially on the same property). Anna Maria and the rest of the crew were very helpful and accommodating including providing recommendations for dinner, making dinner reservations with a view, offering an early \"runner's\" breakfast for those of us participating in the San Juan Half/Marathon, and offering a late check out so we could shower before heading back on the ferry.", "title": "Great place to stay, esp. for San Juan Marathon Weekend!", "helpfulness": 1, "user": "D-Friday", "date": "June 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5332869}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "Our party of three booked Four Winds and loved it. It had a fold-out sofa sleeper and and a separate bedroom with French doors, a balcony, stand up shower, and jet tub. Our group included one cyclist and two runners, so the jet tub was a welcome luxury during our weekend stay.", "title": "Excellent B&B!", "helpfulness": 4, "user": "Lisa1974", "date": "August 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3810863}, {"rating": 4.0, "title": "Wonderful Location, Great Rooms", "text": "The next time we go to San Juan Island, we will definitely plan to stay at Tucker House again!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 21, 2005", "id": 3690945}], "location": {"country": "United States"}, "variance": {"poor": 13, "average": 20, "very good": 52, "terrible": 3, "excellent": 149}, "aka": "Tucker House Hotel", "slim_ranking": 0.35}