{"user_rating": 5.0, "review_count": 181, "name": "Tucker Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "This is one of my favorite places to say in Cape Cod. The Inn keepers-Thomas and Howard are magnificent host and have great welcoming personalities. Every morning waking up to Chef Kurtis's breakfast buffet was a great way to start every morning in P-Town. From the clean and immaculate rooms and peaceful zen garden, I would love to be a guest any time of the year. The inn is convenient to everything and offers a lovely happy hour to the guests on Saturdays. I would recommend this place to a group of friends, families and couples.", "title": "We loved it and can't wait to go back.", "user": "lmcole", "date": "June 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 110977784}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "My boyfriend and I wanted to vacation in P-town and as it was our first time, we had no clue about where to go and what to do. Honestly, we selected the Tucker Inn because it was one of the only places that offered a full breakfast with nice rooms at a reasonable price. When we got there, we got way more than we had paid for. Not only are Tom and Howard (the proprietors) some of the nicest people in the world, the inn itself is very beautifully decorated.", "title": "Wonderful people in an amazing place.", "user": "cgeggie", "date": "April 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106014984}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "The breakfast was incredible and freshly made by their chef every morning complete with juice, milk, coffee, and all the other amenities one would expect with it. The room we had was very comfortable. Their garden is rather peaceful and the hot tub is very nice.", "title": "The reviews are right", "user": "bboyneko", "date": "November 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 86433860}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "They had a happy hour garden party on Saturday which was a great way to ease into the night life that P-town has to offer, since it is so close to everything.", "title": "Clean, well appointed, great breakfast and gracious hosts!", "user": "ptonh1073", "date": "October 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83970858}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The friendly atmosphere, superior service, and excellent experience we had has certainly made us return customers.", "title": "You will feel like you are coming home before your stay is over!", "user": "ljbarry", "date": "October 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82596542}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The breakfasts were plentiful and delicious. Several different choices ranging from egg dishes to cereals to fruits, juices, coffee, teas and various kinds of breads.", "title": "Great lodging experience! Well worth repeating!!", "user": "KOnTN", "date": "July 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115198176}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The hosts are wonderful and foster an atmosphere where the guests can relax and feel comfortable. This was our second stay at the Tucker Inn. My spouse and I also got to know every guest that was there during our visit. We always had friendly and meaningful conversations with everyone.", "title": "An AMAZING get away in an intimate setting", "user": "fvparisi63", "date": "July 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115166048}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We'll definitely plan to stay at the Tucker Inn during our next trip to Provincetown.", "title": "Wonderful experience", "user": "AP0312", "date": "July 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114996620}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Howard and Thomas went out of their way to make us feel welcome in their home. I have been going to P-Town for 15 years, and have never spent such a relaxing vacation there. Their chef created master pieces each morning, and made sure there were baked goodies to come home to after a day in the town or on the beach. The other guests were incredibly friendly and made communal meals something to look forward to. This pet friendly compound gave our dog Pico run of the grounds. Running water, fish ponds, and Oriental gardens, kept her quite bust while we were away. This is the kind of place where you don't have to lock your doors.", "title": "The Tucker Inn Made Our Vacation", "user": "toetwo", "date": "July 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114940848}, {"rating": 5.0, "title": "Best intro to P town ever!", "text": "We just returned from our first trip to Cape Cod and Provincetown and we stayed an entire week at the Tucker Inn. We had a wonderful time at the Inn. Howard and Thomas were gracious hosts - friendly, welcoming, and attentive. Curtis, the cook at the Inn, provides a delicious full gourmet breakfast each morning. We loved that the Inn was pet friendly and welcomed our dog, Waldo, with open arms. The two resident dogs, Colby and Chloe, were also gracious hosts and always willing to play a game of tug of war with my husband. We stayed in the cottage and it was a great room (even though it was a bit snug). It had a kitchenette and there is a full sized gas grill available in the outdoor area so we were able to prepare dinners several of the nights we stayed there. One night, Howard invited us to join him and Thomas for dinner because he had made extra food! We were provided with excellent suggestions for nearby activities and the Inn also made a great place to relax and read in the afternoon in any one of the several relaxing outdoor areas. We definitely plan to return and would highly recommend the Tucker Inn to anyone looking for a short stay or even a week long stay like we did.", "user": "emonserud", "date": "June 21, 2011", "id": 114625826}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "My partner and I stayed here in August of 2011 in the days immediately following Carnival in Provincetown. We had a room with shared bath and it was very nice. Although neither one of us had ever stayed in a B&B before, our hosts really did everything they could to make us feel right at home. Their outdoor dining room/patio area is a natural spot to congregate with friends, have some wine/cocktails, and have a meal. Breakfast was always very delicious with a number of healthy choices every morning. Moreover, they also offer a cocktail party with hors d'oeurves on Saturday evening, which allows you to get your pre-party on before you leave for a night out (and also saves $!) We met several other gay couples during our stay with whom we went out for dinner and drinks on several occasions. The hot tub is very relaxing in the evening, and the queen bed in our room was really comfortable! My partner and I really want to thank Howard and Thomas for their gracious hospitality while we were in P-town! We'll definitely be back!", "title": "Great little inn! We'll definitely be back next summer!", "helpfulness": 1, "user": "tapdancer77", "date": "August 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117332081}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We just returned from our second, of what will certainly become an annual, stay at The Tucker Inn. Love, love, love this B&B. Howard and Thomas are friendly and welcoming without being overbearing. Michelle is charming and leaves the room spotless each day. Curtis delivers the most fantastic breakfasts - stratas, linguica sausage, fresh fruit, freshly baked treats. The Inn is perfectly located for visiting the galleries on the East end or the clubs in the opposite direction. Center Street is a surprisingly quiet street connecting the two main strips. If you're going to P-town, stay here. You will be thrilled!", "title": "Fantastic place!", "helpfulness": 1, "user": "Joe L", "date": "August 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117074366}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "This is the second time I stayed here with my better half. We booked the same room over the same days (Thursday through Monday--though on a different weekend) and expected to have the same, good experience we had last year. The room was better (we didn't think it possible) and their amenities--already fantastic--grew. In those respects, our already high expectations were met and surpassed. The things stayed constant were the friendliness of all of the staff, the high quality of the breakfasts, their wonderful cocktail party on Saturday, and the very relaxing atmosphere that the Tucker Inn provides. I could have done without the mosquitoes (completely not the fault of anyone but nature), but then I would have had to avoid Ptown altogether and I wouldn't want to miss staying here. We will definitely come back to the Tucker Inn.", "title": "Consistent Excellence and Surpassed Expectations.", "user": "cgeggie", "date": "August 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116808584}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We are die-hard whale watchers and only wanted a place that was within walking distance from the main pier. What a pleasant surprise to be welcomed \"home\" by new friends, devoted dogs, tantilizing treats, a working AC unit that made no noise what-so-ever, and a patio garden that served as a welcome oasis after a day at sea. Howard, Thomas, Craig, and Michelle--YOU ROCK!! I hope we can return some day. Until then, may you welcome many more new guests who become friends of the heart!", "title": "Peaceful Base Camp", "user": "Dianne W", "date": "August 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 2.0, "value": 4.0, "service": 5.0}, "id": 116565555}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Loved the location, the romantic cottage, the fabulous breakfasts, the dog-friendly environment, and the owners! It was a great place to stay!!", "title": "An amazing bed and breakfast!", "user": "AgLawCheryl", "date": "August 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116133300}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "I can't say enough good things about the Tucker Inn! I just spent four wonderful nights (and 5 days) here. While many other reviewers have given detail about the particulars of the house itself, I want to stress how welcome and comfortable I felt. I truly felt like a friend of the family in town for a visit. It was actually hard to drag myself away from the beautiful, peaceful patio (with the delicious treats that were always at hand!), and I'm not one who generally sits still. The house is immaculately clean. The breakfasts and treats are gourmet. The hosts and staff are fun and friendly.", "title": "Best B&B Ever!", "user": "yelverton", "date": "July 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115770114}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I also want to comment on the negative review recently left by someone whose dog wasn't accepted. I found the two resident dogs at Tucker House to be calm and well behaved, and they mixed well with the several dogs who belonged to other guests. As a confirmed \"cat person,\" I appreciate that all the dogs were clearly well controlled and suitable for the environment.", "title": "Always A Great Time!!!", "user": "nycmfox", "date": "July 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115659627}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Thanks to Howard, Thomas, Curtis & Michelle for a great time. I'll be back.", "title": "Don't go there with your dog!", "helpfulness": 1, "user": "nouks", "date": "July 19, 2011", "detail_rating": {"service": 1.0}, "id": 115527427}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Just returned from our third visit to the Tucker Inn and had a great time, as always. Beautiful and comfortable house, yummy/full breakfast, and great people! What else do you need? Thanks Howard and Thomas!", "title": "Another fantastic visit.....", "user": "Pkpsieden", "date": "July 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115508022}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "We booked a 3-nights stay with our lovely dog, a bernese mountain dog. We check by meil and over the phone to make sure it was ok with the dog, as their website welcomes guests with pets.", "title": "Excellent--AS ALWAYS", "user": "Danh111081", "date": "July 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115504736}], "location": {"country": "United States"}, "variance": {"poor": 0, "average": 0, "very good": 12, "terrible": 4, "excellent": 165}, "slim_ranking": 0.211267605634, "description": "A genuine bed and breakfast with a dash of the exotic located on a quiet side street in the heart of Provincetown. All modern amenities, flat-screens, wi-fi, state-of-the art climate control, in a gently restored 1872 Second Empire Cottage."}