{"user_rating": 4.0, "review_count": 186, "name": "Tulum Hemingway Romantic Cabanas", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Imagine Hemingway's as a garden with cabanas and hammocks on a beautiful stretch of beach, the sort of place one would dream of but not really expect to ever experience. We loved our stay there.", "title": "Cabanas on a beautiful stretch of beach", "helpfulness": 7, "user": "asmile", "date": "May 2, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7539689, "likes": {"liked": "— setting (nature, sea) and hammocks"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "The rooms were well cleaned by very friendly staff every day and the hammocks were such a treat. We spent some time in a cabana (tortuga) just a step back from the beach, which was wonderful. The garden cabana we occupied afterwards (delphin) was nice inside, but quite a bit hotter (no wind) and the bathroom had no door, which might not be appreciated by everybody. You also occasionally heard passing cars, which is not a problem, but well, just to hear the sea and bird sounds is nicer and probably worth the price difference. In both cabanas, we enjoyed our private veranda!", "title": "R and R ( Romance and Relaxation)", "helpfulness": 17, "user": "CarolefromCanada", "date": "March 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7160824, "likes": {"liked": "— Sound of the waves crashing on the beach!", "disliked": "— Kids taking over everything."}}, {"rating": 4.0, "title": "Gorgeous beach; very laid-back, beautifully basic resort", "text": "The beach is wonderful and there are plenty of beach beds and hammocks.", "helpfulness": 15, "user": "Doire69", "date": "March 4, 2007", "id": 6910424}, {"rating": 3.0, "stay_parameters": "Stayed January 2007", "text": "This place is for independent nature lovers. There are a few pieces of information you might not receive spontaneously, so here they are:", "title": "Rustic buy lovely beach", "helpfulness": 16, "user": "aleph1", "date": "January 21, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 6636320}, {"rating": 5.0, "title": "Home away from home", "text": "- Electricity is on from approx. 7 to 11 pm, take a torch!", "helpfulness": 67, "user": "beachreader", "date": "March 24, 2006", "id": 4730397}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "variance": {"poor": 20, "average": 24, "very good": 50, "terrible": 11, "excellent": 81}, "aka": "Tulum Hemingway Romantic Cabanas Hotel", "slim_ranking": 0.51724137931, "description": "Hemingway's private paradise for special customers who want to experience first-hand experience with the wonderful nature of the beach of Tulum. 52 km of tropical beach to walk and contemplate the sea and a nature \"dream\". Hemingway's restaurant on the beach serves fresh seafood with pasta and homemade bread.This is a small ecological resort immersed in a very lush garden with many palms and typical plants of the area and it is also surrounded by an uncontaminated tropical forest, about 6 km from the protected Sian Ka’an area, declared as the Biosphere Reservation. The Resort is the a suitable place for relaxing for those who want to find peace and serenity."}