{"user_rating": 4.5, "review_count": 51, "name": "Tunupa Lodge", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "A reasonable hotel with great views from the front. There is not much at Ollantaytambo apart from the Inca site and the railway to get to Machu Picchu. The rooms were pretty basic but functional and the breakfast was very average There were no other facilities. It was a longish walk uphill to the village for dinner and a short walk downhill to the railway station.", "title": "Lawrence Cooper", "user": "Lawrence C", "date": "April 9, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 157240563}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "This is a great place to stay if you want to make Ollantaytambo your base for a stay in the Valle Sagrado. Its a 2 minute walk to the station, and 4 minutes to the square. Quiet at night, comfortable beds (with duvets) and hot showers. Stunning views from your window.", "title": "Superb value and location", "helpfulness": 1, "user": "expat_Lima", "date": "January 14, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 149647726}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Hard to beat, especially for. S/.100 a room, including breakfast.", "title": "Nice location with great value!", "user": "sleepywy", "date": "November 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 146496827}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "As previously mentioned by other reviewers, this lodge has a great view toward the snow-caped mountain and is 10-mins walk from the train station and 15-mins walk from the famous Ollantaytambo ruin. We chose this because it's convenient for us to start our trip to Machu Picchu by taking a train from Ollanta and would like to go to the ruin for the 1st thing in the morning on the day back to Cusco. We're not disappointed!", "title": "Best place in Ollanta", "helpfulness": 1, "user": "Kelci P", "date": "October 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143167145}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "I have stayed here several times and would never stay anywhere else in Ollantaytambo. The rooms are very clean and well furnished. The beds are fabulous - new, warm and super comfortable. Warm showers, delicious breakfast, trustworthy and friendly staff - what more could you ask for? The lodge is close to the train station and a close walk to the plaza, and the view from the lodge is incredible.", "title": "Great Location, Friendly Staff", "helpfulness": 1, "user": "gceg", "date": "October 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143149090}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "We stayed here after our train trip back from Machu Picchu. They were kind enough to let us store our luggage here while we spent the previous night in Aguas Calientes (Machu Picchu Pueblo). It was convenient to get off the train and walk 5 minutes or so to this lodge. It is a little far from the main part of town, maybe a 15 minute walk or about 3/4 of a mile or so up a gradual hill. Take a tuk tuk or mototaxi into town for 1 soles (about 40 cents) per person if you don't feel like walking. Hotel was clean and water for shower was hot! Breakfast was adequate. There were no phones or tv's in the room but we didn't need them.The staff was helpful overall, especially with our luggage and finding us transportation. The only thing I did not like was that you had to pay extra for bottled water. It seems like one bottle of water should be included in the room rate to take medicine and such. Overall, I would recommend this place.", "title": "Very nice place to stay", "helpfulness": 2, "user": "BryanE", "date": "September 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141370364}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We stayed here as part of a budget package holiday. l cannot really fault the place as it was nice enough with friendly staff. It was close to the train station to Machu pucho but a fair walk back into the loverly town of Ollantaytambo. Breakfast was a bit ordinary.", "title": "Good but out of town a bit.", "helpfulness": 1, "user": "MelbourneRod", "date": "August 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 139029887}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Exceptional place with extra-clean rooms and hot showers. The rooms tend to get cold at night, but the staff provide super-thick woolen blankets which will definitely keep you warm. The views are picture-postcard beautiful, with snow-covered mountain in the distance. Beds are quite comfortable, and the owner and staff are extremely friendly and welcoming. Breakfast is very good: eggs, bread, coffee/tea, butter, marmalade, fresh juice, and fruits (important if you spend all day walking around Machu Picchu). It's also very close to the train station (4min walk).", "title": "Great place to stay in Ollantaytambo", "helpfulness": 2, "user": "Danica Z", "date": "August 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136082549}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Overall: definitely the best place to stay in Ollantaytambo!", "title": "Exceptional", "helpfulness": 3, "user": "Allyson P", "date": "July 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135294533}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Out of all the hotels I've visited with my friends during our stay at Peru, this was by far the most beautiful. Our first impression was very welcoming due to the owners and the extremely clean hotel rooms. Our beds were nothing but comfortable and accommodating to the cold nights allowing us to sleep with no worries. The next morning, the view from the hotel was extraordinary and a sight to see along with a well-served breakfast. The sincerity offered by the hotel staff was very heart felt allowing us to enjoy our stay. All in all, we had a lovely stay and I would love to come back with my family!", "title": "Best Hotel in Ollantaytambo", "helpfulness": 2, "user": "Maria S", "date": "June 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131308830}, {"rating": 4.0, "title": "Serene Location", "text": "Our group of seven spent three nights here, two before and one after going to Machu Pichu. We were made to feel very welcome, breakfast was good, and our rooms on the top floor were very clean and had amazing views. Very convenient to the ruins, town, and the train station, but quiet at night (we slept with our windows wide open). They did an amazing job of washing our filthy hiking clothes (price based on weight). Our bags were securely stored the night we were away in Agua Calientes. A good choice, and this town deserves a few days to be appreciated.", "helpfulness": 2, "user": "BarbaraElizabeth", "date": "August 3, 2013", "id": 170601310}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Tunupa Lodge is a family affair, with everyone lending a hand. The staff is thoughtful and attentive. Plentiful hot water for showers, something that is not always available in Peru. They packed us a breakfast to go for our 6:15 a.m. train to Machu Picchu. The rooms are new, clean, and attractive. Towels folded artistically into the shape of swans greeted us upon our entrance to the room. The grounds are charming, and the views of the volcanos and ruins are stunning. Extremely convenient location for the train to MP is a huge plus. Equally accessible to the Plaza. We were traveling with our sons who are in their 20s, and all of us appreciated this great place to rest in Ollantay.", "title": "Comfortable, clean, welcoming", "helpfulness": 2, "user": "BAE2013", "date": "July 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 170061685}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We enjoyed a comfortable stay here after my son got quite ill just before we were to hike the Inca Trail. He was able to rest in a quiet room on peaceful grounds. The atmosphere is beautiful and the cows leading up to the walk there are charming.", "title": "Quiet, comfortable", "user": "Sue C", "date": "July 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 168765157}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Breakfast was adequate and appreciated. Staff is very helpful and kind.", "title": "Great Buffet", "user": "Marshmallowman", "date": "July 18, 2013", "detail_rating": {"value": 5.0, "service": 3.0}, "id": 168122148}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Our tour stopped off for lunch at the Tunupa Lodge Restaurant.", "title": "Good location...value for money!", "user": "jinbay932", "date": "July 16, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 167743912}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "I stayed here with 10 of my university students on our way back to Cusco from Machu Picchu. The hotel has a very helpful set of owners who are responsive, kind, honest and eager to please. The rooms are big and comfortable with reliable hot water. The hotel is close to the train station, which is convenient for those who are returning exhausted from hikes and/or trips to Machu Picchu. Highly recommended!", "title": "Great place to recover and explore Ollantaytambo!", "user": "bmayes", "date": "July 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167722666}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "My husband and I stayed two nights at the Tunupa Lodge. We really loved our stay here. Very friendly, warm staff. The lodge was clean and quiet. Our beds had big heavy blankets on them and even a space heater in the room, which we really appreciated! :) The view of the mountains from our window was spectacular! We had a lovely breakfast both mornings. The lodge is located a few minutes walk up from the train station. It is about a 10 min walk up to the main plaza and 15 mins to the ruins. Before we arrived to Peru, the lodge arranged a taxi pick up for us from the airport in Cusco. We loved the Tunupa Lodge and would highly recommend a stay here for anyone visiting Ollantaytambo!", "title": "Wonderful Place!", "user": "Dianalovinglife30", "date": "July 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167655334}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled solo", "text": "We stayed at the Tunupa Lodge on our only day in Ollantaytambo. The lodge is in a great location, being only a few minutes walk from the city center with restaurants and the train station to get to Machu Picchu. The rooms were large and the beds were excellent; comfortable with great blankets that kept us nice and warm during the night. There was also a portable heater for our use in the room, which was greatly appreciated. The view outside of our window could not be beat! I would really encourage others to stay here and the management was very helpful with storing our luggage overnight while we ventured up to Aguas Calientes and Machu Picchu. The shower was also consistently warm, a welcomed change!", "title": "Great stay!", "user": "elfbread", "date": "July 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167439126}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "I've stayed here for three years worth of Perú trips .... Love it! Wonderful family owned and operated clean hotel with a spectacular view and convenient location to town and the train station. They have breakfast available and generally have hot showers too!", "title": "Amazing sunsets and great location!", "helpfulness": 1, "user": "Mo B", "date": "July 1, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 165967401}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "What a pleasant surprise when we turned up here.Although the electric had gone off they made back up plans ans wre very helpful.", "title": "A delightful gem", "user": "LancashireIan", "date": "April 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157279607}], "location": {"country": "Peru", "region": "Cusco Region", "continent": "South America"}, "variance": {"poor": 2, "average": 7, "very good": 15, "terrible": 0, "excellent": 27}, "aka": "Tunupa Lodge Ollantaytambo, Peru - Sacred Valley", "slim_ranking": 0.153846153846}