{"user_rating": 4.5, "review_count": 201, "name": "Turtle Beach Lodge", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "The grounds were perfect. The rooms were clean, sparce and could have used 2 fans instead of 1. The pool was fun and the pool table provided much evening entertainment. The staff was very friendly and the food delicious. The boat tour was much nicer than the jungle tour and we learned a ton on both.", "title": "clean, great food, fun pool", "helpfulness": 1, "user": "LaurieChris", "date": "June 22, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 7967481, "likes": {"liked": "— clean", "disliked": "— hot"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2004", "text": "A very nice place. The room was comfortable and clean and the food was excellent - in a traditional sort of way!", "title": "Very nice", "helpfulness": 8, "user": "mark121", "date": "May 10, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5046407}, {"rating": 5.0, "title": "Worth every penny", "text": "Our guide, Roberto, was extremely knowledgeable and friendly and took us on a number of interesting adventures - hiking through a marshy rainforest, hiking to the top of a hill, a dawn boat trip through the canals looking for wildlife, a night-time look at the creatures around the beautiful gardens of the lodge.", "helpfulness": 4, "user": "calie", "date": "March 10, 2006", "id": 4599355}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "We were there in the rainy season - and it rained! But they provide umbrellas and Wellington boots so, providing you don't mind a bit of rain, you're all sorted.", "title": "We Love Turtle Beach Lodge!", "helpfulness": 5, "user": "puravida2", "date": "February 8, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 4446179}, {"rating": 1.0, "title": "Keep an eye on your luggage...", "text": "The beach is also stunning - black sand, bleak and deserted; no horrible tourist paraphernalia.", "helpfulness": 24, "user": "LorenzoP9", "date": "June 16, 2005", "id": 3558738}], "location": {"country": "Costa Rica", "continent": "Central America", "city": "Tortuguero"}, "stars": 3, "variance": {"poor": 3, "average": 16, "very good": 72, "terrible": 3, "excellent": 107}, "aka": "Turtle Beach Hotel", "slim_ranking": 0.0909090909091, "description": "The area of Tortuguero is rightfully called The Amazon of Costa Rica because access is only by boat on Jungle Rivers. Turtle Beach Lodge, 5 miles north of the town of Tortuguero, is a secluded resort spanning 175 acres with miles of jungle trails, a meandering private canal, and a half mile of beach adjoining still more isolated beaches. The lodge accommodates approximately 80 guests; assisted by a well trained staff and guides who ease you into an exciting jungle experience. Stay in the beautifully landscaped cabinas, swim in our turtle shaped pool, relax in the adjacent shady hammock hut with food and drink from the restaurant and bar."}