{"user_rating": 4.5, "review_count": 40, "name": "Turtley Corn Mill", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2010", "text": "A good pub in a great location. The food was perfectly good and well worth going for. If I had any complaints, and they are minor, the service was a little slow. I also don't like the fact that you have to go to the bar to get your drinks. That rule reminds me a bit of Wetherspoons and this pub is better than that", "title": "Nice pub", "user": "Chris4817", "date": "December 15, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 89925061}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We stayed here for four nights, and really enjoyed it. It's well placed for touring, and the nearby road quietens at night. Breakfast was very good, and our room had a settee so somewhere to sit other than the bar in the evening. No noise at all could be heard from the bar. Bed very comfortable. Food was good, but not cheap. The house wine was watery and thin, pay the extra pound and get a far better bottle. House red was the worst one we have ever had.", "title": "Enjoy the B and B, and food, but don't buy the house wine", "user": "UkMandj", "date": "August 15, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "location": 4.0, "value": 4.0, "rooms": 4.0}, "id": 75310463}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We have stayed in this pub/hotel twice - once 2 years ago and this month. On both occasions the staff have been excellent, the room outstanding, with every modern convenience and a big comfortable bed. Space is limited, but that is the only criticism we have. The food is very good with plenty of choice and locally grown vegetables and meat. Breakfast (included) is as good as it gets. The hotel is in lovely gardens with wild life in abundance.", "title": "Lovely setting, great rooms and good food", "user": "artanis", "date": "July 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70914616}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "We have eaten here on many occasions and have to say that the food and service has always been great, and has always encouraged me to return time and time again.", "title": "Really Great Place!", "user": "Simsy42", "date": "April 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60246272}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "As a regular and someone who has been coming to this place for years even before it was The Turtley Corn Mill I can honestly say I have never had a bad experience at this place. The staff are always really friendnly and welcoming. Food is always great and reasonably priced. The setting is superb with a great  big beer garden at the back and there is even a small lake where by the little ones can go and feed the ducks. It is a cosy place and quite uplifting. I would certainly reccomend this place any day.", "title": "Ticks all the boxes - great place all round!", "user": "samps39", "date": "September 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 40094573}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We stayed for one night whilst touring South Devon and it very much lived up to expectations.", "title": "Excellent Inn With Rooms & Great Food Too!", "user": "Seamo", "date": "August 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 39234203}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 2, "average": 2, "very good": 14, "terrible": 0, "excellent": 22}, "aka": "Turtley Corn Mill Hotel South Brent", "slim_ranking": 0.857142857143, "description": "Turtley Corn Mill nestles in acres of gardens with its own river and lake. Already a well known and very busy restaurant, there are now four brand new hotel rooms, all en-suite, with free internet, Sky TV, and all those little things you expect from an AA Four Star Highly Commended facility. Our food also has an AA award. Real ales and an ever changing menu, both as local as we can make them."}