{"user_rating": 4.0, "review_count": 312, "name": "Twickenham Marriott Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Went in for a drink here and it was very good service. Atmosphere was very good as it was matchday for the team we support and it was very good.", "title": "Quick drink", "user": "spongy_nathe", "date": "May 26, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0}, "id": 161908725}, {"rating": 4.0, "title": "Great location if you're coming for the rugby..which I wasn't.", "text": "Should go in for a quick one just before the match kicks off.", "user": "nabz72", "date": "May 24, 2013", "id": 161732192}, {"rating": 2.0, "title": "Not up to standard", "text": "Stayed over for one night as part of company event. The hotel couldn't be more convenient for Twickenham stadium as it forms part of the stadium complex. The hotel is very well presented will smart attentive staff. Check in was quick and efficient and the rooms are a good size. Decent buffet spread for breakfast so overall it was a good stay.", "user": "Jonas B", "date": "May 17, 2013", "id": 161017814}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Didn't make use of many of the hotel facilities however noted a bar on the ground floor and coffee lounge on the first floor.", "title": "Superb stay", "user": "StellanEd", "date": "May 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160896807}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "The hotel does not have its own gym but guests can use the excellent facilities at Virgin Active located next door to the hotel.", "title": "Cannot stay closer to rugby than this!", "user": "FullNotGlum", "date": "May 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 160713459}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Stayed 2 nights. Family of 4 including 2 teen boys. This hotel was great. Beds were comfortable", "title": "Great for visiting London central", "helpfulness": 1, "user": "Jeff511", "date": "May 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 162584084}, {"rating": 5.0, "title": "Fantastic location for watching rugby", "text": "hotel clean with amenities. Health club next door. Nice size room with modern decor. This hotel was about a 10 minute walk to Train station and 20 minutes into the city to Waterloo. Front desk", "user": "Cam H", "date": "May 30, 2013", "id": 162377319}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "staff were very helpful and professional..Only downside was restaurant was not to good for", "title": "rugby central", "user": "whitey1962", "date": "May 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162327982}, {"rating": 1.0, "title": "OVERbooking issue", "text": "breakfast. However I still enjoyed my stay and the boys really liked it as well. I would return to", "helpfulness": 2, "user": "welshgirl12", "date": "May 29, 2013", "id": 162303513}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "this Hotel. If you have time walk beyond the station into Twickenam, some nice restaurants and", "title": "Relaxing weekend", "user": "Jon C", "date": "May 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 162167814}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "stayed here for 2 nights for a quiet weekend break with my boyfriend.. hotel room was a bit of a long walk from the elevator lobby but i didn't mind it so much because of the comfortable large double bed waiting for me, i love the bed and plenty of pillows for a good night sleep :)", "title": "Got engaged in this lovely hotel with free gym access :)", "user": "HadijaKH", "date": "May 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 160214950}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "the shower room was clean and with modern fixtures.. but the floor was flooded after taking a shower. the restaurant didn't have an impressive menu so we opted to take the short walk to twickenham high street for dinner on our first night, but nothing can ruin this experience because my boyfriend proposed with an amazing diamond ring before we head out for dinner!! the following morning, we took advantage of the free gym access at Virgin Active right next to the hotel and it was well equipped, greatly enjoyed the jacuzzi and steam room after a hard training. it was a bit disappointing that the restaurant didn't have a wide choices of food because i wanted to surprise my boyfriend with a romantic dinner for our first anniversary celebration instead we had a take away for dinner on our second night lol!", "title": "Comfortable Hotel rooms are expensive on match weekends", "user": "Lesley M", "date": "April 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 159168366}, {"rating": 2.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "over all, the hotel is very good with friendly staff and to top it all..i got engaged in this Marriott hotel!", "title": "Pre Rugby Lunch", "user": "Karl D", "date": "April 29, 2013", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 4.0, "service": 2.0}, "id": 159113081}, {"rating": 4.0, "stay_parameters": "Stayed April 2013", "text": "We stayed here for 2 nights over the Army and Navy weekend, the room was a large double and was comfortable and quiet, the shower grout was very grubby and put me off using it. We ate in the residents bar on the 2nd floor, the food was good but the waitress spilled sauce over my husbands trousers and suede shoes.They did run with cloths to wipe up the mess but we had to take it further by asking for the duty manager to sort it out properly. The waitress did eventually return and apologise but the initial response from the bar staff was not good enough.The duty manager Gregory sorted it out and got the trousers cleaned he was efficient and polite. The main restaurant staff especially the petite blonde manageress at breakfast was helpful friendly and very professional.I would suggest that the residents bar staff get more training in how to manage spilling food over customers by giving immediate service recovery, so that customers do not have to request a duty manager.", "title": "Excellent location, expensive bar", "user": "griffinfamily1", "date": "April 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 159059674}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "First ever visited to Twickenham at the weekend for the Army vs Navy Babcock trophy and we decided to eat at the hotel while awaiting other party members, Very clean with polite staff.", "title": "Good vaue at £69.00", "user": "Miller_CC2012", "date": "April 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 158490530}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We started out wanting to stay in London proper so that we didn't have to commute into the city each day. The hotel was tiny and dirty so went with my primary hotel chain, Marriott. The stay was amazing. The restaurant is excellent, the service was outstanding and the rooms are clean. Any time we had a question, the staff helped guide us and the commute didn't turn out to be that bad. SO glad we stayed her instead of a tiny hotel in London.", "title": "Touring London? It is worth the commute!", "helpfulness": 1, "user": "businessmap1", "date": "April 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 157962044}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "I was treated to an overnight stay before watching an international rugby match and have to say how very impressed i was with this hotel. The reception was welcoming and went ahead smoothly. The room was spotless, modern and very well equipped. It even had an ice bucket and corkscrew! We had a meal in the restaurant and it was fairly pricey but delicious and very well presented. There are a few different areas to eat/drink in depending on what you want eg light snacks to full meal. There is a pool there and the children were looking forward to using it, but unfortunately, it's only open for children at certain times, it's as well to be aware of this.The location cannot be better if you're going to see a rugby match there! We had breakfast which was mainly buffet and there was an excellent selection of food to please everyone. One of the waiters suggested pancakes for the children and this was a big hit with them. Naturally, on a match day the hotel get's very busy and we were given a pass to get back into the hotel as there can be a queue to use the bar. We were able to leave our luggage at the reception while we watched the match. To conclude, it's not the cheapest place to stay but you come away feeling that you've had a lovely treat.", "title": "Rugby Treat!", "user": "April201204", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157044998}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "Great atmosphere in the hotel on a match day with so many supporters mingling around.", "title": "No better place to stay before a big match", "user": "Little00715", "date": "April 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 157013301}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Rooms a good size with the added benefit of 2 double beds.Drinks were expensive however the 5 course buffet meal for only £23 on Saturday evening was very good value.Although arriving at 1pm we were not able to check in until 5pm but the hotel very kindly gave a free breakfast,normal price £15,to make up for the late availability of the room-good customer service.Parking is normally free but on a match day it is £35.", "title": "Nice !", "user": "SOFIE51", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 157011910}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "Nice hotel clean and comfortable good Marriott standard, can work ourt expensive if there are events on in stadium, Only annoying thing was the smoke detector flashing above our bed all night. Lucky i had an eye mask.", "title": "good mainly but rather expensive on a non match day", "user": "jane b", "date": "April 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 156949525}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 13, "average": 39, "very good": 109, "terrible": 9, "excellent": 142}, "aka": "Twickenham Marriott Hotel United Kingdom", "slim_ranking": 0.4, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.0}}