{"user_rating": 5.0, "review_count": 28, "name": "Twin Doors Bed & Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "This is a lovingly maintained home offering visitors a choice of four immaculately clean rooms. You get the impression that inn keeper Rosemary, along with her husband, Hess, had kept notes over the years of what they liked and didn't like about various bed and breakfasts and created their ideal at Twin Doors. There is so much attention to detail here, from the lovely furnishings and rugs, to the incredible high-quality linens to the unbelievably lavish breakfasts to the wonderful afternoon cakes and cookies. You can even choose from a collection of movies to play in your room, which I'd imagine might come in handy on a snowy evening. If anything, I felt our hosts went overboard with the multi-course breakfast -- everything was delicious but they could easily have gotten away with less. But they genuinely seem to want to provide an exceptional experience. As an aside, if you're looking for a lot of Victorian gingerbread or grand grounds in the middle of nowhere, this is not your place. It's simply a beautifully refurbished farmhouse in a residential neighborhood.", "title": "Perfect B&B experience", "helpfulness": 1, "user": "Kaycj", "date": "June 11, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 3.0}, "id": 16865594, "likes": {"liked": "— Nicely furnished, high-quality linens, incredible breakfast", "disliked": "— There was minor traffic noise in the morning with our windows open"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The only complaint we had was we couldn't stay another day. Rosemary and Hess are wonderfully accomdating without you feeling like you've put them out in some way. We had a wedding in Sunapee and we arrived at the Inn late. Rosemary ran up a much needed iron and board and finished checking us in so when we left the Inn 20 minutes later we were all set. The next morning we were treated to an amazing (amazing!) breakfast. The Inn is small and quiet. Just a lovely experience!", "title": "Wish we could have stayed longer!", "helpfulness": 1, "user": "gardens21", "date": "May 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16495289, "likes": {"liked": "— Felt like home", "disliked": "— The view from the beautiful porch isn't the greatest"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The Twin Doors B&B is a wonderful place to relax and unwind. The rooms are all exceptional. Each is tastefully decorated with a comfortable bed, an ample amount of pillows, TV & DVD, clean bathrooms, clean towels, & comfy bath robes. Each morning a delicious & filling homecooked breakfast is served. The host & hostess definately go out of their way to make sure you are comfortable, relaxed, and happy. If you are visiting the Sunapee are be sure to stay at the Twin Doors.", "title": "Excellent!!!", "helpfulness": 1, "user": "MMNF", "date": "May 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16436162, "likes": {"liked": "— Our hosts & our comfy room", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "A delightful B&B experience - newly renovated farmhouse, tastefully decorated, cozy & comfortable, private baths with jacuzzis, TV in every room, and wireless internet access. The host and hostess go out of their way to make your stay \"the best\" and prepare wonderful breakfasts!", "title": "A Great Place to Stay!", "helpfulness": 1, "user": "Benjamin_8", "date": "January 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12859516, "likes": {"liked": "— The overall experience", "disliked": "— I couldn't stay longer!"}}], "location": {"country": "United States", "city": "Sunapee"}, "variance": {"poor": 0, "average": 0, "very good": 2, "terrible": 0, "excellent": 26}, "slim_ranking": 0.333333333333, "description": "Old house charm with all new amenities. 4 guestrooms, all with private baths, cable tv/dvd, ac and individual heat control. Jacuzzi tubs in 3 guestrooms. FULL hot breakfast plus endless afternoon home-baked goodies/beverages included FREE."}