{"user_rating": 4.5, "review_count": 82, "name": "Two Sandals by the Sea Inn - Bed & Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We love this place and can't wait to go back! Helen and Jun, the owners, are fantastic people. They gave us great suggestions about where to eat and what to do. Our room (the Santa Monica) was very clean and well kept, and the common area and porch have been renovated recently. Helen's breakfasts were super yummy - a perfect start to the day! The house is a very short walk to Red Hook Bay and Secret Harbor Beach. Parking around Red Hook and at Secret Harbor didn't seem too plentiful, so it was nice to be close enough that we didn't have to rent a car.", "title": "Best kept secret on St. Thomas", "helpfulness": 6, "user": "neil34895", "date": "April 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102848978}, {"rating": 5.0, "stay_parameters": "Stayed March 2011", "text": "Helen and Jun have a passion for providing their guests with great hospitality and pointing them to the best local spots and activities that their guests are looking for during their stay. My husband and I just returned from one week at Two Sandals and we are already looking forward to our next visit.", "title": "Terrific B&B in the best part of st.thomas", "helpfulness": 6, "user": "Deeceeryan", "date": "March 6, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 99171092}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "Thank you so much Jun, Helen and Lucy. Austin and I had an amazing trip, made even better by your hospitality and trip recommendations. Two Sandals is easily the best hidden gem on the island. The location was so convenient for our adventures, the room quiet and well appointed, the price within the budget of a single mom and complete with two amazing hosts / new friends that now feel old friends! We are already missing the island.", "title": "Best B&B to stay on the island!!!", "helpfulness": 5, "user": "kelly60750", "date": "February 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97598201}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "My husband and I just got back from our vacation and stayed at Two Sandals for 7 nights. When we arrived at Two Sandals, we were pleasantly surprised by the size of the Inn and view of American Yacht Harbor, St. John and British Virgin Islands. We chose a local rum & coke from the complimentary welcome drink menu. We had a glass of local rum on the balcony. Great breeze, ocean view and local rum were just a perfect combination.", "title": "Great B&B and Best Location!!", "helpfulness": 7, "user": "whitewine101", "date": "February 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97184676}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We were originally planning to rent a car during our stay because we read in somewhere that transportation in St. Thomas is one big challenge. However, when we told our activity plan to owners, they suggested that we do not need a car when we go to St. John, BVI and Secret Harbor. They were ABSOLUTELY RIGHT!! Red Hook and American Yacht Harbor, where all restaurants, bars and ferry station are located, are within 10 min easy walk, and Secret Harbor Beach was within 5-7 min nice walk. Here is what we did during our stay, which we highly recommend!!", "title": "Warm Hospitality", "helpfulness": 1, "user": "piccadillous", "date": "February 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 97121717}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "This was our second stay at Two Sandals this year. The location, on the East End within a short walk to American Yacht Harbor & Red Hook, is excellent. Plenty of beaches and restaurants and close to all the outdoor activities.", "title": "Second stay just as great", "helpfulness": 6, "user": "Deeceeryan", "date": "June 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114580748}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The owners are welcoming, and will help you set up scuba, boat trips, etc. The inn is lovely, simple and well maintained, with a delicious home made light breakfast each morning, and impromptu cocktail hours for the guests. The diverse guests are always interesting - this last trip we met a couple from New Zealand and travelers from Germany and US as well.", "title": "Great Spot", "helpfulness": 5, "user": "oggy60", "date": "June 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113930770}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Two Sandals was the perfect spot for us to stay in St Thomas. An easy walk to the restaurants & shops at Red Hook, the beach at Secret Harbour, & the boatyard. The Hermosa room was great, with a veiw of American Boat Harbour & the islands from the balcony. Awesome breakfast & coffee every morning & nothing was too much trouble for Jun & Helen answering our endless questions & helping us whenever they could. Thanks guys, see you next time.", "title": "Welcoming and super friendly", "helpfulness": 6, "user": "Katrin S", "date": "June 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112114147}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Mark & Sherylle", "title": "Wonderful, loved it!", "helpfulness": 5, "user": "blueschik", "date": "June 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112090766}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We stayed at Two Sandals for one night before catching the ferry to Cruz Bay. Our flight was delayed over two hours and we didn't get to St Thomas until after 10 PM, but Jun picked us up at the airport smiling and totally unruffled and answered all our questions about St Thomas while driving to Red Hook. We spent an extremly comfortable night, feasted on an exquisite home made breakfast in the morning, after which Jun insisted on giving us a ride to the ferry dock, where we felt we were saying goodbye to a good friend, though we had only known our host for twelve hours. We will definitely go back, and we recommend this lovely place to everyone. It's spotless and charming, it's in a perfect location, it serves a five-star breakfast, and, most importantly, the owners are genuinely nice people who really want to make your stay there as pleasant as possible, even if it's only for one night. We were impressed.", "title": "Nice Stay! Great View!", "helpfulness": 2, "user": "jboogie81", "date": "April 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 105258639}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Enjoyed our two night stay at Two Sandals. Jun and Helen were polite and accomodating, breakfast was very nice with homemade scone or bread and yogurt parfait, rooms were clean and uncluttered, overall very serene. We rarely saw other guests and sort of felt like we had the place to ourselves most of the time. Bed was very comfortable, although I had a difficult time sleeping first night due to light and noise from roadside bar down the hill. Second night I turned on A/C specifically to drown out the noise and that helped. We enjoyed a day on the water with Jun, he took us to BVI and was a good tour guide. He was very accomodating and allowed us to use his snorkel gear the following day when we took the ferry to St. John, even though we were already checked out! Of course we returned the gear but he was very nice to have offered that, certainly above and beyond normal hospitality. Not sure I feel the need to return to St. Thomas again, but if I do, would stay here. I would definitely return to St. John if I have the opportunity, better beaches, better snorkeling, less people.", "title": "Low key B&B, nice hosts & lovely breakfast", "helpfulness": 2, "user": "CA_Ski_Mom", "date": "December 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 121687855}, {"rating": 2.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We greatly disliked our stay at this \"B&B\" for many reasons, starting with the", "title": "Never again", "helpfulness": 5, "user": "IDreamofItaly", "date": "December 11, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 121631106}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "ridiculously over-priced $40 ride from the airport, which was in the owner's", "title": "More than just a B&B...", "helpfulness": 3, "user": "experimation", "date": "December 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121463241}, {"rating": 4.0, "stay_parameters": "Stayed November 2011", "text": "pick-up truck with the seats covered in dirty towels and ants (yes, ants!)", "title": "Friendly, great views, terrific breakfasts and close to Red Hook", "helpfulness": 2, "user": "285Magtravel", "date": "November 30, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 121242583}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "crawling on my boyfriend in the back seat. Upon arrival, we were driven down a", "title": "99.9% great!", "helpfulness": 6, "user": "meenooskis", "date": "November 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 121210121}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The pros of this space are: (1) The space was very clean and pleasantly decorated, (2) Helen's homemade breakfasts were truly delicious! (3) We appreciated the efforts to make us comfortable and the rides we received, etc., and (4) the value is good.", "title": "Pros and Cons", "helpfulness": 4, "user": "Foodie505", "date": "November 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 2.0}, "id": 120198295}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "The downsides of this B&B are: (1) the walk to red hook is a bit harrowing as you have to 'frogger' across a street with no sidewalks, (2) overall the atmosphere is a bit rigid at times, which is odd for a beach town resort - at times I felt like an unwanted house guest; I would have appreciated more of a laid-back beach vibe (3) there was a fair amount of noise and light pollution in our room.", "title": "Awesome location, fabulous hosts!", "helpfulness": 6, "user": "Audrey K", "date": "October 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 119461391}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "My fiance and I stayed for a 6 nights this past March in the Santa Monica room, and we had the absolute best experience with the B&B and Jun and Helen. (This review is extremely late and we apologize for that!) We would absolutely recommend the inn to any travelers looking for a comfortable and well-appointed home base for exploring St Thomas and St John. The close proximity to the Red Hook ferry was key in getting out and exploring St John. We also enjoyed the short distance to Secret Harbor Beach and resort, which had fantastic snorkeling right off of the shore! (Sea turtles, beautiful fish and coral galore!).", "title": "Wish we were there!", "helpfulness": 1, "user": "KandyKane056", "date": "August 9, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116486617}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "From the airport pickup, to the complimentary rum and coke upon arrival, to the frig stocked with water and soda, to all of the many awesome recommendations for things to do on St Thomas and St John, the service completely exceeded our expectations. The room was also plenty comfortable (although we really didn't spend much time in it!), and we appreciated the afternoon happy hours and opportunity to mingle with other guests (although we only got to do that once, we were too busy getting out and exploring!)", "title": "exceeded our expectations", "helpfulness": 5, "user": "nrfd54", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115967529}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Every morning we looked forward to enjoying the delicious fresh baked goodies, yogurt parfait, hard boiled eggs, French pressed coffee, and juice (really such a great breakfast!) on the back porch. (And as a side note, I appreciated that there was a bit of privacy between the breakfast tables on the porch). Helen even packed some baked goodies for us one morning when we left early to catch a snorkeling trip. Jun also provided a great recommendation to rent a dinghy boat and explore St John. They even lent us a cooler to take on our dinghy boat expedition! You really couldn't ask for more personal, attentive service.", "title": "Never Again!!!!!", "helpfulness": 6, "user": "reasonwoods", "date": "July 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 1.0, "value": 2.0, "service": 2.0}, "id": 115535555}], "location": {"country": "Caribbean"}, "stars": 2.5, "variance": {"poor": 3, "average": 7, "very good": 18, "terrible": 1, "excellent": 53}, "aka": "Two Sandals By The Sea Hotel St. Thomas", "slim_ranking": 0.260869565217, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Two Sandals - Bed & Breakfast is located in the beautiful East End of St. Thomas, U.S. Virgin Islands. It is the perfect place for a family trip, a romantic getaway, or short-term rental. The property overlooks American Yacht Harbor in Red Hook and boasts spectacular views of the Caribbean Sea, including the neighboring island of St. John."}