{"user_rating": 4.0, "review_count": 207, "name": "Tysons Corner Marriott", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "We used AAA to get a $94 rate including a substantial hotel breakfast for 2. Great room", "title": "Good value. Great breakfast", "user": "gratefulparents", "date": "January 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 122599429}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "Hotel pool was nice with a lifeguard and empty. Week after Christmas DC was quiet and hotels empty. Helpful front desk provides directions home etc parking is $6.00 day but safe and easy", "title": "Newly renovated inside means more fees outside", "helpfulness": 1, "user": "NH-Family-Fun", "date": "December 9, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121556507}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Construction due to metro extension is difficult", "title": "We will return.", "user": "Deedge", "date": "December 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121414335}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "I used to like this hotel for business travel. They have recently renovated the hotel so the rooms and lobby have the fresh look and comfort one would expect from Marriott. Now the inside it is even nicer.", "title": "A Big Thank You To All", "helpfulness": 1, "user": "dianesandlakeny", "date": "November 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121035775}, {"rating": 5.0, "stay_parameters": "Stayed November 2011", "text": "Unfortunately, the parking lot has been renovated too. While many of the hotels in this area and class have free parking, this hotel is now charging $6 for guests to park. That is not a big charge, but the inconvenience of navigating the gate is enough for me to consider going down the road to the Westin.", "title": "Great value right beside tysons corner mall", "user": "Jhash2", "date": "November 14, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 120593356}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "I was working in McLean and was put up in the Marriott at Tyson's Corner.", "title": "Needs Must", "user": "OldVillain", "date": "February 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 125288614}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Where?", "title": "Dirty room", "helpfulness": 1, "user": "Jenta", "date": "February 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 1.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 125095838}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Yes, that was my first reaction.", "title": "some good and some bad but overall a good place to stay", "user": "thegreatdentini", "date": "February 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124933373}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "I arrived straight from my flight from London Heathrow to Dullas International in Washington and was driven to the hotel - I would never have found it myself.", "title": "Good service, convenient, small rooms", "user": "BGosivetti", "date": "February 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 124164599}, {"rating": 4.0, "title": "Good Hotel, challenging to get into and out of", "text": "The check in was very courteous and efficient and then I went to my room.", "user": "sc_traveler09", "date": "January 8, 2012", "id": 122743499}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "I needed a hotel for an overnight stay in DC before leaving for Europe the following day. I wanted something close to Dulles, but not the Dulles Marriott which is the middle of nothing.", "title": "Solid Hotel", "helpfulness": 1, "user": "islington3164", "date": "March 6, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4588778}, {"rating": 5.0, "title": "You will love the Tysons Corner Marriott!", "text": "My inbound flight was delayed and I arrived in Dulles at 11 p.m. By the time I picked up the rental car and arrived at the hotel, it was past midnight and no room service was being offered. Per my friend who lives in DC, it was one of the coldest nights of the year (12F) and after dropping off my bags in the room, had to drive to a nearby 24 hour McDonalds to get food. The hotel is not necessarily an airport hotel, but it's close enough to Dulles to get lots of Dulles traffic and thus, 24 hour room service should be offered, especially as the airport restaurant is a Shulas and I couldn't stop thinking of a nice, juicy steak.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "February 9, 2006", "id": 4449743}, {"rating": 3.0, "stay_parameters": "Stayed July 2005", "text": "Other than that, it was an above average Marriott. Large and clean room, many cable channels, friendly staff, etc. I did have a continental breakfast the following morning and the items were all fresh and delicious. As mentioned previously, it's not an airport hotel, but you can easily reach it in a 10 minute drive from Dulles. As it's within walking distance of a huge mall, it would certainly be a great option for a long layover.", "title": "This was Okay, but where was Concierge?", "helpfulness": 5, "user": "TrustMyAdvice", "date": "September 12, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 2.0}, "id": 3897151}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Great experience at this Marriott! My family of five were upgraded to a suite which was beautifully decorated, quiet, clean and very comfortable. We took advantage of the guarded pool, and had a delicious breakfast in the morning from the buffet at Shula's (yummy waffles). The only issue we had was the traffic mess surrounding the hotel - the entrance to the hotel was difficult to find, however the proximity of this hotel to Tyson's Corner shopping far outweighed that issue. We found the staff to be courteous and helpful with information regarding transportation tips and the local area… We had a wonderful weekend -will stay here again next time we are in the area!", "title": "Will stay here again!", "helpfulness": 3, "user": "mh892", "date": "November 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120564511}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "I was using a free night certificate that expired that day, so this was a \"staycation\", as I live only 15 miles from the hotel. As a Platinum Elite Marriott Rewards member, I was upgraded to the concierge floor, with free buffet breakfast the following morning. Very comfy king bed with lots of pillows. I got eight hours sleep for the first time in a week! Mini refrigerator and valuables safe inside console. Spa robe a nice touch. Cable tv with lots of channels. I didn't use the interconnect connection, but the cable was next to the desk for convenient use (I've been at hotels where it was on the nightstand and had to juggle the laptop on my lap or the bed). Used the fitness club; spacious with four treadmills, several other cardio (cycles, eliptical), full weight sets, several adjustable weight equipment, etc. Clean and not stuffy. Nice pool with lanes marked for lap swimming. Buffet breakfast at Shula's was fantastic, with made-to-order waffles and omelets, along with other selections. I would have eaten a lot more if I didn't have to checkout to attend a 11 am dance class. Parking is $6/night, but I was comped. Front desk very friendly. I've stayed at the nearby Sheraton, and definitely would prefer the Marriott, even though the room is a little smaller than the tower rooms at the Sheraton.", "title": "Free night, but treated like a queen!", "user": "CatyRay", "date": "November 7, 2011", "detail_rating": {"value": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 120288936}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "I spent one night at the Marriott Tyson's Corner and wish I had been there longer once I found out what all was in the area. The room was quiet and the bed super comfortable. As for the ipod dock which was bright as someone else wrote, brightness can be lowered. Nice staff.", "title": "Comfy Beds!", "user": "portr8painter", "date": "November 2, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120087831}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Wonderful Marriott at Tyson's Corner. Very friendly staff from check-in, to random employees in the halls or elevators. I felt like everyone was truly interested in how my stay was. Room was small but appeared to be recently renovated and the bed was quite comfy. Easy access to shopping next door whether by car or walking. My husband and I were in town for a concert at Wolf Trap which was a quick drive of only a few miles. Traffic might be crazy during the week but for a weekend stay was a pretty easy drive. It was also a quick drive to Great Falls Park.", "title": "Great hotel for Wolf Trap concert", "user": "rkecat", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119994865}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We happened to eat at Shula's simply becuase we were caught in an awful storm and didn't want to go out and we were pleasantly surprised. One of the best steaks I'd ever eaten and well worth the splurge.", "title": "A short stay but we enjoyed every minute of it!", "user": "DizTravelMom", "date": "October 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119876085}, {"rating": 4.0, "stay_parameters": "Stayed October 2011", "text": "Just stayed here for work and the stay was quit good overall. Nice location, especially for shopping and easy to get out onto the highways. The room was smaller than some I have stayed in but I would certainly stay there again.", "title": "Great location, smaller rooms", "user": "biztraveler30", "date": "October 13, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 119250539}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "Like most Marriotts, the customer service here is excellent. I like the fact that if they make a mistake, they own it, and make it right.", "title": "Good customer service", "user": "valor155", "date": "October 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 119190177}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "I only had 1 issue and that was my key didn't work in my door lock after I had already had the key working initially. They rescanned keys, replaced them, but nothing. They finally just decided to replace the whole lock. It was inconvenient, but the whole time, they were apologetic and \"on it\" to fix the issue. Things happen. They comped me a free movie and that was fine by me.", "title": "Great Hotel", "helpfulness": 1, "user": "whugirl", "date": "September 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118693947}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Rooms are a little small, but my room was great because it had a view of the pool and was very near the workout room and conference center, which were all plusses to me. I felt like I was always \"near the action\".", "title": "Fantastic!", "helpfulness": 1, "user": "Monica B", "date": "September 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 118668876}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "I enjoyed my stay here for business. I'd stay again. If you are Marriott Gold, that gets you a lot of nice things at Marriotts like this, so that is always a plus.", "title": "Great Stay", "helpfulness": 1, "user": "Kristyru", "date": "September 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118617578}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 19, "average": 39, "very good": 95, "terrible": 3, "excellent": 51}, "aka": "Tysons Corner Marriott Hotel Vienna", "slim_ranking": 0.733333333333, "description": "Welcome to Tysons Corner Marriott, where our newly renovated hotel will delight your senses and inspire creativity. Minutes from I-495, I-95 and Routes 7 and 123, this Vienna, VA hotel is near fashionable shopping and vibrant business communities. Located near Tysons Corner Center and Tysons Galleria, our hotel is within reach of government offices and attractions such as Wolf Trap Center for Performing Arts, Great Falls Park, Washington DC monuments and museums, and Old Town Alexandria. The ideal setting for a wedding reception or business meeting in the DC area, our hotel's glittering event spaces and dedicated event professionals set the stage for flawless meetings and celebrations."}