{"user_rating": 4.5, "review_count": 126, "name": "Ullinish Country Lodge Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Ullinish Country Lodge rather modestly advertises itself as a 'restaurant with rooms' but the truth is that this is a warm and friendly, old fashioned (in the best possible way) hotel where everything is a luxurious experience. From the welcoming afternoon tea on arrival to the large roll top bath in the Johnson Room we were made to feel like very special guests by our friendly hosts Pam and Brian.", "title": "A fantastic experience", "user": "Tarff", "date": "October 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180215726}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The Johnson Room, where my wife and I stayed for 2 nights, had spectacular views of the Cuillan Hills and Loch Harport. The room itself was well sized with a huge half-tester bed. The bathroom included a roll top bath - although it was made clear that the shower head attachment is for hair-washing only. Even with the wind and rain howling outside it was a warm and cosy refuge from a cold Skye weekend.", "title": "Wonderful!", "user": "bakerswoodfox", "date": "October 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179604648}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "As expected dinner was a highlight. The daily menu was presented in our room each day for pre-order at 6pm. Canapes in the lounge, complete with open log fire, gave us a chance to talk over the days hill walks and castle visits with the other lucky Ullinish guests. The 5 course dinner was outstanding on both nights - particular thanks must go to chef Richard Massey(?) for accommodating my (pregnant) wife's rather specific dietary requirements on such a small and carefully crafted menu - with both food and service 5 star quality.", "title": "Lovely place indeed.", "user": "CleveDK", "date": "September 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178320362}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "I cannot recommend Ullinish Country Lodge highly enough. Pam and Brian have achieved just the right atmosphere of old-timey luxury, comfort and relaxation to turn a long weekend into a very special one.", "title": "Live like a Laird....", "user": "larach", "date": "September 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 178303675}, {"rating": 3.0, "stay_parameters": "Stayed July 2013", "text": "My husband and I had the pleasure of staying at Ullinish Country Lodge Hotel while visiting the Isle of Skye. From the moment we walked in we knew we were in for a treat! The reception was friendly & quick then we were invited to get settled in our room & then come down to the lounge area for tea. We were booked in the Johnson room. It had a wonder Cuillin views the en suite bath was very roomy and there was a tray with brandy, waters, and coffee/tea service! When we arrived in the lounge for tea there was a cozy fire going and a great spread for tea time! We went on a great walk after tea then back to get ready for dinner. We were greeted at the restaurant with a welcome drink and canapés then taken to our table. The ambiance of the restaurant was wonderful and was the food & the wind list! The only problem I had was with leaving! We really would have liked to stay another night, but I will be booking a return trip soon!", "title": "Regimented hotel in a beautiful setting", "helpfulness": 1, "user": "angi01", "date": "September 15, 2013", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 177220640}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 5, "variance": {"poor": 7, "average": 11, "very good": 21, "terrible": 5, "excellent": 82}, "aka": "Ullinish Country Hotel", "slim_ranking": 0.166666666667}