{"user_rating": 4.5, "review_count": 1371, "name": "UNA Hotel Roma", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "Stayed for 2 nights, arrived at the Termini (Central Train, Tube & Bus Station) on the Terravision bus from Ciampino. Bus was only 4Euro and was very efficient & cheap. The Hotel Una is 1 minute walk from the Termini which is perfect. Access to most of the Rome's sites can be made using the 2 underground lines. The red line to Spanish Steps, Vatican, Pantheon, Trevi Fountain. The blue line for the Colloseum. You could walk in about 20 mins to these sites, but the tube is very easy & good value at 4 Euro for a day pass. The hotel gave us an early checkin which was great after the early flight. Hotel is very clean, new, stylish & modern. There is a happy hour in the bar between 18.30 - 20.30, with discounted cocktails (8 EURO), and also free o'dourves. This is great for pre dinner drinks, and the food means you don't need a starter when you go to a restaurant. Rooms are spacious for Rome, with large comfy beds, great bathroom, and well furnished.", "title": "Great stylish hotel with perfect location", "helpfulness": 1, "user": "danshols", "date": "September 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 79376221}, {"rating": 4.0, "stay_parameters": "Stayed August 2010", "text": "A couple of areas for improvement; we had a bath & shower, but some of the rooms used by other members of our group only had a wet room with no bath. This caused a real flood in their bathroom, with poor drainage. Room 308. There is no 24 hour room service, and no tea & coffee making facilities in the rooms. We asked at checkin if we could have tea & coffee facilities in our room, and they said no, which is really not alot to ask for. They also seem to have a shortage of irons, and they do not have them in the rooms. The hotel does not have an ouside seating area which is a shame because there is a roof terrace on the top floor, but there was no access or seating for guests.", "title": "Definitely worth staying here", "helpfulness": 1, "user": "judyping2010", "date": "September 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79196064}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "There are some great restaurants close by the the hotel, serving good food at good value. We ate at a restaurant opposite the Opera House round the corner from our hotel, which was good, and a really good pizza restaurant, again 1 minutes walk from hotel. Try & avoid eating near the tourist sites as you really do get ripped off.", "title": "Good location and clean rooms let down by poor service", "user": "Live_t0_h0liday", "date": "September 9, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 78895297}, {"rating": 2.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The hotel is an a good area of Rome, & we felt no issues walking around after dark.", "title": "NICE ROOM, TERRIBLE SERVICE AND OVERPRICED", "helpfulness": 4, "user": "alacazam", "date": "September 7, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 78687603}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "I would certainly recommend this hotel.", "title": "Ignore bad reviews of this hotel", "helpfulness": 1, "user": "Alba1966", "date": "September 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78614978}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The hotel is literally one block away from Roma Termini station in a nice area. Bus and metro are, of course, nearby. The Colosseum area is a 20 min. walk; Trevi Fountain and Pantheon are only about a 30-40 min. walk. We took the busline (since metro is down) to the Borghese Gallery and Vatican. See my reviews.", "title": "Great hotel and location", "helpfulness": 1, "user": "DoctorRansom", "date": "August 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138247904}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The hotel was clean, welcoming, and helpful. Staff provided help for navigating the city, made reservations for us ahead of time at the Borghese (buy the Roma Pass at the hotel, as well), and printed airline boarding passes for us (You must pay for internet, 3EU for 30 min. at their computers or wireless.).", "title": "Amazing hotel and location!", "helpfulness": 1, "user": "Gaynor B", "date": "August 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138182152}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "The room was large with plenty of space. The bathroom even had a sound system so you can listen to what's on the TV. Complimentary bath salts, robes, and other amenities are a nice bonus for couples looking for the romantic.", "title": "Nice hotel, convenient location marred by cheap policy on wifi", "helpfulness": 1, "user": "David B", "date": "August 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 138022767}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "As I offered in my review of Hotel Tournabuoni Beacci in Florence, I will warn you, if you are unfamiliar: \"air-conditioned\" in Italy is not the same as American air-conditioning. In fact, the air conditioning in restaurants and hotels, including this one, may seem more like a slightly cool fan blowing. In the UNA Hotel in Rome, we had some of the best AC of the Italian portion of our trip; over the course of two days, with the thermostat set at 17C, the temp dropped from 27C to 25C. This is common, perhaps, except in American/UK hotel chains that would have market reasons for better AC. We found ourselves, nonetheless, very comfortable at this hotel.", "title": "The perfect place to stay in Rome", "user": "Abracadabra", "date": "August 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137869935}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The breakfast was excellent, offering a variety of hot and baked goods, juices (orange, cranberry, pineapple, and a blend), coffee, tea, and cappuccino.", "title": "A gem", "helpfulness": 1, "user": "255103John_elphick", "date": "August 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137841221}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Italy suffers of the lack of good modern hotels at good prices. You had to find a fortune to be in a clean, well maintained hotel, or assume \"you were in an old city\" and opt for a cramped pension-look place, with mattresses crying to be changed.", "title": "Modern, comfortable, one step from Termini, at an excellent price", "user": "ARUANO", "date": "September 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 80043015}, {"rating": 2.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "Things are improving, and Spanish chains like AC or NH Hotels and, this case, the excellent Italian chain UNA, which is only 10 years old, are changing the lodging landscape.", "title": "Great location, excellent room, BUT TERRIBLE Customer Service", "helpfulness": 2, "user": "Karla24", "date": "September 17, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 79936047}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The UNA Roma is near Termini Station, and area that is changing for the good too and has lost almost completely the ugly look of past years. The location is great if you want to use the metro or the buses (and for Fuimicino Airport Express train). If you, like us, likes to walk, Piazza Spagna is 20 minutes away.", "title": "Nice, modern hotel near Termini", "user": "DePo79", "date": "September 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 79798848}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The hotel is modern and clean. The rooms are big and so are the beds, which are comfortable too. Same thing about the bathroom, big and comfortable. Our room was quiet with only the tram noise disturbing, although it does not run at night)", "title": "Good Hotel in good location but service made me rate it average", "user": "TheTec86", "date": "September 15, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 79700888}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Breakfast buffet is good and with a lot of choice. The only drawback is that wi-fi is not free, but this, sadly, is common in Italian hotels.", "title": "An actual true 4 star hotel in Rome for once", "helpfulness": 1, "user": "Lazzzyboy", "date": "September 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79510152}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "My visit to Rome was as a gift to my elderly parents who have always wanted to go so I wanted to make sure the whole experience was something they would remember. I have used Una hotels on business before and and the Una Hotel Roma met with the same high expectations I have come to expect. The staff were friendly and attentive and willing to advise and suggest places to visit and explain how to tackle the metro and buses. The rooms were clean and comfortable with all the mod cons you'd expect in such a hotel. I had a twin room which was slightly bigger than the double my parents had, but this was still neverthless spacious. The only fault I would have would be the shower in my room was a walk in, with a shower curtain...unfortunately I flooded the bathroom one morning... but it quickly dried out ! Breakfast hours were really convenient which meant you could have a lie-in and not have to rush in the morning. The location was great, I had read some reviews that the area was not the best in Rome, but we found it to be really convenient, walking distance to most sights and when you were feeling tired a hop on the metro to get to your desitination or home. There were a few restaurants in the local area which served great Pizza and traditional pastas. If I was ever to return to Rome I would certainly use the Una chain again.", "title": "Excellent location, friendly and attentive staff....would go back again!", "user": "Pixie_Leeds", "date": "September 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 78609988}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Leeds, UK, 2010", "title": "Good location, excellent rooms & breakfast", "user": "hippychick40", "date": "September 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 78497720}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Hotel is close to Termini, Bus Station & Metro. 15 minutes walk to Colesseum. Great room with air conditioning which is essential in Rome in the summer. Great choice for breakfast. Would stay in hotel again and only wished that we had stayed in UNA Hotel in Milan on the next stop on our visit of Italy.", "title": "Disappointing hotel in many ways", "helpfulness": 3, "user": "MLVReading", "date": "September 4, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 1.0}, "id": 78278568}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We went to the Hotel Una after reading the (suspiciously) high number of positive reviews. Bad mistake! First of all, the hotel is located in a really AWFUL part of Rome, near an area notorious for prostitution and drug dealing. Having accepted that, given its close proximity to the railway station, we found that our room was very small and minimalist. OK, not a big deal as at least it was clean. The beds were typically Italian - in other words ROCK HARD! How anyone could sleep on these slabs of granite amazes me. I did not have a single night of decent sleep thanks to these terrible beds. At least the shower worked well.", "title": "Uber sophisticated hotel with uber aloof staff", "user": "Mattiasdad", "date": "September 3, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 78169329}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "Breakfast was the usual Italian fare: little hot food other than some low quality scrambled eggs, undercooked mini-sausages and bits of streaky fried fat that resembled something like bacon. On the positive side there were many types of pastries for those who like to eat sweet things in the morning (I don't) and also bread, ham and cheese. The coffeee served was of good quality.", "title": "Great Hotel in a great location.", "user": "Jeffers77", "date": "September 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78108066}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "What can I say - excellent hotel- good sized clean room - very good breakfast and staff. Excellent location only a minute from the rail station, bus station and metro. Could find nothing to fault recommend it to anyone", "title": "Great Weekend", "user": "strawberry77", "date": "September 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77790423}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "Chose this hotel for a 2 day break in Rome with my husband and 2 friends. I chose Hotel Una based on other reports on the Hotel and was not disappointed.", "title": "An absolute gem", "user": "intrepidcbp", "date": "August 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77730134}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "The location is great, close to the station and metro and about 15 mins walk to the Collosseum. There is a good choice of restaurants in the vicinity if you are too tired to venture far from the hotel after a day of sight-seeing.", "title": "a very neat tidy hotel close to all amenities with friendly helpful staff. A pleasure to stay there we extended our stay", "user": "sue0439", "date": "August 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77447328}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The staff were very friendly and helpful, giving us a map and advise on how to get around and recommending good eating areas on arrival.", "title": "Great modern hotel", "user": "AussieSharon", "date": "August 28, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 77173359}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The room is excellent and we were fortunate enough to be upgarded to a superior room and our friends to a suite.", "title": "AMAZING HOTEL,A MUST IF YOU GOT TO ROME!!!", "user": "smiffy10810", "date": "August 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76564170}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "When I hear that a hotel is near the train station, I hear warning bells and see red flags in my head. But the UNA Hotel Roma proved me wrong. It is a sleek, modern boutique hotel that surrounds you with a warm, modern and upscale experience. The front desk staff is pofessional and helpful. The bellman wisks you to your room. The rooms are small (it is Rome after all) but full of amenities. A deep bath tub for soaking. A rain showerhead with power. The beds are so comfortable and the use of zebra wood throughout the room and the wooden flooris instead of carpet just added to the luxury. They also serve a very expansive breakfast that includes something for everyone. I would definintely recommend and return.", "title": "Lush and Lavish", "helpfulness": 1, "user": "sbenjamen", "date": "September 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 139460973}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The location is pretty convenient to the tourist with luggages. It is a just 5 minutes walk from the Roma station termini. The room is small but nice.The breakfast is good with plenty of choices of breads and fruits.", "title": "Value for money hotel", "helpfulness": 1, "user": "KoalaShanghai", "date": "September 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 139456101}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "As soon as we walked in to the hotel (after a long and tiring journey!) we were welcomed by the staff; our luggage was taken,so we could check in without worrying about the suitcases! The check in was quick; we were also upgraded!:).", "title": "Great hotel", "user": "JZ36", "date": "September 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 139275116}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Overall: The staff very helpful, professional and attentive.", "title": "Real 4-Star..", "helpfulness": 1, "user": "iridiumjazzclub", "date": "September 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 139220087}, {"rating": 2.0, "title": "There are better options in Rome", "text": "The room was very Rome like :) - We loved it! Recommended", "helpfulness": 5, "user": "Lfassina", "date": "September 2, 2012", "id": 139203148}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "This review covers many things starting with a Trafalgar Tour. Although very expensive, we enjoyed the entire trip and were happy to save 10% by paying a year in advance. My husband, myself and our 3 boys aged 18, 15, and 11 all traveled on the Italian Concerto tour with Trafalgar. We stayed at the Una hotel in Rome for 3 nights. Beautiful, cool (really hot in July in Rome), extremely clean and good location. Food was good, we only had breakfast buffet there, but it was good, nothing fancy. The Trafalgar tour and guide were extremely helpful and we saw soooooo much more than we would have on our own. Went to all the typical sites, the Vatican, all the ruins, Trevi fountain, piazza Navona, Spanish steps, the coloseum and so so much more. It was all very exhausting and it was so nice to go back to the Una to be cool and take a lovely shower in our large bathroom. There is a really good restaurant right behind the hotel on the plaza which was also very good. Had good service and delicious food. Everyone found something they liked on the menu.", "title": "An amazing trip to share with the whole family", "user": "Liznfamily", "date": "August 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 137807766}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "Near the Termini station. Great hotel, nice room, super breakfast. After a long day walking in the city it was nice to take a glass of wine or a beer in the cosy bar including the bartender Frederica. She is so friendly. I come back", "title": "rome", "user": "DUPONRM", "date": "August 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137716051}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The hotel is great in its proximity to Termini and the lobby is pleasant, staff helpful. I liked that you can request various kinds of pillows to be sent to the room. This place is good value in Rome. My gripes are: the breakfast is uninspiring and way too carby. There are few healthy options and there was a cheap feeling to it. I did not think the coffee was very good either. The bathroom in our room gets very damp when you shower and the dampness really lingers. The shower didn't feel absolutely spotless - there was some mould spots in the door seal. There were old water marks on the wall where you hang your towel. There are no English language TV channels. Otherwise the rooms are great for the price.", "title": "Good value", "helpfulness": 1, "user": "William M", "date": "August 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 137349621}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "One of the greatest reliefs of any traveller is finding their hotel and hoping to find it as lovely as it appeared in the booking. Finding yourself at Una Roma hotel is no different, imacculately present lobby, helpful and friendly staff, great location (couple of minutes from the Termini station) and well presented rooms. Only downsides were the alley to the left of the building where there is a nightly refuse collection at 1 am and the tram that passes every hour from morning until night. If are solely using this hotel as a base, a place to crash out in the heat of the day or somewhere to escape to in the wee small hours then this is the perfect place for you. I didn't have the opportunity to sample the complimentary breakfast as during the summer nights rome has so much to offer into the night, that getting out of bed is a real struggle (although it is served until 10:30am). The restaurant seemed nicely laid out but a little on the pricey side for the limited menu.", "title": "lovely hotel, location convenient but a little noisey.", "helpfulness": 2, "user": "travelgem82", "date": "August 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 137064258}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "All in all, lovely modern room, quiet hotel and easy to find location.", "title": "Quality Hotel!!", "helpfulness": 2, "user": "SNE10", "date": "August 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 136977312}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "Great hotel, staff was very helpful and recommended some great restaurants. Although this hotel is not in the center it is conveniently located near Termini train station/metro. We bought a 3 day pass and visited the city by metro, very easy and fast. Would recommend this place to everyone looking for a clean, affordable, well located hotel! Thumbs up!", "title": "Great hotel!", "helpfulness": 1, "user": "Pamela C", "date": "September 2, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 139191587}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "A 2 minutes walk from the Termini Station, this hotel is very well located and so easy to find...", "title": "Excelllllllent !!!", "user": "acsaroj", "date": "September 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139157332}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Stayed here for 3 days and one could almost walk to all the main attractions, we did just that.", "title": "Excellent Hotel", "helpfulness": 1, "user": "UkMhamilton", "date": "August 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 138972080}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Except Vatican City where we had to take a metro...", "title": "Great Hotel", "user": "PaulB34", "date": "August 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 138790887}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Neat, spacious, great value for money (we booked 45 days in advance), staff is very good and courteous... took his time in explaining the main attractions...", "title": "Stylish new hotel in practical location", "helpfulness": 1, "user": "D I", "date": "August 27, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138474498}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 4, "variance": {"poor": 28, "average": 83, "very good": 484, "terrible": 14, "excellent": 762}, "slim_ranking": 0.0629921259843, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "In the historic centre of Rome, close to the train station, the new UNA Hotel Roma is characterized by a strong architectural design throughout its 6 floors. It features 197 rooms, 5 meeting rooms, restaurant and bar. Private garage.The hotel is: a few steps from the Opera Theatre, Santa Maria Maggiore Church 15 min on foot, 5 min ( 2 stops) by metro, from the Coliseum / Fori imperiali 20 min on foot from Trevi Fountain, Quirinale, Altare della Patria 30 min on foot from Piazza di Spagna, Panteon."}