{"user_rating": 3.0, "review_count": 217, "name": "Union Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed December 2013, traveled on business", "text": "I have mixed emotions about the hotel.", "title": "If I could give 3 1/2 stars, I would", "helpfulness": 1, "user": "Snarky", "date": "December 13, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 187530825}, {"rating": 3.0, "stay_parameters": "Stayed December 2013, traveled with friends", "text": "Booked a king, got 2 twin mattresses pushed together. Bed not very comfortable but adequate. Spartan rooms: bed, nightstand, tiny desk, one overhead light. Difficult to read in bed or work in room. No tub, but shower is very clean. I had a ground floor room & had a lot of noise from outside and inside the hotel. The fan doesn't run constantly; if it did it could mask the noise. Flat screen TV on the wall gets a handful of standard def cable networks, but frustratingly no local channels. Breakfast is included at a diner a couple of blocks away. Good restaurants and access to the subway within walking distance. No radio in room; there's an iPod dock that doesn't fit the current series iPod/iPhone. The message light blinked on my phone constantly but no desk clerk knew how to clear it nor did they seem to care. Bottom line: a good hotel; a better hotel than the price would indicate, but if they tried harder it could be a great hotel.", "title": "Nice rooms", "helpfulness": 2, "user": "Toni S", "date": "December 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 187474416}, {"rating": 2.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "If I could give this a 3 1/2 I would. We needed 2 rooms not far from Barclays Center that was not overly expensive. The rooms were small but they were so clean and very well decorated. The front desk woman was very helpful and helped us out with directions. We would definitely stay here again.", "title": "More than $100 with cockroaches", "helpfulness": 2, "user": "fehlow", "date": "November 15, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 2.0}, "id": 184821916}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "This hotel was a disaster. The room was too small for 2 people with luggage. You could not walk around the bed if you had suitcases. The hotel lacked adequate security. Several times on returning to the hotel there was no one at the door providing unfettered access to the rooms. The neighborhood isn't very good (industrial) and there is no hotel parking and the street didn't seem like a safe place to park if you could even find a spot. Did I mention cockroaches on the bed, not the floor, the bed. The hotel staff didn't seem bothered by the cockroaches and when I complained to Choice Hotels they said I would hear from the hotel but it's been a month with no reply. There is one bright spot. The breakfast is served at a nearby coffee shop with good food and a friendly Greek owner and good wait staff.", "title": "Small & Compact but Clean and Good Location", "helpfulness": 1, "user": "Dgadson", "date": "November 13, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 184579625}, {"rating": 3.0, "title": "Not for Cruise Ship Travelers.", "text": "Our hotel room was very small(i knew before booking) but it was cool for what we needed. Everything was clean. The free breakfast at the the restaurant which is about a block away is good as well.", "helpfulness": 1, "user": "Zoom_Gotti", "date": "November 7, 2013", "id": 183969079}], "location": {"country": "United States", "city": "Brooklyn"}, "stars": 2.5, "variance": {"poor": 26, "average": 44, "very good": 51, "terrible": 55, "excellent": 41}, "slim_ranking": 0.617021276596}