{"user_rating": 2.0, "review_count": 100, "name": "University Hotel and Suites", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed May 2005", "text": "This hotel was recommended as a cheaper alternative to the expensive hotels surrounding the Cleveland Clinic during my husband staye there. There have a pretty good rate fora week if you pay reserve in advance. The room WAS dirty and I cleaned myself and kept it clean during the entire stay. The maids come around in the evening and drop off towels but noone ever cleans. I walked every day to and from the clinic. I was told not to do this as it was a bad area but I was fine and I needed the exercise. They had a fridge and I bought food for breakfast and had it my room every day which worked for me. The view that I had of the lake was just incredible. It is a bit of a dump but if you want to save some cash, this is the way to go. I never felt unsafe or really grossed out. The other weird thing that happened was this guy who worked there would show up with a towel and knock on my room every night after the maids brought around towels and he worked there. I thought he was bringing around extra towels but then I realized what he we doing was taking a shower in my room on a regular basis because sometimes I would come back and it was obvious someone had been showering in my room. I know this sound disturbing but at the time I think I was so concerned about my husband that I was trying to save money and it didn't occur to me to be very upset. I doubt I will go back even though my husband has to go back now and I am actually on line now trying to find a decent place that is not an arm and a leg. I will have my daughter & little grand daughter with me and I don't want them subject to this place. I wanted to share my experience with all of you.", "title": "not the Best but ok", "helpfulness": 10, "user": "BrooklynMaMa", "date": "August 3, 2005", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "service": 3.0}, "id": 3732995}, {"rating": 1.0, "stay_parameters": "Stayed February 2005, traveled on business", "text": "stayed overnite in the hotel, had to go to the cleveland clinic. the room was very dirty, sheets and blanket on beds were dirty and smelled very bad, bathroom was dirty, shower was terrible, urine on commode lid. first time i stayed in a hotel in cleveland and i have to go back but will definitely not be staying at this hotel. they have shuttle service to cleveland clinic, when i checked in i request placement on the shuttle service and the clerk said i had recieved placement and told me what time the shuttle would leave. the next morning came to lobby for shuttle and was told by a different clerk the shuttle was full. so i had to spend twenty minutes removing ice from my car so i could drive to the clinic. i emailed the hotel manager about the experience i had at his hotel, didn't even respond, so i guess he doesn't care as long as he gets people's money.", "title": "absolutely disgusting", "helpfulness": 15, "user": "wanda d", "date": "June 17, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 3573460}, {"rating": 1.0, "stay_parameters": "Stayed May 2005", "text": "Let me start by saying the people that run the hotel are extremely nice. There was a free shuttle van to the Cleveland Clinic, where we had a family member having surgery. When we arrived the entry way looked pretty nice. But the room was very dirty, as well as the bath room. We stayed here with other family members and their rooms were the same. The beds were very uncomfortable, with a thin mattress.", "title": "Great people, but the room was not so great", "helpfulness": 17, "user": "ginak", "date": "June 12, 2005", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "rooms": 1.0, "service": 5.0}, "id": 3546272}], "location": {"country": "United States", "city": "Cleveland"}, "stars": 2, "variance": {"poor": 17, "average": 24, "very good": 5, "terrible": 52, "excellent": 2}, "aka": "University Hotel Cleveland", "slim_ranking": 0.875}