{"user_rating": 4.0, "review_count": 1138, "name": "Vacation Village at Parkway", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We own at Vacation Village at Bonventure. We stay there when we go to Ft Lauderdale. This is our second stay at Vacation Village at Parkway in Kissimmee. Our first stay was so enjoyable that we decided to stay at Parkway on this vacation. Each time it has been Great. Check in was very fast with no problems each time we have stayed. The Staff is very friendly and extermely helpful. On this trip we had units in the new section. As in the older units, the new units are very clean and spacious. The only minor problem was that the units we stayed in faced interstate 4, and you could hear the traffic noise. After park hopping all day the noise don't bother you. Some reviewers complained about pressure from the sales staff, however if you don't go there looking for free meals you will not have any problems. No one pressured me at anytime to attend any sale talks. This is an excellent resort to stay in. I will stay again whenever I am in the Orlando Area.", "title": "Excellent Resort, I LOVE IT.", "user": "prfretscpo", "date": "September 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 77901930}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "When we checked into the resort, we were asked whether we wanted to attend one of the seminars where they would “sell” us timeshare. We were told that all we needed to do was have a breakfast, then we would be given a tour of the new timeshare facility and that would be it and they would give us $100 for doing this. We reluctantly agreed to this. On the morning of the breakfast, we arrived at the facility for our breakfast and tour of the facility. We were completely shocked to learn that we had to be driven in the “salesman’s” car to the restaurant where we would have to eat breakfast with him. We had just met this person and now we had to sit and eat breakfast with him. My 7 year old daughter was with us and the man proceeded to tell us that he used to be an alcoholic and a drug addict as well as was on his 5th wife. I was totally outraged. He then proceeded to take us on a tour of the area which we did not want. Finally after the tour and wasting 2 hours of our vacation, we returned to the facility. I then advised the salesman that we could not waste anymore time as we needed to return to our room as a relative was visiting us. The salesman started interrogating me as to who was visiting me and where did they live. Finally, I said that we wanted to leave and were not interested in buying timeshare. The salesman was extremely rude.", "title": "Be warned about the timeshare sale!", "helpfulness": 2, "user": "PixieHollow", "date": "September 1, 2010", "detail_rating": {"cleanliness": 3.0, "sleep": 1.0, "location": 4.0, "value": 3.0, "rooms": 3.0}, "id": 77844903}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The reason I am writing this is to warn people about this so that they don't agree to attend this tour. I see that other people have commented about this and unfortunately I had not read this prior to our vacation. So be warned.", "title": "We come every summer", "user": "Travel_Girl8791", "date": "August 31, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77759981}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "I enjoy coming to Vacation Village at Parkway every year. I am not a timeshare owner, but my sister is. One time share in the family is plenty and we pass it among ourselves. By the way, if you don't want to buy a timeshare do not waste your time going to the presentations. They are so high pressure that they could convince you to buy anything.", "title": "Great place to stay", "user": "NicMonroe", "date": "August 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 77558412}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "Anyway, I enjoy the atmosphere at Vacation Village. It is nice to have a kitchen and your own \"condo\" setting. There is no housekeeping service except for a mid-stay towel exchange, trash pick-up, and possible making of the bed. (Some years they make the bed that day, and other years they don't.) If these things matter a lot to you, Vacation Village at Parkway may not be right for you. When we are there we cook, clean up the kitchen, and take out the trash just like we do at home.", "title": "Poor experience with the resort's management, and outsourced housekeeping services ...", "helpfulness": 2, "user": "avideh2000", "date": "August 28, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 77210663}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We stayed in Bldg. 7 in a two bedroom two bath condo for a week. There were 6 of us in total. 2 adults and 4 children. We had plenty of space! The room was clean and comfy! There isn't a pool at Bldg. 7, but we walked right next door to bldg. 8 & 9 to use the pool. We also were able to use the new big pool in the new bldg. It was really nice. The parking is bad late at night when coming back from the theme parks, but we were able to always find a spot in the parking garage right next to bldg. 7. One nice thing about not having a pool at bldg. 7 was that it was always quiet. Vacation Village was a great place to stay. It was close to all of the Theme Parks and had plenty of restaurants near by. I would definitely stay here again!", "title": "Awesome place to stay!!", "user": "Eagmommy", "date": "August 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 75289312}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We loved our stay here! We stayed in building 19 on the 7th floor odd number room in a C unit. We could see the fireworks nightly at Disney. There was some highway noise as the building is right off of I-4, but that didn't bother us and you couldn't really hear it with the doors & curtain closed. Parking was not a problem any of the nights. The pool was right behind the building, nothing spectacular but there was a walkway to the bigger pools which were better for young kids. We were about 5 min from Disney, not a bad drive at all; literally right outside the Disney parks. There are plenty of restaurants along Hwy 192.", "title": "Loved our stay..... know which rooms to request & enjoy yours too!", "helpfulness": 4, "user": "kmcleod", "date": "August 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75162503}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The room was very clean and spacious for 2 adults and our daughter. The partial kitchen included granite counter tops, full-size fridge & dishwasher, a convection microwave oven, a 2-burner hotplate and most of the kitchen essentials. Beware of sugar ants!! We left a box of KK doughnuts on the counter for breakfast the next morning and woke up to sugar ants feasting on them. There was a washer & dryer in the room which was great. Bedroom has king size bed (very comfortable!) and there was also a nice Jacuzzi tub, small flat screen TV and iron. Living room had pull out sofa, 2 chairs and a large flat screen TV w/ DVD player. There was open space between the living room and kitchen that had a nice 4-seater dining table. Bathroom had 1 sink but was very spacious with a large shower and hair dryer. In-room safe available for addtl $10. We did not hear any guests on either side of us. The only things we heard were those guests above us when they slid their dining room chairs on the tile floor.", "title": "Miraculous", "user": "Can_8_dian_eh", "date": "August 11, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 74796701}, {"rating": 1.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "If you stay longer than 5 days you will get 1 housekeeping visit, but this only includes trash removal and fresh towels. Don't expect anything more. We really enjoyed that there wasn’t people in and out of our room the whole trip. You may request fresh towels on other days if you need them. You can check out large towels at the pool. Wi-fi is $10/day or $50/week. It’s free if you go to the business center. Read the book on the coffee table & it will tell you what you need to know.", "title": "PARK FAR FAR AWAY FROM PARKWAY", "helpfulness": 3, "user": "travelady73", "date": "August 10, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 74642052}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "Allow yourself plenty of time to check-out on the weekends. Between 9-10 am the elevators were constantly full and it may take you 15 min to get a free one and it is difficult to obtain a luggage cart during this time.", "title": "Decent place to stay.", "helpfulness": 1, "user": "DDSquare", "date": "August 8, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 74353164}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "It was very nice and SUPER close to Disney! Also super close to drug store type (Walgreen) and grocery store (Publix)", "title": "Great Hotel, Awesome location!", "helpfulness": 1, "user": "petesky_89", "date": "September 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 80353294}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "The building we were in was very clean, seems like they mop the floors in the hallway on a regular basis. It was myself my wife and our 3 little kids staying using my in-laws timeshare week. Vacation Village is not their regular spot, but they were even quite impresssed with what we got from the pictures we showed them and with what the kids told them.", "title": "Do not hesitate! Wonderful place! Great location! No complaints!!", "helpfulness": 2, "user": "NJspanishMom", "date": "September 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78961828}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "For what it's worth we had building 11 room 601 units A&B.", "title": "Loved it! Amamzing Vacation!", "helpfulness": 1, "user": "momof4101", "date": "September 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78561355}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We had a full kitchen with a washer a dryer right in our suite (closet), along with a dishwasher, we even had a jacuzzi tub in our bedroom. Unit B had a full kictchen no dishwaher but again with a washer and dryer in the unit.", "title": "The apartments were fantastic clean, spacious, facilities were great staff were welcoming couldn't fault it.", "user": "taliaoliver", "date": "September 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78535520}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Yes you have to buy your own supplies (detergent and dish soap) but they give you enough for a couple of days. They were smooth on the initial timeshare pitch. The guy at checkin goes \"Oh I almost forgot we have a free complimentary breakfast for new guests, and I have Tuesady available at 9, is that ok?\" I politely accepted provided my wife and 3 liitle kids (one is a baby) could also get the free breakfast. He backed off I am guessing they don't want babies in there when they are trying to sell you a timeshare.", "title": "Great place to relax", "user": "dwilson17", "date": "September 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78065889}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "Many places claim to be a resort but few actually provide the amenities to back-up their claim. Not the case the Vacation Village at Parkway. Part of the Vacation Village family of timeshare properties, this location is centrally located in the Kissimmee/Celebration area and only 15-20 minutes from parking at Disney World. This massive resort complex boast over 18 building sections, each with 5 or more floors. On each floor are at least 8 units. So when you do the math, this place is big! Though it may be a big complex, it seems leisurely tucked away.", "title": "Central Location... Clean, Comfort... A True Resort!", "helpfulness": 4, "user": "StandingRoom", "date": "October 15, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 83662714}, {"rating": 2.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "My travelling party, which included a small child, stayed at the Vacation Village at Parkway in mid-October 2010. Our unit was located in building 3 and was a “lock-off” unit. On one side of the lock-off, the “A” side, was a one bedroom unit (king size bed) with a full bathroom and full kitchen, not to mention a large living and dinning area. On the “B” side was one bedroom unit (double/small-queen size bed) with a full bathroom and partial kitchen (no full stove/range or dishwasher). The “B” side offers a slight smaller living/dinning area. Both “A” and “B” are connected internally via a set of doors. Both sides offer a large TV with a smaller TV in the bedroom, a furnished patio, a sofa bed, washer and dryer. The larger “A” unit features a Jacuzzi tub. Kitchens are stocked with nearly all the utensils that you will need and the fridges offer an ice maker in the freezer. Units offer great temperature control. The units and common areas were very clean. The décor is fairly modern and is made to style that of the West Indies.", "title": "Won't Say Here Again Due To Safety Concerns", "user": "Momof2lilboys", "date": "October 12, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 83145473}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Our building, along with 5 other buildings, encircled two swimming pools. Most of the even numbered units offer views overlooking the pool area. The pool areas offer a shallow children’s pool with fountain beside the larger pools. The pool area is open until 11pm in most building areas. The resort offers plenty of activities onsite and will give guest an events calendar which indicates the daily events. These events can include: a movie at the pool area, face painting, creating tie-dye shirts (extra cost), snow cones, scuba lessons, etc. The resort’s guest services can offer plenty of assistance with planning your day and it is possible to purchase park tickets from the resort (which can include a small discount for multi-day passes). Between many of the building complexes are nature conservation zones providing walking trails and boardwalks. A stroll along these boardwalks can provide plenty of fascinating sites, especially with feeding the cat fish in the ponds or the birds along the shore. There is also an onsite RCI office for those timeshare exchange members.", "title": "Close to all Orlando venues", "user": "TravelVal88", "date": "October 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 82842656}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "Within walking distance is the Arabian Nights Dinner Theatre and a short drive away, along Irlo Bronson/Route 192, are a number of grocery stores (Walgreens, Publix) and plenty of popular chain restaurants (IHOP, Golden Corral, Wendys, Red Lobster). Yes, the big parks are within a few minutes drive but I would recommend checking out Fun Spot or Old Town Amusement Parks which are approx. 5 minutes from the resort.", "title": "Very confortable", "helpfulness": 1, "user": "Elzimar", "date": "October 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82784754}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "If I have to look for deficiencies then I may mention that the mattress/beds were a little uncomfortable (memory foam mattress?). Though I left my laptop at home, I did not notice any mention of high-speed access in the unit. And, as mention previously, there is a lack of security cameras that are common with many of the large resorts though there appeared to be plenty of security personnel walking around the property late at night. Overall, none of these issues affected the enjoyment of my stay. With all of this said, I would certainly return to Vacation Village at Parkway… and I certainly hope to in the near future.", "title": "Okay not as nice as some vacation rentals", "user": "checkde", "date": "October 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 82643579}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 89, "average": 165, "very good": 416, "terrible": 68, "excellent": 400}, "aka": "Vacation Village At Parkway Hotel", "slim_ranking": 0.22, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}