{"user_rating": 4.5, "review_count": 656, "name": "Vail Cascade Resort & Spa", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "The hotel was very well kept, although a little difficult to navigate at times. The outdoor pool closest to the mountain is a little small but comfortable and very relaxing because the creek runs close by and the view is of the mountain.", "title": "Nice plush beds", "helpfulness": 1, "user": "nicaliw", "date": "September 3, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 8612647, "likes": {"liked": "— The nice plush decor and comfortable bed.", "disliked": "— The staff were rude at times"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "On check in there really wasn't a place to park the car but the staff let us leave the car in a no parking zone as long as we left them our keys.", "title": "Very disappointed in Vail Cascade", "helpfulness": 1, "user": "MrsPorch", "date": "September 2, 2007", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 1.0}, "id": 8608354, "likes": {"liked": "— Bed was comfortable", "disliked": "— Everything"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The rooms were lovely. Nice modern decor with very comfotable beds. Our suite had a balcony overlooking the creek/mountain side.", "title": "Posh Accommodations", "user": "pdxtrip", "date": "August 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8424668, "likes": {"liked": "— poshness", "disliked": "— pricey room service-not great food"}}, {"rating": 4.0, "title": "Nice room!", "text": "We were dissapointed that there was a wedding there the night we stayed so they closed off the outdoor pool and hot tub from 4pm til 8am. I wish they would have told me this when we booked it. When I expressed my disspointment to the staff they had a quite argumentative, couldn't-care-less attitude but did upgrade us from a regular room to a suite.", "user": "BPinRI", "date": "August 8, 2007", "id": 8373323}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Overal the hotel was great, the location was great but the staff were a little rude more than once.", "title": "Great Location, Decent Hotel, A Bit Pricey", "user": "EJ_LA", "date": "August 3, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 8284002, "likes": {"liked": "— the location and the mountain view"}}, {"rating": 2.0, "title": "Not worth it", "text": "We were booked here in the summer for the music festival, and quite frankly have stayed at Motel 6's or Super 8's that were nicer. The staff is pretty to look at, seem to want to be helpful, but they are rather clueless. None of our colleagues found the restaurants or room service to be worth the expense. You are completely stuck here unless you can figure out the public bus system to get around. Sort of like being on an island. The room was stuffy, we had bugs in the bathroom, the alarm clock did not work, there is no A/C, and there are perpetual construction noises. After our experience so far, we would not dare try the spa for fear of disappointment. Unfortunately we were looking forward to our stay, but can't wait to go home.", "helpfulness": 4, "user": "OutWanderin", "date": "July 24, 2007", "id": 8227177}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Reasons not to stay at the Vail Cascade:", "title": "Terrible! Stay elsewhere.", "helpfulness": 4, "user": "coloradotravel87", "date": "July 5, 2007", "detail_rating": {"cleanliness": 2.0, "front_desk": 1.0, "value": 1.0, "rooms": 3.0, "service": 1.0}, "id": 8062455}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "1. There is no air conditioning, which is required. When it is 80 degrees in Vail Valley your room will heat up to 100 degrees.", "title": "Ummm !! Good and Bad combined", "helpfulness": 4, "user": "Luvin-Life+Travel", "date": "May 1, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 7487354, "likes": {"liked": "— Location to Ski Lift", "disliked": "— Charge Extra for Everything, Huge Resort Fee on top of Hotel Fee."}}, {"rating": 2.0, "stay_parameters": "Stayed March 2008", "text": "I have stayed at the Cascade resort previously in a condo. This year I stayed at the hotel which is looks nice but is noisy.", "title": "Skip it if you are a light sleeper", "helpfulness": 1, "user": "ives", "date": "March 29, 2008", "detail_rating": {"value": 2.0}, "id": 14642795}, {"rating": 4.0, "title": "Almost Perfect Vail Resort with Lively Common Areas", "text": "We arrived late in the evening after a long day traveling and after retiring to bed were awakened several times by kids running up the halls talking loudly and singing.", "user": "apathak", "date": "March 25, 2008", "id": 14518954}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "While it may have been unique to our room, I awoke in the morning after hearing the person in the next room zipping his bag. I was amazed at our ability to hear through the wall/door to the adjoining room.", "title": "Luxury hotel that cannot be beat!", "user": "Kathryncee", "date": "March 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14438332, "likes": {"liked": "— Excellent location, luxury at a good price, cleanliness, spa", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "The place is also a bit pricey for the accommodations - I found a better hotel at half the price in Vail Village.", "title": "Luxurious Resort, Convenient Location, Fabulous Spa!", "user": "jkersey", "date": "March 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 13968368, "likes": {"liked": "— Without a doubt, the spa!", "disliked": "— a little pricey"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "If you are going to stay at the Cascade Resort consider a condo.", "title": "More Like A 2 Star, than A 4 Star", "helpfulness": 3, "user": "kmhill08", "date": "February 18, 2008", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 1.0}, "id": 13658806, "likes": {"liked": "— Nothing", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Having visited Vail many times in the winter and in the summer, I thought I would give a fall weekend a try and decided to stay at The Cascade. What a great choice! I called the hotel directly to book the rooms and from check-in to check-out it was perfect - not a single complaint. I booked two rooms for our group, one on the top level and one on the 3rd level. Both were very well appointed, the top floor room had a gas fireplace, the other room had a nice balcony, both with mountain views. While the resort and Vail in general are going through an extensive construction period - we were able to have a perfectly wonderful weekend - no problems, no noise, we didn't get lost in the hallways (honestly it kind of reminded me of a treasure hunt - where is the room?) Just having the opportunity to get away, wake up in a beautiful hotel room to a light dusting of snow and fresh mountain air was simply the best. The restaurant at the Cascade has an extensive wine list, and the food was ok - very meat intensive. If you like German food - you must try Pepi's in Vail. Also The Wildflower is very good.", "title": "One word - Perfect", "user": "makbono", "date": "December 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11697711, "likes": {"liked": "— The large rooms", "disliked": "— Not one thing. Everything was perfect."}}, {"rating": 3.0, "title": "Adequate", "text": "Stayed at the Cascade resort and Spa for 5 nights while attending a meeting. Resort is currently undergoing extensive renovations and this coloured my experience in some areas. Check in was no problem but finding the room was a huge challenge. Following the directions I was given, I found myself at a dead end with a door marked \"Authorized People Only\". As it turned out, that was the only way to access the Terrace Wing and an employee walked us through the construction area to access our rooms. Room nice and big with safe, robes and comfy king sized bed. (The entire property is non-smoking so that was a plus.) Has a spa treatment at the Aria spa. Kate was great and the sitting area was fairly comfortable with tea and water available. Robes provided were very worn out and tired looking and for the prices, I expected better quality. Had lunch at Chaps Grill and Steakhouse everyday. Because there were 50 people at this meeting, they only offered a very unimaginative buffet with much of the same food every day and a soup/sandwich combo. (Would not allow anyone to order a la carte.) Colleague order room service for supper and said while the burger was good, the fries were inedible - tasted as though the oil used to fry was rancid. No response to her complaints. Has an early flight (6 am) so spoke with concierge on the previous morning to arrange for a cab at 4:45 am, the time he recommended to make the flight in “plenty of time”. Checked twice that all was in order. Despite assurances no taxi had, in fact, been ordered and at 4:55am a resort employee rushed us to the airport where we arrived at 5:30 am, just as the gate closed and we were told we had missed the flight. One of the gate agents actually turned off the lights and left but the second one relented and let us through. I followed up with the resort upon my return home and was told that there had been a mix up and they apologised. Hmmmm. Another problem at check out was that the computers were down, making it impossible to confirm that the correct charges had been made. I was faxed a bill that morning but it was wrong. The room had been previously paid for (non-refundable) and yet they charged my credit card, meant for incidentals, the entire amount a second time. Took quite some time and a few phone calls to straighten that out. Overall, an adequate experience. Construction meant no gift shop open, no ATM available, few inside routes available to get from one area to another without going out side. I stayed just as the season was about to get underway so perhaps the staff needs a bit more experience to make a stay there more pleasant.", "helpfulness": 2, "user": "Rite", "date": "November 26, 2007", "id": 11074710}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "My husband and I stayed at the Vail Cascade for our honeymoon last December. It could not have been more perfect! The room was beautiful, the staff was exceptionally attentive, and every detail seemed perfect. We loved the fact that the resort has its own ski lift, so we didn't waste any time getting to the slopes in the morning. And the ski shop/ski concierge is right there in the lower floor of the resort, so we didn't even have to carry our skis at all. The spa was also really nice. All in all, we couldn't have asked for a better experience.", "title": "Pampered Ski Vacation!", "user": "kbs_chicago", "date": "November 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 11056330}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "I had a great stay at this hotel in August. The room is definitely nice - comfortable beds, nice linens, and good decor. The Aria club connected to the hotel is extremely nice. It has basketball & racquetball courts and an outstanding weight room. I was surprised that there was no additional charge. The mountainside pool was great and there were several quaint hot tubs to choose from. There is a pleasant bike path that leads up to Lionshead. It's not a short walk, but pretty easy. I didn't go to the Fireside bar but it looks like a great place to go for an apres ski drink in winter. I did have the breakfast buffet at Chaps restaurant - might have been one of the best omelettes I've ever had. All in all, I'd highly recommend this hotel. I'd say it would be even nicer during ski season as it has lift access (have to ride lift down at end of the day though as you can't really ski-out). The only minor complaint I have is the low toilet and the full size mirror on the inside of the bathroom door. It is a bit unsettling having to stare at your balls when you are taking a dump.", "title": "nice diggs", "helpfulness": 2, "user": "sumgai", "date": "October 30, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10461135}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "the hotel is very nice. the pool areas are very nice and it has some beautiful views. the restaurant had some good food. it is isolated not near anything else but that is what makes it very relaxing. overall if the price was about 200 a night i would have been ok with it", "title": "nice not exceptional and expensive next time go to utah", "helpfulness": 2, "user": "skiutah", "date": "October 15, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 1.0, "location": 4.0, "rooms": 4.0}, "id": 10083881}], "location": {"country": "United States", "city": "Vail"}, "stars": 4, "variance": {"poor": 23, "average": 52, "very good": 192, "terrible": 18, "excellent": 371}, "aka": "Vail Cascade Resort And Spa", "slim_ranking": 0.242424242424, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Vail Cascade Resort and Spa features 280 comfortable hotel rooms and suites as well as condos and private homes. This Vail hotel has an outdoor pool and hot tubs, restaurants, room service, concierge services, spa, gym and a gift shop. Vail Cascade Resort is the perfect ski-in/ ski-out location with an on-site chairlift. Combine this with equipment rental and ski storage, skiing and snowboarding have never been more convenient. Other amenities include a 78,000 square foot spa and fitness center, complete with an indoor running track, tennis courts, yoga, pilates and fitness classes. If you need more space than a hotel room, consider staying at a Vail Cascade condo or private home."}