{"user_rating": 4.5, "review_count": 140, "name": "Valley Hostel", "reviews": [{"rating": 5.0, "title": "Just the best", "text": "No it is not a 5star hotel but it feels like home away from home. It is clean and the room in which we were staying had a beautiful view of the falls. The staff are very friendly and helpful. And it is very close to the station!!! free wi fi. It was the third time I stayed in this hostel. Best value for money.", "user": "237Susan123237", "date": "April 30, 2013", "id": 159218780}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "If we're reviewing Valley Hostel with a B&B or hotel standard, there would be a lot to blame. However, when considering it as a youth hostel, it offers a pretty high value for money in Switzerland.", "title": "Backpacker's Favorite", "user": "VictorTang", "date": "April 21, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 158372458}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "9 years ago I stayed here with a male fellow backpacker so that I had an idea how simple every there is. This Apr I came here with my wife. We booked a double room and no room there has a private washroom. It could be of inconvenience for couples.", "title": "Nothing special", "user": "RobbieLD", "date": "April 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 156216799}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "There are also different rules of using facilities. All are made to minimize the costs of the hostel and they are reasonable considering the very very low rent (relatively to other B&B and hotels in the country).", "title": "Affordable, Comfortable-private room", "helpfulness": 1, "user": "ButtonsKill", "date": "March 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 155201356}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We love them providing a shared kitchen while dining is sort of expensive in the district. A supermarket is opposite to the hostel so you get ingredients easily each day.", "title": "Very affordable & comfortable stay with waterfall/valley view from our room!", "helpfulness": 1, "user": "Valerietoh", "date": "March 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 155067325}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We traveled with 16 of our family--children, spouses, grandchildren. We booked the entire new building at Valley Hostel for the week of June 16-22. It worked out so well with that many people. Everyone had a bed and some privacy and because we were the only ones there, we had full run of the kitchen and facilities. W have been in Switzerland many times since 1967 and this is a great place to stay. Stefan and Suzie were great to make sure our stay was fun and relaxing.", "title": "Great hostel", "user": "shyviolet", "date": "June 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165694125}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "My friends & I stayed here in June '13 and this hostel did not disappoint at all. It's really just 2 mins away from the train station.. Conveniently located within walking distance to restaurants, coop, bank etc but when we arrived around 7pm, everything was closed :( There is a kitchen for preparation of food though.. We had the private rooms with a shared bathroom (we were a little confused about this as we thought it was a private bathroom - please note that this hostel has no private bathrooms. Only shared ones per level) but it was so clean & cosy that we didn't really mind.. What makes this hostel just absolutely perfect is the view. I would recommend this hostel to everyone! Lauterbrunnen is beautifully nestled in a valley and is not busy.. If you're looking for a quiet getaway in Swiss, this is the perfect location for you!", "title": "Cosy place with an amazing view", "user": "Nurril H", "date": "June 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165561364}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "Stayed 7 nights in early June . We were a group of 6 adults and 4 children and had 3 rooms in the Chalet . It is probably the best base to explore the Valley and beyond and gives the best bang for your bucks !", "title": "Best base to explore the Alps", "user": "wanderlust68_14", "date": "June 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 165542267}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "The staff is wonderful ..the lady who was managing the reception (Petra ) herself picked the kids and the Moms up from Zweillutschinen as we were reaching pretty late in the evening !!", "title": "Best place to put up in the alps", "user": "Pranjol", "date": "June 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165534901}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "A 2 minute walk to the station ,the Supermarket , the Cable car to Murren....and fantastic views overlooking the valley....what more does one want?", "title": "Family of 16 for Six Nights", "user": "Qwackertoo", "date": "June 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165331660}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "This is a great deal for low budget travellers who are exploring the Lauterbrunnen valley and associated resorts. The Valley hostel costs c. £20 per night and is just 200 metres from the station. Reception is friendly and efficient, rooms are basic but you get your own key for the shared room and the showers/toilets are all that a traveller needs. Lots of bars and restaurants around and the hostel has breakfast options and a kitchen that can be used.", "title": "Cheap, cheerful, warm and clean", "user": "JohnCambsUK", "date": "March 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154957654}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "Valley Hostel is situated at the most beautiful and magical place, Lauterbrunnen Valleys. It is a short walk (~5-10mins) from the train station and the hostel has a very warm and hospitable environment. I have stayed both in summer and winter to experience the different sides of Lauterbrunnen and Valley Hostel has always been my top choice for accommodations.", "title": "Best location for nature lovers.", "user": "leexinru", "date": "March 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153503005}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "For a hostel, it has everything a backpacker needs. From well equipped self catering kitchens, to clean toilets, ever friendly and approachable staffs, comfortable beds (not rather sure bout the pillows though), to an excellant starting location for activities.", "title": "You hardly know it's a budget hotel!", "user": "globetrotter132", "date": "February 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153268669}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "I am in love with this place and will definitely be back in the near future. (:", "title": "Clean, nice, but average character", "user": "lizzieke", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 153103224}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "Spent 2 nights here with my husband. Love, love, loved this place! It is extremely inexpensive compared to every other place in Switzerland! The only difference with it being a \"hostel\" is that you don't have room service, you have to put on your own sheets and take them off at the end of your stay, no towels provided, and you have shared bathrooms. This place is perfect for people on a budget, they have rooms for couples (or singles) and larger bunked rooms for more.", "title": "Great location, nice clean hostel", "user": "jennyg1965", "date": "February 5, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 151490688}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The hostel is located minutes from the train station in the Lauterbrunnen valley. I stayed for one night but ended up ruing why did I not stay for an extra day here instead of Interlaken. The Lauterbrunnen valley is a perfect location to explore the Jungfrau region instead of Interlaken and the Valley hostel is perfect in that regard. The first thing that struck me was the hospitality of Susie (who probably owns the place, forgot to ask her). She makes you feel as if you have come back home. The hostel has a no shoes policy and you have to use slippers provided by them in the premises. Quite an innovative touch to keep the place clean and stink free. The hostel has a stunning view of the Staubach falls and the higher ridges of the Alps in the background. The trip to Murren, Schilthorn, Gimmelwald, Wengen (treks) are highly recommended, they give you uncountable breathtaking views. The hostel has a nice kitchen and dining room. The rooms are basic but very clean and cosy. We stayed in a 5 bed dormitory and it was ideal to relax. After a hard day's travel, you would want to sit back and relax in a cosy homely atmosphere and this is where the hostel fits in. Definitely worth more than the money I paid.", "title": "Perfect hospitality in a perfect location", "helpfulness": 1, "user": "bonii_vivek", "date": "June 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 165027075}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "This \"hostel\" totally exceeded my expectations. I was initially unhappy at paying so much for a hostel, but was pleasantly surprised when I arrived. This so called hostel was actually better than most 4 star hotels in my opinion. The private room was extremely clean and it opened up to a balcony with chairs and a magnificent view of the Swiss Alps and Staubbach falls. There was a laundry room (expensive though) and a large kitchen, where we cooked everyday since food in Lauterbrunnen was shockingly expensive. There was also a dining room connected to the kitchen where you can eat your home-cooked meal and enjoy a million-dollar-view of the Swiss mountains. The money spent on the private room was totally worth it and I've never stayed at a better hostel!", "title": "Best place to stay in the Swiss Alps", "user": "yewang2", "date": "June 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164221778}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "The hostel was very close the train station. The staff were very friendly and willing to give a lot of travel suggestions. All the rooms were in a beautiful cottage and has a balcony. The view was splendid! The 6-bed room I stayed in was clean but a little bit too small for this many people. One problem was there was no locker in the room. The staff said they had no safety issues in the hostel and it seemed like it. But I felt uncomfortable about that.", "title": "Lovely hostel in a beautiful valley", "user": "freddyfu", "date": "June 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 163063082}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "The hostel was well equipped. Very big kitchen with a big fridge and a lot of tools. The wifi signal was good, even in the room. The washroom at the basement was also very big and clean.", "title": "Great location", "user": "m r", "date": "June 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162593146}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "This hostel was a very good base to explore the Jungfrau region. It was much more convenient than Interlaken. The village was quiet and peaceful.", "title": "Best bang for your buck", "user": "Jessica C", "date": "May 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 160490062}], "location": {"country": "Switzerland", "continent": "Europe"}, "variance": {"poor": 6, "average": 11, "very good": 38, "terrible": 6, "excellent": 79}, "aka": "Valley Hotel", "slim_ranking": 0.6}