{"user_rating": 3.5, "review_count": 56, "name": "Van der Valk Hotel Vught", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "This is a pretty average Van der Valk hotel, functional and well priced. As per other reviewers, most of the rooms are quite far from reception, and can involve a long walk. I took note of this and asked for one near reception. The rooms themselves are large and impersonal. Mine was very cold when I arrived, so I put the radiator on. However, it did not warm the bathroom which remained cold throughout my stay. The heating went off during the night, and came back on in the morning. What most disappointed me was the restaurant. I had dinner with a colleague, and the food seemed to have been prepared from froozen produce, and the side-dishes reheated, and inedible. I had a fish platter which was very poor indeed. However, as always in Van der Valk, breakfast was marvellous!", "title": "Average Van der Valk hotel, with a disappointing restaurant", "user": "BraddyBarcelona", "date": "November 15, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 184753716}, {"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "Good room for one night stay but due to stormy weather we ate in the hotel. As a dinner restaurant, I would describe it as OK at best - it certainly does not excel in food or service and, perhaps because it was extra busy due to the bad weather, it was crowded and noisy. Reception staff handled a serious incident involving police very well and that was greatly to their credit.", "title": "Good as functional base", "user": "philnash", "date": "October 31, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 183020266}, {"rating": 3.0, "title": "Van der Valk hotel close to Den Bosch", "text": "We stayed in this hotel for 2 nights. The room was spacious and clean. Bathroom can be improved, is little out dated (toilet and shower). The breakfast was really not good during our stay as the restaurant was over crowded and the waiting time at the buffet was too long. Also it was too cold during the breakfast due to too much air conditioning. Positive is the fresh juice. Parking is free and sufficient space available. Prices are little bit higher then standard, suppose due too location close to Den Bosch. Overall the hotel is OK, but with potential for improvement.", "user": "Marc A", "date": "July 29, 2013", "id": 169735650}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "Rooms are quite large, bathrooms very good. Food is perfect, just like in other facilities from Van der Valk chain. Location is perfect, between Vught and Den Bosch, both reachable by bicycle within 5 minutes, or by car. Place is perfect for business travellers, couples or families.", "title": "Good 4-star place", "user": "Sasa_N_O_13", "date": "June 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 163334560}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "I stayed in this hotel for one night.", "title": "Good enough", "user": "Schietboog", "date": "June 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 162931988}], "location": {"country": "The Netherlands", "continent": "Europe", "city": "Vught"}, "stars": 4, "variance": {"poor": 5, "average": 16, "very good": 25, "terrible": 3, "excellent": 7}, "slim_ranking": 0.5}