{"user_rating": 4.5, "review_count": 155, "name": "Vanbrugh House Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Good Points- very comfy bed, luxuriously soft bedding, tea and coffee making facilities good quality,a mini fridge with free water, coke and snacks- nice touch!, powerful shower, lovely toiletries, clean, warm, cosy, pleasant staff, central location.", "title": "Lovely little hotel, great central location", "user": "SARobinson", "date": "February 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 151908002}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Bad Points-no on site parking - the nearest public car park is a 5 minute walk BUT costs £30+ for 24 hours!!", "title": "A new hidden gem", "user": "didiManchesterUK", "date": "February 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151421734}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Would consider returning if in Oxford again.", "title": "Great hotel let down by the service and appalling breakfast.", "user": "Mamamia21", "date": "February 4, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 151400608}, {"rating": 4.0, "stay_parameters": "Stayed February 2013", "text": "We had arranged to meet friends and stay overnight in Oxford. I found this new hotel on trip advisor - it was so new that it wasn't yet on most other search engines. We loved our stay, in a beautiful room with a huge fireplace, extremely comfy bed, pillows and crisp white bedding. The bathroom was an unusual arrangement, with two rooms, one with toilet and washbasin and the other housing the fabulous rainshower. The hotel is housed in a listed building and the owners aren't allowed to move walls, so each room is individual and unusual. The heating was wonderful by the way and completely silent. The staff went out of their way to be incredibly helpful and were very friendly. They upgraded us on arrival. They are keen to offer a service over and above their competition and are still being trained. The breakfast room is small, like many hotels in converted homes, and breakfast was good. The position is excellent, right in the centre of Oxford, within walking distance of the colleges, shops and restaurants. We would highly recommend this great place to stay.", "title": "Great hotel in the heart of oxford", "user": "StagJesta", "date": "February 3, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 151304459}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Rooms are reasonable in size, adequately heated and very comfortable. Bathrooms are well appointed, clean and are complete with fluffy robes~ a nice touch.", "title": "Charming Hotel, Friendly & Helpful Staff", "user": "Willy_Boy_F", "date": "January 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 151133646}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We stayed for one night in a cosy double ( room no 3) which is well decorated, the free mini bar is a lovely touch. We checked in early and were able to leave our bags which had been placed in our room on our return. The hotel is in a fantastic location . The breakfast was good and the price of the hotel is very good when you compare it to the Victoria house hotel just around the corner which has not changed in ten years since we were there last with a difference of about £14. As for the comments about reception how much time do you actually spend in one??? I will definitely return and would recommend to others.", "title": "Cool city centre hotel", "user": "holidayqueen38", "date": "January 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149008472}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We spent one night here as a Christmas present to each other. We had read all the reviews and were pleasantly surprised to receive a friendly welcome on arrival, where we were shown to our room. You can't beat the location. It really is right in the heart of everything and a 10 minute walk to the station. I found the room descriptions on their website a little hard to work out the differences so we ended up with a Superior Double (the Trellis Room), which was perfect for one night and very quiet. I would have preferred a larger room for a longer stay. The conversion is fantastic, everything has been done so well. The restaurant is a little pokey, fine for breakfast (which was good) but I wouldn't have enjoyed dinner here so much. Don't let the reception area (or lack of it) put you off. I think it is more of a pain for the staff than the residents.", "title": "A Lovely one night stay in Oxford", "user": "princesscat", "date": "January 5, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 148904068}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "This hotel is positioned beautifully in the centre of Oxford which is ideal, you don't need to go far to find something of interest.", "title": "Positioned beautifully in the centre of Oxford.", "user": "janeymool", "date": "January 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148709979}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The receptionist at check in was friendly and efficient and was able to answer our questions knowledgably. We had a stylish and cosy double room which was quiet. I felt that the room was luxurious but that this was achieved through subtle touches e.g. a very comfy bed, well cushioned carpet, a mini jug of milk in the fridge, quality teabags, a spacious shower (very nice!) and... the inside of the wardrobe lit up when you opened it! There was also a flat screened TV at the foot of the bed.", "title": "Good stay in the heart of the city", "helpfulness": 2, "user": "DELCAMB", "date": "January 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148625087}, {"rating": 2.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "We ate in the hotel restaurant which is great for more intimate dining in the evening. The standard of the food was very good and I can highly recommend the scallops and also the chicken with brie. The breakfast was tasty (we had the english breakfast) and the poached eggs were cooked particularly well. The waiting staff were friendly and wanted to help and could give advice about what side dishes suited particular meals.", "title": "Poor reception staff ruins stay", "helpfulness": 4, "user": "Kat B", "date": "December 31, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 148452810}, {"rating": 1.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "Excellent location, yes. Splendid decor and armchairs in the lounge, yes. But you do need grown up staff with a bit of personality (the over familiar and rather diffident greeting of 'hi' was rather a foreboding of what was to come!). You need staff who are more mature than the rather inept teenagers from whom we tried to order a black americano and a hot chocolate. Took us three attempts to explain our simple request! Then to crown it all, the waitress could not operate the coffee machine and the first man (boy!) who had failed to serve us our entry to the lounge had to show her. How about some basic staff training? Upon requesting the bill, once again the receptionist used the phone to call downstairs despite al the computers in front of him and a hastily hand written note was produced. DON'T BOTHER in other words. Plenty of places in Oxford with far superior customer service and the chocolate wasn't brilliant either!", "title": "Poor service...", "helpfulness": 3, "user": "Alverstone", "date": "December 30, 2012", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 148359225}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The Vanbrugh House Hotel is an interesting place. As a boutique hotel, one gets the sense that whoever envisioned the hotel had a very strong idea of how the place would be experienced visually, aesthetically, but their concept of how guests would experience personal interactions was not as thoroughly worked out.", "title": "Nice place right in the centre of town, some process needed", "helpfulness": 2, "user": "remittancegirl", "date": "December 30, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 148337934}, {"rating": 1.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "There is no 'check in' desk. As a visitor, you walk in to a prettily decorated, crowded sitting room. And unfortunately, that's what it feels like - you've walked into someone else's sitting room and you don't belong there. The staff member who checks you in is over in the corner, at a laptop, which simply gives you the sense that you're gatecrashing a tea party to which you haven't been invited.", "title": "One of the worst meals we have ever eaten in Oxford", "helpfulness": 2, "user": "elsie_6355", "date": "December 23, 2012", "detail_rating": {"value": 1.0, "service": 4.0}, "id": 147952700}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "I understand the concept of de-formalizing the check-in process, but this set up creates a sense that there's simply no process at all. When I arrived at noon, the first response was a puzzled expression and the words: \"Check in isn't until 3\".", "title": "Great location, shame about the service", "helpfulness": 3, "user": "cherylhinton", "date": "December 16, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147550018}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "I explained that I knew this. I just wanted a place to store our bags until the room was ready. But the second staff member said that, in fact, the room was available now. It's not that anyone was rude or unhelpful - everyone was sweet. It's just not a great way to greet an arriving guest. Visitors to a city often don't have a great deal of choice over when they arrive. Especially on a day when half the trains to Oxford had been cancelled. So, a better response might have been: \"Hello! Let's store your bags and you can have a little wander around the town until your rooms are ready at 3.\"", "title": "Not a four star hotel", "helpfulness": 1, "user": "scottyFrance", "date": "December 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 147265535}, {"rating": 2.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "I expect the reviews I use for booking to be honest and fair. In the case of this new Oxford boutique hotel I hope the staff will understand my critique! I make no apologies this time as much better is abundantly available.", "title": "Realistic and Fair review!!!", "helpfulness": 4, "user": "Chris H", "date": "January 21, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 150228742}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "However, at £200 per night, excluding dinner, wine or even breakfast one is entitled to be fairly objective!", "title": "The best things come in small packages", "user": "Mark B", "date": "January 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 149589644}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Simply, the OWNERS and DESIGNERS of this new hotel in the very centre of magnificent Oxford, have made some horrific errors of judgement!", "title": "Gorgeous Room, very romantic!", "helpfulness": 1, "user": "Alexandra Houst... C", "date": "January 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 149565088}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Trying to extract 22 bedrooms/suites out of this lovely old terraced mansion is simply GREEDY, very much to the detriment of those who stay and work here. They have created a cramped and rabbit warren atmosphere which by todays expectations at this price is truly unrealistic and barely workable.", "title": "Small but perfectly formed!", "helpfulness": 1, "user": "yorkgirl", "date": "January 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149244734}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The reception, office, staff meeting room is just ridiculous in size with barely comfotable seating for four guests at a time. The hallways, stairwells are narrow, difficult with any size of luggage and without porterage a real annoyance. The rooms are mostly a \"cut and shut\" abuse of what was once a truly elegant townhouse.", "title": "Nice and centrally located", "user": "Thombly", "date": "January 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 149204074}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 7, "average": 16, "very good": 37, "terrible": 6, "excellent": 89}, "slim_ranking": 0.0697674418605}