{"user_rating": 4.5, "review_count": 827, "name": "Vancouver Marriott Pinnacle Downtown Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "Nice hotel. Very friendly staff. Very comfortable beds. Perfect location downtown and close to everything. I would stay there again.", "title": "Nice Hotel", "user": "Lexiee", "date": "October 22, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5982831}, {"rating": 4.0, "title": "A great place to stay", "text": "Stayed night of September 23, 2006. We arrived early and our room was ready. Staff was friendly and very helpful. The room was quiet and had a great view from the 23rd floor overlooking the harbour.", "helpfulness": 8, "user": "Moosi", "date": "October 11, 2006", "id": 5938021}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "Although we prefer a King Size bed we opted for a room with two double beds as we have stayed in this Hotel before and found that the bathroom is much larger and more modern with this configuration.", "title": "excellent hotel", "helpfulness": 7, "user": "pole2pole", "date": "October 5, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 5913020, "likes": {"liked": "— location", "disliked": "— nothing"}}, {"rating": 4.0, "title": "A great place to stay", "text": "Easy walking distance to downtown and cruise ship terminal.", "helpfulness": 4, "user": "Moosi", "date": "October 4, 2006", "id": 5908223}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Will definitely use this Hotel again", "title": "so-so hotel, not so good value", "helpfulness": 3, "user": "twhitney", "date": "September 11, 2006", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 5788234, "likes": {"liked": "— location", "disliked": "— too expensive, not good value"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "I stayed at this hotel May 13-15 and had an absolutely wonderful experience. Not only is the hotel beautiful, it is centrally located downtown. I was most impressed by how the entire staff treated me as soon as I walked in the door. Everyone from the two concierge to the reception (Ting) were exceptional and always very pleasant and helpful. Also, as a priceline customer I appreciated that this was not mentioned at check-in and my request for a room ending in the numbers \"19\" was easily accomodated. (At other princeline hotels I found that this is not usually true). I recommend requesting a \"19\" room, you will get floor to ceiling windows overlooking the marina and downtown area. We didn't have a car and were able to get around town easily. Outside the back of the hotel (off of Pender Street) bus 19 picks up right outside and drops you off in Stanley Park. The bus driver announces which stop to get off to rent bicycles for the park. Across the street from the bus stop is an inexpensive breakfast diner called Moonpennies, that had delicious scones for about $2.25 CAN. You can also easily walk to Robson Street, which is about a 10 minute or so walk. I personally would have skipped Robson Street as it seemed just like any upscale shopping area in the US, nothing special. We walked to Yaletown on Saturday night and found some cool bars with live jazz music and cocktails at a restaurant called Capone's. Another plus about the hotel is that it is only about a 5-10 minute walk from Canada Place, convenient if you are arriving by cruise ship. We walked it with our luggage no problem.", "title": "What a Treat!!!", "helpfulness": 22, "user": "Belli123", "date": "May 18, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5148313}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "We visited Vancouver over Easter Weekend 2006 - April 13-16th. Our stay at the Marriot Pinnacle was great. We lucked out (without even asking) to get one of the corner rooms on the 21st floor. The view was very nice and the windows were huge. Everything was very clean, bed was comfortable and bathroom was spacious. The front desk staff were also very friendly to us.", "title": "Very enjoyable", "helpfulness": 6, "user": "pdxrobyn", "date": "April 20, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 4989863}, {"rating": 5.0, "stay_parameters": "Stayed April 2006, traveled on business", "text": "Location is alright. We walked around a lot from there, but also ended up using the car a fair bit to get places.", "title": "Great Stay", "helpfulness": 11, "user": "maxwell5555", "date": "April 18, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4986725}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "The best part for us is that we ended up at this hotel by using priceline and bidding $70 USD a night. I think it was an amazing deal at that price.", "title": "Wonderful Hotel", "helpfulness": 16, "user": "tia18", "date": "February 23, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4496903}, {"rating": 5.0, "title": "GREAT Service & Price!", "text": "Parking was $18 USD a night.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "January 29, 2006", "id": 4394492}, {"rating": 5.0, "title": "Marriott Pinnacle - excellent service, great room", "text": "We were at the Marriott Pinnacle Aug.2006. We stayed on the 31st floor, water view. The room was very nice, on the small side, but the view made up for the size. One side of the room was all windows. We could see mountains in the distance and the coming and going of cruise ships and float planes.", "helpfulness": 2, "user": "tutravelers", "date": "August 30, 2006", "id": 5726991}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled on business", "text": "The staff were very friendly and gave excellent service. We walked to the sea wall and rented bikes. I would recommended walking or riding the sea wall in Stanley Park.", "title": "Very Nice!", "helpfulness": 3, "user": "Compleatangler", "date": "August 21, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5652810, "likes": {"liked": "— Central location", "disliked": "— I have no complaints"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "I would also recommend staying at the Pinnacle. It is pricey but so are all the other comparable places in that area.", "title": "Fantastic", "helpfulness": 5, "user": "jrsungrules", "date": "August 10, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5597417, "likes": {"liked": "— THE HEVENLY BEDS!!! And the FANTASTIC SERVICE!", "disliked": "— SMALL LObby and POOL."}}, {"rating": 4.0, "title": "Good, but nothing special.", "text": "The Marriott Pinnacle was our hotel of choice to stay at after an Alaskan cruise on Carnival lines. My wife and I are Marriott Rewards members and often stay at Marriotts for free. I must say that our stay in Vancouver was more fun than the cruise. Due to a massive cold front packing 50knt winds our ship, the SPIRIT was forced to forgo Prince Wm. Sound and Glacier Bay and the continued miserable weather canceled out our helicopter excursion in Juno. As a matter of fact it rained almost the entire cruise. Don't get me wrong though, Alaska is breathtakingly beautiful. We are going to have to go back! But we needed to make up for lost sightseeing in Vancouver. The Pinnacle is a lovely hotel in a great location. Just a short walk to Canada Place, the sea plane terminal, shopping on Robson St., dining, etc etc. Just a wonderful location. We paid for a 5 day stay using Marriott points and when checking in we were treated just great. The desk attendant booked us into a 29th floor corner room with a spectacular view of the harbor. The concierge staff went out of their way to help us book our tours to Victoria, Butchart Gardens, the Capilano suspension bridge and Grouse Mountain. On our last night which was our wedding anniversary we had a delicious dinner at Morton's steak house that rounded out a great time in Vancouver. Great city and a fine hotel. You will like it!", "helpfulness": 3, "user": "Jolenie", "date": "August 2, 2006", "id": 5543362}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "My trip was from August 3-7, 2006 at Vancouver Marriott Pinnacle. Even though the Lobby should be a little bigger, everything was EXCELLENT. The staff was very friendly and I love our cleaning lady. They left little chocolates when I came back in the evenings with next day weather info. I used marriott rewards for four nights and they gave us free breakfast buffet, which was very good. I HIGHLY recommend everyone to stay at the marriott. Better than the Vancouver Hyatt.", "title": "Excellent attention to all details by a charming staff!", "helpfulness": 10, "user": "fendifendi", "date": "July 23, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5499596, "likes": {"liked": "— Well desinged and maintained - excellent staff", "disliked": "— Parking fee of $24 a night - No complimentary breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006", "text": "We arrived at 10 p.m. on a Saturday and left at 4 a.m. on the following Thursday and from start to finish the experience at this rather new Marriott was flawless. Everyone we encountered was both nice and competent and everything was pleasant, comfortable, clean and worked. The view of Burrard Inlet from the 29th floor was magnificent, particularly the comings and goings of cruise ships, float planes and ferries. The hotel restaurant was airy and attractive and the food and service were of a high standard. Nearby, the Tourist Info center proved to be a gold mine and the walk along the Coal Harbor seawall and around Stanley Park was truly \"awesome.\" (Robson Street, on the other hand, is highly overrated.) This is a fine hotel in a great location.", "title": "A fine experience", "helpfulness": 4, "user": "Colleague", "date": "July 15, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 5468490}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "We stayed at this Hotel for four nights early June. On arrival found reception staff very friendly. Could have had one of the famous rooms ending in 19 but would have had to wait for two hours so settled for the one we were given. This was on 19th floor facing towards the city. The room was very comfortable and reasonable in size. There is building work going on down the road and across from the Hotel front but we hardly noticed it.", "title": "Good Hotel and Location", "helpfulness": 12, "user": "Dudley UK", "date": "July 3, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 5421069}, {"rating": 5.0, "title": "Outstanding hotel in a surprisingly great location...", "text": "I also liked the idea that you could only operate the elevator by means of your room card key. Found all the staff we came into contact with friendly and polite. Used the Showcase restaurant a couple of times. The food was good but thought the menu was a bit limited.We had a really good meal at the Keg Restaurant which is nearby.", "helpfulness": 10, "user": "roanoke4", "date": "June 29, 2006", "id": 5407864}, {"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled on business", "text": "We found the location very good for our needs. Not to far from Robson Street and Stanley Park. Also only a five minute walk from the Float Plane Terminal which we used for a whale watch tour from Victoria. We also used public transport to get to Grouse Mountain and Capialano Suspension Bridge. Caught the sea bus from by Canada Place to Lonsdale Quay then No 236 bus up to Grouse Mountain.", "title": "Great time!", "helpfulness": 5, "user": "SCAnnie70", "date": "June 27, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 5396790}, {"rating": 2.0, "title": "Major construction going on across the street", "text": "All in all would gladly recommend this hotel.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "May 19, 2006", "id": 5181692}], "location": {"country": "Canada", "city": "Vancouver"}, "stars": 4, "variance": {"poor": 23, "average": 89, "very good": 323, "terrible": 6, "excellent": 386}, "aka": "Marriott Vancouver", "slim_ranking": 0.298969072165, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "The Vancouver Marriott Pinnacle Downtown Hotel is steps away from Coal harbour and cruise ship terminal and offers a weddings and meetings hotel in downtown Vancouver featuring facilities that include fitness centre, indoor lap pool and whirlpool."}