{"user_rating": 4.0, "review_count": 201, "name": "Venice Resort", "reviews": [{"rating": 4.0, "title": "Good value for money", "text": "We only stayed here for 1 night so I cannot really comment on the staff service but the room although a little small was very clean and modern and had double doors that opened out onto the grass outside. The surrounding area was rural and quiet. Very conveniently located 10 mins drive from San Marco airport and provided you have a car a pretty good rural base to explore Venice from. We felt this hotel was very good value for money.", "user": "happymeghappy", "date": "November 6, 2006", "id": 6063034}, {"rating": 3.0, "title": "Place was fine....", "text": "We were looking for a hotel to stay prior to our cruise departure. Our travel agent found this hotel that was near the airport that was much cheaper than what the cruise line want to charge us ($140 for 1 night instead of $350). The hotel was fine, but look out...we had to pay 15 euro (about $18.75) for a one-way taxi ride from the airport to the resort which was less than 1 mile. There is a bus stop about 1/4 of a mile that you can walk to for the city bus that takes you to the island of Venice. Cost was 1.5 euro (about $1.85) one way in and 2 euro (about $2.50) back.", "user": "TexasVacTraveler", "date": "October 16, 2006", "id": 5961618}, {"rating": 2.0, "title": "Not a resort", "text": "The next day, we ask the front desk to call a taxi for us to take us to the airport. He did and must have called his friend that drove a black mercedes and charged us 20 euro (about $25) for the ride. Talk about a ripe-off. He claims that he did not speak any English.", "user": "jtbeknott", "date": "October 5, 2006", "id": 5920141}, {"rating": 5.0, "title": "Gorgeous newly opened hotel", "text": "If you are just looking to spend a night, there is a Courtyard by Marriott that is right across the street from the bus stop and they have free shuttle service to the airport.", "user": "rachelmgibson", "date": "August 14, 2006", "id": 5608316}], "location": {}, "stars": 4, "variance": {"poor": 13, "average": 31, "very good": 86, "terrible": 14, "excellent": 57}, "aka": "Venice Hotel Tessera", "slim_ranking": 1.0, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 4.0, "location": 4.0}}