{"user_rating": 4.5, "review_count": 521, "name": "Ventana Inn & Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "Ansolutely love the big sur coastline and so the location of this hotel is great, with some spectacular views. More than that the hotel is wonderful and very peaceful. We wished we could have stayed much much longer!", "title": "Beautiful setting, great modern rooms", "helpfulness": 4, "user": "elliehickman", "date": "June 15, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 132006239}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "After passing through Big Sur a few years ago, I knew that it was a magical place and simply had to return. I am so glad that I chose to stay at Ventana and wish I could give more stars. Elegant, yet not flashy, rustic in all of the right ways. We arrived on a Sunday afternoon and were treated to a glass of wine and a very friendly staff. I originally booked the Big Sur Spa suite but were upgraded to their Pacific room and were told that we would enjoy it better (we are a couple in our late 20's). And enjoy it we did. Being from New York were everything is cramped, we enjoyed the openess of the space and especially the outdoor terrace with private jacuzzi. The room (it is almost unacceptable to call it a room because of the size) featured all of the ameneties one could imagine and the layout was tastefully put together. I enjoyed how the bathroom/tub/shower area could be opened or closed off by sliding walls. The bed/bedding was top notch, even the sunken couch simply begged for a nap in the sun-filled room.", "title": "Absolutely amazing", "helpfulness": 3, "user": "Goran G", "date": "June 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131748548}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We were also thoroughly pleased with the amount of service and attention to detail provided. On the second day of our stay, we decided to eat at the restaurant on site but an unexpected accident occured on the property so the restaurant was eventually closed that evening. To my surprise, the hotel asked if there were another restaurant in the area we would like to try and that the cost of the meal would be paid for by the hotel. We chose Sierra Mar @ the Post Ranch Inn after enjoying a wonderful lunch the prior day, but it was the way in which this issue was handled which truly impressed.", "title": "Ventana Inn: Stay as long as you can!", "helpfulness": 1, "user": "Agritopia", "date": "June 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131707777}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "I cannot thank the friendly staff enough for such an enjoyable experience. Counting down the days until our return...", "title": "Chill Out Zone", "user": "Mirjo", "date": "June 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 131541283}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Ventana Inn is definitely a splurge. It is pricey and yet it delivers. The two major resorts in the area are Ventana and Post Ranch Inn. We looked at both and they have very different styles and settings. Post Ranch Inn is even pricier and we felt that its rusted steel and glass \"edgy\" sort of look was not as inviting for us. We preferred the more forested and natural wood construction of Ventana.", "title": "Excellent", "user": "jeffjames9999", "date": "June 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 131233588}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We stayed here for two nights to celebrate our 20th anniversary. Everything was just executed to a very high standard. We were greeted before we could even get out of our car to walk to reception and taken via the golf cart shuttle up to check-in with our luggage. Mario waited for us to check in and then promptly whisked us away to our room. We stayed in room 24, a lower price (~$500/night) room that was impeccably clean and neat and to our surprise a bottle of Sharffenburger champagne awaited us as a treat for our anniversary. A nice touch!", "title": "Expensive and lovely!", "user": "49Happytraveler", "date": "June 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 131169729}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Wine and cheese is served from 4-5pm and is plentiful. 4-5 types of cheese with crackers, hummus, tapenade and fruit, and of course, wine. Indulge in the chair massage that is offered at the same time which makes this quite an enjoyable hour.", "title": "Big Sur Luxury", "user": "Slade187", "date": "May 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130959390}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "We checked out the pool and the Japanese baths after dinner. Both were empty and secluded and heated, so no problem with/without clothing. Beautiful star gazing after dark!", "title": "very good. but for couples only!", "user": "NatashaKu", "date": "May 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130727322}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Continental breakfast is included with your room rate and is scrumptious. No need to go anywhere to pay for breakfast, and they will even bring it to your room for a small fee. The croissants were quite simply the best I've ever had. The sticky buns were also yummy. There was oatmeal, yogurt, assorted fruit and fruit juices, coffee, cappucinos, and tea. It was delicious.", "title": "Relaxing, friendly atmosphere", "user": "GoDeb", "date": "May 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130655430}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Use the hotel shuttle for transportation to dinner if going locally. You can then drink with no worries (hwy 1 is quite curvy) and someone comes promptly to take you back to the hotel. It was just one more touch to make this stay more pleasant and peaceful.", "title": "Wow", "user": "E E", "date": "May 26, 2012", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 130627473}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We drove from LA to San Francisco making four stops and this was the best.Very nice room and the people working were great.The food for dinner was outstanding .Try the 3 course dinner .you'll be happy.There is a trail to the restaurant thru the woods,it was fun walking back with the flashlight from the room.They do have lights on the trail.We went to the clothing optional pool because it was very close to our room.A word of advice during the day some people were naked..", "title": "Best Stop of our trip..", "user": "harleybonz", "date": "July 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133465901}, {"rating": 5.0, "title": "Another Wonderful Stay in Paradise", "text": "My husband and I have stayed at the ventana at least 6 times over the last 17 years. This time we had the pleasure of staying for FOUR nights in summer! ( we typically stay 2 nights in fall or winter). We really enjoyed our visit. We splurged on a Ocean view suite with a hot tub... So much room and amazing.. Four nights in our own heaven . We keep returning to Ventana for it's laid back attitude, wonderful accommodations, great service, hot tubs, saunas, the fabulous granola breakfast, the wine/ cheese hour ( and no children policy... Love my kids but this is OUR place) and of course all in our favorite location in the world .... Big sur. I also enjoyed TWO massages in the spa... Really need I say more..? Worth every penny....", "helpfulness": 1, "user": "Jobetraveler", "date": "June 30, 2012", "id": 133137464}, {"rating": 5.0, "title": "Worth the money", "text": "We decided to splurge heading down the Pacific Coast Highway. Ventana was one of two expensive resorts around Big Sur. We stayed for two nights. The service was incredible and, more importantly, low key. Being relatively small Ventana does a great job of making you feel special. The rooms are very nice and include awesome views. My wife and I spent a sunset watching deer meander across the meadow in front of our room. Some day will return for a longer visit.", "helpfulness": 1, "user": "Masontravel", "date": "June 26, 2012", "id": 132856165}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We were able to stay here because the \"Perfect Escapes\" website had a rate around $365, including a $50 resort credit. After their resort fee of $30 and other taxes, our room still came to over $500, but that did include the $50 credit that we used toward dinner at their restaurant. It was worth it. Our rate included an upgrade, if available and we got a king fireplace room, facing the ocean. We could see a little of the ocean in the distance (Room 121). Also, our room was very near the reception for wine and cheese, and breakfast. I loved the wood-burning fireplace in our room, with 3 bags of wood that you easily place in and light. The separate deep tub was wonderful. I loved the grounds there. At night, the firepit area was nice - in the morning also. If you are looking for a wooded view, I would recommend rooms like 12, 14, 18, 19, etc. These rooms are right at the edge of the big trees. (See the site map on their website to see what I mean). I think most people take the complimentary golf cart transportation to their restaurant. Dinner was very good with a nice view of the ocean in the distance. We thought we should dress up for dining at such an expensive resort, but everyone was really casual - the woman at the next table was barefoot and sat cross-legged on her chair! I hope to stay here again someday.", "title": "Wonderful Experience!", "user": "lovetotravelSanDiego", "date": "June 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 132856102}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We recently celebrated two wedding anniversaries (39 and 3) at the Ventana Inn with our son and daughter-in-law. To our utter delight and surprise there were two bottles of champagne in our rooms, wishing us happy anniversaries, with a card from Steve Johnson, the hotel manager. Our rooms were beautifully appointed with a wood burning fireplace, granite and slate bathrooms, a hot tub and hammocks, topped off with a splendid view of the ocean. The grounds were covered with soothing wafts of lavender and provided the perfect setting for our stay. Babamae", "title": "Icing on the Cake-Superb Service in Magnificent Setting", "user": "Babamae1945", "date": "June 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132830368}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "A great place to stay, Big Sur's best . Located on a ridge overlooking the pacific with winding paths through the redwoods and lush foliage. Our deck had a hot tub and views up a canyon,very secluded. Food was wonderful, very clean Inn with great service and staff. We have stayed at many places but will make Ventana a regular spot to get away, and I hope they do not change it.", "title": "Ventana Inn and Spa Big Sur Ca.", "user": "Brent K", "date": "May 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130626470}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Recomend it highly", "title": "Hospitality Defined", "user": "Philippe B", "date": "May 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130502412}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The most unpretentious, welcoming, pure example of hospitality I've experienced in quite sometime. From the Front Desk Staff to the Room Attendants to the complimentary Shuttle Drivers to the entire restaurant staff, hands down, first class. We were greeted with what felt like open arms...similar to being welcomed to a family. Any and every request was answered as if we were the only people there...although we were not. The service levels here are second to very few properties around, period. It felt very clear that each and every employee we encountered had a very genuine aura about them that was focused on pleasing their guests(apparently, most employees live on the property, making it their home as well). Cannot say enough thankful things about this very special place. Had a chance to interact with not only the Interim General Manager, but also the Chef and the Restaurant Manager....really wonderful people....", "title": "Perfection! If you like Auberge de Soleil in Napa, you'll like Ventana Inn!", "user": "SuzyQinHou", "date": "May 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130494822}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "I am stunned to read some of the less than stellar reviews of the Ventana. My husband and I just stayed there and it could not have been better! We have stayed at the Post Ranch Inn and while it is fabulous, we loved Ventana Inn even more. The landscaping and outdoor areas are heaven. Walks from the room to the restaurant or reception area are full of fragrance from the natural plants and flowers - and the walks are much easier than at Post Ranch! At Ventana you feel secluded and pampered but it's an easy walk or golf cart ride if you prefer to anywhere on the property.", "title": "Very, Very Nice.", "helpfulness": 2, "user": "Voorhesian", "date": "May 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 130351217}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Our room, a 'Pacific House' was open and bright with sunlight. We enjoyed evenings on our patio with a glass of wine by our private hot tub on the patio or by the fireplace in our bedroom What's not to like?", "title": "Mixed Feelings!", "helpfulness": 3, "user": "tbtravel68", "date": "May 17, 2012", "detail_rating": {"rooms": 5.0, "service": 3.0}, "id": 130133017}], "location": {"country": "United States", "city": "Big Sur"}, "stars": 4.5, "variance": {"poor": 23, "average": 34, "very good": 95, "terrible": 14, "excellent": 355}, "aka": "Ventana Inn And Spa", "slim_ranking": 0.25, "description": "Ventana Inn & Spa is a luxurious resort nestled in the mountains above California’s central coast. Situated on 243 acres of wooded hillside, 1,200 feet above the Pacific Ocean on the Big Sur coast, Ventana Inn & Spa is quiet, secluded and beautiful. The Inn provides a peaceful and soothing atmosphere enhanced by its proximity to the area’s natural wonders."}