{"user_rating": 4.5, "review_count": 138, "name": "Verana", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "My husband and I stayed at Verana in the Studio House for 5 nights in February 2010. Here are our overall impressions:", "title": "Rustic Luxury Away From It All!", "helpfulness": 6, "user": "StupFD", "date": "March 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58415076}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "LOCATION: We were met promptly at Boca de Tomatlan by the Verana boat and after a 30 min. ride, we were there. It is very remote high up on the hillside with amazing views of jungle, rolling hills, the Bay of Banderas, and the town of Yelapa. If you want to ‘get away from it all’...this is the spot! The small, traditional town of Yelapa is a 15 min. walk from Verana. There are about 250 steep stairs from the boat dock to the host desk so make sure you’re up for it! (Chris will kindly offer you a cold cloth and fresh juice upon arrival). Mules carry your bags so be kind and pack light!", "title": "JungleFabulous", "helpfulness": 3, "user": "Rio73", "date": "December 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 52029214}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "SERVICE: The service that we received from all of the staff at Verana was exceptional! From the moment that you are met at Boca to the moment that you depart, your every need is met without question; (if not exceeded)! Chris is an excellent host and ensures that all activities, spa treatments, and food restrictions are communicated between the guest and the staff. It is the attention to detail that really impressed us; from the cute clay pots filled with shampoo/conditioner/body scrub and lotion; (the best toiletries I’ve every used at any hotel), to the fresh flowers in the room and the candles lit every night throughout the grounds and in each room. We really appreciated the activity and spa treatment reminders left on our pillow at night too!", "title": "Luxury camping... in paradise.", "helpfulness": 5, "user": "betbet065", "date": "December 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50415336}, {"rating": 5.0, "title": "Once you've been here, this is the place you'll answer when asked \"where is your favorite place to go in the world?\"", "text": "DINING: I was nervous about the food because I don’t like seafood or fish. However, my tastes were accommodated at every meal without even asking! Seating in the outdoor dining areas have breathtaking views and are very romantic. Mornings began with your choice of coffee or selection of teas and a pastry quietly delivered outside your house at around 6:30 am. It was great enjoying your first cup of coffee at your convenience on your private patio without getting dressed first. Breakfast included coffee or tea and freshly squeezed O.J. and a hot entree from a list of about 8 selections. Lunch included fresh juice which changed daily, a selection from about 5 appetizers and 5 entrees and a light dessert. Dinner included a ‘bar bite’, an appetizer, an entree, and a dessert. There are no choices at dinner. The food was very tasty, plentiful, fresh and healthy. Julian is an excellent chef, Alfredo is a gracious waiter, and Kiki is a fun bartender. Our only criticisms are that it would be nice to have a selection at dinner, we craved carbs; (there are no buns or bread served with any meal), selections at breakfast and lunch were frequently unavailable, and as someone with a sweet tooth the desserts were too small; (probably for the best)!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "November 24, 2009", "id": 49992933}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "POOL: The pool area, like everywhere at Verana has amazing views. The pool is beautiful, large and spring water fed; (very cold water but refreshing)! There are lots of lounge chairs available with umbrellas positioned at different levels around the pool. You can always sunbathe in privacy!", "title": "Wow! what an adventure!", "helpfulness": 1, "user": "philipokerlund", "date": "November 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48854205}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "VERANA was glued to my magical vision boards for about 2 years. I came across an article in Travel & Leisure magazine. I was intrigued by its crafted “handmade” details: walls washed in colored plaster, carefully yet humbly curated accessories, straight clean lines of the hardscapes and landscaping, and perfectly composed vignettes. Little spontaneous arrangements sprinkle the grounds, as if tiny jungle fairies come out at night and decorate the rooms from their arsenal of natural materials and flowers. In reality, it is the handiwork of two former movie industry designers, Veronique Lievre and Heinz Legler. Still, as much as I disdain LA, I romanticize their story because it’s another couple of incredible vision and passion who made something so heartfelt and cool for the public to enjoy. All on the backs of donkeys.", "title": "Young and the Rested", "helpfulness": 2, "user": "keryninbali", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115918210}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "A short boat ride and an (optional) donkey ride past the breezy sea cliff spa, and you arrive at paraiso. The food is so generous and fresh, that meal time is an event in itself. The waters are likewise so fertile that swarms of fish literally jump out of the water at any given time of the day. In our morning fishing trip, we easily caught 6 Bonito tuna which were immediately whisked into the kitchen and served up as a massive PLATTER of sashimi and enough poke, ceviche and seared tuna to feed the rest of the guests.", "title": "Best Honeymoon Hotel", "helpfulness": 1, "user": "SHM_MLCD", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 115861491}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The Day Spa is like taking a nap in Greece, and the spa in the resort itself is an intimate spiritual bath somewhere in Ubud. On our last night, we soaked in an intoxicating aromatic bath, surrounded by literally over 100 candles (I counted) and were quietly left there. We staggered from our drunken slumber back to our room at 3am.", "title": "Worth the Climb to the Top!", "helpfulness": 2, "user": "cowtowngirl154913", "date": "June 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114919189}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Finally, I have to mention the V House at Verana. What a trip! If you saw the recent cover of Sunset Magazine (March 2010), you’ll see a roofed structure of i-beams projecting diagonally out of the jungle hillside. As you climb up, the whole interconnected overgrown playset sways and creaks with your footsteps. Part rustic cabin, part architectural feat. Apparently, much to their dismay, this was the living quarters of some of the managerial staff members of Verana. They are super bummed to have to relinquish their ‘glamping’ accomodations to curious visitors. The V House would be an awesome friends vacation where you can rent out the entire residence of 3 beds and 1 bath/kitchen - for $250/night, you get all three ‘cabins’. But if the V House is a-rockin’, don’t come a-knockin’.", "title": "You can't get better or any more different ..", "helpfulness": 2, "user": "gilesshaxted", "date": "June 6, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 111817120}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "For the majority of our stay however, we were in the colorful and comfy Mayan house. Next time we’ll stay in the Tea House. Be sure to sign up for their Last Minute Specials notices. I very rarely do do-overs, but I see VERANA as a place to go when I can’t get to Bali. It’s that good.", "title": "Most Amazing Place!!", "helpfulness": 2, "user": "carolinatraveler14", "date": "May 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 110779304}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "This review is a little overdue...my husband and I stayed at Verana in May of 2010. We usually try to stay at smaller, more intimate and non-touristy/unique places...Verana hit the nail right on the head. In general, we had a nice stay but were somewhat disappointed. Don't get me wrong, the setting is truly amazing...love the concept of the different rooms/different layout on the property...love the uniqueness and remoteness of the place....the beautiful views....and thought the food was excellent...just thought the service really fell short and took away from the rest, and didn't live up to expectations. I wouldn't discourage anyone from visiting Verana as I have noted some really great features above...I just think they should step up the service to match the rest.", "title": "Amazing location, Excellent food, Mediocre Service", "helpfulness": 3, "user": "gringa430", "date": "November 7, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 86281396}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "This is one of the most romantic places I have ever stayed. The casas have different themes, so if you want to stay in a tree house or a jungle house it is up to you. They are all very private, and beautifully decorated. The view is magnificnat. The service fantastic and the food is out of this world. The grounds are so beautiful you don't want to go anywhere else. Although, they have many excursions that you can do, and a beautiful spa and pool. We went on a trip to some special islands to see birds, whales and we also went snorkeling. They provided us with a fantastic lunch on the beach. You must be able to hike up a big hill though.", "title": "Paradise Found!", "helpfulness": 1, "user": "Lisa12379", "date": "October 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 83214449}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "My wife and I have travelled a lot and enjoy vacations that allow us to explore local culture and activities while also finding it easy to relax...Verana gets high marks on all acconts. We started every day with yoga, spent the rest of our days kayaking, hiking, exploring the very small town of Yelapa, visiting the nearby islands and lounging by the pool, which has a fantastic view. And at night, the meals at Verana are amazing, the bar relaxing and social, and we played boule de petanque every night with cocktails. We'll be back again soon!", "title": "Magical", "user": "GlobalLens", "date": "October 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82874141}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "My husband and I went here for our honeymoon and we constantly compare all of our vacations to this trip. Everything was perfect. The food was amazing, the drinks from the bar were amazing, the tours were amazing, the room was amazing. I can't say enough.", "title": "AMAZING", "helpfulness": 1, "user": "txtravelermom", "date": "July 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 69893252}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "I would recommend staying in the Mayan - it's on the cliffs. We woke up every morning to the sunrise and sat on the edge overlooking the ocean and ate our pre-breakfast breakfast.", "title": "Most incredible!", "user": "Papa13Sonoma", "date": "June 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66880670}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We returned last night from five days at Verana. In many ways, words fail to describe our time there. But here goes. First, the getting there--to a place where time just about stops. You leave smoggy, jammed-up Puerto Vallarta in a taxi that takes about 45 minutes to the end of the road: a pleasant-enough, not much developed place called Boca de Tomatlan. The Verana panga (a smallish out-board motorboat) takes you another 45 minutes along the lush coastline to Yelapa, once a hippie haven but now definitely \"discovered\" by mostly budget travelers. OK beach, out-of-the-way feel, popular with daytrippers from PV.", "title": "Surpasses All Expectations", "helpfulness": 3, "user": "vcdarty", "date": "March 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101566833}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "From Verana's small dock, steps climb up, up, up. (Mules carry your bags, and you--upon request.) We were met--at a different landing place since the tide was unsuitable for the usual spot--by Kent, the affable resident manager, who guided us chattily along with stops to catch my 70-some-year-old breath. At reception or rather the bar, a few steps further along, Bernie, the new and enterprising barman, greeted us with cold towels, fresh lime-onade, and a variety of excellent salsas. (Bear in mind that nearly everything here is open, all or in most part, to the green and glorious landscape and the astonishing views. Doors are few. That's a major contribution to what makes Verana unique in our widely-travelled experience.)", "title": "Worth every penny and more", "helpfulness": 1, "user": "echines", "date": "February 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 98132835}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Kent showed us up to our \"room,\" the Jungle Suite, at the top of the hill (more steps!). It's more of an extensive, slightly Bauhaus-styled pavilion with 15-foot ceilings, an 18-foot glass wall facing the jungle,and another, equally long open wall into the great outdoors that our mosquito-net draped bed faced. Elegant proportion is everything--not surprising since the co-owner, Heinz Legler, is a skilled and deeply inventive architect. A large private terrace overlooks the sea, Yelapa, and the mountainous distances, and another terrace gives onto the green view of the jungle. (Note: Verana's website offers plenty of images of the landscape and the building-scape. They convey, absolutely, the feel of the place, and if anything understate the spirit and appeal of Verana.)", "title": "Perfect.", "helpfulness": 1, "user": "Luc23", "date": "February 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97147657}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We visited several of the other eight houses. Each is unique in design, placement, and character. Each is delightful in its own individual manner. Heinz's wife, Veronique Lievre, is responsible for design and decorative elements, all restrained, evocative and perfectly suited to each location. No cookie-cutter, mass-produced, pseudo-luxurious stuff here, as in so many multi-starred resorts all over the world. Heinz and Veronique have created, literally from a steep jungle hillside, an \"escape\" that is definitely Mexican in feel, but with a sophisticated, semi-European flavor that avoids the fancy-pants, impersonal glamour of many Mexican resorts. Warmth, solicitude, attention to guests' wishes are ever-present but never intrusive.", "title": "Love The PV Pad!", "user": "Iuliutsa", "date": "January 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 93590490}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Well, this is going on far too long. Guests can have as much privacy as they wish or be more social if so inclined. We enjoyed cocktail hour at the bar with others (we were the most ancient--other guests included a honeymoon couple from London, another from Dallas, young couples enjoying a break from their twins [two couples], an engaging, athletic pair from Santa Barbara, a guest from Russia.) Major plus: Heinz and Veronique were in residence, attending to details and playing the delightful hosts--as they are, for sure. The feeling was rather like that of a relaxed house-party.", "title": "Just book it", "user": "tahoejones", "date": "December 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89787021}], "location": {"country": "Mexico"}, "variance": {"poor": 4, "average": 4, "very good": 12, "terrible": 5, "excellent": 113}, "aka": "Verana Hotel", "slim_ranking": 0.25, "description": "Located 30-miles south of Puerto Vallarta floating above the Bay of Banderas, embraced by the mountains of the Valle de la Sierra Oriental, carved out of lush Mexican jungle on a hillside rests Verana. It is as unusual as it is remote. Unique design that is rustic yet sophisticated. Designed for travelers with a sense of adventure and appreciation of tranquility and natural beauty. An indoor/outdoor Spa adds to the amenities of a luxurious getaway."}