{"user_rating": 4.5, "review_count": 1714, "name": "Verandah Resort & Spa", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The Verandah resort is set across the coastline between two very scenic bays, and based very close to the pretty and wild Atlantic coastline where the Devil's bridge can be found. The rooms are well equipped and furnished to a high standard; with my only small criticism being the fact that the structure of the roof meant that heavy rain overnight was in fact very noisy rain overnight also. Having said that, the nature of the island is a mix of tropical storms and sunshine, so expecting an entirely silent night was a little ambitious!", "title": "Beautiful setting, friendly staff, and some real tranquility", "helpfulness": 1, "user": "Timj135", "date": "December 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 51608263}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The pool area is pretty and suitably large so as not to feel crowded, and the service from the nearby bar area was good. The selection of 3 restaurants was nice, although I did feel that a charge being levied for the luxury restaurant was a little 'tight' as it is not a cheap destination in the first place. I am sure there are simpler and more effective ways of boosting revenues that would allow for the restaurants to be genuinely 'all inclusive'.", "title": "LOVED IT !!!!!!", "helpfulness": 2, "user": "BODANDWALLY", "date": "December 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51543279}, {"rating": 5.0, "stay_parameters": "Stayed December 2009", "text": "Food was varied at the other two restaurants, and had a mix of different styles and ingredients that kept me happy for the week. The staff were reasonably efficient, and typically easy going in a Caribbean fashion. Friendly, and approachable throughout.", "title": "We loved this place and would go back any time!!", "helpfulness": 1, "user": "colinsgrandma", "date": "December 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 51522906}, {"rating": 1.0, "stay_parameters": "Stayed December 2009, traveled with friends", "text": "The use of the golf buggy lift system between areas of the resort works well, and considering the size of the venue, would certainly be a great benefit to the infirm or elderly.", "title": "Do not stay here under any circumstances -very unfriendly staff", "helpfulness": 5, "user": "Gotravel21London", "date": "December 17, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 51399392}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Overall... a nice place to visit, with good food, good staff, and lovely scenery.", "title": "Paradise", "helpfulness": 1, "user": "Sunshine72094", "date": "December 17, 2009", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 51399266}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We stayed for 2 weeks in Dec 09. Luckily were upgraded to seaview room next to the main pool - hillside rooms could be a long walk. The resort is wonderful with all the vegetation & wildlife & nice beaches at each end. I won't go into the food as that has been done in great detail on here. Suffice to say we found an amazing, varied selection of great food in the Sea Breeze buffet & hardly bothered with the a la cartes as it was so good. The resort is much more low-key & natural than the Carribean Sandals we are used to, but the service was excellent & the evening entertainments were actually better. Most nights were local singers who were all pretty good, the steel band is one of the best I've heard & the \"Name that Tune\" night is not to be missed! I was happy with the Pinot Grigio wine & champagne.", "title": "Relaxing, beautiful, low-key resort", "helpfulness": 2, "user": "hazelha", "date": "December 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52107152}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The adult pool is lovely, a quiet oasis & most of the time we had it to ourselves. Even the main pool & beach weren't too busy when we were there.", "title": "Beautiful", "user": "peddlerpalm", "date": "December 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 52064137}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled solo", "text": "We did have to move rooms as noisy children were next door & we didn't want to be woken at 6am on holiday! The walls are thin as they've been built that way to withstand earthquakes. We were moved quickly, with no fuss & with so much help & attention from the excellent managers, Mr Grant & Mr Henry. Thank you to them.", "title": "A positive review with some useful info", "user": "Alex047", "date": "December 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 52035852}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "I would suggest that they pair older couples, not put them next to noisy families.", "title": "Fantastic hotel which is let down by small problems.", "helpfulness": 1, "user": "Terry047", "date": "December 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 51882141}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "We enjoyed the trips to St John's & to the historic dockyards. Others we met also enjoyed the catamaran trips but we were having such a nice time in the resort we didn't really want to be out all day on the boat when it was fairly windy.", "title": "THE MOST RELAXING AND PERFECT RESORT I HAVE EVER STAYED IN - AND THERE HAVE BEEN MANY!", "helpfulness": 1, "user": "JACKBrighton", "date": "December 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51679786}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The Verandah is a lovely resort and the grounds are beautifully kept. It is very spread out - a buggy takes you from reception to your bungalow and the driver points out where beaches, restaurants, pools etc are situated. Our accommodation was near the main pool, which was a good central position and easy to walk to bars, restaurants and the main beach. Unfortunately we didn't have a sea-view though, unless we peered round the corner from our terrace. The accommodation was lovely, though, with a comfortable sitting area and small kitchenette.", "title": "Beautiful resort, but covers a large area", "helpfulness": 1, "user": "tog", "date": "December 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 51396132}, {"rating": 2.0, "stay_parameters": "Stayed December 2009, traveled with friends", "text": "We were on All-Inclusive and the food was quite good. There is a choice of 3 restaurants - 1 self-service buffet, and 2 with waiter service, though there is a supplement for one of these, which is classed as \"fine dining\". We didn't have a meal there so cannot report on it, but we were happy with the food in the other two restaurants. We felt that they didn't have much atmosphere to them though, particularly the self-service, and neither of them have a sea-view. The staff there were very efficient, and cleared plates and topped up drinks promptly.", "title": "Most unfriendly and surly staff I have ever had the misfortune to meet", "helpfulness": 2, "user": "GuildfordTravelBug", "date": "December 16, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 1.0, "rooms": 3.0}, "id": 51356688}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "We only had a short visit to this resort and didn't get to the \"quiet\" beach near reception. The main beach certainly didn't seem noisy and was a lovely beach, though not a lot of shade. They do have a number of sail-type shades rigged up, but difficult for 2 people to get totally in the shade under those, but we did find a place under a tree that gave us both the shade we like. Sea is very shallow & warm, but when we were away from the beach, the bottom had a muddy feel rather than sandy.", "title": "So nice, been there twice... will go again!", "helpfulness": 1, "user": "mpl7", "date": "December 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 51233469}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The service was truly terrible the staff obviously do not want to serve women customers as they seemd slightly more polite to the men, we observed rudeness to older guests as well. The room was ok, the resort was in a good spot with 2 nice beaches but the negatives far outway any positives. We both caught a stomach bug whilst at this resort which had an impact on 3 days of our 9 day stay (we continue to suffer after our return) We were discouraged from getting a Doctor due to the price quoted by the Hotel at $200 !! but our Rep told us it should only cost us $100! I have been to the Caribean 3 times and will never return.", "title": "relaxing", "helpfulness": 2, "user": "craftypen", "date": "December 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 51132679}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Grounds and accommodations are immaculate. Standards are second to none. Cannot rave enough about the staff who go above and beyond - they are so caring and friendly. Been twice and think that every resort should be modeled after Verandah!", "title": "A piece of paradise", "helpfulness": 1, "user": "JK1Ireland", "date": "December 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51073367}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Just returned from the Verandah. It is good value but is a 3.5 star and don’t expect anything more. I have read the most recent reviews below so I will try not to repeat too much.", "title": "High Temperatures and Value for Money", "helpfulness": 1, "user": "PaddyFoley", "date": "December 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 51056410}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "A number of the reviews mentioned paying extra for a sea view. All the rooms have a sea view – according to the hotel bumph (“Each Air Conditioned Suite has a large Private, furnished Terrace with partial or full water views”) and I would agree as from my kayak I could see most of the balconies. We had a super view and did not pay extra.", "title": "What a lovely resort!", "helpfulness": 3, "user": "ladytravelalot", "date": "December 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 50962968}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "One review mentioned kitchen facilities. We only had a micro-wave, kettle and I think a coffee maker. There was no hob.", "title": "Verandah, the place to return to!", "helpfulness": 1, "user": "Caledoniagirl", "date": "December 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 50952614}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The beach at reception was less full than the main beach but lacked the facilities of the water sports equipment, was far away from food, had a lot of seaweed close to shore. The main beach had only one draw-back and that was that the rule, that no sun-beds could be reserved by leaving towels, was broken and there was no attempt by staff to enforce it. Towels would be left on sun-beds by people going to breakfast at 7.30am. There were plenty of sun-beds but a scarcity of shade sometimes. So it was a bit unfair that those who kept the rule were penalised. In summary, some people did not measure up the Verandah 3.5 star and staff did nothing about it.", "title": "Lovely drinks but average (at best food)", "helpfulness": 1, "user": "DannyBoySheffield", "date": "December 7, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 50831822}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Our two favourite restaurants the last time we were in Antigua (2006) were Harmony Hall and Catherine’s Cafe. Both have changed hands since with the result that Catherine’s Cafe is still good but Harmony Hall has dropped off a little and the road to it has got almost undrivable.", "title": "Wonderful relaxing sunshine getaway", "helpfulness": 2, "user": "Woodlanders44", "date": "December 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50731178}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "It seems that some of the previous reviewers were only on holiday in order to find fault. Does anybody look for the positive thing sin life any more.", "title": "Fabtastical!", "helpfulness": 6, "user": "Quinquis29360", "date": "March 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 14501309, "likes": {"liked": "— The location and the staff", "disliked": "— Hard to say that there is anything"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "OK, there are a few steps to the beach. OK the beach bar closed at 4pm and the music wasn't always great but for heaven's sake look on the bright side.....", "title": "Have to wonder", "helpfulness": 7, "user": "RobR", "date": "March 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 14454933, "likes": {"liked": "— all inclusive", "disliked": "— Not like the rest of this island -- beach is not up to par"}}, {"rating": 4.0, "title": "Enjoyed the hospitality at the Verandah", "text": "We experineced great service from 97% of the staff - attentive, humorous, willing to spend time and talk.", "helpfulness": 3, "user": "caribgirl08", "date": "March 19, 2008", "id": 14380431}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "The place is spotlesssly clean and the people have such pride in what they do.", "title": "This is a great place for families", "user": "Bab44", "date": "March 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 14375941, "likes": {"liked": "— Fresh, attractive, spacious for 2 persons, beautiful landscaping", "disliked": "— Needs some throw pillows, plants to make it a little warmer in feeling"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "The food was of a very high standard albeit the difference between the different dining rooms was not that great. However, if you take time to talk to the people providing the food and the service, the whole experience is enhanced. It was also wonderfully fresh.", "title": "Great Holiday", "helpfulness": 3, "user": "Scottish_Tourists_8", "date": "March 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 14268295, "likes": {"liked": "— Restaurants and bars.", "disliked": "— Lack of sun umbrellas."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Having booked our week at the Verandah back in July 2007, for our 30th wedding anniversary, we monitored the reviews with some trepidation, but were absolutely delighted with our stay. We had booked an Ocean Front room and having checked in and enjoyed our welcome drink, we were quickly whisked by shuttle to Room 179, which had a great combination of location and view. The room was very smart and comfortable, with all the facilities we needed. Unlike other reviewers, we never managed to create even the slightest flood in the bathroom!", "title": "Highly recommended for a relaxing break", "helpfulness": 3, "user": "Durhampuma", "date": "April 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15143470, "likes": {"liked": "— Friendly service and great location"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Access around the resort was very easy, with frequently available shuttles, although we usually walked to the reception building when required -an easy 10 minute stroll from the main pool area at \"resort pace\". The spectacular Devil's Bridge is also a 10 minute stroll and well worth the effort, particularly when the waves are high. For variety, the other beach adjacent to reception is fine, with its own bar, and Long Bay Beach is only a five minute walk from reception. We enjoyed the food in all three restaurants and, unlike some other reviewers, felt that there was an excellent variety of both local and International cuisine. For example, one day in the Sea Breeze Restaurant I enjoyed a goat curry, while my wife had an excellent portion of roast beef. Nicole's is certainly worth visiting, with an even better menu and a special ambience.The service in all the restaurants for every meal was friendly and professional, with drinks arriving within a maximum of 2 or 3 minutes after ordering, and \"top-ups\" being offered without prompting.", "title": "Great Family Resort", "helpfulness": 4, "user": "vacation2349", "date": "April 15, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 15067336, "likes": {"liked": "— beach", "disliked": "— steps to beach"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "The relatively small size of the resort meant that we were able to have a friendly drink and chat with the people who we frequently encountered. Drinks in the Pool bar were great, and entertainment, although low key, was very pleasant.", "title": "Very pleasant and relaxing", "helpfulness": 1, "user": "marcho", "date": "April 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 15059486, "likes": {"liked": "— Good location, pleasant surroundings, reasonable service"}}, {"rating": 5.0, "title": "A lovely resort and a great holiday - we'll be back!", "text": "A visit to St John's via the hotel shuttle for $14 per person made a change, but the main shopping area is really just a means to extract cash from cruise ship passengers, rather than a great place to spend time.", "helpfulness": 3, "user": "Lovethecaribbean_8", "date": "April 11, 2008", "id": 14960732}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "Overall, our most lasting memory of the Verandah will probably be the genuinely friendly and helpful attitude of all the staff, and the other local people that we met. They made the time to ask about our day, and our plans for the rest of our stay. We would highly recommend the Verandah for a relaxing break in Antigua.", "title": "Great landscaping", "helpfulness": 3, "user": "CLEARWATT", "date": "April 7, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "business": 1.0, "value": 3.0, "rooms": 3.0, "location": 2.0}, "id": 14855250, "likes": {"liked": "— gardens, the big breeze!", "disliked": "— lack of communal comforts"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "We stayed at the Verandah for 2 weeks from March 6-20. We were four people (36 & 38, 64 & 67). I'll break this review down into sections to make it more helpful:", "title": "Great Holiday!", "helpfulness": 7, "user": "CalgaryAlphan", "date": "April 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 14720785, "likes": {"liked": "— Great people, fabulous location, good food & drinks - small island so everything is convenient.", "disliked": "— Too many children at resort, and noise is an issue if you have loud neighbours."}}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "ROOMS: Very large, and we were in a great location (176 & 177). Nicely furnished, if not extravagant. Comfortable sitting area. The bed is very large and comfortable, as are the pillows. The verandah on each room is fantastic - large and private with excellent views. Yes, the shower leaked onto the bathroom floor - it was unavoidable. Towels had to be laid down daily to soak up the water, which was a bit of a pain. Noise was only an issue in our room once in our room, while my parents had more difficulty with noise in their room. The rooms are not well soundproofed, so if you have noisy neighbours, you'll hear it! As long as the neighbours are quiet, all is fine.", "title": "Good for families but not for a beach holiday in Antigua", "helpfulness": 8, "user": "zendon", "date": "March 31, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 2.0, "location": 2.0, "rooms": 4.0}, "id": 14676464, "likes": {"liked": "— very spacious rooms with large bathrooms and bog verandah in front.", "disliked": "— very windy and not a proper beach for a hotel in Antigua"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008", "text": "FOOD: Seabreeze: Breakfast and lunch buffets. Food is always the same at breakfast, and was not always as hot as it should be. The egg station is the best! Dinner was sometimes buffet, sometimes not. Usually good/very good service and food.", "title": "Fantastic", "helpfulness": 1, "user": "GrahamandTammy", "date": "March 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14565901}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Nicole's: More upscale, and plans to charge an additional fee in the future. Usually excellent service, except our last night when they seemed to forget us after the entree, and we never saw a server again... they never saw a tip that night either! Food was a bit mixed, and the menu stayed the same way too long. They only change it every 2 weeks, but after complaining, they moved to the next menu early and we got to sample the next menu a couple of times. They really should change this menu every week.", "title": "Good experience but it's all about expectations", "helpfulness": 2, "user": "mbridges30", "date": "March 26, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 14552636, "likes": {"liked": "— Relatively small and intimate size", "disliked": "— The drive to reception"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Desserts were average, sometimes great (blueberry cheesecake!) and sometimes disappointing (\"homestyle\" apple pie! - NOT!)", "title": "Excellent Stay", "helpfulness": 3, "user": "Medway_Traveller", "date": "March 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 14530175, "likes": {"liked": "— Clean, bright. well furnitshed and presented"}}, {"rating": 3.0, "title": "Rising New Resort Needs to Work Out Kinks", "text": "My husband and I recently honeymooned at the Verandah after a great deal of research and review. Although the resort is still relatively new and many of the reviewers have had a more unsatisfactory experience, we found the resort to be clean, the service friendly overall, and the food fairly good.", "helpfulness": 1, "user": "raleightravels2", "date": "March 12, 2008", "id": 14246039}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "However, we booked our trip through Elite Travel and had a lengthy discussion with the travel agent regarding our room view only to find upon arriving - very late at night without airport travel vouchers to the resort - that our room overlooked the bay and someone's unfinished private home. Since there was a difference in price and it was billed as \"Ocean front\" this was not acceptable and we insisted on being moved to a room from which you could actually SEE the ocean. The management did so the next day and we were right by the beach as well. Since there was no problem accommodating us, it's unclear as to who is responsible for the miscommunication, especially after we've read several reviews of similar situations.", "title": "Perfect for Kids and the gang...", "helpfulness": 2, "user": "Roberta4sons", "date": "March 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14135251, "likes": {"liked": "— Size", "disliked": "— Air conditioning could get cold so we set the tempeture so it would be perfect."}}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "Another minor bit of confusion we discovered was the dress code for the restaurants, one of which was only open two nights of our stay. Be prepared to \"dress\" for dinner and call ahead for reservations. And they need to diversify their soundtrack to improve the ambiance - even the servers were laughing when we strolled into breakfast humming overplayed Bob Marley tunes that were beginning to make us feel like Groundhog Day (the movie.) Some classical instrumental or even traditional island music would've been more appropriate and soothing.", "title": "Could be a Great Hotel but NOT YET", "helpfulness": 5, "user": "NantucketFlicka", "date": "March 7, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 14120714, "likes": {"liked": "— Size", "disliked": "— Food"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "All in all, we enjoyed our stay and I would recommend this resort to mostly families with children, but not so much for honeymooners.", "title": "Loved the Verandah!!", "helpfulness": 4, "user": "brrrvermont!", "date": "March 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14102928, "likes": {"liked": "— Kidz Club, location near secluded beaches", "disliked": "— Small beach"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "i just returned from this new resort with my husband, I was only sorry we didn't bring the entire family. It is a perfect setting for a family seeking a hideaway when the kids can use a dedicated kids club with all the trimmings including supervised and I mean supervised activities, their own little pool (guarded of course) and a dining room for family dining. The cuisine was a combination of caribbean which we liked and of of course all the good american dishes. The beach was not the largest but perfect for this resorts size less than 200 cottage type suites all facing water!!! The weather was perfect so the activities were first rate. But the best was the friending staff at Verandah. very friendly and always offering a smile and assistance. Bought lots of special tees for the grandkids in their Mini market right there on property. Didn't play tennis but that too was brand new. All in all a wonderful experience and a real surprise that having been open only a few months they were very organized. OH I almost forgot my massage it was wonderful and they gave all guests a 25% discount in their new state of the art SPA. Hope you enjoy too.", "title": "STOP & READ this BEFORE going to the Verandah Resort!", "helpfulness": 7, "user": "Toxoman", "date": "March 4, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 14050348, "likes": {"liked": "— The access to natural attractions and water", "disliked": "— The noise levels"}}], "location": {"country": "Caribbean"}, "stars": 3.5, "variance": {"poor": 79, "average": 139, "very good": 532, "terrible": 24, "excellent": 940}, "aka": "Verandah Hotel Saint Philip", "slim_ranking": 1.0, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.5, "location": 4.5}, "description": "The Verandah Resort & Spa is a world-class all-inclusive resort overlooking the crystal blue Caribbean waters of Antigua. Perfect for couples, friends, families, honeymoons, and weddings. Guests love the resort's friendly, romantic atmosphere, with lots of activities for adults, teens, and children--not to mention our Two White Sand Beaches!The Verandah's four restaurants, four bars, four swimming, including the largest freeform freshwater swimming pool in Antigua. Activities include hobie cat sailing, kayaking, swimming, snorkeling, pedal boats, supervised Kids Club, 18-hole miniature golf course, and much more.Indulge at our Spa Tranquility, featuring a wide array of massage and beauty treatments, or enjoy a workout in our air-conditioned fitness center.We look forward to having you as our guest, and thank for your choosing The Verandah Resort & Spa, Antigua."}