{"user_rating": 3.5, "review_count": 209, "name": "Vermont Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with friends", "text": "Wonderful location, 2 blocks from Praia Ipanema Posto Nove. Lots of shops and botecos within walking distance. Very nice breakfast buffet too and helpful, friendly staff. Would definitely stay there again.", "title": "Great location, great value", "helpfulness": 1, "user": "EasyGoingMidwestGuy", "date": "December 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 188204991}, {"rating": 3.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "Hotel Vermont is a reasonably priced hotel in Ipanema. Nothing fancy, but clean small rooms, a staff that generally speaks English and is very helpful, and a great location just two blocks from the beach. The elevators are amazingly small, and would certainly be a problem for disabled travelers. The rooms are plain, tiny bathrooms, and loud air conditioners, but more affordable than most other hotels in the area. A good choice for travelers not wanting to pay several hundred dollars a night to stay near the beach.", "title": "Reasonable place in ipanema.", "helpfulness": 2, "user": "Rick M", "date": "December 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 187687884}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "I stayed at Hotel Vermont for 3 nights in October 2013 with one other person as part of a trip around Brazil. We didn't have a reservation to stay but was able to walk-up and get a room at a rate similar to what I had noticed online through my research. The desk staff spoke English and were friendly and helpful with directions and other information, including assisting with excursions and storing our baggage while we were exploring the city before leaving. The breakfast was included and was plentiful and very good with an assortment of meats, pastries, fruits and beverages. Outside of the dining area were two computers with free internet. The location was very good, two short blocks from the beach with multiple options to choose from for dining, bars, shopping and banks. I felt safe walking and going out in the area, day and night. The room was a bit utilitarian, resembling more of a dorm room than hotel, while the hallways were quite narrow. In addition the bathroom had an older style and unattractive feel which could use an upgrade. However, for the value, staff and location I would stay here again and recommend others to do the same since there is a lot to do in Rio to see and do.", "title": "Good location, value, plain rooms", "helpfulness": 2, "user": "BrianT90", "date": "November 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 186389176}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "We payed slightly more for one of the newly refurbished rooms", "title": "Spotless, simple rooms in great location!", "helpfulness": 1, "user": "SIGNMAN8", "date": "November 29, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 186259433}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "on the 8th floor (newly modelled bathroom) and was very happy", "title": "Good choice for the price in Ipanema", "helpfulness": 2, "user": "skaterdad", "date": "November 9, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 184193645}], "location": {"country": "Brazil", "continent": "South America", "city": "Rio de Janeiro"}, "stars": 3, "variance": {"poor": 30, "average": 64, "very good": 83, "terrible": 13, "excellent": 19}, "aka": "Vermont Hotel Rio De Janeiro", "slim_ranking": 0.367647058824}