{"user_rating": 3.5, "review_count": 340, "name": "Vibe Hotel Rushcutters", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We stayed here for four nights because this hotel is relatively affordable and was a four star hotel. The other hotels in Sydney during this time was pretty expensive. We took the train at Kings Cross Station every day to visit the sites in and around Syndey. It's a few blocks but can feel like a trek since you walk around Sydney so much. It's a city that you have to walk around to see the sights. Our room was nice and it was not noisy. The park behind the hotel has a lot of joggers and the area feels pretty safe. It's just the block at King's Cross Station that is a bit seedy (redlight district) but you do not feel endangered in any way as there's always plenty of people b/c of the restaurants in the area. Overall, if you're looking to stay at a place that doesn't cost an arm and a leg and want a nice hotel - i would recommend it. If you're looking for convenience to walk everywhere from here - I'd say look for an area to stay by the harbour.", "title": "Very good hotel but a bit of a trek", "user": "wlslb", "date": "June 28, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 114840492}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "This would have to be the worst hotel I have ever stayed at. The cleaniness was non existent, mould growing on the shower curtain, cups still had coffee in them from the last guest, window was so dirty it was hard to view outside, carpet was covered in filth and bits of hair etc.", "title": "Will never be back!", "helpfulness": 2, "user": "NZL_Carl", "date": "June 25, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 3.0, "value": 1.0, "service": 2.0}, "id": 114730150}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "Breakfast was due to be served at 630, but no staff turned up until 0707 when I started serving myself. Would not recommend this hotel to anyone. I'm sure yu can find better.", "title": "Good Location - handy to airport", "user": "JC-Qld", "date": "June 19, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 5.0, "service": 3.0}, "id": 114426862}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "I had a Scoopon deal $120 night with a bottle of wine and breakfast. The wine wasn't handed over when I checked in. I assumed the bottle in the room was it. Luckily I checked first at reception and it was handed over. A guest could be slugged $25 if they opened the wine in the room because it wasn't given to them at reception.", "title": "I loved it, recommend to anyone!", "user": "Miricle", "date": "June 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 114274518}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I assume reception staff keep it if the guest doesn't ask.", "title": "Not so bad, but.................", "user": "WizardMelbourne", "date": "June 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 2.0}, "id": 112816715}, {"rating": 2.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "My partner and I stayed one night on the 26th February 2011, through a special scoopon voucher for our anniversary weekend.", "title": "I had a bad vibe from the start.....", "helpfulness": 1, "user": "Lindy1986", "date": "February 28, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 98448257}, {"rating": 1.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "I couldn't believe the amount of trouble we experienced from booking the hotel and checking in!", "title": "I would never stay here again or recommend this hotel to friends or family", "helpfulness": 4, "user": "FeeJaySydney", "date": "February 26, 2011", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 2.0}, "id": 98150656}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "It took 5-6 phone calls in December 2010 as reservations team were busy to get back to me with regards to make reservations over the phone.", "title": "Average Hotel", "helpfulness": 1, "user": "advocate_of_truth", "date": "February 26, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 98147543}, {"rating": 2.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "At the time of booking we were told we had a king bed and when we arrived at 2pm we were left with 2 king single beds.", "title": "Not a good Vibe", "helpfulness": 2, "user": "RFBoston", "date": "February 5, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 95537192}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "There were no telephone call to tell us that they have 'over booked' and they have change our room type, there were numerous excuses given to us for e.g. there was a computer glitch, we cannot guarantee bedding, mardi gras is on next week so we are overbooked, check in time is not guaranteed.", "title": "Hit and miss - don't pay top dollar", "helpfulness": 1, "user": "happiestcamper000", "date": "January 27, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 94681510}, {"rating": 4.0, "stay_parameters": "Stayed May 2011", "text": "Although Vibe Rushcutters Bay is not readily accessible by public transport the accommodation makes up for this. Staff are attentive and helpful, rooms are nicely decorated, very clean and bathroom is modern. Bed let things down for me being rather basic, thin and hard. Parking is in typical Sydney style, not cheap but easy to access rooms from. I got a great deal through Wotif so overall my stay at Vibe Rushcutters was excellent.", "title": "Excellent value for money, nice room", "user": "bluemountainkiwi", "date": "May 25, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 109786346}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "If you get a cheap rate as I did, why not. Just over $100 a night for a large room with a deep bathtub, oversized bathroom, rubbish cable, and decent bed. Oh, and a view over a busy road. This isnt the place for a relaxing, luxurious or romantic evening! But it serves its purpose as an average clean hotel.", "title": "Good basic hotel with the world's most expensive chocolate bar!", "user": "Brocko25", "date": "May 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 108048407}, {"rating": 1.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "The minibar is basic, with a small cadbury chocolate bar available for $7.50! I didnt want it, but it did serve as a source of amusement. Room service is avail 24 hours. Cable TV consists of a couple of news and sport channels. I have more channels at home! Staff were all friendly and courteous, I exchanged some jokes with Queenie upon checkin. I was awoken early each morning - by the loud air conditioning and on two occasions, and the mobile phone alarm vibrating on the bedside table in the room next door also. So sleep quality was definately not great.", "title": "Spend your money somewhere else.", "helpfulness": 3, "user": "Kankou", "date": "May 6, 2011", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 107066135}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "Given the large number of decent hotels in the area, I would probably choose a hotel up the hill next time to save the hike in the morning. But it was good value for the price I paid, for sure", "title": "Splendid. I highly recommend this hotel.", "user": "Bannawk", "date": "April 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 103958947}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "I travelled with my wife and 2 small children and stayed for 2 weeks. Upon check in we were not offered any help with luggage, prams etc. Try getting 2 small children out of a taxi and thru your stupid doors. It wasnt busy and 3 people were standing behind the counter watching us and chatting to each other and continued to carry on with their conversation making me feel like I was interupting them so much that I heard there conversation about how one of them having their brother come and live with them and dadada....rude and ignorant. We were finally checked what we thought was a junior sweet but was basically 2 rooms with a door in between propped open with chairs. On one occasion I had the adjoining door close on my 2 children under 3 years and had to go to reception and get another key to get them out. We had booked a childrens package.....not what I had expected. Pool was out of service, gym was pathetic.....really. The lift drove me insane....I was their for business and needed to come and go in a hurry....good luck. The driveway was a pain in the butt. Couldnt hear anything that the receptionist were saying due to the traffic noise.....Not clear as to which button to push to gain entry or exit. (make a sign its not hard) Everything was too difficult for staff members and I didnt meet one that actually tried to engage to help. 1 morning out of the 14 we stayed the children were offered a high chair.....I think you need to seriously review your staff. If they dont care then they shouldnt be employed. Your main problem is inconsistency. Oh also when you have raving lunatic in the room next door and call reception at 3 am you expect something to be done about it.....well looks like you suffered the results of poor service becuase i noticed youy had the maintanence people in the next morning........ I speak from experience having managed and lectured around the world in the hotel business....I would have put far more effort into this review but I am just matching your attitude to the industry which I am afraid is poor.", "title": "Essentially a good hotel, but avoid breakfast, mini bar, laundry and key cards do not work", "helpfulness": 2, "user": "PhilExport", "date": "April 13, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 103892406}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "I booked this only a day before travelling and was expecting average based on comments here on Tripadvisor. I checked in at 5.30pm (had booked a Parkview room on Wotif after being told the hotel was full and they had no rooms available when I had tried to book directly... I could have paid more for a suite which I declined) and was pleasantly surprised by being upgraded to a Senior Suite (Room 410). So far so good. The suite was fantastic with a seperate lounge and bathroom and a bedroom with ensuite. The staff at check in had only given me 1 key and as this suite had 2 seperate entrances I needed another key to power up the lights to the bedroom ensuite. Rang down and the key was up in minutes. Very efficient. I ordered room service (pasta with prawns) and was at my door witihin about 15 mins and hot. It was delicious. The menu is a little limited but there is probably sufficient choice if you are starving and don't want to venture out like. The bed was very comfortable and the outlook across the park is beautiful. I didnt check out the gym and pool area so I can't comment on that.", "title": "Exceeded expectations!", "user": "luvtravel01", "date": "April 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103232352}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "I checked out at 9am and it was quick and efficient. All in all a great stay which exceeded my expectations and I would definitely stay here again.", "title": "Long way out !", "helpfulness": 1, "user": "SimonWise", "date": "March 27, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 101700542}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "One of several Vibe hotels and the best I think. Nice rooms. Staff seemed a bit inexperienced on the front desk but no problem with that - they seemed willing enough.", "title": "Quiet location", "helpfulness": 1, "user": "golfer45Scotland", "date": "March 13, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 4.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 100011618}, {"rating": 1.0, "stay_parameters": "Stayed February 2011", "text": "Pool are on teh roof is nice with a small gym. Can't comment on teh gym as it was closed on my visit with what looked like police tape sealing off the area - Not sure who died.Shame there was no provision for another facility.", "title": "Don't bother", "helpfulness": 2, "user": "SMRFET", "date": "March 10, 2011", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 99614706}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The most notable feature with this hotel is its location on Rushcutters bay. Very nice spot for a stroll but a long uphill walk to Kings X station and not one to attempt with bags unless you want to walk off a few pounds or the gym isn't open but there's always a taxi waiting outside the front door for the lame or the sane.", "title": "Great service from Reception", "helpfulness": 1, "user": "buffie46", "date": "March 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 99454095}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 4, "variance": {"poor": 38, "average": 117, "very good": 119, "terrible": 31, "excellent": 35}, "aka": "Vibe Hotel Sydney", "slim_ranking": 0.540540540541, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.5, "location": 4.0}, "description": "Whilst a guest at Vibe Hotel Rushcutters, enjoy high fashion amidst the boutiques of Sydney’s Double Bay and craft markets of Paddington, which are situated only a two minute drive away, or if you jump in a taxi you can be in the Sydney CBD in five minutes, for the delights of Pitt Street and George Street shopping. With the hotel located on the fringe of Sydney’s CBD, the Eastern suburbs beaches call you to brunch by the surf, with the world renowned Bondi Beach and its iconic lifestyle only minutes away from your Sydney hotel.And at the end of your busy day, return to your park and bayside hotel and relax, take a dip in our heated swimming pool or work out in our rooftop gym and health & fitness centre. Enjoy the vibe at your Sydney hotel with personality – Vibe Hotel Rushcutters!"}