{"user_rating": 4.5, "review_count": 525, "name": "Viceroy Riviera Maya", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "Where do I even start? I have been home for 3 weeks now and I still am not the same....I will try to articulate my feelings without rambling too much. First, I have been extremely fortunate and have stayed at the best hotels in world, and nothing has ever come close to Ikal Del Mar. The over all expeience was just amazing.", "title": "A Truly Unforgettable Experience", "helpfulness": 19, "user": "VandenAvond", "date": "November 6, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4090330}, {"rating": 4.0, "title": "honeymoon", "text": "I had planned this trip after many, many hours of searching for the \"perfect\" place. My expectations were set so high that I was afraid that I would be disappointed. Ikal surpassed all expectaions that I had. I didn't even think it was possible.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "November 4, 2005", "id": 4085862}, {"rating": 5.0, "title": "Every Girl's Dream", "text": "The Villa was unbelievable. Beautiful, private and extremely romantic. You really could stay in your villa all day long and never leave. Once we had our \"tour\" of the property and walked to our room they immediately delivered a bottle of wine and fruit. Then they came and offered us two bars of soap they had just made. Our Villa was beautiful. And the pool was unbelievable. We would have them warm it up every night when we left for dinner and when we came back to our room the water was like a jacuzzi. It was still warm in the morning and we would go swimming after we had out pastries just prior to going to breakfast. Then it would cool off for afternoon swimming and then we would have it warmed up again that night. The first night they just happened to be having a barbecue on the beach. The night was perfect and the food was amazing! I have never had so much lobster in my life! Our waiters were great. We became friends with all of them and they make sure that you are happy at all times. Ask/look for Carlos. He is the best. Tell him Cary and Angie said hello! The staff always call you by your name and remember any special needs/wants that you have throughout your entire stay. The motto of the hotel is that no request is too much. They do everything in their power to give you anything that you want. From the second you step onto the property you know you are somewhere special. It is small, intimate and magical. I know, I sound like a freak, but it was just so amazing. The first night they also left us a journal that they had hand written a note to us in. The spa was great as well. The couples massage in the Jungle room was great. And the Tezmacul was a moving, unique experience. I took advantage of all the showers, jacuzzi and steam room three times and I never saw anyone else in there. It was as if it was reserved just for me. And it smells great!!!! The outside shower was one of our favorites!! You will never use the indoor shower! You must have dinner on the sand with the tiki lights around you. The food was great. Breakfast was unbelievable. Drinks were strong. Do your self a favor and not pay any attention to how much money you are spending. If you are lucky enough to be at Ikal, truly enjoy the whole experience. Even my husband (who doesn't spend money as freely as i do!) said that it was worth every penny. And on top of everything, we met another couple that we have stayed in contact with and will be life long friends!", "helpfulness": 10, "user": "A TripAdvisor user", "date": "October 27, 2005", "id": 4055714}, {"rating": 5.0, "stay_parameters": "Stayed November 2002", "text": "The only negatives- Use the bug spray they give you in your villa. The sand fleas are terrible. It is rather rocky in front of the hotel. Therefore, either go down the beach a way and it is perfect, or go to the end of the peir and go in from there.", "title": "Late w/ my review, but worth your read...", "helpfulness": 5, "user": "SMUJD07", "date": "October 26, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4053772}, {"rating": 4.0, "title": "No mas tequila por favor..", "text": "Ok, I will stop. I tried to warn you that I would ramble. Please feel free to contact me if you have any questions or need any additional information. email me at: vandenavond1@comcast.net", "helpfulness": 4, "user": "A TripAdvisor user", "date": "October 24, 2005", "id": 4049229}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "Nothing can prepare you for an experience at Ikal del Mar. I looked at countless pictures on the internet, so I had high expectations for the resort. When I arrived on the property, the surroundings literally took my breath away. I had been unbelievably stressed by planning a wedding and one minute at Ikal del Mar washed it all away. As if the beauty of the property is not enough, reception is impeccable. The staff is beyond professional, yet they become your friends. They have perfectly achieved the balance of meeting your every need while building an amiable rapport with each guest as an individual. This staff is in the business of making your stay the absolute best it can be. My husband and I were there in the midst of Hurricane Emily, but the staff made all arrangements for shelter and flights while we sunned on the beach. We have already made plans to return within the next month and we have vowed to make Ikal del Mar an annual tradition.", "title": "The best place on earth!", "helpfulness": 13, "user": "matthewswife", "date": "July 29, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3718831}, {"rating": 5.0, "stay_parameters": "Stayed September 2003", "text": "Two years ago I had won a three night stay at Ikal. I must say at the time I wasn't too thrilled, I had been to Cancun several times and really had no desire to go back. I was jealous of the others who had one trips to London or Hawaii. But free is free so Wooo Hoooo!!! I had invited my best friend and we were going to have our girls trip. Low and behold I met a great guy, and after knowing him only 6 weeks (crazy huh?), I took him instead. Ali, THANK YOU for the your sacrifice and the great friend you are!! I thank God that I took him, my entire life changed! First let me say that this is a far from Cancun as possible, not by distance, but by class!! I had no idea what to expect, which made it even better.", "title": "Words don't do it justice.....", "helpfulness": 14, "user": "ww4007", "date": "July 15, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3670902}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "We drove through a construction site and ended up at a lobby, if you could call it that, more of a walkway with beautiful stone. We were met by Laurence (sp?), who took us through a beautiful maze of walkways through amazing foliage and streams, and brought us to our own bungalow. The entire time, she guided us, pointing out the amenities, my boyfriend and I just kept making eye contact thinking, \"This is absolutely incredible!\".", "title": "The Skinny", "helpfulness": 36, "user": "sixtoe", "date": "July 14, 2005", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "rooms": 5.0, "service": 4.0}, "id": 3664439}, {"rating": 5.0, "stay_parameters": "Stayed July 2004", "text": "The funny thing about this trip is that it rained almost the entire time, and yet it was the best three nights of my life!! OK, OK so you are thinking, it must've been the company I was with, well this is partly true. I think of how my friend and I would have been completely out of place in this incredibly romatic setting. Even love poems were left on our pillows printed on pressed paper, scroll tied with rafia. My new boyfriend and I treated ourselves to a couples massage, again it was raining, but it added to the beauty of it, listening to the rainfall made it even better. At the end of the massage, a beautiful poem was read to us, by candlelight, and she joined our hands, we really haven't let go since.", "title": "Ikal will restore your marriage!", "helpfulness": 9, "user": "csharp59", "date": "July 3, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3633074}, {"rating": 5.0, "title": "Wonderful - almost worth the money!", "text": "We've been madly in love since this incredible trip to such an amazing place. We've since married and are going back next month!!! Not only are we going back, but my best friend is getting married in September and spending her honeymoon there! My parents are also staying there for their 50th wedding anniversary. The best type of marketing is word of mouth!! and I've been spreading the word for the past two years to anyone who will listen.", "helpfulness": 13, "user": "gtgm", "date": "June 29, 2005", "id": 3619814}, {"rating": 4.0, "title": "Nice with some quirks", "text": "My wife & I had our 7 day stay cut short by impending arrival of Wilma - though we did have 5 very nice days. I too had very high expectations based upon my research and other reveiews here and for the most part found Ikal very accomodating and nice - some minuses keep it from my personal highest ratings which go to two other Mexican resorts - Casa Que Canta and Los Alamandas,", "helpfulness": 9, "user": "A TripAdvisor user", "date": "October 20, 2005", "id": 4040805}, {"rating": 4.0, "title": "Top Notch", "text": "The good: VERY well trained and attentive staff. They truly do make you feel welcome and were always available. I like the fact that there are no name tags and they are familiar with you and encourage the same. The servers were particularly good and would come to know your preferences after a day or two.", "helpfulness": 17, "user": "A TripAdvisor user", "date": "September 12, 2005", "id": 3895629}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "Special little touches like hand made soap -carved from upon arrival from large blocks into small bars for you in your room- we had lemon and chocolate - nice touch. The outdoor moon shower is really VERY nice - nothing beats showering outside with great pressure and high end rainfall fixtures - a nice little unexpected luxury in the warm sun on your private back porch.", "title": "Serenity Now!", "helpfulness": 12, "user": "jaffelaw1", "date": "September 11, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3895364}, {"rating": 3.0, "title": "Ok, but not the best", "text": "The spa - very nice and high end - also not heavily used while we were there so they allowed my wife and I run of one side (it is seperate for men/women) by ourselves - nice steam, jacuzzi and 4 different power showers each with different fixtures - vey nice.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "September 9, 2005", "id": 3891727}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "The beds/linens - luxurious, high thread counts comfy and nice. maid service 2x daily was great - they know when you are out of your room as they all have wirelss/earpieces and whenever you return, your villa has been serviced.", "title": "One night is not enough", "helpfulness": 11, "user": "Jackson071004", "date": "August 10, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3752352}, {"rating": 5.0, "title": "Just what the M.D. ordered", "text": "My husband and I just returned from Ikal for a 20th anniversary trip. This was such a wonderful treat. After a disaster trip from San Antonio on Fun Jet where we were delayed 24 hrs. we were met by the resort's driver who had made three attempts to pick us up due to delay after delay. There he was at 4am in his car when our flight was suppose to arrive at 2am. At the resort they quickly got us to our room where there were cheese, fruit, crackers and wine waiting for us since they knew we might be hungry after such an ordeal with the flight. After resting we were delivered the delightful pastries and coffee on our beautiful patio. These little villas are so spacious it is really like having your own little private home. The resort is small and there are not many guests. In fact you can traverse one of their paths and not even see a soul except for the many workers tidying up the place. It seemed at though there were about six workers to every one guest. While on the beach they bring you ice cold towels (literally with the ice often still there) to wipe your face and cool you off. The breeze off the beach and the hum of the waves was enough to put me to sleep for days. Between the morning coffee and pastries and breakfast (complimentary) that could be taken until 11am, we had no need for a lunch time meal. We ate at the hotel for dinner twice. The food was excellent and the service was extraordinary. We ate one day in town and though it was cheaper the quality of food was far inferior. The shuttle went from 4-6:30 and we really didn't see a need to stay longer. Carlos in the office was wonderful in catering to our every need. There was internet available in the office in order to communicate with our four children back at home. They also were very accomodating to bring ice to our room as often as we asked for it. It is all bagged purified ice so we did not experience any gastrointestinal problems so associated with Mexico.", "helpfulness": 11, "user": "12984736", "date": "June 19, 2005", "id": 3576202}, {"rating": 5.0, "title": "Trip of a lifetime", "text": "All in all I would recommmend Ikal Del Mar to anyone trying to get away to a quiet, intimate, small resort.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "June 16, 2005", "id": 3570609}, {"rating": 4.0, "title": "luxury villas but overpriced & average food and drink", "text": "My wife and I just returned from IKAL DEL MAR for our honeymoon.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "June 15, 2005", "id": 3555319}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "We were to arrive on Sunday night after getting married on Saturday but the airline delayed us and we did not get to IKAL DEL MAR until Monday at around Noon. Once we arrived we realized it was more than we had expected.", "title": "The Ultimate Honeymoon", "helpfulness": 6, "user": "phillyhoneymooner", "date": "June 7, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3537892}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "Because he were delayed and missed our first night Abigail gave us the tour, and as we stopped at the spa they gave us four seeds that we were to use to get a great discount on treatments at the spa. They also treated us to a great bottle of wine and a great bowl of fruit.", "title": "Heavenly Honeymoon", "helpfulness": 13, "user": "doodletown", "date": "May 28, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3506501}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 4.5, "variance": {"poor": 20, "average": 32, "very good": 78, "terrible": 11, "excellent": 384}, "aka": "Viceroy Riviera Maya Hotel Playa Del Carmen", "slim_ranking": 0.142857142857, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 5.0, "location": 4.5}, "description": "Located just 35 minutes from Cancun International Airport and three miles from popular Playa del Carmen, Viceroy Riviera Maya is a serene hideaway set on the turquoise Caribbean amid a lush jungle ambiance. As Riviera Maya’s #1 resort in Conde Nast Traveler’s 2011 Readers’ Choice Awards, Viceroy offers world-class amenities, personalized pampering, exquisitely appointed villa accommodations with private patio and plunge pool, refined Mexican cuisine accented with international touches at La Marea and Mexican-Mediterranean fare at the seaside Coral Grill. Mayan influences abound, from the Mayan Blessing performed on arrival by the resort’s Shaman to the Mayan healing techniques offered at the award-winning spa. A Lagoon Pool, private pier, fitness center and traditional temazcal sweatlodge are among the resort’s many other pleasures."}