{"user_rating": 4.5, "review_count": 351, "name": "Viceroy Bali", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "During a trip to Bali earlier this year, a family friend surprised us with a one-night stay here. I have stayed in a lot of top tier hotels during my business trips during my working days, and this place now joins the list. I didn’t expect to have a private pool in the villa, which was a surprise. The shower and huge bath tub are separate so that was nice too. Breakfast is served “any time before lunch” and we could have it in the villa if we didn’t want to go to the restaurant. We really liked the mini coffee machine in the room, like those you see in the bar. This is not something you see often in other five-star hotels. There was also a mini chiller that had non-alcoholic drinks in cans and small packets of milk. The family who owns and manages the hotel were always around for a quick conversation. This was definitely one of our highlights of our Bali holiday.", "title": "Had a totally wonderful time here", "helpfulness": 1, "user": "cruising253", "date": "July 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70240217}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "There are reviews that go around and talk about places being heaven on earth etc. All i will say is that this place is a step ahead of what you want. They never lurk or badger you... it's just done. Its there. They make everything so easy. And you will want for nothing. I've stayed in a lot of really very nice place. This is the most wonderful place on earth. Worth every penny. Just trust me.", "title": "Unforgettable", "helpfulness": 2, "user": "freddiepowell", "date": "July 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70144218}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Our first visit to Bali so wasn't sure what to expect. Read some of the previous reviews on this hotel and was a little troubled to hear about the building work going on. However, their website looked fantastic and it was the best looking of all the hotels we trawled through on the internet. So we decided to book a Terrace Villa away from any noise and received a reply from the hotel to say they would make sure we had such a villa. We need not have worried, there was little if any noise from the building work.", "title": "Breath takingly beautiful", "helpfulness": 1, "user": "possum60", "date": "July 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69829132}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "On arrival we were taken to our villa, Viceroy Regal II; we had been given an upgrade. I wasn't too sure it I wanted this upgrade as we were at the bottom of the slope. However, there were buggies to take you to the restaurant on call any time; we walked up each day however. The villa was glorious and the bathroom stunning. The views of the gorge were amazing and we were even treated to the monkey display (wild ones) on our last night followed the following morning by the monkeys coming to the hotel side of the gorge and playing in the tree in front of our villa.", "title": "Really luxurious", "helpfulness": 1, "user": "Mr_Anderson74", "date": "June 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68601415}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "The hotel staff were amazing and both treatments I had at the Spa were great. As it was a big birthday celebration we went for the degustation dinner paired with wine on my birthday . Everything was just perfect and the hotel produced a lovely birthday gateau which I shared with the other hotel diners. A memorable experience and one I couldn't fault.", "title": "Wonderful resort, it was hard to leave", "helpfulness": 1, "user": "easy_does_it_2", "date": "June 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68310413}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We booked the Viceroy as a reward to ourselves for my 40th birthday and it completely lived up to expectations. We stayed in Terrace Villa 2 and loved it so much we wanted to move in!", "title": "A complete delight - thoroughly recommended", "helpfulness": 1, "user": "starfishjen", "date": "August 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77020270}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Meals at Cascades were delicious and the spa was also a great experience. Otto, Nila and the front office staff were a wealth of information and good humour, helping us to organise our activities and our daily yoga instructor Ketut (also fantastic and highly recommended). They genuinely cared. The combination of activities and relaxation was just what we wanted but the villa really made our stay with the private pool, gazebo and even a coffee machine!", "title": "Several poor points to point out...", "helpfulness": 14, "user": "Tamai", "date": "August 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 75382021}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "As everywhere in Bali, the price of wine was shocking but this is not particular to the Viceroy. Yes, the hairdryers were lacking but this is a small thing. The team there listen intently to feedback so I expect to see this improve very soon. I wavered during booking when I read other reviews about the building works but I can reassure that they are very discreet and don't interfere at all with a wonderful luxury holiday experience. The Viceroy really made our trip to Ubud something very special. We'll go back.", "title": "A little piece of heaven in Bali", "helpfulness": 2, "user": "BaliLover1740", "date": "July 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72900969}, {"rating": 1.0, "title": "BE CAREFUL!! RESORT WILL SCAM YOU.", "text": "My husband and I stayed for 4 nights in Viceroy Bali for our Honeymoon. I was expecting a lot from this Luxurious 5 star hotel, however, I have to admit that it was not our best selection. I wouldn't say it was a total disaster, but there are many poor points that I need to point out.", "helpfulness": 11, "user": "viking011", "date": "July 27, 2010", "id": 72634627}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "- We stayed in a villa called \"Viceregal 2,\" but we could hear the TV noise and the conversation of guests from our next door villa SO CLEARLY!!! We had to call the recepetion to turn off the TV and stop talking every night we tried to sleep. It was around 11PM and I don't think the guests were too loud but every little conversation could be heard due to the structure of villa. So we were too scared to turn on the TV or make a bit of a noise because we knew that the next door would be able to hear us. We also heard construction noise during the day when we wanted to stay in the villa.", "title": "An Oasis in an Oasis", "helpfulness": 1, "user": "AsiaTravellerPaul", "date": "July 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71635344}, {"rating": 5.0, "title": "SECRET TREASURES....", "text": "Is there a word or words that truly describe the sanctuary that", "user": "gt666", "date": "June 14, 2009", "id": 32275678}, {"rating": 5.0, "title": "A treasure in Ubud", "text": "Viceroy is? Absolutely, defiantly not.", "user": "ssdl", "date": "May 31, 2009", "id": 31199002}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Our seond visit to The Viceroy and we were again extremely happy with the experience.", "title": "Second time around - and still amazing!", "helpfulness": 1, "user": "DebJD", "date": "October 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84999367}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "The accomodation, setting, ambience are excellent and we enjoyed having superb breakfasts in the villa each morning while watching the monkeys and mist across the valley.", "title": "Simply stunning in every way!", "helpfulness": 1, "user": "PingBoy", "date": "October 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84949905}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Every meal at their Cascades restuarant was superb - the degustation meals that they offer are excellent.", "title": "BEST HOTEL I HAVE EVER STAYED AT", "helpfulness": 3, "user": "topotunchik", "date": "October 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84660433}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "The spa staff provide the most relaxing treatments I have ever had and the setting is beautiful.", "title": "Paradise", "helpfulness": 1, "user": "Trapped_in_the_City2", "date": "October 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84025712}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We again used their VIP service which is well worth the extra money as you pass through the airport very quickly and hassle free.", "title": "Great resort with stunning views", "helpfulness": 1, "user": "PtheK", "date": "October 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83934045}, {"rating": 5.0, "title": "Loved it!", "text": "This hotel is excellent!", "user": "DebJD", "date": "July 17, 2009", "id": 34975244}, {"rating": 5.0, "title": "Great value, peaceful and luxurious", "text": "The rooms, facilities,restaurant, staff were exceptional.", "user": "culturallattice", "date": "July 16, 2009", "id": 34970546}, {"rating": 5.0, "title": "The Best of the Best of the Best", "text": "We loved our week here in paradise and look forward to a return visit.", "user": "Toronto", "date": "July 6, 2009", "id": 34059810}, {"rating": 5.0, "title": "The Viceroy .. Masters of perfection!", "text": "We stayed in Terrace Villa 3 for three nights. Very spacious rooms... beautiful views. Nice terrace for sitting out on. Quite a spacious pool which was in the sun for the morning.", "user": "URDeAD747", "date": "July 4, 2009", "id": 33895029}, {"rating": 5.0, "title": "Outstanding!", "text": "The staff were great and the shuttle into Ubud more or less on demand was a definite plus.", "user": "mbrain007", "date": "June 28, 2009", "id": 33347083}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "My husband and I stayed for 5 nights in a garden villa at the Viceroy in July. The rooms are beautiful, the staff is very friendly, the grounds seem like something from a dream. It was impressingly bug-free considering we are in the middle of the jungle. We turned our lights off at 10pm to decrease bugs in our bathroom. Our only negative comment about the room was that it would often smell like stagnant water or an old plant. As we had so many other issues (will discuss in section below) we chose not to tell the staff this and hoped it would eventually air-out, which it did not. But, otherwise we absolutely love the Viceroy and found it amazing.", "title": "Luxury in the Jungle", "helpfulness": 1, "user": "vacationfiend", "date": "October 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83471265}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Connectivity to the outside world", "title": "Lovely location, shame about the wedding party...", "helpfulness": 3, "user": "min10000", "date": "September 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 80434435}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "One of my husband's deals \"blew up\" during our stay and he ended up needing to call clients and work on the internet for a large part of our stay. For those who unfortunately need to know about connectivity to the outside world, my husband's mobile phone reception was spotty. I think it has to do with the cloud coverage. Just one level up in the villas (terrace villas) it looked like it worked perfectly. So as his second option, he tried using the villa phone to call out of the country. The staff was very helpful trying to get this to work for us, but it took awhile to get this set up in our room. Eventually, my husband just got his secretary to call our villa to conference him into any calls. Internet speed was very good and pretty reliable. The router broke in the middle of our stay (each villa has its own router) but the staff was very quick at fixing this. As the Viceroy is not a business hotel, I felt they were very accommodating to trying to create a mini-office for my husband.", "title": "Beautiful views, romantic and cozy", "helpfulness": 1, "user": "Dm00re", "date": "September 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79998810}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "Spa", "title": "Fantastic", "helpfulness": 1, "user": "AsianPeregrinator", "date": "September 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 79448915}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "The spa has rooms for 2 ppl which is nice. We did a 2 hr treatment each. Our conclusion on the massage itself was that it was pretty good, but not amazing. What was a total standout was the lulur (flower bath). It was extremely lush and they had the flowers arrange in a design in the water! When I was doing research into Bali spas I did not see any lulurs with that many flowers! It was so nice. The staff was also very polite in letting us play in the flowers for a longer amount of time. They told us to be in there for about 10 min and I think we were in there for about 20-30min and they never interrupted. The next steps were a jacuzzi and steam room which we actually have at our place so we did not spend that much time in those areas thus still finishing on time.", "title": "Enjoyable company retreat", "helpfulness": 1, "user": "thewrightway11", "date": "September 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77946918}], "location": {"country": "Indonesia", "continent": "Asia"}, "stars": 5, "variance": {"poor": 8, "average": 9, "very good": 43, "terrible": 4, "excellent": 287}, "aka": "Viceroy Bali Ubud", "slim_ranking": 0.241071428571, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.5}, "description": "The Viceroy Bali is a family owned resort conveniently situated five minutes from the centre of Ubud and features 25 luxuriously appointed one and two bedroom private pool villas, CasCades fine dining restaurant which serves French cuisine with an Asian twist and the Lembah spa which has a variety of traditional Balinese and international treatments. The Viceroy Bali is a sanctuary in paradise and offers complete privacy with breathtaking tropical valley views."}