{"user_rating": 3.5, "review_count": 36, "name": "Victorian Garden Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "I had a peaceful and relaxing stay at this peaceful little Bed & Breakfast. This was my second stay. The attention to detail was fantastic, including mints in the room! The Gardens combined with the fountains allowed created relaxing environment. The Plaza is within walking distance so I never needed to drive my car. The mission is 1/2 a block away; great restaurants within a block or two. The staff was so accomidating. They were very helpful with places to go, the history of the area, even providing a pick-nick. If you are accustomed to traditional European B & B's, this is the place for you.", "title": "Wonderful Taste of European B & B's", "helpfulness": 1, "user": "Twinb1964", "date": "August 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8523611, "likes": {"liked": "— The accomodations they made for me (I have a siezure disorder). Extra linens, yogurt and bottled water on hand if I needed it.", "disliked": "— I can't think of one....having to leave?"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "We stayed here for a Fri/Sat night. The directions on the Internet were completely wrong and we got very lost, in the dark in Sonoma. When we finally got through the person we spoke to said she was \"tired\" ; we had been up since 5am and we were the customers! Three phone calls later we found it, no night staff to greet us, we had to go on a hunt for the key and then managed to find a restaurant which was nice. It was dark when we arrived, the place was not clean, had a funky smell, the cats kept trying to get into the rooms.. We asked to eat breakfast in the garden, they put us on the private balcony that was dirty and had no view. I tried to discuss this with the owner the next morning but could not find her to complain, she was available for us to pay the bill though.. I emailed her some suggestions and she complained about my suggestions. I did not say it was a horrible experience but the place has a reputation with the locals for being sub standard and I would have to agree. Our breakfast on Sunday was supposed to be at 9am I went looking for them and it arrived at 9:45am which did not leave a lot of time to check out. We got a pot of unperculated coffee the second day. The first day breakfast was tasty, the second day breakfast was heated and then left to sit, the bagels were crunchy! Cobwebs, dirt, and smoke coming in our windows. For 300.00 I think we were ripped off.", "title": "They could use lessons in customer service", "helpfulness": 2, "user": "benzpeople", "date": "July 30, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 8262895, "likes": {"liked": "— close proximity to town", "disliked": "— no customer service and room not clean"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "We stayed at the Victorian Garden Inn for three nights over New Year's Eve. We had two very nice rooms in the main house. The owner, Donna, was very nice and helpful with recommendations on where to eat and visit.", "title": "We had a very nice stay", "user": "kkh", "date": "January 15, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 6599146, "likes": {"liked": "— Charming older home"}}, {"rating": 1.0, "title": "AWFUL EXPERIENCE", "text": "We would stay here again.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "June 6, 2006", "id": 5317071}, {"rating": 2.0, "stay_parameters": "Stayed August 2005", "text": "I had planned a nice retreat for my daughter and I on May 5th and 6th of May..She had never been to a B&B and I wanted to treat her...FOR OUR FIRST EVER GETAWAY...I read all aaboutthis place on the internet and talked to them and they said this was the BEST place..I would hate to see the WORST!!!! They said they had a hot tub..they did..all dirty and sitting behind a filthy gate...they said they had a beautiful pool we could enjoy, no way it was dirty and hadnt been cleaned and not heated...My daughter asked if the pool was heated...and theowner said are you crazy??? ..she said if we want to pay $500 a night would be heated..We decided to take a look inside and immediately we were met and they said give us your credit card so we can get that part out of the way.....It was cluttered with stuff and smelly..We proceeded to go upstairs to the room and walked in and this horrible smell and we immediately opened the window so we could even handle being there..We turned on the light and the socket fell out with the bulb and that was IT FOR ME!!! When asked about the smell (we were going to reall try to give it a go, but come on) the owner proceeded to tell us that their was a weird guy that stayed in that roon a couple days prior..maybe thats the smell...We later found out it was MICE PEE and saw an exterminator entering through the other gate...I love SONOMA abd wanted to share it w/my daughter..WE WERE DELIGHTED TO FIND a wonderful B&B in Kenwood called ABOVE THE CLOUDS...NOW THATS A B AND B..AND ITS BEAUTIFUL", "title": "You can do better elsewhere", "helpfulness": 2, "user": "LarNLaur", "date": "August 31, 2005", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 4.0, "service": 1.0}, "id": 3832046}, {"rating": 5.0, "title": "Highly recommended!", "text": "Loved the beautiful gardens, the small but quite charming room, and the delicious patries and fresh fruit for breakfast. Even the coffee tasted special; I understand it's from Thanksgiving Coffee Company).", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 19, 2005", "id": 3287306}], "location": {"country": "United States"}, "variance": {"poor": 4, "average": 5, "very good": 8, "terrible": 5, "excellent": 14}, "aka": "Victorian Garden Hotel Sonoma", "slim_ranking": 0.6, "description": "Let us spoil you at the Victorian Garden Inn, a historic Sonoma bed and breakfast. Just a short walk from the Historic Sonoma Plaza in Northern California's famed Wine Country, we provide you with the best in Sonoma lodging.A stay at A Victorian Garden Inn offers one the opportunity to step back into another era. Originally built in 1870 as a private residence, it is one of the oldest properties in the City of Sonoma. It was opened to guests as a bed and breakfast in 1983. Surrounded by historic sites such as the San Francisco de Solano Mission, the Sonoma Barracks, and Lachryma Montis, the home of General Mariano Guadalupe Vallejo, the Inn is the perfect getaway to enjoy the history of Sonoma.The Inn is named for its lush English gardens surrounding our historical Sonoma farmhouse. With well-appointed rooms and a comfortable parlor inside, you'll find everything you're looking for in a Sonoma Wine Country bed and breakfast. Our acre of gardens is a great place to relax with a glass of wine from one of our local wineries at the end of a long day enjoying the beauty of Sonoma."}