{"user_rating": 4.5, "review_count": 721, "name": "Victoria Marriott Inner Harbour", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "We stayed here for three nights in March and enjoyed everything about the hotel, from its friendly, helpful staff to our comfortable, immaculate room with a heavenly bed. The standard decorating, typical of a chain hotel, however, may not appeal to those seeking more \"character\" for their stay in Victoria.", "title": "Nice Facilities and Location", "helpfulness": 6, "user": "Rumples", "date": "April 10, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4956997}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "Robes in our room made it easy to head in our bathing suits to and from the good-sized heated pool; its adjacent fitness room contained more equipment than we generally encounter in equivalent hotels. A laundry room (detergent is on sale in the gift shop) is near the pool as is a room with a computer for free Internet access.", "title": "Superb hotel to stay at in Victoria!", "helpfulness": 5, "user": "Sanosuke", "date": "March 28, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4741140}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "The location, about two blocks from the inner harbor, suited our needs. It was easy to walk or catch a bus to nearby destinations. When it came time to go to Tofino on the island's West side, we went to the rental car agencies directly across the street. A bus also goes daily to Tofino and other island locations from a nearby terminal.", "title": "Another great Marriott experience", "helpfulness": 5, "user": "WWUVIK", "date": "March 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4588424}, {"rating": 5.0, "stay_parameters": "Stayed September 2004, traveled on business", "text": "We found the Bengal Lounge in the Fairmont Empress Hotel (about a 5-minute walk away) to be a great place to enjoy a cup of tea and the landmark hotel without spending a large sum on dinner in the Empress Room or for a stay in one of the guest rooms. Willie's Bakery, a small place at 537 Johnson St., was highly recommended to us for breakfast and didn't disappoint for quality. But the portions proved to be enormous. If you go there and aren't a big eater, ask if you can split a plate. Those who enjoy browsing in independent bookstores will find Munro's Books, 1108 Government St., to be a gem. Check out the architecture as well as the books.", "title": "An outstanding hotel", "helpfulness": 10, "user": "ArizonaRoadWarrior", "date": "February 18, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4469115}, {"rating": 3.0, "title": "Very nice, but not outstanding.", "text": "This hotel is EXCELLENT. Had a nice 3 day stay here and I loved every aspect of it! The King size bed in my room was comfy and makes you sleep so easy like you were in heaven, literally! Got the room for cheaper than normal rate on the hotels site. I will be staying here again on my next visit to Victoria, BC!", "helpfulness": 7, "user": "mrsmedina", "date": "February 12, 2006", "id": 4455410}, {"rating": 5.0, "title": "Nice newer hotel", "text": "Victoria is a really neat city in British Columbia, and I would highly recommend the Marriott for people who enjoy newer hotels. Victoria has a lot of older hotels and B & Bs, but my fiance and i really enjoyed our stay there. We had a room on the top floor, which had a gorgeous view of the government building, the harbor, and mountains. The staff was very friendly and service was very good. The room decor was so so, but the bathroom was spacioius and very comfortable. Didn't have a chance to try the hotel restaurant.", "helpfulness": 3, "user": "pjlee1971", "date": "May 15, 2006", "id": 5068889}, {"rating": 5.0, "title": "Great choice for a hotel in Victoria", "text": "As a frequent Marriott customer - this is as good as it gets without staying at a JW Marriott hotel. Quick review:", "helpfulness": 3, "user": "A TripAdvisor user", "date": "May 15, 2006", "id": 5068718}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "Positives:", "title": "Perfect location and lovely hotel", "helpfulness": 2, "user": "TravelLib", "date": "April 26, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5012325}, {"rating": 3.0, "stay_parameters": "Stayed March 2006", "text": "- Great, friendly service.", "title": "Good Enough If Discounted and Excavation Completed", "helpfulness": 3, "user": "TRAVELINGLIFE", "date": "April 26, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "service": 5.0}, "id": 5011857}, {"rating": 4.0, "title": "Good for families with babies", "text": "- New hotel (built 1.5 years ago).", "user": "Cr0ssC0untryTraveler", "date": "April 11, 2006", "id": 4964781}, {"rating": 5.0, "title": "Fabulous New Hotel - We Had a Wonderful Stay", "text": "We had the pleasure of staying 3 nights at this luxurous hotel. Conveniently located in downtown Victoria, just minutes from the Inner Harbour and Parliament Buildings.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "October 15, 2005", "id": 4025603}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "The room was exquisitely furnished with a king size bed, beautiful wood furnishings, and a bathroom that anyone would love to have. Exceptionally clean, great towels, terrific view - what else could you want?", "title": "Nice Hotel & Staff", "helpfulness": 4, "user": "Kurt47", "date": "August 25, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3806071}, {"rating": 5.0, "stay_parameters": "Stayed January 2006, traveled on business", "text": "The Victoria Marriott Inner Harbour is defintely one of the \"new generation\" Marriotts with every conceivable comfort and the service to back it up.", "title": "Marriott- King of the Mountain", "helpfulness": 16, "user": "goldenboy18", "date": "February 2, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4410536}, {"rating": 5.0, "title": "Fantastic Mariott", "text": "I visited Victoria, BC on a business trip last month and was impressed with the property from the moment that I arrived and was greeted warmly by the doorman/bellhop to the time I regrettably had to stuff my bags into the cab for the trip back to the airport.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "January 15, 2006", "id": 4354088}, {"rating": 5.0, "title": "Best Marriott Yet", "text": "The hotel itself posseses a wonderfully understated elegance. From the simple, clean lines and uncluttered space of the marbled lobby to the immaculately clean recreation area with lap pool and steam room. Our room on the 14th floor concierge level afforded spectacular views of the ocean and distant mountain range. From the incredibly comfortable beds with heaps of pillows and feather duvets, to the FREE high speed internet, to the smallest touch like the courtesy umbrellas placed thoughtfully in the closet, this hotel seems committed to meeting your every need.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "December 16, 2005", "id": 4245778}, {"rating": 5.0, "title": "The Perfect Place to Stay in Victoria", "text": "We did have occasion to sample the food in the hotel's feature restaurant Fire & Water. Forget what you think you know about hotel restaurants! This one breaks all the stereotypes. The service - attentive but not intrusive. The food - in a word \"amazing\". Succulent and nicely presented, with a range of choices for everyone (my favourite was the crab cakes! I'm thinking of making a trip over to Victoria from the lower mainland just for these!)", "helpfulness": 5, "user": "tatabob", "date": "November 3, 2005", "id": 4082353}, {"rating": 5.0, "stay_parameters": "Stayed October 2005, traveled on business", "text": "What really makes the Victoria Inner Harbour a stand out hotel however are the staff. I have never stayed at a hotel that has a nicer group of people working for it. I don't know what kind of service training program they subscribe to but every staff member I encountered seemed to genuinely want to go out of their way to assist me.", "title": "One of the newest and best...", "helpfulness": 7, "user": "lcocow", "date": "October 29, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 4069789}], "location": {"country": "Canada"}, "stars": 4, "variance": {"poor": 14, "average": 43, "very good": 238, "terrible": 8, "excellent": 418}, "aka": "Victoria Marriott Inner Harbour Hotel", "slim_ranking": 0.19298245614, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Ideally located downtown Victoria, the award winning Victoria Marriott Inner Harbour is walking distance to all there is to see and do in Victoria. Stroll to the famous Inner Harbour for Victoria attractions, musicians and artisans, and whale watching tours. Our Victoria BC hotel guestrooms feature the kind of luxury you would expect from a Four Diamond Marriott Hotel including feather duvets and luxury linens, deluxe robes, free wireless high-speed Internet and individual climate control."}