{"user_rating": 4.5, "review_count": 972, "name": "Victoria Angkor Resort & Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "This was not my first trip to Siem Reap, but it was by far my most relaxing and dare I say decently luxurious. My stay at the Angkor Victoria Spa & Resort exceeded my expectations for hotel amenities, wining and dining, and a day at the spa. The gracious staff was ready and waiting to be of service from the time I met the driver at the airport, and continuing every day of my stay.", "title": "Treat yourself to something special in Siem Reap", "user": "jimedens", "date": "March 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126898781}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "The hotel is centrally located within a short walking distance to outside attractions such as Pub Street, shops and the Old Market area along the Siem Reap River. Your trip to Angkor Wat is 7 kilometers from the hotel or a short 10 minute drive. Siem Reap town is a bit dilapidated and in need of infrastructure upgrades, but the Angkor Victoria Resort is in good working order. The Colonial French Indochina era design belies the fact that the hotel is only 5 years old.", "title": "a luxury & quite place within Siem Reap", "user": "Rolf S", "date": "March 27, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 126804321}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Happy Hour features half priced drinks and complimentary hor dourness from 5-7 nightly. What has to be one of the best breakfast spreads in Siem Reap is served form 6-10:30 each morning. Fresh squeezed fruit juice, sparkling wine and cappuccino compliment a cornucopia of western and Asian delights. When you feel you want to treat yourself to something special this hotel is certainly a good place to do so.", "title": "The Perfect Getaway!!!", "helpfulness": 1, "user": "Caroline N", "date": "March 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126567031}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "we stayed for 3 nights with 2 adults & 2 boys aged & 7 years in one big room.", "title": "Not a 5 star experience", "helpfulness": 1, "user": "David H", "date": "March 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 126308482}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The nearby & faraway temples are just a great adventure for boys & adults alike, where you walk a lot in hot & humid temperature.", "title": "Great hotel in Siem Reap", "helpfulness": 1, "user": "Mel_Petr", "date": "March 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126209206}, {"rating": 5.0, "title": "Have an \"Indochine\" experience in Siem Reap", "text": "We were here for 5 days and thoroughly enjoyed our stay. The character was distinctly French colonial with features such as open hallways, an outdoor pool enclosed by a lush, tropical garden and old fashioned steel caged elevators indoors. The rooms are spacious and effectively air conditioned. The buffet was excellent. The hotel is adjacent to the Royal gardens which insulates it from the bustle of the city and gives more green space to view from the lobby and entrance. We saw a \"flying fox\" there one morning. There are vintage Citroen automobiles out front contributing to the overall atmosphere. The staff is ever cheerful and helpful and were all quite fluent in English. The concierge arranged a very good driver for the 5 of us to see Angkor Wat and the other temples and a wonderful guide ( Mr. Art Ourn ) for the Prek Toal Bird Sanctuary. We felt that all of the restaurants they recommended for dinner in town were superb. One can easily walk to the Angkor National Museum which is right around the corner. However, if you plan to go to the old market in the heat of the day, I would recommend using a tuk tuk. We toured Cambodia, Laos and Thailand and all of us agreed that the experience we had here was a distinctly wonderful way to start the trip and quite uniquely reflective of the French cultural presence of a past time.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "March 8, 2012", "id": 125826234}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "It had been 12 years since I'd been to Siem Reap and boy, has it changed. This was a beautiful hotel looking like it was set in an oasis. It had a great swimming pool surrounded by lush trees. The room was big and clean with a balcony over looking the pool. The service was excellent. I would definitely stay there again if I was to return. The food in the French bistro was good but expensive and the restaurant was pretty well empty the day we eat there. The only down side is the food in the main restaurant which was mediocre. Better to go to pub street. Happy hour is good though and they had nice free canapés.", "title": "Beautiful hotel in beautiful surroundings", "user": "DocDread", "date": "March 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125595481}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We stayed in ten 5 star hotels on our 3 weeek trip round Indochina, and this was by far the best- in fact possibly my favourite hotel ever! Built in French colonial style in front of the Royal gardens it was the perfect place to wind down after a busy day temple visiting. We stayed in the Plantation Suite, which was huge, with a large balcony overlooking the gardens and pool. It was beautifully decorated and furnished with period pieces, although it had all mod-cons too, including an i-pod, plasma satellite TV,Nespresso machine and kettle, and free Wifi. The bed was so comfortable, and the a/c so quiet and efficient we slept like logs. The bathroom had a good bath, large shower cubicle, 2 basins, and separate WC. There was also plenty of wardrobe and cupboard space. I loved the gifts left every night at turndown- spices, keyrings balm etc.", "title": "perfection", "user": "Levoyageur", "date": "March 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125551594}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "The breakfast was excellent with a huge choice of Western and Asian foods, hot and cold. I appreciated the chef who spent all morning juicing oranges- and the omelettes were superb too", "title": "The only place to stay!", "user": "Richard G", "date": "March 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125520756}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The swimming pool was large, crystal clear, and a great place to cool down. It was set in pretty gardens, with adequate sunloungers and umbrellas. We ate lunch there once and the food was good, and the pool bar service swift.", "title": "An Oasis in the middle of Siem Reap", "user": "JenniferAnne97", "date": "March 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 125476345}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "We stayed 4 nights as part of a tailor made trip to Cambodia and Vietnam. The hotel was a charming, low rise building with many colonial features. Our enjoyment was no doubt coloured by an upgrade to a huge suite but nevertheless the hotel, pool, Happy Hour with canapies, breakfast on an outside terrace and lovely staff made for a perfect stay.", "title": "Delightful", "user": "TheSKIers", "date": "March 14, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 126077962}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We visited the temples early in the morning when it was cool and quiet and returned for breakfast. We used the hotel Tut Tuk at $1 to anywhere in town and$10 for a morning at Angkor.", "title": "Solid choice for Siem Reap", "user": "Casa62", "date": "March 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126074613}, {"rating": 4.0, "stay_parameters": "Stayed February 2012", "text": "Our room was on the ground level with an enclosed courtyard garden. It was quiet and comfortable, well appointed. The public areas have an nice ambience, love the little crocodiles and fish in the central pools.", "title": "Best down time location in Siem Reap", "user": "familytraveller123", "date": "March 12, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 125983810}, {"rating": 1.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The pool is a centrepiece here and great for cooling off but smoking is allowed and its not pleasant to be downwind from a cigar smoker!", "title": "Awful", "helpfulness": 3, "user": "Alan D", "date": "March 12, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 2.0}, "id": 125970285}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "This hotel is a short ride from Pub Street and there are many willing tuk tuks to whisk you there. The affable Mr Rabo No. 9 was there every night to take us to dinner.", "title": "Paradise among the temples", "user": "Kenmar5", "date": "March 11, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 125918441}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "This hotel is very pretty. The pool area is gorgeous. The rooms are nicely appointed & are a nice size.", "title": "Beautiful Property", "user": "gayler104", "date": "April 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127091598}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "This hotel just hits all the right notes. The atmosphere is very relaxing, spa and pool good, food (especially breakfast) excellent and rooms spacious. It's a really comfortable base for exploring the local sites.", "title": "Relaxing place for temple hopping", "helpfulness": 1, "user": "TroakesTravellers", "date": "April 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127082655}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled solo", "text": "Some small points that we thought require attention. Firstly, the price for bottled water was extremely high and it felt exploitative - rethink please. Secondly, the service in the bar could be extremely slow, for no obvious reasons: what are they all doing behind the scenes?", "title": "The Perfect Oasis!", "user": "Adelmelb", "date": "April 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127062516}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "I stayed at the Victoria Angkor Resort & Spa for 3 nights in January and it was a fantastic experience. I had been in transit for about 15 hours so when arriving at the airport and my transfer being there ready for me, it was a great relief as all I wanted to do was get to the hotel and relax. Upon arrival at the hotel I was greeted by lovely smiling people who were so very helpful carrying my really heavy bags. Check in was quick and I was soon in my room, which was on a higher level and facing the pool as requested. I booked a Victoria Deluxe room and it was perfect... nice comfy bed, great size and furnished very nicely.", "title": "An Oasis in a Busy City", "user": "wally434", "date": "March 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126968208}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "I ate at the hotel for nearly every meal and the food was amazing and very reasonably priced. If you are heading out early to start your temple hopping, make sure you ask the hotel to prepare you a breakfast basket to take with you... I did this and ended sharing it with the others on my tour as there was soo much food.", "title": "Best hotel for us.", "user": "Loshalp", "date": "March 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 126924472}], "location": {"country": "Cambodia", "continent": "Asia", "city": "Siem Reap"}, "stars": 4.5, "variance": {"poor": 10, "average": 21, "very good": 212, "terrible": 4, "excellent": 725}, "aka": "Victoria Angkor Resort And Spa", "slim_ranking": 0.0865384615385, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Explore the World Heritage Angkor Temples and immerse yourself in the Khmer Empire. Located next to the King's Residence, overlooking the Royal Gardens, discover the Victoria Angkor Resort & Spa, inspired by 20th century colonial architecture and design. Situated ten minutes from the Angkor Vat, the hotel provides a sense of serenity with the nostalgic comfort and elegant refinement of the French Art de Vivre."}