{"user_rating": 3.5, "review_count": 114, "name": "Vier Jahreszeiten Hotel", "reviews": [{"rating": 5.0, "title": "Wonderful time at Vier Jahreszeiten", "text": "We arrived June 8, 2004 stayed 3 wonderful days. This hotel is nestled in a quite area. We awoke not to the noise of traffic but the sound of birds. Large bedroom with minibar & goodsize bathroom(also has a quaint elevator). The staff was so helpful and friendly. There is an italian rest. next door but there is ample eating areas just walking distance away. We could walk to the Mirabell gardens in about 5 min., and cross over the bridge to center of Salzburg. I highly recommend this place. We knew of other places that were more expensive but we received a better stay at this hotel. The breakfast was delicious. If we ever go back to Salzburg, this is the place I would stay at.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 27, 2004", "id": 2225149}, {"rating": 5.0, "title": "Close to Mirabell Palace & Gardens", "text": "We stayed here for two nights in April 2004. The first thing that struck us, was the friendliness of the staff. We were given maps, tips on where to eat dinner or have a coffee etc. Our Sound of Music tour was booked there and then which was great. The rooms were very spacious, clean and very comfortable. The breakfast was slightly limited however, but all in all it was a very pretty hotel and the staff were excellent.This hotel is literally about 5 mins walk to the Mirabell Gardens and Palace. Everything in the city is in within easy walking distance and the local people are very friendly. I would definately recommend this hotel - I'm sure that there is air conditioning available here but as we were there in April we didn't need to request it - you may want to mention this when booking. It also only cost 45 euro per person per night to stay which was so reasonable for such a good quality, centrally located hotel.All in all this was an excellent stay.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "May 4, 2004", "id": 1868509}, {"rating": 5.0, "title": "Great for after ski relaxing!", "text": "Flew out to salzburg on cheap ryan air flights and booked this hotel on the net so didnt know what to expect. Room was very nice and reasonably equiped for the price, staff were very helpful and friendly and most importantly it is very close to mirabell square where the snow shuttle runs from at 8.20am every day! If you want to ski/snowboard it cost us about 75 euros a day for snow shuttle/board hire/lift pass.There is also a really good italian restaurant next to the hotel which i would definitly recommend!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "January 20, 2004", "id": 1559584}, {"rating": 4.0, "title": "Comfort and convenience", "text": "Fairly small hotel, very friendly and welcoming staff and atmosphere. Comfortable fairly well-specced rooms. Good value breakfast. Nice Italian restaurant on the ground floor is good value. Convenient for all parts of the city and tours. Excellent local market right outside (Thursdays). We would definitely go again.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "November 5, 2002", "id": 739661}, {"rating": 1.0, "title": "Be careful", "text": "I booked this hotel for 3 nights and after canceling my trip to Europe i canceled my hotel booking and I received comfirmation from the hotel receptionist. That was about 3-4 months ago. I just received my credit card statement and I was shocked to see that I've been charged for 3 nights stay at this hotel. Lucky I still had the cancelation email which I received from them. I contacted the hotel and I got an apology and the ammount reversed to my credit card, but by the time they did the reverse our dollar got bit stronger and exchange rate wasn't in my favour so I was at small loss. I didn't bother contacting them again, I think what would have happen if I didn't have that e mail saved and I never got an answer why they charged me for 3 nights. Even if I didn't never canceled all hotels should charge first night stay,not all 3 as I booked.", "helpfulness": 6, "user": "nireno", "date": "November 3, 2004", "id": 2804723}, {"rating": 4.0, "stay_parameters": "Stayed September 2004", "text": "Hotel is very suited for Salzburg where everything is very old and quaint. The room was small, but you cannot expect a high-rise sheraton in Salzburg, the room size was well suited for the building. What made this hotel worthwhile were the staff and the breakfast. The staff recommended some great restaurants and were helpful with directions. The rooms were very clean and the location is great. The hotel is walking distance from everywhere, including all the major attractions.", "title": "Nice hotel in a beautiful city", "helpfulness": 8, "user": "AnGkyr", "date": "November 1, 2004", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 2800529}, {"rating": 2.0, "title": "dated rooms", "text": "Spent at Hotel 4 Jahreszeiten 5 days in June. I was rather disappointed by the quality of the rooms. In particular, the bathroom was dated and lacking serious water pressure, while the bed room decoration seemed like a random collection from a car boot sale. Although staff were friendly and the breakfast buffet excellent, I would not rate this hotel above 3 stars.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "October 4, 2004", "id": 2618952}, {"rating": 5.0, "title": "Brilliant for the single traveller", "text": "As a visitor to the music festival and travelling alone I wanted to find a good hotel. The room I was given was ideal - not the usual box allocated to single people. It is ideally situated for easy access to the town centre and just behind the beautiful Mirabel Gardens. The breakfast is excellent with lots of choice. The staff do everything they can to be welcoming and kind and helpful. The restaurant is good with an Italian chef and reasonably priced. The Thursday market is held in the street and is worth a look. When I return next year, this is the hotel I will choose and will recommend to anyone else.", "helpfulness": 7, "user": "JackieHalifax_12", "date": "July 31, 2004", "id": 2347304}, {"rating": 4.0, "title": "super stay", "text": "We were allocated this hotel because the one we wanted was unavailable. Situated in a quiet area of town and very close to the Mirabelle Gardens and a short walk to the old city it is an ideal base. The rooms were quite basic and the bathroom small but there was plenty of wardrobe and cupboard space and it was very clean. The staff were friendly and could not have been more helpful or welcoming. The breakfast room was a delight with the most wonderful spread each day of things to eat. We were told breakfast would be cold buffet only but there was also bacon and scrambled egg provided. There is a lovely Italian restaurant adjoining the hotel and the food and service excellent. I would certainly stay here again and recommend it to anyone who wanted a small friendly place to stay with good food.", "helpfulness": 5, "user": "Lorna B", "date": "July 18, 2004", "id": 2305511}], "location": {"country": "Austria", "region": "Austrian Alps", "continent": "Europe", "city": "Salzburg"}, "stars": 4, "variance": {"poor": 8, "average": 22, "very good": 54, "terrible": 7, "excellent": 23}, "aka": "Vier Jahreszeiten Salzburg", "slim_ranking": 0.398550724638, "description": "Late 19th century building renovated in 1993; multilingual staff & an in house restaurant & bar; near the main train station."}