{"user_rating": 4.5, "review_count": 87, "name": "Vila Joya", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "My husband and I celebrated our honeymoon at Vila Joya as part of a multi-stay European trip. It was absolutely fantastic and we cannot wait to go back!", "title": "Absolutely outstanding!", "helpfulness": 3, "user": "NicoleandKyle", "date": "September 22, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 20290146, "likes": {"liked": "— amazing dinner, gorgeous views and scenery, romantic atmosphere", "disliked": "— price, bed linens and towels"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Upon arrival, we were treated to a glass of champagne - perfect for the weather! Our room was ready and all of our bags were brought up quickly. Upon entering the room, we saw fresh flowers everywhere, a complimentary bottle of champagne, and a heart made of rose petals on the bed. Our room was small, but comfortable and we loved the balcony looking right out at the ocean. The bathroom was nice too, although I almost flooded the place the first time as the shower curtain is not a full one.", "title": "Shhh keep it quiet", "helpfulness": 5, "user": "r21442", "date": "August 18, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 19091062, "likes": {"liked": "— Spa, food", "disliked": "— Basic rooms a bit cramped"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "I cannot say enough good things about dinner - the food was phenomenal and absolutely out of this world. Breakfast was fairly standard and nothing to write home about. We never had lunch at the resort as we preferred to go exploring and try somewhere along the way.", "title": "Vila Joya is a joy", "helpfulness": 9, "user": "YYZGuy99", "date": "July 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8109237, "likes": {"liked": "— The evening meal is to die for.....", "disliked": "— disco music that emenated from the beachside cabana area on occassion"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Bed linens could use an upgrade, along with the towels used. Not high quality, but were fine.", "title": "A Sublime Experience!", "helpfulness": 19, "user": "Banyan", "date": "May 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7645730, "likes": {"liked": "— amazing food, location, + accommodation. Amazing, well trained staff", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The gardens are amazing and so relaxing to spend time in. We did the couples spa package and we thought it was amazing. We are Americans so a bit shyer than Europeans - as we were surprised when we were invited to go in the open air jacuzzi in nothing but a paper thong...while people walked by and could get a great view....but maybe we're just not used to that.", "title": "A little piece of paradise", "helpfulness": 4, "user": "GillHalifax", "date": "April 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7484434, "likes": {"liked": "— luxury and quality"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "This hotel is an Oasis in the Algarve, which is often associated with the wrong sort of tourism. It has its own secluded beach, all fabulous 14 rooms face the sea, the decoration is an Algarvian-Moorish style, which is cool and bright, the service is attentive (its PR is quite something) and food is state-of-the-art. This hotel happens to have the only 2-star Michelin restaurant in Portugal and is worth every star, very inventive and tasty cuisine indeed, even though we thought the sommelier still has a lot to learn about world wines and for an 8-course gastronomic menu each course should have been a bit smaller (we could not eat the last two courses, which was a great shame). This restaurant, although quite expensive for Portuguese standards, is still thin its category's prices, and as it is practically full every day it's worth booking ahead. All tables are at the terrace facing the sea, if the weather is good (which happens 10 out of 12 months). The hotel's room prices include breakfast and dinner, which is very good value. If you want to adventure out of this fabulous hotel, there is a gorgeous beach outside called Praia Gale, it is quite a stretch of a white sandy beach and not too busy. If you like luxury, a romantic setting and excellent cuisine this is your place, but make sure you can afford it...", "title": "Romantic break", "helpfulness": 12, "user": "AlexJones", "date": "May 30, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 5236148}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "This hotel is undergoing somewhat of a transformation at the moment. An already fantastic property and location with the only two michelin starred restaurant in Portugal, it already has unrivalled exclusivity in the Algarve. Owner Joy Jung is adding probably the most renowned SIX SENSES spa to the property and is reducing the number of suites to 14. The suites are without exception beautiful and amazingly appointed. Bang & Olufsen CD player and TV and unguents by Molton Brown. Our Royal Suite 2001 was simply breathtaking..totally over the top luxury..FENDI furniture..a huge round four seater tub with star lighting over head and a huge terrace with tables and chairs and sun loungers. The view was the best I have ever seen..and I have stayed in some fantastic hotels. This is a real and much needed departure for an Algarve that has rested on its laurels for too long. If you are serious about food and staying in ultimate luxury coupled with extremely charming and sophisticated service, then I urge you to visit. The room rate currently includes a fabulous continental breakfast ( no dodgy croissants here!) AND dinner for two. The menu as you would expect changes every night. Despite worrying about dining at the same venue every evening, it was a true pleasure. Why would you want to dine anywhere else when it simply wouldn't be anywhere near as good..Or with that incredible view. Residents are mainly German ( as Joy and her family are German and have owned this property since the late 1970's) couples and few families. My husband and I and young son were made extremely welcome...the suite was perfect for us as it has its own entrance to the gardens and was next to the restaurant terrace..making life easy at breakfast time and for listening out during dinner. The beach front location is beautiful and again kept our son very happy indeed. If your little darlings aren't used to leaving beautiful ornaments/furniture alone, you might spend the whole time worrying what might get broken...there are also lots of steps down to the garden and pool and beach..and no lift...this is a minor difficulty.", "title": "Exlusive resort in the Algarve", "helpfulness": 31, "user": "Mia3", "date": "May 25, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3499370}], "location": {"country": "Portugal", "region": "Algarve", "continent": "Europe"}, "stars": 5, "variance": {"poor": 3, "average": 8, "very good": 6, "terrible": 1, "excellent": 69}, "aka": "Vila Joya Hotel", "slim_ranking": 0.0666666666667, "description": "One of the top 5 star hotels in Algarve, Vila Joya resembles a small oriental palazzo and is nestled in a breathtaking garden setting on a cliff with stunning views facing the sea. Winner of the 2009 World’s Leading Boutique Resort Award, this Albufeira beach resort also boasts one of the top Michelin Restaurants in Portugal and features luxurious spa resort accommodations, exclusive golf packages, and rejuvenating body treatments."}