{"user_rating": 3.5, "review_count": 937, "name": "Villa del Palmar Beach Resort & Spa", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "I stayed at Villa Del Palmar from December 27, 2009 to January 3, 2010. I picked this report because of the pool, location and small kitchen. Before going I read just about every review out there and had a pretty good idea as to what to expect. I won’t go into great details about my stay but I will hit on the key points. Check in was easy. We arrived at 4:00pm and were told our room wasn’t ready. They had us sit in the lobby and wait for about 30 minutes. Just as others said, they tired to sell us a timeshare, since I look younger for my age I just told them I wasn’t 28 years old and not married and never heard from them again. Our room was in Building 3 Floor 5. Not much to see from where we were located but I was just happy to be in Building 3 and not by the noisy street.", "title": "Just about what I expected", "helpfulness": 1, "user": "jaynic_09", "date": "January 4, 2010", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 52597554}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Some key points about our stay:", "title": "Extremely rude and unfriendly staff", "helpfulness": 1, "user": "MoBo328", "date": "January 4, 2010", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 4.0}, "id": 52547114}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "1) Our room smelled, really bad, best described as the smell on the Disneyland’s Pirates ride.", "title": "Pretty consistent over the years", "helpfulness": 2, "user": "chicagotoots", "date": "December 22, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 51679545}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "2) Major water problems in our room, a couple of times I was left mid shower with no water coming out.", "title": "Very nice resort, on the beach, nice pool", "helpfulness": 2, "user": "hollydancer", "date": "December 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 51634182}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "3) There was dust everywhere. Housekeeping does basic cleaning (sweep the floor, change towels, make beds but that’s just about all)", "title": "Great combination and of resort and local fun", "helpfulness": 4, "user": "dcbizzyizzy", "date": "December 5, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 50711646}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "90% retirees with grandchildren in tow. Way older demographics than anticipated. Certainly would not recommend it to young couples. I'm in my forties and felt like I was visiting Grandma's house. Word of warning to RCI members - at check-in, when they realize you are RCI people you will be treated like second class citizens. They told us our room would not be ready for at least an hour - give me a break. Then they put us in the older section by the quiet pool - this is actually Villa del Mar - but they don't tell you that. The rooms are not updated at all in this section. We said no to visiting FLAMINGO'S. They were relentless. The phone rang every single day asking us to go so we could get our VIP card. No matter what, they kept calling. The food and drinks were a joke. How could you screw up a cheeseburger!! Tried several different drinks - all watered down -- way, way down. (To the point of almost being tasteless.) I'm sorry to be such a Debbie Downer, but as Palace Resort Premier Members I never realized how spoiled I was. Palace Resorts are gorgeous, modern and surpass this place in every way. PV is a slum. There is a homeless park directly across the street in front of the resort. Never again!!!", "title": "VPD-Retirement Home", "helpfulness": 2, "user": "ChampagnePrincess", "date": "January 27, 2010", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 2.0, "service": 5.0, "rooms": 2.0}, "id": 54507800}, {"rating": 4.0, "title": "Great", "text": "Would like to start off by saying this is a great hotel. The staff could not be more helpful. The hotel was kept spotless at all times. we had only a couple complaints to get a drink at the hotel was terribly expensive $10.00 for a margarita, and if you wanted to go to any of the special nights like the beach party etc was about $80.00 a couple, You do get a VIP card which gives you 20% off at the hotel and the little Market. The only problem when you try to use it at the market you have to charge it to your room. WE like to pay as we go and this charging to the room I do not like. Well as I said at the start this is a great place just keep in mind these minor things and do not let them ruin your trip", "user": "bubby2", "date": "January 26, 2010", "id": 54464451}, {"rating": 2.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We are/were time share owners at the Flammingo's Villa Del Par Mar for the past 5 years. For the 2nd straight year we were unable to reserve a room at the Flammingo's and stayed at the resort downtown. Last year was bad, this year was the worse. We complained everyday when we had no hot water, or no water at all and they each time they would send someone to the room and each time they would say \"thats just the way it is\". In our second week we had enough and had to be very firm when we asked for a different room or for them to send us to a different hotel. The rooms smell old and musty, mold in the showers. The food was ok, expensive. We either cooked our meals or went downtown to eat. Location is good and that is about it. We sold our timeshare while we were down there this time, we've had enough.", "title": "Good Bye Villa Del Par Mar", "user": "getaway_us", "date": "January 26, 2010", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 54390816}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "After just spending 8 nights at Villa del Palmar Flamingos - we felt a real let-down as we checked into the Villa del Palmar in the Hotel Zone in Puerto Vallarta. There was nothing really wrong with it - except that after being in newer, larger and having a spectacular water view - the 2nd floor looking out toward a restaurant roof and all the resort activities (and noise) was not great. We decided we would never stay here again when there are so many newer (and on great beaches) places in Nuevo Vallarta.", "title": "Doesn't measure up to Villa del Palmar Flamingos - Nueva Vallarta", "helpfulness": 1, "user": "GetMeOutOfTheNWRain", "date": "January 16, 2010", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 53634560}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The activites noise was all day & late into the night - they were usually talking through a microphone - tons of kids and people \"saving\" the chaise lounges starting before the sun came up. This place needs to implement the policy they have at their Flamingos location (where the chaises are tagged with a warning) which is 1 hour and then your stuff is picked up by the pool guys. It would allow more people to use the chaise lounges.", "title": "Mold problem", "user": "WalktheBeach19", "date": "January 14, 2010", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 53496432}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We arrived Jan. 5th, 2010 for a week with a reservation for a studio. We are timeshare owners in Cabo San Lucas and traded for this property only because we like PV better than Cabos. We are on a \"trial ownership\" for 2 years to see how we like belonging to the Villa Group. It seemed logical to us, that if one sold someone a temporary Gold ownership, that one would do whatever it takes, within reason, to impress that party in hopes that they contract for a permanent ownership when the temporary was expired. Well, our reasoning was way off. We arrived in the late afternoon only to discover that a studio (not an upgrade to a 1 bedroom) was indeed held for us, but it was on the 1st floor in front of the pool. Well, if you read the previous reviews, you have heard how noisy the pool area is. This really burned us because we booked our room 7 months prior. We inquired as to where we could be moved to (offering to pay for an upgrade)and the options only got worse (main building facing the street)and that they had no open 1 bedrooms. We asked to speak to the manager and she offered us a 1 bedroom (that magically appeared) and had the bellman take us to room 409 and 410. Huh? (We are married) These rooms are at the older Villa Del Mar. The catch was that it was two seperate rooms, one being a bedroom with a bath and the other a kitchen/livingroom/bath that were connected by a terrace. So, we had to go outside each time we wanted something from the other room. This was a little strange and got on our nerves after a week, but it was nice to have the 2 full baths and the very large LR. Needless to say, we did not go to the \"meeting\" (sales pitch) that they insisted we needed to attend. They are hardcore sales people to the point of rudeness and they start the second you get there. You cannot even go to your room before they insist on setting up an appt with you to see the new Flamingos. This is not smart when you are dealing with people who are tired with jet lag and only want a drink and a lounge chair! Everyone in the lobby is trying to sell you a timeshare at the Flamingos. Just don't go if you are not interested.", "title": "Pleasant, but nothing special", "user": "travelobsessive", "date": "January 14, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 53483334}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "Pros: if you are looking to relax and do not like noise, stay at the Del Mar. The pool area was MUCH quieter and less crowded. Breakfast buffet was very good. Also had 1 lunch and 1 dinner there..they were fine. Gym was good and uncrowded. Waitstaff and housekeeping were exceptional. Taxi service very good.", "title": "Nice family property", "helpfulness": 2, "user": "L0VE2G0", "date": "January 13, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 53421340}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "Cons: Palmar pool was insane. Noisy and active. Loudspeakers often. Do not accept a pool facing room unless you like that sort of thing. Beach was annoying due to the constant interruptions by vendors pushing their wares. Hang out at the Del Mar pool. Del Mar building A (where we were) had water issues more than once (no hot water and no water at all) but, it is an older building and it was rectified fairly quickly.", "title": "Great Family Hotel", "user": "Happyone69", "date": "January 11, 2010", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 53212042, "likes": {"liked": "— Large accomdations with full kitchen", "disliked": "— In our bedroom there was an exit door that faced lobby - noisey at times"}}, {"rating": 5.0, "title": "Villa del mar rooms at villa del palmar", "text": "Overall, we were a little disapointed at first because of the room situation, but we ended up enjoying the place. But if we go back, we will return to the Villa Premier, which is where we stayed in Jan 2009. Loved it!!", "helpfulness": 2, "user": "SusanM15", "date": "January 10, 2010", "id": 53089846}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "First trip to Puerto Vallarta. The airport is in the north end of Puerto Vallarta and a 10 minute trip by taxi to Villa Del Palmar. Walking through the PVR airport was like running the gauntlet - aggressive timeshare salespeople. The \"real\" taxi company representatives have a big tag around their neck that says \"taxi\" and are at the actual exit to the airport terminal building. We paid $18 USD flat fee to Villa Del Palmar. ($80 pesos on the return flat fee). VdP is at the north end of the Hotel Zone and a 15 minute walk north to the Marina. Villa Del Palmar consists of three buildings in a U shape that create the courtyard which two pools, three hot tubs and two restaurants are housed. The beach is very swimmable and has a roped off swimming area. Soriana grocery store is about a block away south and could be compared to a 30,000 sq. ft. Superstore. It sold groceries, baked goods, meats, liquor, electronics, clothes, shoes, and appliances. Walmart and Sams are about 25 minute walk north.", "title": "Look no further, you have found home!", "helpfulness": 6, "user": "Rzukes", "date": "January 7, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52878650}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "After a terrible experience at Fiesta Americana, we relocated to Villa del Palmar and were relieved to find our clean, large room with a kitchen area and fridge. Comfortable bed. It's not fancy, but it was exactly what we needed. There's a little shop nearby, so that was handy. The atmosphere by the pools and the beach was relaxed, friendly. They had hot tubs and a nicer pool than F.A.. I only wish we had stayed here from the beginning of our trip.", "title": "Nice atmosphere, good price", "helpfulness": 3, "user": "gunner77", "date": "December 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 50593247}, {"rating": 3.0, "title": "Don't trade \"down\" to this property", "text": "If you are a timeshare owner at a Hyatt, Marriott, Starwood or Four Seasons, you will not be happy here! We are truly surprised that it is listed as a gold property in Interval International. We were very disappointed.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "November 29, 2009", "id": 50277564}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled solo", "text": "We went with our friends for Thanksgiving week. We reserved two one-bedroom units. Upon arrival, we were \"assigned\" a tour person who is actually a timeshare salesman for the Villa del Palmar sister property, Flamingos, in Nuevo Vallarta, which I will admit is a much more beautiful resort. Our intent was NOT to do the presentation, but when they offered to \"pay us\" with a $50 resort credit, two bottles of tequila, free breakfast, and a VIP card which entitled us to 20 percent off all resort charges, we figured it would be fun . . . and it was as we got to see a little of Nuevo Vallarta for free! We did have to put up with a high-pressure \"closer\" who wanted us to trade in our Hyatt weeks (we have two) for one in PV. When we would not say yes, he abruptly showed us the door.", "title": "Like being home again!", "helpfulness": 1, "user": "katnsocal", "date": "November 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50230945}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "Our one bedroom units were dank and very tired looking. There is no real kitchen, just a kitchenette with two burners, a microwave and a medium-sized refrigerator. It is definitely NOT the kind of kitchen in which you would want to cook a meal. More importantly, there is no dishwasher, so you have to wash your dishes by hand. There is a sign which tells you that you have to wash your own as housekeeping does not do them. We washed all our dishes BEFORE we used them - no telling how carefully the previous occupants cleaned them, or maybe just rinsed! Scary! The bedspread on our master bed was stained on the inside and the pillows were lumpy. The bathroom was sufficient - only a combination tub/shower and the shower curtain blew in on us everytime we showered. The vent in the bathroom did not work very well at eliminating the steam from the shower and we had to wait for the mirror to unfog. The TVs are not plasma, probably not even from this decade! The pull out couch was so uncomfortable that we didn't dare spend any time in the living area, and the patio has only a small table and four very uncomfortable plastic chairs.", "title": "Villa del Palmar ...exceeded expectations by far !", "helpfulness": 2, "user": "George2011", "date": "November 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 50045599}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The resort itself is fairly dated, even given the \"construction\" previous posters have discussed. The construction was for the main pool deck only and it was completed by the time we arrived. The lounges at the pool have a mind of their own. They are not very comfortable and not padded. You have to keep track of your pool towels as they give you a little slip of paper that you turn in at the beginning of your stay and have to get back before you check out or they will charge you! The main problem with the pool area is that it is noisy. There are several planned activities throughout the day, and the \"DJ\" is always on the loud speaker \"encouraging\" participation. They have water aerobics, Bingo, Lazy Game, Tequila Water Volleyball . . . the list goes on. They really \"whoop it up\" all day long, not to mention the pool servers who don't give a minute's piece without asking if you want something or announcing \"2 for 1 happy hour\" several times per day. You might think you are getting a great deal, but the truth is, the drinks are so watered down you won't even get a buzz!", "title": "Don't believe them this place was great", "helpfulness": 3, "user": "Kat_NH2009", "date": "November 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49710902}], "location": {"country": "Mexico", "city": "Puerto Vallarta"}, "stars": 3.5, "variance": {"poor": 106, "average": 167, "very good": 314, "terrible": 71, "excellent": 279}, "aka": "Villa Del Palmar Beach Hotel Puerto Vallarta", "slim_ranking": 0.275862068966, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.0}}