{"user_rating": 4.5, "review_count": 399, "name": "Villa Casanova", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "We stayed here for one night on the way to a cruise. I had worried that it was not on the main Venice peninsula, but we loved the Lido for being quiet, better value and yet very close by water bus. The hotel was great, very friendly and helpful lady who spoke excellent English. It is in a quiet road and yet close to everything. The room was good sized and quite modern, also quiet. One interesting thing was that we were woken at 4.00am by an earthquake which rocked the bed quite violently and started the chandelier swinging! If we return to Venice. Breakfast was excellent with a good selection. there is also free wi-fi. I will definitely choose this hotel again, for its location and quiet gentility. i really fancy borrowing one of their bikes and exploring the Lido.", "title": "Lovely friendly hotel", "helpfulness": 1, "user": "ChrisRugby", "date": "June 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 132357387}, {"rating": 4.0, "title": "Lovely Place to Stay in Lido", "text": "I stayed at Villa Casanova in Lido with two of my friends last week. It was lovely staying in Lido. Villa Casanova had a wonderful breakfast spread, nice rooms, very pleasant staff and great location. We stayed in a triple room. My friend that slept on the small twin bed said that it was quite uncomfortable. But apart from that, our stay was great. I would recommend it.", "user": "njweee", "date": "June 19, 2012", "id": 132320176}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Having seen all the good reviews for this hotel we decided to make it our base for a 4 night stay in Venice. Its very easy to get to - take the Alilaguna boat from the airport to the Lido and then a five minute walk - the directions provided by the hotel were excellent. We really liked staying on the Lido - it was quiet and cheaper than the main island, but it only took about 15 minutes to get to St Marks Square by vaporetto.", "title": "Great B & B", "helpfulness": 2, "user": "travelfanaticsUk", "date": "June 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 131921217}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "We had a 'Romantic' double room with a 4 poster bed (which was a bit on the hard side) The room was fine - two sets of windows, both of which opened and had shutters on the outside. The air-conditioning worked well and was quiet. There was a safe and a mini-bar (which we used to sure our water). There was enough storage space. The bathroom was fine - nice tiles and bathroom suite, tho' some of the wood was a little tired (cabinet & door). There was a bath and in-bath shower. The water was always hot and plentiful there were plenty of towels.", "title": "Marina e Alessandro at Villa Casanova, Lido, Italy", "helpfulness": 1, "user": "Van Steenbergen K", "date": "June 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 131804462}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "There was a lovely garden with seating where it was nice to sit in the early evening (tho' bring mossi-repellent as there are a few about). No-one minded us having wine, other drinks and snacks out in the garden either.", "title": "Special little getaway in Lido!", "user": "KAndreae", "date": "June 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131568165}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Thia is a fabulous homely B&B on the Lido. It is a five minute walk to the water taxis where you can get across to Venice in approx 10 mins. Our room was modern /spacious with ensuite bathroom.The breakfasts were as good as you would get in a 5* hotel. Our host Alessandro gave us all the information we needed for getting around and helped to make our trip to Venice one we will remember for a long time.", "title": "An excellent base for a perfect holiday to Venice", "user": "Elaine_CExeter", "date": "February 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124812664}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "This was our third time at the Villa and, as on the previous two occasions, Alessandro made us very welcome. Apart from the convenience of being able to park your car without paying through the nose, the Villa Casanova provides a top-notch breakfast, sufficiently spacious accommodation, free wifi and an on-hand tourist information office in the shape of Alessandro.", "title": "Old world hospitality at the Casanova", "helpfulness": 1, "user": "roy b", "date": "January 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123510011}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Some travellers might be put off by the fact that the villa is located on the Lido, but we find it offers the possibility to wind down after the hustle and bustle of old-town Venice.", "title": "Lovely place to say", "user": "LakesLassie", "date": "November 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121122268}, {"rating": 5.0, "stay_parameters": "Stayed November 2011", "text": "Value for money wise the Villa is excellent and it is such a pleasure not to have the feeling of being ripped off but rather to enjoy the company of a charming host.", "title": "Perfect Venice accommodation!", "user": "Fresherika", "date": "November 18, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 120755790}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Enoyed another wonderful stay at Villa Casanova, and a great place to spend our wedding anniversary. Our room was spacious with a four poster bed and a modern, clean bathroom. The breakfasts were as good as ever with an endless supply of lovely coffee. Alessandro and his staff are fantastic and will do everything they can to make your stay a memorable one.", "title": "Perfecto!", "user": "Olena K", "date": "November 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120728096}, {"rating": 5.0, "title": "Very Helpful!", "text": "My siblings and I organised a trip for our parents to Venice with a 4 night stay at Villa Casanova, and they were more than helpful in organising the stay and charging us rather than my parents upon arrival.", "helpfulness": 1, "user": "Helen H", "date": "May 6, 2012", "id": 129478710}, {"rating": 3.0, "stay_parameters": "Stayed April 2012", "text": "I had stayed in the hotel a few years ago and had a wonderful holiday. The rooms are very comfortable and the breakfast is lovely. Also they have a great supply of bikes that they lend you free of charge, and as the Lido is so flat is it a really pleasent ride arond the island which has fab beaches and fantastic views.", "title": "Surprised by all the rave reviews", "helpfulness": 1, "user": "Lozenges", "date": "April 30, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 129098519}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "I would highly recommend this as a great base for exploring Venice, as you are away from the tourist madness but close enough to access everything in just a short boat ride.", "title": "Great place", "user": "Sandsprit", "date": "April 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 128536016}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Villa Casanova was definitely not bad but average at best. We booked on account of all the gushing reviews and were really surprised by what we found.", "title": "cordial staff and great hostiality", "helpfulness": 1, "user": "Vince71199", "date": "April 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 127118595}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The positives:", "title": "perfetto", "user": "onur d", "date": "March 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126246136}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "we liked the idea of Lido as a base for our stay in Venice. We asked for the top floor room at Villa Casanova, which turned out well, as we seek less noise disturbance as a priority. Alessandro is a charming host and lays on a stunning breakfast. You will hardly find a better welcome and friendlier atmosphere than here. Lots of good advise what to do and see. Used their bikes to ride around Lido. The hotel is very simple, spacious and generous in scale, clean and well organised. Can get to San Marco in about fifteen munutes where the crowds are super intense. Full reccommendation!", "title": "oasis in venice but not in with the crowds", "user": "Tweaker108", "date": "June 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 131075655}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Marina made us feel like family! She was the best part of our stay at the Villa Casanova! We decided to stay in Lido on our son's recommendation and it was lovely to escape the throngs of people in Venice. Truly a 15 minute commute from Lido to San Marco square. Villa Casanova was really nothing spectacular but it was adequate. We were expecting a bit more after reading the reviews. Can't say enough about Marina though - charming, helpful, always smiling! Alessandro - you have a gem of an employee!", "title": "Stay in Lido!", "helpfulness": 1, "user": "Anna_Marie_Calary", "date": "May 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 130361474}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "This Villa was recommended to us by a work colleague many years ago and we had been trying to get there ever since and we were not disappointed in any way. The Villa is on a quiet residential street and you could easily imagine living the life of a Venetian while staying there. Alessandro, the owner, cannot do enough for you as he wants to make your stay in Venice hassle free and memorable for all the right reasons.", "title": "living 'La Dolce Vita' in Venice", "user": "Justcuruzin", "date": "May 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130355942}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The Villa is very stylish, clean and comfortable. When arriving in the entrance hall you are greeted with the feeling that someone cares about this Villa as there is a pleasant smell of polish. We had an economy bedroom in the attic space which was perfectly adequate but just need to be aware of the height of the wooden beams. Beds were of a good size and comfortable and the a/c is available if required. As this is a 1930s Villa you do need to be considerate of other guests as the floorboards do creak a bit. This accommodation is more likely to suit mature or quiet couples without young children.", "title": "An excellent B & B", "user": "travelcatsbeds", "date": "May 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130164730}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Asking for a capuccino in the morning from Alessandro's machine will bring on a big smile not only from Alessandro but also in the presentation of the coffee itself. Breakfast is very continential as you would expect with a great range of qualilty products including: yoghurt, fresh fruit, bread/rolls, cheese, cold meats, eggs and cake which can all be washed down with fruit juice and an excellent range of coffee/tea.", "title": "Venice = Villa Casanova", "user": "IhateTv", "date": "May 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130041694}], "location": {"country": "Italy", "region": "Veneto", "continent": "Europe"}, "stars": 3, "variance": {"poor": 0, "average": 7, "very good": 83, "terrible": 3, "excellent": 306}, "aka": "Villa Casanova Hotel", "slim_ranking": 0.157894736842}