{"user_rating": 4.0, "review_count": 935, "name": "Villa Florence, A JRK Hotel", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "What a disappointment! My daughter and I were in San Francisco in July and returned a month later to bring her to college. We had eaten at Kulettos, the restaurant in the lobby of Villa Florence. Kulettos is a wonderful restaurant, full of character and has a beautiful European flair. As such, we thought the hotel would be the same, especially after we checked the website. How surprised we were when we returned last week to find smelly, dusty rooms that are in desperate need of updating with horrible furniture and old bathrooms. We had booked two rooms, including a suite and neither were any where near the standards of a 4 star hotel. And the smell!!! We found out the hotel allows pets (which they claim they rarely have visit) but theh rooms and hallway were a combination of cat urine and dust.", "title": "Very disappointed", "helpfulness": 1, "user": "cttravelgal", "date": "August 25, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 5.0}, "id": 8502449, "likes": {"liked": "— location", "disliked": "— smell"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "Because we had so much luggage to move her in for freshman (and we without a car with all rentals cars sold out for the weekend...I swear we checked every rental agency) we had no choice but grin and bear it. Our room was located at the back of the hotel but the tradeoff for having an alley view was that it was relatively quiet. You are in Union Square so expect some noise!", "title": "Misleading Web Site", "helpfulness": 1, "user": "NJNora", "date": "August 12, 2007", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 8399921, "likes": {"liked": "— Manager let us cancel our reservation", "disliked": "— Grossly misleading web site promising a great hotel and getting there and finding a dump."}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "We actually picked the hotel for the location and loved that part of it since we had two teenagers with us. Union Square was right across the street and the park had was offering movies al fresco each night, the kids enjoyed the freedom of doing that while we slept! I love the location for teens, especially those who love to shop!", "title": "Rude Staff", "helpfulness": 2, "user": "TazzyPerth", "date": "July 31, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "location": 4.0, "rooms": 2.0}, "id": 8264050, "likes": {"liked": "— location", "disliked": "— The staff"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled solo", "text": "As for the hotel staff they were either excellent or horrible, but thankfully most excellent. The concierge, Clarence, was very helpful and so was the Russian man who has the best coffee out at 5am in the hotel lobby (for east coaster and eurpoeans who can time adjust!) There was a female desk clerk who was so confused and difficult to deal with that we gave up.", "title": "I'd go back", "helpfulness": 1, "user": "hotelstayer_7", "date": "July 8, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8079338, "likes": {"liked": "— location", "disliked": "— housekeeping barging in"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "The only good news was that after we delivered our daughter to USF (and unloaded all her bags!) we were free to go to another hotel as we still planned to stay in the city for 3 more nights. They tried to give us a hard time about it and charge us for cancelling the last 3 nights but since we had told them the day we checked in and had given them plenty of notice, they allowed us to leave without a charge.", "title": "luxurious hotel!", "user": "schuminou", "date": "June 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7957701, "likes": {"liked": "— Location", "disliked": "— Price"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled solo", "text": "The staff is INCREDIBLE! I can't say enough about the staff at the hotel.", "title": "Hallways are like running a maze", "user": "circuitboitravel", "date": "September 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 2.0, "location": 3.0}, "id": 8712433, "likes": {"liked": "— The Pillows", "disliked": "— the wallpaper"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The room was fine. My biggest complaint in San Francisco is waterFlow in the showers. This hotel had amazing water-flow. I almost got flooded out of the shower.", "title": "A wonderful place", "helpfulness": 1, "user": "Time_In_Motion", "date": "September 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 8619074, "likes": {"liked": "— Comfortable beds and mini bar", "disliked": "— n/a"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "It has a great location if you do plan on nothing but shop. Other than that, it's right on the cable car line. So remember this.....", "title": "Cheers for the Villa Florencel", "user": "SMLJ", "date": "August 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8504021, "likes": {"liked": "— location, bed", "disliked": "— nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2006", "text": "We stayed in Villa Florence last week, and we were expecting the room was very italian style. However, the room is sooooooo tiny, same as the bathroom. It's really hard to turn around if you stand in the bathroom. And, it's kind of smelly. Additionally, we felt like too itchy to endure while sleeping. I would never do it again.", "title": "Smelly Smelly Smelly!! Tiny Bathroom!!! Can't stand it anymore.", "helpfulness": 2, "user": "totorn", "date": "July 2, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 2.0}, "id": 5415985}, {"rating": 2.0, "title": "Noisy Noisy Noisy", "text": "Small hotel close to Union Square on cable car line. Concierge at front door however no help with bags when we arrived. When we checked in we were asked if we wanted a room with a view or a quiet room. Apparently the rooms that have the view look out onto the street and it is noisy because of the cable car. The receptionist said they were both the same size so we opted for the quiet room. Bad mistake!! We were on the second floor and at first I thought the person in the next room was playing loud music day and night. I didn’t complain. Once I have unpacked I don’t want to repack to move to the next floor. Room was dark and dingy because we in fact did have a view but it was of the extractor fans and roof so we kept the shutters closed. It had a king size bed, a small desk, a bar fridge that was locked. Very tired hotel and although it has a good location, there are several hotels in the same location. Would not choose this hotel again or recommend it.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "June 6, 2006", "id": 5314384}, {"rating": 4.0, "title": "Charming hotel, excellent service", "text": "I spent 7 nights at the Villa Florence while I attended a conference. I ended up staying in a room on the Powell street side. The room was small but nice. It was quite noisy but I didn't seem to have any problems sleeping. The bed was comfortable and I enjoyed the down pillows and comforter. The location was convenient and safe. The staff were attentive and courteous. The service was excellent.", "helpfulness": 4, "user": "sammysolo", "date": "June 3, 2006", "id": 5296218}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "The lobby is busy with a bar and an italian eatery. Always full. The staff speaks all versions of English. You may have to spell your name a few times. The staff is friendly and helpful.", "title": "Great & fun & relaxing if you pay attention", "helpfulness": 5, "user": "strollingbones", "date": "May 24, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5212021}, {"rating": 4.0, "title": "Great small hotel", "text": "The rooms are small and nice. The Palace did not have an honor bar, the Hilton did not have an honor bar the Villa did.", "helpfulness": 6, "user": "nuheart", "date": "May 15, 2006", "id": 5076517}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "Just came back from Villa Florence, where I stayed for 6 nights. The hotel is actually quite good, it's well kept, nicely decorated, but the best about it is its location. Few steps to shopping in Union Square, near convention center, 5 min. taxi ride to CalTrain station etc. The only bad thing about it was the noise. As reading few reviews prior I asked for a quiet room in the back. However, there seemed to be a bar in the back of the hotel as well and it meant loud music and yelling etc. every night until 2 am.", "title": "Great location, but noisy", "helpfulness": 2, "user": "Peksu", "date": "October 16, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 5961095, "likes": {"liked": "— Location", "disliked": "— Noise"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled solo", "text": "This hotel was ok but a bit dated. The first room I stayed in was at the front of the hotel and very noisy (from the street) and I requested to be moved and the front desk staff was very pleasant and moved me to the rear. This room was acceptable and quiet but had a terrible view.", "title": "OK but dated", "helpfulness": 3, "user": "johnkr3", "date": "October 16, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 5959311, "likes": {"liked": "— Location", "disliked": "— Hallways smell. Bathrooms need remodeling"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2006", "text": "The on site resturant was crowded and pricey. The food was good though. Next door is an Italian place that has good food and is much cheaper. Walgreens is down the street for incidentals.", "title": "Did not sleep", "helpfulness": 3, "user": "mlall", "date": "October 15, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 1.0, "value": 3.0, "location": 5.0, "rooms": 1.0}, "id": 5956444}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The concierge (an asian man) was very helpful. The desk clerk(an asian female) was very nice and let me use the internet for free.", "title": "Good value--happy with our stay", "helpfulness": 5, "user": "DiscerningTaste", "date": "October 9, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5933042, "likes": {"liked": "— Convenient location, comfortable room", "disliked": "— Book early to get better AAA rate; ask for a room that does not face the main street"}}, {"rating": 5.0, "title": "Loved it. Great old world charm and character", "text": "I had to be moved to another room after a few hours because I found hugh bed bugs.", "helpfulness": 1, "user": "marionsjackster", "date": "October 9, 2006", "id": 5932842}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "The Villa Florence Hotel exceeded our expectations. Before booking, I read the reviews here and noted the negatives. I found none of these to be true in our case. The locations was perfect, within walking distance of Union Square by one block, Chinatown by just a few blocks. Next door on one side was a fantastic Italian restaurant, and the other side a very nice coffee bar with excellent pastries. A nice quiet bar is also located right inside the door to the right of the lobby. Two doors down was a great place to get a hot slice of gooey pizza, or a panini, and a Starbucks just on the corner, and a great little \"convenience\" store right across the street with anything you would need including some great wine. Truly, the location of the hotel could not have been better. The hotel itself was quiet. Our room was on the top floor with 2 double beds and a pullout sofa bed. Very roomy and decorated beautifully and spotless. It was very quiet as it was at the back of the hotel. There is a street car out front, but I never heard it once. the staff was very knowledgeable about the area, and very helpful. We loved this place so much and we will definitely be returning to the same place.", "title": "Beautiful!", "helpfulness": 2, "user": "Annikal", "date": "June 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7936663, "likes": {"liked": "— Location and Atmosphere", "disliked": "— ?"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "After flying in from Boton I was exhauted. Check-in took forever - and for some reason the efforts of two people. They also kept looking up to say sweet things to everyone who walked by - which is very nice, but my check-in took 25 minutes without exageration. One could have greeted and left the other to handle the data entry, but they were some kind of binary system.", "title": "Gave Key to My Room to Other Guests and NOISY", "helpfulness": 3, "user": "Morsel93", "date": "May 15, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "location": 5.0, "rooms": 4.0}, "id": 7628536, "likes": {"liked": "— Location; architecture & decor", "disliked": "— Service, noise, sleepless nights"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "At around 3 am I was awakened by a rustling outside my door - and then a click in the lock, and then the door opened - and a couple entered my room! I was terrified and so were they. They slammed the door. I went out of the room, half-asleep. They were shaking and went downstairs apologizing profusely. I called the front desk. Ooops - gave my key to a couple. Sorry about that. I would think the hotel would be horrified. No, it was as if I had called to say they forgot to give me complimentary shampoo. For some reason, I was not registered as having checked in the hotel! (After all that....) Then they found some evidence of my being checked in - my credit card. I mumbled something about their changing the key or something and fell back asleep. (Had I been more alert I would have insisted they change the keys.)", "title": "Great Spring Stay", "helpfulness": 1, "user": "CalTraveler45", "date": "April 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 7403689, "likes": {"liked": "— Location"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "THEN at 3:30 am I received a telephone call. The front desk called. The man started to talk to me as if it were not in the middle of the night. \"Sorry to bother you, but we need to check you in...\" YOU MUST BE KIDDING ME! He actually wanted to get all the details. I told him my name and said he had my credit card - the rest could wait until the morning.", "title": "Good location and price but too much street noise", "helpfulness": 3, "user": "seacoastNH", "date": "February 13, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 6786389, "likes": {"liked": "— Location", "disliked": "— Noise"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "I was still bleary and shaken in the morning. I got up and went down early even though I really needed more sleep to check in again. You would think that they would offer some compensation - and they did. Free breakfast. Not a free night's stay. Not even a free dinner. Eggs do not make up for that. I said no thank you. I was so tired I was naueated as it was.", "title": "Good location", "helpfulness": 3, "user": "Diamondwatcher", "date": "January 30, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6717345, "likes": {"liked": "— Location", "disliked": "— Bit noisy"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "This is not a new hotel, and thank goodness! It has a charm that can rarely be found in the States. Our room was spacious and clean. The fixtures are new and the whole hotel has been well-kept. What is nice though is it is a break from the chain hotels. We didn't walk to our room, we felt that we explored our way to our room! Couple that with incredible staff and you almost feel like you are at a large, luxurious bed & breakfast.", "title": "Great 1920's feel with an easy elegance about it", "user": "AmericanBurger", "date": "January 18, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53789401}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "The street noise can be loud. We were warned when we checked in and offered an interior room, but we like the sounds of the city so opted for an exterior room. Some people may find the noise annoying (we didn't) and should make sure to get an interior room when booking.", "title": "Beautiful Hotel in Perfect SF Location", "user": "FelixOR", "date": "January 13, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53421077}, {"rating": 5.0, "title": "elegant and comfortable", "text": "Beautiful, clean hotel with helpful staff. We had a wonderful stay.", "user": "mocha1coop", "date": "January 12, 2010", "id": 53276217}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "My husband and I miss \"our hotel\". The room was small, but very comfortable. I have a difficult time sleeping away from home, but the feather mattress and pillows made it easy. The flat screen tv and dvd player were a nice touch and the complimentary toiletries from L'Occitane were a treat. The staff were friendly and helpful and the decor was pleasant and tasteful. We absolutely love the Villa Florence and would stay there again in a heartbeat!", "title": "We had a great experience with Villa Florence - great location and very nice rooms", "user": "Jennifer100SanJose", "date": "January 5, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52711449}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "A beautiful hotel in the heart of Union Square - we very much enjoyed our stay!", "title": "Nice hotel - convenient location, clean and very friendly staff", "user": "sjtravelbug", "date": "January 2, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 52413290}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "We stayed at the Villa Florence over Thanksgiving weekend and the lighting of the Christmas tree on Union Square. We booked two rooms. Tony at the front desk was very accomodating making sure our request for king sized beds and quiet rooms towards the back of the hotel were fulfilled. The location of the hotel was perfect for shopping and grabbing a cable car to Fisherman's Wharf. Yes the rooms are smaller, but we did not spend much time there with so much to see and do. They were offering a $105.00 online special which we booked several months ago. We would definitely stay here again. The location is perfect for resturants and the service we encountered was very good. The only bad thing was that they wanted to charge extra in Valet for an suv insted of the posted charge. Thankfully the hotel manager took off the additional charge. I have never heard of being charged extra because your vehicle is bigger than a toyota.", "title": "Great time", "helpfulness": 1, "user": "sactrav66", "date": "December 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 50463735}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "I have stayed here twice for work and both times were great. The rooms are nice and clean. There is a fitness center, restaurant, and coffee shop on site. You are walking distance to Union Square and many restaurants/shopping locales.", "title": "consistently good experience, nice hotel, great location", "user": "ivydturtle", "date": "November 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 49613785}, {"rating": 4.0, "title": "Average hotel, not disappointed, but not impressed either", "text": "We stayed in a comfortable, clean room with street view – note that we were warned by the receptionist that it might be noisy, still we opted for the street view. After midnight it got quiet. :-) The bathroom was a bit of a disappointment: small and old, with a tiny sink and no room for toiletries. The restaurants downstairs are very good. We had a delicious breakfast at Kuleto’s.", "helpfulness": 1, "user": "ImOutFishing", "date": "November 14, 2009", "id": 49181354}, {"rating": 4.0, "title": "perfrect Place", "text": "Stayed here for one night to celebrate a birthday. The staff were VERY welcoming and helpful. It was in the perfect area to stay for shopping and seeing the great musical 'Wicked'. The room was great, bed very comfortable ...and my pooch was welcome. Would stay here again.", "user": "Runtster", "date": "November 8, 2009", "id": 48733394}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Loved staying in this hotel and visiting three premium restaurants all within two block. We stayed two nights and the location was perfect for everywhere we wanted to visit. Service was excellent. Only complaint was that the mattress was harder than expected and not pillow-top as described. Still slept well. We opened the mini-bar right before we left and it was stocked with clear prices. Probably would use it next time. Very clean and toiletries were great. Didn't eat in the restaurant downstairs but the food looked great every time we passed by (and it was packed). We had an inside room as it was recommended and we are glad we did. The front streets are busy but we didn't hear a thing. They even set out wine for our honeymoon. Charges and requests were all accurate. Would definitely stay again.", "title": "Exceeded Expectations", "user": "beneficial47", "date": "November 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 48661848}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "we stayed here for five nights last week - have to say that this was a great stay - nice room - best of all is the foyer area and the restaurant - you will need to be careful - its so good you mightent get to try other sfo restaurants - well done to all concerned", "title": "Great hotel location and Kulettos", "helpfulness": 2, "user": "seamie", "date": "August 28, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5715829, "likes": {"liked": "— Restaurant Atmosphere & Location", "disliked": "— ??"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "My wife and I recently spent 4 nights at the Villa Florence with our 2 teenage sons. The room was spacious enough with a king sized bed and a queen pullout. We asked for a quiet room and were very impressed with the lack of noise from both outside and from neighboring rooms. We heard nothing. The bathroom was a good size and the shower was powerfull. The small fitness room has a couple of treadmills and 2 elipticals. I'm a fitness buff and it was enough for me. You couldn't ask for a better location. It is located seconds from Union Square and all of the great shopping and restaraunts. As soon as you walk out the door you are in the middle of hustle and bustle which makes it very exciting if you are looking for that kind of holiday. We decided not to rent a car because of the hotel's proximity to the very efficient transit system. If you plan on using public transit buy a pass for the amount of time you plan on being there. You can get anywhere on the series of cable cars, buses, streetcars and subways and all of the stops are within walking distance from the hotel. The hotel offers free coffee tasting in the lobby each morning and free wine tasting every evening. Nice touch. The restaraunt, Kuletos is one of the best Italian eateries in town. The staff couldn't have been friendlier. I'd stay there again in a flash.", "title": "Loved it!!!", "helpfulness": 1, "user": "eeshkoh", "date": "August 20, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5628608}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled solo", "text": "I just stayed at this hotel for 5 days and I had a room facing Powell Street. If you want a quiet room, make sure you ask for a room away from the street as it can get very noisy late at night. It didn't matter to me because I was on holidays but other people may not like it. The restaurant in the hotel was very nice and the service was good. The Kuletos cafe attached to the hotel is also very convenient for a quick muffin in the morning.", "title": "Great Hotel in a Great Location", "user": "stutay", "date": "August 3, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5553401}, {"rating": 1.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "My husband and I had a terrible stay at this hotel. It was in a convenient location and we found most of the staff to be pleasant, but the noise level coming from music at a nearby bar was so high, that we hardly slept a wink! The music was vibrating my bed it was so loud! When I complained to the front desk, they said that the police had been notified and the problem would be taken care of shortly. It never was. We were moved to a new room the next night, but A/C unit was humming noisily. I do not recommend this hotel.", "title": "I hardly slept at all during my stay!", "user": "thompl", "date": "July 28, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 5523520, "likes": {"liked": "— Location", "disliked": "— Noise level"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "We enjoyed our stay at this hotel very much. They were very professional and I think it's a very nice hotel. They were helpful and accomodating. We stayed in a \"double double\" room, which was larger than a standard 2 double bed room and it was very adequate in size. The room was clean. It also had a big closet to store our luggage but they didn't have much shelf space to put clothes. There was a dresser with 3 drawers and that was it. The bathroom was large, except there wasn't much space for toiletries, so we had to be creative. The shower was good; It didn't change water temperature while using it and the spray was strong. Thanks to suggestions of other reviewers, we requested a room that was not on the main street and was much quieter. However, you do have to give up any kind of view and some natural light. It was a tradeoff we were glad we made though. They were nice enough to clear out the mini bar so that we could use it as a refrigerator. The pillows and comforter were made of down. The TV was a Sony flat screen and there was a DVD player and CD clock radio. The lobby area was also very nice. The concierge was helpful. The hotel is very well located. I would definitely stay there again.", "title": "Would definitely stay again", "helpfulness": 5, "user": "lisat1", "date": "July 18, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5479177}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "Took the Amtrak over.Short walk.Many restaurants close.4 yr old granddaughter ,Perfect location to see lights Union Square. Service very good ,room comfortable ! Happy hour a great bonus for tired grandmum. Cheers ....Very nice wine list !", "title": "Perfect location for Union Square and SF Shopping Center.", "user": "vpatt", "date": "December 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 52271086}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "Family rooms were large & had adequate privacy. The queen rooms were so tiny that at a few points 2 people could not pass. Inner rooms are nice and quiet. Definately the best location in town across from beautiful Union Square, and an unbelievable price. I am a 4th generation San Francisco who lives on the \"other\" side of the bridge now, but I come back to Villa Florence at Christmastime frequently.", "title": "great!", "user": "45dawabbit", "date": "December 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 51845491}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We stay at the Villa Florence several times a year, coming to The City for theater and great dining. The rooms are lovely with the most comfortable bed. You can't beat the location as you can walk to most theaters and there are great restaurants in the area. The front desk staff are the best(especially Lita) . They will help you with anything. Can't wait to go back! If you are driving into SF, the hotel is only a block from Union Square parking garage. Parking is expensive--$33 a day.", "title": "Location,service,comfort", "helpfulness": 1, "user": "nanmcg", "date": "December 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51514899}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We stayed at the VP on December 12 - lovely hotel, and property. People were wonderful and the holiday decorations were tasteful. You cannot beat the price for the location and the amenities, however, please note that the rooms are small - the bathroom is twice the width of a bathtub and only as long as a bathtub. You really can't get two people in there at the same time. However, it would not change my review of this property, and I would stay there again. Just an FYI if anyone likes more space. Ask for a room that does not face the street and the room will be very quiet.", "title": "Great hotel and location, but small bath/bedroom", "user": "mngal1", "date": "December 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 51220669}, {"rating": 5.0, "title": "Close to so much... and lovely to come home to", "text": "We were so pleased we stayed here. San Fancisco is a fabulous place to explore and the VF is close to many of its attractions. We arrived by BART fast train from the airport late on a Friday night ($8.10) to find the streets full of people. Our Juniour Suite had lots of character, plenty of space, windows you can open, and beautiful bathroom products! Don't miss... the Frank Llyod Wright shop nearby in Maiden Lane, the Coit Tower to see the view and murals, and a ride on the tram and the working tram museum. A bike ride across the Golden Gate Bridge and down to Sausalito is also great fun, and expoloring the fabulous wild Golden Gate Park by bike is also a must! All so close... and you come back to a beautiful, comfortable space at the end of the day!", "user": "ChezVictoria", "date": "December 5, 2009", "id": 50704279}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We had stayed at the Villa Florence for a few nights last year and loved it; however on our return we were checked into an executive room (the same as we had booked before) but on the 2nd floor.", "title": "Was NOT good 2nd time around", "helpfulness": 3, "user": "shelley666", "date": "September 27, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 5881987, "likes": {"liked": "— The Location and nearby restaurants", "disliked": "— The staff"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "We went up expecting a similar room to last time albeit on a lower floor; we were wrong. The room was much smaller. It may be that in square footage it was the same (although i doubt it) but the space was arranged so that you had a nice large area with nothing in it by the door, follwed by a bed, sofa, chairs, chest of drawers and tv crammed into the other part of the room.", "title": "Happy.... I wasn't", "helpfulness": 1, "user": "iohcar", "date": "September 4, 2006", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 5769050}, {"rating": 4.0, "title": "Great location, good shopping", "text": "I had a lot of problems finding a hotel in SF, and a lot of problems with hotels.com, so I was somewhat nervous when we got to Villa Florence. We had booked a kingsize bed, and while they said it was a kingsize room, the bed wasn't. We didn't complain it was good enough for us. Small, bathroom, rather noisy airco, but decent size room, good facilities. Good bed, pillows and comforter. Great location!", "helpfulness": 1, "user": "MayaSweden", "date": "October 17, 2007", "id": 10089741}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "Our room faced a larger ventilation shaft aka court side view. But thats not an issue for us. In some of the reviews pointed out the noise on the street. The Irish pub is gone and they are doing renovation.", "title": "wonderful stay", "helpfulness": 3, "user": "Keiff", "date": "October 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10071123, "likes": {"liked": "— Location, Room, Staff", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "We never had any problems getting around using public transport the hotel was very very good located for that, and shopping. Chinatown is just a few blocks away, and its much nicer and more interesting then new york's chinatown. Though not as much fake brand name bags .. if that's what you are after.", "title": "Satisfied, would go back again", "user": "homo_touristicus", "date": "October 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "location": 5.0}, "id": 10045456, "likes": {"liked": "— Location", "disliked": "— Odours in the corridors"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "There are a lot of restaurants around, most of them variations of stake house in different levels of sophistication. Which doesn't appeal to us. So we where some what disappointed in that.", "title": "Excellent location, charming hotel", "helpfulness": 1, "user": "FritzieontheGo", "date": "October 2, 2007", "detail_rating": {"business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10031965, "likes": {"liked": "— Location", "disliked": "— Teeny rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "we had a great time and a great stay at the Villa florence. from the time we checked in with Cora to the time we left saying goodby to Clarence the Concierge who really gave us great recommendation, it was by those recommendations that we found ourselves having a great time in SF. the rooms at the Villa Florence are very cozy, and clean, at check in we were ask if we wanted a quiet room or a room facing the street, this area is very busy and often nosiy, we choose a room facing the street, living in NOLA the noise was not a problem for us, every night one of the street musician would play Sun Rise Sun Set, this was heard throughtout our room, how romantic!!!! if you are a person that like peace and quiet please do not get a room facing the street. this was our first vist to SF, and what an experience. the hotels location is great, right in Union Square, within walking distance to great shopping, wonderful resturants and plenty of good coffee stops. the cable car runs in front of the hotel, and the ticket booth to ride the cable car is located only 2 blocks away on market and powell, you really would want to purchase a pass, the pass would allow you to hop on and off other wise it would cost you $5.00 everytime you get on, this car will take you to the Wharf. at the Wharf we took a Trolley Tour which was a great way to see SF. we went to the City of Sausalito by way of ferry, the ferry ride and city was wonderful. hats off to VF and Clarence for a wonderful stay and great trip", "title": "Great Experience! Please read!", "helpfulness": 2, "user": "Angela6461", "date": "September 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8752420, "likes": {"liked": "— Location", "disliked": "— Loved everything!!"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We stayed at the Villa Florence for 4 days in February 2010, our first time there. The hotel is very nice and an excellent value, right in Union Square. We had quite a large room with a sitting area, but even without the sitting area, the room would have been more than ample in size. The rooms are older but in good shape and we had no complaints. Service by all staff was extremely friendly and efficient. The lobby has a nice coffee bar that serves drinks and light snacks. Kuleto's restaurant is also in the lobby.", "title": "Very nice hotel, great location and value", "user": "dkmr", "date": "February 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 57036832}, {"rating": 4.0, "title": "Awesome value and great location", "text": "The hotel couldn't be in a better location -- right on the cable car line (one ride and you've done it) but just a couple of blocks away from the trolleys, trains and buses. This hotel is so convient we ended up just jumping on the train to go back to airport. My only warning is the panhandlers can be very aggressive so be careful and take any of their crap.", "helpfulness": 1, "user": "cwebster4", "date": "February 21, 2010", "id": 56670161}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "How is it that this hotel EVER has availability? The location is perfect -- directly on Union Square, and a price that's an absolute steal. We stayed there this past weekend for $124 per night! Things I like about this hotel besides the location and price: hotel-wide free wi-fi, a free business center with access to PCs and printers, ice machines on every floor, and excellent front desk and bellhop service. I've never tried the restaurant or room service -- why would I when there are a hundred eating choices within 50 yards of the hotel?", "title": "For the location and price, this is 5-star!", "helpfulness": 1, "user": "igettheheat", "date": "February 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 56097919}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled solo", "text": "The decor could stand some updating, and the beds are not the most luxurious in the world, but the rooms and bathrooms are clean and roomy. The bathroom fixtures and the hairdryer work well, and the shampoo/conditioner/soaps are all high quality.", "title": "I kept looking for something wrong, but couldn't find anything", "helpfulness": 1, "user": "aa6nz", "date": "February 13, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 55902326}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The elevators are a little small, so I'd recommend asking for a high floor.", "title": "warm and friendly with comfy, clean accomodations in the heart of sf", "helpfulness": 2, "user": "californiawonderland", "date": "February 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 54959434}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 3.5, "variance": {"poor": 50, "average": 128, "very good": 371, "terrible": 38, "excellent": 348}, "aka": "Larkspur Collection San Francisco", "slim_ranking": 0.404255319149, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "description": "Stay Bellissima. A taste of Italy in the heart of Union Square. The Villa Florence embodies the feel of a modern Italian urban villa, providing warm, exceptional service and charming accommodations to its guests. With its fusion of eclectic European flair and metropolitan energy, the Villa Florence is authentically furnished and is ideally located in the epicenter of San Francisco – steps from Union Square. The hotel offers personalized experiences tailored to guest’s individual needs and interests, from complimentary wireless high speed Internet, DVD players and movie libraries, to a full service business center and a knowledgeable concierge program. Additionally, as part of the JRK Hotel Group, the hotel offers signature brand elements, including CO Bigelow bath and body products, high-tech efficiencies and a warm, welcoming atmosphere. While visiting the Villa Florence, guests can dine casually at Bar Norcini, located within the hotel. It’s an intimate wine bar and from the decor to the wonderful selection of wines, charcuterie and cheeses, Bar Norcini celebrates the flavors and traditions of Italy. Just next door, adjacent to the lobby, you'll find Kuleto's Italian Restaurant, a San Francisco institution for locals and visitors alike for over twenty years, serves exquisite Northern Italian cuisine."}