{"user_rating": 4.5, "review_count": 233, "name": "Villa Zuccari", "reviews": [{"rating": 5.0, "title": "The Best in Umbria", "text": "After a number of trips to Tuscany and Northern Italy, my wife and I recently visted Umbria, where we had the good fortune of staying at Villa Zuccari near Montefalco. The Villa has been the home of the Zuccari family since the 16th century, and has recently been completely rebuilt into an intimate hotel with 30-35 rooms. The rooms are very large and airy and the quality of the renovations and furnishings is absolutely superb...and because the summer temperatures were very warm, we appreciated that the air conditioning worked very well.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "July 6, 2006", "id": 5432433}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "The dining facilities and pool are first rate, and the meals in the restaurant were among the finest we have had in Italy. The included breakfast buffet is excellent and features breads and cakes baked daily by Sra. Zuccari. The staff members all speak English and are extremely helpful and welcoming. The Villa is centrally located with easy highway access to Assissi, Perugia, Spoleto and Orvieto, as well as Cortona, Sienna and Florence in Tuscany for day trips. Sra. Zuccari is a charming and gracious hostess and, while Villa Zuccari is rated four stars, my wife and I felt that it was the equal of many of the five star hotel we have visited.", "title": "Very nice – but a bit remote", "helpfulness": 1, "user": "Il_Tempo_Gigante", "date": "July 1, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 5414443}, {"rating": 5.0, "title": "Heaven in the Umbrian countryside", "text": "This hotel is very nice indeed, and the gardens and pool area are suberb. The main problem is that the location is a bit off track. Also, everything very new, and even though it's is done nicely, it lacks the charm that many other older Tuscan hotels have. The service is excellent. We stayed here with two small kids, and they served us a full three course meal in our room while the kids were sleeping.", "helpfulness": 2, "user": "SRB54", "date": "June 29, 2006", "id": 5407282}, {"rating": 3.0, "title": "Very friendly hotel", "text": "What a beautiful place! This villa has been in the Zuccari family since 1600 and has been lovingly restored. The rooms are enormous with hand painted walls, air conditioning that works great, huge tub, huge shower, lots of hot water and a sitting room. Most of the rooms have balconies that overlook 40,000 meters of land with wheat, sunflowers and grapes. The beds are fantastic, kingsize with lots of pillows! The breakfast room is open and airy with handpainted frescoes on the walls and ceiling. The food in the beautiful dining room is excellent and of course there is the Montefalco wine! Signora Zuccari prepares the menu daily so everything is fresh. The staff are english speaking and can arrange wine tasting and olive oil tasting tours. They will arrange reservations at other restaurants in the area as well. The villa is conveniently located to Foligno, Spoleto, Perugia, Assisi, Trevi, Spello and Bevagna. There is a large parking area if you rent a car but there is a bus stop outside that take you to Spoleto and surrounding areas. Now for the ouside! The grounds are lovely with an infinity pool that is almost olympic size. Lounge chairs, umbrellas, towels, you name it. There is a terazza that overlooks the park like groundsand swimming pool where you can have an afternoon drink. This place has all the modern amenities BUT it still feels like you are staying in someone's home. Signore and Signora Zuccari and their staff are helpful and do everything to make your stay as wonderful as possible. We will be back! Becky and Hyland Hogan, Half Moon Bay, CA", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 28, 2006", "id": 5397591}, {"rating": 5.0, "title": "Beautiful setting", "text": "We spent 4 nights at Villa Zuccari on a package purchased through Luxury Link.", "user": "A TripAdvisor user", "date": "June 16, 2006", "id": 5352776}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "I recently spent 6 nights at the Villa Zuccari, and I found it very enjoyable. I chose the hotel based on Tripadvisor reviews, and I must admit I was unsure what I would find after reading some recent contributions, but I was pleased.", "title": "A nice time at the Zuccari", "helpfulness": 1, "user": "j32063", "date": "September 17, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 5810764}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "The Villa is actually about 15 minutes outside of Montefalco in the tiny community of Santa Maria Della Stella. While the immediate surroundings are not exactly glamorous, the grounds are nicely done and quite peaceful. A previous reviewer complained about the construction, but I was not bothered by it and in fact enjoyed a pleasant day by the pool.", "title": "A little new gems in Umbria countryside!", "helpfulness": 1, "user": "Totti5", "date": "September 15, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5803931, "likes": {"liked": "— Living room decor, food", "disliked": "— n/a"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "The rooms were large and comfortable, the plumbing modern and functional, and the laundry service quite good. The only thing I did not really enjoy was dinner in the Dining Room. There was only one server on duty, and he was positively overwhelmed by the 6-7 tables he had to cover. Service was glacial, even by Italian standards, and the food was only fair.", "title": "Villa Zuccari in Umbria: Beautiful!", "helpfulness": 2, "user": "RDR1022", "date": "August 25, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5708622, "likes": {"liked": "— Beautiful property amidst beautiful environs", "disliked": "— nothing comes to mind"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "I think if the Zuccaris (lovely people, by the way) can work on improving things in the restaurant, they will have a real winner. I would readily recommend the Villa and gladly stay there again.", "title": "Delightful hotel!", "helpfulness": 2, "user": "PamelaF", "date": "August 11, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5600717}, {"rating": 2.0, "stay_parameters": "Stayed July 2006", "text": "I have very much enjoyed a recent stay at Villa Zuccari in August with my family. The Villa is located in a peaceful area of Umbria's countryside near Montefalco famous for its wineyards producing the red wine Sagrantino, which I invite everybody to try! The property have a lovely swimming-pool surrounding by a nice and extensive garden with roses, palms and cypress trees. Rooms are very large, nicely decorated with original period furnitures, mine was a very large: a junior suite with terrace at the second floor with view of all the countryside almost up Spoleto's hill. We have also enjoyed a dinner at the restaurant where typical dishes of the Umbria tradition are served with a familiar atmosphere. The entrance have its original wood carved ceiling which is a masterpiece as well as the living room area with a fireplace decorated with very nice antique furnitures and collections, cosy and relaxing. I truly reccommend the Villa Zuccari, also because it is a new discovery in Umbria!", "title": "overpriced and distinctly average", "helpfulness": 4, "user": "jmblovestravel", "date": "July 31, 2006", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 5531636}, {"rating": 5.0, "title": "Wow!", "text": "Wow! Contrary to another Trip Advisor’s opinion that the Villa Zuccari was bland, we found it to not be a 4-star hotel, but instead it is more like a 5-star hotel! We stayed in the Villa for 4 great days in May 2006 and we particularly enjoyed the fact that the Villa is in a small village, but is within just a few kilometers of Spoleto, Perugia, Assisi, Deruta, and many other small and interesting Umbrian towns. The suite we occupied was large, airy, had a great view, and had all the amenities of a 5-star hotel. The service was impeccable and the Villa’s restaurant employs a lady to cook who is from the small village and the food was some of the best we found while in Umbria (we particularly liked the veal limone!)! As a retired Hotel General Manager, I firmly believe that Mr. & Mrs. Zuccari, have truly created another fantastic hotel (they also own the Hotel San Luca in Spoleto) that will become a must-stay location for people vacationing in Umbria. We look forward to returning one day in the future.", "helpfulness": 2, "user": "Ojisan", "date": "June 13, 2006", "id": 5339125}], "location": {"country": "Italy", "region": "Umbria", "continent": "Europe"}, "stars": 4, "variance": {"poor": 3, "average": 10, "very good": 23, "terrible": 2, "excellent": 195}, "aka": "Villa Zuccari Hotel Montefalco", "slim_ranking": 0.142857142857, "description": "Surrounded by the vineyards of Montefalco, Villa Zuccari Montefalco promises privacy and tranquility in the rolling hills of Umbria. This distinguished estate, family-owned since the late 16th century, features airy accommodations that capture its authentic countryside elegance. Meticulously landscaped grounds entice with magnolias, palms and ancient cypress trees, while the outdoor pool is ideal for lounging on sun-soaked days. Come evening, savor fine Italian wines and delicious traditional fare at the house restaurant."}