{"user_rating": 5.0, "review_count": 36, "name": "Villa Dome Quixote", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We stayed here for one night on a long-weekend trip to New Denver, and were very happy with our choice. The domed cottages are fantastic -- they feel like something out of a storybook. They were also well located, as they were close to everything in the town and also to some walking trails. Everything in the rooms were very well maintained, and the service was good.", "title": "Adorable accommodations!", "helpfulness": 1, "user": "dogbone1002000", "date": "January 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 150550136}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "All in all, a great place to stay if you're ever in New Denver!", "title": "Quaint getaway", "user": "copihue", "date": "November 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146483582}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We spent one night in the main dome and one night in one of the cottages.", "title": "Great stay", "user": "Anthea123", "date": "October 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 142262807}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Service was relaxed and friendly. We have no complaints and look forward to going back again.", "title": "Wonderful visit", "helpfulness": 2, "user": "James G", "date": "September 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 141608468}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "One of the prettiest places I've stayed.", "title": "A wonderful surprise", "user": "bestdaysofourlives", "date": "September 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140814908}, {"rating": 4.0, "stay_parameters": "Stayed July 2012", "text": "Dome Quixote is a marvellous twist on traditional lodging. The buildings themselves are unique and the atmosphere is very European, a good thing from our perspective. The rooms are cute and the common areas are excellent, creating an environment where you get to meet your fellow travellers.", "title": "Something different in New Denver", "user": "TessmacTraveller", "date": "July 30, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 135750353}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The one blemish is the fact that the materess was terrible. Of course we don't know if this was just our room or the entire hotel but a restful sleep was not to be had as a result. New, non-saggy materesses would make Dome Quixote an absolute winner.", "title": "Best in the Slocan Valley", "user": "fitmom1010", "date": "July 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135502146}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "This is the best choice for a hotel in New Denver and the Slocan Valley and our second time staying here. It is a quaint centre for other activities--hiking, mtn biking, or just car touring. There is a choice of rooms with private or shared baths and use of a communal kitchen. Great for preparing your breakfast and lunch for the day hike. If you are travelling as a family, try one of the self contained domes. If it is not too hot outside, try the jaccuzi. Make sure that you visit the Japanese Internment Memorial while there. Too many people miss out on the Slocan Valley which is in the Western Kootenays.", "title": "Comfortable, Unique, Friendly", "user": "lorneinvan", "date": "August 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116715107}, {"rating": 5.0, "title": "We loved \"The Domes\" and we'll be back.", "text": "We arrived at Dome Quixote after three nights of camping and were looking forward to a comfortable bed and a relaxing location. We were not disappointed. We stayed in Dome # 3 for two night in August. The dome was spotless and the bed and furnishings were comfortable. The kitchenette was equipped with everything you need. There were nice touches like organic coffee and teas and a good selection of reading materials. The dome has an outdoors eating area. The dome was cool, and quiet and at night you could hear the near by creek. The staff were very helpful and the location was very convenient as a base for day hikes or to go to the beach. The hotel is well landscaped with lavender and other flowers and there is a lodge with a reading room as well as a yoga dome.", "user": "A TripAdvisor user", "date": "July 24, 2011", "id": 115720410}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "We will return here.", "title": "A real gem", "helpfulness": 1, "user": "energizer0_0", "date": "June 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111326740}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "We stayed two nights in one of the cottages. The cottage was clean, comfortable, spacious, and well-equipped. The bed was very comfortable, the bedding top notch. We enjoyed the little patio outside, the hot tub, and the town of New Denver. Locking and unlocking the door to the cottage was a bit of a hassle but once you understood how it worked, no problem.", "title": "Worth the splurge!", "user": "Karen J", "date": "September 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140640693}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "This is really a \"one of a kind\" lodge and cottages. It features what I think of as \"Danish Modern\" decor. Lots of natural woods, comfortable beds, wicker and woven baskets and chairs, down comforters. We stayed in a cottage which includes a two burner stove, refrigerator, sink and necessary dishes and cooking pans as well as private bathroom with shower. The unique round dome shapes of the units are quite unusual and, of course, you are in the middle of absolutely gorgeous scenery. This is really a destination, and if you are able, take the Selkirk Loop, which includes a free ferry ride across Kootenay Lake as well as area hot springs. Prices are reasonable for the accommodation. There are one and two bedroom units in the main lodge with shared bathrooms. These are really reasonable. in price. The desk clerk was very helpful, cheerfully showed me the available rooms. There is a very complete grocery store next door. We did not get to try the hot tub or sauna. Maybe next time. I believe that reservations would be a good plan so as not to be disappointed. We had tried to stay once before and they were full. This time they had cancellations allowing us to stay,.", "title": "Quirky and Comfortable - A Special Treat", "helpfulness": 1, "user": "normajBoise_Idaho", "date": "September 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140517866}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We stayed at the Dome for just one night, but we thought it was too short.We had a 2 single bed bedroom, but it was quite large. The hot tub outside is great and the kitchen is very convenient, you can find everything you need. Michael, the host, is very friendly and he gave us a few great tips. (Idaho peak)", "title": "Great place to stay!!!!", "helpfulness": 2, "user": "Simone d", "date": "September 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140047646}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We would definitely come back here again!", "title": "Unique!", "helpfulness": 1, "user": "grumkay", "date": "September 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 139269278}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We just spent 2 lovely days in New Denver at the Villa Dome Quixote. The accommodation was unique and totally enchanting. Pristine clean and neat and efficient. We probably should have read \"between the lines\" as the accommodation was geared towards those that enjoy a minimalistic environment; if you want to get off the merri-go-round of wi-fi, telephone and television you will totally enjoy the Dome. The bed is equipped with a rather think futon, which for the hikers and cyclists was probably heaven, but for our needs wasn't totally suitable. Our hosts were very considerate and provided us with an extra duvet and we used the one on the bed, and that made sleeping more comfortable. There is wi-fi available in the main common area but not in the rooms. The area surrounding the property is delightful and for us was worth the trip into that part of the Kootenays.", "title": "Charming, clean and friendly", "user": "old-jogger", "date": "August 27, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "location": 5.0, "value": 4.0, "rooms": 5.0}, "id": 138605146}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "A great experience staying in a circular s/c cottage. Great location to explore the surrounding area", "title": "Excellent self catering accommodation with a difference", "helpfulness": 1, "user": "Canadann", "date": "May 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110720194}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "What a great place. We were traveling through the Kootenays to deal with my husband's father's estate. We were tired, emotional, and in need of some sort of balance or sanity. We happened upon New Denver because I wanted to visit the Japanese-Canadian Internment Museum and were lucky that they were open for a school group that day. When we saw the domes we had to stay. Our room was lovely. The person who booked us in was fine but basically the domes are stand alone units with kitchens so we didn't get any service. Our room was amazing. It was so fresh and open and yet also cozy. It just felt right. I thought that all that talk about round rooms being healthy was mumbo jumbo but I did feel good. The place had a lovely contemporary design to it. The bathroom was luxuryious. The main building was very cool to explore and the outdoor hot tub was just what we needed. The plush towels were devine. The town is small and rustic but the people were lovely. We bought groceries, a bottle of wine and rented a film to watch on my laptop (no TV) and had a lovely stay. Best part of it was that our dog was welcomed in too. We had spent the same cash staying at crapy motels in BC and were delighted with Dome Quixote. I would stay here again. In fact my husband and I have spent the past 6 months investigating various building models and hope to build our own dome one day!!", "title": "Excellent find in the middle of nowhere! We want to build our own dome now!", "helpfulness": 1, "user": "googlywoogly", "date": "March 12, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 99918435}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Attended a wedding in Silverton and were hosted here. Although the peculiar looking \"beehive\" style buildings were a bit inhibitory, the place is in perfect shape inside with wood flooring throughout, common kitchen area spotlessly clean. Fresh ground coffee available (self-brew) 24/7. Fridge available in kitchen. Bedrooms scandinavian style, cool \"downies\". No TV. No cell phone access. Wireless internet throughout. No proper chairs in the bedroom, which I assume is meant for sleeping after days hiking or skiing the mountains. Lovely \"common room\" upstairs with reading materials, work desks. Perfect outdoor hot tub. Very peaceful setting. Romantic old buildings in neighbourhood. Slocan Lake half a mile walk away.", "title": "Nordic-style peace and quiet in the Rockies", "helpfulness": 2, "user": "KsW_MD", "date": "August 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 37321889}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "My wife and I took a vacation to this area and stayed at Dome Quixote. It was a very relaxing staying here. Clean, bright, comfortable. Large common area, hot tub, sauna, common kitchen. Everything we wanted and more. The service and all the staff we interacted with was excellent. We definitely will be going back. My only complaint is not directed at Dome Quixote but at New Denver itself. There seems a shortage of eating establishments in the town. that didn't bother us too much as we made our own breakfasts and were traveling to other areas and eating elsewhere.", "title": "A Little Piece of Heaven", "helpfulness": 2, "user": "WingNutt2000", "date": "January 14, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 23561399, "likes": {"liked": "— The architecture."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Very comfortable accomodation in unusual \"dome\" cottages in an interesting small, ex-mining, community and a beautiful setting. Well equipped self catering in the cottage and good common facilities in the complex.", "title": "Unusual accomodation in a beautiful setting", "helpfulness": 3, "user": "BandS_8", "date": "October 16, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 20933467, "likes": {"liked": "— Private and peaceful accomodaton", "disliked": "— Lack of places to eat in town in the evening"}}], "location": {"country": "Canada"}, "variance": {"poor": 0, "average": 1, "very good": 6, "terrible": 0, "excellent": 29}, "slim_ranking": 0.333333333333}