{"user_rating": 4.5, "review_count": 31, "name": "Villa d'Azeglio", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Italian village life does not get any better. Spotless accommodation, freedom of lush garden grounds, complete privacy allied to proximity to village stores (bars, groceries, bread, pizza, post office), constant on site assistance.", "title": "Chill to Perfection", "user": "CeccoBeppe", "date": "September 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 19892056, "likes": {"liked": "— Proximity to all our intended tours", "disliked": "— Leaving"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "30 minutes to Turin, 30 minutes to the walking of Canavese, 45 minutes to the slopes of Val D'Aosta, 10 minutes to Ivrea, regular bus to Ivrea where you can connect with trains to anywhere, 60 minutes to the Langhe, 'un oretta' to the Lakes.", "title": "Delightful villa", "user": "Hogsod", "date": "August 27, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 19431332, "likes": {"liked": "— Value for money", "disliked": "— Nothing adverse"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "This is an old, stylish villa, renovated using existing materials as far as possible - e,g, the bedroom floor is original old tiles; the bathroom is all new materials. The rooms are set up for self-catering stays of a few days, with a small kitchen, TV etc. We only stayed one night, a stop-over on our way south; returned again the following year; and probably again and again. Basic breakfast things were supplied - coffee, buns. Our room was big, the bed was enormous. Very comfortable and quiet. It makes an unique place to stay, easily accessible from the motorway.", "title": "Unique and lovely", "user": "salmoneater", "date": "April 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 127744095}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "Villa d'Azeglio was easily the best hotel stay of the two months that I have been traveling in Italy, Morocco, and Spain. The hotel is lovely, with so many small touches that make it feel special and comfortable. Everything was immaculately clean and well cared for, and the rooms were pretty and relaxing. The owners, Pier and Rosanna, could not possibly have been more welcoming or friendly or helpful. They made my stay there so pleasant that instead of staying a day or two as I planned, I ended up staying five days!", "title": "Absolutely stellar hotel--best place I have stayed in two months of traveling!", "user": "Pegmcg", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116177670}, {"rating": 5.0, "title": "Super Stay", "text": "The hotel is in a beautiful, easily accessible location. If you are traveling by car, Albiano is close to the motorway. I took public transportation--a train to Ivrea, and then it is just a five-minute bus ride to Albiano, and the buses run all the time. Very simple and convenient.", "user": "EFraenkel", "date": "April 28, 2011", "id": 106021187}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "The town of Albiano is gorgeous and a great escape from the bigger cities. It is a town of friendly people, good food, and so many lovely things to see: vineyards, old churches, red tile roofs, and nice restaurants and shops.", "title": "Amazing place", "user": "Willem_10", "date": "November 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85869818}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Villa d'Azeglio is the kind of place where I will return again and again. It is an absolutely restorative, wonderful establishment, and I could not have enjoyed it more.", "title": "What a gem!", "helpfulness": 1, "user": "EnfysSurrey", "date": "June 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32372923}], "location": {"country": "Italy", "region": "Piedmont", "continent": "Europe"}, "variance": {"poor": 0, "average": 2, "very good": 5, "terrible": 0, "excellent": 24}, "aka": "d Azeglio Hotel Ivrea", "slim_ranking": 1.0, "description": "The charming Villa d’Azeglio offers you relaxing holidays at the foot of the Alps.The Villa, built 1905, has been restored using original materials to keep intact its charm; at the same time have been added all modern comforts.The large garden offers quiet corners in the shadow of the ancient trees.You will be able to take walks in the nearby woods on the hills, use our bikes, discover typical taverns and cozy restaurants."}