{"user_rating": 4.0, "review_count": 857, "name": "Villa Del Arco", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "with a warm and inviting staff that goes above and beyond to make your entire family feel welcome - this beachfront resort is gorgeous, surpassed only by the non-stop view of the Cabo San Lucas Bay and the Baja Peninsula...", "title": "Relaxing Becomes The Routine...", "user": "Ken L", "date": "August 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171115479}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "the all-inclusive package is an excellent value if your days include staying on-site and moving back and forth between the pools and the beach and ocean; with numerous water activities conveniently headquartered on the beach next to the resort...", "title": "Good times, bad times, vacation time at the Villa del Arco", "helpfulness": 1, "user": "CeciPB", "date": "August 6, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 171105061}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "downtown is a quick and easy taxi ride to enjoy the excitement of Cabo San Lucas at night...", "title": "Tips from a Member for a great vacation", "helpfulness": 4, "user": "Cheryl C", "date": "August 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 171076941}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Many Cabo San Lucas resorts include impressive properties in close proximity to the areas natural beauty - but the staff at Villa Del Arco makes the difference - friendly and attentive employees in every phase of the property - all doing their part to deliver personal attention and an outstanding vacation experience to adults and children...", "title": "The TRUE essence of Villa del Arco", "helpfulness": 4, "user": "want2xl", "date": "August 5, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 170965146}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "This was a last minute trip and our second visit to Cabo. We booked an All-Inclusive (AI) trip on a Friday night and departed with my husband and two kids from LAX the following Tuesday for five days/four nights in celebration of my bday. It was our first time doing AI.", "title": "Our Stay at Villa Del Arco!", "helpfulness": 1, "user": "Rosa H", "date": "August 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170931196}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "This is a beautiful place. We did not get hasseled about the time share program we got invited once after we checked in we said we werent intrested & that was it. Front desk very nice and so helpful. My husband & I traveled with my father and I was able to check him in fill out all the paperwork and get him a room a few doors away from us with no problems. My father arrived a few hours after us all he had to do was sigh the final paperwork. Our condo was so beautifulY decorated. The restaurants served delicous food. The sea food was amazing. We had not one complaint.. We even went to the beach party at the sister hotel and had so much fun.", "title": "Relaxing", "user": "Jenn42999", "date": "August 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170927894}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "the service was outstanding and the kids activities by Hugo and Fernanda were top notch, ADVICE be careful as the pool area is slipery,food was outsanding but beware that you know exactly what kind of medical coverage you have and what it will cover if you seriously hurt yourself and have to be flown to the states the shock is overwhelming", "title": "our stay", "user": "Gary K", "date": "August 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170442707}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We returned to VDA this summer for the 3rd time with our 2 teenage sons.", "title": "Wonderful Vacation", "helpfulness": 2, "user": "burndoc", "date": "July 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170112738}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Everything was wonderful, not one complaint. Check in was easy, bell staff great, very attentive.", "title": "Very nice resort", "user": "Trish-Edmonton", "date": "July 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 170057020}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Room was in perfect order. This was the busiest and most crowded we have seen the resort since we have been staying there but encountered no problems because of it.", "title": "If you can still change your hotel, consider it.", "helpfulness": 1, "user": "cp255927", "date": "July 29, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 169733455}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "There is very little question about the hotel's luxurious and beautiful accommodations. The rooms, maid service, and pool surroundings are all beautiful, extremely comfortable and luxurious feeling.The pool chairs have a thick topper with metal frames- no plastic here.", "title": "Luxurious accommodations/issues with restaurants", "helpfulness": 1, "user": "cj15", "date": "August 20, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173168665}, {"rating": 5.0, "title": "Perfect wedding!!!", "text": "The only issue I see and have experienced is the way they charge for all inclusive packages. You have to sign for absolutely everything and most of the time you need to go to the bar yourself to order. It is a difficult issue because they are not a mandatory all inclusive, but with having the option to opt out the servers treat the two customers very differently. The villa group owns this hotel , as well as the villa del palmar. The servers( overall) are more relaxed and happy at the Palmar vs. the Arco. There is an uncomfortable atmosphere at the Arco and after hearing/seeing the restaurants managers supervise the servers I can see why. Also the wait times for food is significantly long.", "user": "LanceNiederhaus", "date": "August 18, 2013", "id": 172837212}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Secondly, the Arco has started an elite service. If you have the extra money to waste- it is great, but don't expect a clear differentiation of service. The luxurious black towels can be gotten by the non-elite members as well.", "title": "Home away from home", "helpfulness": 1, "user": "David M", "date": "August 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 172151592}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "They have a set rate for walmart - $8 for group of four each way. To go from marina to Arco: $2 per person.", "title": "Cabo San Lucas", "helpfulness": 3, "user": "Paul L", "date": "August 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 171886492}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "btw- the weddings at the Arco are much nicer than the weddings at the Palmar. Hopefully this helps.", "title": "Warm and Welcoming Evironment", "helpfulness": 2, "user": "evanburk", "date": "August 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171791358}, {"rating": 2.0, "title": "Air Conditioning", "text": "I attended a wedding the end of July at Villa del Arco. The reception was held inside the restaurant specifically because it was promised that the room would be air conditioned. Unfortunately, the air conditioning was broken and the room was unbearably hot for many of the guests. Even though the food and service were very good, the reception was flawed for many of the guests, who had to go outside and could not participate in the dancing because of the heat. With the heat in Cabo San Lucas in July, it is unacceptable that a venue would not stay on top of air conditioning maintenance.", "user": "Evelyn F", "date": "August 11, 2013", "id": 171769785}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Villa Del Arco Resort and Spa is absolutely one of the “top 5” resorts we have stayed in. The size of resort was just right! Everything was picture perfect...from the cleanliness of the grounds, to the beautiful “Penthouse” two bedroom suite - featuring a wraparound balcony with breathtaking views of Medano swimmable beach and Sea of Cortez. The balcony included a hot tub, built in grill and so much more. We also had the view of the pool which has a pirate ship bar in it… the entire lay-out of the resort is pretty impressive! The pools were never too crowded and finding lounge chairs wasn't bad at all for my daughters. The resort has 3 swimming pools, exercise gym, Desert Spa, booking activities center, pool service, and trolley service to Villa Del Palmar and Estancia. There is also a small market with a pharmacy. The taxi fare to the Marina and local areas was basically between $7:00 to $8:00 dollars. We took the bus to Wal-Mart ($1/person - very jumpy, but a good experience) and took a taxi on the way back to the resort.", "title": "We loved it, loved it, loved it!!!", "helpfulness": 2, "user": "Martha828", "date": "August 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171634649}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "This was our family’s first trip to Cabo San Lucas. We were celebrating our youngest daughters “21st” birthday. I originally made our reservations through Expedia for 5 nights. About a month after I had booked the reservation, I wanted to get more information on Villa del Arco Resort and Spa. I came across destinationcabo.com website offering a 7 night 2 bedroom penthouse suite. I called and spoke to Bob Easton (tel:800-650-8199). I was a bit skeptical about their rates…they were much more reasonable than Expedia. Bob assured me we would be getting the view I was looking for and would be upgrading to the penthouse suite for less than what I was paying with Expedia. I was pretty excited…later that evening my husband called Bob to ask him a few more questions before we cancelled with Expedia and booked with destinationcabo.com. Unfortunately we couldn’t change our flight reservations and missed out on staying at VDA the extra 2 nights.", "title": "A fabulous place to vacation", "user": "Roseann D", "date": "August 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171536035}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Our housekeeper was absolutely a “GEM”…. Gudelia was amazing!!! She made our stay worry free. She was very detailed in her work – left the suite completely clean and always left very creative towel swans in the bathrooms and bedrooms. She is a wonderful, warm, and beautiful soul! She was such a hardworking individual – can’t say enough - just loved her! My daughters always made sure to leave Gudelia something extra! There is a daily tip fee of $3.50 charged to the room, but that's really nominal compared to the level of service you get here.", "title": "Average Place", "user": "Joe O", "date": "August 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 171274548}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We decided not to do the “all inclusive” and we were very happy with our decision. We did try the breakfast buffet and ordered in breakfast once and were not disappointed…food was delicious! There is a huge Wal-Mart in town and if you want to grab a quick bite to eat they sell these delicious taco, chilaquiles, rice, beans…etc. The store is very well stocked and organized and very “clean!!!” In fact I liked it better than some of the Wal-Mart’s in my home town! There are a lot of choices for dinning in the Marina area and the local areas. Our family enjoys dinning out and we always rate the restaurant’s service and quality of the food. The two that stood out were La Fonda and Mi Casa. The staff was always very courteous and helpful with any dinner arrangements. We also ate at Lorenzillo’s in the Marina…a little pricey, but a very delicious sea food choice.", "title": "Relaxed and renewed...", "user": "lesli a", "date": "August 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171274098}], "location": {"country": "Mexico", "region": "Baja California"}, "stars": 4, "variance": {"poor": 56, "average": 66, "very good": 235, "terrible": 60, "excellent": 440}, "aka": "Villa Del Arco Hotel Cabo San Lucas", "slim_ranking": 0.238805970149, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}