{"user_rating": 4.5, "review_count": 129, "name": "Village Inn At Apgar", "reviews": [{"rating": 4.0, "title": "Convenient location for beginning/end of stay in Glacier, great views", "text": "We stayed at the Apgar Village Inn in August on our last night of a 6-night stay in Glacier National Park. It was a convenient location for us, to ensure we weren't rushed to catch our morning flight out of Kalispell.", "helpfulness": 9, "user": "tarapup", "date": "August 31, 2007", "id": 8590912}, {"rating": 3.0, "title": "Paying For The View... Only The View", "text": "We booked the Village Inn through the park's concessionaire - you can find it on the web. We paid $115. It was a fine value for the money.", "helpfulness": 2, "user": "MiddleTennessee", "date": "July 2, 2007", "id": 8042376}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "The Village Inn has a small office (which offers free coffee in the morning), with friendly staff. The motel has two levels. Those who have a 2-bedroom or larger room are on one side of the motel; those who seek a 1-bedroom are on the end. We had a 1-bedroom room. The room has no phone or TV (which was fine with us), and contained two twin beds. The bathroom had a bath with shower. There was a small bureau and one padded chair in the room. We got a hairdryer from the office staff.", "title": "Memorable view but request upstairs", "helpfulness": 2, "user": "SageTraveler", "date": "June 30, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 8031636, "likes": {"liked": "— Location", "disliked": "— Placed underneath rude, noisy and large family"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The Village Inn is a basic, spartan, motel room with one notable exception: the fabulous views from each room. The rooms are all on Lake McDonald - at 10 miles, the largest lake in Glacier National Park. It was wonderful to see the sun set over the lake, and the sun rise the next morning. It appears to be the custom for folks to sit outside their rooms in the evening (plastic chairs are provided by the hotel) and watch the lake and the goings-on. We enjoyed this a great deal, and it was quite relaxing after a day of hiking. Kids played on the rocky beach, and kayaks and canoes were out on the lake (there are boat rentals just outside the Inn).", "title": "Great Location", "helpfulness": 1, "user": "VeeBee66", "date": "June 24, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 7977301, "likes": {"liked": "— Location", "disliked": "— No plug-in in the bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "This area of the park is quite crowded with tourists. It also was, unfortunately, the only time on our trip that we smelled cigarette smoke. While the rooms were all non-smoking, there was a man who was ignoring the park's \"no smoking\" restriction (because of fire danger). That was the low point of the stay for me, but probably not something that staff at the Village Inn noticed.", "title": "What a view! Quaint town was a treat, too", "helpfulness": 2, "user": "Rundle's_Parents", "date": "July 22, 2006", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 5496146, "likes": {"liked": "— The incredible view!", "disliked": "— Downstairs rooms can see quite a bit of foot traffic outside their doors"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Arrived in the pouring rain to a musty smelling rooms due to a section of carpet being wet. Didn't really affect us so I didn't deal with it since we weren't in the room that much. Rooms themselves were clean and comfy but not large. We were in the top level of this extended 2 story structure. 2 bedrooms and a very small living room. Reasonably quiet in part to us getting an \"end\" unit. Some noise from a machine or generator below us which served almost as \"white noise\" Small but ok bathroom. No referigerator.", "title": "Great view but..", "user": "chaimlit", "date": "August 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 39179708}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "Fabulous view since you're perched right outside Lake MacDonald and you have an extended porch or balcony. We enjoyed our beverages and conversations while gazing out on the lake. Also rented a canoe one morning and really enjoyed our adventure.", "title": "A Good Stay in Glacier Park", "helpfulness": 1, "user": "gome", "date": "August 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 38212094}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Eddie's restaurant, close by ok, but nothing special.", "title": "FAB-U-LOUS", "helpfulness": 2, "user": "OFamily5", "date": "August 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 37626643}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Got a very nice meal and wonderful service a few miles away at Lake MacDonald lodge restaurant just a few miles awayabout 9 miles along the lake. Worth the drive.", "title": "Absolutely Pefect", "user": "librarychick", "date": "August 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37020082}, {"rating": 5.0, "stay_parameters": "Stayed June 2009", "text": "This inn is not a 4 star hotel but is certainly not 1 star either. It is a hidden gem because the inn is located within the national park, it right on Lake McDonald, the largest lake in the park and each room gives a clear view of the glacier mountains. The 2 bedroom handicap room which I occupied was beautiful with natural wood furnishings, a full kitchen and large bathroom. The bath towels were good, the room was very clean, and the beds were very comfortable. Since we only stayed one night, I cannot tell you much about the maid service. But, the people in the office were kind and helpful. As for food, one tee shirt said it all, \"almost everyone eats at Eddies's.\" Also, and most importantly, you need a car if you plan on an extended stay. The Village Inn at Apgar is a good place to stay in Glacier National Park.", "title": "Gorgeous Setting", "helpfulness": 1, "user": "stillhouse1", "date": "July 10, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 34430481}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "I just wanted to clarify that, unless they've mysteriously moved it, Village INn at Apgar is in WEST Glacier, NOT EAST Glacier.", "title": "Wonderful, but NOT in East Glacier", "user": "VickiOnTheRoad", "date": "April 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 27803278}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "That said, we had a wonderful experience there. We arrived at the park on a day when the air was quite smoky from forest fires. I was quite depressed, because I had booked our room specifically for the view of Lake McDonald and the mountains beyond, all of which were cloaked in smoke when we arrived. The next morning, my husband and I awoke quite early - at sunrise. The mist had lifted, and the view was nothing short of pure magic. We made coffee (coffee and pot provided in room) and sat out on the deck watching the sunrise. An unforgettable moment in our Glacier trip!", "title": "Amazing Views - great stay!!", "helpfulness": 1, "user": "Honeymoontime", "date": "September 15, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 20104339, "likes": {"liked": "— View was excellent", "disliked": "— Basic - no TV !"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "It's been a while since this stay, but I seem to remember the service in the office was somewhat slow, but the room itself was simple but comfortable - it was actually two rooms, which was nice, allowing the kids to have their own space.", "title": "Loved The Village Inn", "helpfulness": 4, "user": "tanddGaithersburg_MD", "date": "August 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 19011432, "likes": {"liked": "— location, location, location", "disliked": "— price"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "We stayed at the Village Inn at Apgar during a recent trip to Glacier National Park. We had a second floor room and the view was amazing. The Inn is located right on Lake MacDonald and the location can't be beat. The staff was nice, the room large and clean. And since it was September the night was a little cold, but the in room heater was great. Lots of short hikes and places to explore right from the Inn. And don't miss a trip on a Red Bus/\"Jammer\", that was a highlight of the trip for us!", "title": "Loved it! Great view!", "helpfulness": 4, "user": "Shibs8", "date": "June 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17230959, "likes": {"liked": "— The wonderful view!"}}, {"rating": 4.0, "title": "5 Star View", "text": "Village Inn is the place to stay in Apgar!", "helpfulness": 5, "user": "amcbeig", "date": "September 10, 2007", "id": 8690146}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "We had an outstanding experience at the Village Inn. Operated by the park’s designated vendor, the Village Inn is located on the shores of Lake McDonald. All rooms face the lake, offering an unparalleled view of the lake and its surrounding mountains. The rooms are small but perfectly adequate and very, very clean. Furnishings are older but very well maintained. Our room included a small coffee maker with coffee and tea.", "title": "Unbelievable Views", "helpfulness": 1, "user": "Muriel12", "date": "July 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 70155548}, {"rating": 2.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "Apgar is a very quiet, relaxed, and friendly village. It includes services administered by the park as well as by private vendors. The area is incredibly easy to navigate by foot and includes a variety of shops and at least two restaurants (with very affordable, decent food). Apgar is about 10 miles south of the northern end of Lake McDonald, where you’ll find another lodge and the dock for boat tours. One of the reasons we opted to stay at the Village Inn was its proximity to rafting companies outside the gates of the West entrance to the park. We were able to easily leave the park to raft without driving endless miles. It’s also a fabulous starting point for exploring Glacier National Park, including the drive on Going-to-the-Sun Road.", "title": "Convenient Location, Good Size Room, Overpriced", "helpfulness": 1, "user": "HendersonNVTraveler", "date": "July 3, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 69570241}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We stayed only two nights before moving on to Many Glacier Hotel for another three nights. More than once, we wished we had stayed longer at the Village Inn. The wildlife viewing and hiking around Many Glacier was fantastic and, in the end, made up for the deficits of the hotel. But if you are not interested in extensive hiking, plan to stay at the Village Inn and only schedule a day trip to the area around Swiftcurrent Lake and Many Glacier Hotel. The hotel and its services were very disappointing in contrast to the Village Inn.", "title": "What A View!", "user": "bgtravellers", "date": "June 6, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 66676572}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "I don’t know if it was pure luck or the norm, but the folks who stayed at the Village Inn were very quiet and respectful of others. All rooms include 2 lovely deck chairs outside the room to sit and view the lake. At all hours of the day and evening, guests sat quietly to either read or take in the view. Only once did we hear some rambunctious kids who were quickly quieted by their parents.", "title": "It's all about the view!", "user": "tennesseegirl0", "date": "September 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 42721903}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "I don’t believe the property offers an elevator, so if stairs are a problem, be sure to request a first floor room.", "title": "The views!", "helpfulness": 1, "user": "flos", "date": "September 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 39593811}], "location": {"country": "United States", "city": "West Glacier"}, "variance": {"poor": 2, "average": 9, "very good": 54, "terrible": 0, "excellent": 64}, "aka": "Village Inn At Apgar Hotel West Glacier", "slim_ranking": 0.285714285714, "description": "Built in 1956, the Village Inn at Apgar is located on the shores of Lake McDonald. This quaint 36 room motor inn offers stunning views from every room of Lake McDonald and the mountain panorama forming the Crown of the Continent. One-bedroom kitchenettes are available, as well as one- and two-bedroom units that can accommodate up to six people. One-bedroom kitchenette rooms are located on the 1st floor and are equipped with basic utensils, refrigerator, stove, microwave, and coffee maker. One-bedroom units are located on both floors and can accommodate a maximum of two people. All rooms are rustic yet comfortable with double and/or twin beds and a private bathroom. Second story rooms are accessed via stairs only and all rooms have an incredible lake view. A limited number of ADA-accessible rooms are available and are booked based on space available"}