{"user_rating": 4.5, "review_count": 209, "name": "Villa Trigona", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "I stayed in this country resort with my wife and my son for a couple of nights. We got there at midday and we were informed by the receptionist, in a cold and indifferent way, our check-in should be expected not before 15:00/15:30 p.m. (it means absolutely later than indicated on their web-site). However, I waited for three hours and when, finally, I got the room, I found a double instead of a triple, so as I had reserved: a further wasting of time in order to get the third bed inside.", "title": "Elegant mansion...but lack of organization!", "helpfulness": 1, "user": "GiovanniPalermo", "date": "August 23, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 2.0}, "id": 173645472}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "Room well equipped, even though, the second day, they didn’t replace any toiletries.", "title": "Lovely B&B and Great Location", "user": "ML0418", "date": "August 19, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 173068538}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled solo", "text": "We had our breakfast in an elegant area in a corner of the the garden but the atmosphere was completely spoiled by a lot of buzzing wasps.", "title": "Villa Trigona...heaven on earth", "user": "Sarah M", "date": "August 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171202613}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Maintenance works all day long during our stay, in the courtyard: it means escavators, dust and noise. Unbelievable to tell, but a member of the staff knocked on my door at 15:30, while I was sleeping for my “siesta”, warning me to move straight away my car (regularly parked in the parking area), because of the works. So, when I got there, I found my car, in the middle of a \"battlefield\", under a deep blanket of dirty dust (I found a lot of dust even in the engine!). I complained for this incredible treatment and, in order to recover, they tried to clean the car by means of a garden sprinkler, getting a shabby final result.", "title": "B & B at its Best", "user": "lorna B", "date": "July 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 170115599}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "What to say: for sure it’s an ancient and elegant mansion but, because lack of organization, it was under my expectations: too bad circumstances, to consider them just coincidences!", "title": "Excellent, location, staff, service, food", "user": "stuartMalta", "date": "July 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168139780}], "location": {"country": "Italy", "continent": "Europe"}, "variance": {"poor": 8, "average": 13, "very good": 67, "terrible": 0, "excellent": 121}, "aka": "Villa Trigona Hotel", "slim_ranking": 0.181818181818, "description": "Elegant mansion built between 1700 and 1800 offers accommodation in suites and rooms. The rooms which feature air conditioning and are fitted with en-suit bathroom. The Villa is situated less than 1 km. from Piazza Armerina and is surrounded by 50,000 sq. m. or green countryside. Ideal for relaxing tourism, cultural and gastronomic stays. Excellent meals exclusively cooked for the Villa’s guests can be enjoyed upon reservation."}