{"user_rating": 4.5, "review_count": 1022, "name": "Villa Premiere Hotel & Spa", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "This resort is very nice, quaint and well cared for. We particularly enjoyed all the small touches - like the welcome massage, a custom scented room, a menu of available pillows and very personalized, top notch service from the concierge and hotel staff. I was very impressed with the quality of the food. Both the Mexican restaurant and Italian restaurant are beautiful and served very tasty dishes. The resort was less crowded while we were there and so we had no problems finding chairs at the pool and even enjoyed the beach-side beds for two days. The only downside we found, and it was significant, was the pool/bar/lunch food and beverage service. The service was exceptionally slow and inattentive. At times it seemed almost rude! In our experience, the drinks were often bad and had either too much or too little alcohol. This was particularly frustrating given the exceptional level of service everywhere else on the property. Having said that, we would likely go back to Villa Premiere. (If you go to this resort, rather than getting drinks at the pool bar, go to the Italian restaurant bar which opens onto the pool. The bar tender there was friendly, very professional and mixed awesome drinks!).", "title": "Very nice, but not perfect.", "helpfulness": 3, "user": "Bug3", "date": "April 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127301545}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "It had been a year since we last visited Villa Premiere Hotel & Spa and we were once again welcomed. This Hotel should be an example to all of how service exemplifies your rating. They go the extra distance, any and all reasonable request are honored. We were personally escorted by a hostess (not a bellman) to our 7th floor retreat. All rooms are sea views, there is not a bad room in the house. On our table was a plate of welcome chocolate covered strawberry and a welcome note. The room had been made ready with our selection of pillows along with aroma from incense we selected. Oh by the way, did I mention that this is an ADULT only hotel; what a fantastic concept! If there were a ****** 6-star rating this property would well deserve the honor. Look forward next year to once again returning to Villa Premiere Hotel & Spa!", "title": "Returned 2nd Year in a Row to Our Favorite Hotel", "user": "Travel-R-Us-One", "date": "April 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 127289848}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "My husband and I chose Villa Premiere for our first trip to Puerto Vallarta. We are used to staying at very nice resorts, and we prefer resorts with an adults only policy, which Villa Premiere has. In fact, we felt a little bit like kids ourselves, considering the average age of the guests appeared to be quite a bit older than us during our stay! I am 37, my husband is 44. Don't get me wrong, this was a lovely, peaceful place. As the week went on, we did meet a few couples our own age who were also staying at the resort, but they shared our opinions that we were in the minority age group. I've broken down our pros and cons below.", "title": "Beautiful place: Pros and Cons", "helpfulness": 7, "user": "Tara J", "date": "April 2, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 127139264}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Pros: The property and rooms were beautiful and kept very clean. The 5 minute massage upon check-in was heavenly after getting up at 2:30 in the morning to catch our plane. The front desk staff and concierge were always friendly and helpful. The pool area was peaceful--a great place to read a book, take a nap, or have a conversation. The resort is located only a few blocks from the boardwalk, so it was great to be able to walk out of the resort and wander around town for the afternoon. The mojitos were made from scratch--not a mix! The food was pretty good. We had a very relaxing couples massage at the spa. We liked having the option to choose each day whether or not we wanted to be on the all-inclusive plan.", "title": "2nd trip, 3/22 to 3/28", "helpfulness": 1, "user": "lynn0404", "date": "April 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 127136240}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Cons: The biggest con, unfortunately, was the poor drink and food service. Our service at breakfast was always excellent, but that's where the positives end. The drink service around the bar and pool was the worst we've ever experienced. We would order a drink, and 20-30 minutes later we would have to grab the same waiter as he walked by and order it again (or my husband would go to the pool bar to re-order and the bartender would tell him that we should be ordering from the waiter). We always made sure to tip well after receiving our first drink, so the waitstaff would know we appreciated their efforts, but after a couple days of good tipping and poor service, we decided the tips didn't seem to matter. We ate dinner at the resort twice, and while the waitstaff was friendly, again the service was very, very slow. While I liked the small size of the resort and the quiet atmosphere, it's not for everybody. My husband would have preferred a little more action, like maybe some music around the pool area once in a while, or to sit at the swim-up bar and actually have other people sitting there to talk to. I don't blame the resort for this--it's just a comment on the atmosphere. We did go next door one day to the sister resort (admittance is included when you stay at Villa Premiere), but the drinks weren't as good (and they were out of ingredients for mojitos) and it was a pretty crowded place (maybe we sound picky, but we work hard for our vactions and know what we want). Lastly, trying to find chairs around the small pool area was almost always a frustration. There are signs posted around the pool asking people not to reserve chairs, but almost every morning that we tried to sit by the pool, all the chairs were taken--often at least half of them empty with a towel or book on them. We finally started getting up very early in the morning to place our own towels and books on chairs so that we could sit by the pool.", "title": "Not bad, but not a five star or luxury by any stretch...", "helpfulness": 2, "user": "surfandsandals", "date": "April 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 127053150}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We chose Villa Premiere for our Honeymoon after reading the great reviews on Tripadvisor. We had our wedding at Dreams Puerto Vallarta the week before and decided to switch it up for our honeymoon. We wish we had of just stayed at Dreams. This resort tends to cater to an older crowd and there was not too many guests under 50 years old.", "title": "Not for the younger crowd", "helpfulness": 2, "user": "CalgaryBeachgirl", "date": "March 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 126886595}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Pro's:", "title": "They did it again!", "helpfulness": 1, "user": "Barbara M", "date": "March 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126780483}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "- Amazing food, incredible! Best food we had in Puerto Vallarta.", "title": "Peaceful Oasis", "helpfulness": 4, "user": "watsonnat", "date": "March 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126760487}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "- Close to downtown, you can walk!", "title": "Total Relaxation", "helpfulness": 2, "user": "Sherrill R", "date": "March 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 126709377}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "-Adults only", "title": "Check your door - It may be unlocked!", "helpfulness": 3, "user": "Rachel W", "date": "March 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 126572150}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We just returned from a 5 night stay at Villa Premiere. First off, I was very relieved to see it was exactly what we expected after reading so many positive reviews. We had never been to PV, and with SO many places, and the distinctly different areas, in which to stay, it's a bit daunting when booking online. But Trip Advisor users once again steered us right!", "title": "Thanks again Trip Advisor reviewers!", "helpfulness": 3, "user": "Rand0la", "date": "March 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 125908167}, {"rating": 1.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "It was a short drive to the hotel from the airport, maybe 15 minutes....windows down and breeze blowing in got us in the right frame of mind right away. We entered the beautiful open air lobby for check in and were greeted with a glass of champagne, followed by a nice five minute massage. Very nice after a long morning of travel.", "title": "Still fantastic location", "helpfulness": 8, "user": "Corina C", "date": "March 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 125810176}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Our room was ready (after choosing pillows and room scenting) and we headed up, dropped our bags and got lunch.", "title": "Top shelf and close to town", "user": "Kevin M", "date": "March 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125806571}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The basic rooms are decent. Very clean for sure, just not very big. In fact, the only thing keeping our review from 5 stars is that we had two double beds and weren't able to upgrade. Everyone else we talked to seemed to have gotten a free room upgrade, but whatever, in the big picture it didn't affect the time we had on our vacation.", "title": "Another year at Villa Premiere", "helpfulness": 1, "user": "Roxanne H", "date": "March 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125777170}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The bed was comfortable, the view was fantastic and the room was clean. The little coffee maker served us well, as we used it every morning to have coffee on our balcony and look at the ocean.", "title": "Another great stay, BUT-----", "helpfulness": 6, "user": "blcase", "date": "March 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 125718198}, {"rating": 2.0, "title": "Disappointed with Service and Closed Facilities", "text": "We just returned from staying at the Villa Premiere for 4 nights. The location of the Villa Premiere is great in that it is about 7 blocks from the Malecon, but I don't think we would stay there again. This is a long review - but I hope it will be helpful.", "user": "Italy5", "date": "September 10, 2005", "id": 3892426}, {"rating": 1.0, "title": "Villa Premiere Sleepless Nights", "text": "The first thing we saw when we arrived was a big blue tarp over the outdoor restaurant, La Cieba, that blocked the view of the ocean from the lobby. We were told this restaurant would be closed almost all of the time we were there (and we had the AI plan). Then, after waiting to check in, we were shown to our \"Master Suite.\" The hotel's website is clear, and our travel agent confirmed, that all master suites have outdoor jacuzzi's. This was one of the primary reasons we booked this room category. They showed us to room 2601. While the interior looked like a master suite, no outdoor jacuzzi. I had to do much complaining and ask about a refund before the concierge admitted that 2601 was the only \"master suite\" without an outdoor jacuzzi (and again - website says ALL master suites have outdoor jacuzzi's). Then we were told that we could move to 2101 (all master suites end in 01), but we'd have to wait until around 5 or 6 pm while they fixed the broken jacuzzi, and the phone was also broken in the room. We opted for that, with the promise that we'd get to move to 2701 for the last 2 nights. 2101 was ok. I ilked the outdoor jacuzzi, but since this one is the lowest level of the master suites, it was noisy and not as private. It also had a smaller bathroom than the other master suites, and a single, not double vanity (again, the website promises double vanity). No working phone meant my husband had to go downstairs to the restaurant to order room service in person. Not really the point of room service. 2701 was beautiful. The only master suite with vaulted ceilings, and the best view from any room of the hotel. The views really are incredible, and you can hear the sound of waves crashing from your room. It did smell very smokey, which I didn't like. As you can see from all of this, all of this room switching and arguing to get what we paid for (jacuzzi, working phone, double vanity, etc.) was stressful and detracted from our trip. And, we had to fight for all this, when I later learned the hotel was only at about 20% capacity. I hate to see what they would do to you if they were full. We had prepaid our trip, and so we were stuck with dealing with this hotel during our stay.", "user": "Ann1147", "date": "September 8, 2005", "id": 3888884}, {"rating": 2.0, "title": "Nice hotel, but watch out for room roulette", "text": "Now for the restaurants. I already mentioned above that La Cieba was closed for most of the trip (with loud construction while they worked on it). Manglar was open the entire time, and was very good. Excellent food and good service. No complaints there. But, it would have been nice to have the variety we expected from three restaurants. Murales, the nicest restaurant and the one that is only open for dinner, was only open 1 of the 4 nights we were there. It was terrific, but disappointed that we only got to eat there once.", "user": "A TripAdvisor user", "date": "September 7, 2005", "id": 3880101}, {"rating": 5.0, "title": "Excellento!", "text": "The swim up bar was great, and the bartenders very nice. Room service food was also good (which we used a lot since the restaurants weren't open). All in all, the AI plan was not worth it, even though the food was very good. We just weren't able to utilize the AI plan services that should have been available.", "user": "portbird", "date": "August 29, 2005", "id": 3813705}, {"rating": 3.0, "title": "World Class Service???", "text": "The pools were both very nice, as was the beach. Since the hotel was pretty empty, often we'd be the only ones swimming. Definitely no fighting for beach chairs or beach beds.", "user": "DallasMatt", "date": "August 27, 2005", "id": 3811027}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "My husband and I stayed at the Premiere from July 5-10 for our honeymoon. We could have not asked for more. The food was great and the service was excellent. Our safe froze shut and we needed to leave for a tour. Someone was in our room within 5 minutes to fix the problem. The hotel was very clean. The poolside bar was great. Can't beat the view. The beach was a bit rocky, but it is swimable. The hotel was not full and we never had a problem getting a chair by the pool or one of the beachside beds. Also vendors in this area of the beach are not bad. There were a few that would come by daily, but if you tell them no they leave you alone. I would highly recommend this hotel.", "title": "Great Honeymoon", "helpfulness": 9, "user": "cinder9449", "date": "July 21, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3691466}, {"rating": 5.0, "title": "Loved the Villa Premiere", "text": "This was my fifth trip to Puerto Vallarta but my first at the Villa Premiere. It was truly excellent! The room was nice and we did not run into a problem with it being cleaned late. It was always cleaned when we came back no matter what time of day. The beds are too hard for me but that was remedied with an egg crate foam cushion from MEGA! My wonderful bellboy also helped by getting a second egg crate. No problem after that! The pool is fantastic and the fact there were no kids or loud music made every day relaxing. We only ate the hotel twice for breakfast which was fine. There are too many good restaurants in PV to go all inclusive anywhere! For those who want a recommendation, try Los Xitomates -- excellent! I tried the spa which was nice on the one day it was rainy all day. Weather was perfect, about 85 or so with lots of humidity! I will definitely be going back to Villa Premiere!", "helpfulness": 13, "user": "A TripAdvisor user", "date": "July 14, 2005", "id": 3664239}, {"rating": 4.0, "title": "Clean, Peaceful, and Tranquil", "text": "My husband and I recently returned from a 9 day vacation in Puerto Vallarta which we enjoyed immensely. This hotel and spa definitely added to our experience because of its proximity to malecon, its beautifully kept facilities, its breathtaking views, and most importantly its peaceful and spa-like atmosphere. The only downfall was the overpriced, over-greased, not very fresh food that although trying to be fancy by small portion size and decorative presentation, was definitely not gourmet. We were happy we didn't get the all-inclusive eventhough we did eat a few meals there out of convenience. There's so many places to try out in PV that this flaw didn't affect us much.", "helpfulness": 19, "user": "A TripAdvisor user", "date": "July 11, 2005", "id": 3658619}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "I have read some reviews that complain about the beach but did they see the other beaches in Puerto Vallarta? Rocky beaches are common on the pacific side all over Mexico and definitely prevelant everywhere in Puerto Vallarta. So this is not a characteristic of this hotel alone.", "title": "Simply.........Wonderful", "helpfulness": 15, "user": "BellaSI-821", "date": "July 11, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3658208}, {"rating": 5.0, "title": "Top Notch Service", "text": "This hotel was definitely more expensive than such a hotel would be elsewhere (we paid about $170/nt) but having done my research I knew that this is to be expected when visiting a popular tourist attraction such as PV...and having walked all over town, I can confirm that no others in PV compared to this hotel in overall ambiance.", "helpfulness": 10, "user": "Santu", "date": "July 9, 2005", "id": 3651889}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "My husband and I stayed at the Villa Premiere in mid-August for our honeymoon. Our original honeymoon plans to Playa del Carmen had been thwarted by Hurricane Emily (our resort was closed and would be for months), so we switched to PV last minute and booked the Villa Premiere based almost solely on Trip Advisor reviews.", "title": "Perfecto!", "helpfulness": 14, "user": "jessrkim", "date": "August 26, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3809636}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "We couldn't have been happier! Villa Premiere was the perfect honeymoon spot for us! We were greeted with a cold towel and a colder drink on check in, and when there was a small problem with our original room, Blanca, our concierge, upgraded us to a nicer suite. Our room was beautiful and we loved the jacuzzi tub. We were on the top floor and we loved the view we had of the ocean and the town.", "title": "Perfect hotel", "helpfulness": 16, "user": "pghkmh2", "date": "August 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3791400}, {"rating": 3.0, "stay_parameters": "Stayed August 2005", "text": "The service at VP was top notch. Everywhere we went, someone was saying \"Hola!\" and asking if we needed anything. We never had a problem with service, and had only great experiences with the entire staff.", "title": "Nice Hotel, Poor Service", "helpfulness": 11, "user": "borad", "date": "August 18, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 1.0}, "id": 3782459}, {"rating": 2.0, "stay_parameters": "Stayed July 2005", "text": "We took the advice of past reviews and didn't do the all-inclusive. I think the AI would be a great option for those on shorter trips (5 days or so) because the food we ate was all great. Some people have complained about the small portions, but that was actually what we liked when we ate at the restaurants there. Everywhere in town, our portions were so huge we came home stuffed. We really liked the food there. Not gourmet, but definitely tasty!", "title": "thought we would stay at adifferent hotel - always go twice a yr for the past 6", "helpfulness": 12, "user": "Carolanne4", "date": "August 11, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 2.0}, "id": 3755615}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "We used the spa a few times (great services) and used the tour desk to set up some great tours (Canopy zipline tour, Geronimo snorkeling tour, Rhythm of the Night show...all so much fun!). We also set up the Romantic Dinner on the Beach that you can get through the concierge, which was amazing!", "title": "Perfect little spot", "helpfulness": 17, "user": "JanaRaj", "date": "July 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3702487}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "Even though they can be helpful I really can't stand the extra long reviews on here so mine will be short and to the point.", "title": "Great Stay..........Again.", "helpfulness": 8, "user": "ajs2001tx", "date": "July 9, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3650610}, {"rating": 3.0, "title": "Great pool, OK rooms & food", "text": "We had a great stay and the Villa Premiere yet again. We were here last September for our honeymoon. We walked into the lobby and really enjoyed being welcomed by name on the big board. We checked in at 1:00 even though actual time is 3:00 and our room was ready. They had even got us into the same room we had on our honeymoon which they did on their own and we thought it was pretty cool. We were very pleased with the maid service but on the second day, and then everyday after that, we found that a 20-50 peso tip got us the usual sparkling room and then more fun stuff like the towels being folded into animals and roses and things. I know that sounds hookie but even being a guy that extra stuff is neat. The spa I would give an 8 out of 10. And only an 8 because I have not sampled enough spas to be a proper judge. And lastly while my wife and I really love children it really makes you enjoy the VP that much more when you eat dinner at another hotel like La Palapas or El Dorado there are no less than 50 kids running around screaming on the beach. It is just a major setting difference. Any questions you just ask away.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "July 4, 2005", "id": 3633716}, {"rating": 5.0, "title": "Villa Premiere - Absolutely Wonderful!", "text": "Just returned from a stay at the Villa Premier. I have to say I have mixed feelings.", "helpfulness": 15, "user": "Alberta", "date": "June 6, 2005", "id": 3534756}, {"rating": 3.0, "title": "Just ok...", "text": "The pros: friendly staff, 2 nice pools, including 1 with a swim up bar, decent food at moderate prices, on the inner edge of the hotel zone, so it's not too far from downtown.", "helpfulness": 12, "user": "aikenbones", "date": "June 4, 2005", "id": 3528094}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "The cons: late maid service twice (not done by 4pm), promise of a \"hot tub\" either on the balcony or in the bedroom turned out to be an oversized bath tub with jets in the bathroom, which has an open window that looks into the bedroom. From my estimate, less than a dozen rooms actually have a hot tub on the balcony.", "title": "I would return to the Premiere Hotel and Spa", "helpfulness": 19, "user": "ByronDallas_Texas", "date": "June 1, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3516370}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "My boyfriend and I just came back from a 3 night stay... Definitely not long enough but we enjoyed those beautiful days at VP. The staff is great... The spa is a little pricey but really nice. \"OMG\" the Jaiba taquitos are beyond amazing... I can't wait to go back just for that. Erick at the lobby is great... He sold us tickets for the Pirate show and he got us a deal for Nogalito and was always really nice to us. There is a guy that sits next to him (Erick)... I can't recall his name but he was trying to take us to a different hotel for a \"tour\" Yeah right! Obviously it was a trap for a time share. He got really upset when he found out that my boyfriend and I were not over 30 and did not qualify for this \"tour\" after knowing this he was very rude, unpleasant and mean. I really do not understand why they have people like him in this very nice hotel. Our stay was amazing but it would've been beyond amazing if he was not in the picture. Everything else was great!!! :)", "title": "Almost Amazing", "user": "Claudia S", "date": "March 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 126559111}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "I have been to Villa Premier twice now. I love that it is a small adult only hotel. The staff is very friendly and helpful. It is close to downtown but far enough that you aren't in a tourist zone. It's a very tranquil and relaxing place. Ok, here I go, it very much pains me to say this but I really did not like that upon check in my husband and I were approached by a man from the hotel who wanted to take us to the new hotel that the people who own Villa Premier and it's sister next door are building. Clearly a time share trap. I did not have this experience a year and a half ago on my first trip. I don't know what the deal is but please Villa Premier, stop this practice!!! That being said, it won't deter me from staying at VP on my next trip to PV.", "title": "Love Villa Premier", "helpfulness": 2, "user": "anne e", "date": "March 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 126396661}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "We were looking for one of those relaxing vacations where we did little other than sit by the pool and have guacamole every day. It was a great vacation. The staff was helpful, the pool was not too big or too crowded, and the views were stunning. It was great and I can't wait to go back.", "title": "Perfect relaxation", "user": "Ryan W", "date": "March 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 126370255}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We returned from Puerta Vallarta on Feb. 23rd, staying for 10 days at the Villa Premiere. This is our 4th year at the VP and we love it, especially the wonderful people that work there, making our stay so relaxing and peaceful that we didn't want to leave. The staff at this hotel is second to none, they work so hard to make everyones stay the best it can be!", "title": "Still love it, but needs work!", "helpfulness": 2, "user": "NWtopaz", "date": "March 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 126109556}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "However, there are some things about the hotel itself that bothered us this year.", "title": "SERENITY, PEACE & QUIET - WONDERFUL!!", "helpfulness": 2, "user": "chrisperryman", "date": "March 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126047644}], "location": {"country": "Mexico", "city": "Puerto Vallarta"}, "stars": 4.5, "variance": {"poor": 33, "average": 61, "very good": 193, "terrible": 15, "excellent": 720}, "aka": "Villa Premiere Hotel Puerto Vallarta", "slim_ranking": 0.0948275862069, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}