{"user_rating": 3.5, "review_count": 53, "name": "Villas Arquelogicas de Cholula", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "Villas Arqueologicas de Cholula is a well kept hotel, located in a walking distance from the pyramid and the Iglesia de Nuestra Senora de los Remedios, but quite far from the city center (Zocalo).", "title": "Good place to relax", "helpfulness": 3, "user": "humble_drinker", "date": "March 26, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 14552169}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "I guess it takes about twenty minutes on foot to the Zocalo. But I would not recommend to go back to the hotel on foot in the night, since the roads are really dark. There are taxis available around the Zocalo.", "title": "Laid back beautiful hotel vis-a-vis of the Great Pyramid of Cholula", "helpfulness": 3, "user": "sebail", "date": "November 30, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6308139, "likes": {"liked": "— The chef", "disliked": "— Rooms small and with a hotel 'smell'"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "I liked its location since it is far from the hustle and bustle of the city center, and its ambience was kind of calm and relaxing. The Zocalo of Cholula is in action until late at night!", "title": "A quant, well managed hotel near the archeologic ruins", "helpfulness": 5, "user": "SanAntonioTexas", "date": "July 30, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 5530332, "likes": {"liked": "— Clean, well decorated, probably has the best food in town", "disliked": "— Don't be afraid to hire a taxi and explore the surrounding area"}}], "location": {"country": "Mexico", "region": "Central Mexico and Gulf Coast"}, "stars": 3.5, "variance": {"poor": 4, "average": 15, "very good": 24, "terrible": 4, "excellent": 6}, "slim_ranking": 0.228571428571, "description": "Villas Arqueologicas Cholula is located in the city of San Andres Cholula, next to Puebla, Mexico, famous for its 365 churches and various festivities throughout the year, near the archaeological site of Cholula, and just four blocks from the historic city center, located just 30 minutes from the airport of Huejotzingo.Villas Cholula offers comprehensive facilities in a colonial style in conjunction with the past. Located opposite the pyramid of Cholula is the world’s largest pyramid in terms of volume. Above the enormous structure, stands the beautiful Nuestra Señora de los Remedios Church. The pyramid, which has been only partially excavated, contains approximately 4 miles of tunnels where pre-Hispanic murals can be admired.The Villa of Cholula is built around a central courtyard and looking onto lush gardens, brilliant bougainvilleas and a refreshing pool, the 45 guestrooms at Hotel Villas Cholula provide a peaceful retreat. The vibrantly colored plasterwork, tiled fountains and traditional courtyards create a Mexican experience accentuated by large painted murals and the rustic wood furniture within the public spaces.All rooms are decorated with wooden furnishings and offer pleasing views to the gardens. In addition, Villas Arqueologicas Cholula features a restaurant with delicious Mexican and international cuisine as well as regional dishes and a bar that features an elegant fireplace. The Hotel in Cholula also has five meeting rooms at your disposal for hosting conferences or business meetings."}