{"user_rating": 5.0, "review_count": 447, "name": "Villa Campestri Olive Oil Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "We just returned from a stay at the Villa Campestri, and are reliving this perfect vacation spot. The setting is gorgeous, the service impeccable(we were treated royally), the food elegant and delicious, and the room beautiful, elegant, and comfortable. The bathroom was filled with lovely complimentary amenities and very clean. We stayed in a junior suite with a friend, who felt very comfortable with the extra bed in the living room. Set high on a hill and looking out over the landscape, the terrace was a magical spot for dinner every evening. The wine list was extensive and wonderful, and perfectly accompanied the interesting and impressive menus.", "title": "Perfect in every way", "helpfulness": 2, "user": "Deborah946", "date": "August 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172835618}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "I would highly recommend the olive oil tasting course given by hotel owner Gemma Pasquali. Her knowledge and passion on the subject are infectious, and we left with a wealth of information about the growing of the olive trees, harvesting of the fruit, production of the oil, and the criteria for judging the quality and taste of commercial olive oils. This course is a must. Gemma was so engaging and generous with her time.", "title": "Wonderful and highly recommended", "helpfulness": 2, "user": "attack68", "date": "August 17, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 172701836}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Finally, the prepaid discounted price was a real deal. It would be difficult to find this level of luxury and comfort at this price anywhere in Europe. The Villa Campestri has my unqualified recommendation!", "title": "Incredible hotel, amazing food", "helpfulness": 1, "user": "MissPettigrew", "date": "August 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 172250989}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We stayed at Campestri Olive Oil Resort for one night in our week long trip around Tuscany. Of five hotels we stayed at this was easily the best. The setting is beautiful, the rooms are very clean and spacious (although they are all not the same). The touches in the villa - tapestries, paintings, decor, books - give the impression the owners really care about appearance and restoring it to its original beauty but in a way that keeps it upto date as well. Food was excellent and service was very attentive. We also paid €50 pp to experience olive oil tasting with the owners' daughter, Gemma, who was incredibly knowledgable, having an agriculture degree and a Phd, and enjoyed answering our questions as well as showing us around the resort. We really, really enjoyed it, and would add this resort to our list of places we would highly recommend to friends and family.", "title": "Villa Campestri, a life changing experience. When in Florence, stay at VC!", "helpfulness": 2, "user": "Adam Z", "date": "August 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 172039720}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "My husband and I stayed here for 3 nights after a holiday rental in Florence city. We took the train from Florence to Vicchio, which took about an hour and was very straightforward, and then a taxi on from there, organised by the hotel (about €30).", "title": "Perfect", "user": "Judy G", "date": "August 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 171860857}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Very imposing villa, clean, comfortable, and helpful staff. Set high on a hillside, the very old Villa retaiing a lot of 'old' but charismatic features, affords lovely views, particulalrly from the swimming pool, down into the valley and beyond. We stayed for four days having been in Florence for the previous 3, and it was a lovely contrast. However, it is a short drive, and is accessible by train, so it could be used as a base to travel into Florence if required. We did travel to Bologna, and Pisa to fly home, which are about 90 mins, and 2 hours by car respectively. Generous self service buffet breakfast, and very good food available at lunch and dinner.", "title": "Very enjoyable stay", "helpfulness": 1, "user": "NigeH", "date": "September 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 175128716}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Only minor complaint is that you have to ask at reception every time for drinks during the day and the evening.", "title": "Can't wait to go back!", "helpfulness": 2, "user": "TravelerFr0mPhilly", "date": "September 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175104681}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "A gorgeous resort with exceptional hospitality! The villa combines old word luxury and charm with a feel-at-home welcome, in a beautiful setting.", "title": "What a wonderful way to begin a journey!", "helpfulness": 1, "user": "Caeli", "date": "August 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 174984056}, {"rating": 5.0, "title": "Our most relaxing holiday ever!", "text": "The trip to the villa, through beautiful countryside, is an added bonus. We used the NavFree app, which provides offline free GPS for navigation, and found Villa Campestri with ease.", "helpfulness": 3, "user": "AggieC", "date": "August 23, 2013", "id": 173669469}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Dinner was delicious, and served outside. The kitchen was accommodating to our vegetarian needs.", "title": "To recommend", "helpfulness": 3, "user": "Sztivera", "date": "August 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173003159}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "My Husband and myself have just returned from a week long stay at Villa Campestri. We had read all the excellent reviews before deciding that this sounded like a special place to stay. I can honestly say it far exceeded our expectations in every way. All the staff were so warm,friendly and helpful and nothing was too much trouble. We ate in the restaurant twice and had delicious meals both times. The villa is beautifully furnished and is set in a stunning location, it was hard to tear ourselves away to explore all that the area has to offer. All the excellent reviews and visitor photographs cannot do it justice, you have to experience it to appreciate how wonderful it is.", "title": "Wonderful stay", "user": "LyndaG_10", "date": "August 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171388272}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Many thanks to everyone who plays a part in the running of Villa Campestri.", "title": "The definition of Hospitality", "user": "MikeHoustonTexas", "date": "August 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 170544710}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "Made a mistake. Only booked Villa Campestri for 2 nights. Should have booked for longer stay. Quick ride from Florence...though you need a detailed map or GPS. Absolutely lovely location, stunning views and hospitality beyond compare. Personnel always very attentive but not to a point of being annoying. The room we had was excellent.", "title": "Old world charm! Everything we expected it to be!", "user": "LeonardoM77", "date": "July 19, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 168130281}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We will make Villa Campestri a regular on our future Italy itineraries.", "title": "There are villas in Tuscany and this one is beautiful!", "helpfulness": 1, "user": "Lisette F", "date": "July 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 168126889}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Rented a car in florence and drove about 35km to Villa Campestri, driving can be challenging when you're in a foreign country, as was expected . We took the back roads and drove through the tuscan countryside armed with a paper map and 2 gps(s)! The views were stunning! It's worth the drive! We stayed at the villa for four nights in june, the grounds was charmingly natural and not overly manicured. The pool overlooked the countryside, the view was especially awesome early in the morning when the mist is rising out of the valley. The room they gave us was lovely and spacious, we loved the skylights and the claw foot tub! Every piece of furniture and fixture in the room was carefully selected to not deviate from the character of the region, no detail was spared, from the bed linens to the telephone! At night we opened the windows to let the breeze in and amazingly enough there were no bugs or mosquitoes, not one! And we were only about a floor up. The villa is relaxing, quiet, and comfortable - you won't hear car engines running, no machines humming, nor elevators ding-ing! If you want a quality tuscan countryside experience, intimate crowd, and non-commercial feel then this place is for you.", "title": "Secret treasure", "helpfulness": 1, "user": "Carla J", "date": "July 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168094550}, {"rating": 4.0, "title": "Fantastic calmness in the hills.", "text": "We were there for two days, our last place in Chianti area on this trip. Romantic settings that we liked, very quiet place and wonderful surroundings .", "user": "Winesurgeon", "date": "July 15, 2013", "id": 167691583}, {"rating": 2.0, "title": "Nice view but not much else", "text": "Food could be much better, wines", "user": "MikeS37209", "date": "July 15, 2013", "id": 167622515}, {"rating": 5.0, "title": "What a fantastic place......can't wait to go back", "text": "decent. We had to leave early in the morning, this was messy, gate was closed, so this made the ending a bit troublesome!!", "user": "SueDevonExeter", "date": "July 11, 2013", "id": 167193711}, {"rating": 5.0, "title": "Relaxation Haven in Eden", "text": "We pre-paid for two days for two rooms for our party of eight and left after the first night. The grounds were breathtaking but there was not much else to do except walk the hilly grounds. Getting to the hotel was so hilly and treacherous that you don't want to leave for the evening dinner and are stuck with the hotel for the night. The pool was difficult to get to for my mother-in-law down a long hill without useful stairs. We had dinner at the hotel and the food was good but very pricey. The rooms we had were dark and without air conditioning. My first night was horrible as the air was dead still in our dark room. The windows are without screens so opening them risks letting in any creature, bugs or critters of the night. Towels are available for the pool at 3 euros - ridiculous given the cost of the rooms. When I left early, I was hoping to get a partial refund for the prepaid second night but the staff was unwilling to refund a single cent, not the 18 euros for towels, the 200 euros for dinner or the 800 plus euros for the nights we didn't use. I will not be returning.", "user": "BeitRestaurants", "date": "July 11, 2013", "id": 167144684}, {"rating": 4.0, "title": "Great getaway", "text": "Just returned from 7 days at Villa Campestri.......Totally relaxing, fanatastic food,wine and i had a massage in the olive trees (a must at only 80 euro's for a full hour).", "user": "Esteffani", "date": "July 9, 2013", "id": 166989849}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "stars": 4, "variance": {"poor": 9, "average": 8, "very good": 43, "terrible": 2, "excellent": 385}, "aka": "Villa Campestri Olive Oil Hotel Vicchio", "slim_ranking": 0.333333333333, "description": "Villa Campestri Olive Oil Resort, a splendid Renaissance residence dating back to the 13th century, overlooks the Mugello Valley, north of Florence. Situated on a hilltop, the estate is immersed in a hug lush park with secular olive trees, providing a superb organic extra-virgin olive oil. A loving restoration has been carried out with full respect for the structural form and original materials of the buildings. The rooms and suites preserves the ancient fascination of the residence, thanks also to the period furnishings. Traditional Tuscan cuisine and a special Olive Oil Menu are served at the L'Olivaia Restaurant featuring stylish inner rooms and a striking outdoor panoramic terrace. The relaxing swimming pool boasts a stunning view of the Valley. An extensive choice of memorable activities is available: Oleoteca® to enjoy extra-virgin olive oil sensory experiences, Tuscan cooking classes, Ayurvedic massages with self-produced extra-virgin olive oil and essential oils and plant your own olive tree."}