{"user_rating": 4.5, "review_count": 37, "name": "Villa Maria Damigou", "reviews": [{"rating": 5.0, "title": "Absolutely wonderful!", "text": "We went to Greece – Athens, Naxos, Santorini - (from May 11th to May 28th). When we arrived in Santorini we had no accommodations booked. After going through the port rush, and dismissing the rather biased travel information shops, we made our way by bus to Firostefani in hopes of finding a place on our own...I was a little worried but I am glad we waited because we found Maria Damigou's wonderful villa! I recognized the name from seeing it a few times on tripadvisor. I don’t know how anyone could give this place a bad review (and for the previous review, I’d say it’s a shame to accuse the staff without any concrete proof…but that’s just my opinion) Maria is the sweetest little lady - she took us to our room and insisted on carrying my suitcase for me. She let us settle in for a few minutes and came back with two glasses of orange juice. The view of the caldera from our balcony was absolutely breathtaking! I think we might have had the best room in the place, and for only 80E including breakfast, we couldn't ask for more. The balcony was shared with the room next to us but we didn’t mind as it is very spacious and private (includes two tables, four chairs and two lounge chairs) and we loved our German neighbours :) The room also had a/c, a small fridge, a cooking surface and all necessary glassware, dishes, pots & pans and cutlery. The room was very clean and was cleaned every single day along with a daily provision of fresh towels. The hotel is not too far in Firostefani so it is a very easy walk to Fira, to Imerovigli and to the bus stop. There are restaurants, stores, mini-marts, etc. all a few steps away. On our last day we had a late evening flight and Maria graciously kept our luggage for us until our departure.", "helpfulness": 3, "user": "shmoukins", "date": "August 24, 2007", "id": 8496046}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The only tiny glitches I would point out would be, as mentionned by other travellers, the shower which is very ackward (little ceramic square border, no walls, no curtains, a little plastic stool to sit on and a shower head with nothing to hang it on while showering) - makes for a very wet bathroom when you're done, lol, and the included breakfast was a little basic (instant coffee, orange juice, white bread, jam and cake) but we heard from our neighbours that you could pay 10E less a night if you didnt want the breakfast - we still enjoyed it though as it was served to us on our balcony every morning :)", "title": "A Place to AVOID if you cherish your valuables.", "user": "WldTvlr", "date": "July 21, 2007", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 1.0, "location": 5.0}, "id": 8211486, "likes": {"liked": "— The View", "disliked": "— The small shower, lack of security, uncomfortable beds, and lack of attentiveness."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007", "text": "So all in all, Villa Maria Damigou is a wonderful little place, in a great location, for a great price, with a great host and with a spectacular view! We would definitely stay there again and recommend it to anyone!!!", "title": "Lovely little place", "helpfulness": 1, "user": "travellingteachers", "date": "April 1, 2007", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 7267530, "likes": {"liked": "— The location and the view", "disliked": "— The shower!"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "My wife and I stayed here for 4 nights in June as part of our honeymoon. Before we went, the reviews on Trip Advisor sounded great and Villa Maria's website made the rooms look nice and the views fantastic. We had certain expectations.", "title": "A lovely place to say!", "helpfulness": 2, "user": "travelingnatasha", "date": "September 10, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5786590, "likes": {"liked": "— The view, safety, and cleanliness.", "disliked": "— The shower head."}}, {"rating": 4.0, "title": "Wonderful rooms!!!", "text": "Those expectations were BLOWN!", "helpfulness": 7, "user": "Stinz3", "date": "June 27, 2006", "id": 5394961}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "We stayed here for five days and we absolutely loved this little hotel. We had a fantastic view; the room was clean; and everyone was really nice but laidback. The view is absolutely worth it if you can get a room with a view.", "title": "Loved Villa Maria Damigou", "helpfulness": 3, "user": "extraextra", "date": "August 28, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "business": 3.0, "cleanliness": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8520709, "likes": {"liked": "— The view, the location, the staff"}}], "location": {"country": "Greece", "continent": "Europe"}, "variance": {"poor": 1, "average": 0, "very good": 7, "terrible": 1, "excellent": 28}, "aka": "Villa Maria Damigou Hotel Firostefani", "slim_ranking": 0.307692307692}