{"user_rating": 4.0, "review_count": 67, "name": "Villa La Brise", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled solo", "text": "this hotel really is a hidden gem. It is a small distance away from san remo but the bus service goes right past midnight and only costs a euro each way. The staff at the hotel are superb. Of the staff i met One woman there was very helpful in directions and advice to places of interest and gave me a free bus journey ticket and also a friendly man helped me with local advice about san remo. I asked for a room with a balcony and i was accomodated with this. I also hired a bike free to explore the surrounding area and san remo town. There is free internet in the lobby and wireless outside the lobby. There is no restuarant but a good bar with great affordable prices and the breakfast was excellent fresh bread rolls with butter and jams, brioches, croissants/pains du chocolat and hot drinks with juice. I would love to have left a tip for the wonderful staff but was quite tight for money. Id definitely recommend staying here.", "title": "Great hotel stay here", "user": "alanmack30", "date": "May 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 30956505}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "This is a small family run hotel which is perfect for relaxing. There is a breathtaking view just above the sea, it is very clean and has an oldish style to its interior design that makes it feel like home. The owners are extremely kind and speak great English. Breakfast is excellent. Great value for money and real relaxing time.", "title": "Had a great relaxing time with family", "user": "FatbankD", "date": "February 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24623517}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Very nice, friendly family simple hotel. The breakfast was ok,could be better. Our room was on the street so you get a little noise but the view was fantastic!!! The beach is right across the street and the price very reasonable. We will stay there again!!", "title": "great view good value", "helpfulness": 1, "user": "skylane9", "date": "September 17, 2011", "detail_rating": {"value": 4.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 118244306}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Beautiful garden with Mediterranean plants and flowers, and magic sculptures of dwarfs welcome you.Friendly and helpful owners contribute to the pleasant stay in the hotel.", "title": "Unforgettable 7 dwarfs!", "helpfulness": 1, "user": "Jovanka B", "date": "August 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116861935}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Rooms were clean and full of light, with wonderful view of the sea and Sanremo, even without a balcony.Good breakfast and good service offer promising start of the day.The beach is near ( use the public one) as well as the bus stop with good connection with Sanremo and nearby cities.We recommend Villa la Brise for everyone.", "title": "Nice b&b, friendly service", "user": "Harry95", "date": "May 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 108317923}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We only stayed one night and I didn't realise it was quite so far out of San Remo town centre (3k), however, staff were wonderful and there is a free bike service and they even have tickets if you want to take the bus into town.", "title": "Very Noisy Traffic", "user": "paulgoo1", "date": "June 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 1.0}, "id": 67925500}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "Very dated and in need of a refurb, particularly in the rooms. It takes an age for the hot water to work it's way up to your shower if you are the first ones to shower in the morning!", "title": "a great location and friendly staff, and a good breakfast too", "user": "heragirl", "date": "June 30, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 33538091}], "location": {"country": "Italy", "region": "Liguria", "continent": "Europe"}, "stars": 3, "variance": {"poor": 8, "average": 14, "very good": 27, "terrible": 1, "excellent": 17}, "aka": "Hotel La Brise", "slim_ranking": 0.270833333333, "description": "The hotel Villa La Brise is located only 50 metres from the beaches with beautiful views over the bay of Sanremo from most of the rooms. Next to the local bus stop and mainline buses, with a small free parking, offers the possibility to visit Sanremo and the beautiful surroundings comfortably and hassle free. The newest bicycle and pedestrian promenade, linking Bordighera to Imperia with breathtaking views on the Ligurian cliffs and beaches is only across the road and is easily enjoyable with one our free bicycles. With internet point, hi-speed WI-FI connection in the rooms, in the hall, bar and garden, table games and free bicycle rental it is the ideal place to spend a week end or long summer holidays in total relax."}