{"user_rating": 5.0, "review_count": 182, "name": "Villa Lukas", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We stayed for 5 nights in early July and were absolutely thrilled. The view was magnificent and the sunsets legendary. The apartment was beautiful, spotlessly clean and the owners so helpful. Parking was easy and a little shop right there. We would recommend this highly. It was in a very quiet spot but close to go anywhere and the bus handy. Villa Lukas organised a pickup from the ferry right to their door.", "title": "Wonderful view, easy access", "helpfulness": 7, "user": "Theblackwells", "date": "November 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 48711409}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We sat each night on our roomy terrace and soaked up the atmosphere. The Blackwells from New Zealand", "title": "Fantasic Trip to Santorini", "helpfulness": 6, "user": "TrishG25", "date": "November 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 48273193}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "My husband and I, as well as friends of ours planned to celebrate our 25th wedding anniversary in Greece. After many hours on the internet and using trip advisor as my main source of information I decided to book Villas Lukas in Imerovigli, Santorini for a weeks stay. Helen made arrangements for a van to pick us up at the airport. Upon arrival to Imerovigli we were amazed at how absolutely gorgeous it was. I was a little nervous about what our accommodations would be like but it was a pleasant surprise. Our apartment was spacious, traditional and very clean. Our friends had an apartment beside us and we shared a very large balcony. The view from the balcony was spectacular. We felt that we had one of the best views and beautiful sunsets of anywhere on the island. The only complaint I would have was that the beds were very uncomfortable although I found that most of the beds in greece weren't the most comfortable mattresses. I would also recommend that Villas Vukas invest in lounge chairs for the balcony. The complaints are minor compaired to the wonderful memories we have of Santorini and Villas Lukas. I would definately recommend Villas Lukas to anyone visiting Santorini. I would also recommend Imerovigli over Fira and Oia. it is much less crowded and less touristy.", "title": "Amazing View", "helpfulness": 6, "user": "lych13", "date": "October 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 47468235}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Unforgettable holidays in a room with amazing view. Very welcoming and helpful. Reasonable prices.", "title": "Great value", "helpfulness": 5, "user": "macocotte64", "date": "October 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 47364227}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We stayed 4 nights at Villa Lukas and were very pleased. The location is perfect and the view gorgeous. The room was beautifully decorated and super clean. We wanted to rent a car and were assisted in doing so by Helen (the owner's daughter). It was extremely convenient. There is a free parking area a few steps away from the entrance of Villa Lukas. We felt very welcomed at Villa Lukas. The only part we didn't like was the bed : hard as a rock, but per our experiences it seems to be normal in Greece. There is a convenient store across the street. That was helpful. We had read on Tripadvisor that the neighboring hotel had a pool you could use and that is true. We didn't use their pool but we enjoyed their jacuzzi instead, what a treat!!! Overall, we are extremely satisfied with Villa Lukas. It is a beautiful and quiet place. There are so many choices in Santorini and it was difficult for us to choose but we can honestly say that we felt we made the right choice considering how affordable it was. it was a great value.", "title": "an enchanting experience", "helpfulness": 5, "user": "MiVoo", "date": "September 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 44924186}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "I had the opportunity of staying at Villa Lukas for a week this September and I found the hotel great, as it combines prices that are affordable with the best view around the island of Santorini. It's also clean and the service was perfect. If you are willing to visit Santorini and particularly its Caldera, don't hesitate... Villa Lukas won't disappoint you!", "title": "UNIQUE ACCOMODATION - EXCELLENT SERVICE AND PRICES", "helpfulness": 5, "user": "AyeCaramba", "date": "September 21, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 43322854}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "I stayed here for 5 amazing nights in late May. The location in Imerovigli can't be beat. Sidewalks are non-existent in Santorini so having a pedestrian pathway along the caldera cliff side from Imerovigli to Fira was a blessing. The staff is SO nice and helpful. The rooms are large and tastefully decorated and each one has a jaw-dropping view.", "title": "Most breathtaking view in all of Santorini", "helpfulness": 5, "user": "bboyneko", "date": "August 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38713121}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The price is very fair for what you get. There is a very convenient shop just outside the main entrance that sells good local wine and lot's of delicious snacks and food.", "title": "A superb place in Santorini", "helpfulness": 7, "user": "sxaris", "date": "August 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 36648572}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "This is THE place to stay in Santorini. We did not have a car, we simply took one of Santorini's many affordable luxury taxis to every destination we wished to travel to. Santorini is an amazing island and this is a beautiful hidden gem of a hotel. A highlight of our trip was sitting on the balcony with a bottle of greek white wine to watch the sunset.", "title": "Quiet place with great views", "helpfulness": 5, "user": "fuchslica", "date": "May 31, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 31233423}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We spent 1 week this summer (June-July 2009) at Villa Lukas at Imerovigli, in the island of Santorini. We picked the place literally at random after we got allured from the pictures we saw in a travel magazine and the hotel’s web site. Immediately after, we called the hotel to make a reservation and we surprisingly found out that the owners Mr. Lukas and Mrs Popi were extremely nice and professional people, a rare event I believe for family owned businesses in Greece. The reservation details were finalized very smoothly as well; I received an email acknowledgment as soon as I sent the 2-day down payment.", "title": "A great place to stay - Villa Lukas", "helpfulness": 5, "user": "JenniferHK", "date": "April 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 27899075}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Owner Lukas was extremely friendly and helpful in securing volcano tour, bike rental and taxi for us. Location is good with a convenient store located right across the road. Another 5 min walk would lead you to the bus stop that connects Oia and Fira with many other grocery stores along the main road.", "title": "Excellent stay", "helpfulness": 6, "user": "sg_stef", "date": "July 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 70166585}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We stayed in the room next to the stairs on the 2nd storey (from the top.) It was very clean and had a nice view of the caldera. There's a kitchenette for making a simple breakfast; a cable TV that swivels between the bedroom and living area. We didn't want to leave.", "title": "The best sunsets in a peaceful atmosphere", "helpfulness": 7, "user": "meshell13", "date": "July 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69773188}, {"rating": 4.0, "title": "Shhhhhhhhh.....", "text": "Enjoying the sunset right in front of our room was one of the most romantic moments in Greece! If you're looking for privacy while enjoying the sunset, this place is for you. Oia's sun seems bigger and closer than that of Imerovigli, but there are tons of people lining up the streets and rooftops, it's hard to ignore the crowd...", "helpfulness": 6, "user": "Prehensile", "date": "March 2, 2010", "id": 57507963}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "After much Internet searching we decided on Lukas Villas for our four day stay on Santorini, we were very impressed by the good value and encourage by the extremely positive reviews it has received. We were not disappointed!", "title": "A little piece of heaven !!!", "helpfulness": 6, "user": "NIKH", "date": "January 22, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54093418}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We were very impressed with the communication on booking, the owners described every detail of the accommodation and arranged our transfers from and back to the port. Lukas Villas is family run, and the owners are friendly and helpful while at the same time giving you space to get on with your holiday.", "title": "Top Value Stay", "helpfulness": 6, "user": "BruceDublin", "date": "November 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 48965114}], "location": {"country": "Greece", "continent": "Europe"}, "stars": 3, "variance": {"poor": 0, "average": 5, "very good": 33, "terrible": 0, "excellent": 144}, "aka": "Villa Lukas Santorini/Imerovigli, Greece", "slim_ranking": 0.108108108108, "description": "In Imerovigli, one of the most beautiful villages on Santorini, 400m above sea level on the northwest side of the island, you can find the Villa Lukas. located in an advantageous position it is easily accessible by our guests.Built with respect for our Cycladic architectural tradition and regard for your absolute comfort, our apartments - superior studios fully equipped and offer from their ample private verandas a unique-amazing view of Caldera (the name of our black volcanic cliffs), the volcano as well as the renowned sunset of Santorini. Our exceptional service with special emphasis to the cleanliness, our friendly attitude, all await to make your holidays an experience of a lifetime. If you choose us for your holiday, we’ll be delighted to serve you in any desired way. Villa Lukas is 2 km from Fira (the capital of Santorini), 7 km from the airport and 10 km from the port. It is 4 Km from the nearest beach. Our complex is a very short distance from the local bus station (100m). You can also find taverns, restaurants, cafes, confectioneries, super markets, mini markets, souvenir shops, tourist offices. All, in a distance from 10m to 200m."}