{"user_rating": 3.5, "review_count": 226, "name": "Village at Breckenridge Resort", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We chose the Village because of its location and the price. However we had read all the reviews - and yes most of them are right! Its tired tired tired. on the positives - it does have a good location, however you CANT ski in and out, well you can if you ski through the Maggie building and along the concrete!!. The hot tub area is good, you can swim out of the pool and climb the stairs straight out into 4 different hot tubs, with differnt tempertaures to suit everyone (also all hot tub area heated overhead!) Downside is the Village is so huge that we couldnt get in the hot tubs at the weekend, they were so busy from about 4pm. Downsides of property - hallway carpets are in desperate need of repair as are many of the furinshings in the room. While we were there we had no toilet light and room service (every four days) didnt respond to our request. Fridge was really noisy - maybe we were just unlucky! We booked through Vail Resorts which meant we did not have the services of front reception - or ski valet. Be careful as we thought we had all the amenties and ended up carrying our skis to our room each night as ski valet told us we were not part of the complex - even though we were staying there!!!", "title": "Just as most of the Reviews have said!", "user": "Get_away_fr0m_it_all", "date": "January 25, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 54341760}, {"rating": 1.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "Overall there are better places to stay and dont be fooled that this is one of the only resorts to be so close to the slopes. We stayed at Mountain Thunder lodge and to be honest we would rather find a bit extra and go to a nicer place than come back to the Village!", "title": "Great location, bad service!", "user": "stossie", "date": "January 14, 2010", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 53474444}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled solo", "text": "The location is great, close to the slopes. The front desk was far from friendly, felt like it was a chore for them to answer my questions. The room was OK, door handle to the bathroom was loose, chipped paint on the wall, details... There are better places in the Breckenridge to stay at.", "title": "Nice, helpful people at the front desk....", "user": "tylliz", "date": "January 12, 2010", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 53304508}, {"rating": 4.0, "title": "Best trip we ever had...", "text": "Very nice resort - loved the pool (1/2 outside, 1/2 inside), nice hot tubs, room o.k. I stayed for two nights. One disappointment was that I was not provided with extra water (to drink) the second night. Bathroom is quite small, and also was not provided with extra shampoo, soap, lotion for second night. Very small area outside of bathroom that could be used as a sink, but not very accessible. Otherwise, room was fine. Front desk people were extremely nice, helpful, courteous and professional.", "helpfulness": 1, "user": "E200936", "date": "January 4, 2010", "id": 52583092}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We booked this package on expedia that included airfare and lodging at the Village. It was a great deal and we couldn't pass it up. We were under the impression we were getting an efficiency, but ended up with one of the condos. Not sure if we got upgraded or what...but it was amazing. The condo was beautiful- up to date bathroom and kitchen, fireplace, balcony, one bedroonm, living room, dining area. Staff was friendly and helpful. Walked out our door- and there was the mountain one way- and Main St the other. Couldn't ask for a better location.", "title": "Well located, but....", "user": "PhilNewJersey", "date": "December 29, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 52120206}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "Great location right on the slopes. Friendly staff, amenities fine, all very clean. Nothing to complain about except it's pricey, but you pay for location.", "title": "Pricey but worth it", "user": "crasher1339", "date": "January 15, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 123129043}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "I stayed in the village for 4 nights, as the conference I was attending was also held there.", "title": "If we forget the price, the studio suite is it", "helpfulness": 1, "user": "l_y_k_3_l_3", "date": "January 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123045607}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "we had a discount rate, which still was the most expensive rate during my 3-week travel trough the States (which also includes some major cities).", "title": "Great location and nice studio space", "helpfulness": 2, "user": "bsa819", "date": "December 30, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 122306231}, {"rating": 3.0, "stay_parameters": "Stayed December 2011", "text": "When forgetting about the price, the studio room is actually quite ok. I found it convenient to prepare my own food and not going to dine out every day. Also the room is quite big, which is also convenient. I would stay here again, unless I would find a cheaper option nearby.", "title": "Great location, poor amenities...", "helpfulness": 2, "user": "Spartans07", "date": "December 28, 2011", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 122181594}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We spent 3 nights in a refurbished studio the week before Christmas and had a great view and very comfortably furnished unit. Although the bed was a double it was very comfortable for two (we are used to a queen) and the configuration of the unit made the space livable - a full kitchen, good living room area and bathroom with separate throne and shower rooms. We had checked on Trip Advisor and knew to ask for a recently refurbished room. A quick glimpse into the unit next door showed that we were wise to do so. The parking (included) under the building is quite convenient and you can almost ski in/ski out. (It's just a short walk to the Peak 9 chair).", "title": "Great Location Great staff ok hotel", "helpfulness": 2, "user": "travelwego", "date": "December 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 121706143}, {"rating": 1.0, "stay_parameters": "Stayed December 2009, traveled solo", "text": "Location of hotel is excellent; too bad the hotel and service is not. Hotel in general is not clean and is not maintained. Upon checking into room, room was not clean and interior furnishings were damaged. Upon checkout, hotel charged for damages to the interior furnishings. Amenities such as wireless internet were not available for duration of the stay and hotel was of no help in resolving the issue.", "title": "Great Location - Horrible Service", "user": "miner42", "date": "December 28, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 2.0}, "id": 52039950}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Snow skiing at Copper Mountain for two days, so we stayed in Breckenridge for one night. Front desk service was excellent and helpful. Valet service was offered for parking at no extra charge. Note, when checking in, the area in front of the main office is very small and cramped for vehicles. Pull into the garage and park in the check-in stalls.", "title": "Excellent stay", "helpfulness": 1, "user": "KSluv", "date": "December 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52020052}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "Hotel service drove us in a white excalade over to the gondola at peak 8 so we could catch the Dew Tour. Called the phone number to have them pick us up and they arrived within minutes.", "title": "Great Accommodations!", "helpfulness": 1, "user": "Darleen G", "date": "December 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 50900988}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "We stayed here because we wanted to check out the nightlife scene. The village is 1 block from main street which has many shops, resteraunts and bars. Lot's of things to do, great food (we recommend Eric's), and good beer (we recommend the breckenridge brewery (happy hour from 4-6 p.m.). We walked to both of these places.", "title": "Great stay, central location, close to everything, spacious and clean!", "helpfulness": 2, "user": "cosmo185", "date": "November 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 50370581}, {"rating": 2.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "If we were skiing at Breck, the lift to Peak 9 was just outside our door. We also tried the hottub and it was nice, could have been a little hotter. Our room was very comfortable. Standard room, included a queen bed with a pull-out couch. Could have easily accomodated 4 people. Nice 32 inch lcd t.v. Very clean.", "title": "You're Kidding Right... really, where is the room we paid for??...??", "helpfulness": 3, "user": "bri_71", "date": "October 16, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 47057005}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "I have traveled most of my life and stayed in some wonderful places. I must say that the staff at The Villages of Breckenridge are top notch. They exceeded our expectations by leaps and bounds. Anything that was requested was answered promptly and kindly. They had great attitudes from the moment we walked in until the time we checked out. The resort itself is located right at the base of peak 9. It is walking distance from anything that you want to do in Breck. I would highly reccommend to anyone that wants a stress free vacation in which your resort accommodates your every need to stay here. It was hands down the best ski in ski out resort that I have ever visited. I will absolutely go back and would advise everyone to try it. You will not be disappointed!!", "title": "As Good As It Gets", "helpfulness": 2, "user": "Chris H", "date": "December 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121431342}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "These were the only good things about the Village Hotel. The pet rooms are on the 4th floor which is inconvenient when your dog has to go potty at 4am. Our room was large enough and was a handicap room for some reason so the bathroom was huge, but the bed was a double (tough when you're used to a king), it was hard as were the pillows. The room was kind of shabby and run down, but fine for a place to sleep. I do not think it was worth the $200 we paid for one night, but the location was convienient.", "title": "Great Location and Pet Friendly", "user": "edenrip", "date": "September 18, 2011", "detail_rating": {"value": 2.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 118292520}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We were in Breckenridge for a wedding so several of our friends and family stayed here and we all had vastly different experiences due to getting vastly different accomodations. However, we all paid the exact same rate.", "title": "Luck of the draw", "helpfulness": 5, "user": "Jilliemp", "date": "September 14, 2011", "detail_rating": {"value": 2.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 118134358}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Our room was very outdated and rundown. The carpet was worn, bubbled, and torn. The fan in the bathroom was broken but the bathroom was at least clean. We could hear dogs barking in the hallway, but it was mostly in the day time and I suppose that can be expected in a dog-friendly facility. The front desk and housekeeping staff were friendly and helpful. The grounds were nice.", "title": "worth staying at", "user": "Patmazuel", "date": "August 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 116612939}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "My biggest complaint is that there is no way to ensure you'll get a nice room or a dumpy one but you'll pay the same rate for both. I went into the rooms of some my family members and some of them were beautiful. When I asked about this at the front desk they said that each unit is privately owned and the upkeep is up to the individual owners. I completely understand this, but feel like there should be a different rate structure or, at the very least, an explanation to the guest when making the reservation.", "title": "Loved it", "user": "1971DJ", "date": "June 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 112757880}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We stayed in the Village Hotel and Suites in Breckenridge for the last week of ski season. This is not a hotel in the european sense of the word, there is a reception area but it is over at the suites building, there is no dining room but there is a lively bar. The queen bed is a normal double, the bathroom is nearly as big as the bedroom, the air con and humidifier (a must) are very noisy. All of these little quirks are outweighed by the location. It is located at the base of Peak 9, where ski school/lift tickets can be purchased. It is a ski in/ski out property at the top of main street in Breckenridge, with plenty of ski rental property's and a lovely coffee shop nearby. All restaurants, shops etc are within walking distance. If you are staying for a week my advice is to book a bigger room.", "title": "Location, Location, Location", "helpfulness": 2, "user": "Gabrielle96", "date": "May 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 107023364}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "this hotel was nice. it looks modern from the outside, but I don't think all rooms have been re-furbished on the inside. the hotel bar has a good happy hour, but it is quiet loud at that time due to the increased crowd and volume of music! we had a room with it's own kitchen, so had our own breakfasts. the outdoor spa and pool area was nice - each spa is a different temperature. the lifts are slow. we had a view back over the township, not the slopes. concierge (a seperate company) was helpful and got us on our tours, etc ok. Getting to Vail to ski for the day is expensive.", "title": "very close to lifts", "user": "oz_flashpackers", "date": "April 18, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 104449522}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We stayed at the Village three years ago and were very disappointed with the condition of the room. Afer hearing that they had done extensive remodeling this past year, we decided to give it another try as it would also be a few hundred dollars less for the week than Beaver Run where we most often stay. The reservations person said she would request a recently refurbished room for us. The efficiency condo we had this time was, in fact, very nice. The room was clean and the kitchen area well maintained. The room we had was also very quiet and we saw or heard few other people in the hallway around us. The hair dryer in the bathroom did not work, and the bed was a little hard for my tastes, but overall we were very satisfied with the room. Housekeeping personnel were very friendly and service was excellent. On another comment left by a guest, they said they had to pay extra for full use of the internet but I did not find that the case. I was able to access everything as I do at home, albeit at a slower pace.", "title": "Much better than last time, but.......", "helpfulness": 4, "user": "aurum79", "date": "April 15, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 104205391}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "My complaint is again with the check in. Last time, they confused our reservation with someone else's. This time I booked through the only phone number I could find for them which happened to be a Vail reservations site. The online site said, and I asked the reservations person to confirm, that what I paid included all taxes and resort fees. Upon checking in, I was told that I had yet to pay the twenty dollars per night resort fee. When I said that was included already, I wasn't believed and was told that I had booked through a third party and should have booked directly with The Village. When I was allowed to show the manager that when you search them, you only come up with the number I called, he said he would waive two nights fees. When I went online and pretended to make another reservation, I was able to show him that it said resort fees were included, and he agreed to waive any additional fees. When I got to the room, the note pad they supply listed the very same number I had called. The opening page on their in -room internet service includes the very site I booked through. When I called the reservations number the next day, they said they were all owned by Vail and that they were NOT a third party reservation agency. How many people before me paid the fee twice?", "title": "Not a great place to stay", "helpfulness": 3, "user": "kyleracine", "date": "April 5, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 102979894}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Everything ended up working out OK and we had a very nice stay. The reservations descrepancy, however, has left a very sour taste and I will most likely avoid staying here again. I have read bad reviews for Beaver Run, but in twenty some years of staying there, I have never had a problem (other than not liking parking fee and internet fee). We are two for two for check in problems at The Village. For true ski in-ski out and the peace of mind, the extra few hundred dollars over a week makes Beaver Run a better overall experience value for us.", "title": "Location, Location, Location!", "user": "AlyAlyAly", "date": "March 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 101561930}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We stayed at this hotel for 5 days with the spring special. Rates were decent for room and lift tickets however food in Breckenridge was very expensive- even more than eating at a theme park like Disney. The hotel location was great- just a short walk to the lift. Staff on the slopes were friendly- not as much in the hotel. Wish the room had a microwave and a rack for our skiis. They have both indoor and outdoor hottubs. The wireless internet was unreliable which could have been due to the snow. All and all the trip was great and the views are truly majestic.", "title": "Love ski in/ski out", "user": "DancinJRL", "date": "October 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 45765547}, {"rating": 1.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "We booked our spring vacation for three nights at the Village with Vail Resorts. When we arrived, there was no valet on duty to take our car. When we lugged our own bags up to the room, we discovered it dirty, dark, had burned out lightbulbs, plastic deck chairs, food stains on the floor, and an HVAC system that had no controls! The bedroom where are kids stayed was freezing and the living area was too hot. When we complained the college-aged staff was of no help and we were told to call Vail Resorts - who was closed for the weekend! We checked out after one night and checked into the Hyatt Main Street Station which was 100 times nicer and an equal locaiton. There is NO way this property should be ranked as three stars but more like one. Sure, its a great location but its way to dated and out of repair.", "title": "Horrible - Does not Meet the Standards - Do NOT book with Vail Resorts!", "helpfulness": 2, "user": "Sonicolone", "date": "April 18, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 28283312}, {"rating": 1.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "We booked our room as a package and when we called to upgrade from a hotel room to a studio we were told that it was available but would need to change at the front desk when we arrived. When we arrived we were greeted by Aniela Wasmanski. We ask if we could upgrage to a studio which we were told was available. She told us I cant do it I would have to cancel your reservation and rebook you. You will have to get a refund from the company you booked with. I explained that it was non-refundable that I had called 4 times to confirm that I could change to a studio. Aniela just keep repeating I can not use your reservation and will need to cancel and rebook. Oh she could also not tell us the value of our room. after the forth time of telling us she can not. I asked if she could check us in. She repeated the line one more time.. So finally in the room it is the smallest hotel room they have. Window to the side no place to put suitcases, 6 hangers , 1 bar of soap to move from the sink to the shower, coffee pot handle broken coffee spilling everywhere, no outlets only behind tv unit. The carpet has not been vacuumed in who knows how long the dust on the blinds is unreal. .We departed for Boulder for one night and came back to find our bed had the comforter just pulled up. When we ask to extend one night stay due to skiing and taking a late flt was told by Aniela that the hotel was sold out. Minutes later my husband asked the other front desk agent and found out that it was available....This is the worst place I every stayed . It is snowing and hard to find another hotel at this time. I am looking .. We stayed at the Best Western in Boulder was so nice clean and very accomodating. Stay far away from this poor place with poor rude customer service.... The place is dirty the size of a closet with soiled sheets and housekeepers that do not speak English or know how to clean...", "title": "could it get any worst?", "helpfulness": 1, "user": "TM4MAUI", "date": "April 3, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 27378679}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "I have nothing bad to say about the village, was surprised after reading the bad reviews. Room was very nice, yes bathroom is small. Staff was very friendly and helpful. Great location . My daughter stayed in a 2 bedroom condo, it was excellent condition. Don't think twice on staying here, very nice place!!!", "title": "Very Nice Stay", "user": "kurtnpam", "date": "March 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 26525591}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "We stayed at the Chateux in the Village during the first week of March. The location is great. The kids ski school is about 100 feet away. We had a two bedroom and it was much roomier than we needed. You have to remember that it is a condo/timeshare type of rental, not a hotel, so you don't get as much service, but if you are there to ski, you can't beat the location.", "title": "The location outweighs lack of hotel services", "helpfulness": 2, "user": "LittleJanney", "date": "March 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 5.0}, "id": 26349472}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled solo", "text": "For the fith year again I enjoied staying at the Village. This time I went back to a Liftside Suite all the bigger condos were booked and again, another great time. OMG there was one little tear in the chair cushion, I guess at this point I could be like all the complainers on the board, But NO!!! There is just nothing wrong with the VAB. After reading some of the reviews I keep waiting for that \"bad time there\" The service was fine, the room was fine and yes there is no better location. I too met Aniela Wasmanski and found her to be very nice and helpful and told me about the remodling coming up Apr-Dec. I can only guess if you had a problem with her you must have booked online or something and that she couldn't change. That's why it's still a plus to use a travel agent, much more flexibility on the fly. I would reccommend the VAB to anyone after staying in the Hotel, Plaza III and the Liftside Suites 3 times now.", "title": "Another Great time at the Village at Breck", "user": "treynolds37", "date": "February 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57374231}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "My wife and I just returned from a 4-night stay at the Village at Breckenridge. We stayed in a \"liftside\" studio condo on the 7th floor, and were completely happy with our stay. It was clean and had a small kitchen, allowing us to make a few of our own meals.", "title": "Great stay in studio condo @ the Village at Breckenridge", "user": "JacksonvilleFL", "date": "February 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 57021999}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "I am sure there are much nicer places to stay, but they will definitely cost more than the \"Studio condos\" at the Village. Small bit of advice to first timers (as we were): you can check your skis and poles and such at the front desk, which is a heck of a lot easier than lugging them through the hallways and elevators.", "title": "A village within a village", "user": "MelbourneMacca", "date": "February 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56217033}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "...And a couple more recommendations: go night skiing and tubing at Keystone, and check out the dog-sledding at Good Times Adventures; they are all very fun activities!", "title": "Liftside Studios - The village at Breckenridge - Great place to stay!", "user": "Bluechops0", "date": "February 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55795562}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "The Village is a great choice for singles, couples or young families. It's perfectly located and the indoor / outdoor pool is great fun (even in mid-winter). The staff were very helpful and the open fire place in the lobby was charming. We had a self-contained room and even though it was hardly huge, it was still perfectly fine for our two young children with views to the mountains. You can pay a fortune in Breckenridge for hotels but I found The Village to be great value. The gym and pool were hardly used so you can expect to have it pretty much to yourself (in winter at least!).", "title": "Completely met this couple's needs for a terrific ski week", "user": "jat102", "date": "January 30, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 54763359}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled solo", "text": "Just returned from another stay at the Village (Studio Condo) my 10th in 11 years. The exterior and lobby upgrade are great of course each condo is indenpendently owned but after 10 trips I still have yet to have a problem. The front desk staff was as usual very welcoming and friendly at checkin/out and happy to answer any questions you might have, bus routs etc.. Also this year the Park Avenue Pub is also open for breakfast for 10.00 7-10 AM and thay have made some upgrades in the past year and are planning on adding a full kitchen although they have good pizza, wings and sliders (beef, pork and chicken. It never fails every year I read revies of travelers complaining about VAB and I just don't get it. If I had problems there I wouldn't have spent 10 vacations there. Thanks again to Jenny and the whole desk staff for the warm welcome,", "title": "Once again, No problems at VAB", "user": "treynolds37", "date": "February 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124909578}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We were rerouted from London to Denver - we arrived at the Village just after 3am - Daniel was on the desk and gave a warm welcome. This pretty much set the scene for our stay.", "title": "Very Happy with out apartment and service", "user": "Dan H", "date": "February 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 124660368}, {"rating": 1.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Location was what we were after and the Village is just about the best for that in the overall area. The room was a little outdated but was more than adequate for our needs. The TV was a nice big flatscreen and the bed very comfortable so the basics were top notch.", "title": "Good location but filthy hotel", "helpfulness": 2, "user": "CatherineChicago_IL", "date": "February 14, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 124585443}, {"rating": 2.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "We booked through the Village directly who guaranteed a minimum standard, I'd be interested to know what would have happened had we not done this. The kitchen was good enough to cook breakfast so I was happy. Someone i spoke to on the chairlift wasn't happy with his place, 14\" box tv - stuff not working etc. but I guess you get what you pay for!", "title": "bad management", "helpfulness": 2, "user": "gm25", "date": "February 1, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 123992439}, {"rating": 4.0, "stay_parameters": "Stayed December 2011", "text": "The service at the front desk (especially Summer) and in the ski shop was good and it was just a short walk past Maggies to the Quicksilver. We could see the lift from our apartment so we knew how busy it was.", "title": "Great location, huge hotel king rooms!", "helpfulness": 2, "user": "xena_mojo", "date": "January 23, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 123481901}], "location": {"country": "United States", "city": "Breckenridge"}, "stars": 3, "variance": {"poor": 33, "average": 44, "very good": 74, "terrible": 23, "excellent": 52}, "aka": "Village At Breckenridge Hotel Breckenridge", "slim_ranking": 0.179487179487}