{"user_rating": 4.0, "review_count": 14, "name": "Villa Borbone", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "We stayed at Villa Borbone for three nights this summer. We had nothing but positive experiences with Massimo and Elisa who run the B&B. They were very responsive to emails, had a travel crib and a high chair and were flexible about letting us use their kitchen for cooking food for our little son. The directions from Pisa (and Lucca) were excellent which was a good start to our stay there.", "title": "A real gem - beautiful spot and great people", "helpfulness": 2, "user": "indiebands", "date": "July 24, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3696282}, {"rating": 5.0, "stay_parameters": "Stayed February 2005", "text": "The Villa commands a panoramic view from its hilltop position (a perilously steep serpentine driveway to get up there, but manageable unless you have a giant station wagon). The Tuscan countryside is stunningly beautiful and the villa has nice outdoor spaces to enjoy it (including a nice pool).", "title": "Very charming", "helpfulness": 3, "user": "KimJoy", "date": "March 18, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3284712}, {"rating": 5.0, "title": "wonderful out of the way place", "text": "The Villa itself has been very nicely redone to accommodate guests - the rooms are grouped in threes in self contained areas of the villa which makes it a great option for families or groups of friends. The dining room and sitting room are common spaces for guests to use and are very grand and well appointed. The breakfast was very tasty with homemade croissants every morning along with good coffee and yogurt.", "helpfulness": 3, "user": "blooeyes40", "date": "October 17, 2004", "id": 2753870}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "variance": {"poor": 3, "average": 1, "very good": 4, "terrible": 0, "excellent": 6}, "slim_ranking": 0.818965517241}