{"user_rating": 5.0, "review_count": 108, "name": "Villas Sur Mer", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "The genuine warmth, hospitality and laid back atmosphere makes this a perfect vacation spot. Not to forget the amazing 7 1/2 miles of beautiful beaches, what more could one possibly ask for?", "title": "Jamaican hospitality...", "user": "Shevanne", "date": "February 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 151729404}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Our 2 bedrooms cottage was spotless and charming. Kimi and her entire staff were just simply perfect. I will be back!!!", "title": "Amazing Venue", "helpfulness": 2, "user": "Sharon B", "date": "February 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151494426}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We stayed at Villa Sur Mer this past weekend (January 2013) to celebrate our friends 50th birthday and have to say it's my new favorite vacation destination. Kimi and her staff are amazing. We stayed in villa 7 which is next to the pool and bar. Cliff our bartender was always ready with a smile and rum punch. The grounds are kept very clean. I was a little worried about traveling to Jamaica, but from the time our driver met us at the airport to the time we left to go home I felt very safe and relaxed. The slow pace of life settled in quickly. You have to take a taxi to get to the beach, but really wasn't an issue for us. The 71/2 miles of perfect white beach and many restaurants to choose from made up for the short taxi ride. Hummm what else can I say but, LOVE YOU KIMI and can't wait to see you again very soon. Thank-you for everything you did for us. Sharon & Steve", "title": "Excellent, relaxing stay!", "user": "Rajiv Y", "date": "February 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 151327382}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "My girlfriend and I had an excellent four night stay. Enjoyed the relaxing Jamaican lifestyle and all the help Kimi and the staff provided helping us navigate the restaurants and other places around the area. We would highly recommend Villas Sur Mer to anyone looking to truly relax and have a wonderful time!", "title": "What do you want?? They will get it!", "helpfulness": 1, "user": "jillianrene", "date": "January 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151034330}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "My husband and I arrived on Jan 23, 2013 to the welcoming hugs of Kimi and Richard. Never have I went to a hotel/resort/vacation spot where I was \"hugged in\". It only got better from there, they serious treat you better than family here. I mean my family doesnt always ask if there is anything I need or anytime I say, we would like to go here or there, they dont say \"no problem\" and then someone takes us immediately or picks us up when we call them to come get us for a small fee. Thats what you get when you stay here. Richard took us to the beach, to restaurants, to the market and gave advice and history. You feel safe from the minute you get here with the security guards too. The gardener keeps the grounds very nice and Cliff is always at the bar if you need something while you're hanging out at the awesome pool or huge hot tub. We stayed at 2B a 1 bedroom cottage and the grounds were perfect and the cottage was perfect for us. Our last evening there we got a couples massage by Lance and Claudette in the cave with the ocean splashing against the cliff. Best massage we've ever had. Would definately recommend! J & J", "title": "Peaceful retreat", "user": "TravelBalm", "date": "January 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 150892114}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "My husband and I just returned from a 5 night stay at villas sur mer and we couldn't have asked for a better stay. It was our first time in negril and Kimi made sure we had everything we needed. She was sure we had a reliable ride from the airport to the resort, so she took care of us even before we met her! She also arranged for a great captain to take us on a glass bottom boat snorkling trip. We stayed in villa 7 with another couple and we always felt that we had plenty of privacy. We had great access to the pool and bar which was great! Cliff, the bartender makes the best piña coladas and will make whatever he can for u! Richard is an angel! Always wanted us to have what we needed and never hesitated to take us wherever we needed to go! The groundskeeper,Shank Hi was always working hard to keep the grounds beautiful and always greeted you with a sincere smile. For an intimate customer service experience this is the place to stay! Although our villa was not on the beach side we had access to the water through the cave and the staff allowed us to access the beach from the 6 bdrm home on the beach side since it was vacant the week we were there. Beautiful water! As far as Negril goes we felt safe and enjoyed the food at many of the local restaurants. Be prepared to be approached multiple times to buy items if you are outside of the resort. Although it can get pricey taking a cab to certain places it is a must to avoid the hassle and to avoid the speeding cars on the narrow road. Overall we had a great visit! Weather is amazing and we can't wait to go back! Thank you Villa Sur Mer!", "title": "Wonderful staff", "helpfulness": 1, "user": "Rachael S", "date": "January 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 150630548}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "My new fiance and I can't say enough good things about Villas Sur Mer. The pictures on their website, while spectacular, don't do this place justice. The villas, gardens, and pool are gorgeous and tranquil. The seaside house is unreal. The cave and private cove are great places to relax and go for a swim. But Jamaica is about the people. The staff at Villas Sur Mer are the friendliest and most helpful hospitality staff we've ever met. Kimi is amazing and did everything she possibly could to make our time in Negril the best possible. Cliff, Richie, James, Marlon, Shankar, and all the cleaning staff are great people, and really make this place extra special. Great people to hang out with and to tell and listen to stories with. tJamaica is also about the food. The west side (cliff-side) of Negril has TONS of great places to eat. Great food can be found everywhere, from the \"hotel\" restaurants to the the road-side grills and shops. Villas Sur Mer and the cliffs are a great change of pace and scenery from the beaches of Negril, but close enough that you can hop into a cab (or shirtless on the back of Richard's moped, hugging him tight for all the girls to see) to hang out in the sands in the day or check out live reggae at night. And Jamaica is also about the music. SO MUCH good music playing everywhere. If you like bad music, go vacation somewhere else.", "title": "Beautiful place to stay in Negril", "helpfulness": 1, "user": "wannigan", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 150355129}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Irwin and I just got back from a four days get-away at Villa Sur Mer and is already planning our next trip back. We felt like we've known the staff all our lives. We were greeted with a hug from Kimi...where in the world do you go and get a hug from a complete stranger,it meant a lot.Richie was really good to us, he took us any and everywhere we wanted to go,loved his accent.The villas are very cozy. We stayed in 1b, a one bedroom which is beautiful and had the opportunity to stay in a two bedroom as well which was equally beautiful and peaceful. I fell asleep in the hammock and napped for two hours in the middle of the day. That was heavenly. We totally enjoyed sitting at the bar and sipping one of Cliffs special cocktails while he told us stories about Jamaica and played whatever reggae music we requested. Swimming in the pool with reggae music and birds chirping in the background felt like paradise. Do not leave without spending some time in the cave....breathtaking!!! Can't wait to go back!!!", "title": "Everything we hoped for and more!!!!", "user": "Kitty4x", "date": "January 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150115012}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "My husband,Patrick, and I just returned from a 7 day wonderful trip at Villas Sur Mer. We were in villa 7 which is a 2 bedroom. We had another couple with us. It was located right next to the pool at the rear of the property. It was the best location!! First of all, the service here is great!! Kimmie was great to work with and made sure we had everything we needed. Cliff made the best daquiris and always suggested wonderful places for us to eat each night. He was always there to help us with anything. Richard took us all over the island and even gave Patrick a moped ride!!!!Shank Hi kept the grounds immaculate and my husband loved talking to him. All of the people that work here are so nice. We can't wait to come back!!!", "title": "Amazing!", "helpfulness": 1, "user": "Charlieconnormom", "date": "January 17, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 149909440}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "I will absolutely be back!!! The staff is the most wonderful, friendly, and helpful people. They helped us with anything we needed and checked on us daily. Kimmie was the best! She made us reservations, booked us a trip and encouraged others to join us, and made sure to check on us each day. Richard took us anywhere we needed to go and was so friendly. Cliff helped suggest places for us to visit and was always there if we needed anything. The security guys James and Marlin were always a help and made sure to check on us. We felt very safe :) The housekeeping staff always did a great job and the grounds looked amazing. I must say that this was the best vacation I ever had. I told multiple people about this place and even have some people that are interested in booking. Like I said, I will be back for sure, not only for the beautiful hotel and the area, but to see the wonderful staff that we became friends with in the short time we were there. There are the most breath taking views off the cliffs. Across the street is the famous Ricks Cafe where I jumped off the 35 ft cliff....amazing! And there is another place called LTU. They have great food and it is inexpensive. You can also charge the food or drinks to your room. If you are going to Negril this is the place to stay!!!", "title": "The best vacation I ever had!", "helpfulness": 1, "user": "Amy M", "date": "January 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149659009}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We spent 3 nights at Villas Sur Mer in #6 down. Overall the place is beautiful, pictures truly do not do it justice and the people were some of the nicest we've ever met. Why not a perfect 5? They were pretty darn good, but there were some small things that didn't quite live up to our expectations when celebrating our 20th wedding anniversary.", "title": "The Extraordinary, Exquisite, and Ordinary...", "helpfulness": 2, "user": "jodi_123", "date": "May 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160810977}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Extraordinary - Probably the most amazing experience we had this trip was the sea cave massages with Lance and Claudette. Magical, wonderful, I cannot put into words how great it was. I was a little skeptical about the cave (would it be sticky, how private) but it ended up being perfect. We get regular massages and this took the massage to a whole new level. Others during our stay that were extraordinary were Donna, who kept our villa perfect and was available if we needed anything. And I loved Kimi, she and Elysia (sp?) hugged us into the resort and truly know the meaning of hospitality. They also went above and beyond on our last day and let us use one of the other villas so we could relax and check out late. Villa #2 is also quite darling and would be a nice place to stay.", "title": "Incredible", "helpfulness": 1, "user": "raych81", "date": "March 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 155797394}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "Exquisite - The villa itself was exquisite. The furnishings were beautiful and clean. The bed was extremely comfortable and the linens were excellent (I'm a little like the princess and the pea). The AC, when needed, kept the entire villa cool. I was concerned about bugs since the windows were not screened, but whatever they use kept them away. Not even any ants in the kitchen. We loved and miss our little porch where we would sit with our homemade cocktails in the evening. The snorkeling cove was beautiful, unfortunately, my DH's hand brushed against some sea urchins so we did not get to enjoy much snorkeling while we were there. The cave path under the road to the cove was great. I do not like heights so it was an easy way for me to get down the cliff without being scared. Highly recommend this cliff location for people who have heights issues. Also, we did get to use the big house for an afternoon while they were between guests. It is truly exquisite and we enjoyed spending time by the pool, with the beautiful view and then sunset with the Rick's craziness close but not in the middle of it.", "title": "The perfect place to celebrate a wedding.", "helpfulness": 1, "user": "ajzmann", "date": "March 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 154272672}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Ordinary - My only suggestion for the villa - please consider providing coffee. You have a coffee pot; it has a gold filter so you don't need filters. But a pack of coffee and some coffee service would be nice, even if just for the first day with a note or something that it is only for the first day. Also, we could not figure out room service? We had menus for LTU pub but no-one ever answered the phone number when we called.", "title": "Loved this place!", "user": "Atalie505", "date": "March 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154268271}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Ordinary (con't) - The day we arrived there was a large birthday party celebration that was in the big house and several of the villas. The other guests were very nice, but the staff concentrated on their needs, anything we needed - we had to ask for. No pool bar available for all but the last afternoon we were there - we did ask multiple times upon arrival, I really wanted one of those nice rum punches I saw walking by, but it was always - \"be right back\". Then the next two days the bar by the pool was closed. We didn't die of thirst, we did have LTU pub right there and we had stopped and stocked the fridge. Richard deserted us on the beach (on the day of our 20th anniversary) and we had to scramble to get a cab and barely made our massages (hate being rushed and sweaty going to a massage), a simple \"I can't make it find your own ride\" would have been much better than saying I'll be there if you can't make it. Then the last day he was supposed to drive us to IA and again - no go, we paid the nice lady he arranged. I was really confused - was he supposed to be available for short local trips? Did we not tip him enough (not that we had much of an opportunity)? We gave up and took care of transportation ourselves for dinners on other nights. Not a huge deal, just tell us we have to take care of our own transportation so our expectations are set correctly. We know how to get around in Negril, this was not our first trip. And it was uncomfortable to have them arrange someone without any idea of the cost or having the cost negotiated up front, that is Negril 101.", "title": "Best trip ever!", "user": "ahoffman2015", "date": "March 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154120638}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "So I'm writing this review a little late, as my husband and I stayed last October. But...this place was so fantastic that I've been meaning to write a review ever since. We had a wonderful and super relaxing week thanks to Kimi, Richard, Cliff and Erdley. They are all so kind, helpful, and genuinely nice. They are truly a blessing to the hospitality industry and did everything they could to make our trip perfect. The property is beautiful, and there is nothing better than relaxing in the cave and hopping in to go snorkeling in the beautiful turquoise water. We had the bungalow that sits above the pool, and it was great. We also did not have to share the property with many others as we went during the rainy season. It was the perfect secluded romantic getaway. This was our first trip to Jamaica, but will not be our last!! If your looking for an alternative to the cookie cutter resort vacation this is your place.", "title": "Definition of HOSPITALITY!", "user": "DanEmC", "date": "March 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 153490104}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "I stayed at Villa Sur Mer early February to celebrate a friends 50th birthday and have to say from beginning to end it was a great experience. Kimi, Cliff, Richard and all the staff are amazing and really keen to help and with a smile. The grounds are very clean and it feels like living in a tree house ....lovely pool area, underground cave to the sea, just all round fun for everyone.", "title": "Fantastic people and great place to stay", "user": "AngusMac_13", "date": "March 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 153451792}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "During the same trip I also stayed at an \"all inclusive\" for a couple of days and the experience is like night and day ........I would happily go back to Villa Sur Mer again but doubt I would try the all inc. type place again.", "title": "Perfection!", "helpfulness": 1, "user": "marvinlb", "date": "February 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153002138}, {"rating": 5.0, "title": "Great times!", "text": "All in all just a great place that has made the effort to hire great people and it shows !", "user": "V R", "date": "February 19, 2013", "id": 152541147}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We rented the seaside villa for our wedding and it was the perfect choice for our celebration. The villa is even more beautiful in person that in photographs. The rooms are huge so there is plenty of room for a large group. Our guests were blown away by the setting - the cliffs are very dramatic and absolutely breath taking. We had no trouble swimming in the ocean from one of the seaside entries. The water is deep but crystal clear and great for snorkeling.", "title": "VILLAS SUR MER HOSPITALITY", "user": "Michael F", "date": "February 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152282949}], "location": {"country": "Caribbean"}, "variance": {"poor": 0, "average": 2, "very good": 9, "terrible": 1, "excellent": 96}, "aka": "Villas Sur Mer Hotel", "slim_ranking": 0.0285714285714, "description": "This is a 24 room resort: 6 bedroom, 6 bathroom top-of-the-line villa on the ocean side and 11 new lagoon villas."}