{"user_rating": 3.0, "review_count": 201, "name": "Villa Le Rondini", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 1999", "text": "I stayed at the Villa Rondini several years ago and found it like an old, quaint villa in the countryside rather than a suburb of Florence. It is very quite and the atmosphere drips with country charm. My room was in a seperate building quite a way from the main bldg. The exterior of this building lacked all charm. Access into the building and to my floor required navigating steps and a long dreary hall. You must carry your own luggage. The room was very tiny but I thought it was really cute and cheerful. It was decorated with country furniture and country fabrics. The bathroom had been remodeled. Yes, it could use fresh paint, etc. but it does have its own charm. On the downside it is not walking distance to Florence at all. It is up in the hillside outside of town so it is a drive. I think that it is great for the quite and charm but not so good for being able to just walk out your door and wander around town. It has the grounds and design to be a great country hotel, it is just not there now.", "title": "charming with lots of potential", "helpfulness": 13, "user": "cam33", "date": "March 23, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 2.0}, "id": 3295958}, {"rating": 2.0, "title": "Huge potential, but still some work to do", "text": "We've stayed at Villa Le Rondini for 5 nights, touring Firenze and Toscana. The location on a green hill just outside the city of Firenze lets you enjoy the taste of Toscana and still have easy access to the city. It is recommended to get to the city by bus (#25 every 15-20 minutes), and to tour Toscana by car (free parking at the hotel). The hotel resides in a large property, and includes a main building and a couple of villas. Keep in mind that if your room is in one of the villas - you'll have to walk (or drive) 200-300 meters to have breakfast in the main building. Our room looked a bit worn out with overused furniture. The bathroom looked better - renovated lately. Service was not perfect: Our room wasn't made up one of the days, and it was pretty frustrating coming back at night after an exhausting day and finding it messy. Breakfast wasn't rich - yellow cheese was there only one day, The bread was usually dry. *** Bottom line: Villa Le Rondini did not live up to our expectations. It has a huge potential thanks to its location, size and view, but the staff has to make an extra effort making the rooms look better and taking care of the small details, or else it doesn't seem they deserve 4 stars.", "helpfulness": 28, "user": "gyossi", "date": "April 26, 2004", "id": 1836794}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "stars": 4, "variance": {"poor": 18, "average": 21, "very good": 61, "terrible": 56, "excellent": 45}, "aka": "Villa Le Rondini Hotel Florence", "slim_ranking": 0.651515151515, "description": "Lying on a beautiful hill, with a splendid view on the city of Florence, just imagine an aristocratic Fifteenhundred Villa and other two Ancient Buildings, encircled by 22 hectares of park, olive groves only ten minutes away from the center. Bus 25 every 15 min. Stylish bedrooms, swimming-pool, tennis-court, jogging facilities, parking areas, heliport and... genuine products of the family farm. Ideal for a relaxed holiday, an evening party, a high class convention. Golf and Riding facilities at 18Km."}