{"user_rating": 4.0, "review_count": 56, "name": "Vineyard Country Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2005", "text": "Stayed here with another couple on a quick trip to the wine country. We were amazed by the excellence of this somewhat unknown little inn. After being warmly greeted by the innkeeper we were shown to lovely suites with every imaginable amenity including fireplace, vineyard view, four poster bed, wet bar and a complimentary bottle of good cabernet. The next morning, in the sunwashed dining room, we were served a complimentary breakfast, on Villeroy and Boch china, which was delicious and bountiful. Every member of the staff was polite, professional and courteous and seemed sincerely happy we were there. The attention to detail was impressive. The only critical comment I can make is that the property is very close to the busy Hwy 29 so there is a little traffic noise if you are in one of the few rooms close to the street.", "title": "A piece of paradise", "helpfulness": 12, "user": "EB3", "date": "February 7, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3167500}, {"rating": 4.0, "stay_parameters": "Stayed September 2004", "text": "We were in Napa Valley Sept 24 - 29. Stayed at the delightful Vineyard Country Inn. It is a quaint country inn that is very comfortable and reasonably priced. The room is a suite with a separate bedroom and a living room with a wood burning fireplace. It's located in St Helena which makes it perfect to head out in either direction.", "title": "Another wonderful Napa trip", "helpfulness": 7, "user": "Herkbert", "date": "October 16, 2004", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 2725542}, {"rating": 5.0, "title": "Will definitely stay here again!", "text": "There is a small pool, a hot tub and a scrumptious continental breakfast is included - everything is fresh and plentiful.", "helpfulness": 9, "user": "winechick73", "date": "September 21, 2004", "id": 2589761}, {"rating": 4.0, "stay_parameters": "Stayed May 2004", "text": "I also would recommend for a romantic adventure that you try a hot air balloon ride over Napa Valley. We went with the fine folks from Napa Valley Aloft and had a wonderful time. You won't see a view of the valley quite like the one from the balloon.", "title": "Lovely Inn", "helpfulness": 7, "user": "LeighD", "date": "May 5, 2004", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 1876922}, {"rating": 5.0, "stay_parameters": "Stayed April 2004", "text": "After having done lots of research on places to stay in St Helena, I found the Vineyard Country Inn through this website. I am a very picky traveler, but let me emphasize that I'd stay here again in a heartbeat. There are two floors, and as a light sleeper, I requested a top floor away from the road. My request was met and we stayed in Room 201. Vaulted ceilings, huge balcony overlooking the vineyards, two double beds, enormous bathroom, and a nice feature - a vanity area with a second sink in the corner of the room. The rooms were clean, cozy, and without too much fluff. There is a separate living area with comfy seating, a fireplace, a second TV, and sink/fridge area. The living room window faced the pool area, which was quite small, but very cute and quiet. The inn is centrally located, and you get a continental breakfast included with the rate (a rate which was very reasonable compared to other inns and hotels that I researched). Definitely check this place out.", "title": "will return again!!!!", "helpfulness": 6, "user": "adam6868", "date": "April 21, 2004", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 1808082}, {"rating": 5.0, "title": "Serene Country Inn", "text": "I stayed at the Vineyard County Inn in mid-Sepember 2003 with 2 friends(36th colllege housemate reunion) in a very large Queen-Queen room. All rooms a suites with a living room with fireplace, couch, TV, frig, and even wine glasses & opener! The beds are made in soft peach linens w/ duvets, the room was very clean. Flowers are planted everywhere, and the lovely pool and hot tub are surrounded by flowers as well. Soft beach towels and a cooler of ice-cold Calistoga water are at poolside. The lovely breakfast room overlooks the vineyards, and a wonderful array of pastries, fruit, cheeses, and beverages are presented on the flower-decorated tables(with fine china). The inn keepers are very warm and friendly, and this place is fantastic! Highly recommended by a highly critical consumer!", "helpfulness": 11, "user": "BerkeleyBoomer", "date": "September 24, 2003", "id": 1363727}], "location": {"country": "United States"}, "variance": {"poor": 1, "average": 5, "very good": 23, "terrible": 2, "excellent": 25}, "aka": "Vineyard Country Hotel", "slim_ranking": 0.461538461538}