{"user_rating": 4.0, "review_count": 267, "name": "Virgilio Grand Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "My husband and I stayed at this hotel in March 2005. Workmen were still working on the pool area at this time. We paid 100 Euros half-board. The hotel was clean, spacious, comfortable and service was always with a smile.", "title": "Loved this place!", "helpfulness": 2, "user": "Trayflow", "date": "September 25, 2006", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 5833910, "likes": {"liked": "— Restaurant, spacious room, friendly smiling staff", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "Breakfast was superb with a plethora of choices-juice, cappuccino, pastries, bread, cheese, meats, yogurt, preserves, etc. I believe it to be well above your average Italian breakfast.", "title": "Could be perfect for you.", "helpfulness": 3, "user": "JandApe", "date": "September 21, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5823818, "likes": {"liked": "— Modern feel, efficient, classy.", "disliked": "— Noisy air-conditioning."}}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Dinner was the highlight of this hotel for us. There was no menu. The chef came out and asked, \" You-ah like-ah the fish?\" We replied, \"Yes\". OK. And the food started coming: smoked salmon in thin strips, pan-fried fish wrapped in paper with lettuce, spaghetti with clams and olive oil, risotto served out of a large baked pumpkin, fried calmari with salad and a dessert of frozed whipped berries with fresh berries on top and small pastries. Yes, we could barely get out of our chairs to get out of there. It was one of the most wonderful Italian meals I have had anywhere!", "title": "Not 4 star by any standard", "helpfulness": 4, "user": "Edinburghtraveller", "date": "August 11, 2006", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 3.0, "cleanliness": 5.0, "value": 2.0, "location": 2.0, "rooms": 5.0}, "id": 5598302, "likes": {"liked": "— nice rooms", "disliked": "— poor situation in town No service"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "I would highly recommend this hotel.", "title": "Great hotel", "helpfulness": 2, "user": "HIGHLIGHTS", "date": "April 24, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 4999084}, {"rating": 5.0, "title": "Luxury by the beach!", "text": "Let’s have a bit of objectivity, the hotel has never claimed to be ‘on the beach’. It is a five minute (downhill) stroll away. Our room was in the main block, so I have no experience of accommodation in any other part of the hotel. However, the room wasn’t without problems. The air-conditioning could be temperature controlled but the fan was either ‘full-on’ or ‘off’. Therefore it was a very noisy. This was a shame as the hotel is located in a quiet spot. Apart from that, the room was decorated in a modern contemporary style. It was well equipped, with a Jacuzzi shower, safe, satellite TV and a mini bar, complete with some complimentary soda and water. The desk staff were efficient, spoke English and always wore a smile. The dining room staff were also very friendly and efficient. We did not have dinner at the hotel, (Sperlonga is bursting with good restaurants) but breakfast, (IMHO) was WAY above the Italian norm. A choice of American (weaker) coffee, or if you preferred, espresso or Cappuccino (also free). Decent juices, fresh fruit salad, breads, pastries, (including donuts), yoghurts, preserves as well as the usual selections of cheese, salamis and mortadella. My wife and I spent a week here following a week in Rome, where the breakfast was more (cough) ‘typically Italian’. I would not dispute the fact that if the beach is your priority, then the Aurora would SEEM a better bet but as I have not stayed there, that is pure speculation. If you are not a beach person, then I can recommend the Virgilio. It isn’t perfect but IMHO, it does what it says on the tin with a degree of style, aplomb and panache. I also think it good value for money. Then again, I live in London, where breathtakingly steep prices seem to be the norm.", "helpfulness": 2, "user": "Litzy", "date": "March 22, 2006", "id": 4723683}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "I really cannot fault the Virgilio Grand. It was the 4 stars it promised in every aspect for an unbelievable price. It had just dropped from 90 euros to 75 euros a night because of the season but the weather we had at the beginning of November was glorious.", "title": "Not on beach but lovely hotel.", "helpfulness": 17, "user": "jean-s", "date": "November 9, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4100975}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe"}, "stars": 4, "variance": {"poor": 17, "average": 43, "very good": 112, "terrible": 8, "excellent": 87}, "aka": "Virgilio Grand Sperlonga", "slim_ranking": 0.5, "description": "Virgilio Grand Hotel, Sperlonga's modern and welcoming 4-star hotel, is situated in the heart of one of the most exclusive and attractive villages in Italy, very close to the historical centre and just a few steps away from the sea.Our hotel provides the warmth and care of the best Italian hospitality along with comfort, functionality, relaxation, quality, wide and well-lit open spaces, blended together to create an elegant atmosphere, enriched by carefully chosen details.The hotel has 72 finely appointed rooms with innumerable services of the highest quality, carefully prepared to meet all sorts of requirements and to offer a pleasant stay to all our guests. It boasts the largest and most modern Congress Centre in Sperlonga and a wellness centre, for a marvellous experience in the world of well-being."}