{"user_rating": 4.5, "review_count": 234, "name": "Vista del Mar Hotel", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "We were very disappointed with the Vista Del Mar. It felt like hostel accommodations at luxury prices. The showers were particularly awful. Extremely low pressure. Also there were lots of tiny ants in the bathroom. The entire condo was poorly maintained. Lots of cracks in the tile, and mildew everywhere. The towels were very thin and frayed. I would not recommend this place.", "title": "Very disappointed", "helpfulness": 1, "user": "Gigi2960", "date": "December 27, 2011", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 122150950}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "For an inexpensive stay, this is a good option, though I wouldn't recommend staying longer than 2 days. The room was small but adequate, with a lovely balcony view of the ocean. Problem was that the entire place had a musty, moldy smell that was hard to escape. Beach had biting bugs (noseems?) and so bring repellant.", "title": "Good value", "user": "Cat_9079", "date": "December 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121929060}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "Excellent location with lots of vacation homes, villas with nicely paver drive to walk around. Charming restaurant with tasty and reasonaly priced Ceviche just further down the road.", "title": "Quiet, Beachfront, clean, smooth transaction", "user": "panedu50", "date": "December 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 121714629}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "*We stayed 1 night (December 10, 2011) on our way from Tulum to Cancun. We rented a small room for 2. We stayed at room #204, the whole building is right in front of the beach. We paid $75.00 (including taxes, and paid prior to arrival in Mexico).", "title": "Quiet, clean and relaxing", "user": "DennisUSA", "date": "December 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 121554228}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "Very smooth transaction, all via email and phone calls in the US. Fast response, very polite and helpful answers to all our questions.", "title": "If you're looking for something besides snorkeling", "user": "ThatsAcat", "date": "December 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 121425772}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "VDM is not fancy but it was clean and comfortable. It is steps from the water and walking distance to a little convenient store & La Buena Vida. We stayed in a suite & the balcony was AMAZING! It had a table & 2 chairs for dining, 2 lounge chairs & a hammock! It looks right over half moon bay. The room wasn't posh but it was clean & had everything we needed- a bed, a small kitchenette, a giant bathroom & best of all- windows/sliding glass doors along the whole wall so we could watch the sunrise from bed. The room had plenty of storage, a safe, a/c, tv. My only complaints are that the room doesn't have any seating other than the bed- a small chair would be a great addition and maybe an extra pillow or two on the bed. The front desk guy was friendly & helpful & the housekeeper was good. Walking distance to everything & they even rent bikes if you want. Half Moon Bay is a very quiet, beach area. Nice to relax & read a book.", "title": "What a great vacation!", "helpfulness": 1, "user": "pitahead", "date": "July 20, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 5.0, "service": 5.0}, "id": 115572104}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "We are the types of travelers that would love to always stay in a posh, luxury resort, but we just can't afford that all the time. We tend to stay at places that are clean & well reviewed and VDM fits the bill. For the money- you can't beat it. My friend has stayed in VDM many times. She recently stayed in the \"condo\" and said it was really great!", "title": "Can't wait to go back!", "helpfulness": 1, "user": "fleezle28", "date": "July 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 115375209}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We stayed at Vista del Mar Norte in condo #F for 3 nights in June and loved it! We had plenty of room for 4 people and the staff were great about checking in to clean each day if we needed it. We appreciated the vibrant colors, the spacious layout and the full kitchen. Our view was wonderful, and we loved waking up to the sound of the ocean. The beach out front is very beautiful and peaceful. Akumal is a lovely little town and we enjoyed exploring what we could on foot from the condo. It is an easy walk to the corner store, a delicious restaurant and some little shops. If you are looking for a little oasis on the beach, this is a great choice!", "title": "Wonderful hotel in a beautiful location.......", "helpfulness": 1, "user": "djnitz", "date": "May 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 106919280}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "~Felicity & Justin", "title": "Wouldn't go back...we had booked this suite since July 2010, for 10 nights", "helpfulness": 2, "user": "Gemeneye", "date": "April 28, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 2.0}, "id": 106025840}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled solo", "text": "We stayed here for 10 nights on the Hotel side. We had ground floor right next to the Store. For 9 of the 10 nights, we were the only ones in the Hotel, needless to say it was very quiet...which is what we were looking for. My husband and I have decided that we are not All-Inclusive people (don't like crowds)", "title": "Vista Del Mar condos.I loved this place", "helpfulness": 2, "user": "MELLOW51", "date": "April 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102660835}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Vista del Mar Hotel is located right on the beach. A turtle actually laid her eggs right below our balcony. We went snorkeling right from the beach in front of the hotel. Saw a variety of fish, turtles and beautiful coral. Also went scuba diving with the hotel's dive operation. They were wonderful and took us to some great locations. The location is perfect since you are away from the hustle and bustle of Cancun. Just a kick back place but close enough to take a day trip to Cozumel or to visit the ruins. Loved it.", "title": "Great place to relax", "user": "tmdaok", "date": "December 2, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121326391}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The Vista Del Mar Hotel is placed on a beautiful beach on an absolutely stunning half-moon bay. There is virtually no boat traffic and every night sea turtles come in to lay their eggs on the beach which shows little stone markings and signs for all for all of the nests. The coral reef begins at waist depth out off the beach, and the coral is as good as any coral reef I have been on (and I have quite a bit of experience around the world). Though the fish are not as prolific as in some places I have been, the coral seems unusually healthy and is extremely varied and colourful (for that matter, so are the fish!).", "title": "Incredible snorkelling outside your door. Beautiful room, great service", "helpfulness": 1, "user": "intrepidpam", "date": "September 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118744728}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The hotel room is very small but it has a magnificent view out the sliding patio doors and a nice balcony (with chairs and table), which means that it does not seem cramped. The room was beatifully decorated and so was the bathroom (charming sink and tiles).", "title": "Top value beachfront", "helpfulness": 2, "user": "Ricomalo", "date": "September 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 118623468}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Our service was fabulous. We paid $75 USD the first night and were given a deal of only $70 USD when we extended our stay (we couldn't bear to leave!). The room comes equipped with drinking water dispenser, fridge, utensils and plates for two, coffee-maker, tv, fan, and air conditioning. The wi-fi did not work in our room but the office offered to let me use their computer! Whenever we had a question or needed something, the staff were great (including opening the dive shop for us, and arranging for a car rental to be extended!).", "title": "Great Condo", "user": "KKE11Y", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116161290}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "There is a convenient store at one end of the hotel which stocks basically anything you could want (like a mini-grocery store). There is also a good dive shop on the premises. We rented snorkel equipment by the day and used it to go to other sites and to snorkel off our own beach (which was the best). The staff at the dive shop was great and very flexible and helpful.", "title": "Fabulous Stay at VDM", "user": "mocha2", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115995391}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Our 10 person extended family rented 2 2-bedroom condos right on the beach as well as a studio condo upstairs from one of the units. I love the location, right on Half Moon Bay about halfway between Akumal Bay and Yal-Ku lagoon. Although the entrance to the water on HMB is rocky, you can snorkel right outside your sliding glass door! Vista Del Mar is a little rough around the edges--our ovens didn't work, the beds were mediocre, one microwave had a broken turntable and the shower took 10 minutes to warm up--but friendly staff, daily maid service (that included dish washing!), free wifi and the awesome location far from any crowds made this the perfect place to relax with family. You'll never have to worry about getting a deck chair!", "title": "Peaceful relaxation right on the beach", "user": "almabalma", "date": "February 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 124212306}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Tips: Don't bring beach towels--the front desk will loan you fresh ones whenever you want them. The wifi signal is best closest to the office. Pick up your groceries on the way to Akumal at the Super Che near Playa Aventuras, about 15 minutes away by car.", "title": "I little slice of Heaven that you can't miss!", "helpfulness": 1, "user": "fd2di4", "date": "January 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123885858}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "A friend in the US said we had to go to Akumal when we were in Mexico. So my daughter and headed down for the day and ended up abandoning our hotel in Cancun and stayed at Vista del Mar for the remainder of our trip in Mexico. This is what a vacation is all about..... If you are high maintenance this is not the spot for you. The rooms are rustic but nice and yes they could use some revamping but it is very charming, service is great and you can walk out your door and be on the beach and in the ocean in 2 steps! Beautiful, peaceful, great restaurants within walking distance, snorkeling, diving and fishing all right there. Met some great people and the fresh fish was fantastic!!!! The service and people at the hotel and restaurant were fantastic. They have an in-house masseuse who gives massages right on the beach outside your room... she is really good!!!! I definitely will bring the whole gang and get a condo for next year!", "title": "Location is great...but needs some TLC.", "user": "MIDEMC", "date": "January 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 123375433}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "You can't beat the location of this hotel. It IS what Mexico is about. However, it seems as though the rooms are not as well maintained. Service is always nice and rooms are kept fairly clean, but some time and money should be spent in room maintenance. The ceiling blade fans and bathroom light fixture are rusted, the window curtains were very dirty and the towels were frayed. Sheets looked and felt a little thin. I've stayed here many times, but I would think twice next time. I would like to know these things have been addressed.", "title": "Our third stay", "user": "princ11361", "date": "January 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 122690639}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Just returned from a lovely vacation with our family at Vista del Mar. We rented a 2 bedroom and a 3 bedroom condo. They were cleaned daily and well maintained. The beach front location is terrific. We found the staff friendly and accommodating.", "title": "I'll take this over an all-inclusive any day:)", "helpfulness": 2, "user": "kjdfl", "date": "December 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122328886}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "variance": {"poor": 9, "average": 18, "very good": 93, "terrible": 1, "excellent": 113}, "aka": "Vista Del Mar Akumal", "slim_ranking": 0.47619047619, "description": "Vista del Mar Hotel rooms are simple, clean and economical. Each room includes daily maid service, air conditioning, purified drinking water, TV, coffee maker, an in-room safe, and free parking. All Vista del Mar condominiums and hotel rooms are on the absolute beachfront with uninterrupted views of the ocean. A tranquil setting on a beautiful beach."}