{"user_rating": 4.0, "review_count": 131, "name": "Vitoria Hotel Campinas", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "There was nothing spectacular about this hotel, and no compelling reason you should stay here. The neighborhood is gorgeous, but inside the rooms, the lighting is poor (cheap bluish CF bulbs) and the elevators are maddening. The walls are thin, the beds a little rough, and the staff disengaged. The gym looked excellent.", "title": "A little less than average", "user": "Jon P", "date": "March 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 126873996}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "Bring your own iron, as they won't give you one on arrival.", "title": "Great hotel in Brazil", "user": "farm2fork", "date": "March 15, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 126159167}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "After traveling through the countryside this hotel felt 5 star. The rooms were spacious and modern. I liked the decoration, layout and amenities. It's neat to have an option on opening the windows or air conditioning during the evening. I enjoyed my stay and hope to take advantage of the bar and facilities next time I'm back.", "title": "Not perfect, but one of the better in Campinas", "user": "JeppeSJ", "date": "December 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121434589}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Good hotel in Cambui, the cool part of Campinas. Could need some new decor and a few upgrades, as the price level is really high. But well, it's like that for everything in Brazil, nowadays. Overall, good location, good rooms, good service, and some good restaurants inside the hotel, 2 of the better ones in Campinas. As I live in Cambui now I might not come back, but everytimes my clients and colleagues are in town, they sleep there.", "title": "Good :-)", "helpfulness": 1, "user": "Lars G", "date": "November 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121011520}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Stayed in 104 for 4 nights. Spacious room, good bed, fridge big enough to stick your own drinks in, microwave, 32\" flatscreen TV. Really excellent gym and 1,5km green area in the middle of the road to run on I you want to get outside a bit. Didn't try the Bellini restaurant but have been told it is really excellent. Only (very small) inconvenience was that the elevators take ridiculously long to come to your floor. Would definitely stay here again.", "title": "Consistent yet Unremarkable", "user": "Picasso777", "date": "September 12, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 117990835}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "The hotel is situated on a busy road near the centre of Campinas. It is a modern hotel, clean and a good place for business people to stay (because those were the majority of the guests).", "title": "A Very Comfortable Hotel in the Centre", "user": "OldVillain", "date": "October 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 142577987}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "If I was a tourist …hang-on, what am I saying, I can't really see why tourist would:", "title": "Good business hotel", "user": "Jaundiced_Eye", "date": "September 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 141536651}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "a) want to visit Campinas, there's nothing to see and do here.", "title": "So new my GPS did not know it was there!", "helpfulness": 1, "user": "chasinUpstateNewYork", "date": "September 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 141455561}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "b) want to stay here in the centre of the city.", "title": "Positive experience", "user": "YoungCoupleFromGRU", "date": "September 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 140007099}, {"rating": 4.0, "title": "Just good, not excelent....", "text": "Let's start again. If I was a businessman/woman, this is exactly where I would want to stay. It has all that I need. A business centre, conference facilities, good places to eat and really comfortable, spacious rooms to stay in, work or enjoy a good night's sleep.", "user": "Alfredo V", "date": "August 22, 2012", "id": 138017628}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "Attended a four day business meeting at this property and was very pleased. I have been to Sao Paulo a number of times, but this was my first visit to Campinas. (Note - it is still the same congested trip to and from the airport. Each one took 1.5 to 2 hours.) Hotel was clean with very nice sized room and very pleasant staff. Based on my other stays in Brazil, I do not assume that finding English speaking staff will be a given. I had no problems while at the Vitoria. Due to the size of our group, our dinners were all arranged offsite, but both breakfast (individually at the hotel) and group lunches were at the Vitoria and the food was excellent. Finally, for business travelers, the property had a good space to accommodate four days of meetings with a group of about 30 people. The only negative I had is that the exercise area was placed right in the midst of the meeting area, with floor to ceiling windows, so it felt a bit exposed. It does have a spa, but I did not utilize while I was there. The surrounding area was pleasant and all in our group felt safe with walks to explore or go to local shops. Something that I was advised against doing on my stays in Sao Paulo. I would stay again if in the area.", "title": "Very positive experience", "user": "GSquared", "date": "August 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 137931884}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "I like the hotel. Nice, clean, overall good. Bed might be hard for some. What I really did not like at all is that I have stayed here 4 or 5 times, I have recommended the place, people from my company have stayed here because I recommended it and yet, they charged me a half a day fee for early check in. I understand it is a business and I understand the early check in fee... however, having stayed here so many times and having brought business to them, I think it is totally wrong that they apply this fee to me. This shows a total lack of loyalty toward their customers. No business sense. Just because of this I will look for other options in my next trip to Campinas.", "title": "Good Hotel - Charged me for early check in...", "user": "Fernando L", "date": "June 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 131748738}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "I found this hotel to be perfect for business travel with plenty of restaurants and a wonderful exercise area. Perhaps the only disappointment was that the hot tub was cold after I had pulled a muscle running. But it IS Brazil!", "title": "Very nic, simple hotal", "user": "Earnest B", "date": "April 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 128670634}, {"rating": 4.0, "title": "Nice Hotel", "text": "The park across the street is a wonderful backdrop to the trip and you can jog through it as well.", "user": "bassboards_sax", "date": "April 15, 2012", "id": 127928092}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I stayed 3 nights at the hotel. It's quite nice, modern and not overly extravagant - but is clean, quiet and comfortable. My room didn't have a desk, which I would have preferred, but the small table area served acceptably for a business workspace. The room was a decent size, not too big, not too small and appointed well. The bathroom was a good size and modern decor. The WiFi and Internet access worked fine - perhaps just a bit slow.", "title": "Good hotel with exceptional gym / pool", "user": "Stefan M", "date": "March 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 126957171}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I have stayed at this hotel many times over the last couple of years. They are currently in the middle of a major expansion to double the size. I am not sure if this will change the facilities, but they really need it. The room is very basic, but clean. The location is central and very close to the restaurant district. The Restaurants in the hotel are both excellent. The Kandai has the best sushi in Campinas. The steak house is also very good. Overall, it suits needs for business, but there are nicer hotels in Campinas", "title": "Average Hotel, but nice restaurants", "user": "Barry H", "date": "August 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 2.0, "value": 3.0, "service": 3.0}, "id": 117393459}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "Vitoria Hotel Campinas delivers on most aspects what one may expect from one of the best hotels in Campinas. Front desk personnel speaks English.", "title": "Well located business hotel", "user": "Joao_Lagoa", "date": "July 22, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 115652660}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Room size, interior, quality of the bed, hygiene, warm water quality and shower pressure are all good. WiFi connection was without problems and fast and the TV had a wide choice of channels. The bathroom could have been somewhat spacier. Toilet flushed perfect which cannot be said of all toilets in Brazil, even in the better hotels", "title": "Sweet honeymoon", "helpfulness": 1, "user": "BeaK_SD", "date": "June 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112813718}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "The only annoying point is the noise from the bathrooms from other rooms and contact noises from chairs movend on the floors. Noise of traffic at night is not a problem.", "title": "Good Hotel, but too simple to be the best hotel in the city", "helpfulness": 2, "user": "dudaBrazil", "date": "April 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 105298089}, {"rating": 2.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "There are 2 restaurants next to the hotel, one of which is Japanese. There are more good places to eat in the close vicinity and it is safe to walk.", "title": "Expensive, noisy and too simple", "helpfulness": 1, "user": "Magajo", "date": "March 3, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 98815382}], "location": {"country": "Brazil", "continent": "South America", "city": "Campinas"}, "stars": 4, "variance": {"poor": 7, "average": 18, "very good": 71, "terrible": 2, "excellent": 33}, "aka": "Vitoria Hotel Campinas Brazil", "slim_ranking": 0.1875, "description": "Vitória Hotel Concept Campinas is located in Cambui district, the most privileged area in the town, where our guest can find the best restaurants, bars , bakeries, cafes and shops. The hotel has 253 charming and comfortable rooms which offers plasma TV with cable channels, mini bar, air conditioning, electronic safe, hair dryer, bathtub with shower, workstation with Wi-Fi access. Besides, it has a complete Fitness center, a Spa, a heliport, a Jazz bar and 03 international restaurants, which was considered the best restaurants by Eating and Drinking Guide of Veja Magazine. For corporate events, it has 12 ballrooms for all kind of meetings, but if you are looking for a place to celebrate a Party or a Wedding, Vitória Hall is the most elegant place for it."}