{"user_rating": 4.5, "review_count": 834, "name": "Vivanta by Taj - Fort Aguada, Goa", "reviews": [{"rating": 2.0, "title": "Good for the domestic traveller", "text": "This hotel is a poor choice is you are looking for that classic goan getaway and some relaxing times. We were at first disappointed by the fact that they don't have enough pool chairs to service even a minimal number of guests, and it took much prodding to get any service around the pool at all. Second at night they had some sort of corporate karaoke event that went until 3 or 4 AM in the morning, so sleep was not really an option. The dining there is actually pretty good...but i would not stay there again.", "helpfulness": 5, "user": "SunnytheTraveller", "date": "June 27, 2007", "id": 8016772}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "The \"sit-outs\" (ground floor rooms) are just a small patio with iron table/chairs, separated from the next by low shrubs. Pleasant enough, but hardly private. However, it does mean you have easy access to the lovely shady communal gardens & loungers where we spent all our time. The \"sea view\" sit-out rooms are in 2 blocks to the right of the central foyer, and \"garden view\" rooms in 2 blocks to the left. All blocks face large gardens (though the sea view side lawn is a little smaller and less shady). In my opinion the sea-view is not worth the extra cash...Beware the gdn view rooms 136-140 are close to the car park & noisy & overlooked. To avoid.", "title": "Good for a few lazy days", "helpfulness": 3, "user": "alann6", "date": "March 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7161833, "likes": {"liked": "— peaceful gardens", "disliked": "— limited privacy"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "The gardens are an oasis of peace to snooze all day.", "title": "Great location", "helpfulness": 5, "user": "Tippytoe", "date": "March 6, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6920842, "likes": {"liked": "— Location and restaurants", "disliked": "— Water sports vendor clogging the beach in front of the hotel"}}, {"rating": 5.0, "title": "Great resort!", "text": "We looked at the THVillage. Most of the rooms are set back in narrow walk-ways through the gardens,4 to a block (2 up, 2 down). It looked a little cramped, and the sit-out areas not that private.", "helpfulness": 5, "user": "Travelplanner74", "date": "February 20, 2007", "id": 6817835}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Surprisingly most restaurants at FABR are A/C and indoor. We much preferred the stylish open air bar at the THV a few minutes walk down the beach, though as others remark : there are lovely comfortable beach bar/restaurants at a fraction of the price within 2 minutes walk.", "title": "Serendipity...", "helpfulness": 4, "user": "RandomWalks", "date": "February 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6788647}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We just returned after a holiday here for the Diwali weekend.", "title": "Great property, tired rooms - go for the Taj Holiday Village instead", "user": "sankar", "date": "October 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 21365068, "likes": {"liked": "— View, location", "disliked": "— Pool, bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "The hotel overlooks the aguada fort and a small beach. Though the beach is not the best, the hotel is in a great location if you are looking at other things like shopping, eating, night life, etc. Lots of nice restaurants close by. We haven't explored South Goa much, but it seems like that part is a better option for true beach-seekers, and has better resorts as well. However, if you want to go around and do things during the day, this hotel (along with its sister property the Taj Holiday Village) is probably the best option in North Goa. You can rent a bike or a car outside the hotel and drive to Baga in 15 mins or Panaji in 25 mins. The airport is an hour away and South Goa an hour and a half or more.", "title": "Great Hotel", "helpfulness": 1, "user": "holkhogan", "date": "August 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19117841, "likes": {"liked": "— friendiness", "disliked": "— bugs in pool"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "Coming to the property itself, it has a great location and our sea view rooms had a great view. The rooms on the ground floor have sitouts, which are not very private, but have better access to the beach and the grounds. The hotel itself is quite small for a resort and feels a little cramped. The pool is located well, overlooking the sea, but is pretty small. The Taj Holiday Village seemed to be much bigger, with expansive grounds, a great pool and better restaurants. The beach has suffered a fair amount of erosion which means that there is only about 200 metres of sandy beach available, and you can't work further down after this. This also means that the Taj Holiday Village, is not accessible through the beach. They do have a complimentary car transfer at any time between the two resorts, and since we found the facilities at the Village much better, we must have taken some 20 trips to the Village during our 3 day stay.", "title": "Luxurious break", "user": "N_McL", "date": "July 31, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 18453845}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The Village has a better beach - you can walk along it all the way north to Calangute or Baga. It is also better located with shops, restaurants, bike rentals, etc. just outside the hotel entrance.", "title": "Wonderful!", "user": "Bryanworldtraveler08", "date": "July 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 4.0}, "id": 18248658, "likes": {"liked": "— Service", "disliked": "— price"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2005, traveled as a couple", "text": "Coming to the rooms, the standard sea view room we stayed in was quite small, especially the bathroom. There were some water leakage stains apparent on the walls and ceiling, and the bathroom could also do with some renovation. Service was generally very friendly and of a high standard, but we did have some problem with housekeeping on the last day - the chap seems to have spilt something which made the floor quite oily, and my wife's skirt which had been on the table was found below the sink. Other than this mysterious episode, everything else went well and all the staff were very happy to help with anything we needed. The breakfast was great at both properties with lots of live stations for eggs, pancakes, dosas, appams, etc. but it looks like everyone goes for breakfast at the same time (just before breakfast closes), so it does get quite busy. The Italian restaurant was good but not exceptional, and the bars were great to chill out at.", "title": "delightful, delicious.!!!", "helpfulness": 2, "user": "badkids1366", "date": "June 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 17019572, "likes": {"liked": "— the location, and the view from the bedroom door! oh, and the elephant walking down the street!", "disliked": "— price"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "My wife and I just returned from a trip to India during which we stayed three nights at Fort Aguada. We both absolutely loved the hotel. We staying in one of the cottages, which was very well done. Room was clean, comfortable, very modern and spacious. Staff was extremely friendly and helpful. The pool area and outdoor bar were perfect places to relax under the scorching midday sun. The restaurants may not have been exactly five star, but they offered good food at reasonable prices.", "title": "Oasis in Goa", "helpfulness": 1, "user": "novaman99", "date": "March 24, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 14503956}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "We also felt the Fort was in a good central location where one could venture south if they were looking for quieter locales, or head north to the outdoor markets to shop.", "title": "A great Place", "helpfulness": 1, "user": "madmax929", "date": "March 5, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 14066908, "likes": {"liked": "— The ambience", "disliked": "— The room size and the fact that one the first day the staff gave us the wrong room category"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "Overall we had a great stay, and would definitely recommend this hotel to all of our friends and family.", "title": "One of the best bets in the north of Goa, but likely better options south", "helpfulness": 5, "user": "7J1AIL", "date": "January 25, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 12970002, "likes": {"liked": "— Food", "disliked": "— Communication problems among hotel staff"}}, {"rating": 2.0, "title": "Not worth the money!", "text": "A great place to laze around. The view from the fort ramparts is excellent. The facilities and services provided are good. The rooms a good but are a bit small in size. Tee best part is that you have a wide range of choice as Taj Fort Aguada shares its facilities with Taj Village resort. The staff is polite, courteous and caring. It’s a great place to visit with kids as the activity centre at Taj Village keeps the kids occupied. There are good places to eat around and roam around the Taj property. One such good place is Curry patta –a small vegetarian restaurant, on the main road right next to Taj village. It has excellent Goan Vegetarian home made food which one cannot find any where else in Goa.", "helpfulness": 2, "user": "wonderchild", "date": "November 6, 2007", "id": 10631110}, {"rating": 4.0, "title": "beautiful cottage", "text": "In north Goa this is one of the best places to stay, along with the neighboring sister Taj property. Since we had some business to attend to in Panjim and Mapusa this was the best option in northern Goa.", "helpfulness": 4, "user": "goodtrips01", "date": "October 20, 2007", "id": 10163820}, {"rating": 5.0, "stay_parameters": "Stayed November 2006", "text": "I booked this hotel from the US..not really knowing what to expect. i must say this was a pleasant surprise. I had been staying in huts on the beach for 10 days prior to my arrival at fort aguada...as you can image the beauty, cleanliness and luxury of the resort was a welcome sight to sore eyes.", "title": "very peaceful", "helpfulness": 4, "user": "sbhangoo", "date": "February 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0}, "id": 6725078}, {"rating": 3.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "The staff were great, and with our room we got an awesome large breakfast buffet included everyday. It was delicious. The private beach was secluded and nice...the pool was relaxing.", "title": "$160 Compulsory Christmas Dinner", "helpfulness": 3, "user": "and_fancy_free", "date": "January 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 6594161, "likes": {"liked": "— The Breakfast", "disliked": "— The VERY HIGH prices"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2006", "text": "If you are looking for a nice secluded place to stay without the crowds...this is for you.", "title": "Very dissapointed", "helpfulness": 8, "user": "padped", "date": "December 31, 2006", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 6523439}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "My brother, on the other hand, wanted the younger scene and bikini-clad women...and he did not enjoy the place.", "title": "A Very Peaceful Holiday", "helpfulness": 6, "user": "Hampshire_Scots", "date": "December 3, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6321078, "likes": {"liked": "— The unobtrusive service provided by the staff and the room patio", "disliked": "— We were lucky in the room allocation, therefore there was nothing to dislike"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "I must say that in november...there tended to be an older crowd (i imagine b/c of the price).....but for me (a 25 year old) i enjoyed being able to sit on the beach and not being gawked at by tourists and the locals.", "title": "Very Friendly", "helpfulness": 5, "user": "lupton53", "date": "November 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6176795, "likes": {"liked": "— Clean and Friendly", "disliked": "— Getting dated"}}], "location": {"country": "India", "region": "Goa", "continent": "Asia", "city": "Sinquerim"}, "stars": 5, "variance": {"poor": 33, "average": 68, "very good": 270, "terrible": 11, "excellent": 452}, "aka": "Vivanta By Taj - Fort Aguada, Goa Hotel", "slim_ranking": 0.333333333333, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Vivanta by Taj - Fort Aguada, Goa is at its best. Romantic. Charming. Vibrant. It has history woven in its walls. It's where royalty, heads of government and the biggest celebrities are known to frequent. For the luxury Goa experience, which no other place has been able to recreate. Not much has changed. In the renewed rooms, cottages and villas, the nouvelle restaurants, the island bar, and the Jiva spa where you'll go Ah!"}