{"user_rating": 5.0, "review_count": 43, "name": "Vogt Farm Bed & Breakfast", "reviews": [{"rating": 5.0, "title": "The 1st B&B we HAVE to go back to!", "text": "My husband and I have stayed at a number of B&B's and while we've enjoyed our past experiences, we've never felt compelled to return as there are so many other places to try and visit. Our streak was broken when we visited Vogt Farm as we will certainly be back in the future!", "user": "NicoleandKyle", "date": "June 28, 2009", "id": 33382685}, {"rating": 5.0, "title": "Homey and welcoming but with every amenity", "text": "We called ahead of time and let our hosts know that we would be arriving later than the usual check-in hours of 4-7 PM. No problem from them. We arrived and were immediately greeted by Keith who walked us into the kitchen, took our breakfast drink order, and got our bill situated. With business out of the way, he walked us up to our room (we stayed in the smallest of the rooms, the Cousin Edith) and pointed out all of the amenities. This room has a detached private bath which we didn't mind in the slightest, but if you are interested in more privacy, one of the other rooms is probably a better choice.", "user": "mamapuss", "date": "February 20, 2009", "id": 24844987}, {"rating": 5.0, "title": "Weekend Away", "text": "Our room was very clean and cool, with a multitude of electronic gadgets my husband was happy to play around with. The room has its own temperature control, free wireless internet, and a TV/VCR combo (the other rooms have DVD). The bed was very comfortable with doublesheeting and everything was spotless. This room also has a faux fireplace which we thought was charming.", "user": "costolo226", "date": "February 17, 2009", "id": 24667989}, {"rating": 5.0, "title": "Just As Good The Second Time", "text": "Outside our room, there was a private refrigerator for us stocked with a variety of complimentary sodas and water bottles. There was also a snack center with candy bars, cookies, crackers, popcorn, and mugs/coffee. There was a good variety of DVDs and videos to borrow as well.", "user": "HappyTimeTourist", "date": "February 9, 2009", "id": 24417281}, {"rating": 5.0, "title": "Loved the Vogt Farm B & B !", "text": "Our bathroom was outside the room although the rest are inside. It was very large and painted in a lovely outside garden theme. The care that is taken with the decorations in the house is noticeable and beautiful. It consisted of a two-person bathtub/shower combination and complimentary bubble bath was provided. The only item I wished was provided was a separate conditioner for my hair instead of a conditioning shampoo. We were provided fluffy robes to use during our stay as well.", "user": "christy1223", "date": "January 8, 2007", "id": 6567160}, {"rating": 5.0, "title": "Wonderful Welcome and Wonderful Stay", "text": "This is a super B&B and ideal for seeing ‘Amish Country’. The B&B is on a working farm, and so is surrounded by cornfields and cattle. The house itself was beautiful, and the room we had was excellent - wonderfully decorated, great views and really comfortable. Our welcome from Keith and Kathy couldn’t have been bettered, they were so friendly and helpful and really made us feel at home. Although they will serve you breakfast in your room if requested, I would recommend joining the other guests for breakfast each day. Breakfast is served at 0830 (0800 on Sundays), and all the guests sit around a big family table. This may seem inconvenient to some, but there is the option of breakfast in your room. Having said that, I would recommend coming downstairs for breakfast, as it’s a great way to start the day! The dishes are passed around just like a family would, and conversation starts flowing straight away. The innkeepers have some great stories – I would recommend any visitors from England ask Kathy about the Falmouth Goat Races! Guest can also compare tips for what to see and where to eat. Keith and Kathy were really thoughtful and great hosts - they had sodas, chocolate and coffee available when we arrived, and an ‘oops’ drawer full of all the things people forget to take on holiday - scissors, tape, plasters, etc. I would also recommend taking advantage of their offer to have an evening meal with some of the Amish farmer neighbours. We enjoyed that evening so much chatting about their way of life and eating some delicious food. If you are in the area then stay here!", "user": "davesoya", "date": "September 7, 2006", "id": 5777110}, {"rating": 5.0, "title": "Loved the Charm", "text": "We loved Vogt Farms! From the drive up the drive way I was in love. This was our first trip to a B&B and we are hooked now. The only problem is we don't want to stay anywhere else. Keith and Kathy have spoiled us! We will be visiting again soon. The charm of thier family farm house is unbeatable. They provide every thing you could possible think of, from bath salts to maps of the Amish countryside. The soaking tubs are to die for. Kathy is a great cook and they will keep your breakfast fun and full of stories. If you have never tried a B&B make this one your first!", "user": "A TripAdvisor user", "date": "January 18, 2006", "id": 4361943}, {"rating": 5.0, "title": "Sunsets, Corn Stocks, and friendship", "text": "From the second we drove in to the farm, the Vogt family treated us like one of their own. Our luggage was carried to our beautiful second story room with an adjacent deck to look out over the cornfields. Treats and drinks were available for our choosing. Fancy robes were found in the homey closets.", "user": "A TripAdvisor user", "date": "August 9, 2004", "id": 2432710}, {"rating": 5.0, "title": "Warm and Wonderful B&B !", "text": "Kathy had a wonderful charm as she discussed the wonders of parenthood and we shared the history of the curious cats on the farm. A sunset walk was just out the door.", "user": "Liz F", "date": "December 28, 2003", "id": 1531878}], "location": {}, "variance": {"poor": 0, "average": 0, "very good": 1, "terrible": 0, "excellent": 42}, "slim_ranking": 0.5, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "description": "Welcome to our Gentlemen's Farm in the fertile farmlands of Lancaster County, PA's Amish Country. This pastoral setting has been our home since 1972 and we invite you to come and share in its delights. On our farm you will find a few cats at the house and beef cows with calves at their sides grazing in the meadow. Keith and Kathy are from the country and cherish the farmland. We understand the need to use the land wisely and conserve."}