{"user_rating": 4.5, "review_count": 851, "name": "W Montreal", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "I am writing this from the W and while the rooms are adequate and modernly decorated, the room is incredibly dark. I have a window but it appears I am on the interior of the hotel looking out into office space. The W is one of the many hotels that no longer put a coffee pot in the room, which is incredibly annoying if you are like me and require a cup to get the day started. They do offer coffee in the lobby, but I'm not usually presentable when I want the first morning jolt. My flight was delayed and I arrived after midnight. The appearance of the hotel is really not that of a normal hotel. No drive up, check in area. I drove around the block several times before calling and asking where the main entrance was, it's the appearance of an office building and the valet was nowhere to be seen. It was late, and when they appeared they were very cordial--albeit I was cranky from being late and wishing to get a workout in before bed. I made it to the gym and was sorely dissapointed by what they offer. It's better than most Hilton gyms but offers a few free weights and cardio--not as much as I had hoped for. I am a fit traveler and would gift the gym 2.5 out of five stars. The room does have a DVD player, so I'll use that for my evening workout w/a DVD I brought from my fitness collection. I also went in search of some hot water for tea an hour ago. I found a bar but they said they couldn't help me--I guess they don't have hot water to go ? I went to the front desk, but they were too busy. I called and asked if someone would bring me a pot of hot water, it seems like it should be easier. They said they'd send it up. That was over an hour ago----really tough to find hot water for a cup of tea in this hotel. I really hate it when they don't leave a coffee pot in the room--I probably wouldn't have been driven to type a review otherwise.", "title": "Not worth it", "user": "stacymac", "date": "January 26, 2011", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 1.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 94527154}, {"rating": 3.0, "stay_parameters": "Stayed January 2011", "text": "It's overpriced for what you actually get. The ambience is nice but the Sheraton and Westin etc deliver better value.", "title": "Overpriced.", "user": "amyandandrew", "date": "January 13, 2011", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 92769335}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Very nice hotel, rooms very comfortable. I stayed there few times and tried 3 types of rooms : Wonderful, Mega and Suite WOW. I would recommend the Mega since it's bigger than the Wonderful and has a big bath. I personally do not think the Suite WOW it that much nicer than the Mega, so why pay almost double the price ? The hotel is very well located, walking distance from Old Montreal and Ste-Catherine Street (shopping). Gym is not the best, but you'll find free weights and some cardio machines.", "title": "Trendy and very well located", "user": "MAC_1979", "date": "January 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92706051}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "It's a bit pricy for Montreal's standard, but overall an excellent choice if you'd like to experience a trendy hotel.", "title": "GREAT WEEKEND!!", "user": "RPL_13", "date": "January 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92334940}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We had a massage at the Spa that I would rate 8/10 (100 $ for 60 min). It's on the expensive side, but I liked the fact that you can go back to your room and relax after the massage.", "title": "W Gave my Engagement Weekend a big hand.", "user": "Foolich", "date": "December 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 89942675}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The W Montreal, now 7 (8?) years old and still is going strong. The hotel is hip and energetic just like Montreal itself. Everything’s in great shape, including common areas, walls and carpets; these are usually the first signs that a hotel has aged un-gracefully. There appears to be a thread running through this hotel that is sexy and sleek from the intimate spaces in the living room to the 6-stool Bartini bar where we were able to share in non-pretentious conversation with a bartender who knew how to give proper service and make a real gin martini. The rooms continue to carry this thread with open concept bathrooms, a soaker tub in the middle of the room and a tinted glass shower; definitely not for the prudish traveller!", "title": "Still \"Wows\"", "user": "anthonytravels", "date": "July 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 133673503}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "On a practical note, the hotel is in a great location, hard to choose in a city as fabulous as Montreal. It’s literally steps from Vieux Montreal, and minutes by Metro or cab to neighborhoods like Le Village or Mont Royal. The hotel has direct Metro station access from the lower level, which I imagine is a plus during the winter especially. The beds are incredible and probably don’t even require a mention; it’s a W and the Fantastic Suite has a double vanity which is a must for sharing.", "title": "W Hotel, Monreal", "user": "Monica S", "date": "July 6, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 1.0, "location": 3.0}, "id": 133575859}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "I suppose the housekeeping could have been more consistent; one day they would empty the trash, the next day they wouldn’t and I wouldn’t recommend accepting a room on the 7th floor because of the parallel windows, they just don’t seem to fit the room design/décor, so make sure you ask for a room on an alternate level.", "title": "Very cool hotel", "user": "herzog00", "date": "June 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132683167}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Lastly, it’s totally inconsequential, but I loved the night tables that light up. I hope when they update the décor this fall that they keep these!", "title": "Fantastic Location and Great Staff!", "helpfulness": 1, "user": "sdbh", "date": "June 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131967932}, {"rating": 4.0, "title": "Modern Hotel, good starting point for Sightseeing", "text": "WORST hotel ever. The only good thing I can say about this hotel is that the bed was comfortable, which is expected for a hotel of this caliber. Otherwise the room was horrible. The bathroom was not closed off except for the toilet which left no privacy for showering. The gym was almost non-existent. There is a club on the bottom level and way up on the fifth floor you could hear the music. The final straw was after we checked out we noticed a $200 charge for smoking in the room - we do not smoke - and had to argue with the hotel to get reimbursed. Stay at the Fairmont (great hotel) or the Omni (nice hotel, right across from McGill).", "user": "HannahAC", "date": "June 12, 2012", "id": 131869117}, {"rating": 1.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We stayed in the W Montreal for 5 night during our Honeymoon. The poor experience we had actually started BEFORE we arrived. Why? Well, we called ahead to inform them that we were on Honeymoon and asked them if they would do anything special, like ALL other hotels did, for example Westin Boston (Champagne), The Cottages Nantucket (local chocolates) and the Hilton NYC (Champagne, Fruit and an upgrade). The W Montreal did not even acknowledge that we were on honeymoon when we checked in, however we were privileged to get to check in at all, given the wrestler doormen they had when we arrived and had to get through a queue for their trendy bar before we were even allowed to enter the hotel.", "title": "Very poor staff and management", "helpfulness": 2, "user": "CPKONE", "date": "May 3, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 29247647}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "The room was relatively good, could have been cleaner and less dusty, but technoligically, it was ahead of most other hotels, good TV's, electronic curtains, DVD, etc. There was evidence of the previous tenants, empty bottles in drawers, etc.", "title": "Nice romantic night at the W Montreal", "user": "onomatopee", "date": "April 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 28712265}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We had a number of issues with service that we brought to the attention of management on leaving, however got no response until we chased up again. We were only given a rather curt response, short of an apology.", "title": "Location is a problem", "user": "Jesille", "date": "April 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 1.0, "service": 3.0, "rooms": 3.0}, "id": 28523305}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "We were also recommended by the consierge to go to a local restaurant, that was unfortunately very very poor and very very expensive. Stay away from restaurant EMMA !!", "title": "A honeymoon to remember!", "user": "NYC_is_for_lovers", "date": "April 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27431241}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "In summary, it started bad and ended bad.", "title": "Excellent service, industrial nightclub decor", "user": "puntacanaprincesita", "date": "March 30, 2009", "detail_rating": {"cleanliness": 5.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 27121726}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Booked a room as a surprise for my husband's 40th bday so I was counting on all going perfectly! Unfortunately, at the reception desk, we find out that the room is not yet ready (we arrived 1h30 after check in time). Before I have time to complain about it, the employee offers us coupons for drinks while we wait and for breakfast the next day (approx $100 value). Once we do have our room, it is amazing!! Completely modern, well maintained and very clean. The bathroom is huge and the shower incredible!", "title": "Started not so good, but finished with a WOW!!", "helpfulness": 1, "user": "VeronicaM020", "date": "July 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 134991958}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "After returning from dinner, the hotel becomes very loud. There are clubs (2 I think) that really know how to throw a party. Unfortunately, we could hear the music all the way in our room.", "title": "A big hip hip hourrah for the staff", "user": "GEORGEDORLY", "date": "July 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134626145}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "After we left the hotel, I completed a customer satisfaction survey and mentioned my disappointment with the room not being ready. I was contacted by the hotel and offered a few more rewards for our stay as well as a gift for our next stay.", "title": "Chic and stylish--great hotel!", "user": "D B", "date": "July 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134606809}, {"rating": 5.0, "title": "If you are a fan of the Starwoods \"W\" hotel line - you won't be disappointed", "text": "It didn't start as I had planned, but the service turned out to be so great, that I do not hesitate to recommend the hotel!", "user": "A TripAdvisor user", "date": "July 15, 2012", "id": 134394521}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We had big expectations on this return trip to MONTREAL, this after a good number of stays in the far too distant past. Our stay got off to a great start with a warm welcoming by the valet service,followed by a smiling and competent check in at the front desk. This high quality service lasted through out the 2 night stay", "title": "Skip the Concierge, ask the valet", "user": "John J", "date": "July 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134378637}, {"rating": 2.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "I would not recommend this hotel on one factor, the noise. It is absolutely ridiculous that such a high end hotel (with high end prices) does not have the sense to design their facility for quiet sleeping. We stayed on the 5th floor and you could clearly hear and feel the throbbing of the night club below until 3 AM. It also radiated up the elevator shafts. I imagine you would have to be on at least the 7th floor to avoid the noise. I did have earplugs but they did not block out the sound/vibration.", "title": "Ridiculous! WTF?", "user": "artichokehrt", "date": "February 13, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 1.0, "rooms": 4.0, "location": 4.0}, "id": 96434827}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled with friends", "text": "It is a shame that the such a beautiful and well located hotel is not able to provide what even the most lowly motel can, a place to sleep in relative quiet.", "title": "Great place to stay for the weekend", "user": "Parabola", "date": "February 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95684441}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "We stayed in a Mega room which was beautiful. I loved the large and comfortable bed. The bathroom was open concept and lovely. The staff were friendly. It met all my requirements in style and convenience but unfortunately that does not make up for no sleep!", "title": "Foodies, do not underestimate a good concierge", "user": "ciccotown", "date": "February 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95482306}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "The W Hotel in Montreal is a modern and chic hotel to stay at in the Downtown section of the city. It is steps away from the metro, and within easy walking distance to old Montreal. If you choose not to dine at Otto (the main restaurant within the hotel), there are plenty of other great dining options nearby.", "title": "Super high-tech, great service, insane prices", "user": "olliedawg", "date": "February 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95394725}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "The rooms were spacious and very well decorated in a contemporary theme. Beds are really comfy, especially after a day of walking about the city. The one weird decorative feature that takes some getting use to is that there is a glass wall between the shower and the main room. That was a bit awkward particularly if sharing the room with a friend or family member. My only other complaint was that there was no complimentary water or internet, something that I think every five star hotel should offer. But really, those are minor complaints and should not deter you from staying at this hotel.", "title": "One of our favorite hotels!", "user": "DianaJBJC", "date": "February 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95234801}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "I stayed at the W for 2 nights in January 2009 for business and absolutely LOVED it. I arrived fairly late on a Tuesday night and was check in was a breeze. I was upgraded as a gold SPG member and my room was huge! It was incredibly clean and spacious with a great bed and amazing bathroom.", "title": "LOVED the W", "helpfulness": 2, "user": "ladybugx87", "date": "January 29, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 24015487, "likes": {"liked": "— spacious room"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "The internet works quite well. I did the basic and it worked quite well. The TV choices are nice. The bliss bath products were great.", "title": "Poor hotel for a business stay", "user": "Caring_Bear", "date": "January 13, 2009", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 23517927, "likes": {"liked": "— Fun staff", "disliked": "— Horrible views, poor value for the money"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "My room was cleaned quite well between days as well.", "title": "Very funky place to stay", "user": "LoveTaxidia", "date": "January 6, 2009", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 23314490, "likes": {"liked": "— Location and atmostphere", "disliked": "— Rooms are on the small side and a bit dark"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "I used the fitness center both mornings and was please with the selection and cleanliness.", "title": "Fantastic", "helpfulness": 4, "user": "seatbelt123", "date": "December 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 22930685, "likes": {"liked": "— Gorgeous facility, great view, fantastic service", "disliked": "— Dining - okay though, plenty near by."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "We ate at the hotel restaurant- Otto- one night (snowstorm prohibitied us from going out) and it was yummy!", "title": "Very Nice", "user": "vter", "date": "December 15, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 22749365, "likes": {"liked": "— The vibe of the hotel", "disliked": "— Cost of parking, but that was to be expected"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "My husband and I stayed here three nights during our honeymoon. We were given a \"Wow Suite\" on the 10th floor of the hotel. The room itself was two floors with floor to ceiling windows that overlooked beautiful Montreal. The hotel is modern and very clean. The staff were always pleasant, helpful, and friendly. The hotel bars are pricey but not at all out of line what you'd pay in any major city: Toronto, NYC, Chicago, etc.", "title": "I'm a believer in the W brand because of the W Montreal!", "user": "jd5066", "date": "March 25, 2009", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "rooms": 5.0}, "id": 26801412}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "The hotel is located perfectly between centre-ville and vieux Montreal. There is a Metro stop directly across the street.", "title": "Modern looking hotel, but way too expensive", "helpfulness": 1, "user": "renox", "date": "March 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 25861180}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "I would stay at the W again in a second.", "title": "Beautiful Hotel, but small room!", "helpfulness": 1, "user": "eeva1", "date": "February 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 25049049}, {"rating": 2.0, "stay_parameters": "Stayed February 2009", "text": "I've been at this hotel for one week. The room I had (mega room) looked very nice/stylish.", "title": "Special surprise in the bathtub sums it up. Thumbs down", "helpfulness": 2, "user": "asb09", "date": "February 17, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 24680359}, {"rating": 1.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "Most of the (female) staff were nice. Some male staff at the welcome desk & wunderbar were asses. I wasn't allowed to get into the wunderbar, because I did not have a room. (My colleague was checking in at that moment, so I just wanted to get myself a drink in the meanwhile.)", "title": "Very Pretentious and extremely expensive Internet charges", "helpfulness": 1, "user": "zebra48", "date": "February 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 4.0}, "id": 24376191}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The W Hotel came highly recommended by a colleague of mine. In fact, my colleague actually had a wedding ceremony in this particular W. Everything looked great on the website, but I did not know what to expect upon arrival at the hotel in a city that was new to my fiancee and I...", "title": "Best hotel stay we have ever had!", "user": "nelboski", "date": "February 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97822280}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The W Montreal was better than we could have ever imagined or hoped for. The trip to Montreal was an engagement/Christmas gift for my fiancee. How excited were we when we found out that we had received a complimentary upgrade upon arrival? Very excited! From the beautiful lobby leading to our spacious and trendy suite - the first impression could not have been any better!", "title": "Always close to perfection!", "helpfulness": 1, "user": "John993", "date": "February 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97805662}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Location is ideal as many destiantions in Old Montreal are within minutes on foot. In fact, we walked everywhere we needed to go during the coldest month of the year.", "title": "Love the W's", "user": "brendonlord", "date": "February 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97624785}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The service is amazing! We had excellent experiences with the front desk staff, concierge staff, Away Spa staff and even the senior managers (who were very accommodating). They truly do appear to want to \"make your wishes come true\" as they say...I found it never hurts to ask for anything when dealing with these folks!", "title": "Like to 70's on steroids.......", "user": "habs4lif6", "date": "February 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 97435489}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The rooms themselves are spectacular. We stayed in a \"Fantastic Suite\" which had ample space and many modern amenities that we appreciated (our favourite was the large rainfall shower area). What sets it apart the most I find is the immaculate detail that can be found throughout the place. The use of lighting in particular creates an atmosphere unlike anywhere else.", "title": "Amazing!!", "user": "b02102010", "date": "February 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 96796605}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We stayed two separate times at this hotel. First one night when we arrived from Burlington (before leaving for QC the next day) and then for 2 nights, once we returned from QC. The first time we checked in the service was excellent even though there was a convention in town and the hotel was booked out. We got a small room without a view (the window faced an enclosed office hall/area) but for one night it was a comfortable place to stay with that fun, glass shower specific to the W hotel design. When we returned we got a very large room, with a sitting area, a huge tub, double sink bath. Again the service was excellent and everyone was very helpful. From the front desk folks, to bag carriers and the bartenders (we got passes for free drinks) everyone seemed to enjoy their job and happy to help you.", "title": "Great Place to Stay when visiting Montreal", "user": "LoveTravels", "date": "July 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 135929229}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "I did notice that the hotel has somewhat of an identity-crisis in terms of who it thinks it is designed for and who really stays there. The decor screams young partiers, well-off, rockstar types but most of the guests are calm young people or middle aged, mellow business travellers or Montreal explorers. Either way it is a great place to stay when visiting this fascinating city.", "title": "Superlative hotel!", "user": "ron091", "date": "July 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135770359}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We went to Montreal for a 2-day celebration of our anniversary.", "title": "GREAT!!!", "user": "iluvrudy", "date": "July 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135325848}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "From the first contact with the staff (valet) to the last words the desk personnel speak to you when you leave, it is obvious they care and they are extremely well trained.", "title": "Skip the W-Not the service you expect and short staffed!", "helpfulness": 1, "user": "Viv A", "date": "July 23, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 135125337}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "The hotel is perfectly situated in Montreal. It is close to everything you would ever do for a vacation. We paid for a $20 upgrade on-line before arrival. We had an amazing room with ultra-modern decor, bedding and the best hotel bed we have ever slept in.", "title": "Home away from home", "user": "JY_Martineau_027", "date": "July 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 135018145}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "You don't know a beautiful city until you have visited Montreal, and for us the beauty started at the hotel. The valet from the moment we pulled up to the hotel, the front desk attendant, the concierge, and other staff members were all very helpful and friendly.", "title": "Beautiful hotel & location", "user": "PeterS992", "date": "July 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134192186}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The W Montreal is a very attractive hotel, and appears to either be new, or recently remodeled. It has a hip modern decor, and is centrally located near old Montreal, as well as the shopping district, restaurants, and Museums (if you don't mind a little walking). My only knock against the hotel is the high cost for internet use. With some of the area restaurants offering free WI-FI, you would think the hotel would either offer internet use for free, or at a lower cost than $15 per day (if my memory serves me), for your convenience. However I would guess if you are staying at the W, you're not looking for an experience similar to staying at a Days Inn, or a hotel similar to that. You get what you pay for, and the W Montreal is a great place to spend your nights (or days for some), while visiting Montreal!", "title": "Simply Amazing", "user": "Placitasman65", "date": "July 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134142447}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "One other thing to note is that the glass walled shower is located between the bedroom and the bathroom. While this wasn't a problem for me and my wife, I could imagine wanting to do without that feature if you are traveling with a bunch of friends. I doubt that's a standard feature in every room, but be warned if you enjoy privacy - LOL!", "title": "A great, if funky, well located hotel in Montreal", "user": "skywaker9", "date": "July 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134120458}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "This was our first stay at a W Hotel and all we can say is WOW! What an amazing property, and what an amazing staff they have. Everyone went out of their way to make sure our stay was perfect. We've never seen such a sleek and stylish room (or common areas for that matter). True, the lobby was rather dark, but that didn't bother us at all. The coffee service in the lobby in the morning was a nice touch - great, gourmet coffee. We certainly will keep the W Hotel chain in mind for future trips...we were not disappointed and it was everything we hoped for and more.", "title": "Exceeded Expectations", "helpfulness": 1, "user": "Mfgib197", "date": "July 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133900814}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Whenever you check into a W you know you are going to be staying in a place that is unlike a typical hotel. Such was the case here. From the moment you step into the well appointed, if darkly lit, living room to your room with the \"peephole\" near the bath tub, it is not your typical place. However, this property seems to have done a great job being funky while at the same time very very nice. The beds are comfortable, the bathroom is well equipped and the internet access is quite good.", "title": "Stayed here twice - both stays great", "user": "jgregb", "date": "July 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 133777583}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "I just came back from Montreal and a terrific time! The W is perfect. I drove-up from NY for Memorial day weekend. A man named Patrick greeted us at the entrance and basically took care of us the entire weekend. He parked our car, brought our bags to the room and showed me all the call features of the room. By the way, the room is very sexy! We had the mega room and the bathroom s basically the size of the bedroom. The shower is great and fits about 6 people comfortably. They have a bathtub and a cool sink area all behind a blue curtain. I loved it! Patrick told us about their Acura service, which is a car you can reserve to take anywhere in the city for free. On the main floor is Wunderbar, which is nice, but I didn't like the crowd on Saturday night. Definitely party at Globe instead. For relaxing drinks go to the mezzanine level bar, it's very cool & comfortable. Anyway, the hotel is very cool and the service was great. I'll definitely go back next time I'm in Montreal.", "title": "LOVED IT!", "user": "Nik31", "date": "May 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30933785}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "I was in Montreal last week for work and tried a night at the W.", "title": "Great Hotel with very helpful staff", "user": "John1966LosAngeles", "date": "May 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30417443}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "It was kind of what I thought it would be like but A bit better. They had helpful staff", "title": "Great Stay, Great Vibe!", "user": "Dace1307", "date": "May 19, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 30322999}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "and very friendly also.It reminded me a bit of the Standard in LA but with it’s own W flavor and a twist of Montreal class..Great lighting and really nice views. I have stayed at most of the up scale Montreal hotels, and this is up there with the best of them.", "title": "Funky and trendy but no value", "user": "mhchipmunk", "date": "May 18, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 30254109}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "I would recommend Highly", "title": "Trendiest, most happening hotel in Montreal", "user": "mark8811", "date": "May 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29616364}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "Loved this W (I have stayed at many many W's in USA). It was unique in that they kept the lighting low, and accented different areas with chic LED lighting on the walls. Main color is an electric blue throughout hotel, on front of hotel, in rooms the piping/curtains matches the same bright electric blue, and it continues even in the hallways. Very modern touch, and it gives a fashion forward feel to the place. Rooms were spacious, white leather benches, white bedding (platform bed), huge washroom space with separate shower, bath, and restroom. Well laid out with closet space and large desk area. WunderBar Club was packed at night and very good music. Gets busy around 11pm. Was expensive to drink there so be prepared for that. All in all great location and can't wait to stay there again.", "title": "Very chic and trendy W and location was superb", "user": "spgISLANDtraveler", "date": "December 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 89826623}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Thought the hotel was quite nice - great location, easy walk to Old Montreal and took reasonably taxis to other areas. Stayed here for two nights on a Friday and Saturday. Overall, the rooms were quite nice. The basic room was small but had enough space for us. Some may find the bathrooms/showers disconcerting but we didn't mind. The concierge was great in suggesting restaurants. The room only had a view into the atrium so it was impossible to tell the weather (or time of day) by \"looking outside.\" We had no problems with noise and it only took a second to walk past the club at night.", "title": "Great location, standard W experience", "helpfulness": 1, "user": "cpbost", "date": "December 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 89276670}, {"rating": 5.0, "title": "The W Montreal is a \"must stay\" when in Montreal.", "text": "Some suggestions:", "user": "A TripAdvisor user", "date": "December 6, 2010", "id": 89183026}, {"rating": 2.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "I am a Starwood platinum and was not offerred an upgrade. I asked if one was available and was summarily dismissed - at least appear like you checked or offer a genuine sounding excuse. The shower area is really large but only 1/3 or so gets contact from the water which means the area gets quite cold in there. The overnight menu (which started early - either 10 or 11pm) was really awful. We had just arrived from the airport and wanted a nice dinner but the hotel restaurant had stopped serving. We ended up having 2 mediocre grilled cheese sandwiches for over $50 (no drinks). There were no standard items like hamburgers, fries, sandwiches, etc. Pretty disappointing start to the weekend. The appetizers we had at the attached restaurant were also not particularly good - I'd probably avoid the food here alltogether. Would consider staying again if some of the service issues improved.", "title": "All Style, No Substance", "helpfulness": 2, "user": "dharmapunk77", "date": "December 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 88993214}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled solo", "text": "This hotel is located around the corner from the Convention Center and up the Street from Old Montreal with all its shopping and restaurants. It's a short walk to St. Catherine Street. The service, friendliness, decor, food and beverage and comfort of this hotel makes it a gem in a wonderful city.", "title": "Wow", "user": "AliceOlive", "date": "December 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88959596}], "location": {"country": "Canada", "city": "Montreal"}, "stars": 4, "variance": {"poor": 40, "average": 75, "very good": 213, "terrible": 25, "excellent": 498}, "aka": "w Montreal Hotel", "slim_ranking": 0.135294117647, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "In the city's historic Banque du Canada building transformed into a rich, modern tapestry, W Montreal is close to Old Montreal, the Montreal Museum of fine Arts and the city's downtown."}