{"user_rating": 4.5, "review_count": 1221, "name": "W Retreat & Spa Bali - Seminyak", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Just spent 3 nights at the W, was a very good long weekend, the rooms are excellently equipped with the usual sweet sleeper which are fantastic. The amenities they have are all you Need.. Nice coffee, tea and a great mini bar.", "title": "A 1st class hotel in Seminyak", "user": "Kris71", "date": "June 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165029709}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled solo", "text": "The rooms have Bose system but they are not compatible with iPhone 5 but this was no issue as I had my iPod.", "title": "Your escape to paradise", "user": "jaffa_fella", "date": "June 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164654958}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "The hotel sits right on the beach and has amazing sunsets at the bar, the bar is really funky with fab beds and sofas along with beanbags to relax on as well as having a great DJ who moves downstairs to the nightclub at weekends to carry on the great music and drinks", "title": "Beautiful resort", "user": "silverdragon80", "date": "June 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 164553319}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "The 2 restaurants that we ate in we're excellent, fire was fab and the exec chef was on hand to explain all dishes, quality of food was fab.", "title": "Perfect Luxury!", "user": "jakboy", "date": "June 17, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 164317219}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The location of the hotel is enough away from the madness of seminyak but close enough if you life........", "title": "Honeymoon luxury!", "helpfulness": 1, "user": "ctuck", "date": "June 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164199789}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "It's so different with other resorts in Bali. It's much more stylish than what you think! Staffs there are very friendly and always helpful. The food in FIRE at very good, esp the breakfast buffet which give you many choices other than only fried eggs!", "title": "Highly Recommanded", "user": "Eric F", "date": "June 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 164157473}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "I can't say enough, how much I loved this hotel. The hotel is just beautiful, the staff are very friendly, the rooms are great, pool is awesome, food is magnificent..... so what was the one thing... it was the view. We stayed in one of the Garden Rooms, unfortunately, we were right at the end of the line and looked at unfinished development, which was an eyesore, and stopped us sitting on our balcony. If only the view was beautiful and it would have been a perfect hotel.", "title": "Great hotel, just one thing spoilt it!", "helpfulness": 2, "user": "KylieF6", "date": "June 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164122144}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Still dreaming of the lovely breakfasts!!", "title": "Excellent Breakfast!", "user": "RudeyLee", "date": "June 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164112637}, {"rating": 5.0, "title": "Relax in style", "text": "My wife and I were in Bali for a holiday and decided to head to W Retreat's Fire restaurant. We heard so much about it, and they truly did not disappoint. It was close to 11 am when we reached, and understandably, they were packing up the restaurant to prepare for lunch. However, up stepped Mr. Richard Millar, who hosted us and made sure that we had the breakfast that we came for. We had some pancakes, which we have to admit, are the best that we ever had. We rounded off the meal with some bacon, fruits and juice. There is nothing better in this world than simplicity with style. We will definitely be back!", "helpfulness": 1, "user": "cam20801", "date": "June 13, 2013", "id": 163838557}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "I am writing this review from the day bed of the villa we have called home for the last seven few days.", "title": "Is it really worth it?", "user": "Emma F", "date": "June 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163823532}, {"rating": 3.0, "stay_parameters": "Stayed June 2013", "text": "I stay at Ws all the time and usually love it. This W takes the party element too far. It is too loud. Sometimes you just want to enjoy the serenity of the ocean. This place has so much potential, but I can't say I would stay here again. They should at least give their guests notice of the constant loud music that can be heard on the top floor room with all doors closed. It is impossible to have a relaxing evening anywhere on the premises. Sometimes one is not in the mood for a dance club atmosphere. For the price point I will definitely look for other options in Seminyak or stay in a different area of Bali all together.", "title": "W on steroids", "helpfulness": 2, "user": "Heidiinthesky", "date": "June 6, 2013", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 163160242}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "Beautiful setting. perfect place to unwind and chat with friends on the lounge. Brilliant view. Well mixed drinks. Friendly service, shout out to Adi and Panji. Try the expresso martini and score a seat on the lounge by the ocean.", "title": "Excellent venue", "helpfulness": 1, "user": "Adrian B", "date": "June 6, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 163155828}, {"rating": 4.0, "title": "Modern, chic luxury", "text": "We stayed at the W last year, it had an impressively luxurious, and trendy vibe, we felt everyone was working hard to pull out all the stops, all in all we had a great stay. Checking in was slower than I would have liked, specifically because on arrival at our room, instead of the sea/ ocean view requested what we got was a described as a \"partial sea view\" in fact it was a view overlooking a building site and treetops. This was a year ago, hopefully the unfinished building has been completed now, but either way any view will be severely restricted, so do check when booking. After, this faulty start, and requesting another room with an actual sea/ ocean view, we found that the rooms were fabulous, comfortable with a ultra modernistic feel and great facilities.", "user": "Vkit", "date": "June 6, 2013", "id": 163148032}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "The rest of our stay was great, fantastic facilities, lovely location, service was good, as was the food and drink if sometimes a little inconsistent. The pools areas were great, the sea was a little too rough to swim in during our stay but the pools and huge day beds were very popular. The W bars had a relaxed party vibe especially at the weekends , so great for groups and celebrations. There seemed to be quite a few younger children there when we vistied but it felt more suitable for adults wanting to relax and enjoy Bali, overall an enjoyable stay, great location.", "title": "Easter Holiday 2013", "user": "packflashpack", "date": "June 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163067915}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "This is a resort that wows! From the entrance to the grounds to the room. Everything was set to impress. Admittedly, it's not Balinese style but more of ultra modern.", "title": "Absolute luxury", "user": "lisa_keddie", "date": "June 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 163048277}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Our stay at W Hotel exceeded our expectations, from the first engagement to enquire about having a wedding dinner to actually experiencing it. I dealt with Ira and the team in events as well as the team in Reservations, and from first arriving to drop off a bag before arriving later in the afternoon the experience was faultless. The little details like a romantic dinner (it was our Wedding Dinner!) on our own to a momento of the dinner to having dessert delivered to our room was without fault. Our day couldn't have gone smoother with the level of personal service and knowledge of the staff on how to make our day easier. The photos on the beach in our wedding clothes will be posted soon. We cannot than you enough.", "title": "A Romantic End to a Big Day", "user": "Cammiv", "date": "June 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163626458}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Fire Restaurant is absolutely amazing! The chef is incredibly talented, creating the most amazing flavours! The service is fabulous and the ambience and interiors are stunning! If you are a \"foodie\", this is the restaurant to book while you are in Bali. You will not be disappointed! In fact, if you appreciate cutting-edge, modern fusion, quality food, and you weren't planning to visit Bali - come to Bali anyway, just so you can experience Fire!", "title": "Fire - my new favorite restaurant in the entire world!", "helpfulness": 1, "user": "DZA_A", "date": "June 10, 2013", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 163551781}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "Went for sunset drinks at around 4pm. The design of this hotel is exceptional. So many different bars and restaurants, and the view of the beach at this hour is unforgettable. Fabulous service and very cool tunes!", "title": "One of the most beautiful hotels I have ever visited", "user": "Grant R", "date": "June 9, 2013", "detail_rating": {"cleanliness": 5.0, "location": 5.0}, "id": 163513308}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We stayed at the W Retreat Bali for a week. We usually stay in a private villa or Oberoi Resort and have stayed at Semara also but had friends staying at W Retreat so booked our stay there also and found the entire stay very relaxing. We booked a garden room which was quiet, comfortable and a good location. We do found the shower in the room awkward as there is no where to put all the things a lady needs for hair and skin while in the shower yet they had a wooden bench that intrudes on the shower space. I hate rain showers at the best of times but the wall shower is too low and sprays out into the bathroom area W Retreat you need to do something about this design fault as it is really not the standard expected and everyone we spoke to at the W commented on the bathroom space as bad. We loved the service and pool area as well as the beach bar and quality of food served.", "title": "Wow", "user": "weTrave1", "date": "June 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 163416538}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Breakfast buffet, well its just strange! you expect a buffet spread like the other resorts in Bali but the fruit was non existent unless you love melons. no banana, papaya, mango and we were in Bali. The lay out is strange the bowls and serving sizes are strange but the good thing was we didn't over eat like you do normally in a buffet as it is too hard to find something nice to eat. Good coffee and tea is offered and we suggest let the staff get you what you want while you sit and enjoy the surroundings at breakfast.", "title": "LUXURY!", "helpfulness": 1, "user": "Jayhebz525", "date": "June 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163165842}], "location": {"country": "Indonesia", "continent": "Asia", "city": "Seminyak"}, "stars": 5, "variance": {"poor": 33, "average": 86, "very good": 238, "terrible": 22, "excellent": 842}, "aka": "w Retreat And Spa Bali - Seminyak", "slim_ranking": 0.157894736842, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Escape hectic philosophies, and why not plunge into vibrant glitz amidst natural splendors? We're a new found playground along the shores of Seminyak, where trendsetting chic restaurants, clubs, fashions and eclectic galleries await discovery."}