{"user_rating": 3.5, "review_count": 664, "name": "Waikiki Sand Villa Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "waikiki sand villa has an easy to navigate website and a responsive email help desk which was part of the reason i booked a room there. the price was attractive too.", "title": "it has a good website, and great pool: what more do you need in oahu?", "helpfulness": 3, "user": "homeperm", "date": "September 27, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 10011524, "likes": {"liked": "— the price"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "the hotel pool was the scene of many late afternoon naps, and not just by me. other guests had cottoned on to this excellent activity. the pool was cold, thank goodness. and was open until nine at night. the cocktail bar in the hotel also had a super cheap happy hour (but they wouldn't let you take glass pool side so you had to drink it out of plastic cups - only a minor downside).", "title": "Great Holiday at Sand Villa", "helpfulness": 1, "user": "MelJ", "date": "September 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8865068, "likes": {"liked": "— Cleanliness", "disliked": "— Maybe a bit small"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "the hotel room itself was small but very functional and seemed to have pretty effective air conditioning. we even got a nice view of the canal and golf course. given the concrete build up of waikiki this was an unexpected delight. the free internet in the hospitality room and the free (fairly minimal) breakfasts were a bonus too.", "title": "Great Value, Very Nice Hotel, Clean & Friendly", "helpfulness": 7, "user": "GrandPrixPete", "date": "September 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 8852587, "likes": {"liked": "— price, location, clean, friendly staff", "disliked": "— noisy room, complimentary breakfast"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2005, traveled as a couple", "text": "everything you need in waikiki is in walking distance, with an abc store all of about twenty paces away.", "title": "Not bad for the money", "helpfulness": 5, "user": "p_e_black", "date": "August 30, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 8553835}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled solo", "text": "We have just returned from 14 days in Honolulu, staying at the Sand Villas. We cannot fault this hotel, the rooms are clean, the staff friendly. The breakfast is enough to start the day, you can always add fruit/yoghurt if need be. We will stay again when we return for another holiday. Thank you Sand Villas for making our holiday an enjoyable one.", "title": "GREAT place to stay!", "helpfulness": 4, "user": "PSmama", "date": "August 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8519999, "likes": {"liked": "— It's clean and safe; staff is helpful and friendly", "disliked": "— The carpeting; the breakfast"}}, {"rating": 5.0, "title": "Great Value, Great Pool!", "text": "We are a couple with a 2yr old from Australia stopping over in Honolulu on our way to the US. This was one of the cheapest hotels I could find when booking & we were more than happy with our choice. Rooms were basic but clean, hotel was centrally located although away from the beach (easy walk down to beach). There was a small bar area with internet access. Were were given access to our room a couple of hours early. Hospitality room was fantastic, offering male& female bathroom with shower (exactly the same as offered in rooms); we used this to freshen up having checked out early for a late onward evening flight. Best part of the hotel is the POOL which was great for a budget property. It was of a good size, intimate and comfortable to use, not overcrowded. Our 2yr old loved it! No baby pool but was not a problem. We absolutely loved the pool and would return on this basis alone. We highly recommend this property for travellers on a budget; was GREAT VALUE & can't wait to go back.", "helpfulness": 3, "user": "KristineBeb", "date": "July 20, 2007", "id": 8207004}, {"rating": 5.0, "stay_parameters": "Stayed June 2007", "text": "We stayed at the Sand Villa for the last day of our trip. This is a no-nonsense hotel -- it is about 3 or 4 blocks from the beach (but very close to the Ala Wai Canal), so there is no ocean view; the rooms are not fancy, but generally clean and tidy. We paid $100 plus tax for one night, which is about half the price we paid for another hotel in Waikiki.", "title": "Affordable hotel with good amenities", "helpfulness": 3, "user": "sailor123", "date": "June 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 8002174}, {"rating": 4.0, "title": "Great experience", "text": "A continental breakfast is included, as is free internet access in the room (the much more expensive hotel charges $10 a day for internet access!). The staff is friendly and courteous. On top of all this, they have a hospitality center which has computers with internet access, massage chairs, and showers! It being our last day and we had a late flight, we used the hospitality center to take a shower, rest, pack and check flight info, etc. I greatly appreciate their providing this free service.", "helpfulness": 2, "user": "Kilikena", "date": "June 15, 2007", "id": 7852483}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "I think this is a great place to stay at -- everything is so expensive in Hawaii, if you can save some funds by staying at a relatively affordable hotel which is clean and safe like the Sand Villa, you can free up some funds to do a lot more other things. I would give a 4-star for the hotel itself, but because of the hospitality center, I am giving it a 5-star!", "title": "Great Amenities, Would Return", "helpfulness": 3, "user": "BendennyW", "date": "May 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 3.0, "cleanliness": 2.0, "value": 4.0, "location": 5.0, "rooms": 2.0}, "id": 7645766, "likes": {"liked": "— The pool and location", "disliked": "— The worn out carpet"}}, {"rating": 4.0, "title": "Good Value", "text": "My partner and I stayed at Waikiki Sand Villa for four days after a cruise. We were happily surprised; the room was large, we had a good size 'fridge and coffeemaker. The bathroom was huge, with a hair dryer and tropical shampoos and soaps. The beds were fantastic! The mattress must have been new, because they were so comfortable.", "helpfulness": 1, "user": "cobra9", "date": "May 15, 2007", "id": 7627495}, {"rating": 4.0, "stay_parameters": "Stayed July 2007", "text": "Despite the previous 2 reviews, I thought this hotel was perfect, from the location to the amneties to the price. I would recomment staying in the main part of the hotel, and not the part with kitchenettes", "title": "This place was perfect", "helpfulness": 1, "user": "redridgie", "date": "August 24, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 8496467}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Absolutely awful. We had ants in the kitchen area, in the drawers and in the cupboards, it was a very musty smelling room as well. The continental breakfast consisted of dry toast, canned pineapple, diluted juice and protein bars. Not exactly a continental breakfast that should be advertised if you ask me. Room service did not come until, some days, after 5:00 in the evening. This became somewhat of a problem when we would come back to the room to make dinner, and the maid still hadn't been there. But what threw this hotel over the edge were the rats. Food was missing from the room the entire week and finally one night, while watching tv, we saw why. There were two large holes in the wall behind the tv cabinet and the rats came out while we were still awake to look for more food. The hotel was much less than accomodating when we asked for some type of compensation, as any person would. They said we had no proof and all they were willing to do was give us half of one nights stay for free. My advice, Stay ANYWHERE else.", "title": "The Rats come FREE!", "helpfulness": 1, "user": "BJDD", "date": "August 21, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 8462365, "likes": {"liked": "— There is nothing good to say about the accommodation", "disliked": "— The rats"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "This place was cheap, but it still wasn't worth it. We requested early check-in since we were coming from Japan and we were going to arrive in the early morning. We arrive and the front desk said our room wasn't ready even though we requested early check-in. The front desk said \"a request is just a request, it doesn't mean you'll get it\". She also said no other room was available for us. Then she said told us it cost extra for early check-in, so I asked her if we paid for that, would a room be availible. She checked the computer and amazingly enough, there was a room availible. Imagine that. It's not a problem about paying more, it just the fact that first we weren't told about the extra cost when we booked and then the front desk told us a room wasn't availble when there was at an extra cost. We had to wait 30 min for a room, so we went to the breakfast. Which was very dissapointing. It consisted of bagel chunks, small powdered donuts and fruit juice. There was also a tip jar for the person working the toaster, as if you didn't tip, he wouldn't get paid for the task of toasting bread.", "title": "Disappointed to say the least", "helpfulness": 5, "user": "slickjoel", "date": "July 31, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 3.0}, "id": 8266050, "likes": {"liked": "— Location was pretty decent.", "disliked": "— Pretty much everything else."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled solo", "text": "The room was pretty run down and the bathroom had mildew and a terrible paint job. The location was pretty decent. We should have paid more to stay at a nicer place.", "title": "Truly Home Away from Home", "helpfulness": 2, "user": "GigiBee", "date": "July 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8223362, "likes": {"liked": "— The friendliness of the staff and the price", "disliked": "— HiSpeed in the rooms - would love to have had Wireless. That's all!"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled solo", "text": "I stayed in 6 different locations in Waikiki in the spring.", "title": "The Pool Area Was The Highlight", "helpfulness": 2, "user": "Alohaal", "date": "January 1, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 12214708}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "The standard room was dated and somewhat small with old carpet by comparison to the other 5.", "title": "Excellent for the price!", "helpfulness": 2, "user": "StarGazer777", "date": "December 10, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 11462090, "likes": {"liked": "— price and cleanliness"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "I rate the hotel above average because of the pool.", "title": "Great Hotel, Good Service", "helpfulness": 5, "user": "JQuest81", "date": "November 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 11063877, "likes": {"liked": "— Service"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The highlight was definately the pool area.", "title": "Rodent Rest Stop", "helpfulness": 1, "user": "Aviator100", "date": "November 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 11033288, "likes": {"liked": "— Friendly employees", "disliked": "— cleanliness, ants, rodent"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We have just got back from staying at this hotel and I have to say I was pleasantly surprised with it. The location is great, yes it is not right on the beach but it takes about 5 minutes to walk to it. It is also 1 minute from a supermarket (Food Pantry) and short walks to lots of restaurants and bars. The hotel itself is a little dated and could do with some modern decor in the rooms, but it is clean and has plenty of amenities (a bar, pool, jacuzzi, a sushi bar etc). The rooms themselves were an adequate size with a queen bed and a single (maybe upgrading the beds to doubles would be better though), with a balcony - we were very high up and had great views over the golf course and up to the mountains. The staff were very nice and always helpful.", "title": "Great hotel in central Waikiki", "helpfulness": 2, "user": "travelkw", "date": "January 4, 2008", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 4.0}, "id": 12314399, "likes": {"liked": "— location", "disliked": "— dated"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled solo", "text": "Hello all, I stayed at Waikiki Sand Villa in June 2005 and June 2006. The first time I stayed here in June 2005, I was pushed out of the Waikiki Gateway due to overbooking. So they gave me a corner view and a beautiful room at the Sand Villa. No regrets here because the room was clean. I loved the 24 hour access to the internet room.", "title": "It's a great hotel!!!", "helpfulness": 1, "user": "Northernangel", "date": "August 26, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 8508083, "likes": {"liked": "— Location, cleanliness, reasonable priced, free internet and breakfast", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We had two balconies, with great views of the mountains, the Ali Wai Canal, where we watched outrigger canoe teams practice. The location was excellent; we were close to ABC store, Smorgy's, Keo's, and Food Pantry.", "title": "More Than Happy", "helpfulness": 2, "user": "Lord-Venn", "date": "May 13, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 7597707, "likes": {"liked": "— The Bar!!!!!", "disliked": "— Road Noise"}}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 55, "average": 156, "very good": 322, "terrible": 37, "excellent": 94}, "aka": "Waikiki Sand Hotel", "slim_ranking": 0.734939759036}