{"user_rating": 4.0, "review_count": 819, "name": "Waikiki Parc Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2007", "text": "This hotel is pitched to the cost-conscious, independent traveller who prefers a boutique style of hotel.", "title": "The truth about the Waikiki Parc hotel ...", "helpfulness": 10, "user": "SydneyFrequentFlyer", "date": "November 18, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 10885023, "likes": {"liked": "— Location, friendly staff", "disliked": "— Limited room service menu, noise from back-up alarms"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The Waikiki Parc is a safe, clean hotel. The staff are extremely friendly and they go out of their way to make you feel at home. But the real beauty of this hotel is its location - it's a stones throw away from the new restaurant precinct, the beach and shopping strip.", "title": "Very nice place to stay", "helpfulness": 2, "user": "CAsqueaky", "date": "November 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 10836833}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "I have stayed at several of the five star hotels in Waikiki including the Royal Hawaiian and the Moana Surfrider and I believe this hotel is on par with them.", "title": "Friendly, boutique hotel", "helpfulness": 4, "user": "axj73", "date": "November 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10791377, "likes": {"liked": "— The reception area & location"}}, {"rating": 4.0, "title": "Real nice", "text": "The beds are comfortable, there is lots of natural light and the small lanais means you can enjoy some truly magical sunsets.", "helpfulness": 1, "user": "Iluvslaw", "date": "October 22, 2007", "id": 10219131}, {"rating": 5.0, "title": "9 nights of perfection", "text": "But be warned that this hotel doesn't offer the same trimmings as some of its five-star counterparts; for instance, there are only about three items available through room-service and there is no mini-bar, as such. Whilst the Waikiki Parc's services are limited, the good news is that it relies on the Halekulani for things like room service, dry-cleaning so the standard is very good. The rooms do have a bar fridge which means you can stock your fridge with anything you desire (the ABC store is just round the corner).", "helpfulness": 17, "user": "superstardj", "date": "September 30, 2007", "id": 10019746}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We just returned from a one week stay at the Waikiki Parc Hotel. It was great to be one block from the beach and have parking! We were on the city side of the hotel and had no issues, but if traffic sounds (morning trash trucks, sirens) can be a bother, a pair of ear plugs will work nicely. The food was tasty at the Nobu restaurant and we were within walking distance of many shops, restaurants, bus stops, you name it. The help was fantastic, we were always quickly assisted by the concierge and/or front desk.", "title": "Great location, wonderful help", "user": "travelzDenver", "date": "July 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115094463}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "We needed and extra bed and they did not bring a cot or roll away, but an actual twin bed (frame, boxspring, mattress) and just took out the desk and chair to make room. We would definitely go back.", "title": "Great location, great staff!", "user": "MartyV95", "date": "July 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114988613}, {"rating": 4.0, "stay_parameters": "Stayed June 2011", "text": "The pool is just a simple rectangle, but there are 3 great oversized chair/loungers that seat 2 people.", "title": "Good value and location", "user": "cedricdaniels", "date": "June 30, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 114908436}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Free high speed internet in the lobby as well as concierge area and there is self parking. We did not use it as the valet parking was included in our package.", "title": "great staff, good value w/ ocean view, awesome location", "user": "barney4852", "date": "June 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 2.0, "value": 4.0, "service": 5.0}, "id": 114776821}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled solo", "text": "Stayed here to celebrate a graduation and a wedding anniversary. Staff was awesome, greeting us every day, offering suggestions for dinner and even surprising us with a card and chocolates on our anniversary date. They upgraded us unexpectantly when we checked in as we were there to celebrate several events. The beach is just a short walk from the hotel and many restaurants, shopping areas close to the hotel. Great location and great staff! Would absolutely stay here again.", "title": "Modern hotel on the busy part of Waikiki", "helpfulness": 3, "user": "LuckyLotus", "date": "June 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 113246344}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We have just returned from a sensational 9 night stay at Waikiki Parc Hotel.", "title": "Can't wait to return to Waikiki Parc - we'd never stay anywhere else in Hawaii", "helpfulness": 4, "user": "TerriandTim", "date": "December 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12108757, "likes": {"liked": "— It's modern and in a fabulous location", "disliked": "— Nothing to report!"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "The Waikiki Parc is located right across from the beach and the famous Hotel Halekulani and Sheraton/ Royal Hawaiian.", "title": "Not my cup of tea", "helpfulness": 1, "user": "jeruk85", "date": "December 26, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 11974916, "likes": {"liked": "— location, if you like to party after hours", "disliked": "— small bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "It's close to everything you need - shops restaurants, transport, beach.", "title": "Great bang for your buck", "helpfulness": 1, "user": "Chris P", "date": "December 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 11693997, "likes": {"liked": "— location, friendly staff", "disliked": "— the bed"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We're fussy, but found The Parc to be very modern, chic (which usually isn't the case in Hawaii)", "title": "Great staff, city location problems", "helpfulness": 3, "user": "Pollycrac", "date": "November 25, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 11034620, "likes": {"liked": "— The courteous staff", "disliked": "— The bad odors and the cockroach"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled solo", "text": "Importantly the staff were so friendly and a lot of fun. The fed us up with plenty of egg-nog and christmas cookies (we were there over christmas)", "title": "A Great Hotel", "helpfulness": 1, "user": "Cristan", "date": "November 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10932416}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We booked this hotel while in Waikiki for a wedding, and to be honest, I wouldn't stay here again. It's not that there was anything horrible about the hotel - it just didn't have any of the extra touches that I would expect from a hotel at this price point. The rooms are small, and cheaply done. We were on the 14th floor with a \"prime\" ocean view - and it was CRAZY loud at night. We heard delivery trucks backing up (beeping) all night, sirens, horns, loud people - we felt like we were staying in a Manhattan hotel.", "title": "Everything is Average at Waikiki Parc", "user": "CACouple111", "date": "June 5, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 2.0, "value": 2.0}, "id": 111519175}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Although we had an ocean view - we also stared right into other people\"s balconies, so there wasn't much privacy (I kid you not, you can see EVERYTHING).", "title": "Great hotel. Would love to stay here again.", "user": "roy1204", "date": "June 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111193722}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Also - the hotel provides towels to use on the beach, but they are tiny. You would need 3 or 4 of them to spread out and lay on comfortably.", "title": "First time on Oahu", "helpfulness": 2, "user": "marcabatchelor", "date": "May 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109007054}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "We got free valet with our expedia.com deal - which was great, because parking in Waikiki can be pricey.", "title": "GREAT Value - But Not Much Else", "helpfulness": 4, "user": "HermanSnerd", "date": "May 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 108977549}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "Stayed here with my wife & 10 year old daughter in July. This was our first time staying at a civilian hotel in Hawaii (we usually stay with family or in the military Hale Koa Hotel in Waikiki). We booked flight & hotel through American Airlines Vacations and got the hotel practically free for the 10 days we stayed here. Arrived on a Friday about an hour before check-in. At that time they did not have our room ready (no problem), but ~ 30 minutes later when my wife checked on the room, we got upgraded to an ocean view room; maybe because my wife is half Japanese (I'm Filipino/Hawaiian) & this hotel caters to the Japanese?? Room was clean and modern looking (as was the whole hotel). Not the hotel you want if your looking for a \"Hawaiian\" themed room. Breakfast was great the first few days; just cant eat the same stuff for 10 days. Rice, eggs, pastries, yogurt, cereals, miso soup, meat changed (Portuguese sausage, regular sausage, bacon) daily. It was great that breakfast was included with our stay. Parking was easy & (again) included. A short walk to a little beach area was OK; we don't really stay in Waikiki beaches due to the crowds, but this was OK on the couple days we didn't feel like driving. Courteous staff & cleaning crews. Pool area was clean & empty (we just checked it out, didn't swim). Location was great, easy walks to any of the touristy stuff in Waikiki. We would definitely stay here again.", "title": "Great location, and great accommodation at affordable price", "helpfulness": 3, "user": "Jonnie27", "date": "May 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 108563759}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "I loved this hotel. My boyfriend and I spent a week in this hotel and it was worth the price. We had great access to shopping, dinning, and the beach was a five minute walk. I had booked excursions by phone and had the confirmation faxes sent to the hotel. Every time a fax came they would call my room right away. The staff were very helpful, and willing to help without hesitation. I recommend a restaurant called A House with out a Key in the Halukani Hotel, just steps away. It was a great trip and the hotel sealed the deal for us. I can't wait to go back", "title": "Can't wait to go back!!!", "helpfulness": 2, "user": "Carmensooki", "date": "February 9, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 13411740, "likes": {"liked": "— The View, we were on top floor and had great views of the city", "disliked": "— Construction"}}, {"rating": 1.0, "title": "Hated it so much we checked out early!", "text": "I travel extensively, and this is the first time I disliked a hotel so much that we decided after our 3rd night to check out early and into a different property. I really wanted to like the Waikiki Parc. I was very excited about staying at a small boutique hotel instead of a massive chain.", "helpfulness": 7, "user": "Courtesy_Flush", "date": "February 9, 2008", "id": 13410560}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The visit started out well. We were impressed with the chic decorations throughout. A wrapped box of chocolates and a card was waiting for us which was a nice touch.", "title": "The Best Honeymoon!!!!", "helpfulness": 2, "user": "junebug23", "date": "February 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 13212643, "likes": {"liked": "— The rooms were simple, modern, comfortable, and clean", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We got a corner room on the top floor which looked out over the mountains. We got two beds instead of a king, but we decided not move because the room would be even smaller than the cramped one we had. This hotel caters to Japanese tourist much more than Americans so I'm sure the size is great for them. Strangley, the beds did not have fitted sheets, just two flat sheets. Each morning, we woke up to bare mattresses after tossing and turning each night. We were often woken up by the street noise, and we were on the TOP FLOOR. We noticed that the high velocity elevator made me nauseous and my husband light headed everytime we got on and off.", "title": "would like to return", "helpfulness": 2, "user": "cpdh", "date": "February 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 13186830, "likes": {"liked": "— the view from the room, convenience of location", "disliked": "— location"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The valet switched our keytags with someone else, and we had to run back and forth to get the rental agreement to prove the car was ours. This made me late for my meeting. The valet was very slow other times. The concierge was absolutely useless. He speaks poor English, and unfortunately, we don't speak Japanese.", "title": "Ultra \"chic\"", "helpfulness": 2, "user": "Carmensooki", "date": "January 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 13112930, "likes": {"liked": "— The View, we were on top floor and had great views of the city", "disliked": "— Construction"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2011", "text": "Stayed at Parc in May for a week for a much earned R&R. Needed somewhere central but close to beach and definitely close to shops and restaurants etc. Location was good which was lucky because certainly needed the restaurants as room service is practically non existent - extremely limited menu (this was something i was looking forward to as i was having a mini break on my own and wanted to be able to chill out in my room!) Small rooms but good views (given it's Waikiki you're going to be looking at other hotels but at least my room on 11th (or was it 18th...) floor -prime ocean views-actually had views). Tiny balcony. Smaller bathroom than my one bed unit at home! Friendly staff. Consistent problems with my room key de-magnetizing despite me keeping it at arms length from anything electronic at all times (incredibly annoying having to represent key at least 10 times during the week stay). Tiny pool area but good furniture around the pool and sort of ok views. Boring breakfast buffet. Dreadful wifi - non existent in rooms and you have to go to lobby which in 2011 in the US is unforgivable . All in all though I enjoyed my stay but probably can't credit the Parc for that. Wouldn't feel right recommending it to friends and won't stay again - but can't wait to go back to Waikiki!", "title": "Underwhelming....but pleasant.", "user": "Puddingkate", "date": "July 25, 2011", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 115753001}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Of the four hotels we stayed at during our honeymoon (3 in Hawaii), the Waikiki Parc was our least favourite. Knowing that the level of room we'd be likely to get in Honolulu as compared to Maui would be more costly, we decided to spend a little more on an Ocean View. Because it was our honeymoon, we were upgraded to an Ocean View Prime. This turned out to be a blessing because we were still able to hear the garbage collection and other traffic quite clearly even from the 19th floor. This, however, is not the fault of the hotel--I get the feeling that many hotels in Waikiki must suffer from the same sound pollution in the very early and late hours.", "title": "Great location but unlikely to recommend this hotel to anyone", "user": "heaven11Toronto", "date": "July 23, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 2.0, "service": 2.0}, "id": 115685001}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "The room itself appeared to be clean but was dominated by a rather antiseptic smell. The only remedy was leaving the balcony door open to keep it aired out. Despite that requested no maid service for 2 of the 3 days we were there, the smell remained. The bed was comfortable and well-outfitted.", "title": "Great Location, Beautiful View, Clean Rooms", "user": "1144TravelMaad", "date": "July 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 115648667}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "Two problems I had while staying there that irked me the most (if the room smell didn't do it) were the following:", "title": "Good value", "user": "Gail M", "date": "July 16, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 5.0, "service": 3.0}, "id": 115423720}, {"rating": 3.0, "stay_parameters": "Stayed July 2011", "text": "1. I was told the hotel had free wifi but ONLY if you bring your computer down to the business centre. As we were staying on the 19th floor this seemed crazy to me. Why would I bring my laptop all the way down to the business centre to use the wifi? What's the point in saying you have wifi? Sounds like a few upgrades are in order to allow guests to use their own computers in-room as part of the room fee.", "title": "Excellent location", "user": "travelgalTN", "date": "July 16, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 115414101}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Overall this was a great hotel. Close to EVERYTHING. Reception desk service was great and the valet staff couldn't bend over further for us. Great tip to remember that you can borrow the beach items i.e. boogie boards, mats etc for free.", "title": "Great hotel, but noisy", "helpfulness": 2, "user": "NairobiGirlOH", "date": "January 21, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 12861280, "likes": {"liked": "— Location", "disliked": "— Noise-Service Trucks"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "The only draw back was the noise from the service trucks below. We stayed on the mountain view side and the other reviews mentioned this drawback but I thought it wouldn't be so bad. Even on the 22nd floor, we were so thankful for the weekend when the trucks did not operate.", "title": "a cool vibe to this place", "helpfulness": 2, "user": "eternaljungle", "date": "January 21, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 12860272, "likes": {"liked": "— look to it", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008", "text": "Great value, great location, great service but be warned with the noise level...maybe the ocean side is the only way to escape this.", "title": "Great little gem", "helpfulness": 2, "user": "earthtomark", "date": "January 21, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 12856114}, {"rating": 4.0, "stay_parameters": "Stayed October 2004, traveled as a couple", "text": "From the airport to the hotel and then back it average at 34.00 for taxi each way. My experience started just as my taxi pulled up to the door. You are welcomed with a aloha and ask you for your last name and they thank you for staying with them and reassure you that your luggage will be up in less than 5 minutes after you check in. When i initually made the reservation it was for two adults but at the last minute a friend joined us. There was an extra charge of 63 dollars per night plus taxes. Checking in was quick and they have at least three different people checking people in. The elevators give you like a 1/2 G force going up we where at the 21 floor in a few secs. Higher you are up the less noise you hear down below. busy busy city... There is complimentary water,coffee,cocoa, and tea in the room. A fridge to stock up with stuff from the ABC stores around the corners..They are across from each other and every where around you. The bell desk has complimentary water,towels,floaties, and other stuff.. Always saw at least three taxis waiting for guests at the hotel. The rooms are small but had everything i needed soap, some very nice shampoo,iron,dryer,tv, A/C... On Tuesday's and Friday's they have something caled the Mixer where they have free drinks for the guests so they can mingle with each other..nice touch cool vibe hotel great mellow lighting. Our age group two 27 and one 25 we loved it wouldnt change much. Saw a few mid-lifers looking for a great time and they found it here just a great atmosphere with a upscale touch to it. This is not a kid type hotel no toys and elvis music. Just great adult fun adult toys Lotus cars for rent..", "title": "Great", "helpfulness": 1, "user": "MSclarkNc", "date": "January 21, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12847939, "likes": {"liked": "— Location", "disliked": "— none"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "I got a great rate at the Waikiki Parc for a mid-jan stay. I stayed in room 2001, and WOW! wahta view. Being from NYC i like to stay in hotels that get tons of light, and a balcony when I travel, and this had both. Even without my discount (which was large through a friend) the rates are great, you have the full run of the large very elegant Halekuni across the street, and great views of waikiki beach on the upper floors.", "title": "Absolutely Wonderful!!!!!", "helpfulness": 2, "user": "rinse_and_spit", "date": "January 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12513374, "likes": {"liked": "— Room Decor, Amazing Staff, Amazing Views", "disliked": "— i'll let you know when i think of it."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We stayed here one night pre-cruise on September 3rd. The hotel is undergoing major renovations. As a result, check in was in a make-shift room while the front desk and lobby areas are being worked on. The check-in process was smooth, staff friendly and our room was ready. We had a renovated room, ocean view which was very nice, sleek and clean. Bedding was very comfy. Location is great, two blocks from everything (shopping, restaurants) but there is major construction in the area affecting not only this hotel but others close by. Not a big deal.", "title": "Will be nice when it is done", "user": "Breezey", "date": "September 18, 2006", "detail_rating": {"cleanliness": 3.0, "front_desk": 5.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 5812222, "likes": {"liked": "— Location", "disliked": "— Under renovation, no amenities"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "The hotel is not on the beach so the ocean view is past other hotels on the ocean. Still beautiful.", "title": "Great Hotel for the Price", "user": "MarMarie", "date": "September 4, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5768028}, {"rating": 2.0, "title": "never again. Nice room, horrible customer service.", "text": "The best part of our stay was watching the sunset while drinking an incredible Mai Tai at their sister hotel - the Halekulani, right across the street. A must do!", "user": "A TripAdvisor user", "date": "July 15, 2006", "id": 5469027}, {"rating": 2.0, "title": "Last time I will stay here", "text": "The hotel, once completed will be a lovely boutique hotel but currently amenities are lacking and quite frankly if I was staying in the area for longer than one night, I would definitely want to be on the beach. With renovations in the works and no restaurant right now (Nobu is coming!), would have been a nice touch to have been offered free breakfast at their sister hotel considering the renovations that are taking place.", "user": "heartrunner", "date": "July 10, 2006", "id": 5446865}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "We stayed at the hotel from August 21-26. The hotel was greater than we expected. The room we stayed in was remodeled with new bathroom and bedroom furnishings. It had a modern Japanese feel to it. The tiles and grout, however, could use some remodeling!", "title": "A very nice hotel", "user": "DadRob", "date": "June 28, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5397648}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The Waikiki Parc Hotel is a nice place to stay. The lobby was excellent, the staff was friendly, and the location is great (easy walking to shops/restaurants/beach). Two bottles of complementary water was also nice. However, I would have expected better since it was rated as a 4-star hotel. I stayed at other 4-star hotels and they are MUCH better than this. I would consider Waikiki Parc to be a 3-star hotel. A few reasons why I say this:", "title": "Nice place, but not as good as advertised.", "helpfulness": 2, "user": "HTEP", "date": "September 13, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 8705594, "likes": {"liked": "— Location", "disliked": "— Limited parking spaces"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "1) The room is a decent size, but smaller than what I expected. There was room for a queen bed, desk, TV, dresser, and fridge (and of course some walking room). I was expecting a small sitting area as well (based on other descriptions).", "title": "Parc was Clean and Safe", "helpfulness": 2, "user": "lawfamily", "date": "September 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8680949, "likes": {"liked": "— Clean and Safe", "disliked": "— small pool area"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The furnishings in the room and bathroom was excellent -- very modern furniture (they even had LED lamps at the end tables). However, if you look past the furnishings, the room looked somewhat old with a bit of quick renovations.", "title": "Great View for the price..but not a big hotel...very small.", "helpfulness": 3, "user": "theneed2shakeit", "date": "September 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8669494}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled solo", "text": "2) I decided to pay for self-parking instead of the valet service. Cost is the same $20/day, but I saved a few bucks from tips for the driver... Be aware of this though -- there are limited parking spaces for self-parking and the lot is used for public parking as well. What this means is that during busy periods, the lot may be filled with public parking and you may drive back to the hotel and there will be no spots for your car. I suspect this is happens mostly on weekends. For $20/day, I would expect some guarantee for available parking spots.", "title": "Nice Place", "helpfulness": 2, "user": "b11811", "date": "August 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 8380769, "likes": {"liked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "3) If you want to use the business center for internet access, you'll need to pay $3 for 15 minutes. Internet access is not complementary. (You'll also need to pay for internet access in your room.) This applies even for printing boarding passes -- however, if you ask the front desk nicely, they may provide the access code for free. The business center has both a PC and Mac so it is handy for both types of people!", "title": "Great Location", "helpfulness": 4, "user": "awright517", "date": "August 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8374326, "likes": {"liked": "— Location", "disliked": "— Small Rooms and breakfast choices very limited."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007", "text": "Convenient location, renovated property, good service. This place is great! Got a great deal off the hotel website at $164 a night, including parking. The room was stylish enough and the staff did a lot to make everything easy for us. Valet parking was free, the concierge was helpful with recommendations and helped us make a reservation at Roy's for dinner. (yum!) I also like that the hotel is affiliated with the fancy Halekulani across the street. So if you want a spa treatment or drinks by the beach, you can just charge it to your room. The pool on the 8th floor is not so great so if you're looking for a great pool scene or fruity drinks by the pool, you're not going to get it. But the beach is just a 5 min walk away.", "title": "A great deal!", "user": "esheng", "date": "April 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 7302980}, {"rating": 2.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Do not be deceived by the fancy lobby and reception downstairs, as rooms are not quite upto scratch!", "title": "Not up to scratch!!", "user": "Ozsurf", "date": "February 26, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "location": 2.0, "rooms": 2.0}, "id": 6842867, "likes": {"liked": "— location to beach", "disliked": "— view, room size and breakfast"}}, {"rating": 5.0, "title": "Great place to stay without the Waikiki Noise", "text": "After staying at two hotels before this one (Hilton in Kauai and Pacific Beach-waikiki) this was the worst out of the three!", "user": "BelvedereVirginia", "date": "February 13, 2007", "id": 6784983}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "This was the first lanai that we could not sit out on.. its made just for 'squeezing/standing room'. Not sure if the ocean view rooms are different.. but the mountain view was not so much a mountain view, as that of the car park opposite!", "title": "We loved it!", "user": "Yoyoggi", "date": "January 27, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6704135, "likes": {"liked": "— comfort of room", "disliked": "— lack of restaurants"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "The 'delicious' buffet that you are given discount vouchers for is TERRIBLE!! Plastic cutlery and basic buffet breakfast made up of tinned fruit and bacon, eggs etc;. For the $14 each that it costs.. you'd be much better heading out to one of the many places along waikiki.. or better yet check out the buffet breakfast for same price at the Pac Beach hotel with oceanarium and FANTASTIC range of food!", "title": "Great Hotel!!!", "user": "tylinmt", "date": "January 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 6694735}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "My family and I stayed at the Waikiki Parc for three nights in the beginning of January before heading off to Maui. We then returned to the hotel for one more night before heading back home. Overall the hotel is nice and a good deal. It was recently renovated and the hotel property did a very good job. It has a boutique feel - not as good as the W but the prices aren't like the W either...", "title": "Good choice for Waikiki", "user": "JetSetter16", "date": "January 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 6596344, "likes": {"liked": "— Great location"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "The location is great, it's only steps from the beach and from some great shopping. The rooms are nice with some cute modern finishes. We paid an extra $30 for an upgrade to an ocean view room and the view was fabulous! I would highly recommend an upgrade for that price.", "title": "Average Hotel in a really good location.", "user": "doonie&burke", "date": "January 2, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 6543271, "likes": {"liked": "— LOCATION", "disliked": "— ROOMS, LOBBY, NO FOOD OR RESTAURANTS"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "The staff was also very nice. The hotel has a laundry facility (which is a great perk), where guests can do their own laundry. Unfortunately the dryers broke after I put my clothing in the washer. With a little persuading the manager on site agreed to have my laundry sent out for free, which I thought was very nice. We also received a box of chocolates upon returning to the hotel for the last leg of our trip (a nice touch).", "title": "A pleasant surprise", "user": "johnstephens75", "date": "December 20, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 2.0}, "id": 6476166}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "I would not recommend having breakfast at the hotel. There are a lot of breakfast options in Waikiki and unfortunately Waikiki Parc doesn't really stand up. For a good breakfast right on the beach check out Duke's (less than a 5 minute walk from the hotel). If you're in the mood to splurge the Royal Hawaiian (pink hotel) has a great breakfast but it is pricey.", "title": "Great Stay!", "user": "rox130", "date": "December 13, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 6437554, "likes": {"liked": "— It was clean and modern.", "disliked": "— It was significantly smaller than some of the more expensive elaborate hotels but still close to those hotels."}}, {"rating": 3.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "If you're looking for a reasonably priced nice hotel steps away from the beach, I would recommend staying at the Waikiki Parc.", "title": "Chic, loved the renovations", "user": "lucy8181", "date": "December 6, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 6339643, "likes": {"liked": "— price", "disliked": "— no place to eat on the property"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Me and my husband stayed here on holiday for about a week. We found it to be an excellent, relaxing and professional hotel. We had buffet breakfast each morning and it was lovely and fresh. The hotel is in a great location, close to everything that you might need.", "title": "Fantastic!", "user": "Bobbi26", "date": "August 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116375819}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We stayed at Waikiki Parc for three nights before heading to Kauai and Maui in November 2009. We booked the hotel through Priceline.com, which was the best value along Waikiki beach.", "title": "Good Value Hotel", "helpfulness": 1, "user": "Catitude", "date": "August 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 116360328}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The hotel was very clean with modern decor. Upon arrival, staff were courteous and advised that our parking was included in our room price. We did not spend much time in our room, but it's location served us well. There is lots of activity within walking distance including shops, restaurants and the beach. The restaurant offers a nice breakfast, but it is costly. Alternatively, there is a Denny's within a 2 minute walk. The Marriott's courtyard is open to the main Waikiki strip and had live musical performances at sunset. For Cheesecake Factory fans, there is a location within a short walk also...", "title": "Loved the Parc, loved the location even more!!", "user": "akvalleygirl", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116261374}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "Pearl Harbour is a short drive away. We also spent one day driving around the island including the North Shore.", "title": "Not worth the 'great location' ...", "helpfulness": 4, "user": "mootleycrue", "date": "July 31, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 2.0, "value": 2.0, "service": 2.0}, "id": 116090279}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "This is a good value hotel. Those looking for resort-type accommodations will be disappointed. For those looking for more typical resort accommodations in this area, we recommend the Marriott or Halekulani.", "title": "Great location, clean, and friendly staff", "user": "Bmiz", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 4.0, "service": 5.0}, "id": 115950096}, {"rating": 5.0, "stay_parameters": "Stayed November 2006", "text": "We were very pleased with our 4 nite stay at the Parc in November. Except for the fact that the fancy Japanese restaurant on the ground floor won't open for a few months, the hotel renovations seem to be pretty well complete. We got the upper floor ocean front room, with rental car & free parking, for less than just a room at any comparable location. Our little 22nd floor lanai (balcony to most of us) offered a beautiful spot to watch the surfers on Waikiki, and enjoy a glass of wine and watch the sunsets...etc.", "title": "Waikiki Parc: a fine destination", "user": "Boston_Cookie", "date": "November 21, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6160205}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled solo", "text": "Altho not large, the room was fully adequate, the ac worked very well and very quietly (noisy ac in hotels being one of my pet peeves), beds were very comfortable. The refrigerator in the room was very handy. There's an ABC store right around the corner (which in Honolulu means beer, wine & liquor, plus convenience grocery store, plus assorted other items). I visited said store and came back with wine and chips and salsa and we were set for the duration.", "title": "Very Chic", "user": "Hankmeister", "date": "November 16, 2006", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6138750, "likes": {"liked": "— Location and interior design", "disliked": "— The comforters had slight coffee/tea stains and check-in can get somewhat disorganized"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "The room was newly decorated, and very nicely done; beds comfortable, etc. The breakfast on the 8th floor was very pleasant, and the staff there were great. In fact while we were there the $14.25 breakfast, which we thought was a very nice continental breakfast, was upgraded to a full breakfast including eggs, bacon & sausage, waffles, etc. In most of the civilized world, a hotel breakfast like that can easily cost $25 or $30 or more. If you don't want to spend the money on the breakfast, bring back some juice and danish from the ABC store, and make coffee in the room. Or if you're not fussy, go to Dennys which is about 50 feet from the back door of the hotel.", "title": "hmmm That Smells Odd", "user": "the49thst8", "date": "November 8, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 1.0, "value": 2.0, "rooms": 2.0, "location": 2.0}, "id": 6088040, "likes": {"liked": "— Free Parking included", "disliked": "— Mold & Mildew"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "The rental arrangement with Dollar Car Rental worked very smoothly; a brand new Corolla was waiting for us at the airport. The staff at the hotel were ALL very cordial and very helpful. The valet parking guys were terrific - they all knew my name after our very first stop with them.", "title": "very nice hotel", "user": "musiclover22", "date": "November 7, 2006", "detail_rating": {"front_desk": 2.0, "service": 2.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 4.0}, "id": 6083773, "likes": {"liked": "— rooms", "disliked": "— noise"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "There is construction going on in the neighborhood, but we were at the end of the hotel closest to the construction, and didn't find it to be a huge problem. Waikiki hotels are city hotels, and there are going to be city noises. Live with it. But when the surf was up, that's what we could hear most loudly. And we were able to sleep late every morning with little difficulty. Look at it this way: we could have been across the street at the Halekalani, probably the best (& most expensive) place in Honolulu, and we would have had the same issue. Since the Parc & Halekalani are owned by the same company, we were able to use the restaurants at the latter (best in Waikiki) and charge them to our room.", "title": "Stay elsewhere", "user": "SF_Frequent_Flyer", "date": "October 9, 2006", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 3.0, "location": 3.0}, "id": 5932282}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 44, "average": 123, "very good": 372, "terrible": 27, "excellent": 253}, "aka": "Waikiki Parc Honolulu", "slim_ranking": 0.409638554217, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "In the heart of an exotic and vibrant beachfront city is a chic boutique hotel infused with contemporary style, bold experiences and unpretentious hospitality. To be seen at the Waikiki Parc Hotel is to encounter a vibrant alternative to luxury while being immersed in an enticing and captivating world of culture, Nobu-style cuisine, entertainment, shopping, recreation and relaxation."}