{"user_rating": 4.0, "review_count": 57, "name": "Wailea Ekolu Village Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "We (4 adults/2 toddlers) rented unit #808 because of it's 2 bedrooms with king size beds, ensuite bathrooms and private lanai's. The condo was perfect! From the breathtaking views to the heavenly beds this condo is fully stocked with everything you need for a fabulous vacation.", "title": "First time renting a Condo on Vacation...Fantastic!", "helpfulness": 1, "user": "teachartz", "date": "May 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 65231717}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "90% of the unit has been beautifully updated and decorated. The bathrooms are still dated but they are clean and well taken care of. The unit is located perfectly; you cannot hear any traffic noise and you have panoramic views from the main lanai. The pool is located next to the unit and you can easily walk to the shops at Wailea in approx 15 minutes.", "title": "Great condo option in Wailea - pick your unit location carefully", "helpfulness": 4, "user": "islandgirl76", "date": "November 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 50082386}, {"rating": 5.0, "title": "Picture Perfect!", "text": "We booked directly through the owner and had a very pleasant experience.", "helpfulness": 1, "user": "IndianaJBo", "date": "September 28, 2009", "id": 45341411}, {"rating": 5.0, "title": "Awesome Place Diamond in Wailea", "text": "We spent a great 2 weeks in unit #304 and would go back in a heartbeat. We booked directly with Destination Resorts Hawaii and were very pleased with the customer service from the reservation booking to after-hours check-in to the efficient check-out process. Everyone was friendly and seemed to genuinely want to make our vacation terrific. The unit itself was nice and comfortable. On the second floor, looking over the 15th hole of the Blue Golf Course, with a nice view in the distance of Molokini and the ocean, this is a one bedroom unit with two smallish bathrooms (but adequate for our purposes), insuite laundry, a slightly dated but fully equipped kitchen and a large living/dining area. The Destination Resorts provides room cleaning every 3 days and our unit included free phone calls to the Continental USA and Canada which was a nice perk. The only thing that was a bit disappointing compared with other properties we've stayed at was that the communal BBQs are not propane but require you to supply your own charcoal. We didn't see anyone using these BBQs the whole time we were there.", "helpfulness": 3, "user": "SnorkeledUp", "date": "September 18, 2009", "id": 42696440}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "One more note, be very careful when selecting your unit at this property. Some of the buildings are very close to the main artery coming into Wailea from the Highway and would be quite loud with traffic noise. And some of the buildings are situated quite high on the slope so walking to the shops, beaches, other resorts, etc would be quite a hike. Building #3 was about a 10-15 min walk to all the other amenities of Wailea. The closest restaurants are Matteo's Italian which was a reasonable, casual Italian place (note: you place your order at the cashier and pay before getting a seat which was a bit unusual - they also do take-away for most menu items) and Joe's Grill which is located at the Wailea Tennis Centre across the street and offers a great menu in a casual atmosphere.", "title": "Pretty and spacious condo but REALLY NOISY!!!", "helpfulness": 4, "user": "AJPSdundas", "date": "August 14, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 1.0, "service": 2.0, "rooms": 4.0}, "id": 37687935}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We just returned from a fabulous 23 nights at unit #1507 at Ekolu Condos in Wailea. I cannot say enough good things about this condo in particular but also Ekolu. We have stayed in many condos and villas throughout the Hawaiian Islands, Mexico and Europe and I have to say that this unit ranks up there with the very best of anything we have stayed in.", "title": "#1507 - Perfect in Paradise", "helpfulness": 2, "user": "Lisa015", "date": "August 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37575153}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "First, I would recommend Ekolu condos to anyone. We have stayed at the Grand Champions before and although they are are nice, Ekolu is much more spread out and the private. It is a bit higher up the hill in Wailea so the views are more spectacular in my opinion. The grounds are beautiful and very well kept. The pools are lovely. I read reviews of Ekolu before we left and noticed some families complained that they were told to be more quiet at the pool. We had this experience at the Grand Wailea as there seemed to be a person who's only job was to walk from pool to pool yelling at kids who were laughing and splashing. We did not have this experience at Ekolu but I have to be honest and say that I can understand to a point why they try to control the noise. It is so quiet and peaceful and I wouldn't want to hear other kids yelling and screaming at the pool so why should people want to hear mine? I think that this would be the norm at any condo unit in Wailea so if you have kids who love to yell and scream at the pool, Wailea may not be the place for you.", "title": "wonderful experience", "user": "vacati0ner61", "date": "July 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33895072}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "It is about a 10 minute walk down to the shops at Wailea and then about another 10-15 minutes to the beach. It is possible to walk it which we did on many occations and in our opinion, the best beaches on Maui are in Wailea. We snorkled and dove right from the beach and swam with all kinds of fish, massive turtles, eels, octopus, manta rays and even a few \"baby\" tiger sharks who were \"only\" 10 feet long:)", "title": "Gorgeous Place, fantastic value", "helpfulness": 1, "user": "HiDef_inATX", "date": "June 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33416734}, {"rating": 5.0, "title": "Ekolu Village, Wailea, Maui.", "text": "Now on to unit#1507. We were so pleasantly surprised with the unit. The pictures on Mark and Nancy's website are great but I think they don't do the unit justice...especially the picture of the main lanai and the view. The views are SPECTUALAR!! The furniture on the lanai is perfect because the table is a bar height table so you are sitting up above the railing and have unobstructed views. They also have great wicker chairs which is where we sat whenever we were at the condo.", "helpfulness": 2, "user": "Daniel_Fi", "date": "June 1, 2009", "id": 31296215}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The kitchen was another highlight for us. It is a bit on the smaller size but perfect for a family of 4. There wasn't one thing that we needed that wasn't already there. This kitchen was honestly the best stocked kitchen of any place we have ever stayed in the world!", "title": "Beautiful condo, location", "helpfulness": 1, "user": "jaydarl", "date": "March 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 26461877}, {"rating": 5.0, "stay_parameters": "Stayed November 2008", "text": "We spend a week in unit 808, which we booked directly from the owners at VRBO. This condo is a wonderful place. Very clean, nice upscale furniture and kitchen, HDTV, great view from the lanai.", "title": "Absolutely wonderful", "user": "Widby2008", "date": "November 26, 2008", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "business": 5.0, "rooms": 5.0}, "id": 22223831}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The grounds at Wailea Ekolu are beautifully landscaped and well maintained. Very quiet and peaceful (no noise problems as mentioned in a previous review in this unit).", "title": "Will never stay in a Hotel room on vacation again.", "helpfulness": 4, "user": "jillish", "date": "August 21, 2008", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "business": 4.0, "rooms": 5.0}, "id": 19208285, "likes": {"liked": "— The view from the lanai!"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The property is not located on the beach (but still has nice ocean views). However, it's only a 10-15 minute walk to the beach and we found it easier (and often faster) to walk than to drive and to try to find a place to park.", "title": "Ekolu is an excellent choice in Wailea", "helpfulness": 1, "user": "Home-in-TX", "date": "May 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16043006, "likes": {"liked": "— great condition of condo and incredible view", "disliked": "— nothing"}}, {"rating": 2.0, "title": "Not very family friendly", "text": "There are some restrictions on kids playing on the property here, so I would not recommend it for families with small children.", "helpfulness": 4, "user": "SantoTomas", "date": "June 11, 2007", "id": 7836054}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "My husband and I and our 3 kids, 13,9, and 2 years old, stayed in unit 905, a 2 bedroom that we found through VRBO. The condo owners were very friendly and great to work with. The keys were mailed to us a week or so before we left for Maui with a postage paid envelope for returning them. Very convenient. The unit can be seen on mymauisunset.com.", "title": "Wonderful Wailea Ekolu", "helpfulness": 5, "user": "calgarygirl2007", "date": "April 9, 2007", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "business": 4.0, "rooms": 4.0}, "id": 7300926, "likes": {"liked": "— The view from the Lanai"}}, {"rating": 5.0, "title": "Paradise Found", "text": "My husband and I spent 10 WONDERFUL days in Ekolu Village, Unit #1703 in the middle of November 2006 for our honeymoon. We LOVED our condo and felt it was a very good deal! The community was very quiet...although I will agree with an earlier reviewer that the wooden slat shutters didn't go far in shutting out external noise. Since the community was so extremely quiet, this was never a problem for us. As the sun rose on our first morning in Maui, I fell in love with the view of paradise from our very private lanai and private garden. We had a sliding glass door that walked out to a secluded patio off of the master suite and two full sliding glass doors off of the living room revealing a clear view of the Pacific Ocean and the grounds below.", "helpfulness": 6, "user": "cvnurse", "date": "November 28, 2006", "id": 6183492}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The living room doors opened up to a lovely lanai with a table and chairs where we had breakfast and coffee each morning as well as a lounge chair for sunning and two more chairs in the corner that made a nice area for reading, talking, and reflecting.", "title": "Absolutely Amazing!", "helpfulness": 6, "user": "dkguntz", "date": "October 17, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 5964051}, {"rating": 4.0, "title": "worthwhile view", "text": "The unit had TWO electric grills that worked great (we saved a little money by preparing a few meals at the condo). The kitchen had just about everything we needed (except spices, of course) including pots, pans, dishes, glasses, microwave, dishwasher, roomy refrigerator/freezer (with ice maker) coffee maker, blender, knives, cutting board, and all of the necessary gizmos and gadgetry such as can openers, spatulas, slotted spoons, garlic press, etc... The living room was roomy and comfortable with a large TV, DVD/VCR, cable, couch chairs, etc., and a lovely dining room with the table nicely set.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "June 29, 2006", "id": 5411629}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "The master suite was very nice with a comfortable king size bed. The two full baths were excellent. The entire condo was spotless and the grounds were immaculate! There were many other extra touches such as two fresh orchid leis and a nicely wrapped \"honeymooners\" present left for us on the table which was a beautiful Maui \"coffee table\" book that we will treasure as a souveir from this fabulous trip. Beach towels and fresh bath towels were provided daily. The front desk personnel were very helpful with giving directions, suggestions, and helping to make arrangements.", "title": "A paradise within paradise", "helpfulness": 19, "user": "jkjohnson1", "date": "February 4, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 3.0}, "id": 4412906}, {"rating": 2.0, "title": "Too noisy", "text": "Wailea is a great place to stay if you want peace and quiet, but if you're searching for nightlife and shopping, this probably isn't the choice for you. My husband and I would LOVE to return to this condo in the future.", "helpfulness": 8, "user": "Dandi1", "date": "January 25, 2006", "id": 4388496}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 6, "average": 6, "very good": 10, "terrible": 2, "excellent": 33}, "aka": "Wailea Ekolu Village Hotel", "slim_ranking": 1.0, "description": "Located along the slopes of Haleakala with incredible vistas of the Pacific Ocean, Molokini crater and the neighboring islands of Lana’i and Kahoolawe, this condo resort has an ideal location at the gateway to Wailea. Set among the plush Wailea beach resorts, with easy escape to discover and explore the island of Maui and perched amid an 18-acre tropical garden paradise with 2 pools, recreation pavilion and barbecue grills, it’s just a tee shot away from the Wailea Blue Golf Course. Each suite has a fully equipped kitchen, private lanai, living/dining area and en-suite washer and dryer. Added Values include FREE parking, FREE wi-fi internet access, FREE calls to the US and Canada and preferred rates at Wailea Golf Courses."}