{"user_rating": 4.5, "review_count": 167, "name": "Wailea Ekahi Village", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We were fortunate to spend 12 days in paradise! We rented through VRBO, unit 52d. It was a 5 minute walk to the beach which is terrific to walk off the calories gained from the Mai Tais at happy hour. We had a one bedroom unit that was well updated and well managed by the owners. There is some traffic noise in the units close to the main road but we did not spend much time in the unit during the day and the owner provided a Sony Dream Machine beside the bed that provided beautiful sounds to fall asleep to. Lots to see and do in Maui and many beautiful beaches to explore. We were very impressed with this island and loved the Ekahi Village.", "title": "Beautiful landscaping, lots of pools and a great beach", "helpfulness": 1, "user": "canadianpair", "date": "February 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 152369555}, {"rating": 3.0, "title": "Ekahi village 8d", "text": "Love the ekahi resort, well kept and pool is close to the beach. Great snorkeling. 7 and 8 numbered buildings have a wonderful location to the pool and beach.......but, we stayed in condo 8 D for two weeks and sadly the carpets, although, probably good quality, are in very very desperate need of cleaning. Decor is getting outdated, and blinds are starting to malfunction, as is kitchen door window. Given the number of tourists and cleaning staff, a safety chain for night may be a good idea, as would a safe, most of us carry passports. We are foodies and the barbecue on the lanai was great, six wine glasses would have been nice. Love ekahi, will definitely stay here agin, not this condo, got to be something more updated and cleaner.", "helpfulness": 2, "user": "nikijewel", "date": "February 9, 2013", "id": 151778090}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Just returned from Ekahi in Wailea. Spotless, great family oriented condo, upper level with great lanai and great views of the ocean. Two minute walk to beach and pool. Convenient location.", "title": "wonderful family vacation spot", "helpfulness": 1, "user": "traveladventurer42", "date": "January 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151020692}, {"rating": 2.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We were in 51D: 2 bedroom, 2 bath. Updated kitchen. Great gas grill. Highly recommended.", "title": "Gone Downhill", "helpfulness": 3, "user": "Tony S", "date": "January 20, 2013", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 150135575}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Grounds are well kept. Large lawn area on the walk down to the pool and ocean. We saw whales spouting from the lanai. Enjoyed snorkeling at nearby beaches, stand up paddle boarding, swimming in ocean, whale watching, golf, dining out. Keep the Aloha spirit!", "title": "great place!", "helpfulness": 2, "user": "lohans4", "date": "January 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148620758}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We stayed in a one bedroom condo at Ekahi June 2013 for one week. I booked the condo through vrbo.com from the owner. We were in building 32 and the location was fabulous! We were able to enjoy an ocean view from the lanai every morning when we had breakfast or taking a break during the day. We travelled with our 15-month old boy and the condo had lots of supplies for babies including a stroller/booster and pack and play. They also had lots of fun beach stuff for us to use (this is SPECIFIC to this condo). The beach is one of the loveliest I have encountered in Maui and it was never crowded. It's perfect for swimming, snorkeling and long romantic beach walks. The Ekahi village is a 5 minute drive from all the luxury hotels in Wailea. This means that you can have a 5-star dinner every night (when you save $$$ by making breakfast and lunch at the condo it's not that painful!). We went to Amasia by Alan Wong at the Grand Wailea resort and it was fantastic! Check out Big Beach and continue on the road towards Makena till it ends to see the magnificent lava fields. I really love this condo village and would definitely recommend.", "title": "Wonderful property in a GREAT location!", "helpfulness": 1, "user": "SOnjana", "date": "June 24, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 165078801}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "My husband were married in Maui May 2013 and our friends and family stayed at Ekahi Village for the week. Everyone LOVED the property- great location, great beach, no complaints from anyone! There were about 30 guests that stayed in condos on the property and everyone raved about it. 20E was excellent! When we arrived a light bulb was out and the coffee maker didn't work. I emailed Christine the owner (she lives in Canada) and coordinated someone to be there to fix the issues same day. Unit was a little pricey but I would definitely recommend if you are looking for a more upscale unit.", "title": "Ekahi Village Unit 20E- Awesome!", "helpfulness": 1, "user": "mmmegs88", "date": "June 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163240135}, {"rating": 4.0, "title": "Ekahi Village Unit \"33B and 12A\"", "text": "In 2011 for our family vacation we booked this property through Costco not knowing what to expect. we were pleasantly surprised. The grounds were beautiful and well kept. we got unit 33B - one bdr,2 bathroom, ground level with a garden view. with a toddler and a 3 month old infant it worked for us. It had all the amenities we needed, i was more excited about having a washer/dryer since, i had to do the kids laundry often. The kitchen was fully equipped and the Private lanai with barbeque was a great addition. The hike to the pool with a stoller was a bit much but since i needed the exercise, it actaully worked out. House keeping did a great job and The unit was cleaned often while we were there.", "user": "A TripAdvisor user", "date": "May 24, 2013", "id": 161740992}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "After staying here in 2011, we came back in 2012, this time around we were given 12C, it was a little dated and we were not impressed with it from the moment we walked in. We managed to spend a night here while my husband called the office to ask for a change. The staff were friendly and helpful and changed us to unit 12A which became available the next day. Now this unit is newly remolded, i had no complaints about it. we loved it right from the get go. it's a town house with 1bdr 1.5bath, fully equipped kitchen with stainless appliances, all top of the line, very tastefully furnished . The master on the second floor has an ocean view and a balcony with chairs. The private lanai has a garden view and barbacue. Yes, its a little ways to the pool, but it was always a refreshing walk. This unit really contributed to making our stay enjoyable. The owner has put a lot of effort into making it a home away from home and we were really impressed.", "title": "Absolutely wonderful!!!", "helpfulness": 2, "user": "Misty9577", "date": "May 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 160482282}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Having stayed in Kaanapali, prior to having kids, we prefer wailea and Ekahi Village has become our go-to for condos. we will be going back this year and hopefully looking forward to another pleasant stay.", "title": "Great property, but do your research", "helpfulness": 5, "user": "TravelingKatie11", "date": "April 22, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 158511292}, {"rating": 4.0, "title": "Ekahi Village 6E", "text": "We spent 8 days in our unit. It was such a pleasant change from the place we stayed in Kaanapali (a high rise condo)", "helpfulness": 2, "user": "Forever_Fifty", "date": "March 16, 2013", "id": 154786475}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Although the decor was getting dated and the carpets not the cleanest looking, we enjoyed our stay very much.", "title": "10 F for our first visit to Maui", "helpfulness": 2, "user": "lovesouth42", "date": "March 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154490519}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "It would have been nice to have glass wine glasses instead of the plastics ones.", "title": "Excellent location. Beach access. Nice grounds. Quiet.", "helpfulness": 4, "user": "PL36", "date": "March 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154294510}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The unit was one of the closest to the pool and beach.", "title": "Best place in Maui", "helpfulness": 1, "user": "Sunnshine59", "date": "March 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153740059}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "It had a huge upper lanai great for sitting on for all meals and watching the sunset - partial ocean view.", "title": "Ekahi Village 4-B", "helpfulness": 1, "user": "Tracy G", "date": "March 3, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "value": 5.0}, "id": 153610848}, {"rating": 5.0, "title": "Great place to stay", "text": "We have stayed in unit 38D several times and love it. It has great views of the ocean and is well equipped. We always rent through Destination Resorts, their service is great and if anything goes wrong, they fix it immediately. I would definitely recommend Ekahi to anyone, but do your homework and check the location of the specific unit you are thinking of renting.", "helpfulness": 1, "user": "Beverley G", "date": "December 31, 2012", "id": 148466587}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "My family and I just got back from a 3-night stay in unit 35C. This unit was booked as part of a hotel+air package through a 3rd party airline website. Check-in was hassle-free, although the front desk woman who helped us wasn't very friendly, barely smiled and didn't make us feel very welcome. However, the concierge desk (Carmella?) was very warm and gave us a lot of information on activities in the area.", "title": "Comfortable & Convenient", "user": "bnh00", "date": "December 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 148061409}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "After the cold reception by the front desk, I was worried about how we'd like our accommodations. Our unit was a quick drive from the check-in location and there was ample parking just a short walk from the unit, which was nice since we had quite a bit of gear traveling with a toddler. Unit 35C is a ground-floor unit and, although the decor was a bit out-dated with varying degrees of upgrades (granite countertops mixed with rattan furniture, dark wooden shutters and white cabinets, etc.), the unit was spacious and comfortable. The full kitchen was great and included basic utensils, dishes and cookware, as well as dishwashing detergent, paper towels and cloth towels. A set of large beach/pool towels were included with the unit (not refreshed during our stay--not a problem for us). We used the stacked washer/dryer. It can only handle a few articles of clothing or two towels at a time so don't expect to do any huge loads at once. Still very convenient, though. Housekeeping came by every day to empty the trash, make the bed and restock towels. The high-speed internet was a bit slow, but enough for checking e-mail. Upon our arrival, we noticed the screen sliding door leading out to the lanai had a large rip in it. I called the front desk, described the issue and they had maintenance come by to repair it. I made the call in the mid-morning before heading out for the day and it was fixed by the time we returned in the late afternoon. My husband and son explored the well-manicured grounds. Our unit was advertised as a garden view, but there was a sliver of ocean view as they walked onto the spacious lawn just outside our lanai. It's a pretty long walk to the beach, especially with a toddler in tow.", "title": "an 80's beauty, incredibly well maintained", "helpfulness": 1, "user": "Vince204", "date": "December 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 147934472}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Overall, the unit was comfortable and conveniently stocked and located. We will definitely consider staying at this property the next time we visit Maui.", "title": "Some things to consider...", "helpfulness": 2, "user": "rbux", "date": "December 14, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 147410461}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "I rented a condo in this Wailea complex through VRBO. It's my 7th time in Maui and I know the area quite well. Wailea is simply breathtaking. The grounds are all immaculate, nature is definitely prevalent, the vistas are postcard like. The area has class without being snooty.", "title": "Don't hesitate to book here", "helpfulness": 1, "user": "detraveler_7", "date": "November 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 146424492}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 10, "average": 10, "very good": 52, "terrible": 2, "excellent": 93}, "aka": "Wailea Ekahi Village Hotel", "slim_ranking": 0.428571428571, "description": "This Maui family friendly condo resort with low-rise buildings span 34 acres of tropical landscaping and terraces down to popular Keawakapu Beach, a sandy beach with gentle surf and great snorkeling. Abundant resort amenities include four swimming pools, paddle tennis, shuffleboard, barbecue grills and a beachfront pavilion making this the perfect place for family and friends to hang out and hang loose. Each studio, 1- and 2-bedroom suite is equipped with a full kitchen, separate living room/dining area, private lanai or patio with outdoor BBQ grill and en-suite washer and dryer. Added values include FREE parking, FREE hi speed wireless internet access, FREE calls to the U.S and Canada, daily housekeeping and preferred rates at Wailea Golf Courses."}