{"user_rating": 4.0, "review_count": 1287, "name": "Waldorf Astoria Naples", "reviews": [{"rating": 4.0, "title": "Very nice", "text": "We stayed for 2 nights over a weekend, and found the hotel to be very nice. The staff was attentive and pleasant. The room was a good size and very clean. We had a nice view from the balcony. They are a half mile back from beach, you can walk or take the tram that comes every few minutes. The walk or ride is thru a very pretty mangrove grove.. The beach is pleasant with a little snack bar/ restaurant right there. All in all, we had a very nice stay and would definitely return. The only con, is we left a jacket hanging in the room and when we called to have it returned, they couldn't locate it.", "user": "kyamin", "date": "November 17, 2010", "id": 87420773}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "The fact that there was a major gas explosion in Fort Myers the night we arrived aside- there isn't anything the hotel could do about that (so no hot water, no hot food, etc Thursday until Sunday morning)", "title": "Customer Service?", "user": "jeldenbailey", "date": "November 15, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 87210693}, {"rating": 5.0, "stay_parameters": "Stayed October 2010", "text": "Rooms were \"ok.\" Nothing special, not bad. Some poor maintenance- bad seals on the shower door- water all over the floor, mold in grout, poor patching on drywall repairs, etc.", "title": "Proof that excellent customer service still exists!", "user": "milva0102", "date": "October 19, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 84077167}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Facility grounds were beautiful. Golf carts shuttle you down the boardwalk about 0.6 miles to the beach (or it is a pleasant walk through the mangroves).", "title": "Second time and still love it!", "user": "HotelFaves", "date": "October 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82452566}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "Cleaning service was slow- didn't get in the room until 4:00. Most hosts (bar, restaurant, etc) pretty much ignored people until they were directly approached for service.", "title": "Green Hotel Misses Mark", "user": "Rotarian7670", "date": "October 3, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81984411}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "From the moment we walked in we were wowed! I loved the contemporary elegant decor and Theo welcomed us with the warm levity and energy that charged our entire weekend. Diego and Sandy gave extra care along with great customer service each every day. The room and turn down service occurred with stealth like execution. Along the pool, Kelvin and Shannon were helpful and made great cocktails. Our experience was complete on the beach thanks to the extraordinary service of Demitri. I cannot wait to stay here again.", "title": "Contemporary elegant resort", "user": "mulberry111", "date": "September 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78454337}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "I just got back from spending a weekend with friends at this wonderful place. The location is absolutely great and the accomodations were fantastic.", "title": "Unbelieveable Place!!", "user": "Fshtraveler", "date": "September 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77987200}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "In addition to this, the staff couldn't have been more accomodating. This ranged from check-in to tennis to the restaurant staff. (You have to try the cheese blintz).", "title": "Heaven on Earth!!!", "user": "dlahey", "date": "September 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77897287}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "Can't wait to go back!!", "title": "Naples Grande Beach Resort was amazing!!!", "user": "jerseykelly3", "date": "September 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77894526}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "I never write reviews but our stay at this resort was so enjoyable that I have to. The service was beyond compare...I felt catered to from the moment we walked in the door until we left. Loved everything about this resort! The beds and pillows are a dream! Extremely peaceful and relaxing. Extremely clean. Incredible food and drinks at great prices! Awesome tennis center and pros. Gorgeous pool and spa! I can't say enough about this resort. I cannot wait to go back!", "title": "So much FUN", "user": "jbsFortLauderdale", "date": "September 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77832353}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Overall our stay here was wonderful; very clean facility, attentive staff, nice location all for a remarkably good price. As AMEX Platinum card holders, we received complimentary breakfast buffet each day, one free lunch, a nice room upgrade and a 4 p.m. checkout - all nice perks during our week-long stay. The room had a lovely view of the Gulf of Mexico and was very clean, and we enjoyed the fruit basket and complimentary wine upon check-in. The Golden Door Spa, which is on-site, was very pleasant and we took advantage of the $99 summer massage specials. With the spa service, we had access to the entire spa faciltiy for the entire day which frankly was more enjoyable than the massage. The privacy we enjoyed away from the crowded hotel pool was nice. Free parking was also a nice perk, although many of the hotels in Naples provide this benefit. We thought this was worth mentioning as it's so nice to enjoy free parking having recently paid $30-$40 a day parking from trips to NYC and Washington DC.", "title": "Great staff, lovely location, very clean, but....", "user": "lacrosse293", "date": "August 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 77381217}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "While the trip, overall, was pleasant and we would return here, we were dismayed by how the hotel nickel and dimed us for every little request. We were also caught off guard by the lack of access into the hotel from the parking garage. If you visit here, take full advantage of the valet at the main entrance. If you park in the garage and handle your own luggage, like we did, best of luck! The only elevator is outside by the pool and there are no signs explaining where the elevators are or, once on the elevator, where to go to reach the main desk in hotel lobby. The elevator dropped us off on the sun deck, surrounded by pool guests in towles and swim suits. After wandering through the bar and a conference room, we finally made it to the front desk, only to be told we should have used the valet. Really.....", "title": "Great hotel in naturally beautiful location", "user": "m508172", "date": "August 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 77380075}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "To address the 'nickel and dime' comment, if you want a refigerator - $25. Breakfast buffet - $20.00 per person - not worth it by any means if it weren't part of our package and complimentary. The food was so-so in Aura, where the breakfast buffet was served, but the kind and attentive service made up for it. The wait staff truly were excellent; the best service we've had in a very long time. Kuddos to them. And to all the staff there, frankly. From the bar tenders to the housekeeping staff - everyone was so kind. While we agreed to pay it, the $27/day resort fee is a little hard to swallow. Comparable hotels don't charge this and we found it distastelful. Also, if you want to use the computer terminals in the lobby, get ready to pay $3.99/day. Ridiculous. Thankfully, the resort fee included internet access in the room.", "title": "Great Hotel - Don't judge based on the bad reviews - most off base.", "user": "pgoliver", "date": "August 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 77034203}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "If you drink alcohol, then be ready to pay! On average a simple mixed drink was $10 except for the nice happy hour every Friday when drinks ranged from $3-$5 depending on what time you got there. Then they were a deal! While expensive, the drinks were all excellent. We recommend though, if you want to enjoy some afternoon or evening cocktails, go off site to a local restaurant and take full advantage of those happy hours. We especially enjoyed the Blu Martini in the Mercado shopping center just north of the hotel on 41 (Tamiami Trail). The Silver Spoon Cafe was also very nice and was only 5 minutes from the hotel in the Waterside shopping center. We actually walked there.", "title": "Nice but not perfect", "user": "zhq01", "date": "August 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 76779750}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "Aside from all this, I would also say that the hotel struggles with an influx of locals who park in the garage and use the pool for free. We encountered several people sneaking in but only on Saturday and Sunday. During the week, the place was quiet and we saw only hotel guests.", "title": "A for effort, D- for all the issues!", "user": "loverbunny", "date": "August 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 76498611}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "The hotel is lovely, the rooms comfortable and elegant, the pool fabulous, and the walk to the beach is amazing. I should love this place, right? I've stayed here twice, each time for a week, for a conference. Each time we have left something in the hotel only to have the hotel never find what we've misplaced. The first time my husband left a large piece of jewelry in the room, and when we called later on the day we checked out, the jewelry was gone forever. Repeated checks found nothing. We thought this was a fluke, until the next time we stayed at the hotel. A colleague and I each accidentally left an item in one of the social rooms. An hour later we checked and again, the items were gone forever. I want to trust the staff, but it's difficult when you repeatedly have this kind of thing happen!", "title": "Gorgeous property, but be careful!", "helpfulness": 1, "user": "TropicalD", "date": "September 28, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81329846}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "I give this a 5 out of 5. From the Managing Director, who took the time to personally find out about a local artist for me, to the staff member who takes your luggage to your room, everyone is friendly, helpfull and only interested in you care. The hotel it's self is beautiful, clean, airy and well stocked. The beach is extremely well kept and there are frozen drinks right there when you need them! I was on holiday with my mom and she pulled me aside and whispered that could come here evey year. Although there is a wonderful steakhouse on the property, the concierge can recommend other fine establishments. I am already checking flights to see when I can return.", "title": "Absolutely the place I would visit over and over again!!", "user": "warnlight", "date": "September 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79947362}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "I cant begin to tell you how much fun myself and my family had at the Naples Grande Hotel over labor day. We were at the pool every day down by the Palm Terrace Rest. We had a gentleman by the name of Wayne that took care of us on these days(I believe he was Jamaican) and he was amazing. I cant remember ever being taken care of at a resort the way wayne had taken care of us and we have been all over the world traveling. He had a great personality and made us feel very welcome. I will recommend this hotel to family and friends because of staff members like Wayne. He is absolutly an asset to the Naples grande Hotel and we look fwd to coming back and seeing Wayne very soon!", "title": "We will defenitly be back to visit wayne at the Naples grande", "user": "doubletroublekk", "date": "September 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79786811}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "AMAZING.....I can't begin to describe how wonderful our stay was. From the cleansiness and details of the rooms, to the staff of the hotel. I also can't forget the tennis program.....fun, fun, fun! As for the fitness center, the best one we've been to in any hotel. We didn't have time to use the spa this time, but we have in the past and it is incredibly relaxing. We couldn't have had a better stay. We are already talking about our next visit. It can't come soon enough!", "title": "Naples Getaway", "user": "vcartagena", "date": "September 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79690182}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "Veronica", "title": "Elegance and Excellence", "user": "Andes71", "date": "September 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 78957755}], "location": {"country": "United States"}, "stars": 4.5, "variance": {"poor": 96, "average": 213, "very good": 374, "terrible": 72, "excellent": 532}, "aka": "Waldorf Astoria Naples Hotel", "slim_ranking": 0.491525423729, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "The Waldorf Astoria Naples is Southwest Florida’s insider secret for couples, families and business groups looking for an eco-smart beach retreat with panoramic views of the Gulf of Mexico. Set on 23 waterfront acres adjoining a 200-acre nature preserve and mangrove estuary, the resort is celebrated for its genuinely friendly staff who embody the highly hospitable philosophy of \"The answer is yes; what’s the question?\" Inviting features include spacious guestrooms, suites and bungalows with private balconies or patios; same-floor meeting space and break-out rooms with floor-to-ceiling windows; energizing recreation, including championship golf, award-winning tennis and water sports on three miles of sugar sand beach; three signature pools, including one with a 100-foot water slide; a rejuvenating Waldorf Astoria Spa and inventive dining options. It’s also just a short stroll or bike ride on palm-lined streets to unique shops, restaurants and galleries."}