{"user_rating": 4.0, "review_count": 5244, "name": "Waldorf Astoria New York", "reviews": [{"rating": 4.0, "title": "Waldorf Astoria - Manhattan NY", "text": "I stayed at the Waldorf Astoria from Jan 21-28, 2005. A couple of observations: (1) the facility is older; but it is very well maintained. But I admit that I wanted to stay here just to experience this hotel; for example, the lobby area is of a style that just isn’t replicated anymore. (2) Evidently, the site hosts a lot of meetings and other functions. So after coming back to the hotel after work, the lobby was very crowded. (Suggestion: if you can, enter through the Lexington Ave entry. It is usually the Park Ave side of the building that is crowded.) Fortunately, security staff manning their post is very obvious. (3) The service extended to me was very good. Example: I arrived at the hotel at 5:30am after a “red-eye” flight. Unfortunately, all the rooms were full, and no one had check out yet. The clerk made a specific attempt to get me a larger, corner room (he noted that I would be staying for a week), and asked house keeping to expedite the cleaning of that room when it became available. For my part, I went to the office, and my room was ready for me by lunch time. I did have the option to stay at another (newer) hotel, but all in all, I would say that it was worth staying at least once, for the experience of it all. pchnmain", "helpfulness": 11, "user": "pchnmain", "date": "February 24, 2005", "id": 3228978}, {"rating": 3.0, "title": "Very grand but doesn't deserve the reputation", "text": "We (two adults, two children) stayed for six nights at the Waldorf. The public spaces downstairs are impressive but the room was ordinary and although there were four of us in the room we were given two glasses, two coffee cups etc. Decided to have afternoon tea and when we arrived at the time booked we were told that we would have to come back in 20 minutes because they had only one table for four and they were expecting a VIP. Returned after twenty minutes to be told we would need to wait another twenty minutes. Told them politely to stuff it and left with the VIP still not having appeared. Hotel is brilliantly positioned and for what we paid great value, we had a good deal through Expedia, though I wouldn't pay the normal rates which are based purely on the name.", "helpfulness": 8, "user": "walkerSuffolk", "date": "February 23, 2005", "id": 3224530}, {"rating": 5.0, "title": "Fantastic!", "text": "I have just returned from a four night stay at the Waldorf Astoria, and have to say that I was seriously impressed! I had read a number of terrible reviews on this site after booking, and came fairly close to cancelling my reservation. I'm glad I didn't!", "helpfulness": 13, "user": "A TripAdvisor user", "date": "February 23, 2005", "id": 3223956}, {"rating": 4.0, "title": "Daughter Thought It Would Be Cool", "text": "On arrival at the hotel, there were a few people in front of me in the check-in queue, but I was promptly whisked off to Diamond Check-In to avoid waiting. My room was fabulous, and beautifully decorated. I did request a room change the following day as I'm a light sleeper and it was a little noisy, but this was done with no problem and the room I was moved to was even nicer than the first.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "February 23, 2005", "id": 3223425}, {"rating": 2.0, "title": "Betraying a storied hotel", "text": "Having read other reviews, I was concerned that staff might be less pleasant to guests, who, like me, are in their twenties or thirties, but that fear was unfounded. During my entire stay, all of the staff with whom I came into contact were delightful and very happy to help.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "February 20, 2005", "id": 3212284}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Excellent service, spacious rooms.", "title": "Nice, old fashion.", "user": "Bo_Pet", "date": "November 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 145297985}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The position of the hotel is definetly one of the best in town. A lot of nice restaurants near the hotel. Hotel restaurants are excellent, but $$$ plus.", "title": "Nice Hotel", "helpfulness": 1, "user": "FECM70", "date": "November 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 145265134}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Would recommend for NYC.", "title": "Nice Time, a little dated...but historic!", "user": "Nicole222", "date": "November 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 145256411}, {"rating": 1.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Perhaps our expectatives were too high on the Waldorf because even if the rooms are nice with plenty of space (for NY STD they are very big), the commons areas are very nice, the service was OK and everything worked fine in general, we didn't experience anything unique, which we have experienced in other Hotels for a lot less money.", "title": "paint it, polish it, varnish it. Its still a turd", "helpfulness": 5, "user": "andy2603", "date": "November 10, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 5.0}, "id": 145105450}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We just returned from a weekend trip to NYC. We stayed at the Waldorf from Friday to Sunday. We actually used Hilton Honors points, so we didn't pay for the room. I am actually glad that was the case because I probably would have been a little dissapointed had we paid high prices. The hotel was very clean, just a little too old for my taste. But, I feel you have to stay there at least once in your life. It was very opulent and historic. The staff was very nice, very helpful. We actually didn't eat there, but the Sunday Brunch looked awesome. We stayed in a regular room, it was just a little small. (which is typical of NYC hotels) It could have used a little updating. But, the beds were very comfortable. The shower was very good. And there were robes in the room. All in all, a great stay, but was glad we didn't pay $1200 for two days to stay there.", "title": "You have to do this at least once in you lifetime", "helpfulness": 1, "user": "ward57", "date": "November 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 145097472}, {"rating": 4.0, "title": "Just what we wanted", "text": "The location of this hotel is great as you are right in the centre of Manhattan. The sightseeing 'hop on and off' buses stop right by the hotel). The hotel lobby has a definite wow factor and decor is impressive. We loved the feel of the hotel which has an elegance and grandeur in its main reception areas. Considering the amount of visitors to the hotel (we stayed between Christmas and New Year) the hotel was kept very clean and tidy. The flower arrangements in the main reception were beautiful and much admired by people. We found the staff to be very helpful in all departments. Trips were booked for us and our request for an adapter for our room was attended to that day. Staff were polite and attentive. There were obviously some very wealthy guests staying at the hotel during our time there but we were treated equally by the staff. Our room was on the 10th floor and was well appointed with two large beds for our family of three. The only criticism was that the bathroom washbasin was cracked but we considered this to be a minor issue. We did not have a view from the window but this did not concern us as it was dark by the time we returned to the hotel after a day sightseeing. I would have liked to open the window for some fresh air but this was not possible.", "helpfulness": 2, "user": "nem50", "date": "January 3, 2007", "id": 6549055}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We stayed on a room only basis and had one meal at the Bull and Bear within the hotel. Although the Maitre'D was a touch formidable he did find us a table. The food though expensive was cooked to perfection and we thoroughly enjoyed our meal. My husbands lamb was the best he had ever tasted at any hotel and my wild salmon was delicious.", "title": "wonderful stay at the waldorf", "helpfulness": 5, "user": "baxterMississippi", "date": "January 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6543979, "likes": {"liked": "— room", "disliked": "— none"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "We felt that the hotel was like a grand old lady and although she seems a little faded in parts this only adds to the charm of the place in a city where everything is so glisteningly new and perfect.", "title": "Very Busy- Quality vs quantity", "helpfulness": 8, "user": "Hornet22", "date": "December 26, 2006", "detail_rating": {"front_desk": 1.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 4.0}, "id": 6500276, "likes": {"liked": "— room", "disliked": "— service, room needs updating"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled with family", "text": "*** GREAT EXPERIENCE*** we went for christmas dec. 22-27. i was a little concerned because of reviews i had read here.However, we loved it lovely hotel and great room(23rd. corner rm. overlooking park ave.) staff was first rate and a great location.Also,while your there see Jersey Boys best theatre exp.in many years.Happy new year!!!", "title": "Suite Deal", "helpfulness": 2, "user": "ssful", "date": "December 19, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6474142, "likes": {"liked": "— Historic nature of the property"}}, {"rating": 3.0, "title": "Nice Experience but Not As Expected", "text": "Staying at this hotel presently Suite 700F. Very busy Christmas period from 22dec - 27th dec. After travelling all night to get to the US we were told at reception at 10am that the room was not available till 3 that afternoon (check out time is 12 for suites then they have to clean the room). Lobby had a queue to wait for reception which took 15 minutes. Lots of tourists wandering through- felt like a lab rat-maybe I should have more bling on!! No transit room that we could wait in and the kids were very disappointed that they had to wait 5 hours till they could relax. Room is pleasant - homely. No view and the garbage trucks come past at 3am everymorning which is very noisy. The heater in the room looks like it was installed in the 60's and does not really heat the room.", "user": "Swecker", "date": "December 18, 2006", "id": 6470603}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Just completed my east coast trip with a 2-night stay at the Waldorf.", "title": "Charming but a bit dated", "helpfulness": 1, "user": "gccc116", "date": "April 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128008148}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "As a HHonor Diamond member, we were upgraded to a 2-room Park Avenue view suite. However, some of the windows look out to scaffolding, as the property is undergoing some remodeling, so we can only enjoy \"partial\" Park Avenue view.", "title": "Beautiful and iconic", "user": "positivepants", "date": "April 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 127937996}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The suite is very spacious, but a bit dated. The bathroom is very small, but clean, well-stocked and functional.", "title": "Fabulous !", "user": "HermanandMarleen", "date": "April 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127936847}, {"rating": 1.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We read all the reviews before booking, so we expected the room to be a bit dated with old fixtures and furnishings. In my opinion, they actually added to the charm of this hotel.", "title": "A rip off from start to finish, service appalling", "user": "cockrobinupurass", "date": "April 15, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 127916928}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "All in all, a pleasant, but not perfect stay.", "title": "Disappointing", "helpfulness": 1, "user": "KarenS66", "date": "April 15, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 127911247}, {"rating": 2.0, "title": "Not A Five Star Hotel nor close.", "text": "This place was a mess. No one greeted us upon arrival (so that means no doorman or bell service.) The place is a maze from the start. No signs to where exactly is the front desk. Beautiful inside, high ceilings, big sparkling Christmas tree, marble tables with nice flower arrangements, etc. Used the self check in machine because there was an extremely long check-in line (3pm). To find out that our room was not ready and that we had to wait in the long line. 30 minutes later, got keys to our Park View room and their was no bell person available to bring our luggage to the room. So we brought it up ourselves. The place is the most confusing place ever (it was built in the shape of like 4 H's put together and they had lots of rooms). Also no upgrade was available even though we were Hilton silver members. After 30 minutes of being lost on the 12th floor we finally find our room. Oh and the views of the park were excellent (NOT!). We were on the 12th floor and could not even see the park. Also it was not views of central park it was views of their own little park that they developed themselves. So basically the only thing that we had good views of was the room on the other side of the H. The bathroom was made out of marble (old) but nice, no jets in tub and small tub. No special soap or shampoo... these were ones that you may find at let's say comfort inn. Beds were great and very comfortable. No plasma TV = junky comfort inn style television. the internet costs like $20 a hour. You have to request turn down service. On the plus side Hilton… being a silver member sent us a bottle of wine and chocolates which was designed like art (almost too good to eat.) The room was nice but needed a paint job and for those that work their it was room 1278(also the ceiling looked like it was going to fall). My advice if this place is $300 a night it's worth the additional $200 to stay at trump (that’s how bad it was). Read my trump review. Self check out was easy…that was great because I just wanted to check out and get back to trump. Again no service with luggage, etc. Oh I just noticed they charged me an additional $2... It was like my room charge and then $2 more! What?", "helpfulness": 8, "user": "A TripAdvisor user", "date": "January 17, 2005", "id": 3012044}, {"rating": 5.0, "title": "Best NYC has to offer", "text": "To stay at the Waldorf Astoria is to appreciate a time and place where things were done differently.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "January 17, 2005", "id": 3011796}, {"rating": 5.0, "title": "Superb", "text": "If you are counting the pennies, don't even consider this hotel. Although to be honest, it is reasonably priced, but, you need to expect the extras!", "helpfulness": 9, "user": "A TripAdvisor user", "date": "January 12, 2005", "id": 3002612}, {"rating": 4.0, "stay_parameters": "Stayed December 2004", "text": "We stayed there in September 2004, we escaped Hurricane Ivan in Florida, only to find it caught up with us in NYC....can't help the weather.", "title": "Fantastic hotel - staff overworked!", "helpfulness": 6, "user": "Wesleyb", "date": "January 6, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 2983029}, {"rating": 3.0, "title": "Bring plenty of spending money!", "text": "At 8:00am we awoke to the sound of a thunderstorm and a leaky window. While most would complain, we knew what a hurricane could do, and this was nothing to worry about!", "helpfulness": 3, "user": "briant2001", "date": "January 5, 2005", "id": 2977577}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "I wondered, why the reviews posted here differ so much in rating the hotelrooms and staff. I even supposed some of the (overly positive) reviews being feigned. So, I was a little apprehensive, also because two friends joined us there for over night stays due to my suggestion of this hotel.", "title": "Pros and Cons", "helpfulness": 2, "user": "Zurich", "date": "June 16, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 16955539, "likes": {"liked": "— Classic style, mid town location", "disliked": "— Inconsistent appearance"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "To begin with, there are many aspects I liked about this hotel. Above all, it is classic and old fashioned and I do like that. The price (329 USD) was good compared to other high class hotels in that mid town location.", "title": "Your money could be better spent elsewhere", "user": "NZ_Scooter", "date": "June 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 5.0}, "id": 16889919, "likes": {"liked": "— The name! And location", "disliked": "— The rooms were old and needed a big rennovation"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "On arrival, the super shuttle from JFK let us off at the motor entrance. He told us, that a concergie would take care of us. Odd enough, we saw at least six employees waiting and NO one took notice of us and our luggage. So we chose of the side entrances and took our way towards reception.", "title": "Loved the hotel", "helpfulness": 1, "user": "Carolina59", "date": "June 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16828606, "likes": {"liked": "— location, elegance", "disliked": "— nothing"}}, {"rating": 5.0, "title": "Wonderful Classic Hotel", "text": "On check-in, waiting time was short and the employee booked us in efficiently and politely. He (probably) upgraded us into a corner room (11th floor in a wing towards 50th street) and took care that our friends arriving two days later would get an adjacent room.", "helpfulness": 3, "user": "shazzyb123", "date": "June 8, 2008", "id": 16769974}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "The room had a good size, an old closet in the entrance area, a perfect bed, a bath-room with a big shower and a window. There were no curtains at that window, only a blind, which we had to pull down when using the toilet. We reported this to the reception desk, the employee listened carefully, but curtains never appeared throughout the stay. The view was not over impressive but not bad either. It was memorial day with obviously less traffic, no noise disturbed during the night. The air condition was an individual device and a little noisy.", "title": "A nice stay", "helpfulness": 2, "user": "newfrog", "date": "June 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 16764946, "likes": {"liked": "— Amazing beds, beautiful hotel", "disliked": "— Electric shocks from the carpet"}}, {"rating": 4.0, "title": "Beautiful Hotel...Arf!", "text": "We stayed at the Waldorf during one of the coldest spells of winter weather. we had a lovely suite...but the reason I did not rate this hotel with 5 stars is because there was a dog in a neighboring room. This dog would bark whenever it heard a noise, and woke us up in the middle of the night every night we were there!! The Westminster Dog Show was that very weekend.....need I say more?", "user": "Beancake", "date": "August 30, 2010", "id": 77573855}, {"rating": 1.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "This hotel is terrible. Its really sad, because this hotel was really a grand place at one time. The problem is it hasn't been updated since then. The lobby is reminiscent of the 1940's but with no modern upgrades. II would venture to say that the carpet hasn't been upgraded in 20 years. The corridors are not lit well and kind of scary. You have to use your key card to access the elevator (I thought this was a 5-star hotel?). The room was a complete let down. I had a reservation for 5 nights and left after one. Here's why:", "title": "The hotel that time forgot", "helpfulness": 2, "user": "phillyvisitor", "date": "August 29, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 77415429}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "1. The internet in the room didn't work. They actually have a personal Cisco wireless router in each room. Is this a dorm room? Really? You have to find your room # in the list of 30+ wireless networks. Mine did not work. They also have the old school wired connection as well. That didn't work either. It wasn't just me; one of my colleagues stayed here and couldn't get internet access either.", "title": "Elegant luxury with excellent staff service.", "user": "Steelcitygirl", "date": "August 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 77138715}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "2. The room itself hasn't been upgraded in some time. That would be fine if it was in good shape but it wasn't. The paint was chipping in the bathroom, the desk had several nicks on it and the room is very dark. The bathroom is really small and has a weird medicine cabinet. Maybe this was the trend in the 40's?", "title": "Good hotel, not worh the money", "user": "gt6210", "date": "August 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 77128775}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "3. HBO kept going in and out on the TV. Not a huge deal but it was a Sunday night and I love True Blood!", "title": "This grand old New York hotel is as luxurious and wonderful as ever!", "user": "Murfee", "date": "August 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76995455}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Check in was very OK. The lobby is very nice and has an atmosphere of old heritage. Polite receptionist who was friendly and gave us a room on the 26.th floor. I belive we were upgraded, but not sure.", "title": "As expected", "helpfulness": 3, "user": "VacationOslo", "date": "April 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 127721903}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The room was spacious with a large flat screen TV, double bed, safe, mini-bar, AC, bath tub etc. We were given free wifi access at check in.", "title": "Nice but rooms nothing special", "user": "DEBORAH c", "date": "April 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 127721755}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We got vouchers for complimentrary breakfasts at Starbucks which is located at ground floor.", "title": "The lobby is exquisite and enchanting but the magic stops there!", "helpfulness": 1, "user": "HandM_15", "date": "April 12, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 127721160}, {"rating": 2.0, "title": "No twin room; then billing malpractice", "text": "All in all I would say that the staff was friendly and helpful. The public areas at the hotel is nice. I find that the rooms are the largest drawback at the hotel. The room we stayed in should have been given a make over.", "helpfulness": 4, "user": "jeremy010", "date": "April 11, 2012", "id": 127676892}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "My daughters and I stayed 5 nights. Our room was clean, comfortable but nothing special. The public areas of the hotel are beautiful and it was a lovely experience for us to stay here. The location of the hotel was perfect for us, with some great places to eat within walking distance.", "title": "Old yes but not outdated !", "helpfulness": 1, "user": "Man030", "date": "April 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 127676140}, {"rating": 3.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "Let's be upfront - I was thrilled to be booked into the Waldorf Astoria, even though anticipating that it would be a faded and worn shadow of its Thirties glory. And it was, but I would still go again with the family just to share with them a New York landmark.", "title": "Shabby, but you have to go", "helpfulness": 1, "user": "The_Lewis", "date": "June 17, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 32526933}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Stayed in three rooms over 4 nights. The first room was tiny with two double beds lacking any form of back support. Was moved to a quirky mini-suite overlooking the front entrance. This is the sort of room which makes staying in an old hotel so memorable. It had an entrance foyer, bedroom, a huge dressing room (large enough for a small couch, dressing table and two armoires) and an art deco bathroom on a raised platform. Incredible. The third room was a nicer version of the first.", "title": "Absolutely fantastic!", "helpfulness": 1, "user": "oldfogeys", "date": "June 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32252462}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "All the rooms were worn and in need of repainting, new furniture and carpets. But it was all well worth staying for the fireplaces in the halls, lobby area and the ability to say that you stayed at the Waldorf=Astoria.", "title": "I was amazed by the heritage and splendor", "helpfulness": 2, "user": "Srikg", "date": "June 12, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 32170877}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Stayed here 6th - 8th June as part of a 5-night NY trip to celebrate a 50th birthday. From the moment we arrived till the moment we left we were treated so well, the staff were all pleasant, helpful, attentive, no pretentiousness, and a real credit to the hospitality industry! We were upgraded to a suite which was absolutely beautifully furnished and spotlessly clean. The bathroom had plentiful towels and toiletries, the shower had power, the bed was huge and the living area with its gorgeous chandelier was just magnificent! The staff sent up a bottle of bubbly to help us celebrate too! We had a couple of drinks in Sir Harry's bar where the high standard of service was replicated, nice dish of complimentary mixed nuts! - and the prices weren't too bad in comparsion to the big measures!", "title": "Glamour and glitz", "helpfulness": 1, "user": "integrityandhonesty", "date": "June 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31856457}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Wouldn't hesitate to recommend this hotel, you just cannot fault it.", "title": "your not a guest... your a number", "helpfulness": 4, "user": "goldcoastgal82", "date": "June 7, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 31811589}, {"rating": 3.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Recently completed our second stay at the W=A over the Christmas holiday, including the back tie new years ball.", "title": "Waldorf=Astoria or Grand Central.", "helpfulness": 2, "user": "St.Albans", "date": "January 27, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 6705324}, {"rating": 1.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "You can really tell how well run a hotel is when it is at its maximum capacity - the Waldorf 'wobbled' badly but didnt quite fall apart. The stay was fine but not wonderful.", "title": "Very disappointing", "helpfulness": 6, "user": "KTee:P", "date": "January 26, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 6700224, "likes": {"liked": "— The location", "disliked": "— Pretty much everything else"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Two things attracted us back to the hotel after a stay around 10 years ago. Firstly the public rooms remain superb - especially in the morning or late evening when it's a little more subdued. Im not sure the introduction of starbucks in the building is a good idea generally.", "title": "Would return tomorrow", "helpfulness": 6, "user": "D4SUL", "date": "January 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6595519, "likes": {"liked": "— Location & comfortable bed!", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "The W=A location remains a key factor - 200 metres to the main shopping and attractions.", "title": "What a Grand Hotel!", "helpfulness": 4, "user": "MissBette", "date": "January 12, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6584094, "likes": {"liked": "— Everything"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "The check-in queues remain unacceptably large with maybe only 4-5 of the desks in service. However, once there, they handled our check-in quickly. To be honest Hilton gold membership does not really count for much when the place is busy - no room upgrades - but they did offer free drinks or alternatives.", "title": "Loved The Waldorf", "helpfulness": 6, "user": "manicsfan", "date": "January 11, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6574481, "likes": {"liked": "— It's traditional style and excellent service"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Stayed on Sept 11 & 12. It was our 40th Wedding Anniversary. When I called to re-confirm I mentioned it. We arrived and checked in and went to our room (1414). It was very large, great view of Park Ave. It had a large marble bath. In the closet there were two Bathrobes (very plush) and bath towels that were as large as beach towels ,also very thick. We were very impressed. The room was immaculate with thick wool carpeting,rich furniture and a marble fireplace. After resting the doorbell rang (It is so much nicer than knocking) and it was a waiter with a bottle of champagne on ice with two glasses and a card from the manager wishing ua a Happy 40th Anniversary. This was our first time at the Waldorf. Imagine how they treat their Regulars??? We will also be writing the Manager. For the Price. If you want to be treated like ROYALTY chose the Waldorf. We will be back for our 45th.", "title": "Great Hotel", "user": "DavyGGG", "date": "September 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 79429551}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "I booked this hotel completely by accident, and when I found out how much I paid on booking.com (ALL NON REFUNDABLE!>>) Had a small heartattack (it ended up being almost $400 a night for me and my mom) but after the initial shock, and since it was non refundable, I just decided to sit back and enjoy it. What choice did I have?...", "title": "Loved New York, loved the waldorf even more...", "user": "loves2travel2011", "date": "September 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79281260}, {"rating": 5.0, "stay_parameters": "Stayed September 2010", "text": "Then I read the reviews here, and my heart really sank, so I went there ready for a fight and ready for a huge disappointment but had a blast!", "title": "I have just returned from a weeks stay at...", "user": "MKnight28", "date": "September 10, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 79070304}, {"rating": 1.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "First of all, a quick tip - order the Super Shuttle online before you leave, order a round trip to and from the airport and add the tip. Believe me, you will thank me! Saves time and money.", "title": "Nothing Special Here", "helpfulness": 1, "user": "durkinm", "date": "September 8, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 78802525}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Then, I got to the hotel at midnight, my mom got here before me, and it was all great. We stayed in room 883 (not in the towers), and it was fantastic. Don't expect a nice view (our window overlooked the W hotel) because this is New York City - all you see around you are sky scrapers. The room was gorgeous, the bathroom was great, flat screen tv (for the little we had time to watch). Room service was fantastic, the Concierges (there were several) were always helpful. Gave us a map of the subway, a map of the area, AND a map of the buses. They also printed our boarding passes before we left (so don't pay for the business center, it's too much), AND changed our seats for us on the plane...", "title": "Terrible Reservation Service!!!!", "helpfulness": 3, "user": "hermit02", "date": "September 7, 2010", "detail_rating": {"service": 1.0}, "id": 78691337}, {"rating": 4.0, "stay_parameters": "Stayed July 2004, traveled as a couple", "text": "We stayed in the Waldorf, as part of our honeymoon in July 04.", "title": "A dream come true", "helpfulness": 4, "user": "RoryMc", "date": "February 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 6766936, "likes": {"liked": "— The Name!", "disliked": "— it was a little bit snooty"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "It had always been a dream of mine to stay in what is probably thee most famous old hotel in the world.", "title": "Great Hotel with Excellent Service", "helpfulness": 3, "user": "deepdvr_ca", "date": "February 9, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 6766449, "likes": {"liked": "— The Waldorf Feeling", "disliked": "— CheckIn"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "What makes it special is the feeling of history that surrounds the hotel. The grand foyer is so recognisable from all those movies!The rooms are pretty small though and just a tiny bit aging, and it is very pricey, but if you book well in advance you can get pretty good deals..", "title": "Lived up its reputation!", "helpfulness": 2, "user": "virginiakoalas", "date": "February 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6764516, "likes": {"liked": "— history/location", "disliked": "— bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "The Waldorf is perfectly located for a trip to Manhattan..within walking distance of The Rockerfeller Centre and Times Square.", "title": "A True Classic", "helpfulness": 3, "user": "Pauly-london", "date": "February 6, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 6750359, "likes": {"liked": "— A piece of history, location, comfort, style.", "disliked": "— Oscars - buffet breakfast was decidely average, but there's so much more to choose out there."}}, {"rating": 4.0, "stay_parameters": "Stayed May 2003", "text": "The Breakfast buffet is unbelievably pricey at about $25 per person, but so worth it. Probably the best brekkie ive had in a hotel.", "title": "Waldorf Astoria A Great Getway Locale for Exploring NYC", "helpfulness": 1, "user": "mindybaby", "date": "February 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0}, "id": 6748138}, {"rating": 2.0, "title": "Disappointing", "text": "The architecture and decor in the main lobby is a must. This did make the stay there worth while. However, the staff were extrenely arrogant and patronising and it made us feel slightly inferior - not something we wanted to feel when we were paying $1000 for 4 night's stay. The room itself was small, dark and with a terrible view. The sink in the bathroom needed a complete overhaul and this, along with other nuances, marred our stay at this majestic landmark.", "helpfulness": 7, "user": "janemc315", "date": "February 4, 2005", "id": 3162206}, {"rating": 5.0, "title": "loved every minute!", "text": "My husband and 2 children (11 & 13) stayed at this awesome hotel for 5 nites in one of the suites. We had plenty of help with check-in and our baggage delivery to our room. The lobby is so impressive with these enormous fresh flower arrangements, I could sit in the lobby for hours just watching all the people from all over the world mingling (but I really didn't have time). Too much shopping, plays and sites to see. Every time we came thru the front doors, I felt right at home. The bed was the most comfortable one I'd ever slept in (by the way, when I got home I ordered all the stuff to make our bed just as comfy, and it is!)", "helpfulness": 7, "user": "A TripAdvisor user", "date": "January 25, 2005", "id": 3084195}, {"rating": 1.0, "title": "Disappointed - Well below par", "text": "The last nite there, they were making a movie using the revolving front doors which we found very exciting.We enjoyed this hotel so much we will definitely go back there as soon as we can!", "helpfulness": 4, "user": "KelvinEssex", "date": "January 19, 2005", "id": 3017096}, {"rating": 5.0, "stay_parameters": "Stayed January 2005", "text": "Having Just flown from London to New York to spend a lovely weekend as a tourist (not the usual business trip), I booked a double deluxe room (basic room to you & I) being a gold Hilton Honors card holder I must admit I did expect a lot from this hotel and it let me down on almost every detail. the check-in took at least 15 minutes. the room was small even by London standards. We were obvisously near an extractor outlet because with the window open 1cm there was an awful smell of cooking food. This hotel is old, and it shows! whilst I agree that a lot of modern hotels feel cold & stark. This hotel is souless. As a frequent traveller around the world I have stayed in many top class hotels. The Waldorf=Astoria is not a top class hotel. My recomendation is to either stay at the Intercontinental next door or the Ritz Carlton overlooking Central Park. I know I will next time.", "title": "Waldorf=Astoria at Christmas & New Year", "helpfulness": 29, "user": "luckystrike", "date": "January 18, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3014066}, {"rating": 3.0, "title": "Aging Lady", "text": "My wife and I stayed at the Waldorf=Astoria for 15 nights over Christmas and the New Year, and it was fantastic in every way.", "helpfulness": 3, "user": "Wolverine", "date": "January 17, 2005", "id": 3012955}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "Well this place is a great location. Close enought to shopping and restaruants but not right next to you so you don't have that much foot traffic around. So given the other reviews, I must have really lucked out. My room was spacious, newer furnishings, beautiful bedding, bathroom with marble counter top and hugh medicine cabinet to store your stuff, two plush bathrobes in the closet and a nice chair and ottoman all provided a wonderful room experience. The staff was courteous but not over accomodating but it is New York. They were, however, able to get me into my room my 1PM so I was thankful for that.", "title": "Nice Hotel but worth the money", "user": "sendmehome", "date": "July 4, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 17529483, "likes": {"liked": "— Location", "disliked": "— No coffee maker and charge for internet access."}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "Again this is New York, but I still have diffuculity spending $16 for a glass of wine in the lobby bar that is, by the way, pretty noisy. The lack of a coffee maker in the room is amazing in this day and age and while there is a Starbucks in the lobby, I hate to have to get dressed and go down there each morning. The $14.95 daily charge for itnernet usage is part of the nickel and dime stuff that a hotel of this magnitude should not subscirbe. Also beware that when you are quoted the price for the room there are also about 15% additional for various taxes.", "title": "Big disappointment", "user": "Calcuttan", "date": "July 2, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 17465776}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "So it was a nice hotel in a great location but but not worth the additional money.", "title": "Superb", "user": "ELL1234", "date": "July 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17404921, "likes": {"liked": "— Friendly welcoming staff, great room, location", "disliked": "— room service & laundry costs"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "When my company booked me at the Waldorf Astoria for a business trip I was overjoyed. Even though it would be for only one night, it would provide me with an opportunity to stay at this legendary hotel. The lobby, the elevators and the general ambience lived up to the reputation; however the room was a big disappointment.", "title": "Old World...New perspective", "user": "AUBeachPotato", "date": "June 27, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 17288672, "likes": {"liked": "— It's the Waldorf!", "disliked": "— I had to leave."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "The room was very small, with faded wallpaper and musty carpeting and the window opened out to service chutes with view of piping. The bathroom was tiny and dirty.", "title": "A Beautiful Piece of history", "user": "gayler104", "date": "June 26, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 17262740, "likes": {"liked": "— Very comfortable bed"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "If you're a history buff or enjoy the atmosphere of by-gone eras, then you'll enjoy The Waldorf Astoria. The location is fabulous and very central to many of the \"must see\" sights. Our room was large and had been redone at some point, but the carpet is old, the sofa was old, and the room decor was very \"grandma-ish\". The price point is high but what isn't in NYC these days? The buffet breakfast was good, but certainly not worth the price, but then again, it's NYC. Would I stay there again - no - I would be just as happy in a more modern hotel in a smaller room, that was less of a tourist sight in itself.", "title": "Historic Landmark", "helpfulness": 1, "user": "travelingdoggy", "date": "April 13, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 127832336}, {"rating": 4.0, "stay_parameters": "Stayed April 2012", "text": "Great 5 night stay as a family.", "title": "Aged but full of character.", "user": "Paulaubrey", "date": "April 13, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 127822671}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Service was good although drinks and minibar is pricey as you would guess.", "title": "Good, but falls short of its own aspirations", "helpfulness": 2, "user": "MacWilder", "date": "April 13, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 127813178}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Rooms are perhaps a little tired compared to much newer hotels but the character of the hotel prevails and you can't help loving the place.", "title": "First Time at Waldorf Astoria", "helpfulness": 1, "user": "travelvulture78", "date": "April 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 127806757}, {"rating": 5.0, "title": "Perfect", "text": "I got upgraded to the Waldorf Towers, so these comments are with respect to the expected standards of a very high-end facility. I had a nice although not overly large, corner room. It was clean. No sign of the bedbugs that are such a problem these days in NYC. The bed was comfortable, the towels thick, and the provided robe was comfortable. It was fun using the provided remote controls to make the shades go up and down and the blinds open and close. The bathroom was all marble, something so needless as to itself be fun. But, all in all, not the experience it could and should have been. Here are a few issues: 1. While the automated blinds and shares were fun, they failed to keep out the light. 2. There was a a considerable tangle of wires behind the desk, leaving no place to plug in chargers. 3. The TV was a HD plasma, but only analog signals were supplied, resulting in a poor quality picture with people appear short and squat. There was a surprisingly limited number of channels from which to select. There was a TV in the mirror in bathroom, but it didn't work properly so that it had only two channels. The rugs in the halls needed shampooing. The switches were extremely fancy but their internal illumination couldn't be turned off, thereby resulting in their emitting sleep-disturbing light even when it was dark outside. The shower head was too large for the amount of water provided resulting in a concentrated rather than dispersed stream of water.", "user": "jimd1768", "date": "April 12, 2012", "id": 127761679}, {"rating": 2.0, "title": "Crass Waldorf", "text": "The Waldorf has become a sub standard hotel operating on the fumes of it's long past glory days. When my daughter and I arrived at 8:00 in the evening, we were required to stand in line for a half hour, bags in tow, waiting to check in. We finally were able to lug our bags to a room with a very small window and a strange smell. We did find a front desk minder the next day who was kind enough to switch us to a smaller room with a window and no smell (I'm thinking of a certain Terintino movie here.) I had to wait in the tiny work out room for an aerobic machine and pay $25.00 for the privilege. We only ate breakfast there once because of an early morning appointment. Our two bowls of oatmeal and cold coffee cost a mere $50.00. I guess I'm a slow learner, or perhaps too optimistic. In the future I will always seek out small hotels.", "helpfulness": 3, "user": "bouldertodublin", "date": "August 24, 2007", "id": 8494609}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "Stayed at the hotel from the 15th to 19th of August. The hotel has lots of history and the lobby area is great. It feels like a grand hotel but the rooms are in need of an update. They are quite spacious but the bathrooms and corridors in the hotel need updating. Still they are better than most New York hotels.", "title": "good hotel great for celeb spotting", "helpfulness": 1, "user": "clairebutterfield", "date": "August 21, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 8466195, "likes": {"liked": "— seeing David Beckham", "disliked": "— was not modern enough"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "We saw David Beckham in the lobby during our trip and were told many famous people stay there in the waldorf towers!!", "title": "A dream realised and a tired old lady", "helpfulness": 2, "user": "SandDragon", "date": "August 20, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 8456176, "likes": {"liked": "— The name", "disliked": "— The age"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "The bar area was nice but £4 for a bottle of beer. Some areas of the hotel are being updated", "title": "Loved the Waldorf Astoria!!", "helpfulness": 1, "user": "sarated13", "date": "August 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8454913, "likes": {"liked": "— THe Decor and the beautiful flower arrangement in Lobby", "disliked": "— somewhat small bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "The location of the hotel is perfect and close to all attractions . A taxi to Soho of south manhatten is only £5 and is the best way to travel.", "title": "Great experience", "helpfulness": 1, "user": "jahanchey", "date": "August 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8454277, "likes": {"liked": "— Location", "disliked": "— Needs an update"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Rooms are quite small, but clean. Location is great if you want to be within walking distance of Times Square and Broadway. I stayed there becasue I won the trip through work. I wouldn't stay there again if I had the choice. I would shop around and look for a better deal. If you're looking for luxury try the Hotel Gansevoort especially if you're going there in summer as they have a rooftop pool. It is in Tribeca which is further away but taxi's are cheap. If you need to stay midtown, try the peninsula as they have a rooftop bar that opens at 4pm. Overall, it was nice to tell people back home i'd stayed at the Waldorf Astoria, but the reality is that it was slightly dissapointed. I never got to try the steak restaurant as it was closed for refurbishment but the steak does look terrific on the pictures.", "title": "Slightly Dissapointing", "helpfulness": 5, "user": "EverydayTraveller", "date": "August 28, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 8522544, "likes": {"liked": "— The Locaion and Lobby", "disliked": "— I expected it to be nicer"}}, {"rating": 3.0, "title": "no big deal", "text": "Highlight of the holiday was a restaurant called Patsy's near broadway. Made famous by Frank Sinatra and has celeb's dine there on a regular basis. Fantastic food and even better service. Also try top of the rock to avoid ques like the ones at the Empire State. Dinner cruise on the World Yatch was worth every penny. Men need dinner jackets.", "helpfulness": 1, "user": "jinnty", "date": "August 25, 2007", "id": 8502083}, {"rating": 2.0, "title": "underwhelmed", "text": "Little Italy is only a few streets of Italian Restaurants. Canal street is great for Jolex and Prado watches and wallets! Quite scary though. Definitely do the Hop on-off bus tour and see everything in one foul swoop to give you enough time to do the things you really want to do.", "helpfulness": 1, "user": "BritBurque", "date": "August 25, 2007", "id": 8500330}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "New York was fantastic. We hired cycles in central park and ate at a table front seat at the boathouse lake restaurant. I loved New York and will definitely go back, maybe next time in the winter so I can experience the christmas trees and ice rinks etc... if you're going in summer it realy is a once in a lifetime experience and you'll love every minute of it. If you love the sun and love to sunbathe, you can't been spain or tenerife and a quarter of the price.", "title": "Waldorf Astoria--Better as a Salad", "helpfulness": 3, "user": "kdz1", "date": "August 24, 2007", "detail_rating": {"cleanliness": 1.0, "front_desk": 4.0, "location": 4.0, "value": 2.0, "rooms": 2.0}, "id": 8500141, "likes": {"liked": "— Central location", "disliked": "— Horrible service"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "For Location the hotel is fab. If you're expecting to be wow'd then you best take a reality check. It's clean and pleasen't and the lobby is amazing. It is slighly dated but the beds are comfortable.", "title": "Much better than expected", "helpfulness": 4, "user": "jbmWyoming", "date": "August 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8499141, "likes": {"liked": "— Location and extremely comfortable room", "disliked": "— Cost of drinks at bar, but it is NYC so expected"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Spent two nights here while attending a conference. Tim, at the front desk made and extra effort to find a very spacious business king room for us. He also gave us several hilton honors comp drink coupons as i mentioned it was a special occasion for us. Ram at concierge printed out our boarding passes for our return trip...after I asked where the business office was. i was expecting to get nicked for printing, often the case nowadays,", "title": "Great staff at a great hotel", "helpfulness": 1, "user": "Harvey B", "date": "November 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 144889770}, {"rating": 1.0, "stay_parameters": "Stayed October 2012", "text": "Bed in room was top notch as were the linens, towels and robes.", "title": "A horrific ordeal, never to be repeated", "helpfulness": 2, "user": "WellArdJard", "date": "November 7, 2012", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 144883154}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "I thought staying at a hotel such as this, with a longstanding reputation, would be a fabulous experience. I couldn't have been more wrong.", "title": "Oh no, No coffee in rooms", "user": "Gwen_S_65", "date": "November 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 2.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 144881622}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "On our final day in New York, the hotel suffered a burst water pipe, and the luggage room was seriously flooded. As a result, all of our luggage and possessions were damaged or destroyed. Despite the flood occurring at 11am, no one from the hotel contacted us during the day. We did not discover the damage until after we had collected our suitcases and were about to leave the hotel - the bellhop called us back to \"just check nothing was damaged after a slight leak\". We opened our suitcases to discover that everything was soaked in dirty river water, and virtually every item destroyed.", "title": "True perfection", "user": "David J", "date": "November 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144841551}, {"rating": 2.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "The level of customer service that we received was zero. The \"manager\" we were allowed to speak to was rude, discourteous, patronising and unapologetic. All he wanted to do was get us out of the hotel. At no point did he apologise for the damage caused to our belongings.", "title": "Very Disappointing", "user": "eilat59", "date": "November 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 1.0, "location": 4.0}, "id": 144840031}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Stayed for 5 nights with my Wife and 2 teenage daughters. It's a nice Hotel with really nice staff. Just a couple of observations, watch out for the people selling \"Studio 57\" Hilton timeshare in the lobby, they are all very polite but it is timeshare. Also we had no safe in the room but there are saftey deposit boxes behind reception where you can lock valuables, the lady who runs this was delightful and very helpful. Avoid Oscars for breakfast unless you want to pay €160 plus tip for 4 of you.", "title": "Still a Very Good Hotel", "user": "Tyreman01", "date": "August 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 76936248}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "It is an impressive place with a justifiably impressive reputation.", "title": "Beautiful Historic Hotel", "user": "Steph2727", "date": "August 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76835280}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The hotel was booked through the Javits Center hotel listings. I got a great rate and I was pleasantly surprised by the service at the hotel. It is a huge place and swarming with people. Lots of security too. The lobby is gorgeous. The room was large and we had a view and could see the sky, which sometimes does not happen at NY hotels. The only downsides were the wifi does not work in the rooms. You had to go to the lobby which luckily is quite large. The other downside is the food. It was $80 for dinner for one person for a basic meal, nothing too extravagant. However, the location is excellent and it was an easy walk or taxi ride to other restaurants. The bus for the Javits Center picks up and drops off right in front of the hotel. We left our luggage with the luggage storage downstairs the day we checked out and went to dinner. Picked up the bags and headed to our airport hotel for the night and very early flight the next day. All in all a great experience! Will definitely stay here again.", "title": "Trading Off Past Glories", "user": "Seán L", "date": "August 22, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 76325908}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Okay so the lobby and communal areas are just as ornate as all the guides suggest but beyond that the hotel is trading off past glories. The fixtures and furnishings in the rooms are faux period but getting badly worn around the edges. The room service prices are pretty astronomical considering that the quality of the fare being served is just mediocre at best. Also, there's an oddly wannabe ellitist \"dress code\" for smart causal wear in the evenings which might be aceptable for any fine dining rooms but is only serves to make you less than comfortable in the communal areas. That being said, the location is of course superb but it's sufficient to visit rather than stay in the hotel to experience a little bit of history.", "title": "Great Hotel, Great Location", "user": "teanutSouthWales", "date": "August 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 75922441}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled solo", "text": "We stayed at The Waldorf in December for my birthday and thoroughly enjoyed ourselves. The christmas decorations were out of this world and the reception area took our breath away every time we entered the lobby. Check in was fairly slow, but no problems. The room was nicely decorated, but fairly small and no tea making facilities (but there is a starbucks by the main entrance). The bathroom was very tired. The shower was useless - the spray went everywhere and made the floor slippery.", "title": "Still great, still a legend", "user": "cityhotelsightseeing", "date": "August 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 75596655}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We stayed five nights. The room was clean and comfortable but nothing special; yes,they knew it was a special occasion. Breakfast is expensive but the perfect service makes up for that. Dinner at the Bull and Bear is very expensive but very good. The public rooms are something special though some of the the bars are dark and crowded. The biggest blot is the squalid Starbucks - totally out of place. Because of our special occasion we were rewarded with breakfast vouchers for Starbucks - what an insult! When I went to pay the bill I found $198 that should not have been there; it took a lot of trouble to get it removed and I will be checking my credit card statement very carefully.", "title": "Check your bill", "helpfulness": 1, "user": "PHandE", "date": "April 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 127671246}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "By all means stay at the Waldorf but don't let them see your credit card.", "title": "Lovely Hotel", "user": "Mjklions", "date": "April 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127638456}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "We found the hotel to be exactly as it says in terms of standards and space. The room was very spacious and the level of service was impressive. It is expensive however it is a great hotel to launch your New York experience. It is close to the subway, cross town buses to the ferry, but also to delicatessens and some lovely eateries. (buy a weekly for the subway, it is money well spent) Only a 15 minute walk to Times Square and Broadway yet far enough away to be able to escape the noise and bussle of the square. Easy to get to all you need to do in New York.", "title": "huge and dated", "user": "globetrotterplus", "date": "April 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 127630981}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "vast hotel in real need of modernisation. Meeting rooms were bizarre and dinner was disappointing", "title": "It grew on us", "user": "sarh", "date": "April 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 127625228}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Stunning lobby and communal areas, rooms on arrival looked a bit tired (rather used to hotels with designer bathrooms and trendy window dressings!) , but the hotel just grew on us - we really felt as if we were sharing a little bit of New York history. Staff were excellent. I would stay again. The reason for 4 not 5? Why do they have to charge 15.95 per night per DEVICE for in room wifi. We got fed up with going to the lobby to use wifi- and I'd have thought it would be better for the hotel to waive this fee and not have people loitering in the lobby just to use the wifi. Without this issue, it would have been 5 stars.", "title": "Great location", "user": "Bec A", "date": "April 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 127584491}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Our family, which consists of myself, my husband and my two daughters aged 12 and 15 stayed at the Waldorf for 4 nights from 24 May. It was our first time to New York and we all really loved it. The Hotel is very classic so anyone wanting contemporary will not be happy. However I liked it and prefer the old style. The room was rather dusty around the fixtures and fittings but the bathroom was cleaned well every day and we always had the room done by the time we returned from our outings and fresh towels. The maid came in the evening to take off the bedspreads as it was warm at night. The size of the room was adequate as it was a standard room. We had 2 double beds but we had a seperate dressing room and the bathroom was next to that so we all had privacy when required. We had room service a couple of times and that was very prompt and the food was lovely. All the staff we encountered were very well mannered and helpful. We used the safety deposit box facility which is free and found it useful to safeguard money and passports etc. Taxis were outside the Hotel to take to you to wherever you wanted to go and they are very cheap. We had a great time and will return!!", "title": "Great Hotel, Great Location", "user": "simmo22", "date": "June 5, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 16701106}, {"rating": 4.0, "title": "Staying at the Waldorf astoria New york", "text": "The experience was magnificent. The room was great. Small wardrobe. Nice size bathroom. Fresh soap daily. Not much of a view though. The staff were always helpful. Did not eat there. Breakfast was US$40.00 pp! It was close to a Starbucks. The foyer was lovely. Fully intended to have a cocktail there, but never found the time! The location is excellent. We booked early, and were pleasantly shocked with the price. There is a accommodation sale for the month of August in New York. Nearly every hotel has a room sale. There are shops at the hotel. Did not shop there. There is a postal service there. The beds had 4 pillows each, and were so pleasant to sleep on. No tea or coffee making facility though.", "user": "rambo37", "date": "November 9, 2012", "id": 145038575}, {"rating": 3.0, "title": "Needs focus on details", "text": "My wife and I recently stayed 2 nights at Waldorf during what was to be NY Marathon weekend. We originally booked 4 nights, but due to the race cancellation we left NY early. In any event, we booked thru a travel agent and had arranged for a queen bedroom, upgrade upon availability, and free breakfast. When we checked in, they claimed no upgrades were available as the hotel was sold out. So, after what seemed like an eternity the front desk person selected room 839 for us. He asked for a Credit Card which i promptly gave him, and he disapearred to another room with it for a few moments. He came back and said my card doesnt work ( well it did then and it does still now). I gave him another one, and he said that one was fine. ( I still dont know why he went to another room with my card, kind of concerning) He then gave us the keys and wished us well. I asked about how we get our free breakfast, and he with confidence responded that we dont get free breakfast. I suggested he re-look at his computer as I had already confirmed twice with the hotel prior to arrival that perk. The clerk realized his error and gave us our vouchers.....Room 839 was generally fine, and what i expected for the hotel/NY. However, I did expect that the pocket door to the bathroom would work. Instead, those people in the restroom / shower get to share their experience with other persons in the room. Not a 'feature' i would expect at a Waldorf. I didnt bother complaining to the hotel during our visit, as quite honestly i was just ready to be out of the City given the marathon cancellation. Would I go back to Waldorf, yes maybe. Would i go to Waldorf over The Palace at comparable rate. That would be a tough sell.", "user": "C_A_Dallas", "date": "November 9, 2012", "id": 145003938}, {"rating": 5.0, "title": "Great Breakfast", "text": "Stayed here with my sister after a 7 hour delayed flight from Dublin, we got to the hotel at 2am and the staff were so nice. We got upgraded to the biggest room I've ever seen.", "user": "John C", "date": "November 8, 2012", "id": 144977519}, {"rating": 1.0, "title": "Guest Services Manager John [--] Should Be Fired", "text": "The hotel itself is old fashioned grandeur at its best. Great location of 5th Ave and you could hang out i the lobby and watch the great and the good of NYC.", "user": "LAarchitect12", "date": "November 8, 2012", "id": 144976550}, {"rating": 3.0, "title": "Good hotel, but not recommended for Elite members!", "text": "The breakfast was a treat, our waitress, Grace ( from Dungloe 40 years earlier !!) took a shine to us, we got extra everything :)) Great stay .", "user": "Microg0", "date": "November 8, 2012", "id": 144933313}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "We just returned from the Waldorf - January 2, 2007 to January 5, 2007. This is simply an elegant hotel - just so New York. We wanted our children 12 and 14 to get a true New York experience so we went all the way. Although the Plaza would have been our first choice in the \"old days\" since they are under renovation and we had stayed at the Waldorf before on business and always found it to be very nice we thought it would be a good choice and that it was. We had a mini suite with 2 bathrooms, and yes, it was old, but done so tastefully and in such timeless decor. The location is just the best, and one our children will never forget - we walked everywhere - central park, times square, 5th avenue, you name it. We also visited ground zero that was so very sad. We truly knew the World Trade Centers with the 5 buildings and spent so much time in meetings at the Windows on the World Club. Without seeing and knowing the \"before\" I think our children simply saw it as a \"construction site.\"They understand how many lives were lost, but to truly understand the devistation was difficult for them as they saw us with tears in our eyes.", "title": "Wonderful getaway to start the new year", "helpfulness": 4, "user": "nancysellsremax", "date": "January 6, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6557907, "likes": {"liked": "— Location and elegance of hotel", "disliked": "— none"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "Stayed here from Jan. 1st thru Jan. 4th, 2007. While plenty of people were checking in, the wait was less than 15 minutes. The staff is what makes this hotel. They were extremely friendly and helpful. We were given complimentary vouchers for breakfast at Oscars when checking in. The breakfast was a buffet and was excellent. The waiters were attentive to our needs. The room is on the small side but not unusual for NY. We have experienced this at several other hotels in the area. We had no control over the thermostat even though it was a comfortable temperature. The bathroom was small and there isn't a place to leave your toiletry items. Plaster peeling on the ceiling but that is because there isn't a vent to pull out the steam. They delivered the newspaper to our room every morning. The hotel fire alarm went off twice, once in the evening and once about 8:30 am. On the evening alarm, they stated wait for further instructions but never came back with any instructions so we finallly went down 16 floors to the lobby along with other guests. We assumed it was a false alarm even though they didn't say that. The next morning, we ignored the alarm. The location is excellent and that is why we chose to stay at the Waldorf.", "title": "Great Location & Staff", "helpfulness": 2, "user": "Leisure", "date": "January 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6557137}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "myself and my girlfriend stayed at this hotel from 8th-10th dec 2006 at one of the suites.", "title": "a must stay in this famous hotel.", "helpfulness": 4, "user": "stu&jess", "date": "January 4, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 4.0}, "id": 6552644, "likes": {"liked": "— the size of the rooms and the quality", "disliked": "— the price, very very expensive"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "checking in was a bit of a problem as it was rather overcrowded we had about a 15 min wait which wasnt a problem as it was a very busy time of the year, the staff were very pleasant and looked after ourselves.", "title": "Comfort, Location, History", "helpfulness": 8, "user": "happysheila", "date": "January 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6552133, "likes": {"liked": "— The historic background of the hotel", "disliked": "— Price"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "there seemed to be a function on all day every day in every room so we were dodging lots of people dressed in tux`s and ball gowns.", "title": "Over-rated", "helpfulness": 5, "user": "ChristineZac", "date": "January 4, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 6550724, "likes": {"liked": "— Location", "disliked": "— Small room"}}, {"rating": 5.0, "title": "Waldorfn Astoria", "text": "Spent 2 nights in the Waldorf. Was a bit unsure due some bad reviews on this site. Check in was great and our room was excellent, vWe had a King Deluxe andnit nwas deluxe in everynway. The staff we met were very helpful right down to a man who helped me down a flight of stairs with my case when the elevator was being repaired.", "user": "AGGSBAGGS40", "date": "June 25, 2008", "id": 17216961}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Would recommend it to anyone. Try the Hilton.com site for good deals.", "title": "Old and Over-priced", "helpfulness": 1, "user": "blacklucycat", "date": "June 23, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 17152864, "likes": {"liked": "— Location", "disliked": "— underwhelming/outdated"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "I recently stayed at the Waldorf with my boyfriend as a weekend getaway to NYC. We picked the Waldorf because of location and hotel history. Upon our arrival, there was a long check-in line and after waiting, we found out our room would not be ready for another 2 hours. When we finally were allowed to go to our room, it was very underwhelming. The room was tiny (queen size bed) and outdated. The bathroom was small and the tub/vanity/sink was circa 1970s. Around dinner time, housekeeping insisted on scrubbing the outside of our door for five minutes knowing we were in the room... very awkward. The \"luxury\" room did not have simple amenities such as coffee maker/ample electrical outlets/slippers. Overall, we were extremely disappointed. It was an experience I would have expected at a $125 per night hotel vs $500+ night experience.", "title": "You can find better quality for your money", "helpfulness": 1, "user": "Michael666", "date": "June 22, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 17126751, "likes": {"liked": "— The location", "disliked": "— The hotel is over priced, there are better competitors"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "This was the third time I stayed in the hotel and on this occasion I was most disappointed.", "title": "luxurious position", "helpfulness": 2, "user": "catb", "date": "June 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 17042809, "likes": {"liked": "— location", "disliked": "— standard of rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "New York city is unique to the world, and I like staying in uniquely New York hotels when I'm there. The Waldorf definitely qualifies. It has the great lobby, half a dozen food/drink options, and the feel of something old and wise. The lobby is always hopping, which I love. That said, the hotel doesn't do anything super - the rooms are small, some areas are a little worn, they don't always have enough people working the front desk, etc.", "title": "The good and bad of an old school hotel", "helpfulness": 2, "user": "Keithcu", "date": "June 7, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 31767578}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "But, for me, this is so much better than the cookie-cutter hotel experience that you will get at the big chains, even in NYC. When you wake up and stumble into the lobby, you won't forget what city you're in, and that's worth something. The Waldorf gets a thumbs up.", "title": "It Doesn't Get Any Better Than This", "helpfulness": 2, "user": "scmcb", "date": "June 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31578064}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "The Waldorf=Astoria not only lived up to it's legendary reputation, it exceeded it. I have stayed here several times and it has always been a phenomenal experience. On the most recent stay I brought my wife and two young children (6 and 9) up for the kids' first trip to New York.as part of a business trip I was on. The only downside to this decision is that the bar set by the Waldorf=Astoria can never be reached by anywhere else and my kids will now measure every other hotel by this stay. Every staff member is friendly, helpful, enthusiastic, professional and genuinely nice. We had the great fortune of staying in a room that almost defies description - it was beyond elegant. I have also had the pleasure to stay in other rooms which may not have been as large, but were still very luxurious and roomy. I recommend this hotel to anyone who would like to have a real New York, or for that matter, world class, experience. The room rate was an excellent value. The location is great as well - on Park Avenue, a short walk to Grand Central, Fifth Avenue and Times Square. I always look forward to staying at the Waldorf.", "title": "An Old Grand Place...", "helpfulness": 2, "user": "Ruby&Cody", "date": "June 2, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 31425980}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "We just came back from a three-night stay with our two kids. The Waldorf is very different from our \"usual,\" which tends to be more of the boutique, home-style, 4 or 5-star places. The Waldorf is old style. Grand. Old glamour. Traditional. It has some really great features, such as thick walls, heavy real wood doors and furniture, thick gold-colored drapes, real heavy handles for the bathroom door (so it's much easier to open when you have just put lotion on your hands!), door bell and mail slot, etc. The one and only downside is there is no free wi-fi (amazing in this day and age; even at the Hampton Inn there is free wi-fi!). We're glad to have stayed here. Would I do it again? Probably not... but if you haven't stayed here, it's a good experience. We got a really great deal off of their website (pre-paid, no money back, etc.). Comparatively, the price was much cheaper than others we'd looked at. Room service was decent, but super expensive.", "title": "Beautiful Classic Hotel", "helpfulness": 1, "user": "amsharpe", "date": "June 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31342998}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "My family and I chose to stay at the Waldorf due to the history and location of the hotel. Having read the reviews on TripAdvisor I ws confident we would not be disappointed and we were not. Even with its age the hotel was in great shape and our room was very nice. We ended up in the tower on the 35 th floor with a great view of the city. The room had a large well appointed bathroom and VERY comfortable beds. The lobby was goergous and the staff very nice and helpful. Well worth the price.", "title": "SO ELEGANT!!!", "user": "gumbie1118", "date": "June 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31325453}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "This hotel was great, very clean, great customer service. The only downfall was they have a dress code for the lobby after 6:00pm (thats difficult for tourists walking around all day sweating) and no free internet in your room. With the price they charge I believe the internet should be free for guests not for anyone that just walks in the lobby.", "title": "Wonderful", "user": "t-spillers", "date": "September 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 78511580}, {"rating": 5.0, "title": "Visit again", "text": "Great location with a great service . Highlights of all great locations around new york.. Food spcially fresh.", "user": "faizh", "date": "September 6, 2010", "id": 78488656}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "great location in new york. Stayed for a one night get away and would do it agsin. Room was small, but acceptable Perfect loation for shopping,dining and touring.", "title": "great location", "user": "tranquilityoga", "date": "September 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 78282279}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "I stayed with my husband, mother and teenager daughter at this elegant, legendary hotel on Hilton Honors points. The hotel upgraded us to a one-bedroom suite in the Towers Section which was really nice. The suite had a feel of an earlier time but the decor and furniture were lovely. We had a breakfast the next morning which was okay; nothing spectacular. The lobby is simply elegant with the clock in the middle. We always wanted to experience the Waldorf-Astoria and was not disappointed.", "title": "Enjoyed our Stay at this Legendary Hotel; Elegant and Classic", "user": "HelloNewJersey", "date": "September 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 78056755}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Unfortunately, my husband and I only stayed one night in the city before flying oversee's on holiday to celebrate our 10th wedding anniversary. As a Hilton Diamond member, we used points for our stay that also included breakfast. Hilton really takes care of their honor members, and we were very pleasantly surprised with a large, updated suite. We found the room to be gorgeous, spacious and not at all \"run-down\" as I have read in other reviews. The bed was very comfortable, bathroom was huge and plenty of storage. Shortly after check in, we received a lovely bottle of sparkling wine and chocolate covered strawberries and a note from the hotel wishing us a Happy anniversary. This was greatly appreciated!", "title": "a very special anniversary at The Waldorf", "helpfulness": 1, "user": "Memphisbelle70", "date": "September 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77818154}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "The Waldorf and the Waldorf Astoria Tower is our \"go-to\" place in NYC. We are constantly told \"Welcome Back\". I have no idea how they know that. At the Peacock Bar, the Hostess, Crystal Potter, after our first trip there during this stay, not only called us by name, but also knew what we were drinking. I'm a HHonors Diamond guy, but never have treatment like we get at this property. Congratulations to Eric the Manager, and his entire staff for making every trip here feel so special.", "title": "Two Words - Crystal Potter!", "user": "grapdad", "date": "November 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145465131}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Stayed here on points recently. At a cost of 70,000 per night, I expected to be blown away as I was the Chicago Astoria. Not so... the rooms are very very small, average amenities but the bed was very comfortable. As a Diamond member, we were not upgraded period. We were given a coupon for two drinks at the bar and a coupon per day for the Starbucks on site, it provided one small coffee per person. I was more impressed with the location than the actual hotel itself. The concierge was helpful in directing us to local eateries and even made the reservations for us. Other than that, probably should have stayed at the Millennium Hilton at the other end of Manhattan.", "title": "Not quite what we expected.", "user": "Texazstar", "date": "November 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 145349746}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "We stayed at the waldorf during Hurricane Sandy. Flights were cancelled so we had an extra six night stay. it was easy to extend the stay and they didnt rip us off which was good - we heard a few people saying that their hotels had overcharged for the extended stay.", "title": "It was a long stay.....", "helpfulness": 3, "user": "penrosemoons", "date": "November 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 145328199}, {"rating": 2.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Rooms were nothing special but clean, toileteries were refreshed every day.", "title": "Skip it.", "helpfulness": 2, "user": "manzie16", "date": "November 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 1.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 145300652}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We had to have room service due to the storm which despite how busy they were was efficient. Breakfast was expensive but delicious!", "title": "\"old fashioned class\"", "user": "bridget13269", "date": "November 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 145298895}, {"rating": 3.0, "title": "Is this Grand Central station?", "text": "Incredibly large and spacious hotel.", "helpfulness": 9, "user": "serendipit4", "date": "February 18, 2005", "id": 3207307}, {"rating": 5.0, "stay_parameters": "Stayed February 2005", "text": "Over 1000 rooms!", "title": "What a wonderful place to stay in NYC", "helpfulness": 26, "user": "Sander23", "date": "February 13, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3182536}, {"rating": 4.0, "stay_parameters": "Stayed February 2005", "text": "So busy,that the history and 'eminent elegance' is hard to take in at first as one's senses are diverted to negotiating the crowds!", "title": "Excellent Hotel", "helpfulness": 19, "user": "w1ld", "date": "February 10, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3177842}, {"rating": 2.0, "stay_parameters": "Stayed February 2005", "text": "Our friendly and very patient receptionist spent at least 15 minutes getting us the best possible deal. We rang up on the day, following tremendous disappointment with the Hotel Giraffe(see review..if it's published!) and were offered a room @ $309.", "title": "you dont get the room you paid for unless you complain!!!", "helpfulness": 8, "user": "UkFordy", "date": "February 9, 2005", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 3.0, "service": 1.0}, "id": 3175215}, {"rating": 1.0, "title": "Bag stolen", "text": "As we made our way to this thronging hotel, we decided to negotiate what deal we could arrange on a suite. We were not disappointed. For $500, we were offered a 14th floor luxury suite with breakfast. Our receptionist spent a good 15 minutes obtaining the best deal, even dissuading us from the Waldorf Towers as some of the suites there were apparently in need of decoration (not quite her words but we knew what she meant!)", "helpfulness": 8, "user": "A TripAdvisor user", "date": "February 7, 2005", "id": 3167085}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Our stay was enhanced by the fact that we were upgraded on our arrival to the boutique Waldorf Towers at no extra cost. The hotel is usually very busy with business meetings, wedding receptions, graduation parties etc and can appear quite formal and as such may not suit everybody, however this is only a minor gripe and didn't detract from our stay at all. Overall it was a pleasure to stay in such a landmark hotel. Highly recommended.", "title": "Loved the Atmosphere", "helpfulness": 1, "user": "l1n", "date": "June 5, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 3.0, "location": 5.0, "value": 4.0, "rooms": 5.0}, "id": 16691873, "likes": {"liked": "— Atmosphere and location.", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "Loved it!!", "text": "The Waldorf is a traditional style of hotel and probably some of the furnishings in the room are a bit tired looking but overlook that and it is a fantastic experience to stay there. The bed was really comfy and the room very quiet. There was always something happening in the hotel and I could have sat all day in the lobby, people watching. Sir Harry's bar does a mean G & T which was worth the $16. Great location. We bought an open top bus ticket for 3 days and used it like public transport from right outside the hotel. Ate in the Bull & Bear one night and wouldn't really recommend. Great local places for breakfast. Loved New York and thought the Waldorf made the trip really special.", "helpfulness": 2, "user": "mand48", "date": "June 2, 2008", "id": 16610536}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "We booked a 2 bedroom mini suite and were not disappointed. We spent one week here and it was wonderful. Large bedroom, separate living room with a TV in each. 2 bathrooms and large walk in closet. It was all clean and nicely decorated. Check in/ check out was very quick. We were on the 22nd floor but those lifts are so fast it wasnt a problem. The iron in the room was broken but when my daughter reported it a new one was brought within minutes", "title": "The worst nice hotel in the world", "helpfulness": 1, "user": "MTC-BAMA", "date": "May 31, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 2.0}, "id": 16546930, "likes": {"liked": "— location", "disliked": "— everything else"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We had buffet breakfast on morning which was lovely. We also ordered meals from room service twice. Both times it was delivered quickly and was very hot. More than enough food, with all the little touches included.", "title": "Top class hotel!!", "helpfulness": 1, "user": "buddyandmisty", "date": "May 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16516278, "likes": {"liked": "— staying in pure luxury in one of the finest hotels in the world", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Stayed at the Waldorf Astoria in feburary for my 30th birthday as a surpise weekend from my wife. We had an excellent corner room with with windows on two walls. The room was comfortable and of a good size and clean.", "title": "Very enjoyable", "user": "chrispas3000", "date": "May 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 16454233}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The staff are very good and helpful.", "title": "Doesn't get any better ...", "user": "frocha", "date": "May 26, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 16421433, "likes": {"liked": "— Elegant", "disliked": "— Location a bit further from Times Square than we prefer, but not too bad."}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We ate at the japanese restaurant , in the hotel, on the saturaday which was my birthday which was very good with a nice atmosphere .", "title": "Love the Waldorf", "user": "charmm", "date": "May 24, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 16359850}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The location was great we were able to walk everywhere.", "title": "World Class... but worth the price?", "helpfulness": 5, "user": "Cube44", "date": "May 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 16349340, "likes": {"liked": "— Historical significance, great service, perfect location.", "disliked": "— Value for the dollar."}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "There is an elegance to the grand old hotels like the Waldorf and the Plaza that is simply unmatched. So when you get the opportunity you simply can’t pass it up. We came across a great rate (< $350 a night) over this Memorial Day weekend. It was first class all the way.", "title": "This is how it is - Fantastic!", "helpfulness": 1, "user": "corhiain", "date": "May 22, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16319224, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Worst excuse for a \"luxury\" hotel I've ever seen, anywhere, including the Third or Fourth World. aStayed in \"Upgraded\" king room with Hilton Diamond (highest) status. Rooms are extremely dated and in poor condition. Bed and bed linens smelled as if they had not been changed from the last guest, the beds had to be changed twice on check in and the pillows had to be swapped out for new ones. Room was not ready, despite Diamond Status and notification to the hotel upon booking of time of arrival. Carpet was so worn as to be slippery, and indeed we did both slip several times. Very, very loud, even for location. I have lived in and visited Manhattan my whole life, and I assure you there are much better hotels at the price - try the Sherry Netherland or Lowe's Regency. When I was a child in Manhattan this was known as an hotel for business, parvenu tourists, and an \"event\" venue for second rate debutante balls - but I cannot think anyone in even any of these classes would put up with this hotel. If you really think there is something special about this hotel, visit the lobby and the bar - if you need to get your hair done, go the Kenneth's by all means - but for Heaven's sake, stay elsewhere!", "title": "Absolutely Horrid", "helpfulness": 2, "user": "TEXDC", "date": "June 1, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 1.0}, "id": 31311614}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled solo", "text": "I spent one night at the Waldorf last week. I usually stay in another mid-town hotel but for logistical reasons chose to stay at The Waldorf this time. I had a very nice - but perhaps atypical - experience. I booked at superior room but at check in was upgraded to a one-bedroom suite in the Waldorf Towers. Decor a little dated -- but very large and very comfortable. I was on the 33rd floor so not bothered by street noise which can be intense in Manhattan. My room rate included breakfast at Oscar's - a choice between American or Continental breakfast -- breakfast was good and they brought me a nice big pot of tea.", "title": "One night stay - upgrade to a suite in the Towers", "helpfulness": 2, "user": "pcs1", "date": "June 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31285265}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled solo", "text": "The hotel is enormous and obviously caters to a convention/group crowd. The public areas are very nice and they showcase the long history of the hotel. Definitely NOT a boutique hotel experience.", "title": "Grand Art Deco Hotel", "helpfulness": 1, "user": "Billnewjersey", "date": "May 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 30951396}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "Location is terrific - right down the street from Saks and St. Patrick's Cathedral.", "title": "not worth it", "helpfulness": 1, "user": "Alexandre92100", "date": "May 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 30772625}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "All hotels in Manhattan are expensive but with my upgrade this was great value -- and also would have been good value even without it.", "title": "This is my type of hotel !", "helpfulness": 3, "user": "Ellemay", "date": "May 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30714116}, {"rating": 2.0, "stay_parameters": "Stayed July 2008", "text": "This place is totally resting on its laurels. Our room was large, which was about the only good point. The carpet was filthy. There were no slippers so I had to request them. They probably haven't done a thorough renovation of the room since 1970. There were layers and layers of paint on the bathroom door, closet doors, and on moulding, whch also had a nice big piece of blue painters tape stuck to it. The furnishings were tired - there was a hole in one of the lampshades. The bed itself was nice as were the sheets, but the decorative pillows and stuff were practically threadbare. The marble/granite was nice in the bathroom, but you could tell the tub had been refinished about a 50 times. There were a few layers peelng off around the drain. Can't complain about the price since we used Hilton points to stay here but if I were paying anything close to the rack rate, I'd be very annoyed. No way would I stay here again - there are so many nice hotels in NY why waste it on a has been?", "title": "This place is a dump", "user": "esheng", "date": "July 19, 2008", "detail_rating": {"cleanliness": 1.0, "front_desk": 3.0, "location": 3.0, "rooms": 1.0}, "id": 18031497}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Having read the reviews, I must admit I was a bit apprehensive about staying here with my family, particularly given the comments on the condition of some of the rooms from many previous visitors. However, from the second we arrived until the very second we left the Waldorf, the service was excellent. It was my son's 15th birthday whilst we were in NY and I wanted to make it a special occasion. I had e-mailed the Waldorf a few days in advance explaining this and requested a nice room with a view. We were not disappointed. We had a large room (there were 4 of us) with a separate dressing room and bathroom facilities all in very good condition with an excellent view over Park Ave. The Waldorf even sent my son a personal card, some fine bottled water and exclusive chocolates for his birthday. The hotel is something special and people who plan to stay here must remember it is not a modern hotel, This is quite simply its appeal. The reception areas are stunning and the scent from the wonderful flower arrangements is simply lovely. The staff were always extremely helpful and curteous and made you feel very welcome. This is a truly special hotel which offers character and a bit of history which undoubtedly is its charm. I would have no hesit ation in recommending this hotel to anyone.", "title": "Loved it!", "user": "MummyDScotland", "date": "July 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18020853, "likes": {"liked": "— It's overall charm and elegance not forgetting its great location", "disliked": "— Leaving for home!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008", "text": "After reading all the negative reviews about the waldorf I was hesitant to stay. We used points for our first trip there in October 2007 and were delighted with our room, service, tour desk... everything.", "title": "Loved the Waldorf", "user": "dcsae", "date": "July 12, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 17807808}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We returned in May and our room was outrageously large for NY - with huge closet, large bathroom with seperate shower and bath, and a seperate sitting area. I love the classic elegance of the hotel and I must say we loved the Waldorf.", "title": "There are better options.....", "user": "dusty1196", "date": "July 11, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 17790765, "likes": {"liked": "— history, presitge", "disliked": "— room size, location, cost"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Converted Hilton points for my stay so did not pay. Room was very small. By the time we removed decorative pillows and bedspread walking aroudn the room was severely limited. Bathroom very nice. Air conditioner was marginal at best. If it had been warmer outside the A/C would not have been sufficient. Public spaces are gorgeous. For a nearly 80 yr old building it was very well conditioned. Service was fine. I have stayed at the Hilton NY (Ave of Americas) and for the same # of points could have stayed there and had a better room and a better location. It's a great tourist spot but there are better rooms and locations for the money in NYC.", "title": "Pleased with the Waldorf-Astoria", "user": "misterminute", "date": "July 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 17748249, "likes": {"liked": "— Size of the room. View. Clean. Location.", "disliked": "— Front door service"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Impressive hotel especially the lobby areas. The rooms and corridors are more dated and a little worn but the comfort and service makes up for it. Our room had the disadvantage of having a generator running all nights on the roof outside our window but with ear plugs you wouldnt hear it. However at a hotel of this claibre i would have expected double or tribble glazing on the rooms facing this internal lightwell to help dampern the generator noise or sort out the noise form the equipment in the first plave.", "title": "Worth the Experience-very good", "user": "PiFi", "date": "May 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 30510340}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "That aside we had a lovely stay and would defenatily stay again i would just ask for a room well away for that roof in future.", "title": "Beautiful Hotel, rooms vary", "helpfulness": 1, "user": "MCHCA", "date": "May 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 30476029}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "My sister and I were visiting NY and booked the Waldorf 7 months in advance. We arrived at 1 am without luggage as the airline had lost our luggage. The lobby is gorgeous and well maintained. The man at the front desk, I believe his name was Amin checked and found our room had been given away and immediately upgraded us to a luxury suite. He also assured us he would send up toiletries. He was very professional and helpful and such a relief to find someone so helpful in NY! Sure enough he sent up a great pack of all the toiletries we would need. The suite was nice and consisted of a living room, bedroom, front hall, dressing room and bathroom. The furnishings and window shades appeared to be a bit worn but other than that it was very nice. The next night we switched to a normal room which was a corner room overlooking Park Avenue. This room seemed very updated, was very large, had high ceilings and very comfortable. Our parents were also on the trip and I found their room to be a bit dark and also a little outdated and smaller so I think the rooms really vary. I would recommend asking for a corner room. The bathrooms are nice, GREAT water pressure. The actual location of the hotel is great because you are within walking distance of Times Square and Broadway but enough removed to not be in the middle of the chaos. Also being 2 blocks from 5th avenue was nice since we didn't have any luggage! The Bull and Bear Bar hosts the Fox Business Network show \"happy hour\" every weekday so we went and had a drink at the bar and watched the taping which was a lot of fun. We only ate at the hotel for breakfast at Oscars which was very good. Overall I am confident I would stay here again but would request a corner room. Great staff at both the front desk and restaurant.", "title": "beautiful hotel, friendly helpful staff", "user": "dingsam", "date": "May 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30425458}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Looking at the reviews here, I'm surprised.....I found this hotel to be absolutely clean, perfectly furnished, fabulous lobby, hallways to rooms beaufully well maintained and rooms with everything so clean and fresh, it looked as if the room had just been redecorated. Sfaff were consistly friendly, smiling, and helpful. drinks were over priced in the bar but the choice is yours' to drink elsewhere... loved it!!!", "title": "1st class service with excellent facilities.", "helpfulness": 1, "user": "jackson_sprandy", "date": "May 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30338354}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "I recently stayed at The Waldorf Astoria in NYC for a holiday with my now fiancee.I got a great deal for 2 nights through hiltons own website. I had put on my booking form that i would be arriving on my birthday.I thought nothing more of it. From arriving with very bad jet lag and no bags (Grrr British Airways), the staff at the hotel couldnt do enough to make us feel welcome. They pointed us in the direction of clothes stores to purchase replacement clothes which the airline lost and generally made us feel special. On returning to the hotel after a days sightseeing, we returned to our room to find a tray of chocolate covered strawberries and a bottle of champagne with a hand written card from the general manager wishing me a happy birthday and \"if there was anything the hotel can do for you to enhance your stay, please do not hesitate to contact me\". I was so impressed by this hotel and its staff i decided to propose to my girlfriend in the hotel as opposed to elsewhere in the city. It really was that good. I would recommend this hotel to anyone time and time again.", "title": "An old hotel with lots of character", "user": "leighan1980", "date": "May 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30281094}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "This hotel really was fabulous. I was a little nervous after reading all the negatice reviews but I didnt find one flaw with this gem. I only booked for one night on the hilton web site. I used my hilton honors # as well. When I checked in, no one mentioned it, but I had been upgraded to the towers, which is a fabulous hotel within the hotel. We were treated to a one bedroom suite which had its own parlor. The furniture was wonderfully correlated to the time period of the hotel. Dont expect modern funiture in a historic hotel like some of the others who wrote reviews. If you want a modern hotel, NYC has plenty of them. This hotel has a great location, great ambiance, and as far as I noticed, great staff.", "title": "Historic Hotel at its best", "helpfulness": 3, "user": "onejoehill", "date": "September 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8753793, "likes": {"liked": "— Its grandeur", "disliked": "— Certain entrances were closed at variuos times of day"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We stayed at the hotel for 6 nights and found from arriving to checking out the service we received was fantastic. The hotel was just as we had expected - very grand. The rooms were big and easily accomodated two people +many shopping purchases.", "title": "Fantastic Hotel", "helpfulness": 2, "user": "chrisp1", "date": "September 18, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 8751613}, {"rating": 1.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "The 2 bar areas were nice to relax in both before and after a meal. We didn't eat in the hotel as there were more than plenty of restaurants to sample in New York however our only complaint would be that 2 of the restaurants weren't open the full duration of our stay - had we have wanted to use them.", "title": "snobbish place does not worth the money", "helpfulness": 4, "user": "blackszabbi", "date": "September 17, 2007", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 8738042}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Would recommend a visit to The London - Gordon Ramsay restaurant which was fantastic and only a short cab ride away.", "title": "Experience the grandeur", "helpfulness": 2, "user": "Pascal1", "date": "September 17, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 8737257, "likes": {"liked": "— Location", "disliked": "— Breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "For our first visit to New York the Waldorf made us feel very welcome and we thoroughly enjoyed celebrating our first wedding anniversary in such style.", "title": "Waldorf Wows US", "helpfulness": 2, "user": "MariaOttawa", "date": "September 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8715506, "likes": {"liked": "— CLEAN CLEAN CLEAN", "disliked": "— NOTHING"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We have just returned from a fantastic holiday in the USA (Chicago, New York, Boston and then a week on the Cape). New York was our second stop and the Waldorf had a lot to live up to as we had a fantastic stay in Chicago at the Omni Parker (see review) but she did not dissapoint. I had always wanted to stay at this hotel and with the $ being so weak againt the £ this was my chance. We did not want to be disappointed so we booked a jnr suite but on arrival to this magnicant hotel we were upgraded to a full suite. The rooms were huge and the bed was very large and super to sleep in. We had a very large sitting room with all the mod cons you could wish for and a sizable bedroom with great views of manhattan, we could not have asked for more. We did not eat in the hotel, however for a fun night out I would suggest \"Ellen's Stardust Diner\"! in mid town, has to experienced...", "title": "My 2nd Favourite hotel in the world!!!!!!!!!", "helpfulness": 2, "user": "Richard65", "date": "September 9, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8681171, "likes": {"liked": "— room", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled solo", "text": "If Art Deco is your thing, The Waldorf Astoria is the place to stay. Entering the hotel is an experience as you will feel like going back in time to the times of black and white television. You can almost see the filmstars from the 30's walking around.", "title": "A Stay in Art Deco Style", "user": "Sampo_S", "date": "September 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8659483, "likes": {"liked": "— Art Deco Style and superd service"}}, {"rating": 5.0, "title": "We felt special in every way!", "text": "The service is superb and almost everything is within walkin distance. And if you need a taxi you can simply walk out the door and there are taxis waiting for you. Also, The rooms are spacious with comfortable beds.", "user": "Munsterite66", "date": "September 4, 2007", "id": 8656516}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "The Waldorf Astoria was \"all that\" and \"more\". Even though we arrived late (12:15 AM) on one of the buisiest weekends in N.Y., Labor Day, and did not call ahead to explain our late arrival; we were treated with a smile EVEN when I requested a room with a view. After all, my daughter and I had come to N.Y.C. to celebrate her 40th birthday. Our view, from the 9th floor, was of Park Avenue and it was very very quiet.", "title": "One of the best Hilton hotels out there!", "user": "Andriyko", "date": "September 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8618406}, {"rating": 3.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "Not only was the view pleasant, but the room extremely enviting with beautiful furnishings and enterior decor. The beds were the most comfortable ever. We had a dressing room where we could set up our suitcases and ironing board. The bathroom was sparkling. On the ceiling, in the water closet, was a crystal chandalier. It was a hoot!", "title": "A Hilton at Heart", "user": "sse1078", "date": "September 1, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 8601544, "likes": {"liked": "— room", "disliked": "— Small rooms"}}], "location": {"country": "United States", "city": "New York City"}, "stars": 4.5, "variance": {"poor": 503, "average": 930, "very good": 1465, "terrible": 266, "excellent": 2080}, "aka": "Astoria Waldorf", "slim_ranking": 0.554298642534, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "New York’s grandest landmark hotel, the city's first sky-scraper hotel opened on October 31, 1931, and is still delighting visitors with its elegant Art Deco accommodations. This 1,235-room hotel features luxurious guestrooms and spacious suites, 40 meeting rooms (60,000 square feet), three restaurants and bars, retail, Guerlain spa and fitness center."}