{"user_rating": 5.0, "review_count": 1067, "name": "Waldorf Astoria Chicago", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "From the moment we arrived at this beautiful hotel, we felt very well taken care of. Everyone everywhere made us feel welcome and appreciated. Our room was exceptionally clean and beautiful, with every amenity at your fingertips. We especially loved the dressing area with two closets, and the huge wet bar with assortment of drinks and snacks. Room service each morning for breakfast was fast and delicious - our favorites were the fruit plate and eggs benedict. We also ordered room service the night we arrived, we were tired and hungry from driving, and the food was cooked to perfection and arrived quickly. We enjoyed drinks and appetizers in the hotel lounge, which was intimate yet inviting. We didn't have an opportunity to visit the spa, but the hotel elevator stopped on that floor a few times, and each time I peeked inside and wished I had time to book a service during our stay! This hotel is in the heart of Chicago's Gold Coast area. We absolutely understand why this hotel was voted the 2013 traveler's choice for luxury on Trip Advisor last year, and I hope we can stay again soon!", "title": "Perfect Weekend", "helpfulness": 1, "user": "ilona06", "date": "May 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159844168}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Again, a perfect stay of 6 nights in a suite of Waldorf Astoria.... At check in, we were offered to get a coffee maker and a kettle in the room without asking. Also, we were asked when the room service and the turn down service shall be done - it was something I was never asked before in other hotels. The interior, the amenities, the speed of service, the cleanliness, the politeness of staff - all in order and perfect. A real flawless stay - in THE Best Hotel if Chicago, if not the whole US.....", "title": "What a hotel....", "helpfulness": 3, "user": "Peter M", "date": "May 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159841320}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "This hotel was more than we ever dreamed of. We traveled from San Diego to Chicago for a winter vacation. We had always wanted to travel to Chicago and with the amazing reviews the Waldorf Astoria Chicago had, this was the only place we wanted to stay and it was worth every penny! We stayed Wednesday through Saturday and had an amazing time! We used the CTA to get from the airport to our hotel which was cost effective, but sort of a struggle with our luggage. We arrived to the hotel Wednesday afternoon and were greeted by the most amazing staff! We had booked a king suite and were immediate upgraded to a one bedroom suite. The hotel was jaw dropping! We never wanted to leave our room. Our favorite aspects of the room was the fireplace in the room, the bathroom (equipped with a TV in the mirror) and the super comfortable bed. Now to the staff, Edward, the concierge was amazing! He recommended the most amazing restaurants and went out of his way to help us with anything we needed. Thanks Edward! Spa and gym access was included daily and the amenities were just as astounding as the rest of the hotel. During our four days at the hotel, we encountered the nicest staff we have ever come across. The hotel is at a great location! It is walking distance from all of the shops and restaurants. The hotel sits one or two blocks over from the top of magnificent mile and we felt very safe walking everywhere around our hotel.", "title": "Can't wait to return!", "helpfulness": 2, "user": "Brittany S", "date": "May 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159817832}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "The only “bad”, (if I can even consider it that) experience we had at the hotel was the breakfast we had in the restaurant. For both of us to eat (2 breakfast entrée’s, 1 side of potatoes, 1 coffee and 1 water) was $65.00 which we felt was a little over priced for breakfast.", "title": "The Waldorf is beautifully modern, clean and has a wonderful staff!", "helpfulness": 2, "user": "Ljwatson55", "date": "May 5, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 159753883}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Unrelated to the hotel, we decided to take a cab back to the airport, as we were returning to the airport late on a cold Saturday evening and felt safer in a cab. It cost us $45.00 rather than the $10 CTA fare. The staff at the hotel helped us get a cab to the airport and that was a much better experience!", "title": "Perfect experience", "user": "Greg S", "date": "May 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160664002}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Excellent property and flawless service. There are many outstanding hotels in Chicago but this is certainly in the top three. The design is beautiful and one of the most shocking elements is the sound insulation of the rooms. We had a room right near the elevator and over the street but could not hear anything from inside. Wonderful rest. The fireplaces in the rooms add true romantic charm and differentiate the property from any other hotel in the U.S. The suites are simply beautiful. Lucien Lagrange knows how to design the finest residential buildings in the world and this hotel feels like staying in a premier Parisian apartment. If you value design quality and superior service, you must stay here at least once.", "title": "European sophistication in Chicago", "helpfulness": 3, "user": "SearchingUsa", "date": "January 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150841865}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The spa is in our opinion the best in Chicago. Although the design was not perfect, the staff was. The team there and the quality of the services were unrivaled.", "title": "Awesome hotel", "helpfulness": 5, "user": "PatrickfromGP", "date": "January 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150749876}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Minor negative points: The pool is extremely small and the layout appears to be intended for looking at the pool rather than actually getting in it. If more than 5 people are in the pool it feels crowded and uncomfortable. The entry courtyard concept is great, but there really is no main lobby to speak of, so it feels a bit cramped upon first entry to the hotel. This courtyard design also leads to the narrow pool area and spa layout, which are not the best.", "title": "I want to live here", "helpfulness": 3, "user": "Hot_Squanto", "date": "January 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150630503}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The only hotels in Chicago that can compare in quality are The Peninsula, the Four Seasons, and Trump. If this helps you, The Peninsula has a more international feeling and (in my opinion) better food options. The Peninsula has the best pool in Chicago, without question. The Peninsula also has much better windows and use of natural light. The windows at The Waldorf are generally higher from the floor and set back a bit (traditional French architecture) and this is beautiful but makes it a bit darker inside. However, the Peninsula has worse sound insulation and louder rooms. The Waldorf is newer, with better construction quality, and the service is more consistently outstanding.", "title": "Simply The Best", "helpfulness": 3, "user": "Chris W", "date": "January 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150537991}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "All of the above hotels have great locations, but The Waldorf might win again since it is a bit off Michigan Avenue and in a more exciting block of retail and dining. Trump has the least exciting location for immediate walking options and the lowest quality service of the list above, but incredible views.", "title": "Chicago weekend", "helpfulness": 2, "user": "brian122", "date": "January 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 150498111}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "Location is excellent and the staff is excellent. Genuine smiles and willingness to help. Very charming debit and beautiful rooms. I was here for a business meeting and will come back for business and pleasure.", "title": "Outstanding Hotel", "helpfulness": 3, "user": "OzgurK", "date": "August 10, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 171622772}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "I stayed here recently in an interconnecting room with my kids. Top class in every way. The fittings , cleanliness and manner of the place is top notch. Little expensive but you get what you pay for. Its smaller than the other 5 starts , 4 Seasons , Peninsula , Hyatt but suits me great. One minor quibble have never managed to get use of the house car, but then I never booked it just tried to pick it up when going out. Location super.", "title": "Top Chicago Hotel", "helpfulness": 3, "user": "Motorsportenthuisias", "date": "August 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 171439092}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Outstanding hotel with a remarkable responsive staff. We experiences the restaurant, spa, pool and used the hotel internet connection. We were extremely pleased with all of these services. The rooms were exquisitely designed and provided with every creature comfort we needed. I have stayed there three times and it is the only hotel I will choose on any visit to chicago", "title": "Dr.", "helpfulness": 2, "user": "Dr E", "date": "August 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171422603}, {"rating": 4.0, "title": "Solid but uninspiring", "text": "We took two suites at the Waldorf Astoria for three nights in July. The rooms were spacious and well equipped but I found them rather characterless. The controls for the hi-tech lighting were so complicated and seemingly erratic to use that one night we slept with the entrance lobby light on because we couldn't get it to switch off.", "helpfulness": 1, "user": "BQD", "date": "August 7, 2013", "id": 171171117}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Sevice was good throughout the hotel, especially the concierge, but there was shortage of staff at the door. One evening I had to go into the street to hail a cab myself as the only doorman was taking luggage up to someone's room and the concierge was on the phone.", "title": "Um, yeah", "helpfulness": 2, "user": "Allenmuck", "date": "August 6, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 171121443}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "The rooms are elite. I happened to be upgraded to a suite and found it to be both comfortable and high end. Favorite aspects include a comfortable fireplace in the living room, a practical refreshment center with ice stocked for my needs, a very comfortable bed and an unbelievably quiet room (in terms of quietness in a hotel, this is the best I have experienced in 20+ years of business travel). Also, the bathroom rocks. The TV integrated into the bathroom mirror is very cool. I now \"need this\" at home! So... accommodations are elite and top notch!", "title": "Excellent accommodations, so-so for business", "helpfulness": 3, "user": "Andrew H", "date": "April 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 158199941}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "From a business perspective, I would say this property is so-so. First, the mobile reception is spotty. I was there for 2 nights and morning of the next day and consistently had mobile calls drop. The in room phone wasn't much better. The speaker phone volume was painfully low making it impossible to use and the hand set cord was just not long enough to be effective. Made for a long morning for conference calls. The room service cost was over the top... a breakfast consisting of eggs, bacon, potatoes, toast and coffee = $60. I'm used to over the top hotel room service, but I'd call the Waldorf over, the over the top scenarios. However, if you're staying at the Waldorf... your either on business or well off, so the price tag probably is moot.", "title": "elegant and attentive", "helpfulness": 3, "user": "Paulam843", "date": "April 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158418908}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "I also walked out to get a cab in the morning and there was no one to be found outside to help me... if you run into this situation, just walk out the courtyard to the road... and you'll typically see a line of taxis on the right. The area is a little sketchy, so if you don't see them, I'd walk back in and use the Uber app to get a black car for your needs or ask the front desk for help. Note: The 2nd day, I had about 3 people ask if I needed a car... so I suspect the \"more\" vs. \"less\" help is the norm at this place.", "title": "Perfect Stay", "helpfulness": 3, "user": "LakeBluffer1", "date": "April 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158165955}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Beautiful place... not sure I'll be back for business stay.", "title": "Fantastic!", "helpfulness": 3, "user": "crimnole73", "date": "April 18, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 158136382}, {"rating": 1.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Classy, consistent five star quality. Lobby elegant, great location, can walk to top retail and restaurants. Very . attentive staff. Never a problem, have stayed over 20 times....always have a great stay", "title": "TERRIBLE EXPERIENCE", "helpfulness": 2, "user": "Catherine R", "date": "April 18, 2013", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 158198898}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Had an excellent experience. I have stayed at many different hotels in the city and this was the best. They think of the small details which makes for a great stay. The rooms are great, staff is very friendly and it is in a good location.", "title": "Hotel", "user": "Colleen B", "date": "May 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 160660695}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We had two nights here before heading off to Fort Lauderdale and the Moody Blues Cruise.We had a very pleasant stay, but for the money I expected a little more, the room was spacious and very clean, nice large bathroom, double sinks huge tub and shower, comfortable bed. The staff were super friendly, really went out of their way to help you and wouldn't accept tips. I didn't have a problem with this hotel but have stayed in better properties for the money.", "title": "Comfortable stay", "helpfulness": 1, "user": "Sheffgal", "date": "May 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 159311175}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled solo", "text": "Overall stay was good. Room was not ready and was not until 1pm. Hotel staff did not seem to be tech savvy. I don't want a call when room is ready, email is sufficient. Hotels hallways were noisy and noise permeated to room. Bed was extremely uncomfortable. Low quality mattress. Felt like I was sleeping at a Hampton Inn.", "title": "Chicago-Waldorf Astoria Stay", "helpfulness": 1, "user": "RRoagers", "date": "April 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 159136816}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "We stayed 4 nights at the waldorf in chicago as part of our honeymoon across northern America. We are staying in some lovely properties over this trip, however this is my favourite. We stayed in a suite, it's decor is subtle and classy, we loved the fire in the longue area and the bar facilities. The staff are so helpful and friendly if you have any questions and were only too happy to help. This hotel is smaller than many of its competitors within Chicago and it gives a personal touch to its customer service. The pool and spa area were also excellent. I cannot recommend this hotel highly enough and it added to an amazing visit to Chicago.", "title": "Quite simply brilliant!", "helpfulness": 5, "user": "EAK79", "date": "April 25, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 158809377}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Wow. We had a beautifully appointed room that was a shame to leave for dinner. If we didn't have a reservation at Hugo's, we probably would have ordered room service! The bed was so comfortable that it was like sleeping on a cloud. Althought the hotel is situated on the north end of Michigan Ave., it was nice to visit the Oak St. and Chestnut boutiques instead of Water Tower Place and Northbridge. It's a terrible shame that RIA, the Michelin-rated restaurant, has closed it's doors because our meal was incredible and Dan Pilkey, their sommelier, made our dining experience one to remember.", "title": "Waldorf Chcago", "helpfulness": 4, "user": "MelisBD", "date": "April 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 158787016}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "Pure elegance. Been looking forward to a stay here and my wife and I escaped from the kids for a night downtown. We live in Chicago so this is all about the hotel. Who cares about going outside! Fireplace, amazing shower and super spa. Haven't eaten here yet but I am sure it is amazing. Didn't get an upgrade as I was hoping but the hotel is booked. Oh well. It is pricy but the no gratuity policy both saves money and fits the hotels style.", "title": "Feels like a European retreat in heart of Chicago", "user": "Joe S", "date": "January 19, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 150063564}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Just stayed at the Waldorf on another business trip and they fully lived up to their reputation! Friendly and accomodating service along with world-class accomodations - everything you would expect from a hotel of their caliber. If you are looking for the best place to stay in Chicago, the Waldorf Astoria is it hands down!", "title": "Redemption!", "helpfulness": 3, "user": "Jeff S", "date": "January 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 149948420}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "This hotel is one of the best hotels in Chicago. It is like being at home. It is extremely quiet, never a busy lobby and elegant in every way. Each room has a fireplace and the decor was very pleasing and tranquil. We would highly recommend this hotel and the location is absolutely perfect!", "title": "Excellent hotel accommodations with an excellent staff!", "helpfulness": 3, "user": "Debra S", "date": "January 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149913224}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "I just completed a survey the hotel sent me and will repeat: Beautiful hotel, outstanding room/suite and Excellent staff! Life is short; everyone should stay at the Waldorf at least once. This is a real luxury hotel. Gorgeous lobby with stunning chandelier and marble floors. We had a huge suite with balcony, fireplace, microwave,refrigerator, freezer with ice. Even had a tiny tv in the luxurious bathroom- how great is that!.Suite was in pristine condition with comfortable bed, lovely soaking tub with very nice bath amenities and soft towels. It felt like a luxury apartment/condo and I told the staff we were moving in permanently! Turn down service every evening consisted of complimentary bottled water and a card with next days weather report. Hotel is in an excellent location, just couple blocks to Michigan Ave, close to 900 Shops and Water Tower Place. Near lots of great restaurants on Rush Street. One of the best perks is ability to use their friendly and gracious drivers for visits within 2 miles (based on availability). All the staff we encountered from front desk, door attendants, concierge, drivers and housekeeping were pleasant and professional. A special thanks to Martin who checked us in and was so very welcoming and helpful during our stay; and to Al the excellent concierge who went out of his way to track down a magazine I asked for (above and beyond the call of duty and truly appreciated!) and to our personable and friendly driver, Joe, who we enjoyed some short rides with. Door staff and front desk always greeted us with a warm smile when we returned to hotel and it made us feel very welcome. We travel fairly frequently for business and pleasure and this was one of our best hotel stays, ever! A very memorable visit.The Waldorf Astoria Chicago rocks! We can't wait to return.", "title": "Top Notch Stay at the Waldorf Astoria", "helpfulness": 7, "user": "FloridaTravelerG", "date": "January 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149839766}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "I came to the hotel with the highest expectations of any 5 start hotel. My girlfriend and I stayed 2 nights, both of which the pool and bar were not functioning. We were directed to a pool a block away; I mean this is Chicago in January people.. Our first night there we were told the bar was out, at this point I felt like half the hotels amenities were not working. We were told an engineer would come to the suite and take the sound system from the bedroom to the living area, never happened! We also told someone would come up with buckets of ice, that took 3 phone calls to get. No one mentioned a comp or anything, only a few extra bottles of water at checkout. I'm not much of complainer but this wasn't what I expected at all.", "title": "Birthday stay", "helpfulness": 2, "user": "tisco113", "date": "January 16, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 149819820}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "This is a very nice quality, upscale hotel in a great location in downtown Chicago. You are only steps away from the Magnificent Mile, Water Tower shops, Hancock building and the Rush/Division area that has great restaurants and bars. The staff was incredibly friendly. There was always someone to open the door for you when entering and exiting the hotel. We needed extra glasses in the room and they gave us options for the type of glass and delivered them immediately. We also needed an email printed and it was at the room within minutes. It's a clean hotel and was very quiet also. Even though you pay for valet of your car, the bell hops and valets do not take tips. We splurged on a King Luxury Suite and it was amazing! Overall a great stay!", "title": "Upscale hotel, no pretentiousness", "helpfulness": 5, "user": "schpatzdc", "date": "April 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158672410}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Great stay, amazing service, wonderful spa, beautiful rooms, fantastic location, good food. We went for a Chicago staycation. Enjoyed massages at the spa and a lot of relaxing. Highly recommend! We will be back.", "title": "Waldorf Chicago is Amazing", "helpfulness": 4, "user": "Larry F", "date": "April 23, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0}, "id": 158793870}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "First Class all around. Every need met during our stay. Room amenities were impecable. It is always nice to enter a room and find your every need met including your own ice maker and ice box completely stocked with your bevererag needs. The dining experience was excelent from presentation to completion. Breakfast was a great start and the creative dinner menu on Sunday was out of this world. If you like wine the manager has done his homework vast selection for every price and taste. This is a must stay hotel when in Chicago, whether your alone or with a whole family this hotel will meet all of oyur needs.", "title": "Family Reunion", "helpfulness": 3, "user": "David S", "date": "April 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158793848}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "What an amazing experience. Staff top notch and so helpful. Love the courtesy car that is offered. The suites are spacious and very comfortable. Spacious closet and drawer space. Unbelievable bathroom and the spa FANTASTIC. It was also nice to have a fireplace and bar set up that included a microwave, ice that you do not have to run down the hall to get. Top notch!!!", "title": "waldorf chicago", "helpfulness": 4, "user": "jack5511", "date": "April 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158412244}, {"rating": 2.0, "stay_parameters": "Stayed April 2013", "text": "I decided to meet my friend in Chicago to celebrate her 35th birthday. We checked in on Friday and the hotel was beautiful and the lobby staff was wonderful. Unfortunately, on Saturday, housekeeping did not come until 4 pm and since we just returned from shopping all morning, we just asked her to just refresh the bathroom and provide more towels. Around 10pm, we started smelling cigarette smoke in our room (it is a non-smoking hotel and I'm pregnant) so they sent risk management to our floor and found out who was smoking- I assume the party next door. The front desk offered to switch rooms, but they only had a king suites available with only king beds. We figured since they already rectified the situation we didn't have to move at 11:00 pm.", "title": "Nice hotel but not worth the money!", "helpfulness": 3, "user": "ShellyWeb", "date": "April 21, 2013", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 158387745}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "Just the name \"Waldorf Astoria\" evokes images of aristocratic elegance and this property certainly lives up to that. The design is quite stately and modern. Rooms are very very spacious. The location is fabulous as its only 2 streets off of Michigan which makes it a 3 minute walk to some of the best shopping in the world. By the way, there is no Buffett breakfast but hey that would not be very aristocratic now would it :-)", "title": "Distinguished elegance.", "helpfulness": 1, "user": "GlobalSwagger", "date": "August 5, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 170802076}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "I've stayed at this hotel twice and I just love it. The staff is terrific, not because they have to but it appears that they genuinely want to make your stay great. I love the suite style rooms, plenty of room but still warm and cozy. The conference center is just as good, including the food and service.", "title": "No need to stay anywhere else in Chicago", "helpfulness": 3, "user": "LandJRI", "date": "August 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170768639}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "like fo to vacation and very nice place like have pool spa night club go to", "title": "that beauty", "helpfulness": 2, "user": "carmen409", "date": "August 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 170435697}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "shomping i want to small like go to nice restuarant nice bar. i waht go to working out i have nice lobby have to go walk like to go gimm i wan to see old chicago aiso town", "title": "Not a true five star caliber hotel", "helpfulness": 4, "user": "Gp1748", "date": "July 31, 2013", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 170209583}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "After reviewing many options, we chose this hotel for a very special getaway. To be fair, there was a lot about it that was very nice. We were assigned a personal concierge, Andrew, who worked very hard to get us everything we requested. He went above and beyond and made sure that ww had everything that we asked for. The rest of the service at the Waldorf Astoria did not live up to the standard he set. For instance, he offered us a delivery of complimentary French press coffee every morning. A nice touch but on the first morning we were delivered regular coffee and charged for it. After pointing that out, the charge was removed from the bill. However, the next morning, we were delivered French press coffee for one person. The third morning, we didn't get any coffee until we called after waiting one half hour past the scheduled delivery time. They sent up regular coffee and were going to charge us again. In short, they turned a very nice gesture into an irritation by poor execution. It was the same with inconsistent housekeeping services, bar stocking services and spa services. While our room was beautiful, there were areas where our carpet was noticeably stained. The bed, while comfortable, had really scratchy sheets which upon request were switched out leaving one to wonder why not just use the good sheets to start with in the gold coast suite. To be clear, these are obviously small things, but it's details like this that separate hotels of this ranking and price. In short, it was a high end Hilton hotel but was not in a league with other first rate hotels.", "title": "Appropriate to rave about this hotel", "helpfulness": 4, "user": "AbqWizard", "date": "July 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170064602}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "My wife and I love Chicago and have stayed in many fine hotels. Thus was our first time at the Waldorf Astoria, but won't be our last. We expected a beautiful property, and it didn't disappoint. Every detail was beautiful, and not a speck of dirt anywhere. But what really blew us away wad the service!", "title": "Best hotel experience in Chicago!", "helpfulness": 1, "user": "Calif0rnia_traveller", "date": "August 14, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 172191316}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We checked in late and Sophia at the front desk was very apologetic that the only rooms left had two queen beds instead of a king. She offered us a credit for breakfast and said they'd move us the next day. Not necessary for just a bed type, but appreciated anyway. She then took us up to our room instead of just pointing us to the elevator.", "title": "Our 25th Wedding Anniversary", "helpfulness": 1, "user": "Douglas C", "date": "August 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171987507}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The first room with two beds was beautiful, with a huge bathroom with a nice soaking tub. The next day while we were out they moved us to a beautiful one bedroom suite. Wow! It was amazing!", "title": "Found our home away from home", "helpfulness": 2, "user": "Dagnasty2", "date": "August 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171972941}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "Again,I can't say enough about the service! We felt like VIPs the whole time. And no one took tips! We will be back !", "title": "Outstanding service", "helpfulness": 2, "user": "AnnMarie1202", "date": "August 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171869966}, {"rating": 5.0, "title": "One night", "text": "My wife and I recently visited from San Francisco to celebrate our 25th anniversary. Starting a few days before our arrival with a welcome email from our concierge, to the immaculate suite that we enjoyed, to the complimentary ride down Michigan Avenue to the architectural boat tour in the Waldorf's Lexus, to all the pampering we received in the Spa and by the staff overall, the Waldorf went to great lengths to make our anniversary exquisite. The property is new (only 4 years old), very elegant and clean, and with all the amenities and comforts one could want. Also a great location near North Michigan in the Gold Coast area, with great shopping a block away. Staying there is definitely pushing the \"Easy\" button and, without question, we will definitely stay there again on our next visit to Chicago!", "helpfulness": 3, "user": "Patrick C", "date": "August 10, 2013", "id": 171671559}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Cannot say enough wonderful things! We spent Saturday night and had a wonderful time. We had reserved one suite and our other room was upgraded to a suite. It was our 27 year old son's birthday, and the room made the Chicago trip even more special.", "title": "Wonderful property, and service to match!", "helpfulness": 1, "user": "Champaign1", "date": "February 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151406414}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The quality of this hotel is pervasive throughout!", "title": "Stunning Hotel!", "helpfulness": 4, "user": "p0tter32", "date": "February 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151243985}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Will definitley be back. Thank you.", "title": "Price is a little high, but they overwhelm you with all the amenities! My family really enjoyed the stay.", "helpfulness": 3, "user": "Thomas D", "date": "February 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151203704}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "The Waldorf Astoria is a stunning hotel in a wonderful location! We had a very spacious room with sitting area, fireplace, and a beautifully stocked bar complete with ice. The property is one of the best locations in Chicago. During our stay, we walked a few short blocks down the street for afternoon tea and all the shopping one could want.", "title": "Exceptional Room with Hilton Service Level", "helpfulness": 5, "user": "peterbnewyork", "date": "January 28, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 150897535}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "I cannot say enough regarding the impecable service. Everyone, from the staff at Bernard's Bar, to the driver of the hotel car, did an outstanding job!", "title": "Spectacular", "helpfulness": 2, "user": "Jkratch", "date": "January 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150860732}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled solo", "text": "The WAC merits its high ranking as a luxury hotel, but it's the people that make it a place I'd recommend without reservation. Everyone always (without exaggeration) was smiling, friendly and helpful, and unpretentious about it (a key component, in my opinion, to staying at a place you are calling \"home\" for a short time;and often lacking at high-end properties). WAC still has their no-tipping policy (confirmed by the front-desk person who showed me to my room) and the philosophy behind this is evident throughout. Even small annoyances (such as a beeping fridge that had to be reset by maintenance because housekeeping had left the ice drawer open) are made inconsequential when promptly handled with an apology and a smile.", "title": "Stellar Staff", "helpfulness": 4, "user": "Linda80504", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150424629}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "Everything was beautiful. Restaurant was very accommodating to our special needs. Location was close to shopping and good restaurants, but the next block over was rather seedy and uncomfortable for walking.", "title": "Luxury in Chicago", "helpfulness": 1, "user": "savta2007", "date": "January 23, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 150367621}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "The spa is gorgeous and well managed by Kerry Strokes. Kimberly's fitness classes are worth planning your day around. If you want friendly and great service at Balsan, ask for Kelly. Arland, the house car driver, is a pleasure and a lifesaver during Chicago's cold winter.", "title": "True Five Star Luxury.", "helpfulness": 3, "user": "Sarah R", "date": "January 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150278385}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "I stayed here last weekend with my boyfriend in celebration of my birthday. Being from Chicago, it takes a lot for us to feel like we're on vacation in our own backyard - but this did the trick!", "title": "Outstanding Rooms!", "helpfulness": 3, "user": "hollyx113", "date": "January 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150198650}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "All I have to say about the room was WOW! We stayed in the Gold Coast Suite. Everything, from the beautiful fireplace to the bathroom mirror television, was visually stunning. I never wanted to leave!", "title": "Almost", "helpfulness": 2, "user": "midwestsmiths", "date": "January 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 150115123}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "I have traveled to many states and stayed in a lot of hotels and never have a had such a great experience! The staff was overly courteous and seemed to enjoy doing thier job. I found it using the internet and it was rated as the most romantic hotel in Chicago. I definitely agree. The service far exceeded expectations. They really went the extra mile to provide top notch service. The room was fantastic with large bathtub, shower and fireplace in the room. Outstanding. You need to try this hotel", "title": "Simply fabulous", "helpfulness": 2, "user": "Beth D", "date": "July 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170059756}, {"rating": 5.0, "title": "Great hotel and perfect location!", "text": "Would definitely recommend the Waldorf Astoria - luxurious hotel and perfectly situated close to the magnificent mile for easy access to the best shops and restaurants! Staff were friendly, rooms were spacious and views from the rooms are great. Wifi was super fast. Whilst there, definitely make a trip to the John Hancock building for dinner at The Signature Room. Also great to go for a run in the morning, alongside Lake Michigan. Sprinkles cupcakes are just around the corner!", "helpfulness": 3, "user": "Shayna C", "date": "July 30, 2013", "id": 169978117}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "The Chicago Waldorf is ok but not great. Maid service might or might not happen. Breakfast room dark. Before we arrived we told them one of our children is allergic to dairy so they brought up buttered popcorn. The best part of the hotel is the spa which is very nice.", "title": "Hard to find a good hotel in Chicago", "helpfulness": 1, "user": "William M", "date": "July 29, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 169839304}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "I am a corporate relations director for a large IT firm and we host reception/dinner events all over the country. We had our annual dinner function for 200 guests on the 23rd of July and The Waldorf made it effortless for me. The staff from beginning to end were fantastic, creative and responded 24/7 to any questions I had. The night was seamless, the food was excellent, well presented and enjoyed by all. We had the Sommelier suggest wines for us and they were perfect. Do not hesitate to make this the venue for any function you may be having whether it is corporate or personal. You will most certainly be impressed. We also had a 16ft ice carving raw bar which was over the top. The local company we used was \"Art Below Zero\"... worldclass, anything you could imagine they can put together for you... Again the Waldorf worked with my vision, enhanced it and delivered without a hitch. Thank you Waldorf for making me look so good. See you again next year.", "title": "200 Guests: Not A Problem For This Property", "helpfulness": 4, "user": "alexisev", "date": "July 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169181077}, {"rating": 5.0, "title": "Just amazing", "text": "Just like very other review, WHOA, I might even say this is the best hotel we have stayed in, the service was excellent (and the no tip policy is fantastic for someone unfamiliar with the US tipping system), the rooms were brilliant, we were upgraded to a suite and the size was similar to a small unit!", "helpfulness": 2, "user": "neiljrodgers", "date": "July 26, 2013", "id": 169173914}], "location": {"country": "United States", "city": "Chicago"}, "stars": 5, "variance": {"poor": 9, "average": 50, "very good": 89, "terrible": 9, "excellent": 910}, "slim_ranking": 0.0481927710843, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "description": "The AAA Five-Diamond Waldorf Astoria Chicago(formerly The Elysian Hotel)is located in the heart of the prestigious Gold Coast neighborhood amognst the Magnificent Mile and Oak Street famed restaurants, retailers and lakefront. The award-winning 188-room hotel through innovative services and technologies, creates a new experience in luxury – energetic and fashion forward, warm and welcoming, and fresh and engaging. Amenities include a 14,000 square-foot spa & health club; 4,500 square feet of private event space; European-inspired bistro, Balsan; haute bar Bernard's."}