{"user_rating": 4.0, "review_count": 468, "name": "Walt Disney World Swan and Dolphin", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "We have stayed at this property many times, and it just seems \"tired.\" The carpets in the halls, the out of order hot tubs,housekeeping that really did very little to the room, the ducks in the pool that shut it down for hours on end...........it all needs a bit of a face lift and new attitude.", "title": "Guess It's Getting Tired - Time to Revamp", "helpfulness": 2, "user": "Beth B", "date": "October 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 180526556}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "I love staying at Disney properties normally but this visit they just seemed very blasé about things - no sense of urgency to take care of people at the Guest Relations kiosk right by the Epcot entry off the Boardwalk for one instance.", "title": "Great location, great service", "helpfulness": 4, "user": "Carey C", "date": "October 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180404058}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We loved the hotel restaurants though. Blue Zoo rocked with their great app, Shula's with wonderful bar service and football games and on and on.", "title": "Excellant location for Disney Parks!", "helpfulness": 2, "user": "donna c", "date": "October 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180392183}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "My husband and I just returned from a 3 night stay at the Dolphin. As we are Disney Vacation Club members, we usually stay at the Boardwalk or one of the other DVC properties; however, this time we were not able to book the Boardwalk and wanted to stay within walking distance of Hollywood Studios as we were running in the Tower of Terror Ten Miler. The hotel was beautiful, the grotto pool was fantastic, and our room left nothing to be desired. I had booked a resort view room with a balcony--when we checked in, we were offered an upgrade to an Epcot fireworks view room, but elected not to take it as it had 2 queen beds instead of a king. Our resort view room looked out on the Boardwalk, Epcot, and the Hollywood Studios--it was stunning! We were pleasantly surprised to have an unobstructed view of the Epcot fireworks every night as well. Because we were there for a race, we did not eat in any of the upscale restaurants, but Picabu suited us well.", "title": "Great property for the money", "helpfulness": 2, "user": "Sympatica_RI", "date": "October 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 180263116}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "My one complaint is the mandatory resort fee. Although the fitness facility at the Dolphin has a full-time attendant and is very well-equiped, virtually all hotels have a fitness facility, pool, and many offer free internet. I felt like we paid $17 daily for 2 bottles of water. Come on, Starwood! This is a RESORT AT DISNEYWORLD. Just increase the room rate by $17--it would feel more honest and create fewer bad vibes. I loved the hotel, and would recommend it to anyone who wants to be near the parks, but just shake my head at this poor PR. After reading many reviews of the hotel, I have not seen one that saw the resort fee as a positive thing.", "title": "Amazing hotel for Honeymoon!", "helpfulness": 4, "user": "Rodrigo P", "date": "October 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 180236913}, {"rating": 3.0, "title": "Expensive for an old hotel", "text": "I just spent 5 days at the Dolphin for a conference with thousands of other IT pros who all travel pretty extensively. The general consensus among everyone in our group was that the hotels were clean and comfortable, but waaaaaay over priced for what you get. Both properties are in desperate need of updates (worn tile, worn carpet, dated fixtures,", "helpfulness": 1, "user": "K311yC00k", "date": "October 10, 2013", "id": 180533932}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "We stayed at the Swan for 3 nights and were very pleased with the location of the hotel. It is in a great location, however, the prices for food are very expensive. It would have been nice to be able to pay \"normal prices\" for breakfast instead of $21.99. I was happy that we were able to take the boat to Epcot or Hollywood Studios and we were also able to walk to Epcot if we wanted to. The pool area is really pretty. The staff were very accommodating and always willing to help where needed. I would return, however, I wish they would reconsider their prices and offer some more reasonable options for dining.", "title": "Nice place to vacation", "helpfulness": 1, "user": "qtmama", "date": "October 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 180635151}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "Booked a family room with king-size bed. Upon arrival, room was unavailable.", "title": "PRESIDENTIAL SUITE!!!", "helpfulness": 4, "user": "anon73", "date": "October 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180617343}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "Waited for 20 minutes at the Gold counter for them to sort everything out.", "title": "Dolphin Resort", "user": "Jean C", "date": "October 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180606691}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Was told we are getting a \"nicer room.\"", "title": "The Swan hotel at Walt Disney World is great too!!", "helpfulness": 1, "user": "rjdan", "date": "October 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180557517}, {"rating": 2.0, "stay_parameters": "Stayed October 2013", "text": "HOLY MOLY!!!", "title": "The little touches and details need to be better.", "helpfulness": 3, "user": "nocmas", "date": "October 10, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 1.0, "service": 4.0, "rooms": 2.0}, "id": 180535826}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "I am here for a conference, and was a little wary given some of the more recent, less than positive reviews. However, this is an exceptionally clean, beautiful resort, well located, and judging from the many happy families I've seen so far, another Disney winner! Check-in was super fast, and I received a conference rate for a room on the 3rd floor, with a balcony overlooking the courtyard fountain. Love having the option of keeping my balcony door open to hear the fountain! The room is very, very clean. The bathroom is a bit small, but very clean. Huge closets with lots of hangers! I was missing a desk chair in the room, but a quick phone call, and one was delivered within minutes. Very large work space, large flat-screen TV, and little nooks in the room I know my twins would love. I've wandered through both the Swan and Dolphin, and all employees encountered have been kind, smiling and helpful. I think the air conditioning in the room may shut off when you open the balcony door - a reasonable energy-saving safeguard in my opinion. Lots of dining options with spectrum of prices, and excellent room service menu with very reasonable child's menu prices. Can't wait to return with my family!", "title": "Beautiful Resort", "helpfulness": 3, "user": "ilona06", "date": "November 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 185251708}, {"rating": 2.0, "title": "No way this is a Starwood property", "text": "Wow, this hotel (at least my room) is VERY dated, dingy, and dark. I am SHOCKED that this is a Starwood property. I'm here for work, so I can't comment on the Disney resort benefits. Hotel rooms are seriously in need of a major renovation!", "helpfulness": 5, "user": "Jennifer S", "date": "November 19, 2013", "id": 185248531}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "I stayed at the Dolphin for two nights and wasn't dissatisfied, but wasn't left feeling overly appreciated or valued. I had a quiet room overlooknig their beach and pool area. It did show signs of wear and could use some updating. The cleaning staff did an average job cleaning and attending to my room. The rooms were close to the convention area so it was a short walk each morning, which was convenient. If this property was located off Disney property, it would be $100 a night room, but because of the location they charge well over $230 per night on weeknights. For that price, I will pay a little more and stay at the nearby Waldorf and expect the top of the line service and attention to detail.", "title": "Not overwhelmed, but not disappointed", "helpfulness": 2, "user": "VegasStrip", "date": "November 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 185196673}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "This hotel is in a great location for our nearly annual visits to the Epcot Food and Wine Festival. We enjoy the fact that it has really good restaurants, 24 hour room service plus the benefit of disney transportation and extra park hours. The pool area is huge and has not been crowded any time we've been there. We always get a room with a balcony which makes it even nicer. We've actaully been twice this year. Once with the family in the summer and then again to the festival in the fall.", "title": "Love the Dolphin", "helpfulness": 3, "user": "cats12", "date": "November 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 185182833}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Had a wonderful stay here, the room was large and comfortable (the bathroom is slightly cramped). Very comfortable beds, although more than one easy chair would have been nice. Great links to Disney and very good restaurants on site. Staff were cheerful and very helpful, special mention must go to Vicky the concierge. Unfortunately the Pool was closed during our stay but you could use the Dolphin's Pool", "title": "Brilliant Hotel", "helpfulness": 1, "user": "VAM1", "date": "November 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 185178796}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "Upon arrival we were graciously greeted by Gus the bell man. He grab our pile of bags and promptly got them on a cart. We had also ordered groceries to the hotel. He retrieved them quickly and made sure the cold items stayed cold while holding them. The staff at the front desk was also very pleasant. The first room we were assigned had a horrible musty smell. Gus called the front desk for us. Within 5 minutes we were on our way to another room. This room did not smell. We had the 2 bedroom sweet which was enormous. There is no kitchen, but a small sink and refrigerator with counter tops. One room had 2 queen beds with a nice size bathroom. The other room had a king with sofa bed and a tiny bathroom. The living room area also had a king bed and bathroom. The hotel has a nice pool with water slide for the kids. You walk across the way to the Swan. It is also a short walk to Epcot and Hollywood studios. There is a boat that leaves hotel and heads to both places. There is also free shuttle service which runs to the parks. It did get a bit crowed in the morning, but the busses came every 10-15 minutes. The line was a bit unorganized, but for the most part people squeezed on the bus. I would not recommend paying top dollar for the sweet as it is really just 3 rooms joined together, I think we could have done without one of the rooms and saved the extra money. Overall the hotel is clean, nothing fancy, but in a great location and decent rate if your not paying for the 3 room sweet.", "title": "Good location, great staff", "helpfulness": 5, "user": "doms1214", "date": "October 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 180031754}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We've stayed at the Dolphin and Swan three previous times, although it had been a few years since the last visit. Celebrating our 25th anniversary gave us the excuse to indulge ourselves and not stay at one of the lower end Disney resorts. At check in we were happy to hear our room was ready and given the choice of either an upper or lower level room. We opted for an upper floor, expecting a view of either the resort's grounds or even better, EPCOT. Sadly our 10th floor room had a view of rooftops and storage areas, but we were here for one night only and that was to sleep and shower, not gaze out our windows. The room itself was pretty spacious, two double beds with updated furnishings and bedding. The wet bar area was nice, featuring a mini fridge, ice bucket, complimentary water bottles and Starbucks one cup coffee maker. The separate shower/commode was tiny. I am not a large person, but using the facilities made me feel a bit claustrophobic. In closing the resort has a truly spectacular pool area, with hot tubs, pools and cavern like waterfalls. A vacation within a vacation. We will return!", "title": "Wonderful amenities and a short walk to EPCOT", "helpfulness": 5, "user": "Sharon34657", "date": "October 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 179974440}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Best family experience in Orlando! Disney was so much fun for the whole family. Swan hotel was very clean, nice, and big.", "title": "wow", "helpfulness": 6, "user": "Tom R", "date": "October 6, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 179953615}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "Pool area is gorgeous! I recommend it over All Stars hotel for sure! It's newer and cleaner. I didn't like my stay at All Stars 2 years prior to this trip. But Swan was excellent!", "title": "Good customer service, spacious rooms", "helpfulness": 2, "user": "AandS_Norcal", "date": "October 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179935242}, {"rating": 5.0, "title": "Perfect hotel,perfect location", "text": "Stayed here for business. Beautiful hotel, could see epcot fireworks from my room. large rooms, convenient to conference rooms (which were kept way too cold though). Liked the \"green\" option to have restaurant credit or starwood points instead of housekeeping for a day. Only complaint was that the room keys are way too sensitive in getting demagnetized- had to go all the way back to lobby each day to have keys re-swiped.", "helpfulness": 4, "user": "travelor146", "date": "October 6, 2013", "id": 179922723}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "I stayed here for 2 weeks in September 2013 - with my wife. We had a great stay - I couldn't fault it - room was large 2 queen size beds - good view of the sister hotel the dolphin from our large window. Was kept very clean every day. Very nice shower/bathroom with additional basin dressing area outside the bathroom that was great for a couple first thing in the morning.", "title": "Swan - what a great place to stay.", "helpfulness": 5, "user": "Sibbo61", "date": "October 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180190260}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Never had to wait for a lift - 4 lifts serving our area.", "title": "Suites Available - More Space But Not A Relaxing Experience", "helpfulness": 1, "user": "TravelinLeather", "date": "October 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 180123302}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "Breakfast buffet was of a very good standard with very friendly staff.", "title": "The Swan is for everyone young at heart !", "helpfulness": 6, "user": "totomau", "date": "October 7, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 180049426}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "The biggest bonus for this hotel is its position for the boardwalk /Epcot and Disney studios - all within a very nice walking distance. Or you can take the boat.", "title": "Swan & Dolphin is one of the best hotels in Disneyworld", "helpfulness": 7, "user": "TurtlemomMiami", "date": "October 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180046979}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "We have been to the Disney area many times over the years and this was a very nice way for a couple to do it - Children could stay here with no problems - but during our stay we didn't see many children .", "title": "Swan & Dolphin- The Perfect Staycation Getaway!", "helpfulness": 7, "user": "ClairePagan", "date": "October 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180037791}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "We have seasonal Florida resident passes and go to Disney a lot. We enjoy Epcot and Hollywood Studios best among the 4 parks and so look for lodging in the Epcot area. I can almost always manage to find the best room rates at Swan or Dolphin and we enjoy the more \"adult\" feel of these resorts (still with plenty of fun to attract children.) We find the rooms uniformly comfortable and have always had good service with no complaints. I don't think you can ask more from a hotel, especially when the price is something less than half what you'd pay at the hotel right next door that doesn't have any more amenities.", "title": "Swan and Dolphin, best deal at Disney", "helpfulness": 3, "user": "FloridaTravelmum", "date": "October 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180670403}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "The hotel has two parts, Swan in one side and Dolfin in the other, we stayed in Swan, the rooms are good, we have a swimming pool view, there are a couple of swimming pool in there, service is good and price is acceptable to be inside Disney area, you could take either ship or shuttle to disney parks, the only defect is lack of restaurants inside, no choice at all, but still we had a good time and recommend it.", "title": "So close to Disney", "helpfulness": 4, "user": "thomaswong416", "date": "October 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 180649639}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "This was our second stay at the Walt Disney World Dolphin and it didn't disappoint. You can't beat walking into Epcot...wonderful location. Even the bus to the Magic Kingdom was prompt and quick. There were two casual restaurant choices which were adequate but wish there had been more casual choices. The social hour at the lobby bar is quite nice...you're able to sample two wines for $5.00...real bargain and very pleasant chatting with the bartender. Quiet rooms, comfortable beds and Starbucks coffee in the room...another pleasant surprise! Would stay here again in a heartbeat!", "title": "Great Location", "helpfulness": 6, "user": "SandyY615", "date": "October 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180637509}, {"rating": 2.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "This hotel, like the Swan, is a Starwood property. A higher grade hotel anywhere else, but on the Disney resort it pales in performance against the other true Disney EPCOT offerings. The hotel lacks the charging privilages and free Magical Express airport transfers of the neighboring hotels.", "title": "Misses the mark of the Disney Experiance", "helpfulness": 1, "user": "NH-Family-Fun", "date": "October 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 180636376}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "Our room was older and had a musty smell. The windows did not operate. We heard the elevator all night long eventhough we were on the 11th floor and a couple of doors away from the elevator. The hotel has no {or few} balconies to appreciate the Florida weather.", "title": "Short but very sweet", "helpfulness": 2, "user": "BRIAN F", "date": "October 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180636083}, {"rating": 3.0, "title": "Just meh...", "text": "Stayed here for a week for our anniversary while visiting the Disney parks.", "helpfulness": 4, "user": "andrew R", "date": "November 18, 2013", "id": 185031785}, {"rating": 3.0, "title": "dirty", "text": "The good", "helpfulness": 4, "user": "cyntul2no", "date": "November 17, 2013", "id": 185010459}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "-location - it's a short walk to Epcot with free, efficient shuttles and boats to all other parks.", "title": "Perfect Location for a Disney Vacation", "helpfulness": 3, "user": "Wedgewood", "date": "November 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 184996519}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "-hotel facade - gorgeous hotel exterior, lobby and grounds, very clean property", "title": "comfy, cozy...", "helpfulness": 1, "user": "teddythompson", "date": "November 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 184993850}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "-pool - big, open 24/7", "title": "Happiest place on Earth has the Friendliest Staff in the World", "helpfulness": 1, "user": "busitravels13", "date": "November 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 184979405}, {"rating": 4.0, "title": "Wonderful hotel in wonderful location", "text": "I would give the hotel 4.5 dots if I could. The location and the surroundings of the hotel are beautiful. You can walk to the Boardwalk, Epcot, and much more.", "helpfulness": 3, "user": "Split2112", "date": "November 16, 2013", "id": 184908946}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "The only reason I didn't give it a full 5 dots is because the rooms were a bit dated and could have used some better upgrades (like more places to charge devices).", "title": "Wonderful Family Vacation", "helpfulness": 1, "user": "lynngacy", "date": "November 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 184883341}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "The wifi worked flawlessly and the staff was very friendly.", "title": "Our home away from home", "helpfulness": 5, "user": "RobertaW3", "date": "November 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 184833017}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "To be honest, as a family vacation hotel, I think it is easily 5 stars. As a business hotel, 4.5 stars.", "title": "Beware the Bus Transportation to the Parks", "helpfulness": 2, "user": "pat60", "date": "November 15, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 184815564}, {"rating": 5.0, "title": "\"MAGICAL\"", "text": "The Dolphin and Swan are great properties for a family vacation. Central location to all parks with complimentary transportation. We especially enjoyed our breakfast at Fresh restaurant with scrumptiuos omelettes by Glenn and Louis the wonderful chefs. We thoroughly enjoyed our stay.", "helpfulness": 2, "user": "Split2112", "date": "November 15, 2013", "id": 184811977}, {"rating": 3.0, "title": "Probably nice in the 1980s, but not for this decade!", "text": "This hotel is REALLY tired. The woodwork and decor are straight out of the 1980s, and not in a good way. Service as good and has a Westin heavenly bed, and the location is great if you're going to Epcot. The only reason to stay here is if you are willing to sacrifice a modern hotel for convenience to Epcot.", "helpfulness": 4, "user": "crsWashington_DC", "date": "November 18, 2013", "id": 185145430}, {"rating": 3.0, "title": "Clean, but dated. Epcot-friendly.", "text": "The Swan and Dolphin are two large Westin-operated properties that still have Disney resort benefits, including complimentary Disney park transportation and fast-pass ticket upgrades. They are both very large and starting to show their age.", "helpfulness": 4, "user": "2pctmilk", "date": "November 18, 2013", "id": 185112782}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Built at the end of the Miami-vice era (1990), the color scheme reminds the guest of said era, and the hotel owner seems to be adamantly sticking to it (fresh coats of teal and pink paint were being applied on arrival).", "title": "Loved it", "helpfulness": 1, "user": "Libanyu Y", "date": "November 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 185109650}, {"rating": 4.0, "stay_parameters": "Stayed November 2013", "text": "He rooms were clean, and large enough. The Disney Boardwalk is very convenient. There is a mandatory resort charge of $20 for wi-if and long distance. Buffet breakfast is available but expensive at $25 per person.", "title": "Best location, nice stay!", "helpfulness": 2, "user": "bethinwashington", "date": "November 18, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 185084308}, {"rating": 1.0, "title": "Please somebody remodel me!", "text": "Had a fantastic vacation here with my wife and 3 year old daughter. Was a very comfortable hotel with fantastic access to all of the disney parks. A wonderful choice of restaurants with many more to choose from at Epcot, only a 10/15 minute walk away.", "helpfulness": 3, "user": "PatrickBoyhan", "date": "November 18, 2013", "id": 185062579}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 26, "average": 84, "very good": 134, "terrible": 16, "excellent": 208}, "aka": "Walt Disney World Swan And Dolphin Hotel", "slim_ranking": 0.346504559271, "description": "Walt Disney World Dolphin resort is located in Walt Disney World by Epcot and Disney-MGM Studios, with Magic Kingdom and Disney's Animal Kingdom Park nearby. Our hotel has free area transportation."}