{"user_rating": 4.0, "review_count": 939, "name": "Walton Hall & Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "A beautiful old stately home, we were a little disappointed to be staying in a new block in the grounds. Most of the rooms in the main house were being refurbished & our room was brand new, very modern with great flat screen TV, excellent shower with different settings, etc. The only problem was when it rained as you did have to go outside to get between buildings. The restaurant was a wonderful old room with high ceilings, old paintings, etc. On our first night it was not a great experience (although the food was excellent) due to the restaurant & bar being taken over by very loud, drunk, corporate clients. The second night was much better. This hotel does cater for a lot of companies, so best to check before you book a romantic break! Lovely grounds & nice, helpful staff. A good location for exploring Stratford-upon-Avon & surrounded by beautiful countryside. I think when all the refurbishment is completed it will rate excellent. Just confirm if you want to be in the main house not a new block. A good pool, spa, etc, with free towels.", "title": "Great location, shame about the corporate clients!", "helpfulness": 4, "user": "hazelha", "date": "October 1, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 5897401, "likes": {"liked": "— Lovely historical house", "disliked": "— Loud, drunk, corporate guests"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "We have just returned from a 2 night break and wished we had booked in for the week. We contacted the hotel directly after seeing an advert for special deals.As we have children we have trouble finding suitable hotel accommodation and usually resort to travel inns.We were offered a 2 night break with breakfast for 2 adults 2 children and a baby.We knew from the website that the hotel is in the middle of major refurbishment and was assured that it wouldn't be problem.", "title": "NIce surprise", "helpfulness": 3, "user": "boofyloo", "date": "September 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5876162, "likes": {"liked": "— The setting and the history of the area", "disliked": "— Leaving"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "On arrival we were handed our key to a room in the main house which is a beautiful gothic building in the middle of acres of green land with a lake and it's own church in the grounds.On arriving at our 'room' we discovered a huge 2 bedroom apartment with 2 bathrooms,kitchen area and living room.The view out of the huge windows was of the countryside and gardens.Ok so the apartment is due for a refit i.e wallpaper dated one of the showers not too powerful.But it was immaculately clean,one of the first things I check for.", "title": "Best wedding anniversary", "helpfulness": 3, "user": "steph14", "date": "August 25, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5709465, "likes": {"liked": "— Everything", "disliked": "— Going home"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "The staff were lovely and very attentive in spite of being very busy with a wedding.The breakfast was great with the usual English fry up,cereals,fruit and croissants and all served in a lovely high ceilinged dining room.My only regret is that when the property is finished we probably won't be able to afford to stay here,and a couple of extra nights would have enabled us to have used the spa area more which incidently was also very clean and friendly.", "title": "Poor value for money", "helpfulness": 2, "user": "NigeH", "date": "August 24, 2006", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 5.0}, "id": 5703834, "likes": {"liked": "— Location", "disliked": "— Lack of basic standards/cleanliness"}}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 58, "average": 128, "very good": 297, "terrible": 37, "excellent": 419}, "aka": "Barcelo Walton Hall Hotel", "slim_ranking": 1.0, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Four-star Walton Hotel is set in 65 acres of glorious countryside overlooking a lake, yet is within easy reach of the historic towns of Warwick and Stratford-upon-Avon. Discover Shakespeare in Stratford-upon-Avon and medieval history in Warwick Castle, then explore the beautiful Warwickshire countryside before enjoying the collections in the Compton Verney Art Gallery. Offering a peaceful retreat it has 130 bedrooms, including 6 premium rooms in Walton Hotel."}