{"user_rating": 4.0, "review_count": 18, "name": "Warkworth Lodge", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Our booked B & B had to cancel our booking due to bereavement in the family.So had to book here during my travels. What a lovely surprise when we arrived and saw our studio. This was very nice with small kitchen,table chairs for eating. Chairs for relaxing,good shower and most importantly good bed.We were the inside end unit of Studios ( see Photo ) Even had chairs outside to have a glass of wine in the evening. So I was surprised to read other reviews.Re noise etc. ( we are not use to noise at home ) so quite sensitive to it.No problems at all. We were amazed how nice inside the main house was. Quite upmarket the lounge area.( free Internet PC.) Nice big kitchen with all equipment / utensils to cook plus plenty of crockery and glasses. I thought the next building down towards the road is a Police station. ( me thinking good for security ) Another reviewer said rooms for the lodge ?", "title": "Lovely Surprise", "user": "Barry-Jang", "date": "June 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163058014}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled solo", "text": "Warkworth is a good place to see all the surrounding area. Some fabulous spots to visit, our favourite was Tawharanui Regional Park. Anchor Bay is great.( see review ) Warkworth has all the main shopping you require including 2 of the Big supermarkets. Good cafes for coffee,we liked ''Gingers'' Would recommend Warkworth lodge to friends.", "title": "Relaxed Hangout", "user": "Raf1966", "date": "March 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 154569366}, {"rating": 5.0, "title": "Would love to return", "text": "Stayed here on my own for a couple of nights, whilst at a local conference. It's a big old house, with creaky floor boards and high ceilings. It feels more like a home that a hotel, with a very large living room, where you can laze around on the big sofas or pop outside to the swimming pool area (more a pop in pool than length bashing). There is a big kitchen, so you can cook your own food if that grabs you or make yourself a cup of tea. It's homely in nature and has the air of a faded beauty.", "user": "sfh36", "date": "March 8, 2013", "id": 153992374}, {"rating": 4.0, "stay_parameters": "Stayed January 2013", "text": "The room was petite but big enough for a bed and couple of armchairs. I was in the Blue room, which was on the highway side..can be a bit of a hum from the relentless traffic scooting up SH1 but is quiet at night. The bed was comfortable but nothing too exciting. The bathroom was small but adequate, with plenty of towels and a decent shower.", "title": "Well located close to restaurants and shops.", "helpfulness": 1, "user": "frankiethe", "date": "January 21, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 150207229}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "There are a few cafes close by (Chocolate Brown is worth a detour) but otherwise all the action is at the beaches.", "title": "Busy road junction", "user": "Lisa M", "date": "January 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 2.0}, "id": 148991340}], "location": {"country": "New Zealand", "region": "North Island", "continent": "South Pacific"}, "stars": 3.5, "variance": {"poor": 1, "average": 5, "very good": 9, "terrible": 0, "excellent": 3}, "slim_ranking": 1.0, "description": "Boutique Motel in the Heart of the Village. Warkworth Lodge opened in 2007 and is one of the top motels located in the centre of Warkworth. Our suites vary from modern self-contained motel units to character villa rooms. Our sunny and spacious environment has a fantastic pool and barbecue area to sit and relax. Enjoy a weekend away or a relaxing holiday by the pool. Located on the doorstep of our many beautiful beaches, a great selection of vineyards, cafés and restaurants. You will enjoy the comfort of the luxury lodge, with the convenience of being in the centre of Warkworth’s beautiful village. Enjoy the spacious Villa Lounge that over looks the pool & relax by the fire in the winter, and free wi-fi. Celebrations are welcome: Weddings, Birthdays, Family gatherings & Conferences. Matakana Village is 5 minutes drive away. Daily Wine Tours leave at 12 o clock to explore the many Matakana vineyards"}