{"user_rating": 4.0, "review_count": 767, "name": "Warwick Le Lagon Resort & Spa, Vanuatu", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "I have just returned from Le Lagon. My sister and I stayed there for one week. We had incredible service from the front desk to the F&B Hotel Manager and all the staff in between. It was a place where we made friends and can't wait to return for another holiday. Our room was very comfortable it could sleep up to 3-4 guests, so whether you are a small family or just a couple there was plenty of space. We enjoyed eating out at the restaurants, and as my sister and I both love Japanese food, we were delighted with the Wild Ginger Restaurant and Bar, and the Sushi and Tepanyaki dishes. We lazed by the pool most days always in a different spot, and had to try the swim up bar and order a cocktail. The staff come to you for drink orders which was great, everyone made us feel very welcome. There is absolutely nothing Le Lagon haven't thought of. We watched the rugby in the lobby, took frequent trips into town which was only 700 vatu. approx $5 AUD by taxi. If you have kids then this resort is a must. We found that the resort was big enough to cater for all, even when we wanted some quiet time to ourselves. We can't wait to visit again. Thank you Le Lagon for a fantastic holiday!", "title": "Simple Stunning - and what wonderful hosts!", "helpfulness": 4, "user": "megatt", "date": "November 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120897011}, {"rating": 4.0, "stay_parameters": "Stayed November 2011", "text": "My family and I stayed at the Le Lagoon from the 30th of October to the 5th of Nov! We fell in love with Vanuatu just a magical place and only a 2 and a half hour flight fantastic for kids!! I am not a fussy person as long as where I am staying is safe and clean oh and of course a poolbar lol iam happy! To be honest I wasn't over impressed with Le Lagoon the service was very poor and some of the staff seemed not overly happy to be their!! But in saying that it didn't stop us from having a wonderful time, a holiday is what you make it!!! There were some highlights staying at the Le Lagoon such as being right across from Erakor Island a must do for dinner!! There is a jetty just down from the resort where a Boat will pick u up and take you over! If you go after 4.30pm the boat will not charge u! 5.30 pm is the best time to go over to see the most stunning sunset ever!!! They even screen kids movies at nite on the beach which the kids love!! Buffet breakfast was awesome at Le Lagoon and yes there is plenty of fresh fruit, lunch around the pool is lovely and the location is perfect!! Places for dinner outside the resort are The Chill which is located upstairs next to the 24 hour food markets! Lucy who is English runs the restaurant is so lovely! Their pizzas are amazing very reasonable and there cocktails ROCK!!! Also the Water Front which is on the harbor it's a hut looking building on your left hand side going into town from the resort!! Great for drinks and they do an amazing lobster and coconut curry crab!!!! Only exchange enough money for your first nite there you will get a much better rate then here!! Goodies is the exchange place and they are all through town. Rate when we were there was 95 vatu to 1 aus dollar! Taxis are painful is it hard to get out of the resort without being harrassed pay only 700 vatu to get in town no matter how many people are going then get a bus back when your ready which will be 150 vatu each! The buses are just vans on the number plate there will be a B for bus and T for taxi! Do not pay and more the 10,000 vatu for a taxi to take you on tour like blue lagoon, hide away island and the falls they will try and rip you off!! Kids club is amazing all the staff in there ROCK!!! Buy drinks and nibbles at the super market and book your tours in town you will save lots of money!! Well I hope this has helped u", "title": "A relaxing holiday!!", "helpfulness": 10, "user": "GoldCoastBella", "date": "November 19, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 120798451}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Reading some negative reviews of the hotel, we were very surprised when we arrived at Le Lagon. What a nice hotel and facilities! And the location ... With its private lagoon location for guests only. You cannot ask for more. Everything is caterred for guests' enjoyment. Great hotel for kids. Our 7 years old boy had great time at the Kids club. The swimming pools are also children' friendly. What can you ask more for a family holidays. The only area for improvement will be the bedrooms which are a bit dated for a 4 stars hotel (will have expected better bedding and less wear out furniture - more upmarket).", "title": "One of the best hotels in the island", "helpfulness": 6, "user": "Corinne R", "date": "November 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 120562914}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "My Mom and I stayed at the Warwick for 6 days and had a very relaxing holiday. The positivies of the trip were: The staff were lovely, the location was amazing, the pool was outstanding and just so perfect to relax by, the rooms were spacious and quite clean and the food at the Wild Ginger restaurant on site was great. However, we experienced a few issues while there: during our last 24 hours we didn't have any hot water, the staff were not able to help and didn't seem too concerned by this, there were kids everywhere and trying to relax by the pool was difficult with kids screaming all over the place, a cruise ship came in one day and a number of people of the ship came to the resort (at least 20 of them) a few were really drunk and just inappopriate, the food at the buffet was sub standard, even by Vantuatu standards.", "title": "Lovely location, average hotel", "user": "Carlslou", "date": "November 13, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120554662}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Overall, the location and facilities of the Le Legon were very nice but there are a lot of areas that they could improve on.", "title": "Very Average", "helpfulness": 4, "user": "earl_mike", "date": "November 11, 2011", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 2.0, "sleep": 2.0, "rooms": 5.0, "location": 2.0}, "id": 120453380}, {"rating": 5.0, "title": "Nice relaxing holiday", "text": "I have just returned from 6 days in Vanuatu staying at the Warwick Le Lagon Resort and Spa for a friends wedding, I took my sister and 7 year old nephew for their first overseas trip. Having stayed at the Warwick in Fiji in March of this year I am expecting the same set out, this resort was slightly different, I found that the staff although where very friendly were not like the people of Fiji, and they get compared to the Fijian people quite a lot. The room here was fantastic, we had a garden superior room and it was huge, set out fantastically and big for the amount you pay. The food at the buffet was amazing, we ate at the buffet every night, and the food was sensational! I have always heard that Vanuatu is very expensive, so I was really trying to work out before we went, what the best option would be, we ended up going for the all inclusive package, this included, breakfast, lunch, dinner, local beer, wine, spirits and also soft drinks, this cost 10,000 VUV per day, which is approx $150 AUD per day at the time which we went. You can organise the all inclusive when you get there and you can pay by cash, it works out cheaper that way then to organise it through your travel agent. Each day ate at the pool grill bar for lunch and it cost us for 2 x steak sandwiches and 2 x cokes 4,400 VUV, the cocktails will cost from 1,200 VUV up to 1,900 VUV each. I was also really worried about spending money, the souvenirs in Port Vila are very cheap, sarongs are $4.70 AUD and cheaper. If you want to travel into town take a bus it will cost you anywhere from 300 VUV - 500 VUV which is $3 and $5 respectively. You will be charged a 3% surcharge at the resort for credit card purchases plus your bank will also charge you 3%. Overall we had a fantastic relaxing trip. If you would like to ask any questions feel free to contact me :)", "user": "Liss83", "date": "November 10, 2011", "id": 120406552}, {"rating": 5.0, "title": "Tropical Paradise", "text": "Me and my boyfriend have just come back from our 1st time in Vanuatu and stayed at the Warwick Le Lagon for 6 nights (not long enough) and had an absolute ball. The hotel was great and am glad we made the choice to stay here. The people and staff were all so lovely and friendly. We stayed in a Garden Room, probably one of the cheaper rooms but it was fine for us and we were up on the 2nd story with a lovely balcony, perfect for a few drinks and a game of cards. Originally I was looking for accommodation that was kids free however I found we got more value for money by staying at the Warwick which included a full buffet breakfast daily (where as a lot of the other resorts that are kids free only supply a light continental breakfast) and as my partner loves to eat, the full buffet breakfast was a must and to be honest the kids were not a problem at all. The atmosphere of the place was lively and fun not dull and boring. I prefer Vanuatu to Fiji and stayed at The Westin in Denaurau Fiji a few years ago and The Warwick was way better for atmosphere and just heaps more to do and also had a great swim up pool bar where as Fiji didn't have that. Of an evening they would have a different buffet theme night, the Tex Mex buffet on the Thursday night was of a very high standard, better than your Taco Bill, which I can't stand. Food was amazing!", "user": "IslandGal79", "date": "October 31, 2011", "id": 119920355}, {"rating": 5.0, "title": "Perfect Getaway", "text": "Its also easy to get into town either via bus or taxi, we just took a taxi for 700 vatu (which is $7). There are a heap of places to eat in town and we ate once at the Waterside Bar and Grill right on the water and had a great meal. What I also like about Port Vila is there is no bartering and no-one harassing you and the town has a reasonable variety of shops. Nadi in Fiji was horrific, dirty and just the constant harrassment by locals really put me off, but you don't get that in Vanuatu. The Warwick is close to Port Vila so you have that easy option of leaving your resort and heading into town, which wasn't so easy in Fiji.", "user": "mkc83", "date": "October 25, 2011", "id": 119731779}, {"rating": 4.0, "title": "geoffp", "text": "Would definately recommend the Cascades Waterfull (absolutedly stunning) and the Buggy Fun (where you drive around in buggys and go offroad and then taken to the blacksands beach and then on for some kayaking and snorkelling with lunch included, heaps of fun. Most tours can be organised from your resort or you can arrange a taxi to take you however I prefer an organised tour that way it includes lunch and staffed by locals who can give you a running commentary of the history etc and were reasonably priced too.", "user": "geoffrp88", "date": "October 24, 2011", "id": 119654972}, {"rating": 5.0, "title": "Vanuatu is stunning !", "text": "The only complaint I could make is that on our last 2 days at the resort our room didn't get serviced in the morning, however once we got back to our room at midday or so we'd just ring housekeeping and then they'd come and service the room which was no big deal. Also I found at breakfast it was really hard to get the waiting staff to serve you cups of tea/coffee, or they'd give you your tea without the water and then you'd be waiting a while for your boiled water. This sounds silly I know but that's all I can think of to fault the place on. Will definately return, who knows maybe for my wedding or honeymoon just need the ring on the finger 1st!!", "user": "EnjoyingLifeToMax", "date": "October 20, 2011", "id": 119502740}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Had a 6 night stay at Le Legon from 15 Dec 2011. 2 adults and 2 kids aged 4 and 10.", "title": "Mixed feelings", "helpfulness": 9, "user": "Australians_Abroad", "date": "December 24, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 122054717}, {"rating": 4.0, "stay_parameters": "Stayed December 2011", "text": "We have been to Vanuatu before, and stayed in a different resort, but were swayed by the kid's club reviews. Our girls are not regularly \"left\" but they thought that they would like to try - we even selected school holidays to be sure of companions. It was a mistake. Great aircon facilities and nice carers to suit the 4 yr old. You pay VT1000 per child to use the purpose build outdoor playground, but that is for the entire stay. However, despite the ads on the website, there was really nothing for my older girl to do and no one to play with. We worked out that the pre-teen/teens were staying around the pool and being left to their own devices by their parents. Not something we were happy to do.", "title": "Nice resort. Friendly staff. Good value.", "helpfulness": 1, "user": "MK-Bris", "date": "December 24, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 122053502}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "The free kid's dinner at 5:30 is a wonderful idea. Provided the child is 5 or older you do not need a babysitter, otherwise they are only VT300 per hour. The girls could eat dinner from either the kid's menu or the buffet, go for a night activity and then watch a movie while the adults ate on/away from the resort.", "title": "Second Time Around", "helpfulness": 2, "user": "JaneT255060", "date": "December 14, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121720421}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Went by taxi to Hideaway Island VT3500 return from the resort and the driver came back at a prearranged time. Tours can be cheaper, however they can also be cancelled, and you don't get to select your timing. Food at Hideaway Is was very poor (gone downhill from last visit) expensive, and so slow (even by Vanuatu time).", "title": "Disappointed", "helpfulness": 9, "user": "Ben A", "date": "December 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 1.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 121659991}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Took the taxi driver's mobile number and called him a couple of days later to go to Turtle Bay. If you have children over age 8 who are capable of snorkelling - thoroughly recommend. Take yourself, don't take a tour. We negotiated VT8000 return, and the driver stayed at the resort while we were there. There is an entry cost of VT1800 per adult and VT 600 per child. No charge under 5. Snorkelling with 70 yr old turtles cost VT1200. An organised tour for 4 costs in excess of AUD200. Turtle Bay not heavily advertised though they are starting with accommodation. It is a Turtle sanctuary and on a sunny day you could easily spend the day swimming and enjoying the sandy beach. Ample shade huts provided.", "title": "Nice very Nice", "helpfulness": 2, "user": "D00gle", "date": "November 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 121158487}, {"rating": 4.0, "title": "4 days at Le Lagon, October 2011", "text": "We stayed at Le Lagon for 4 days from 5 October to 9 October, and would recommend Le Lagon for families with children to 15 years.", "user": "leighofsydney", "date": "October 16, 2011", "id": 119350658}, {"rating": 3.0, "title": "Extremely Disappointing", "text": "The Kids Club is quite good, with a planned activity each day (sometimes several activities in a day) as well as craft and creative activities. Our 4 and 7 year old girls especially enjoyed grass skirt making.", "user": "Lisatait", "date": "October 16, 2011", "id": 119341014}, {"rating": 5.0, "title": "Loved it!", "text": "The buffet evening meals are generally good (we took the buffet option for Melanesian night - Wednesday - and Seafood night - Friday). The seafood night was excellent and thoroughly recommended. We avoided Tex Mex (Thursday) and Curry (Saturday) nights.", "user": "megb05", "date": "October 12, 2011", "id": 119207177}, {"rating": 5.0, "title": "great place and will return", "text": "Lunch options are a bit limited and not quite up to the standard of the buffet or the excellent breakfasts. On a couple of days we skipped lunch completely and didn't suffer for the experience!", "user": "Amber M", "date": "October 10, 2011", "id": 119165269}, {"rating": 3.0, "title": "Disappointing", "text": "We ate one night at Wild Ginger restaurant at Le Lagon...it was nothing special. If you want a special night out it might pay to look outside of Le Lagon.", "user": "JacquiAGoldCoast", "date": "October 8, 2011", "id": 119063628}], "location": {"country": "Vanuatu", "continent": "South Pacific", "city": "Port Vila"}, "stars": 4.5, "variance": {"poor": 37, "average": 126, "very good": 262, "terrible": 22, "excellent": 320}, "aka": "Warwick Le Lagon Resort & Spa, Vanuatu Hotel", "slim_ranking": 0.551020408163, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Warwick Le Lagon Resort & Spa Vanuatu is situated on 75 acres of exotic tropical gardens on the edge of the pristine Erakor Lagoon. Promising some of the finest accommodations in Vanuatu, Warwick Le Lagon Resort & Spa is the ideal place for your Vanuatu Holiday. The resort offers 140 guest rooms ranging from Classic rooms, Garden & Lagoon Superior rooms, Garden and Lagoon Bungalows, to four luxurious over-water Island Suites."}