{"user_rating": 4.0, "review_count": 925, "name": "Warwick Seattle Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "Great place to stay if you're looking to be in the heart of the downtown festivities. We had a room with a view of the space needle (very cool). We walked from the hotel to Pike's market and to the shopping district. Both are just blocks away. Ralph's Grocery & Deli across the street is very convenient (and they sell Lambic). We went to a Marines game on Sunday. It wasn't too bad driving to the stadium and parking (15 bucks to park). Overall, the Warwick is a nice place (bathrooms are kinda small). We would stay there again, but also look at the abundant other hotels nearby just for some variety.", "title": "location", "helpfulness": 3, "user": "jason330i", "date": "July 28, 2006", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5522496}, {"rating": 5.0, "stay_parameters": "Stayed July 2006", "text": "This hotel was an absolute gem. Small, but great service. The room was not huge but certainly adequate, clean and comfortable. Ask for a room on a high floor and get a great view of either downtown or the Space Needle.", "title": "Gem", "helpfulness": 3, "user": "gefilte63", "date": "July 18, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 5480853}, {"rating": 4.0, "stay_parameters": "Stayed March 2006, traveled on business", "text": "Best of all was the attentive staff. Concierges were friendly and helpful. The shuttle drivers also went out of their way (literally) for us. They will take you to the Victoria ferry and pick you up as well. Very convenient.", "title": "A pretty good value", "helpfulness": 8, "user": "Southeast12", "date": "May 20, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 5183115}, {"rating": 4.0, "title": "Good Alternative", "text": "Would recommend to anyone!", "helpfulness": 8, "user": "chap4", "date": "May 10, 2006", "id": 5048703}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "I visit Seattle frequently. Sometimes for 1 or 2 days, sometimes for longer. If you are staying for only up to 2 nights, it is not worth it, especially after this hotel raised its rates lately. For you, I would recommend the Ramada a few steps away. But, if you are staying for a longer time, this is perfect. Especially with families. There are some fancier hotels in town but the Warwick would satisfy most families, especially the more expensive suites! The swimming pool is a bit dark and the balconies are acually just big step out windows, but there are views and the location is perfect. As for the small restaurant, dont go there, it is overpriced and does not have much to offer, there is much better food in Downtown.", "title": "Comfortable and very convenient.", "helpfulness": 9, "user": "Kitsilano", "date": "April 18, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 4986577}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The Warwick is a perfect location for those who like very comfortable surroundings, a friendly and helpful staff, and close proximity (walking distance) to Pike Market, shopping of all kinds and performances at the Paramount, Moore or Jazz Alley.", "title": "A perfect location", "helpfulness": 1, "user": "topsie2", "date": "November 21, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6161969, "likes": {"liked": "— The fantastic location coupled with wonderful amenities.", "disliked": "— Parking fees."}}, {"rating": 3.0, "stay_parameters": "Stayed November 2006", "text": "On a whole our stay at the Warwick was pretty nice. I think the best part of the hotel is the location (walking distance to most attractions downtown) and the fact that they are a little cheaper than most other hotels in the area. If you go, don't expect a large fancy hotel. Request a high floor (7th or higher) for a view. The food and room service aren't really that great but there are some eating options that are very close.", "title": "Great Location - Nothing Really Fancy", "helpfulness": 1, "user": "cruzca", "date": "November 18, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 6149407}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Arriving from Staten Island, NY, we stayed at the Warwick in September, 2006, pre-cruise to Alaska, for 2 nights. We were celebrating our 25th Anniversary on the day of our arrival. The people at the front desk, the concierge and the restaurant were wonderful.", "title": "Enjoyed the Warwick very much...", "helpfulness": 1, "user": "Capskys", "date": "November 17, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6139106}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The Brasserie Margaux Restauant was excellent and we were so pleased that we had decided to have our anniversary dinner there. Chef Zarkdes knew it was our anniversary, the food was so delicious and he made sure that we had exceptional service from his best waitress, Janice.", "title": "Good Location,Poor Cleanliness", "helpfulness": 1, "user": "5634", "date": "November 14, 2006", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 5.0}, "id": 6128053, "likes": {"liked": "— view of the space needle", "disliked": "— poor cleanliness"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006", "text": "Charlotte, the concierge, was really helpful with booking our bus tour of Seattle and a car to the Cruise Ship dock.", "title": "Warwick was a great choice!", "helpfulness": 3, "user": "marygone", "date": "October 26, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 6014699}, {"rating": 4.0, "title": "Good Hotel...Needs some improvement", "text": "Stayed for 3 days in March. Great location...clean...reasonable rates...very friendly staff. Easy walk to to many attractions...Ralph's Market across the street is excellent.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "March 17, 2006", "id": 4629350}, {"rating": 4.0, "stay_parameters": "Stayed February 2006, traveled on business", "text": "Some negatives though. Noisy heater fan in room...seems like a lot of rooms have this problem. PPV movie channel had terrible picture. Lots of interference on screen. Staff alerted but couldn't fix it. Pool is small but OK. 3 out of 4 aerobic machines in fitness centre broken!", "title": "Good hotel, lost a star because of the noisy heater and non-working pool", "helpfulness": 11, "user": "erinwyher", "date": "March 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4587837}, {"rating": 3.0, "stay_parameters": "Stayed August 2005, traveled on business", "text": "A Space Needle view will have you facing Lenora St. This is a very busy bus route so be prepared for lots of street noise. In my experience, any downtown hotel has lots of street noise so bring ear plugs if you're a light sleeper.", "title": "Average American hotel", "helpfulness": 6, "user": "Rickard", "date": "February 21, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 4475004}, {"rating": 4.0, "title": "Nice Small Hotel, Excellent Value", "text": "The hotel location was perfect, right in the center of town and just a few blocks to the convention center. I walked from here to Pike's Place market for breakfast, then on to the convention center each day of the convention and found it all very convenient. (Try the Crumpet Shop for breakfast, delicious crumpets, and cheap lattes before 8:30am every day!)", "helpfulness": 5, "user": "A TripAdvisor user", "date": "February 15, 2006", "id": 4462753}, {"rating": 4.0, "title": "Above Average, Very Nice Stay", "text": "The hotel room was clean and everyone who worked here was helpful and perfectly friendly. The bed was too comfortable :). The first night I had trouble sleeping though, because the heater would wake me up every couple of hours. By the second night, I learned to tune it out. There is a coffee maker in the room, by the way (I had read somewhere that there was only coffee in the lobby, and this is not true.) There is also a nice little fridge where I stored away spring water for my week. I had a view of the Space Needle without even asking - very nice.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "February 14, 2006", "id": 4458679}, {"rating": 3.0, "stay_parameters": "Stayed November 2005", "text": "My husband and I decided to plan a trip with my cousin and her husband. They had stayed at the Warwick many years ago and loves the space needle view. So, we booked both of our rooms at the Warwick for a three night stay.", "title": "Nice Hotel and Service, but . . . .", "helpfulness": 5, "user": "krosas", "date": "December 15, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 4244333}, {"rating": 4.0, "title": "The Right small hotel", "text": "Upon arrival, my cousin told me, don't expect a huge lobby or check in counter. Boy was she right!! The lobby area is very small but cozy. Check in/out, question desk and concierge are all at one desk that is about 15 feet long. You feel so cramped if you are getting information and there are two people waiting behind you!! But, very good service. The manager who checked us in gave us coupon books, maps, anything that was going to help us around the city. That was very nice!", "helpfulness": 3, "user": "ThomasR", "date": "November 22, 2005", "id": 4138105}, {"rating": 3.0, "stay_parameters": "Stayed November 2005", "text": "The room was clean and looked nice. Until we went into the restroom. It was clean, very small, but clean but looked like a fist was coming through the ceiling. It was very weird! Also, in the shower, there was a cover that looked as if it was ready to fall off.", "title": "OK hotel; good location; watch out for construction noise", "helpfulness": 4, "user": "AKLadyLawyer", "date": "November 18, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4126006}, {"rating": 1.0, "stay_parameters": "Stayed November 2005", "text": "We paid for the upgaded view of the space needle. We were told we'd be able to see it from our bed. Well, that was false. In order to see the needle, you had to stand in the corner and look at it or open the slider to see it. It was ok though.", "title": "doesn't honor reservation's price", "helpfulness": 2, "user": "RailgunSpike", "date": "November 17, 2005", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 4124101}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "We read some reviews about the pool being kind of dingy and dark, but nice once you were in the water. So we tried it out. It is in the basement, but the elevator takes you right there. The first thing you notice when you walk in is the stench of chlorine. It smelled so bad. We decided to muddle through and went in the pool. The temp was nice, but we then opted for the spa. From the steam and the chlorine, both my husband and I had to leave because our eyes were burning and watering so bad. We told the front desk and a lady responded with \"how do you expect us to keep it clean?\"", "title": "Best place to stay in Downtown Seattle", "helpfulness": 4, "user": "Mezlin", "date": "November 10, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4104009}, {"rating": 1.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "Stayed here for 2 nights last week. Had a confirmed reservation via hotel website (with a printout in my hand), but the front desk says the room is not available. Waited for about 20 minutes and a room became available, although not the type I reserved.", "title": "don't recommend", "helpfulness": 1, "user": "bijou2006", "date": "September 20, 2006", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 3.0}, "id": 5818243}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "My rate included continental breakfast, but had to tell the front desk again who finally gave me the vouchers.", "title": "Not Bad........", "helpfulness": 1, "user": "bububr", "date": "September 17, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 5809175, "likes": {"liked": "— Walking distance to piers", "disliked": "— lack of personality"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "My room was on the 16th floor facing the Space Needle. You can hear a lot of noise from the street until late night.", "title": "Great value in Seattle", "user": "Lynn-in-Chapel-Hill", "date": "September 15, 2006", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5803016, "likes": {"liked": "— Location and size of room", "disliked": "— Customer service"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Overall, I would not recommend this hotel.", "title": "Good location, room was OK", "user": "scooter028", "date": "September 7, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 5778783, "likes": {"liked": "— Location and friendly staff", "disliked": "— Beds"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "We had a post stay at the Warwick after an Alaskan Cruise. We stayed pre-cruise at a different establishment.", "title": "Great Hotel for the price", "helpfulness": 1, "user": "xyza", "date": "August 17, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5620596, "likes": {"liked": "— Location"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2005", "text": "I booked this hotel through Hot Wire and called immediately requesting a nonsmoking room, a king bed and a room away from the elevator/ice.", "title": "Bad Choice!", "helpfulness": 12, "user": "discriminateWA", "date": "June 23, 2005", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "rooms": 1.0, "service": 1.0}, "id": 3605654}, {"rating": 2.0, "title": "Warwick Bad", "text": "I see good reviews of the Warwick and it shocks me...The staff was quite rude, the rooms were fairly dirty. I cut myself and asked for a bandaid and they did not have any?!?! I requested a bottle opener and they also did not have that... Go somewhere with better service.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "March 11, 2005", "id": 3266873}, {"rating": 3.0, "title": "A Decent Experience at the Warwick", "text": "My husband and I stayed at the Warwick after a company party. I had made our reservations well in advance in order to secure a special group rate for our company's partygoers. The reservations agent that I spoke with was pleasant, thorough, and helpful - he made sure that I understood what I would need to know about my reservation.", "helpfulness": 4, "user": "strryeyedgrrl", "date": "March 7, 2005", "id": 3256816}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "We stayed at the Warwick pre cruise. Chosen for location, price and free area shuttle. The shuttle was great to get us to the ship on Sunday morning. The Warwick is within easy walking distance to just about everything, but we had luggage so the shuttle was great. Desk staff and concierge are friendly and helpful. We did not eat at the restaurant, but spent time watching football in the bar area after checking out/ pre-cruise and the bartender was great!", "title": "Nice Hotel", "helpfulness": 6, "user": "cc41", "date": "October 25, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4051921}, {"rating": 4.0, "title": "Great Location and friendly staff!", "text": "Room was a bit small, but clean and comfortable.", "helpfulness": 8, "user": "Sarahlou82", "date": "October 6, 2005", "id": 3997302}, {"rating": 4.0, "title": "Classy downrown location", "text": "Only complaint was street noise (people yelling, not traffic) at all hours all night. We were on a lower floor. I think if you're higher it would be ok.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "September 29, 2005", "id": 3975350}, {"rating": 4.0, "title": "My travel needs were well met", "text": "Despite that, we would definately stay here again.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "September 5, 2005", "id": 3844766}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "When we arrived we were told we would have to come back at 3pm as our room wasnt ready. No big problem as the Warwick is so close to the shops and many restaurants that we could easily fill the time. They took care of our bags and had them delivered up to the room. Bit of confusion as we booked with expedia which included free brekfast every morning. The warwick had no record of this but the manager happily obliged and gave us breakfast vouchers. They were good for almost $19 and could be used for anything on their breakfast menu in the restaurant. So we were not restricted to just the usual continental breakfast.", "title": "Home away from home", "helpfulness": 8, "user": "dreamonixx", "date": "June 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3615849}, {"rating": 3.0, "title": "Warwick is ok", "text": "I stayed at the Warwick hotel 26-28 Jan. I chose it because it was close to Seattle Center where I was attending the Travel Convention. The hotel is ok. Nothing spectalular. The front desk people are friendly though twice when my sister and I asked for directions, the ladies we asked had to go find the manager to ask her. The room we stayed in on the 17th floor was clean. It had a gorgous view of downtown Seattle. The only problem with the room was the lighting was very poor in the bathroom and the handle on the toliet fell off when I flushed so you had to be very careful. But the room was quiet and comfortable. The only other problem we encounter was in our search for a working ice machine. This hotel has 19 floors but only 4 ice machines..17th, 15th, 8th and 4th floor. The one on the 17th floor was out of order, the one on the 15th floor was out of order but Eureka! the one on the 8th floor was working so all wasn't lost. In summary, for the price I paid, it was an adequate hotel with a good location.", "helpfulness": 5, "user": "ldjnavyrn", "date": "January 28, 2007", "id": 6711819}, {"rating": 4.0, "title": "We had a great stay here!", "text": "We booked a room here over thanksgiving weekend with 2 small kids. The location was great! You could walk to everything. We walked to a great coffee house called Cherry Street every morning for coffee and breakfast then went to the museums and space needle then took a cab back to the hotel since it was very cold. One night my husband had a meeting to go to so me and the 2 kids walked around to the merry go round and macy and to pf changs for dinner where by the way we had a wonderful and I mean wonderful time eating greasy Chinese food. We even walked into macy's and got a santa picture of my two kids. No one was there and no line to wait it. What luck and timing. The kids rode on the merry go round and we walked back to the warwick and felt safe and sound. We did eat at the restaurant in the lobby one night and it wasn't good at all. Try one of the restaurants next door/down the street. They all looked so good. Next time we will. Warwick is great for the location, clean, good rates, nice pool, gym and valet parking (parking is a lot but a lot everywhere in seattle hotels).", "helpfulness": 2, "user": "Makemineadouble", "date": "January 25, 2007", "id": 6692232}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with friends", "text": "My Brother and I booked direct on the internet. The cab from the airport cost $38. On arrival at the Warwick we were given a warm friendly welcome at reception. We requested a high floor room and we were given a great room on the 14th floor, right on the corner with a city view. Two large double beds, all the amenities you would expect. Powerful shower, coffee making facilities and tv all worked perfectly. The dining room served a delicious menu and was presented very well. The dining room was always buzzing as it also led into the bar area. Served wonderful cocktails. Ralphs deli was right opposite and sold milk, wine and foods.", "title": "Great Location Comfortable Room", "helpfulness": 6, "user": "NeilFaust", "date": "January 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6562813, "likes": {"liked": "— Close to city centre. Great comfortable room.", "disliked": "— Small bath"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "The best part of staying at the Hotel was its easy walking distance to the city. All the main stores like Macys, Nordstrom and Pike market were just minutes away. The staff were very attentive and let us have free use of the Hotels internet in its business office.", "title": "Great hotel for the money", "helpfulness": 5, "user": "HoneymoonMarch2007", "date": "December 30, 2006", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6520567, "likes": {"liked": "— The View", "disliked": "— The Housekeeper was rude."}}, {"rating": 2.0, "stay_parameters": "Stayed November 2006, traveled solo", "text": "Sadly our flight was cancelled and we needed a Hotel for another night. We called the Hotel from the airport to ask they accommodate us. Being New years eve it was full but as we were previous guests they managed to find us a room. We even managed to welcome the new year with the spectacular firework display at the space needle. Definitely will return again.", "title": "Good Hotel - Bad Wifi", "helpfulness": 3, "user": "1NicePerson", "date": "December 9, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 1.0, "cleanliness": 3.0, "rooms": 4.0, "location": 4.0}, "id": 6352917, "likes": {"liked": "— Professional Staff, Quality of Room Furnishing", "disliked": "— Poor WiFi Signal"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "My sister and I stayed in a two double bed room on the third floor (305) We requested a room on a higher floor, but none were available upon check-in. I've read reviews you can hear street noise on the lower floors. The room was very noisy and I couldn't get any sleep. If you're a light sleeper, go with a higher floor if you can get one. Room was nice (at time of walk in), but small. Bathroom was small as well and didn't have enough towels for two people.", "title": "Good Location, but...", "helpfulness": 3, "user": "travelin75", "date": "October 24, 2006", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "location": 5.0, "rooms": 4.0}, "id": 6006603, "likes": {"liked": "— Location", "disliked": "— It was dirty and room was noisy"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "When we closed the curtains, I noticed several stains. They were dark reddish brown in color. I'm assuming they were blood stains. I was disgusted. The phone's earpiece was visibly dirty and there was a hair in the bathtub, before we used it. I left my comments about the room with management and haven't heard back.", "title": "Good place without spending big bucks", "helpfulness": 1, "user": "39StatesNcounting", "date": "October 20, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 5975779, "likes": {"liked": "— Room view", "disliked": "— price of snacks in fridge/didn't buy them"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006", "text": "Location was great, close to shopping and the market. Parking was $21 a night, but a good deal since other lots are pricier and street parking is scarce. Check out is at noon and parking was good until 5pm. There is a grocery store across the street and a starbucks and seattle's best coffee 2 -3 blocks up on Lenora.", "title": "Nice hotel", "helpfulness": 3, "user": "ayvc", "date": "October 16, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "business": 1.0, "cleanliness": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5960957}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We had breakfast at the hotel restaurant. Food was good and service was great!", "title": "Warwick Seattle", "helpfulness": 2, "user": "WhitehorseTraveller", "date": "October 16, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5960956, "likes": {"liked": "— Location", "disliked": "— The unfortunate 'party' that erupted...but the hotel reacted well by re-locating us"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "Seattle Times paper was delivered every morning. Internet service is not included in the price of the room and cost $10 a day.", "title": "Liked this place, good location", "helpfulness": 3, "user": "ccba", "date": "October 3, 2006", "detail_rating": {"front_desk": 2.0, "business": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 5905517, "likes": {"liked": "— location, floor to ceiling windows with view, comfortable bed", "disliked": "— staff needs bit more training in customer service"}}, {"rating": 4.0, "title": "let's get things straight", "text": "Ok, here are a few comments about the last reviews and my stay. I just spent one night at the Warwick in Seattle.", "helpfulness": 16, "user": "A TripAdvisor user", "date": "February 10, 2006", "id": 4452109}, {"rating": 3.0, "title": "A Night at the Warwick", "text": "Location: very good.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "January 29, 2006", "id": 4395153}, {"rating": 1.0, "title": "The Night from Hell!", "text": "Staff: helpful and professional", "helpfulness": 17, "user": "A TripAdvisor user", "date": "January 21, 2006", "id": 4366645}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "Room: nice mattress. High floor and away from elevator as requested.", "title": "Great Stay", "helpfulness": 9, "user": "gettingconfused", "date": "January 3, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4319275}], "location": {"country": "United States", "city": "Seattle"}, "stars": 3.5, "variance": {"poor": 70, "average": 146, "very good": 376, "terrible": 42, "excellent": 291}, "aka": "Warwick Seattle", "slim_ranking": 0.430107526882, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Warwick Seattle Hotel is a newly renovated hotel boasting some of Seattle's largest rooms and best views of the famous Space Needle. Located in downtown, Warwick Seattle Hotel is within walking distance to most Seattle attractions such as the Seattle Center, home of the Seattle Space Needle, Experience Music Project, Seattle Opera, Pike Place Market and world-class shopping. The hotel's 231 king or two-queen lodging accommodations feature floor-to-ceiling glass sliding doors, with magnificent views of the Seattle Space Needle or city skyline."}