{"user_rating": 4.0, "review_count": 551, "name": "Warwick San Francisco Hotel", "reviews": [{"rating": 2.0, "title": "Never got to find out", "text": "My husband and I were honeymooning in Northern California. We were looking forward to staying at the WR for our 2 night stay in San Francisco before heading further up the coast. When we arrived to the curb at the vallet, we were pleased with the location and the outside appearance of the motel and looking forward to settling in and relaxing after long day in the car. The vallet asked our names, went inside to I guess let the front dest know our names and came back out watching us unload our car. We were told that we had to get everything out now that we would want because they park the cars in different garages and it wouldn't be easily accesible for us to get our belongings in and out. After 10 minutes of us deciding what we would need and what we would keep in the car, we handed him our keys and proceeded into the front desk.", "user": "Luna6474", "date": "October 19, 2006", "id": 5973715}, {"rating": 1.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "The gentleman at the front desk gave us some line about how 'all the motels in the area had a glitch in scheduling and most of them-including the WR of course- were double booked'. Instead of honoring our reservations, they were sending us to the Courtyard by Marriott, where they would pay the extra on the bill and where he promised we would enjoy ourselves. It was true, we did enjoy the Courtyard by Marriott- A lot. We had a beautiful view of the city at night and had access to our car whenever we needed it. Vallet even ran to put things in and remove things from the vehicle. Everyone at the Courtyard by Marriott was sooo nice.", "title": "Don't Stay at the Warwick", "helpfulness": 5, "user": "DBrees", "date": "October 12, 2006", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 5947164, "likes": {"liked": "— The Staff was friendly", "disliked": "— The hotel accommodations - room was terrible"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "I was really offended by the Warwick Regis, however. I couldn't believe that they waited for us to remove all of our luggage from the car at the curb before they explained to us we were not staying there. I thought that was incredibly rude. I also found it odd that other guests were coming in and checking in with no problems. If the motel was infact double booked, then why didn't they send people off based on a first come first serve basis? Also, they had 2 contact numbers for me, one which was my cellular phone which I had on myself. Why no phone call about the change in plans? Honestly, I believe that the 'double booking' story I was given was complete crap. I am assuming that because there were other events going on in the city at the same time, they probably got more money for the rooms, so they sent us on our way or something to that effect. If you're going to SF, stay at the Courtyard by Marriott. It's a great location and a nice clean place to stay.", "title": "Very pleasant experience", "helpfulness": 3, "user": "A-Hamilton", "date": "September 5, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5770027, "likes": {"liked": "— Charma and cleanliness of rooms", "disliked": "— Just a little too small"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled solo", "text": "My husband and I stayed at the Warwick Regis for one night after spending four at the Hyatt at the Ferry Building. My husband and I are well-traveled, so we decided on the Warwick upon knowing its reputation in New York. When we arrived ahead of check-in time, we were told that we would be getting a suite room. However, the desk clerk changed and we were later told that we had a standard queen room. There was a sign posted outside of the door that stated, \"Chemicals on the premises may cause cancer or be a danger to pregnant women.\" What??? The exact wording may not be there, but the point was clear. We asked the desk attendant about the sign and he sputtered something about the kitchen and keeping people out of the alley. Our room seemed as if it hadn't been dusted in several months. Also, we had difficulty getting our luggage in the room due to it's EXTRAORDINARILY small size. The bed was supposed to be a \"queen,\" but was actually full-sized. The sheets were scratchy and deposited lint on my black pants. The pillows were small and flat. We had to open the windows to let in fresh air, but people on the street below were so noisy (we were on the 6th floor) that we couldn't sleep! If you're wise, do NOT stay here.", "title": "Great time at the Warwick", "helpfulness": 1, "user": "BRENT7", "date": "August 28, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5717906, "likes": {"liked": "— THE BED", "disliked": "— NA"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "We have just returned from San Francisco and staying at the Warwick Regis Hotel. I agree the rooms are certainly small but they are charming, very clean and extremely well maintained. It was a wonderful base to return to and very well located. Excellent value for money. We would definitely return.", "title": "Sooo glad I didn't stay here!", "helpfulness": 8, "user": "JewelryGirl", "date": "August 16, 2006", "detail_rating": {"value": 3.0}, "id": 5618432, "likes": {"liked": "— Leaving out the front door!", "disliked": "— Claustrophobia central - location is scary...too many homeless"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "First a note on the \"poor\" reviews: If you do not like quaint, cozy, warm, charming then do not stay here. If you think \"historic\" buildings are small, smelly, and have small elevators then do not stay here. If you do not want to experience San Francisco's energy, shopping, dining, theater all within walking distance then do not stay here. This is a great hotel, with each suite different from the next. The staff in both hotel and restaurant are exceptional and friendly. The fellow guests my partner and I met at the hotel bar were engaging, educated, and friendly ( we even exchanged email addresses) We will be back to the Warwick each time we visit the city. If you like cookie cutter, larger, cold hotel rooms stay at a Hyatt or Hilton or other namebrand hotel. This hotel offers TRUE San Francisco charm.", "title": "Old world elegance updated", "helpfulness": 3, "user": "SanJosecivilian", "date": "November 29, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6305688, "likes": {"liked": "— quality of service", "disliked": "— everyhting was as or better than expected"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "I booked a Friday night stay at this hotel with apprehension after reading previous reviews. I must say that I was very satisfied with my stay. The room was small, but I have encountered smaller rooms in big cities. Our room overlooked Walgreens, but my teenage daughter and I had no difficulties sleeping as noise did not seem to be a problem. The room was very comfortable and clean. The location was great ,as we were there for shopping at Union Square. We took the Ferry into the City, so parking was not an issue. We called housekeeping for more pillows and it took them all of about 5 minutes to get them to us. We arrived back from dinner after 11:00p.m. and felt completely safe walking from Union Square. The only complaint was upon checkout. I booked online and received a rate that was not the same upon checkout. After providing the front desk clerk a copy of my confirmation however, it was quickly adjusted. As a travel agent, I would recomend this hotel to all of my clients.", "title": "Exceeded expectations", "helpfulness": 1, "user": "D.Scott_travel", "date": "November 27, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 6181950, "likes": {"liked": "— Location of Hotel and comfort of room"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "In other reviews on this property I see several references to problems with the staff... Perhaps, not being rude – or unhelpful – but just clueless. I had the same experience – and this is the advice I have for staying at the Warwick. Manage your experience proactively – you can have a very nice stay in the city at the Warwick.", "title": "Possibly in Transition?", "helpfulness": 5, "user": "flyby", "date": "November 24, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 6171715, "likes": {"liked": "— Great location", "disliked": "— Staff needs more training - yet helpful..."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006", "text": "It is a very useful home base for exploring the city – great central location. Easy to meet friends – shop – get to all forms of public transportation. Rooms on the back ally – though they do look onto the ‘charms’ of city life – are quite for the most part – clean and well maintained. I never felt unsafe or compromised for my stay at the Warwick.", "title": "A secret we should keep", "user": "eldomatt", "date": "November 3, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6053349}, {"rating": 1.0, "stay_parameters": "Stayed September 2006, traveled solo", "text": "What I found to be compromising was their bookkeeping/check-in procedure. Our front desk clerk was busy trying to answer phones while training new workers – everyone was being helpful –there was a lot of busy work - but no real information. I signed in with my ‘x’ on several locations of their official sheet - ‘no smoking in the rooms’ – ‘no pets in the rooms’ – ‘your staying for this many nights’... But realized that upon check out – nothing had been said about the rate I had booked and confirmed. This was of course my oversight – and in the end things did work out - but if I had a plane to catch – or some such deadline – this would have been a complete derailment of my day as it took three trips to the ‘manager’s office’ downstairs and about 25 minutes to clear things up.", "title": "This Hotel and Priceline both stink....", "helpfulness": 4, "user": "seagtiguy", "date": "October 24, 2006", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 6007575, "likes": {"liked": "— Location", "disliked": "— Everything"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "The Warwick Regis is an old world charming hotel. Its staff is friendly, helpful and courteous. Our room was small but comfortable with all the amenities -- bar, TV, dresser, wardrobe, extra pillows, extra blankets and plenty of lamps. The bathroom was ample for our needs. Our room faced Geary and we were fine with that. We enjoyed the activity of the street and liked looking out the window at the busyness below.", "title": "Ready to go back to the Warwick", "helpfulness": 2, "user": "acereporter", "date": "April 4, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7279313, "likes": {"liked": "— Small hotel that was more like home than staying in a cookie cutter hotel", "disliked": "— No coffee in rooms or in the lobby. We went out to Starbucks but it may be invconvenient for someone else"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "There's no in-room coffeemakers or any coffee downtstairs in the lobby. You can get a free cup before 7 a.m.but not after.That's the only only negative thing we found during our stay. We walked a few doors down to Starbucks and people from other hotels were there too getting the java fix.", "title": "Not too bad for SF", "helpfulness": 1, "user": "SFCalifornia", "date": "March 6, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6925962, "likes": {"liked": "— Location", "disliked": "— No free coffee in room or lobby"}}, {"rating": 3.0, "title": "Cute but BEWARE the Rock-hard beds", "text": "La Scene Restaurant and Bar is located right in the hotel and the food delicious. We had the price fixe menu and our waitress was tremendous with personal service and patience like no other. We walked all over Union Square during our stay, saw a play and shopped and ate. We even went to Waldgreens after midnight and felt safe. Yes,there are plenty of homeless people. Every big city has its homeless. We did not have a car with as and we came in on BART so we cannot comment on the parking.", "helpfulness": 1, "user": "havanahipster", "date": "February 26, 2007", "id": 6842710}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "If you want to go to the Curran Theater (we saw \"Jersey Boys\"), this hotel can't be beat. It's literally across the street and very convenient to Union Square, restaurants, etc. As for the hotel itself, it's pretty decent. The front desk was not quite as friendly as others describe. Upon check-in (came via BART from East Bay), I had to stand for 5 minutes while they checked papers, talked on the phone, etc. Then it was pretty perfunctory. The plus: I asked for a top floor to keep the noise to a minimum. I got it...and then noted the windows have double-panels. You can open one, two or leave them closed for maximum quiet. The bed (as opposed to last reviewer) was just fine and it was clean and comfortable. Bathroom was cut above average. Yes, the room was fairly small, but they're all like that in SF. My main beef: When we checked in at 3, there was coffee, tea and cookies. But at 8 a.m. the next morning, nada. Nothing. No coffee (who ever heard of a hotel without coffee in the morning)? When I asked the desk, I was told, \"Oh, you can ask a waiter in the restaurant\" (and, I assume, pay $4 a cup or whatever for coffee). Would it kill them to put a pot in the lobby? All in all, though, I thought the Warwick Regis was a fine hotel for an evening of theater across the street.", "title": "Nice place", "helpfulness": 1, "user": "ScottB4587", "date": "February 18, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 6809210, "likes": {"liked": "— Character", "disliked": "— San Fran. needs some lessons from NYC"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "I pricelined a room at the last minute and ended up here. This is a cute little boutique hotel with quaint rooms. The only criticism I have is the ROCK HARD beds. Yowch, I woke up with a sore back the next morning. I think the floor would have been more forgiving. Oh, and the road noise from outside was a bit much.", "title": "It was alright.", "helpfulness": 2, "user": "breakfast4dinner", "date": "January 1, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 6533358, "likes": {"liked": "— location", "disliked": "— noisy"}}, {"rating": 4.0, "title": "A great way to experience San Francisco", "text": "I stayed here w/ my wife in March and loved it. We approached the hotel's front desk after arriving in the city to inquire about a midweek 3-night stay. We received a great price and had breakfast included (HIGHLY recommended: brilliant food). The staff were courteous enough and the hotel offered a free Internet terminal in the lobby. This boutique hotel offered a beautifully-appointed and decorated room, but it is small (in a cozy way) and offers no view whatsoever. The location was perfect for us, this being our first time to the city. It's a stone's throw from Union Square, a short walk to the cable car and shopping.", "helpfulness": 2, "user": "newspapermatt", "date": "July 6, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8069223}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "We stayed 7 days / 6 nights. The highlight would be the very friendly and responsive staff. They are courteous without being snotty, which is the opposite of the hotel across the street (The CLIFT). Overall, the hotel is understated luxury without the snobbishness of many downtown SF hotels.", "title": "Friendly staff, but not perfect", "helpfulness": 5, "user": "random.tard", "date": "June 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 7925124, "likes": {"liked": "— Service and friendliness of hotel staff", "disliked": "— In-room wireless internet was expensive and very slow"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The good:", "title": "A very interesting experience.", "helpfulness": 4, "user": "NODAK1979", "date": "June 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 3.0}, "id": 7772071, "likes": {"liked": "— Decoration, cleanliness", "disliked": "— Location, the beds"}}, {"rating": 4.0, "title": "great deal in good location", "text": "- Exceptionally friendly, responsive staff", "helpfulness": 3, "user": "billmnt", "date": "May 13, 2007", "id": 7592927}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "- Location near Union Square", "title": "Great deal for San Fran", "helpfulness": 3, "user": "cyndlutt", "date": "April 22, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7416032, "likes": {"liked": "— location", "disliked": "— smoking room"}}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 3.5, "variance": {"poor": 36, "average": 98, "very good": 213, "terrible": 33, "excellent": 171}, "aka": "Warwick Hotel San Francisco", "slim_ranking": 0.353191489362, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Warwick San Francisco Hotel, an elegant and popular choice among downtown hotels lies in the heart of San Francisco's fashionable theater district, just two blocks west of Union Square and the famed San Francisco cable cars, world-class shopping and dining. Featuring some of the most elegant San Francisco lodging accommodations, the Warwick San Francisco Hotel offers 74 rooms including 16 suites that are tastefully appointed in the style of Louis XVI."}