{"user_rating": 4.0, "review_count": 1158, "name": "Washington Plaza", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "My boyfriend and I decided at the VERY last minute that we wanted to go to D.C. for the weekend. I'm talking we came up with the idea around noon, and were in D.C. by 9:00pm. As short notice as it was, the price for the room was very reasonable. I looked at a lot of hotels, trying to find one fairly close to the metro/action, and this was pretty much the only one that met that criteria without being $200+ a night. The hotel itself was fairly nice. Quick check in, nice lobby. The rooms were decent. Nothing fancy, but clean and fairly updated. The free bottled water was a plus. It was about a 5 minute walk to a metro station. All in all we enjoyed our stay.", "title": "Great for the Price", "helpfulness": 1, "user": "Betsy M", "date": "August 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 173199831}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We stayed there for 3 nights, during our 3 week vacation across USA in july/august.", "title": "Decent Hotel, but old and not clean", "helpfulness": 1, "user": "Sun H", "date": "August 20, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 173129521}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled solo", "text": "It's a decent hotel, and pretty fairly priced. With an excellent location. The hotel probably must have been great when it was built, but now it's getting old.", "title": "Nice..", "helpfulness": 1, "user": "mattscards", "date": "August 18, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "location": 3.0, "service": 4.0}, "id": 172897396}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Pros:", "title": "Fabulous Spot in D.C. !!", "helpfulness": 1, "user": "FamilyGalOakPark", "date": "August 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172707775}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Big room, decent bed, and free bottles or water every day.", "title": "Very comfortable hotel, good location.", "helpfulness": 2, "user": "watchman48", "date": "August 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 172678154}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We just came back from a wonderful trip to Washington DC (8/20-8/22/13). Beautiful hotel, my husband is an architect so he appreciated it's design by a world Reknown architect. For the price it was a good deal......however, they are undergoing a construction project! Removing the building veneer in the rear & reception/entrance area! Jack hammering started at 9:15 AM and continued ALL day until 3:30 PM. It was very very loud!! Just after we checked in the front desk called to ask if everything was acceptable. Of course I asked if we could change rooms, as the workers were right outside our windows!!!!! They called back & said they could not switch rooms! In order to not ruin my families vacation I didn't carry on about it! We just made sure we left before it started in the morning.", "title": "Nice hotel but...", "helpfulness": 1, "user": "Michele G", "date": "August 27, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 174294613}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Other than that accommodates were fine. We ate dinner at the hotel 2 nights and the food was fine. Staff very friendly, rooms clean. Oh and they left a chocolate hammer each night as an apology for the construction.", "title": "great location, service, and pool", "helpfulness": 1, "user": "saffyNYC", "date": "August 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 174205445}, {"rating": 4.0, "title": "Chosen for the Pool", "text": "I recommend the hotel just not during construction!,,,", "helpfulness": 1, "user": "Richard D", "date": "August 26, 2013", "id": 174193081}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled solo", "text": "We were very happy we picked The Washington Plaza for our stay in D.C. Sometimes 3 star hotels in very popular, particularly historic locations can be at the more basic end. We felt this hotel deserved its stars. The rooms were very clean and well maintained, and all the staff from the reception desk to the concierge, bell men and parking attendants were very helpful. You're going to have to pay for parking, and breakfast is not included unless you got a special deal, but that's pretty much the norm in this town. We enjoyed the outdoor pool, and the convenience and enjoyment of being able to go out to eat (there are plenty of dining options within walking distance or a short ride away) or staying at the hotel after a tiring day of sightseeing and eat poolside or at the restaurant. I'd give it 4.5 if trip advisor ratings allowed 1/2 points.", "title": "Great hotel for the Price (older but it has a Pool!)", "helpfulness": 1, "user": "JeffB_UK", "date": "August 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 173684640}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "I'm sure you can get similar hotels for the orice that are better located for the sights, but none would have this great pool. We paid a little more for Superior rooms and as a result had loads of space - worth the extra. Breakfast was good in the somewhat outdated restaurant. Overall good value for money but next time I'd get a more central location for access to sights/shops/restaurants..", "title": "Perfect place when visitin the nation's capitol", "helpfulness": 1, "user": "FredrickB", "date": "August 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 173230988}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled solo", "text": "Has no complaint at all about this hotel. Probably the best I've stayed at. All the staff was friendly, helpful, the best at what they were doing. I would also recommend that when you dine in the restaurant you seek out Destiny. She is the best at what she does and makes the good food there even more enjoyable. Order whatever she recommends since she won't steer you wrong. Staying at the Plaza made my trip a dream.", "title": "The Best Ever", "helpfulness": 1, "user": "Beverly P", "date": "August 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 174927898}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled solo", "text": "This property is a bargain. It has a great location for transportation, a front desk willing and able to help, door men who are also available and make you feel like you are a welcomed guest. I was very pleasantly surprised during my two night stay this week.", "title": "A great bargain in a good location", "helpfulness": 1, "user": "TheLovely", "date": "August 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174760281}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "My husband and I are back from three nights at the Washington Plaza, and everything about our experience there was beyond our expectations for the price. I spent TOO much time reading reviews and debating on which hotel to select for our midweek pleasure trip to see the sites. I picked the Washington Plaza based on the package offered - free parking and free buffet breakfast. We did not use our car at all during our stay and were able to walk to all of the sites, The breakfast was terrific, with so many options including smoked salmon, made to order omelets and Belgian waffles. The staff was very accommodating, the hotel was immaculate. The linens and towels are Frette - all very soft. I loved the décor of the room. Yes, I would ask for a room away from the construction. We only heard it when in the lobby or near the elevator.", "title": "Best Choice for DC", "helpfulness": 1, "user": "houdini444", "date": "August 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174745286}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "We would most definitely stay here again.", "title": "Great location, five star staff", "helpfulness": 1, "user": "Chuck C", "date": "August 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 174455006}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We recently spent five nights at Washington Plaza, and can only give rave reviews to the staff of this hotel. They were exceptional, on every level. They were knowledgeable, cheerful, and eager to help answer questions, provide local insights, and guide tourists around the city.", "title": "A fine hotel", "helpfulness": 1, "user": "Ann-Marie D", "date": "August 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 174413600}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "This is a hotel located in a primarily residential section of the city. A few blocks to the metro, or walkable to attractions if the weather is nice, though a bit of a long walk. The area has some nice restaurants and a 24 hr pharmacy across the circle.", "title": "Okay hotel if the price is right", "user": "joylama", "date": "May 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 160129683}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The hotel itself is a little odd. Architecturally interesting on the outside with a 1970's look that (unfortunately) carries through to the interior. The lobby is spacious and the front desk staff are pleasant and efficient. Lobby decor is very 70's as well. There is a bar and a restaurant on the first floor as well as a small gift shop. Restaurant has a small but nice breakfast buffet.", "title": "Great place to relax and visit W DC", "helpfulness": 1, "user": "Bernarditaviajera", "date": "May 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 160069106}, {"rating": 2.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The room had a comfortable bed and a balcony overlooking the pool area and Thomas Circle. There was moderate street noise on the fourth floor from fire engines and loud vehicles, but not from routine traffic. Decor in the rooms is again in the seventies style. Brown carpet and orange/brown furniture. The room was on the small side but did have a desk area, flat screen tv and a chair/ottoman. The bathroom had expensive fixtures, but was otherwise very unattractive. A Grohe faucet does not improve a cheap motel style vanity. The toilet and tub are in a separate room which is very cramped. The sink area has the same brown carpet as the room, and the tub/toilet room has tile that looks like it would be found in an urban apartment building that was built in the 60's.", "title": "not good enough for the price", "helpfulness": 1, "user": "Patricia K", "date": "May 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 159930363}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled solo", "text": "The room had sufficient outlets for charging phones, etc. and a climate control system that did allow for the fan to stay on for air circulation. When using the heat however, the unit made a moderately loud clicking noise every time the heat would activate which might bother light sleepers.", "title": "Great location.", "helpfulness": 1, "user": "LUI123", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 159920287}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The hotel offers room service until 11pm though I did not order and can't comment on speed or quality.", "title": "Sparkling clean, helpful staff", "helpfulness": 1, "user": "Susan H", "date": "May 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159654894}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "I booked this hotel for a birthday/weekend trip!! The staff was very friendly and courteous!! I would stay again. Yes, it is within walking distance of the National Mall and Chinatown@ Gallery Metro. I will stay again!! Thanks!!", "title": "Weekend Getaway", "user": "Jacquelyn B", "date": "April 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 157866445}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "My husband and I are both in the hospitality industry- we are both pretty critical of hotels- since that is what we do for a living. This hotel was great! The staff- everyone we met- was amazing! Friendly, helpful, smiling, and professional. They have Bath and Body bath amenities, which were nice. The hotel room was very clean. The bed was comfy (although their pillows are a bit over stuffed, my neck was a little tweaked by it). The bathroom was a moderate size and was really clean. They have turn down service in the evenings with 2 free bottles of water and ice delivered to your room. We went to the bar area downstairs- the prices are comparable to the rest of the area. The service is fast and courteous. They make great mojitos! We had breakfast in the restaurant- it was good (we both had the buffet $17 pp). The omelet station was great, and the chef was really sweet. We also had room service for breakfast (used the cards placed in the room for early morning room service ordering). It came right on time- and was really good. The room service agent was great! The hotel is a little ways away from the metro station- but is in walkable distance to many restaurants, bars and shops. There is a CVS just across the circle if you forget to pack anything. Taxis are CHEAP in DC- we were amazed- it was $20 including tip from Washington Reagan Airport to the hotel. It was about $7 for a cab to the Holocaust Museum. We had an amazing time and would definitely stay here again. The only things that we saw that needed improving/upgrading is the drop ceiling above the front desk (maybe paint it or replace it) and the wall covering around the front desk and on back door needs replacing. The front desk is one of the first things guests see at the hotel- and should be 100%. The restaurant needs to be remodeled- but that inst such a big deal. Maybe take a few of the mirrors down and replace with paintings and reupholster the seats. All in all a FANTASTIC stay, GREAT employees and great location! Thanks for a great get away!", "title": "Wow! Great Deal and GREAT Hotel!", "helpfulness": 2, "user": "Keywestkasey", "date": "April 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157817115}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "This is a good hotel in a central location in DC. The hotel is about three blocks from the closest MRT, on Columbus Circle, making it inconvenient for travellers with luggage. Other than this, the hotel is within a short walk from the National mall and other tourist attractions.", "title": "EXCELLENT CITY TRIP HOTEL", "helpfulness": 1, "user": "SPAMELOPE010", "date": "April 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 157463003}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "The staff are firendly and the room I occupied was comfortable, well appointed and quiet.", "title": "Central Location, great facilities", "helpfulness": 1, "user": "Zach S", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 157078001}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "I think the hotel offers excellent value for money for DC and would retrun there again in the future.", "title": "Everything I need to get by", "helpfulness": 1, "user": "Carolyn J", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 157006675}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Location was great,close to Metro entrance.All employees were very help full and friendly.The rooms were very clean.Had breakfast and dinner at the the hotel and found the food and service to be very good! Would come back to Washington Plaza next time in Washington,DC.", "title": "New restaurant,great food & service", "helpfulness": 2, "user": "Walt982", "date": "April 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158757399}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "I enjoyed my stay at this hotel...it was very close to the major sights in DC and a few blocks to the Metro, making it very easy to get around. The hotel is a bit older but re-decorated to give it an art-deco appeal. The beds were very comfortable. The rooms are somewhat small but it met our needs perfectly...after all the sight seeing, we were mainly there to rest/sleep after action packed days of touring around. I would come back to this location the next time I am in the area.", "title": "Worth the price and very close to the sights", "helpfulness": 2, "user": "C B", "date": "April 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 158162698}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We chose Washington Plaza because of its proximity to family and places we planned to visit. Weren't expecting much in the way of a room but were pleasantly surprised. It was quite roomy and the bed was more comfortable than our bed at home. Luxurious linens and a firm but not hard mattress.", "title": "Great location; great bed!", "user": "nk2008060", "date": "April 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 158143211}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "Staff friendly, relatively quiet considering it is located on Thomas CIrcle.", "title": "Excellent hotel with good location", "helpfulness": 2, "user": "TT71", "date": "April 17, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 158054154}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Friendly and helpful staff and excellent service, they even make your bed ready and put in a fresh water bottle in the evening. Spacious and clean rooms, liked the fridge they've inserted. No noise from other rooms, corridors or the outside which was nice - retired early due to the time difference the first nights. Swimmingpool closed- opens in May. Location excellent with all major sights and Georgetown within walking distance. A bit pricy but you get good value for your money.", "title": "My Go To Downtown Washington Hotel", "user": "bdmaustin", "date": "April 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 157945072}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "This place is very good value. The building (Lapidus design) is lovely, a treat for the eyes from the exterior and equally good to be in, if you like a modernist lobby and the smooth lines of mid-century architecture. I do, and while it's been refurbished it has held its stylish edge. Very painless check-in and we were upgraded straight away -- our room was large, decor inoffensive and even somewhat stylish. It's a good spot for eating around Logan Circle or down to Dupont Circle, so we didn't try the restaurant, but I wish we had, because it looked cool-retro in there. Desk staff were helpful with wake-up calls and other bits of business. Everything was painless. Big fish tanks in the lobby were a nice touch, ditto the mid-century chairs, lounges, the orchids, the screens. It felt nice to be in there.", "title": "Smooth", "helpfulness": 1, "user": "melissa_hardie", "date": "May 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 159496781}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled solo", "text": "This hotel offers all amenities in a most graceful manner. I was tired when checked in: a king-size bed with 6 pillows (count em!) took care of that! Thomas Circle is an area of large office buildings (mostly non-government), not the most interesting part of DC if you're seeking nightlife and restaurants. Tourists might prefer a hotel elsewhere. Good, well-run hotel.", "title": "Large, modern hotel designed for business travellers.", "user": "Outsider33", "date": "April 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 159300946}, {"rating": 4.0, "title": "Aussie tourist", "text": "Excellent accommodation, very friendly & helpful. Would definitely stay there again. I have no hesitation in recommending this hotel. Close to all the big sights of Washington DC and restaurants. The hotel food was good too.", "helpfulness": 1, "user": "Astikuta", "date": "April 30, 2013", "id": 159279164}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "I stayed at the Washington Plaza for two nights; its quite central, convenient to DuPont circle and many restaurants. Rooms were clean and comfortable. For the business traveller, excellent; I'll stay there again without a second thought.", "title": "Excellent for business travel", "helpfulness": 1, "user": "R_100_N", "date": "April 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158979810}, {"rating": 4.0, "stay_parameters": "Stayed April 2013", "text": "We spent three nights here and visited many of the sights using the metro, bus and walking to some of them. Very convenient too to restaurants in the area, 14th Street, DuPont Circle, Chinatown, etc. Staff were helpful and it was a mice gesture to receive a call after checking in to find out whether everything was okay. I would recommend this hotel.", "title": "Great location and no fuss hotel.", "helpfulness": 2, "user": "LowTP", "date": "April 26, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 158892638}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We stayed here for 1 night (8/28) to see a show at the Howard Theater. Since this hotel was a short distance from the theater but still centrally located, we figured it was a good fit.", "title": "Nice gem - great location!", "user": "shida_girlBoston_MA", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 175464682}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Check-in was a breeze which we appreciated having just got off of a 7-hour drive. Room was very nicely appointed, clean and modern. We were upgraded to a balcony room which was a really nice touch. We spent the time in the evening on the balcony watching all of the activity in Thomas Circle and enjoying the mild weather. Definitely an appreciated upgrade. We did not eat at the hotel so we can't speak for the restaurant but it was a wonderful hotel and a perfect location if you are looking for a reasonable price for a great location to see all the DC sights. And one of the best features? Parking was only $25 for self-park and it included in/out for the 24 hours. That was the cheapest parking I could find in the area. We would definitely stay here again!", "title": "great place", "user": "dbcooper67", "date": "September 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175243521}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Stayed here at the end of August, great location so close to the main attractions. Parking available under the hotel-great value at $25 a night with plenty of availability and nice wide parking spaces! Could take car in and out for excursions with no hassle at all. Direct access also from parking area to hotel lifts. Lovely, spacious and clean rooms with a refrigerator which Ive noticed not all similar hotels provide. Staff couldn't be more helpful, nothing was too much for them. Swimming pool fantastic with hotel towels on hand. Great value for such a nice hotel, definitely return if I'm ever back in DC!", "title": "Excellent value", "user": "AnneFowler", "date": "September 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 175222352}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "Stayed here for 3 nights from 7th Aug and loved this hotel. Rooms were clean and of an excellent size especially given the great price we paid. Staff were friendly and helpful and overall the location is pretty good. It's not far to walk down to popular tourist spots. I recommend the hop on hop off bus in Washington as points of interest are well spread out. We ate at the hotel restaurant for dinner and found it quite good value. Room service the first day was excellent. For those who find breakfast more than what you need try the West Wing diagonally over the road excellent value.", "title": "Great place to stay!", "user": "RescueRider", "date": "September 1, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 175105166}, {"rating": 4.0, "stay_parameters": "Stayed August 2013", "text": "Would highly recommend this hotel and if ever back in Washington would definitely stay here.", "title": "Surprising value", "user": "emorga", "date": "August 31, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 175037356}], "location": {"country": "United States", "city": "Washington DC"}, "stars": 3, "variance": {"poor": 52, "average": 144, "very good": 453, "terrible": 60, "excellent": 449}, "aka": "Washington Plaza Hotel Washington Dc", "slim_ranking": 0.248062015504, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}}