{"user_rating": 4.0, "review_count": 746, "name": "Washington Square Hotel", "reviews": [{"rating": 5.0, "title": "Clean & Safe", "text": "The room we had in this hotel was clean but simple. The rooms are not large but are adequate. Bathroom was very clean, fresh towels each day, maid service was excellent. Great location, close to many restaurants and sights. Continental breakfast included with room at $199/night. Looking forward to staying again next time we are in NYC.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "July 12, 2005", "id": 3661579}, {"rating": 3.0, "title": "Great Location, simple, small rooms! good value", "text": "YOU CANT BEAT THE AREA OR LOCATION! I love to save money on cheap hotels in the city. I say save your money, stay here, and spend a few extra days in NYC!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "June 7, 2005", "id": 3535252}, {"rating": 5.0, "title": "Very nicely done!", "text": "Dont expect much from your room and you will love it. Great rates, nice lobby, super small rooms, free breakfast, and spotty internet access!", "helpfulness": 9, "user": "A TripAdvisor user", "date": "June 6, 2005", "id": 3534622}, {"rating": 3.0, "stay_parameters": "Stayed March 2005", "text": "Stayed for 3 nights in June of 2005. Cost was roughly $195/night. First things first, the rooms are not large. Our room was about 10 feet by 10 feet, with a bathroom off to one side. Enough room for a double bed, two nightstands, small desk, tv.", "title": "Nice hotel at even nicer location!", "helpfulness": 7, "user": "Johnny22", "date": "April 28, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3421073}, {"rating": 1.0, "stay_parameters": "Stayed December 2004", "text": "For all the other reviewers who complained of the tiny hallways and rooms, it's Manhattan...grow up and deal with it. I've yet to find a cheaper alternative in Manhattan, let alone in Greenwich Village that provides what this hotel does.", "title": "Room 125 Hell On Earth", "helpfulness": 9, "user": "valmont", "date": "April 14, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 3357200}, {"rating": 3.0, "stay_parameters": "Stayed November 2005", "text": "I stayed in the washington Square hotel for 7 nights. I was never disturbed by noise and the room was always clean. The rooms here are small but every travel guide and website tells you to expect this - you don't go to NY to sit in your room. The bathroom too is adequate. I personally prefer the fact that this hotel does not have doormen, bell hops etc as if i wanted all of that I would stay at a luxury hotel that costs a lot more and this hotel never claims to be that. It isn't 'dated' it is a period building. The location is simply perfect - two subways covering 4 different lines just a block away and easy walking distance to Soho, east Village etc - all in all a great stay!", "title": "Location, Location - stop moaning people!", "helpfulness": 5, "user": "Sara28London", "date": "November 21, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 4130216}, {"rating": 1.0, "stay_parameters": "Stayed November 2005, traveled on business", "text": "This hotel has to be one of my worst hotel experiences to date. I travel frequently but have never seen something quite like this \"hotel\" as they call it. I would call it more of a hostel. There is no doorman, no bellman, no friendly faces on the staff. The place looks extremely dated, despite the front desk manager telling me that the rooms were recently renovated. Putting a new duvet on the bed is not renovating. The elevator opens into a stairwell, there is an ancient metal door between hallways which I was told was for fire safety, although the door was about 80 years old. The walls are paper thin and I didn't sleep at all due to the noise from the street and the halls. There are window A/C units. I haven't seen a window a/c unit in a hotel ever before. There was no desk, the TV was hanging from the ceiling and the carpet was stained. The first room I was in had a questionable stain on one of the beds, when I asked to be moved, the mgr insisted that there was no stain when he checked the room earlier that day. I asked him if he'd like to see it for himself and he declined. The room they moved me to had hair in the bed when I pulled back the covers. Needless to say, I would not recommend this hotel to anyone. The manager informed me that for the price, the accomodations are quite reasonable. I don't care about price, I expect service and quality. There are many places to stay in NY that are in great locations and charming, unfortunately this hotel is not one of them.", "title": "Horrible hotel, horrible staff", "helpfulness": 6, "user": "abol", "date": "November 16, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 4122261}, {"rating": 1.0, "stay_parameters": "Stayed July 2005", "text": "My boyfriend and I arrived to find out that our request to stay in a room several floors up was ignored. We were given a room on the ground floor for that evening and promised our reservation the next morning. We could not sleep due to the noise on the street. We also found out the next morning that it was on the direct route to the restaurant and awoke to the sounds of high heels hitting floor boards and people talking loudly outside our door. We arrived at the desk the next morning with our copious amounts of baggage to change rooms and were given blank stares by the day staff member. The only other room was a room on a smoking floor that smelt of smoke. We accepted it in the hope that we would at least get some sleep and were promised an air refresher machine which never arrived despite repeated requests. By far the worse aspect of our stay was the faulty ALARM SYSTEM!!! It went off accidentally 3 times during 4 days two being at 4am and 6am. We were informed by staff that it happens regularly and was offered no form of compensation. While standing around in the foyer with the other guests, cold and in my pyjamas, I firmly decided that (a) I would not stay here again; and (b) would write this review to warn others. It is in a great location though so look for somewhere else in the same area.", "title": "Terrible hotel - great location", "helpfulness": 5, "user": "Amsterdamer", "date": "November 9, 2005", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 4101418}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "This is a really nice hotel in a great location. It's a short subway ride to battery park or central park, and it is right across the street from the exxtremely family-friendly Washington Square park. We stayed at this hotel with our two children (age 3 and 5) and having a park across the street wtih pleasant, accessible playgrounds was a real plus. We also splurged on the newly rennovated rooms, and that was money well spent. We were in New York with several of our family members, and the unrennovated rooms were adquate, but nothing special. Also, we had a corner room--it was spatious. My sister's family had a much smaller room, and the four of them were quite cramped.", "title": "Nice little hotel", "helpfulness": 3, "user": "iowafamily", "date": "October 15, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4025971}, {"rating": 4.0, "title": "relatively cheap and cheerful", "text": "Whenever I visit NYC I stay in this beautifully located hotel. The rooms are simple, but efficient. (But bring candles to give the room ambiente!) The bathrooms are quite spacy and have a window. If you're staying in the double bedroom with q-size bed ask for the higher floors, as you will have a lovely view of the Village even from your bathroom! The staff is friendly and helpful. Breakfast (included) is very sober, but there are many nice breakfast places and restaurants in the area. The location is superb: within walking distance from SoHo, East Village, West Village, Union Square, Meat Packing District, Chelsea etc. Subwaystations around the corner. Very good price value!", "helpfulness": 6, "user": "A TripAdvisor user", "date": "July 17, 2005", "id": 3675153}], "location": {"country": "United States", "city": "New York City"}, "stars": 2.5, "variance": {"poor": 32, "average": 102, "very good": 353, "terrible": 20, "excellent": 239}, "aka": "Hotel Washington Square", "slim_ranking": 0.334085778781, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 5.0}}