{"user_rating": 4.0, "review_count": 253, "name": "Waterfront Village", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "The Waterfront Village is well located in a private, secure marina complex adjacent to the V&A Waterfront. The one bedroom apartment I stayed in was well appointed and furnished although there were some maintenance issues. The dishwasher did not work, the drain from the shower quickly backed up and one of the balcony doors leaked during a particularly heavy rain rainstorm. However, the level of service was good and they were very accommodating about extending a late checkout when my flight home was delayed. I intend to stay there again on forthcoming business trips and will be interested to see if there are any further maintenance issues. Until then I have given it an average rating. If you want greater luxury you should consider the Lawhill apartments in an adjacent development. Although significantly more expensive these apartments are larger as well as better equipped and maintained.", "title": "Good location", "user": "John H", "date": "August 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 173613365}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The two bed apartment that my wife, daughter and I stayed in, really was very good. It was in the Paramo building on the 2nd floor. It was a 2 bed , 2 en-suite place with a well equipped kitchen ( not that we used it) with a washing machine and tumble drier ( that we definitely used).", "title": "Excellent location and very nice appartment", "user": "Dynamodoris", "date": "August 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172766423}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "The apartment was very well equipped, clean and very comfortable. It was also very quiet - we didn't hear a peep from any of the surrounding apartments. We only had the odd gripe about it - one of the bedroom doors was loose on it's hinges when we arrived ( but was fixed quickly) and the telephone only worked intermittently.- we did report this but it still had a problem with it. When trying to call the apartment from outside ( on its own number ) the phone didn't work at all. We could phone reception sometimes on it. The safe in the room was also locked when we arrived - again we asked for it to be unlocked, but this didn't happen by the time we'd left", "title": "Exactly what we like !", "helpfulness": 2, "user": "888888888888888888", "date": "August 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170906670}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "I must re-iterate that these were only very small gripes and all in all, the apartment was very good. The staff at reception were also very good. They arranged trips out for us, booked taxis as required, and looked after our bags after we'd checked out but before we went to the airport.", "title": "Wow...tion ! - Accomodation / Location / Attention / Emotion", "helpfulness": 1, "user": "phabreus", "date": "July 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169339780}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "The apartment was in an excellent location, next to the Cape Grace Hotel, overlooking the marina, with a view of Table Mountain behind. It was literally a 2 minute level walk past the Cape Grace hotel , over the footbridge, to the shops / restaurants at the V&A Waterfront. There were security guards everywhere and we never felt threatened walking back from the V&A later in the evening. Even though this was the low season there were plenty of people around. Checking in was a but of a faff as we had to be issued with security passes that you swipe to gain access to the site and the apartment building.", "title": "Great Apartment, with Good Location !!!", "helpfulness": 1, "user": "Mumbai89", "date": "July 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 166879195}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "I am all praise about the Waterfront Village. We were in a 2 bedroom apartment ground floor, right in the front, over looking the spectacular boats. We could walk easily and safely to the Aquarium, restaurants, the V and A Waterfront and children's play areas. We opted for an upgrade in accommodation as our dollar is so high, and it was worth it. The staff booked any outings we wanted and made enquiries for airport pick up, taxis, High Teas, rental cars and safaris. We travelled as husband and wife with a 4 year old daughter. I loved having the apartment serviced every day and the security guards always on stand by.", "title": "Family Holiday", "user": "Stephanie B", "date": "May 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161495515}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "Location of my apartment was great, could not have been better. I travelled with a group and my apartment was not up to the standard of my fellow travellers. The shower head was not functioning properly, the tiles were in a bad state of repair and the apartment had an awful smell but overall had everything I needed was there, housecleaning was done daily. Short walk to V & A, very high security. This was sold to me as 5 Star so would be poor value for money.The group of women travelling were spread out over several blocks and therefore very isolating, I was the only one in B Block.", "title": "Great location", "user": "Jan H", "date": "May 16, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 160856996}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "the accomodation is ideal for relaxation and sight seeing in capetown. the outside view presents interesting breath taking especially canal which allow for canoeing and sea activities.", "title": "ideal quiet accomodation for relaxation and work productivity", "user": "samuel a", "date": "May 13, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 160550281}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "the nearby V&A area is within working distance and a place to visit, eating and to see different live band displays by different band groups. this can be accessed on foot through the back entrance to the village.", "title": "Most unhelpful staff I have ever met & NO INTERNET!!!!!!", "helpfulness": 3, "user": "TLee41", "date": "May 10, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 160314311}, {"rating": 1.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "the surrounding of other hostels and the nearby CBD is makes it quite accessible. the affordable and reliable taxi services readily available adds to staying here interesting.", "title": "Beautiful location, inept service", "helpfulness": 2, "user": "MarkP_9", "date": "May 9, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 160183968}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Good apartment with beautiful furniture .....good selection of glasses and very comfortable..what a pleasant stay! The parking is undercover and very close to the apartment. I like the fact that you don't have to use a lift at all and that you are situated on the first floor.", "title": "Bannockburn 102", "user": "capewls", "date": "May 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 159716051}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "My wife and I stayed here in a one-bedroom apartment for eight nights in January 2013. Everything was done to a high standard, and the location was superb. Excellent parking arrangements. The only flaw in the accommodation was the very patchy and slow wifi, which had to be re-booted each time we wanted to use it. But overall a very good place to stay, which we would hope to use again.", "title": "Great location near V&A Waterfront", "user": "Sandford47", "date": "April 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157201707}, {"rating": 4.0, "title": "Amazing apartment, outstanding location. Just a little better communication for bookings needed.", "text": "We stayed in a three bed apt which overlooked the marina at the front and table top mountain at the back. The apartment was stunning. Exquisite decor and amazingly well equipped. The only concern for us was a break down in booking communication. We sent deposit details as requested and were asked again for them at least twice!!! But overall the place to stay on the V n A dock. Room tip Pembroke A 302.", "user": "Emfc", "date": "March 30, 2013", "id": 156033580}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Very enjoyable stay. Views terrific, table mountain and marina. Facilities excellent. All round a very nice Apartment. Very clean and well equipped. Only disappointment was the lack of an eggcup!!! Furnishings were very nice. Security was very good and parking facilities fine.", "title": "Parama", "user": "Kittyjacqui", "date": "March 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155908732}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "The Waterfront Village is in a great location & within an easy stroll of the V&A Waterfront. The apartment was modern, very well maintained & furnished with all amenities & looked out over the canal. Security wise the site was brilliant & we felt very safe in this area. The whole site was very clean & tidy throughout. We would definitely stay there again when next visiting Cape Town.", "title": "Great place, great location", "user": "Sue H", "date": "March 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 155722249}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We booked a 2BR/2BA apartment for 2 couples and got 2 very large suites with a huge terrace overlooking the Waterfront Marina and the One&Only hotel. Turned out that both Bon Jovi and Justin Bieber were staying there and were to play at the Stadium - so we experienced extreme security and the distant sounds of both concerts (Bon Jovi good even at a distance, Bieber seemed to excite the 12 year olds to screaming). Apartment was clean and maintained daily (which we did not expect). It would have been better if there was a manual to explain how to use the AirCon, the TV, and the radio. We had a minor failure with the safe, but it was a dead battery and was rectified in only a few minutes. Having used vacation apartments all over, we were somewhat disappointed with the kitchen equipment - it appeared to have a lot of things, but a lot that we would have used were not provided. They did provide bath amenities, and dishwasher pucks. It was great to have a full laundry, but we had to buy laundry soap (expected). We were definitely able to walk to the ferry to Robben Island, to the Victoria & Alfred Wharf Shopping area (huge), and to lots of good restaurants. Biggest surprise for Canadians and Australians was the prices of things - all extremely reasonable by our standards. Staff for the apartment office were friendly and helpful. Too bad wifi was only available in the reception area for free, it was unreasonably expensive for the apartment, so we did not buy it as an extra.", "title": "Apartment Specific Experience, Great Location", "helpfulness": 1, "user": "TravelTwinkie", "date": "June 16, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 164167754}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "All in all a great experience which we would recommend to apartment-style travelers. Be patient, it's still Africa.", "title": "Suited our needs", "user": "stalks", "date": "June 13, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 163854748}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Perfect for two couples travelling together,2 bed 2 bath,it was well suited for our needs.A manual with instructions for air con,cook top etc would have been useful and time saving. Location and proximity to points of interest and the HOHO bus pick up point was perfect. The only thing that would of enhanced our stay would have been the convenience of WiFi in the apartment.Staff at the complex were all friendly and approachable.Would recommend if looking for the self catering option although as Australians we found Cape Town remarkably inexpensive so eating out was very cheap.", "title": "Great Appartment, not so great management", "helpfulness": 2, "user": "dave s", "date": "June 10, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 163533284}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "I looked at 3 1-bedroom appartments, 2 in Juliet and Helensee 002. I took the latter which was significantly bigger than the 2 in Juliet, which were quite small.", "title": "My Chosen Location", "helpfulness": 1, "user": "Royram53", "date": "May 28, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 162139317}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "The location is excellent, but unfortunately management is rather poor. Check in took ages, only one key could be found and reception seemed rather chaotic. I was prepared for this from other TRipAdvisor reports, but it was still a little annoying.", "title": "Room with a view", "helpfulness": 1, "user": "Riccardo V", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162062735}], "location": {"country": "South Africa", "continent": "Africa"}, "stars": 4, "variance": {"poor": 16, "average": 22, "very good": 68, "terrible": 12, "excellent": 135}, "aka": "Waterfront Village Hotel Cape Town Central", "slim_ranking": 0.4, "description": "The Waterfront Village is situated on the water's edge in the picturesque marina and offers a unique and exquisite setting. Located in the world renowned V&A Waterfront in Cape Town, the marina development is one of the most desirable properties in the world. All luxury serviced apartments are fully equipped and well appointed with the qualities you would expect from a 5 star graded establishment."}