{"user_rating": 4.5, "review_count": 633, "name": "Watergate Bay Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Fab!", "title": "Tippety Top!", "helpfulness": 1, "user": "JMuk", "date": "July 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 34001644}, {"rating": 4.0, "title": "Strange but true", "text": "We took our dog with us so were limited to room type. We had a standard room on the ground floor which was perfect as we had doors out on to the garden which was great for us, dog and little one. The room was small, especially as we had the travel cot up as well, but actually it was fine. OK so it wasn't a fancy room with rolltop bath in the window, but it was very comfy, and had everything we needed. Perhaps not enough places to put things up out of a toddlers reach but that's nitpicky! The bed was large and very comfortable, black out curtains keep you sleeping soundly when the sun is up at 5am. There's no aircon and boy it was hot hot hot! But I guess in the UK that doesn't happen often and you can leave the windows and door open. I had a fan delivered from reception and that made it better. First tip: if you're using the hotel's travel cot, bring a travel cot mattress as they just provide the standard hard mattress that comes with the cot.", "user": "WaltR", "date": "July 5, 2009", "id": 33952704}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We tried all the different dining options - breakfast in the hotel is great, but beware those without children - it can get a little hectic with lots of hungry children in the morning. Dinner in the Brasserie was better than expected, the Living Space does great food as does the Beach Hut and Fifteen. Living Space is just lovely in the evening - watching the sun go down on the terrace with a cocktail - could have been anywhere in the world! Fifteen was brilliant, WAY above my expectations. But my fave is the Beach Hut. Tip 2: Bring plastic plates and cultery if you need them for toddlers, hotel doesn't provide them.", "title": "Great funky hotel", "user": "MrsFussbags", "date": "June 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 33152523}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Tip 3: Childrens tea is expensive (for those not on db&b options) it's £12 - so we opted to just buy a childrens tea in the Living Space - fab pasta and pesto for just £3.50, home made fish fingers and chips for a similar price. It's also a bit quieter as childrens tea can get a bit busy, or we went to the Beach Hut for other great child friendly food options. The fish and chips at Lusty Glaze is to die for, and you can work it off carrying children and assorted paraphanalia back up the steps!", "title": "Second time just as good", "user": "travelling_bear_9", "date": "June 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 33013769}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "There is a great childrens play room - perfect for the under 5's, and a pirate ship outside. The outdoor swimming pool was heated to bath temperature (what a treat) and was a firm favourite with all of us. Sure it was a bit tatty round the edges, but perfectly usable with comfy loungers available by the pool and also on the grass close by.", "title": "Fantastic stay in excellently equipped hotel!", "user": "Beachytype", "date": "June 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31777558}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We stayed for 3 nights/4 days on the 'Taste of the Bay' deal. This represented excellent value for money. For £185pp we had 2 evening meals, 1 of which was at Jamie Oliver's 'Fifteen' restaurant, the other in the hotel brasserie, 1 hearty lunch at the Beach Shack consisting of 2 courses and 3 of the best breakfasts that I have ever tasted! The hotel is situated on a lovely bay, on a gorgeous sandy beach with amazing views. We had a lovely ocean view from our room which was very comfortable, perhaps a little stingy with the toiletries, but that was that was our only criticism. (An iron, hairdryer, iPod docking station, flat screen tv /dvd player, broadband access ,all standard) The staff couldn't have done any more for us.They were all very friendly and nothing was too much trouble - they were like this with everyone! The hotel attracted clients from all age groups- couple with young babies, young children, young couples through to OAPs. It was a lovely atmosphere and everyone seemed to be enjoying it. We were very lucky with the weather, brilliant sunshine for our 4 days. We hope that they have this deal on next year, as we can't wait to get back!", "title": "Fantastic deal, fantastic weather, would thoroughly recommend", "helpfulness": 1, "user": "BrammieBucks", "date": "March 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 26696481}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "The location of the hotel is brilliant.", "title": "Romantic Getaway Ruined by Disappointment of Fifteen Restaurant", "helpfulness": 2, "user": "Caroljd", "date": "March 22, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 4.0}, "id": 26600699}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We booked room 1 which was a suite with stunning sea views the room was spacious and exactly as described on the website.", "title": "Very disappointed & not worth the money - but fantastic location", "helpfulness": 1, "user": "Jalapenojo", "date": "February 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 4.0}, "id": 25307859}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "The service on check in was very good and the staff were very friendly.", "title": "perfect view, excellent food", "helpfulness": 1, "user": "alimot", "date": "February 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 25262882}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We had dinner at Fifteen that night and were tremendously disappointed. We had the sampler menu which was £50 per head, we looked at the menu outside the restaurant and were impressed with the choice.", "title": "Dreadful service - what a shame!", "helpfulness": 4, "user": "goodie4", "date": "February 21, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 24886887}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "We are a family of 4 who stayed in a family room in the main hotel for 4 nights before the Easter weekend. The family room consisted of a main bedroom and bathroom (great shower!) and a seperate small bunkroom for the childfren. The rooms were well decorated and maintained and kept very clean. They were also well equipped with TV, telephones, iPod docking station, etc, though we didn't spend much time in them at all. After checking in (very easy, with pleasant helpful staff who fuly explained what was on offer - free children's entertainment and 'taster' lessons in things like surfing and bodyboarding - during our stay) we headed straight to the beach, which was excellent - clean, uncrowded and right outside the hotel! The children also used both the indoor and outdoor pools at the hotel and they had no complaints, but be aware that there are no staff on duty at the pools and that children under 16 need to be supervised by an adult. The hotel also provides internet access and there is a small computer/games room which is useful if you haven't brought your own laptop or the children haven't brought their Gameboy or whatever they use. There are only 2 computers though and I think 4 games consoles so I guess it could get busy if the weather is bad. To use the games consoles you have to leave a £10 deposit for the games controllers (and also for any other games equipment, such as table tennis bats, you borrow) which you obtain from reception. There is also a large children's playroom with TV downstairs in which here was free entertainment during the afternoons when we were there, which was a nice touch. The food, both at breakfast (an extensive buffet) and dinner was excellent and the service couldn't be faulted. The staff in all areas of the hotel were unfailingly helpful and well mannered and nothing was too much trouble. The only comment I would make about dinner is that the wine can be expensive, but I guess that's to be expected in a hotel like this and you don't have to buy it! We also found the food and drink in The Beach Hut, whilst very nice, rather expensive though the food in the hotel bar area was more reasonable (and very good - the cream tea scones in particular were delicious, and definitely hit the spot after an afternoon's surfing), as were the bar prices if I recall correctly. We also used the Extreme Academy to try surfing for the first time for all the family. My wife was a bit reticent about trying this but we all ended up being totally hooked and had a fantastic time, and luckily when we booked they were doing a 2 days for the price of 1 offer! On our 3rd day the children joined the hotel's free bodyboarding 'taster' session and I just hired a wetsuit and board and joined them for another afternoon in the surf, my wife deciding to have a relaxing afternoon on the beach. The Extreme Academy staff were very good but could have been a little more proactive in the water, though I guess they were more concerned with keeping an eye on the children than with advising adults on their surfing skills, so I can't really complain about that. The owner was also a bit keen to get people out of the premises and shut up shop at the end of the day and could have been a little more tolerant - as parents it's not always easy to move at lightning speed when you're dealing with teenagers and trying to get small children out of wetsuits and showered and changed. However, the hire/tuition charges for surfing were reasonable and the instructors seemed to know what they were doing, which is always good! :-) Overall, our first visit to the Watergate Bay Hotel and it's environs made a very favourable and lasting impression and we will definitely be back, though maybe not in the main hotel as we did feel it was a little expensive (over £280 per night DBB for a faily of 2 adults and 2 children) even if it was the Easter holidays. We'll either try the Coach House (still part of the Watergate Bay Hotel but cheaper rooms) or maybe even take the children out of school so we can take advantage of some of the offers mentioned by other reviewers on Tripadvisor. We would thoroughly recommend a stay at the Watergate Bay Hotel though, and are already looking to book for next year.", "title": "Excellent hotel in a superb location, if a little overpriced", "helpfulness": 1, "user": "oracledba", "date": "April 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27992296}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "For us this was all we required for a weekend away from the kids. Our room had great view (room 22 has a bath in the window overlooking the beach!), a very relaxed atmosphere and amazing location. \"Fifteen\" is a right next door and makes the stay complete. Well recommended. Only disappointment was the pool which was a bit small and unwelcoming.", "title": "Fab seaside hotel", "user": "mitcharj", "date": "April 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 27404068}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Myself and my partner stayed at the Watergate Bay in the middle of March on their ‘taste of the bay’ deal. We upgraded to have a room overlooking the beach but even so – the price was still only £185 each which for what we got was an absolute bargain!", "title": "A fantastic 'taste of the bay'!", "helpfulness": 2, "user": "MemberSouthWest", "date": "April 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 27232108}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Included in the price was a three night stay in the hotel, 3 breakfasts, one evening meal in the hotel, one evening meal at ‘Fifteen’ and one lunch in the Beach hut on Watergate Bay. Amazing value!", "title": "The British Beach Hotel reborn", "helpfulness": 1, "user": "Jonnymitch", "date": "March 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27166156}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "The hotel is very stylish and ‘beach chic’ is definitely the theme. The rooms were a little small but to be honest waking up to the view of Watergate Bay more than made up for the slight disappointment on room size! The room was really nicely decorated – the docking station for the ipod was a really nice touch.", "title": "Amazing weekend - helped by the weather, a real familiy friendly place without the chaos of kids discos etc!", "user": "CouchFamily", "date": "March 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 26718889}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "Having been a regular WBH visitor now since the early 90's its good to report that year on year they iron out more and more wrinkles - only area really last year that needed improving on was food choice/range and we found the food this year to be of a much improved standard both in quality and choice.", "title": "Much improved food and service for 2009", "user": "ITTS", "date": "June 2, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 31363041}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "Service levels and staff professionalism were much higher as well which all made for a stay that justifies the price tag.", "title": "Perfect family hotel", "user": "LondonRMc", "date": "May 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30736027}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "The one thing I'd ask the management to consider is that as they encourage more non residents to use the main bar for food and drink the net result can be that residents are left struggling to find a seat to enjoy a drink or snack, particularly in the early evening. The cost of staying at the hotel isn't trivial and there needs to be a recognition that residents need to be looked after first and foremost.", "title": "HAPPY TO HAVE RETURNED", "user": "Travelersrest21", "date": "May 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30460234}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "We spent a very happy bank holiday weekend at the Watergate Bay hotel.", "title": "Great family hotel by the sea", "helpfulness": 1, "user": "Redfred1000", "date": "April 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28726745}, {"rating": 1.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "It's a very convenient 5 minute drive from Newquay airport (but you don't hear aircraft). It's a great spot right on the beach, in a small cluster of buildings, one of which is Jamie Oliver's 15.", "title": "Beware the Coach House !", "helpfulness": 5, "user": "tpmorrow", "date": "April 14, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 3.0, "rooms": 1.0}, "id": 28017457}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 30, "average": 62, "very good": 142, "terrible": 17, "excellent": 382}, "aka": "The Hotel And Extreme Academy, Watergate Bay", "slim_ranking": 0.12, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Watergate Bay Hotel gives you all the great things you'd find in a mountain resort - on a beach! It's an awesome mix of adrenalin sports, gorgeous accommodation, great places to eat and drink, inspiring people and a relaxed vibe."}