{"user_rating": 4.5, "review_count": 164, "name": "Water Street Hotel & Marina", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We stayed 3 nights recently, after spending a week at the Marriott Resort nr. Panama City. The hall area was dark, the kitchen was of a good standard, as was the sitting area. The double bedroom was very dark, with only 2 table lamps. At breakfast on the first morning, we found we had no toaster, no dish-washer powder or washing up cloth - despite asking for these twice, it took the third time of asking to get these. It looked as though the previous occupants of our room had walked off with the toaster! There was no inventory of what should be available equipment-wise, which was strange - how else do you know what should/should not be there?", "title": "Let down by poor housekeeping", "user": "jeanjeannie", "date": "March 13, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 58451925}, {"rating": 5.0, "stay_parameters": "Stayed June 2009", "text": "When we got back to the room after being out all day, we found that the bed had been made, but the floors hadn't been swept and, annoyingly, the body lotion and conditioner had not been replaced. This was the same every day and on the last day, even the soap on the wash basin had disappeared. This hotel is not cheap and for the price you pay, you expect to have the room cleaned every day. We travel a lot all over the world and have always had our room cleaned on a daily basis - surely it is what happens wherever you stay?. It was a shame, as this lack of supervision over the housekeeping spoilt an otherwise nice place.", "title": "Our choice of stay for our destination wedding", "user": "aoash", "date": "March 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57619693}, {"rating": 5.0, "title": "Great place - very Family and Pet friendly", "text": "The check-in staff were very friendly, but there was no-one around when we had to check out at 7.30am to get to the airport.", "user": "k9water", "date": "February 18, 2010", "id": 56372772}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Continental breakfast was included, but this was actually orange juice, yoghurt and a muffin that was left in the 'fridge. Not what we were expecting.", "title": "Modern southern comfort, great room view in an old coastal town", "user": "TallahasseeGators1", "date": "February 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55970936}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "For our destination wedding in Apalachicola, Water Street was our top choice in planning. My room became both my bridal suite (perfect for space and gorgeous getting-ready pictures) and our temporary honeymoon suite (until we left for Jamaica). The majority of our families and friends also stayed at WS. The personnel were wonderful in helping with planning and any services. We had both our rehearsal dinner and wedding party brunch on the pool patio and both went so perfect and looked fabulous. I can't say enough wonderful things about Water Street. My husband and I plan on returning to Apalach at least once every year to celebrate the memories of our wedding celebration. And there is no doubt we hope to be able to stay at WS for every return visit.", "title": "Beyond any shadopw of a doubt the nicest place to stay in Apalach", "user": "goinggalt21", "date": "January 27, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54537031}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "This was a return visit for my husband and me. From the moment of check-in when you are welcomed with a glass of wine, you expect this to be a special place (and it is). While there are numerous excellent dining options nearby, simply sitting on the veranda watching the river roll by provides one some great R&R. The veranda is screened, by the way; hence no mosquitoes or flying insects to break one's reverie. The photo was taken through the screen and shows the Apalachicola River, one of America's treasures. The property is well maintained -- very clean. These accomodations are luxurious enough to pamper the most discriminating traveler yet provide a very relaxed experience in an old Florida setting.", "title": "Luxurious accommodations in relaxed old Florida setting", "user": "Ms_Pat", "date": "May 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63963811}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Our hotel room which was really an an apartment, was beautifully furnished and spacious. It gave us the opportunity to do a little self-catering and after almost three weeks in the States of staying in Bed & Breakfast accommodations, that is precisely what we needed. We would highly recommend it. We appreciated the staff''s concern each day that we had everything we needed in our suite and felt that our stay of four nights there was both enjoyable and great value for money", "title": "An excellent place to stay in Appalachicola", "user": "Teckel", "date": "April 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61967663}, {"rating": 3.0, "stay_parameters": "Stayed April 2010", "text": "A large group of friends have stayed at the Water Street Hotel & Marina for the past three years. Most have stayed here on other occassions. They advertise that they have a golf cart shuttle which we needed for one person in our group that was unable to walk any apprecible distance. The golf cart sat there three days but there was no one that could take anyone anywhere for dinner two nights and breakfast one morning when we requested it. When we said we would take the person that could not walk downtown and bring the cart right back the reply was \"that is against policy\". When asked about a cab they offered to get one for $70.00. This was for a four block ride. The staff didn't seem overly concerned about the problem or the individual that could not go eat with us.", "title": "Don't Count on the Golf Cart", "helpfulness": 1, "user": "RMJMW", "date": "April 19, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61914558}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "A beautiful setting and wonderful rooms but don't count on all that is advertised being available.", "title": "Better than my house!", "user": "CecilyGeorgia", "date": "April 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60987839}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We were so surprised when we opened the door to our beautiful suite. I had no idea that the place was more like a condo than a hotel room. After coming from a cramped room at a Disney resort hotel, this was a spacious, luxuriously decorated paradise. Our room had ample space for the three of us, a full kitchen stocked with cooking necessities, and a huge porch overlooking the creek, river, and bay. Also, the hotel was very quiet-at the end of Water street, which is mostly oyster processing plants and some awesome restaurants. Also, the price was great. We felt that we'd gotten a great deal!", "title": "Favorite Hotel During Three-Week Tour", "user": "wonderfulworld", "date": "April 1, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60129021}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "We just returned from a 4 night stay at the Water Street Hotel. This hotel is perfect. My husband is a full-time wheelchair user and the accessible room we had was fully ADA accessible, right down to a roll-in shower. The staff at the hotel is very accomodating and friendly. The town, like many older towns, does have some challenges for wheelchair users but everyone was more than willing to assist with getting his chair into restaurants etc. Granted there are some stores and restaurants that you just can't get a wheelchair in due to steps, but all in all we found it to be a wonderful place to visit. We had oysters at Boss Oyster, crab cakes at the Grille and a wonderful lunch at the Owl Cafe.", "title": "Wonderful place", "helpfulness": 2, "user": "floridatravelinggal", "date": "November 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49336724}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled solo", "text": "Wonderful atmosphere, easy-living, obviously modeled from top to bottom in the organization.", "title": "The Water Street Hotel is the BEST!", "user": "FrannieCalifornia", "date": "November 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49084811}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Me and my girlfriend have been to this hotel twice and both times we had a great stay. The service was nice and the hotel is very clean. The rooms are more like condos. You get a full kitchen, den, bedroom, day bed room, two bathrooms, and a screened in porch for the price of a hotel room. Also you can negotiate the price of the room to get it a little cheaper (I got twenty dollars off just by asking).", "title": "The Place To Stay In Apalachicola", "helpfulness": 2, "user": "rob1mm", "date": "November 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 48765835}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The hotel is located within walking distance of the downtown area where the shops and dinners are located but if you don't want to walk you can drive or get a ride in a golf cart from the hotel. They will drop you off and pick you up when you call.", "title": "What a great hotel!!", "helpfulness": 3, "user": "travelear", "date": "October 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45687412}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "They also give you a free glass of wine with your stay. At the end of your day you can sit on the porch enjoy your wine and the beautiful view of the majestic Apalachicola bay.", "title": "Not a standard hotel.", "helpfulness": 2, "user": "dpugh965", "date": "September 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 43753057}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "We stayed at the Alpharetta River Inn (formerly Rainbow Inn) for two decades, but that place literally is falling into the water. We waited with great anticipation for this place to be built..which seemed to take FOREVER.", "title": "Second year at Waterfront... best deal in town!", "user": "wilbret", "date": "June 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 68594850}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We rented a house with dock access for a year, but we were stoked in 2009 when this place was available... we were BLOWN AWAY by how nice it is!", "title": "One of the nicest places I've ever stayed.", "user": "nitae", "date": "June 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 67736444}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled solo", "text": "The rooms are huge and downright luxurious. We had a suite with a full kitchen and 2nd room with a bed. There is a large, screened in private porch for each room. Very very nice to watch the boats go by, and the occasional gator!", "title": "My new favorite place", "user": "missiejo", "date": "June 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67242213}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The sunrises are outstanding most of the time, mist off the river sometimes impedes the view.", "title": "great place to stay in Apalachicola", "user": "baladrar", "date": "January 8, 2010", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52907627}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "GG", "title": "An apartment feel in a hotel setting.", "helpfulness": 3, "user": "TampaFLRuthy", "date": "December 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 52265578}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "What a beautiful hotel! I really can't add to all that's already been said. Our room was like a condo.,. full kitchen, 1.5 bedrooms, 2 bath. I loved the screened in porch..... Unfortunately, the weather was very chilly and we weren't able to put it to use. I wish we could've stayed longer than one night. It was my first visit to the panhandle of Florida and I am smitten. I will be back!", "title": "Beautiful.", "helpfulness": 3, "user": "KarenSMichigan", "date": "August 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77726334}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The Apalachicola/Port St. Joe/Cape San Blas area of the Gulf is a funky place, with many inns and B&Bs to stay in. However, I'm not a fan of B&Bs and quirky inns where you have to dine with other travelers and feel obliged to interact with the innkeepers. That said, I also wanted to experience the uniqueness of the area -- and Water Street was PERFECT!", "title": "Loved it.", "helpfulness": 2, "user": "Allison D", "date": "July 28, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 72748279}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 5, "average": 4, "very good": 16, "terrible": 2, "excellent": 137}, "aka": "Water Street Hotel And Marina", "slim_ranking": 0.2, "description": "Thirty NEW upscale condominiums with all the services of a hotel! The minute you step onto the grounds, you'll lose track of everything but the beautiful natural wetlands and the lazy Apalachicola River. If you enjoy solitude, you'll enjoy this. One and two bedroom, two bath condos feature a living-dining area with fully equipped kitchen, stainless steel appliances, washer-dryer, flat screen cable TVs, high speed internet, private screened veranda overlooking the river, outdoor pool and daily maid service."}