{"user_rating": 4.5, "review_count": 585, "name": "Wedgewood Hotel & Spa", "reviews": [{"rating": 5.0, "title": "A Fantastic Hotel", "text": "Stayed at the Wedgewood for 5 nights on our recent holiday and whilst it was the most expensive accomodation of our hols it was well worth the money. As said by others the little touches such as cookies and the chocolates on arrival make the place stick in the memory. Great location just off Robson Street makes everywhere walkable in a city that is a joy to walk around. Also had a meal in the hotel restaraunt \"Bachus\" which was excellent, i'd recommend going for a meal even if your not staying at the hotel, great food in elegant surroundings. All in all a very enjoyable stay in a hotel that has the peresonal touch. On a previous visit we stayed in the Fairmont Waterfront which is another fantastic hotel but i think the Wedgewood pips it for it's little touches as well as it's great rooms.", "helpfulness": 8, "user": "Quakerpaul", "date": "August 3, 2005", "id": 3734601}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "We stayed here at the start of our honeymoon in a Wedgewood suite which was fantastic. Nice and large and very comfortable. The room overlooked Robson Square and is only a few minutes walk to Robson street.", "title": "Wonderful", "helpfulness": 11, "user": "jeff.l", "date": "July 22, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 3691816}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "Very friendly / helpful staff.", "title": "Quality Hotel!", "helpfulness": 13, "user": "Napa", "date": "July 14, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3665345}, {"rating": 5.0, "title": "Pampered at this Boutique Hotel", "text": "The cookies at night were gorgeous and a nice touch as was the free net access to check weather / update on lost luggage etc...", "helpfulness": 11, "user": "A TripAdvisor user", "date": "July 10, 2005", "id": 3653921}, {"rating": 2.0, "stay_parameters": "Stayed June 2005", "text": "Jeff.", "title": "OK, not great", "helpfulness": 13, "user": "fischman44", "date": "June 30, 2005", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 3.0}, "id": 3621751}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "We stayed at the Wedgewood earlier this month for two nights as part of our family vacation. It was pleasant. We had an executive room that was nice and comfortable. There was a small bar with stools and a minibar toward the entrance of the room. The bathroom was large with a great, deep tub. Turn-down service was a nice touch, with the cookies and water. We had a large balcony, with chairs. I'll admit that our view was terrible. We were on the left side of the buidling, and despite previous requests to have a room facing the art gallery, our veiw was of the Sheraton across the alley. The staff was generally friendly. Cameron, the bellhop, was always recommending great places to go or eat at. (Cameron recommended The Blue Water Cafe. It's a great restaurant which I also highlyrecommed. It's expensive, but you really get what you pay for.) The people at the front desk were always smiling, with the exception of one man, who we kept having to remind to bring the mini-bed up to our room, and would sometimes would \"forget\" to smile. Overall, this is a 5-star hotel, with 5-star accomadations and a 4-star veiw and service. Regardless, my family and I enjoyed our stay at the Wedgewood Hotel and hope to return again.", "title": "Great Hotel in Beautiful Vancouver", "helpfulness": 9, "user": "MeetmeinSanJuan", "date": "August 25, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3807622}, {"rating": 4.0, "stay_parameters": "Stayed July 2004", "text": "My wife and I stayed here for 3 nights as part of our honeymoon. The hotel was beatifully presented and our room was spacious and included a very large bath tub which was accessed directly from the bedroom area - very original!", "title": "Great location - beautiful hotel", "helpfulness": 10, "user": "daccas", "date": "August 22, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3796657}, {"rating": 2.0, "stay_parameters": "Stayed August 2005", "text": "The service was fine although one of the receptionists (long blonde hair) always struggled to raise a smile!", "title": "Disappointed with Wedgewood", "helpfulness": 13, "user": "CindynGA", "date": "August 20, 2005", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 3791912}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "The hotel is situated in a very good place, right in the heart of Vancouver and within walking distance of pretty much anything.", "title": "The Best", "helpfulness": 8, "user": "JohnEverson", "date": "August 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3791881}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "No complaints at all and the cookies were a nice little extra. It makes you wonder why other hotels don't do a similar thing. Its funny how something that costs a hotel so little is the one thing most people remember....", "title": "Lovely!", "helpfulness": 8, "user": "tinylibrarian", "date": "August 3, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3734908}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Thank goodness we were staying at The Wedgewood because it poured rain for the entire week. We found ourselves looking forward to returning to our hotel each day and night. The linens are lovely and the twice daily housekeeping visit was much appreciated. We decided to check out for two days for a quick visit to Whistler and the hotel offered to keep some or our luggage so that we could travel lightly. Oh yes and the location is just great. We will definitely stay there next time.", "title": "O.K. the good news was we were at The Wedgewood", "helpfulness": 12, "user": "Ledeuce", "date": "November 3, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6051912, "likes": {"liked": "— warm and inviting. A quiet sleep experience."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "I wanted to pass on cudos to the staff of the Wedgewood Hotel and Spa in Vancouver for a wonderful stay on Aug 15th -16th, 2006. I really appreciated being able to check in as soon as I arrived into Vancouver from the West Coast Express at 8:30 in the morning. I could not have been more thankful. This small gesture allowed me to have a totally stress-free day. I almost cried I was so happy.", "title": "Kindness and Elegance at the Wedgewood", "helpfulness": 9, "user": "clash", "date": "October 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6016132, "likes": {"liked": "— The flexibility of the staff.", "disliked": "— All was great"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "I stayed there as a surprise anniversay gift to my husband. We did not have a honeymoon and have not had a chance to get away alone since our son was born 4 years ago.", "title": "An excellent hotel", "helpfulness": 9, "user": "Marta Hari", "date": "October 13, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5950487, "likes": {"liked": "— The service we recived", "disliked": "— The reserved tables in the bar"}}, {"rating": 5.0, "title": "Bacchus Restaurant / Bar tops my list", "text": "The staff is amazing. From the serving staff in the dining room to the room service and valet staff – everyone was so wonderful. The staff treat everyone with warmth and kindness...I felt like royalty.", "helpfulness": 11, "user": "excanuck", "date": "October 5, 2006", "id": 5910580}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The decor is breathtaking - art deco elegance...warm and beautiful. The location is perfect for shopping, sight seeing, or taking in the vibrant night life of Vancouver.", "title": "Overall a wonderful place", "helpfulness": 9, "user": "pdchi", "date": "October 5, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5910578, "likes": {"liked": "— service and bed comfort", "disliked": "— size of room"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2005, traveled on business", "text": "The lovely touches everyone talks about are fabulous it's true (a small box of chocolates, bottled water, cookies at bedtime), so it seems stingy to complain about them, but the cookies were stale!!! :)", "title": "Nice, but not fantastic", "helpfulness": 7, "user": "Raath_ki_Rani", "date": "May 20, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 3488710}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "Anyway, on to the real review: I've stayed at the Wedgewood a couple of times. I unqualifiedly loved it the first time about two years ago. This time, a few qualifiers. The king bed was fine but not fantastic. The room itself was large and roomy and nicely appointed (toiletries were quite nice). The view I had was not great. Do definitely try to get a balcony room looking out on to the courtyard. Service was okay, but again not superlative. The first time I stayed here it was superlative.", "title": "The best that Vancouver has to offer", "helpfulness": 7, "user": "mari129", "date": "May 19, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3486454}, {"rating": 4.0, "title": "Overly expensive", "text": "If you get a chance, make reservations and have afternoon tea at Bacchus (the Wedgewood's restaurant). It's really wonderful, with *divine* scones. I'm vegetarian and they very easily catered to my needs. It was really fantastic, though a little pricey.", "helpfulness": 9, "user": "madisonken", "date": "April 30, 2005", "id": 3426937}, {"rating": 4.0, "title": "honeymoon haven", "text": "We were a group of 8 people celebrating my husband's surprise party. This review is from all 8 of us. From the moment that you walk into the foyer and are greeted like family until the very end in which you are wished a wonderful journey, you will enjoy the Wedgewood level of excellence. Our room was quaint with a sitting room large enough for a cocktail party. The Bacchus restaurant was wonderful with excellent service to accompany the cuisine. Best of all was the helpful staff. Smiles and kindness, with attention to the personal details. We would definitely stay at the Wedgwood again.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "April 29, 2005", "id": 3424000}, {"rating": 4.0, "title": "If only it weren't that pricey...", "text": "An expensive hotel, but each room with balcony (good for smoking in a non-smoking city), half the balconies overlook beautiful Federal Court square. Good location right downtown. Quiet, with accomodating and professional service. You're paying for what you get. Make sure your room overlooks the square - the other side overlooks office buildings.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "April 7, 2005", "id": 3342710}, {"rating": 2.0, "title": "Has it Lost its Star Rating?", "text": "In February we returned to the Wedgewood Hotel for a four day stay. Our previous stay at the Wedgewood - just prior to them being awarded a rating as a place to stay by Conde Naste - was tremendous. Unfortunately the hotel seems to have lost its star status- or at least that was our experience.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "March 19, 2005", "id": 3287121}, {"rating": 4.0, "title": "Highly Recommended, But Might Try the Waterfront Next", "text": "The lobby and the room were needing some care and attention. Obviously the hotel has recognized this as the major problem we experienced was due to renovation. Construction and painting were going on in the room next to ours. A strong smell of paint persisted in our room throughout our four day stay - even over a weekend. When a complaint was made after the first night the staff sent up a machine intended to clean the air, we were told not to be in the room while it was on. We needed to keep the window open when we were in the room resulting in a cold stay. Vancouver was not warm in February. We were not provided with an option of moving rooms - despite this being a four day stay. In addition there was noise throughout the day so a little nap in the afternoon during the holiday was out of the question. Guests should be advised that construction is taking place prior to booking.", "helpfulness": 12, "user": "Brian_NVA", "date": "March 17, 2005", "id": 3283668}, {"rating": 5.0, "title": "A gem of a hotel", "text": "The prices of the Wedgewood have risen over the years as the hotel has been discovered. Our experience in 2006 does not support the reputation that the hotel now enjoys. Perhaps the renovations will help to keep the hotel at the top but in the meantime guests should be informed that the construction may impact on their comfort and enjoyment.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "March 17, 2005", "id": 3282555}, {"rating": 5.0, "title": "One of the best hotels I have ever stayed in", "text": "Went in with high expectations, primarily from this website, and we were generally quite happy with the Wedgewood. However, if we go back to Vancouver I might try to get a place on the water, instead of in the middle of downtown. On a positive note, the downtown location is within walking distance of both the Seabus to North Vancouver and the Aquabus to Granville Island, not to mention many downtown attractions. However, a downtown location comes with negatives, too, including valet parking, and typical urban core problems like aggressive panhandlers and some pretty undesirable areas within blocks.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "February 22, 2005", "id": 3215544}, {"rating": 5.0, "title": "loved our stay", "text": "The hotel itself was very nice. We got a good rate through the Tourism Vancouver website, and, as promised, it was upgraded to a Junior Suite since one was available. We had requested a room on the \"nice\" side (see other reviews), but none was available so our room overlooked the back alley. Not a deal breaker for us, since we mostly used the room for sleeping. Very comfortable bed, and a nice shower.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "December 20, 2004", "id": 2906116}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "My husband and I were desperate for a place to stay after a horrible night in another hotel the night before. Following a Vancouverite's recommendation, we called the Wedgewood and a short while later we were welcomed by their friendly doorman who proceeded to introduce us to the Front Desk clerk, equally friendly and very accommodating with all of our questions and special requests.", "title": "hotel exceeded our expectations", "helpfulness": 10, "user": "hotelshopper", "date": "September 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5881093, "likes": {"liked": "— great service", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "This place truly exceeded all our expectations!!! We stayed in one of their Deluxe Executive rooms, and we were wonderfully surprised by how very spacious and very luxurious it was, all in a tasteful understated way. Beautiful semi-canopied beds feature the most comfortable beds we've ever slept in with individually controlled reading lights, while a double soaker tub is right in the bedroom with a marble walk in shower in the bathroom. The amenities were great, but the warm cookies and bottled water at night were a real treat. We didn't have the opportunity to see any of their suites, or their famous new Penthouses which are apparently the current hot spots for Hollywood celebrities, but if our luxurious room is one of their second lowest categories, we can only imagine what their Penthouses must be like!!! What is outstanding though about this hotel is the friendliness of their Staff. They seem to have invented the word \"service\". From their delightful Executive Housekeeper, to the courteous room service attendant and very professional waiters. They all make you feel very much at home. We especially enjoyed our dinner in Bacchus. What a romantic room and the food was delicious. We couldn't get an appointment in their Spa, but we will make a point of trying it on our next visit. This is definitely one of the best places we have ever stayed - would recommend it without a second thought!!!!", "title": "Classic Elegance - but...", "helpfulness": 7, "user": "Crow", "date": "September 22, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 5821957}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "My wife and I spent a weekend in Vancouver as part of an anniversary celebration and booked one of the penthouse suites at the Wedgewood.", "title": "The Wedgewood is the BEST!!!", "helpfulness": 1, "user": "Rachel_LD", "date": "September 21, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5824456, "likes": {"liked": "— Ask for a room with a view - preferably one of the new penthouse suites."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "The booking service, call-backs after confirmation of registration and treatment by staff prior to getting there was excellent. We were certainly looking forward to the weekend after all the fuss made upon booking.", "title": "Perfect Wedding!", "helpfulness": 1, "user": "bdhaus", "date": "September 21, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 5822487}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We arrived at the Hotel and were greeted promptly along with a bellman to take our bags and a valet for our vehicle. The lobby provides a glimpse of the classic elegance of the hotel. The bar was busy with people watching and we were able to spy a few hollywood celebs inside who happened to be in Vancouver filming.", "title": "Almost perfect", "helpfulness": 4, "user": "JoJoP", "date": "September 20, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 5824684, "likes": {"liked": "— Beautiful rooms", "disliked": "— Staff attitude"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "My wife and I were celebrating a special anniversary so we decided to go to the most talked about hotel in our city and we were certainly not disappointed. We had such a great weekend at the Wedgewood, that we've decided to make it a yearly tradition.", "title": "Great Stay at the Wedgewood", "user": "KCLRK", "date": "September 18, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5814134}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The location is amazing, steps away from all the stores, restaurants and theatres and the service couldn't have been more professional and friendly at the same time. We stayed at a Wedgewood Suite beautifully decorated in cool brown and gold tones, silk fabrics and two luxurious spa bathrooms complete with pillar candles and bath salts for the double jetted tub - very romantic!! Breakfast in bed was wholesome and elegantly served, but their Spa was the highlight of our stay. We had to make reservations way in advance because it's so popular and we saw why. They offer a variety of interesting treatments, some for couples. a great eucalyptus steam room and the aestheticians were some of the best we've ever tried. My wife has already made a second appointment.", "title": "What an Excellent Hotel", "helpfulness": 2, "user": "Shawn_Bob", "date": "September 18, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5811286, "likes": {"liked": "— The staff made you feel like you were truly a guest in their home", "disliked": "— no pool or hot tub"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Their Lounge and Restaurant, Bacchus is definitely the place to see and be seen by the elite of Vancouver. We had a great dinner the first evening and just dessert and drinks late the second evening. We will return often.", "title": "Beautiful Room but...", "helpfulness": 2, "user": "G102000", "date": "August 30, 2006", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 4.0}, "id": 5729017}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled on business", "text": "Ken Clark", "title": "Can't see what the fuss is about.", "helpfulness": 16, "user": "MonkeyGreen", "date": "August 30, 2006", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 5728095, "likes": {"liked": "— Location", "disliked": "— Noise"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2006", "text": "We have just returned from a few days at the Wedgewood. The hotel is magnificent and we have never felt so catered to before. The staff seemed to know our every need and the peace and tranquility of the hotel made you want to stay there instead of tour the lovely city.", "title": "Nice rooms but...", "helpfulness": 14, "user": "fatbaloo", "date": "July 15, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 2.0}, "id": 5469888}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "No turndown service given throughout my stay - had to call to remind them to give me the cookies and bottle of mineral water every evening.... The cookies were big and soft. Very yummy.", "title": "Love the chocolates and cookies", "helpfulness": 6, "user": "sg_stef", "date": "January 30, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6715262, "likes": {"liked": "— cookies and chocolates", "disliked": "— tiny elevator"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We arrived early and had to wait in the lobby for almost an hour for our room to be ready.", "title": "A mixed bag at the Wedgewood", "helpfulness": 5, "user": "Sue8000000", "date": "January 5, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 6555775, "likes": {"liked": "— Location, restaurant", "disliked": "— Variable service, beds"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "We were given a room with a tub which we enjoyed very very much. The room had a nice view of the streets. Staff were friendly in a professional way. Excellent location within walking distance to shopping streets and most attractions.", "title": "A class act!", "helpfulness": 9, "user": "walrus007", "date": "December 11, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6363383, "likes": {"liked": "— Classy and romantic feel, fantastic restaurant and bar", "disliked": "— No significant view, some road noise particulary when raining"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Overall a nice hotel to stay in but I wouldn't call it value for money - more for times when you'd like to splurge.", "title": "Very Sexy! ;)", "helpfulness": 12, "user": "MommyJessica", "date": "November 16, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 6136512, "likes": {"liked": "— The location and staff", "disliked": "— The price haha, quite expensive, but for us it was worth it"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "Stayed at the hotel over New Year's Eve 2006-2007. I think we were underwhelmed, although some touches were nice.", "title": "nothing but praise", "helpfulness": 9, "user": "DoctorNick", "date": "November 9, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6092533, "likes": {"liked": "— the beds/sheets/towels/location", "disliked": "— spa was very small"}}], "location": {"country": "Canada", "city": "Vancouver"}, "stars": 4.5, "variance": {"poor": 13, "average": 26, "very good": 80, "terrible": 4, "excellent": 462}, "aka": "Wedgewood Hotel And Spa", "slim_ranking": 0.0721649484536}