{"user_rating": 4.0, "review_count": 163, "name": "Wellesley Resort Fiji", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "We absolutely loved our stay at the Wellesley Resort. It was quite a drive from the airport...about 2 hours. But the driver, Joe, was lovely and filled us in on Fijian culture and different things we could do in the area on our way to the resort. He also stopped at a supermarket so that we could pick up beers and water for our room (worth doing as it works out way cheaper than resort prices). As it was later in the evening and the resort restaurant would have been closed on our arrival (10pm) he even offered to stop at a restaurant so that we could eat.", "title": "Go the distance...it really is worth it!", "helpfulness": 2, "user": "charlenedj", "date": "July 3, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 166117190}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Our room was gorgeous. Absolutely spotless; the sheets were turned down every evening while we were at dinner and a fresh flower arrangement was left on the bed.", "title": "Better than Expected!", "helpfulness": 1, "user": "Patricia P", "date": "June 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 165778716}, {"rating": 1.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "All of the staff on this small resort come from the small village next door which I thought was really great. The Wellesley make a point of employing local people, giving them experience in the biggest industry in their country. Everyone was so very friendly and they always remembered guests names which added to the personal experience.", "title": "Great Spot, Terrible Management", "helpfulness": 6, "user": "Greg L", "date": "May 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161438857}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The beach is stunning, so very quiet and calm. Only 10 minutes walk along the beach to Crusoes which is a little busier.", "title": "If only staff were nicer", "helpfulness": 2, "user": "in0rbit", "date": "May 18, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 161112919}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Quite a lot of the reviewers here complain about the quality of the food at the Wellesley and unfortunately, I'd have to agree. It's quite hit and miss. Sometimes you get something quite good but there isn't enough of it and other times it's just ok! If you do choose to stay here I'd suggest a couple of nights dining here and the rest at Crusoes where the food is definitely better.", "title": "Sshhhh... well kept secret", "helpfulness": 5, "user": "Eberor", "date": "April 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 158067849}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "A bit of a drive from the airport. Very large comfortable, clean rooms. The dinning room had a great view. Breakfasts were very relaxing with the fantastic view. The beach was the best sand on the coral coast! Plenty of shade trees and deck chairs overlooking the beach. Snorkelling was pretty good straight in front of the resort. Easy walk along the beach to another resort. Staff were friendly and helpful. Highly recommend and would go back again.", "title": "Great spot", "helpfulness": 5, "user": "petersueturner", "date": "April 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 157907575}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Perfect place to kick back & relax. It's got a small/exclusive feel, only about 15 bures, so not impersonal like a large hotel. Friendly but not intrusive. There's a pool and the beach, plenty of shade trees and a gorgeous outlook. Onsite spa offers great services at a very reasonable rate and the restaurant did a good range of food. Highly recommend. I would go back any time.", "title": "Perfect place to escape & relax", "helpfulness": 4, "user": "kiwilizd", "date": "April 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 157636390}, {"rating": 1.0, "stay_parameters": "Stayed March 2013", "text": "Very, very furious with the misrepresentation of this resort on their website. Upon arriving at the \"resort\" (after a 2.5 hour car ride from Nadi airport) we discover that the resort is situated off the road, down a track that only a 4wd can navigate. I soon realise that this is by design, as they want you to be cut off from everything and rely on their disgraceful offerings to get you by. Knowing that bottled water will be a necessity to sustain our planned 10-day stay, we asked to buy some.... none here sorry. No worries, where can we get some, is there a shop nearby? Sure, we can take you to the road to meet a taxi--at $40 fijian and an hour trip each way! We head to our room, only to be greeted with a strange pungent smell, we ignore this as our main priority was checking the fridge for refreshment options for our stay. Inside was a barely cold jug of water, which had a grimey lid, even some food of some sort on it. We check out the bathroom to find that the shower fittings are rusted and hanging from the walls. The T.V. was small and far away from the bed area- this did not bother us at all because we weren't there to watch tv (at least until we discovered that this is one of the only things to do at this place!) We attempted to relax and hungrily awaited dinner. We get to the dining room/bar area and realise we are the only couple there and it is dark and uninviting. We sit and order from a menu that looks quite decent. The food arrives suspiciously promptly and its resembles reheated leftovers, servings were measly and tasted no better. This had no bearing on price however, as main \"meals\" were over $25-$30FD. During our meal, an equally bewildered looking couple sit down to a meal and look just as confused as we did at their offerings. Deflated, we retreat to our room to contemplate our decision to stay at this place, called it a night and watched T.V. (kind of like we do at home...for FREE) We awaken, stomachs rumbling and a bit thirsty and head to breakfast. I order eggs on toast and pay extra for bacon, cannot wait to eat! It arrives and the eggs are pale and dry and the ONE PIECE of bacon looks sweaty and microwaved despite having frying marks on it, was it reheated!? Enough was enough, this was our honeymoon and it was completely destroyed by this place and its purposeful isolation from anything that we went to Fiji to see and do. 2 days into our 10 day stay, we had to leave and headed home with a literal bad taste in our mouths. Do NOT stay here.", "title": "This place NEEDS to be shut down!", "helpfulness": 8, "user": "Aidz84", "date": "March 28, 2013", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 155858912}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "We had a fantastic time at the Wellesley, the satff were so friendly and helpful. the rooms were fantastic the views amazing. it is a great place to go if you want peace and tranquility and not much do. i can wait to go back there and the only problems with my stay is that it wasnt long enough. Thanx to all the staff for making our trip memorable. The massage facilities and staff were great we had many treatments. Suzanne", "title": "Fiji Splash", "helpfulness": 4, "user": "Suzanne12_13", "date": "February 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151712700}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We stayed at the wellesley resort last x mas and we so happy we went again this x mas for a longer stay. We arrived on x mas morring and were greated by the hotels driver as soon as we came out of the gate and were on our way. The driver is simply fantastic. He makes sure u are vey comforatable and answers any questions u have and offers stops alnog the way to get anything u may need. The owners Gail and Ray were thee to welcome us back and went out of their way to assure our stay was as good as it was last yr. They are a little rough around the edges but thats fiji life. We got eveything we expected from our previous stay. The staff is vey laid back and friendly and are happy to accomadate ur needs. While er wer there a stomach virus spread through for a day or 2 but we were very well looked after and were offered anything we needed to make us feel better and gail made sure she asked after each of us many times during the sickness to make sure we were ok. This resort may be vey small and vey laid back but at least you are not treated like a number, they treat u like a friend. Both visits now we met extrodinary people and made friends for life. The resort is far removed but thats its charm. Pure seclusion and relaxation. Dont go here if you want alot of activities, you have to make your own fun here as we always do. If you stay here walk away with the positives and not the negitives. Its not a 5 star resort but for the small pricetag u pay here u get alot. Thanks again to everyone and will most likely see u again soon....", "title": "2nd time around", "helpfulness": 5, "user": "calabsv", "date": "January 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 149827030}, {"rating": 4.0, "title": "Great holiday", "text": "I stayed at the Wellesley resort for one week with my husband and loved it. We hired a car, which I would recommend as it is a bit isolated, which was what we where hoping for.", "helpfulness": 6, "user": "love2travel019", "date": "August 2, 2012", "id": 136082029}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Food at the restaurant was fine, not amazing but certainly wouldn't complain about it.", "title": "Had a fab time!!", "helpfulness": 7, "user": "Larielle83", "date": "July 23, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "service": 3.0}, "id": 135130972}, {"rating": 5.0, "title": "I expected \"OK\" but got \"Fantastic\"", "text": "Was a nice walk up the beach to Crusoes resort, food is probably better there, more selection at least.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "July 23, 2012", "id": 135115184}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "Very friendly staff, nice pool, it was 2 hours drive from the airport, I wouldn't suggest trying to find it in the dark though.", "title": "Dec 2010 Lovely resort :)", "helpfulness": 1, "user": "17rosebud", "date": "July 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 134497380}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Beach massage with Mary in the village near the resort was a great experience.", "title": "Wellesley Resort, Coral Coast, Fiji", "helpfulness": 8, "user": "Jaqueline C", "date": "May 15, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 129965158}, {"rating": 3.0, "stay_parameters": "Stayed December 2012", "text": "A 2 hour drive from the airport if you are being chauffeured by a taxi driver with Formula 1 ambitions! Being driven along the main road across the island in the pitch black, over taking cars on bends at 70mph is a hairy experience!", "title": "Beautiful setting but watch out for cruise con", "helpfulness": 9, "user": "Scallybobs511", "date": "January 11, 2013", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 149469175}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Thankfully waking up the next morning to see the spectacular views at Wellesley hotel is worth it. The beach is picture postcard perfect. The rainforest style valley setting is amazing. The gardens are gorgeous and carefully tended by the gardener Sabir who took us on a tour to taste the homegrown fruits and coconuts.", "title": "Amazing", "helpfulness": 4, "user": "Tia S", "date": "November 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144894979}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "If you want peace and quiet then this is the place for you. It is the perfect place to indulge in being idle! However, do bear in mind that this means you have no choice but to eat at the hotel and the food is as overpriced as it is overcooked! A bland and not very appetising menu gets tiresome when staying seven days. The service was also hit and miss, some staff really treated you as though you were an inconvenience. There are only 15 bures and when we stayed there were only ever about 3 of 4 parties present. This meant that the staff would close the bar and restaurant early so everything would shut up about 8.30/9pm - this is definitely not a place to party. If you are looking for some action, you can walk 15 mins down the beach to the only neighbouring hotel Crusoes, it's slightly bigger and has a few more activities going on. I would definitely recommend happy hour and the fijian buffet. The only other point of interest is the small village between the hotels and it really is SMALL! There is one shop with a room for locals and a room for tourists. It also doubles as a fish and chip shop.", "title": "Relaxing", "helpfulness": 1, "user": "Chiara S", "date": "October 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 143180431}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We booked the room direct through the hotel website after reading positive comments on Trip Advisor. Their website promised a free day boat trip but this is a con! The hotel doesn't have a boat, you need to pay  $300 Fiji dollars for a round trip taxi to Nadi where you can get the 'free' boat. You'd also need to set off from the hotel at 6am to do this. When we asked the manager about this she just shrugged and said 'well the website also says we have rooms with baths and I'm yet to find one!'", "title": "Perfect", "helpfulness": 5, "user": "Yolandi F", "date": "October 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 143012816}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "All in all we had a good stay at Wellesley, it's a good price for the magnificent view and a nice place to get away from it all. But the service leaves a lot to be desired!", "title": "Wellesley Resort, Fiji.", "helpfulness": 7, "user": "thetrotter07", "date": "September 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 141466990}], "location": {"country": "Fiji", "continent": "South Pacific"}, "stars": 4, "variance": {"poor": 18, "average": 14, "very good": 46, "terrible": 12, "excellent": 73}, "aka": "Wellesley Resort Fiji Hotel", "slim_ranking": 1.0, "description": "The Wellesley Resort is one of Fiji's newest boutique resorts. It boasts a fabulous lagoon, pool and stunning white sand beach. This part of Fiji's Coral Coast is renowned for its crystal clear waters and spectacular diving - this is the only white sand, blue lagoon experience on the mainland. And it's all yours... miles of it! Set in 100 acres of lush tropical rain forest and island gardens, the Wellesley is a hideaway of intimate and serene seclusion. The stylish decor, high standards of cuisine and the genuine hosted experience our staff offer are nothing less than one would expect from a resort carrying the Wellesley brand. It's all about style..."}