{"user_rating": 4.5, "review_count": 66, "name": "Wellspring", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "What a wonderful way to spend an evening! My husband booked a single night, very last minute, in the Tioga cabin. We traveled from Raleigh to Seattle and drove down to Ashford. The mountain was \"missing,\" that day, so we went right to check in.", "title": "I could have stayed forever!", "helpfulness": 1, "user": "PlannerRaleighNC", "date": "August 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136843792}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Yes, we picked up our key at the peg board. There is no parking at the cabins, so we parked in the lot and walked the short distance to our cabin, easily identified by very attractive and woodsy signs. The cabin was just amazing! Wow! The bed was huge and comfortable. The fireplace was small, but provided the ambience we were seeking. We didn't use the big bath, but the shower was perfect and the water was hot. I loved the liquid soap provided! The WC was perfect for the setting.", "title": "Very romantic!", "helpfulness": 1, "user": "scott", "date": "August 9, 2012", "detail_rating": {"cleanliness": 3.0, "sleep": 5.0, "location": 4.0, "value": 4.0, "rooms": 4.0}, "id": 136737760}, {"rating": 1.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "There really is no cell service, though the GPS on my iPhone worked. Wood for the fire was provided inside and out, along with an old paper and matches to get it started. A flashlight was left in a handy spot, just in case. My husband got a little panicky about not having coffee, but there were two big jars of coffee and plenty of filters.", "title": "Treehouse could be good IF bed and bedding have been replaced", "helpfulness": 2, "user": "jeffyscott", "date": "July 27, 2012", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "location": 4.0, "service": 1.0}, "id": 135530666}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "This is not a good place for a group that requires any kind of outside entertainment. There was no TV, but there was a radio. If you're willing to entertain yourselves (ahem!) or enjoy the surroundings, it's perfect!", "title": "Wellspring Treehouse, Ashford WA", "user": "stlmom23", "date": "July 26, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 135439014}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Every time I looked around I saw something different and interesting. I really wished that we could have stayed longer. Hope we can come back with our friends and kids, maybe while there is snow on the ground.", "title": "A-M-A-Z-I-N-G !", "user": "getteedoff", "date": "July 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134235044}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "My husband and I went back to Wellspring this past weekend for our 1 year anniversary. It's our favorite spot to relax and reconnect. We chose the Tahoma cabin because most others were already booked but we were not disappointed! It was gorgeous, handcrafted and as special as we remembered. The best thing to do, if you are able, is to book the Turaiya room. It's gorgeous and attached to a pond and you're allowed to use the hot tub after 9pm which makes it the best value to me.", "title": "Back for a 2nd visit, couldn't be happier!", "user": "MaggieStrain", "date": "May 29, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 130896524}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Regardless of the cabin you choose, you're going to have a wonderful stress free time. We'll be back for years to come!!!", "title": "Beautiful!", "helpfulness": 1, "user": "meertiger", "date": "May 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130331581}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Very peaceful area, set out in a forest and there is only like six rooms. Wellspring also has a spa, and lots of hiking trails. But a con is that there is no phone service there", "title": "Unique Accommodations in a Relaxing Atmosphere", "helpfulness": 1, "user": "NiksterD", "date": "April 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128054792}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "What a special place to stay and oh-so-close to Mt Rainier. My husband and I normally make the drive from Seattle and back in one day, but this time we opted to stay the night. I sure am glad we did. This place is an amazing find. The grounds are beautifully landscaped in a peaceful environment. Wellspring is located off the main road far enough to feel like you are miles away. There are several cabins available as well as a tree house. We stayed in the tree house! There are hot tubs and other spa facilities. We rented the hot tub for an hour (private) and had great converstation with the owner. This would be the ultimate place to get married!", "title": "Restful Oasis", "user": "nicolas617", "date": "December 27, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122153125}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "If you are headed to Mt Rainier, we highly recommend you stay here.", "title": "love it here.", "helpfulness": 2, "user": "seattledirtbag", "date": "December 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121928910}, {"rating": 5.0, "title": "This place is magical", "text": "My husband and I spent a truly magical weekend at Wellspring. The property is amazing- there are hiking trials and a labrynth, and you are only 3 miles from the Longmire entrance to Mt. Rainier National Park. All the cabins are fabulous. We greatly enjoyed the beautifully done Turiya cabin and its garden and private hot tub, and we have friends who loved the Tamarack and Treehouse cabins. Sunny and her staff offer topnotch hospitality and were super helpful and accomodating in every way. I look forward to returning to Wellspring as soon as possible.", "user": "SierraRM", "date": "November 25, 2012", "id": 146183517}, {"rating": 2.0, "title": "Wellspring Treehouse Review", "text": "We stayed two nights in the Treehouse and I would liken this experience to something between tent camping and staying in a camper (which we have often done). To get up to the treehouse, you climb a \"ladder\" of sorts, and motion sensors are installed for use at night. Your personal belongings are loaded into a large bucket and hoisted up via a rope. The treehouse itself is just slightly larger than the bed with no room to walk once inside. The bed was a foam mattress on a wooden slab although it was not uncomfortable to sleep on. A small heater is available. Bed and bath linens are provided but they appeared to be somewhat old and musty. We found the breakfast basket in the bathroom nearby, and it contained yogurt, whole fruit, cheese, and Danish wrapped in a paper napkin. Before we arrived I had inquired if a hair dryer was provided and was told that they don't have enough for each unit but if I used the \"red phone\" when I arrived, they would see that I got one. We arrived in the early evening hours so my husband called and was told they don't provide hair dryers. I called again @ 8 PM and the man who answered told me he doesn't think they have hair dryers and he can't come out to check if they do. Upon further questioning, he told me to ask \"Diane\" when she arrived in the morning at 8 AM. Since we planned to hike in the early AM, I left a note in the bathroom and when we returned that evening, a hair dryer was there. The bed had been made, bathroom linens were replaced, and the breakfast basket was restocked. Kudos to you, Diane! If you compare your stay to a camping experience, you will probably enjoy it. However if you compare your stay to that of a hotel, you will be disappointed. Be sure to bring everything that you need with you. There are no staff on site so if you need something, you may be out of luck. Unfortunately I found the man (the owner??) at the other end of the red phone to be less than helpful and even somewhat rude, really the only negative experience we had on an enjoyable 2-week vacation in the Pacific northwest. Would I stay there again? Although it was a unique experience, probably not.", "user": "OutNAbout853", "date": "September 24, 2012", "id": 141140700}, {"rating": 5.0, "title": "Incredible site for a wedding", "text": "Our daughter was married here and the new site Sunny has developed is just stunning: after a short walk in the woods, you come upon this small amphitheatre kind of space with an amazing slab of stone wedged between two trees as the altar. Plus there is a little gingerbread bride house that you won't believe! SO wonderful.Sunny is this calm, \"everything will be okay\" presence that I loved. She is such a visionary! Each cabin is unique, and I mean really unique: one bed is ona swing, another room feels like it's in the middle of the forest.And that's just for starters. If you want a wedding site and lodging that will make for a totally unique and wonderful experinece, this is the place for you.", "user": "alicer58350", "date": "September 20, 2012", "id": 140732293}, {"rating": 4.0, "title": "Relaxing retreat", "text": "My husband and I stayed 1 night in the Turyia Guest Room, one of the 2 lodgings where you have the hot tub and sauna access overnight. We greatly enjoyed the seclusion and the feeling of separation you had since all the lodging is separate. The Turyia Guest room had a nice gas fireplace as heat and you could open the sliding glass doors and listen to the pond right out the back door. Turyia has a private bathroom and access to the massage bathroom as well.", "user": "hikerkidz", "date": "September 11, 2012", "id": 140006919}, {"rating": 4.0, "title": "Luxury Cabin in the woods by Mt. Rainier", "text": "We found the room to be comfortable and nicely furnished and we were pleased by the variety and freshness of the breakfast basket. As others have commented, breakfast is out before you arrive, but Turyia has a fridge so our breakfast basket was in the fridge in our room.", "user": "fnct", "date": "August 11, 2012", "id": 136907308}, {"rating": 5.0, "title": "All is Well at Wellspring", "text": "Spent a peaceful night in the Turiya guesthouse at Wellspring. It was an anniversary celebration, and we wanted a chance to celebrate and immerse ourselves in nature. Wellspring delivered. The Turiya was a peaceful place - complete with a little waterfall out the window, a babbling brook, and a reflection pond right outside the glass doors. The grounds are beautiful, and without the interruptions of a phone, internet or cell coverage, peace is present.", "user": "YetAnotherTraveler", "date": "August 3, 2013", "id": 170523351}, {"rating": 5.0, "title": "Beautiful", "text": "Wellspring isn't a five star hotel. Not all units are the same. There's no concierge, and not even a front desk. Just a red phone. No TV, no internet, no wifi. If that sounds too quirky for you, maybe Wellspring isn't the right spot. If that sounds intriguing, then check out the website and see what I mean. Our experience was very positive, and the visit was all that we hoped.", "user": "nosuchnumber", "date": "July 25, 2013", "id": 169076198}, {"rating": 4.0, "title": "Treehouse and guest room are cozy", "text": "We will definitely be back, and will consider the 4 seasons special... if you spend a night during summer, fall, and winter, then the spring visit is free (you can start with any season - essentially the 4th visit is free). Better yet, you have two years for the three visits. Come see the vision of the owner, Sunny, and prepare to be relaxed. We didn't get a massage, but have heard from friends that they are truly wonderful.", "user": "LeeJe8989", "date": "April 17, 2013", "id": 158038213}, {"rating": 5.0, "title": "Absolutely wonderful experience at Wellspring!", "text": "I hope you enjoy it as much as we did!", "user": "Barbara L", "date": "April 16, 2013", "id": 157949448}, {"rating": 5.0, "title": "Very romantic place to go.", "text": "We spent two nights in the Tamarack cabin. It was gorgeous. So nice to have a kitchen so that we didn't have to spend money going out for every meal. There were games and books in one of the drawers, along with past guestbooks for that particular cabin going back to 2003 (maybe even earlier?). We had fun skimming the notes that previous guests had left - everyone seemed very happy with their stay.", "user": "Amberk53", "date": "February 15, 2013", "id": 152201012}], "location": {"country": "United States", "city": "Ashford"}, "variance": {"poor": 6, "average": 5, "very good": 12, "terrible": 1, "excellent": 42}, "aka": "Wellspring Hotel", "slim_ranking": 0.428571428571, "description": "Wellspring is a spa and retreat center nestled in a quiet forest three miles outside the southwest entrance of Mt Rainier National Park. Comprised of rustic log cabins, two independent spa facilities, a modest lodge and a variety of outdoor gathering facilities including a 30' gazebo, Wellspring is an ideal retreat for couples, family reunions or commercial group retreats as large as 30. Our forest sanctuary is an incredibly unique and magical setting for a Pacific Northwest wedding. Wellspring hosts fifteen to twenty weddings every year, mostly in the summer."}