{"user_rating": 4.0, "review_count": 851, "name": "Westin Resort & Spa Los Cabos", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Our family traveled to Westin Los Cabos in December, 2012 for 6 nights. Starwood required us to prepay our entire stay. This was a big mistake. We were dissatisfied from the start. We requested adjoining rooms - denied. Queen beds - denied. Bugs in room - sprayed and left spray all over floors/furniture. Tried to play miniature golf - facility is so dated it was deplorable with no attendant/equipment. The hotel is huge and impersonal. We gave 24 hr notice that we would like to leave the hotel after 3 nights and requested a refund for only the remaining unused nights - denied. We left anyway and have requested multiple times a refund with Starwood Corporate - denied. They make you prepay and then it doesn't matter if a guest is satisfied or not. You are stuck. They don't care. There are too many other hotels that know how to do business and treat a guest well. Take your business elsewhere.", "title": "DO NOT PREPAY! STAY AWAY!", "helpfulness": 2, "user": "M C", "date": "February 18, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 152461011}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Very nice property. Large and awe inspiring. Beautiful beach with small rock outcroppings. Drinks and food brought to you there, the multiple heated pools or in the pool side restaurant. Rooms are ok...nothing remarkable, small to medium sized rooms with shower and bath both. Most rooms in the hotel have incredible ocean views due to the semi circle design. Wifi is spotty throughout the hotel as well as cell service, but available. Food good, but not incredible. Limited choices without taking taxi to nearby San Jose or Cabo San Lucas (20 mins and $28 by taxi). Service is great. Just ask and it will be brought to your room or they will assist. We had a large business meeting there and it went very well. Good organization and coordination. Ability to serve groups 4-500 in size. They offer an all inclusive package for groups. Not sure about individuals. Few gift shops...a couple of locals allowed to sell small items at the beach. Great spa with steam room and sauna. Well stocked workout area with treadmills, stair climber, ellipticals, weights etc. Only downside to Westin is unique design. Takes several days to figure your way around. Be prepared to walk a lot. We frequently were \"turned around\". Picturesque place that will not disappoint.", "title": "Relaxing with Great Service", "user": "moonhope", "date": "February 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 152306186}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We had the best time of our lives and we were treated like kings and queens during the entire week we stayed here. Yes its a bit older hotel but rooms are still nice and the staff is above excellent. Food was great. No issues with our wedding and the coordinators were good and responsive to our needs. A great place to have a destination wedding and we highly recommend it!!", "title": "august 2012 stay and wedding", "user": "theROCK54", "date": "February 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 152009657}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We had a wonderful stay at the Westin resort in Cabo in January. We did their new all inclusive option which sounds like it was a good idea seeing the complaints about the price of food and drinks. The food was excellent. I see a lot of complaints about the cost of food but the quality was excellent from the large breakfast buffet with great omelet station at La Playa, pool side bar for lunch (great sea bass ceviche and fish tacos) to the dinner at the upscale restaurant Arrecifes. The service was phenomenal. Every staff member we encountered was very warm, friendly, and accommodating. The grounds and pool were beautiful and well kept. The rooms modern, spacious, and clean with beautiful ocean views. Great stretch of beach for running/walking. I really don't have any complaints and can't imagine anyone not enjoying their stay at this property. I would not hesitate to return.", "title": "wonderful getaway.", "helpfulness": 1, "user": "slp_dsm", "date": "February 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151581201}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We stayed at the Westin for a long weekend of relaxation and found the property and staff to be very accommodating with a couple of exceptions. Mr. Castillo and his staff at the pool bar/restaurant area went out of their way to see to our every little need. The room was lovely, the food was fine, although pricey. We did not recieve information from the front desk of specifically how to get to our room so we were wandering around a bit, but it was a minor inconvenience. Our only complaints were with the activities desk staff - surly and unaccommodating. However, the concierge made up for their lack of enthusiasm. The fee for internet service is surprising in today's world - you have to go to the lobby to get free internet.", "title": "Smiles Everywhere", "helpfulness": 1, "user": "Lis67_13", "date": "February 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 151478737}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "I was here for a two-day conference and came in a day early, staying three nights. The room was very nice -- large, with a nice balcony and big bathroom. The room was impeccably clean. They provide several free bottles of water each day. The WiFi was expensive, though discounted by half for our conference, and the signal wasn't great but not terrible either -- certainly enough to send and receive email reliably. Internet speed was better through the Ethernet cable - good enough to video chat with occasional disruption. Others have complained about the distance from the lobby to the street, in order to get to and from San Jose Cabo or Los Cabos. This is true, however I also think it's a bit exaggerated. It's probably a 10 minute walk, all on the hotel property. The bus comes frequently in either direction and costs less than $2. It takes about 20 minutes to get to San Jose and 45 to Los Cabos on the bus. The service at the hotel was exceptional -- the front desk staff, the wait staff, bartenders, cleaning staff, pretty much everyone we encountered went out of their way to be friendly and helpful. In summary, there would probably be better choices for a family vacation, but for a business conference I thought the Westin was perfect.", "title": "Very nice location for business meetings", "helpfulness": 1, "user": "Chicago-Lawyer-Mom", "date": "February 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 152897931}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "stayed here for two nights over a holiday weekend in feb 2013. the building is gorgeous - beautifully matches the serene surroundings. from the carport when you drive in, you can immediately see the water in the distance with an arc-shaped hotel framing it. picturesque.", "title": "gorgeous building in need of a few repairs", "user": "TimTran", "date": "February 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 152745440}, {"rating": 5.0, "title": "Beautiful, secluded hotel. Excellent views.", "text": "the room we received was fine. we left the screen door open once and the room was filled with 50 moths, which was horrifying at first but fine. the room was ready when we arrived, though front desk seemed to realize before we did that they forgot to stock the room (bath supplies and minibar) which was minor complaint. the shower took 5 complete minutes to get warm. we had one minor problem with a food order, which the wait staff apologized for (realizing that 5 half-battered calimari is unacceptable for $18) and corrected immediately. the design of the building is gorgeous, but there are parts in desperate need of attention/repairs - like the open staircases which are ugly. and the whole middle section which is begging for an attraction between the lobby and the actual hotel.", "user": "ourendlessview", "date": "February 21, 2013", "id": 152722956}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "the good: the pools were nice and clean, and heated. the welcome reception was wonderful, free, and involved about a thirty second spiel about the benefits of starwood. no other strings attached. gave away a bunch of prizes and was open bar - super great. the restaurant too was good. the grounds were very clean. everyone was very friendly. the \"activities pool\" was not overly obnoxious.", "title": "Wonderful location but isolated unless you. have a car", "helpfulness": 1, "user": "HarrhAm", "date": "February 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 5.0, "rooms": 4.0, "location": 2.0}, "id": 152719430}, {"rating": 2.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "happy to have stayed here. certainly not the best westin in the world, but is a lovely hotel with a very accommodating staff.", "title": "the longest walk", "helpfulness": 3, "user": "rob w", "date": "February 18, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 1.0}, "id": 152476300}, {"rating": 1.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "I travel a lot for business, and chose the Westin because I am a Starwood Platinum member, and have really enjoyed the program. However, this was the worst Westin I have stayed in. The hotel is very far from Cabo - if you want to go into town for dinner, bar hopping or activities, it will be an expensive cab ride. The restaurants at the hotel are probably 10x more expensive than eating or drinking in town. The facilities at the hotel were nice, but we were always surrounded by people who were taking tours for the Raintree timeshare next door. They were very pleasant, but I would imagine the pool is very crowded when the hotel is not 50% empty.", "title": "Very disappointing - avoid", "helpfulness": 6, "user": "Tor C", "date": "February 4, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 4.0, "rooms": 1.0, "location": 1.0}, "id": 151424225}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Specifically for me, I upgraded my room to a suite, revived a confirmation from the hotel, but when I arrived to the hotel, I was told that all the suites had been given away, and that they were only required to give me a RBC room (our room was small and dark) which was not what I was expecting. The hotel refused to refund the upgrades that I used to upgrade to a suite.", "title": "Staff is so warm and welcoming", "user": "wiley22k", "date": "February 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 151352752}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "When I go back to Cabo, I will be staying much closer to town. I will never stay at this hotel again, and there are a lot of nice places to stay in Cabo.", "title": "Peaceful Time in Cabo", "helpfulness": 1, "user": "Been_to_90_Countries", "date": "February 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 151194240}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "I loved the location. It is quite, clean, colourful and an amazing design. The layout of the infinity pools backdropped by the expanse of the ocean and all the cactus gardens against the colourful walls with sand meticulously raked, it was breath taking. I liked being away from the cities, yet it is only twenty minutes away from all the activities. All rooms face the ocean and we saw many humpback whales from our room. The staff was amazing, so friendly and I agree with the other reviews about the folded pj's and margaritas. The only reason for the 4 instead of 5 rating is that the ocean is often too strong to swim in. The waves were very strong and made it impossible for my young daughter and I to go in. Other then that it was great.", "title": "Great beach and very nice staff!", "user": "Yolie166", "date": "January 31, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 151129742}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We just stayed at the Westin Cabo for a 3-night extended weekend and are will definitely return. I've been aware of the hotel for years given it's iconic design; all aspects of the stay were good. As with other reviewers, we too enjoyed whale watching from our balcony -- at times we could count 10+ whales. One morning we even spotted a pod of seals or sea lions swimming close to the coast.", "title": "We had a wonderful stay!", "helpfulness": 1, "user": "jhawkfan31", "date": "January 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 151061169}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Enough cannot be said about the striking view guests get upon arrival of the rectangular opening to the Sea of Cortez and the bold but tasteful use of colors on the hotel's exterior. Check in was slow but the service for our conference events was otherwise very attentive. The food and cocktails were better than on our last visit four years ago. Since that time, however, the hotel has gotten a bit tired and the housekeeping staff lackadaisical. Housekeeping did not come, if at all, until late afternoon and it took three in person requests to get basic towel sets. Towels are a bit frayed, as are the chaise cushions on the beach. The roof of the dinner restaurant is an eyesore to guests in rooms that overlook it. The layout wouldn't be good for guests who cannot walk the confusing paths between the several buildings. All in all, however, the price and location provide a good value for the reasonable price.", "title": "Exciting architecture, attentive group service, getting tired", "user": "vanholt", "date": "March 4, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 153657441}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "I am not really sure what all the hubub was about with this resort... sure it is not too close to town.. but that isnt hard to find out before you get there. Food was very good, and service was excelent. Heck, I think I ODed on fish tacos and civeche while I was there....", "title": "Not as bad as previous reviewers....", "helpfulness": 1, "user": "greauchene", "date": "February 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 153101059}, {"rating": 2.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Room was very nice. and cleaned daily at appropriate times. Also turn down service was nice.", "title": "Go Somewhere Else!", "helpfulness": 1, "user": "43Chicago", "date": "February 25, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 153094435}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "We used the confernce facilities for a meeting while there.... they met all our expectations.", "title": "Okay venue", "helpfulness": 1, "user": "Tim L", "date": "February 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 152951634}, {"rating": 2.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "I would go back to this resort.", "title": "Such a shame for a nice property", "user": "Traveler206Seattle", "date": "February 24, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 152914732}], "location": {"country": "Mexico", "region": "Baja California"}, "stars": 4, "variance": {"poor": 56, "average": 100, "very good": 252, "terrible": 49, "excellent": 394}, "aka": "Westin Resort & Spa Los Cabos Hotel", "slim_ranking": 0.368421052632, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.0}, "description": "Welcome at The WESTIN difference.Our Dedicated Staff will do the Utmost to be at your best and Feeling renewal. With the Goal of sending guest home feeling better than when they arrived, Westin has developed a wealth of refreshing signature products and invigorating sensory experiences.If there is anything you may need, just ask!Where the rugged desert meets the Pacific Ocean and the Sea of Cortez lies The Westin Resort & Spa, Los Cabos.A celebrated rendition of the Arch in Cabo San Lucas and nestled into the cliffs overlooking the intensely blue Sea of Cortez, this strikingly imagined resort offers both architectural majesty and a supremely relaxing vacation of renewal. The desert, the pacific and the sea of Cortez meet at the tip of Mexico’s Baja peninsula –Land’s End – a destination of sharp contracts echoed by the award-winning architecture of The Westin Resort & Spa, Los Cabos.Leave the world behind and step into our desert Oasis. Live the good life as the white sands and soothing surfwash your cares away.Awaiting your arrival are luxurious Ocean view rooms featuring the heavenly bed® a Westin Signature, a Private Beach, Three Pools, A full service Spa including Westin Workout® and Plenty of Sunshine.Choose from four distinguished restaurant, each offering it’s unique cuisine and atmosphere from the informality of the food and view of the beach at La Cascada and La playa or indulge at our fine dining El Ciruelo and Arrecifes our 4 diamond award Restaurant.As Leader in the Market Segment, Westin is an icon of high hospitality in Los Cabos. Stunning remarkable contemporary architecture and combining both our experience and intuition will help you to create personal and memorable events.Designed to provide the warmth of the Mexican culture with soothing colors, ocean views, oversized showers, private sitting areas on the balcony and an indoor sitting area, the rooms at The Westin Resort & Spa, Los Cabos are an oasis that rejuvenate and replenish.A full menu of relaxation and recreation is always within reach,"}