{"user_rating": 4.5, "review_count": 290, "name": "Western House Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The best thing about this hotel was the service we received throughout our stay. Both on the reception desk and in the lounge staff were attentive and helpful.", "title": "Excellent Staff & Lovely Hotel", "helpfulness": 1, "user": "tom7p", "date": "February 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 13335595, "likes": {"liked": "— large room size, & lounge.", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007", "text": "The room was a very good size and clean but perhaps a little cold. the bathroomwas tiled all over and also clean with nice toiletries. Our room was in a separate building over the road from the main building. Although this looked a little dated from the outside the rooms inside were very nice. There was a DVD player in the room and the TV had CNN, Sky Sports, Sky Sports News.", "title": "wedding!", "helpfulness": 2, "user": "thereviewofahotel", "date": "November 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 10833792, "likes": {"liked": "— the architecture, the interior design, the service, the food", "disliked": "— no spa/leisure facilities"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "The main building containing the reception area and lounge was very sumptuous and comfortable. We ate in the lounge, where the food was excellent.", "title": "Excellent service, great rooms, eye to the details", "helpfulness": 3, "user": "lennypt", "date": "August 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8514198, "likes": {"liked": "— The service was excellent all around", "disliked": "— The location is not excellent, but great if you're going to the racing at Ayr!"}}, {"rating": 5.0, "title": "Best hotel ever", "text": "We have nothing bad to say about this hotel or our stay.", "helpfulness": 5, "user": "dave57", "date": "August 10, 2007", "id": 8382469}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We recently got married at the end of October at the Western House Hotel.", "title": "hotel out of this world", "helpfulness": 4, "user": "andrew_mcneilly", "date": "July 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0}, "id": 8054911, "likes": {"liked": "— Every thing", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "Having stayed in many hotels in England, many of which purported to be a 5* I was unsure what to expect from the 4* Western House. However from the minute we arrived to the minute we drove away (with reluctance) we could not have wished for a happier, more pleasant and comfortable stay.", "title": "Absolutely love it - the best", "helpfulness": 4, "user": "Heccythump", "date": "May 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7721830, "likes": {"liked": "— The room", "disliked": "— Nothing I could fault"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We arrived early, at about 11 am and were told, somewhat apologetically that the room wasn't ready - we never ever expected it to be at that time. There was a wedding taking place that day so the staff checked if we were attending that, which we weren't and advised our room would be ready no later than 2 pm, which I didn't consider late at all. We did return around 2.30 to collect our keys, the room was ready, the room was perfect and our luggage was already in it. We had booked a Courtyard room at a bargain rate, considering the tariff displayed at reception, but would have happily paid the full tariff price for the standard of accommodation we had.", "title": "Fabulous Hotel Facilities and Staff!", "helpfulness": 3, "user": "CambridgeSandra", "date": "May 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7715703, "likes": {"liked": "— The room"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "We had gone to attend The Burns an a'that concert at the Racecourse, and the hotel was ideally situated both for the event and for the town, the staff were able to competently answer our questions, give us brilliant directions, and nothing was too much trouble for them.", "title": "Pretty average", "helpfulness": 2, "user": "simonp820", "date": "April 20, 2007", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 7402386}, {"rating": 5.0, "title": "Tremendous", "text": "The breakfast the morning after was second to none, cooked to order and cooked to perfection - on a parr with that which I ate at the Clarence in Dublin (one of the leading hotels of the World).", "helpfulness": 3, "user": "Shimon", "date": "March 3, 2007", "id": 6906361}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "There was nothing I could fault about this hotel, it was quiet, the rooms were warm, the radiators worked brilliantly, the bathroom was exceptional, the t.v./dvd brilliant, the beds comfortable, the turn-down service added that extra touch and I for one cannot see why this hotel only rates as 4*. It's certainly at the top of that scale and in my humble opinion worth of a full 5*'s", "title": "Excellent accomodation", "helpfulness": 2, "user": "Galstonion", "date": "February 26, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6840647}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The hotel doesn't look that fabulous from the outside as it sits on the corner of a couple of busy roads surrounded by the race course, stables and a car park. However, as soon as you walk into the hotel, all this is forgotten. The decor is beautiful and staff are polite and efficient (whilst still making you feel at ease). We had a courtyard room - slightly odd arrangement with high windows and completely overlooked but very comfortable, well equipped and clean. Food was excellent - the Lounge menu particularly represents amazing value for money and there was a great selection for breakfast. We were here for a wedding so had preferential room rates - I'm not sure that the hotel is so amazing that I would have been willing to pay the full rates they advertise, though this is more to do with the location than the hotel itself. It's a shame it doesn't have more outdoor space. That aside, highly recommended.", "title": "Fantastic!", "user": "|Bodster", "date": "October 22, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 21089219}, {"rating": 5.0, "stay_parameters": "Stayed May 2008", "text": "I had to write a review to let you know what a fabulous wedding day we had at the Western House hotel, Ayr. Not only is it a beautiful venue, grounds, rooms etc but the food excellent and the staff incredible!", "title": "Our Fabulous Wedding Day!", "helpfulness": 1, "user": "r19sky", "date": "August 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19326961, "likes": {"liked": "— everything!", "disliked": "— not there long enough!"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "It is the biggest most expensive day of our lives but here at the western house it was worth every penny - we would do it all again and here!", "title": "Perfect for a wedding", "user": "freckle_face14", "date": "July 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 17837195, "likes": {"liked": "— The Food", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Jane is incredible - our day flowed so well and without her it would still have been good but not fabulous! Jean has you organised to a tee and all the staff are fresh, smart and exactly what you want on the biggest party of your lives - no agency staff in their school shirts here.", "title": "fantastic hotel", "user": "holiday58Glasgow", "date": "July 5, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17550779, "likes": {"liked": "— decor cleanliness modern", "disliked": "— would like to stay longer"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled solo", "text": "So if you are considering having your wedding here then don't take too long its booked out for a while and if your attending a wedding your in for a treat! Its no wonder it won wedding venue of the year!", "title": "Dinner was fabulous", "user": "jiilp", "date": "June 20, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 17084404, "likes": {"liked": "— Really large and comfortable bed", "disliked": "— No drawers!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Arrived very late (around 1am) the duty manager on the front desk couldnt have been nicer,even cracking a joke about our late arrival to which my wife found very funny.(something about comming out to look for us because we were so late).", "title": "Brilliant", "user": "thegunslinger", "date": "June 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 16782734, "likes": {"liked": "— The Staff", "disliked": "— Driving There"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "We were showed to our room by the porter in the Courtyard lodge and imformed that if we needed anything just to call reception no matter what time it was,we was made to feel extra special, the room was BRILLIANT , well decorated and furnished.The gardens in the grounds of the hotel were immacculate,and looked onto a racecourse. The hotel itself is very tastefully decorated with a sitting area with an artificial coal fire which was delightfull, the restaurant was small but friendly the staff are so polite and helpfull,and the breakfast well worth the money! we didnt use the bar but there was ample seating, All the staff from the time we arrived to the time we left were very nice and helpfull it must be a joy to work at this hotel because all were very cheery .I will definetly be recommending this hotel to all my friends and family if they ever decide to visit Scotland. on the whole i would give this hotel 10/10", "title": "saved us", "helpfulness": 1, "user": "mama4llama", "date": "June 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 16682978, "likes": {"liked": "— staff service, fun location during race season", "disliked": "— no other restaurants close by"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "After walking out of the Piersland in Troon, we booked into the Western ..which charged us 45gbp less per room than the one we walked out on. We needed two rooms that would allow my smoker husband the ability to step out of the room to smoke. They gave use two side by side rooms right next to the door in one of the courtyard buildings. We wanted to book a suite in the main building, but they were all taken..this is the number one wedding hotel in the Ayr region, so you need to book early. Service is excellent, they couldn't do enough for us. Room service was very prompt. We ate in both the dining room and the bar area, they serve two different menus. But the dining room was happy to get us some of the less formal dishes served in the bar as well.Sandy and Caroline bent over backwards for us. Food was so hot we often had to wait to eat it...try the cullen skink..fish soup..it's terrific. Breakfast is also very good, the salmon served with the eggs is delicious. Lunch on the patio during race day is fun, you can see the horses thunder by while you eat wonderful sandwiches..again try the salmon.", "title": "Just brilliant", "user": "Cyberhell", "date": "May 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16383210, "likes": {"liked": "— Everything", "disliked": "— Grim view of buildings on approach and not great signage for hotel"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Our rooms were large with comfortable chairs, good beds, good linens, hot water and plenty of water pressure.", "title": "This should be awarded 5 stars", "user": "Carolees", "date": "May 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 15630157, "likes": {"liked": "— stunning interior and beautiful rooms", "disliked": "— no spa"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "Booked as a 1 night stay on our way up to a holiday house in Oban. Good rate of £65 for the courtyard room I'd booked as I'd heard good things on here about even these basic rooms out of the main house.", "title": "Fantastic Stay !", "helpfulness": 1, "user": "Dalefan22", "date": "February 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13715465, "likes": {"liked": "— everything", "disliked": "— outside main building - take an umbrella just in case"}}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 12, "average": 19, "very good": 67, "terrible": 6, "excellent": 186}, "aka": "Western Hotel Ayr", "slim_ranking": 0.318181818182, "description": "An award-winning 4 Gold Star hotel located in Ayrshire, 5 minutes drive from Prestwick International Airport and with easy links by rail and road to Glasgow and Edinburgh city centre. The hotel, set in mature landscaped gardens, offers executive bedrooms and suites in the main house, and well appointed modern courtyard rooms.The 2AA rosette Jockey Club Restaurant offers an excellent dining experience using a high quality local produce prepared by our executive head chef.The hotel is an excellent venue for Meetings & Events and is the ideal base for both business and leisure guests. With free on site parking for over 250 cars and complimentary wifi.Western House is an ideal base for exploring the surrounding areas with many shops and golf courses nearby. Burns Country, Culzean Castle, and the Isle of Arran are within easy travelling distance.Awards Received:Scottish Hotel Wedding Team of the Year 2012/Scottish Reception Excellence Team Gold Medal 2012/Senior Wedding Planner Fellowship 2012/Scottish General Manager Gold Medal 2012/Scottish Rising Star of the Year 2012/ Scottish Rising Star General manager of the Year 2012/The Scottish Hotel Reception Team of the Year 2010/Visit Scotland’s Customer Care Award for Serviced Accommodation 2007/Hotel Review Scotland’s Customer Care Hotel of the Year 2009/ Hotel Review Scotland’s Scottish Wedding Hotel of the Year 2007, 2008 and 2009/Hotel Review Scotland’s National Hotel of the Year 2009/The Scottish Hotel & Review Guide Scotland’s Scottish Hotel of the Year 2009"}