{"user_rating": 3.5, "review_count": 2225, "name": "Westgate Lakes Resort & Spa", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "We were checking in with 17 people, booking 2 villas for the whole group. We thought by making a reservation early and even checking the rooms and paying in full in advance would help us get through the whole checkin process. Boy were we wrong. Waiting over an hour and a half just to check in...to rooms we had booked days in advance. You assign rooms based on first-come-first-serve? Can I give you some advice? Don't do that. You're penalizing any customer willing to PAY IN ADVANCE, are you crazy?!?!? Our front desk service was less then satisfactory. We had our ID and Visas photocopied 3 different times because quote, \"We've misplaced your paperwork.\" It's 2012, please use a computer.", "title": "More headache then it's worth...", "helpfulness": 3, "user": "JP E", "date": "May 31, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 131013433}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Your phone service was great, every time I called from the room for something it was taken care of within minutes. The front desk as well as the VIP desk were far from satisfactory. We even had a package delivered one day and was told it was ready to pick up at the desk. When I got downstairs the man there said, \"We're sorry the person with the key to the mail room has gone home already.\" THIS WAS AT 2 IN THE AFTERNOON. I almost laughed in his face with how ridiculous that sounded. Some strings were pulled, and the packed was finally delivered.", "title": "Too many guests, not enough employees", "helpfulness": 3, "user": "TyjaNichole", "date": "May 30, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 130978816}, {"rating": 1.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We also had dinner at the Smokehouse. This place felt like a train wreck. Our waiter forgot we were there and I started walking to the bar and other waiters to get water, condiments, and silverware. The steak was some of the worst I had ever had...dry couldn't even begin to describe it. While trying to pay for the bill we were told that we couldn't use a credit card. This was once the bill arrived, we were told we couldn't use a credit card. I was about to say then we're taking this meal for free and walk out. We didn't...and decided to charge it to the room.", "title": "READ BEFORE YOU STAY", "helpfulness": 11, "user": "TryNewPlacesBeach", "date": "May 30, 2012", "detail_rating": {"value": 2.0, "service": 1.0}, "id": 130977009}, {"rating": 1.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Finally the checkout process was also a nightmare. The reservation was lost again, our tax exempt form was misplaced and then told, \"it's not signed properly\". Overall I'm never planning to come back to the Westgate or recommend it to any other businesses we work with. Please take this review and make some changes...the front desk alone could use a HUGE re-manangement structure. Better trained employees and a DIGITAL system where rooms are pre-assigned so checkin can be made easier would literally save you HUNDREDS of man hours.", "title": "LONG WAIT- Dirty Tub- Weak shower- BAD customer service- NOT SAFE!!!", "helpfulness": 6, "user": "Lindsey B", "date": "May 29, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 130861339}, {"rating": 3.0, "stay_parameters": "Stayed May 2012", "text": "I checked in on a friday night at 1130pm, there was a line wrapped around ropes they had set up \"to handle the crowd\". Apparantley, this is normal operation for them to have so many people check in. No one told you where to go, but I guess with the line of 37 people they expected you to figure that out yourself. I foolishly assumed these people had no reservations, NO, everyone had reservations and like me had already paid for at least one night, so we were all forced to stand in line or lose the 200 we had already paid. btw the line took 53 minutes to get through. There were all kinds of employees,& managers walking around but unfortunately only half of the check in desk had people checking in guests. This is a big resort, they have alot of amenities BUT they have entirely too many guests for the amenities. Inside the room was nice, spacious and it was quiet, we didnt hear much but outside was the hood. People EVERYWHERE, yelling from balconies. There was alot of staff but they didnt stop the commotion. For the size of the room, the price was good BUT apparantley everyone else found out how great it was and piled into rooms. There was a room in my building that literally left the front door open all day and night and people wandered in and out, yelling, etc. My son talked to one of the boys from that room, he said they had 19 PEOPLE staying in the room that split the cost of it They never asked me when I booked how many people would be in the room, and obviously didnt ask them either. I wouldnt go back bc this is not my type of crowd, I like more laid back low key. This was teenagers walking in the parking lots, hooking up in cars. Grown people yelling from balconies and there was no reason to complain bc they did it right in front of the staff.... smh, ive never seen anything like this at a \"resort\". You would have thought they were at the motel 6, but they thought they were bc between the 19 of them they only paid 10.oo a piece...", "title": "The things that were good we're really good but the things that were bad we're really bad.", "helpfulness": 5, "user": "Mp1015", "date": "May 28, 2012", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 5.0}, "id": 130805193}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "We had the most wonderful experience at Westgate. The staff was very friendly and knowledgeable. We will be going back there again soon. So much to do for the kids and adults. We recommend this to everyone young and young at heart.", "title": "Wonderful Experience", "helpfulness": 1, "user": "gullfer3000", "date": "June 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131292900}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "I had high hopes for the Westgate Lakes Resort & Spa in Orlando. Unfortunately, I was consistently let down and frustrated. The check-in process was incredibly inefficient and slow. Their \"first come, first serve\" mentality and process does not make sense at all. Having a \"Reservation\" should be a clear confirmation for the customer their room is booked, set and ready for their arrival, not \"let me see what is available\". Especially after over an hour wait in line to check in.", "title": "Functional rooms, poor management - AVOID THE HEADACHE", "helpfulness": 3, "user": "hcb7", "date": "June 3, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 131211565}, {"rating": 1.0, "stay_parameters": "Stayed June 2012", "text": "We even visited the hotel a month prior to our stay to tour the facility and confirm details and payments. They had lost our paperwork and payment, not only that time, but also the day we arrived and the day we were checking out! How does that happen? Three or four different times, they made photo copies of my license and credit card because they had lost the previous copy. I'm not sure if it was related, but shortly after our visit, my credit card company called me to inform me my card had been tampered with and had to send me a new card.", "title": "Worst customer service ever!", "helpfulness": 5, "user": "Redbull951", "date": "June 2, 2012", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 131136865}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "I also do not understand why they do so much of their records via paper. Service could be so much more timely, efficient and organized if everything was taken digital. This would be to their advantage and benefit to explore updating and upgrading their customer service with use of computers.", "title": "never again", "helpfulness": 3, "user": "Daniel B", "date": "June 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 131078015}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The larger rooms were pretty nice, and functional for our big group, but not worth the hassle we experienced in checking in and out.", "title": "Worth the $", "helpfulness": 3, "user": "jingerbread", "date": "May 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 131042535}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "The resort was very clean and at a great location. Would stay the again in a heartbeat.", "title": "It was at a great location..", "user": "Strawberrys03", "date": "June 11, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 131783153}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "I booked into this property because I had a free 2B/2BA week with Interval. Since it was free, I decided to use it for a girls weekend getaway and invited a friend along. Upon arrival, I felt like the whole check in process with much crazier than it needed to be. You are not greeted upon arrival. I assumed to walk up to the desk right in front of me, which was not registration but VIP Services. This person took my name, then walked me to registration. Whatever. You then check in, but instead of getting your room number and be on your way, you are literally handed off to another person, who walks you to the \"welcome desk\". This is fancy wording for \"book your 90 minutes sales presentation\". As I am an owner with Marriott Vacation Club, and they knew I was coming in from Interval Exchange, what was the point? So I said, no, we will not be joining you for your exciting breakfast and delightful and informative resort overview (more fancy language for sales pitch). I finally took my keys out of her hand, grabbed a resort map and walked away. Sheesh.", "title": "Raccoons, fire alarms and waterfalls! Thank goodness there was a spa", "helpfulness": 4, "user": "DelcoMom", "date": "June 6, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 131445467}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "So this was the first 25 minutes. But we quickly recovered and found our unit. I do give this resort compliments on its upkeep. The grounds are beautifully maintained and the buildings are all in good shape. The rooms themselves have a bit of a 90s feel to them. As I am a Marriott owner, it is all about comparison, and there is none. Standard laminate counter tops in kitchen and bath, dated cabinetry, furniture is not current style. But it was clean and the beds were comfortable.", "title": "May 2012", "helpfulness": 1, "user": "browneyedgirl1967", "date": "June 6, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 131442596}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "Then the problems started. One evening we were relaxing on our balcony and I heard water running. Came inside to find a waterfall in the 2nd bath! Water was streaming down from the shower light fixture into the shower stall. We immediately called maintenance who said they would be right over. We were going out to dinner, so after 20 minutes we had to leave. When we returned, there was no sign that anyone had been there, but we were greeted by a very large raccoon, just lumbering along the outer hallway. Fortunately he was not very interested in us and headed over the end rail and up onto the roof.", "title": "Look forward to returning!!", "helpfulness": 1, "user": "susan425", "date": "June 5, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 131368554}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We did receive a recorded message saying that our problem was resolved. Hmmm, nothing more. So we called the front desk and they said the report indicated that maintenance had caulked the shower drain above and all was great. Well, we returned the following day to find not only water in the bathroom, but dripping from the ceiling all the way to the vestibule outside our door. Oh, and did I mention that the fire alarms were blaring! Apparently the water had tripped the electrical and set off the alarms. We called the front desk and they asked how they could help us. I just held out the phone and told them I would like someone to come and put out the fire! Even with that remark, no one showed up for 20 minutes. So we now know that their alarms are not wired into central monitoring, because a fire truck never showed up, just a maintenance guy in a golf cart.", "title": "Nice place would recommend to friends & family", "helpfulness": 1, "user": "floridasal", "date": "June 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 131305589}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Stayed in a 3 bd. villa on June 2-9, 2012. Room 2314 (first floor, lake view). We stayed with owners and had all owner privileges.", "title": "The good, the bad, and the annoying....", "helpfulness": 3, "user": "Tessa C", "date": "June 13, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 131913925}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The good: Great location, and shuttle service to major theme parks. Very close to Universal and Seaworld. Spacious rooms, with lots of storage and room for everyone to spread out. Feels like an apartment not a hotel. Lots of pools and other resort amenities. Nice view of lake. Great screened-in patios on all rooms.", "title": "great location", "user": "neila_maraj", "date": "June 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131840211}, {"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "The bad: Check in took more than 30 minutes. Rooms are extremely dated - feels like I was stepping back into the 1980's. Some minor maintenance issues, but they were addressed in a timely manner. Rooms were clean, but daily maid service is not available. Have to call someone every time you need towels replaced, etc. We did have one mid-week clean up on Wednesday. Had to kill a roach in the bathroom on our first night. Rowdy guests in parking lot and next room - went on for hours! Evidently security does not patrol this property at night. We did not have any info to call security - but were given the info the next morning when we complained.", "title": "Home away from home!", "user": "Kaddie373", "date": "June 12, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 131835763}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The annoying: Upon arrival at check-in, even owners have to go through the high pressure \"greeting\" which is actually a time-share pitch in disguise. Our party was offered breakfast if the owners would attend a presentation. They were also promised a $50 gift certificate to the smokehouse grill (on-site bbq restaurant), and discounted theme park tickets. They agreed, but the sales pressure was intense. Barely let you finish eating breakfast, and they were at the table with the pitch. Breakfast was lousy by the way, really poor quality and not worth the time. We went to breakfast at 10, and owners did not finish up with salesman until almost 12:30 - definitely more than the one hour they had planned on. They were pressured to upgrade and buy another week. They were given the gift certificate, and discounts on tickets for their time, but felt stressed out by the end of it. Not a great way to start a vacation! I think that if you are already an owner, you should not be pressured in this way.", "title": "Great Location and Spacious Rooms", "helpfulness": 1, "user": "MADCHUk", "date": "June 12, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 131817345}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "The other annoying things about this property were:", "title": "Heavenly", "helpfulness": 1, "user": "Sherronot", "date": "June 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 131789821}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 242, "average": 299, "very good": 632, "terrible": 369, "excellent": 683}, "aka": "Westgate Lake Resort Spa", "slim_ranking": 0.55623100304, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Westgate Lakes Resort & Spa in Orlando, Florida, provides guests all the comforts of a fully furnished home with accommodations ranging from studios to large four-bedroom spacious suites, all within minutes of Orlando’s world-class theme parks and tourist attractions, as well as many family-friendly restaurants. A nonsmoking Orlando resort, Westgate Lakes Resort & Spa is pet friendly, allowing pets under 60 lbs. With a variety of onsite amenities, Westgate Lakes Resort offers something for everyone!"}