{"user_rating": 4.5, "review_count": 135, "name": "West Bank Inn", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "The staff was very friendly. I asked for a later check out time and got it. Bed was very comfortable and room very clean. Location was important for me, and having everything nearby made it a convenient and enjoyable stay. The complimentary breakfast offered good choices making it a nice touch. I would definitely visit again.", "title": "Clean and good location", "helpfulness": 1, "user": "ela8171", "date": "May 18, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 108730863}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "I came to this hotel solely due to the tripadvisor reviews, but I was honestly wary when I pulled up. Although it was well kept, I normally do not stay in budget inns/motels however I was pleasantly surprised! The room was basic and certainly older with no frills, however it was extremely clean with a comfortable bed. I appreciated the exceptionally friendly service and the value is truly unbeatable. I would most definitely stay at the West Bank Inn again. Don't let your assumptions of budget inns/motels keep you away, if you are looking for a clean, friendly, basic hotel at a great price - this is your place!", "title": "Unbeatable Value", "helpfulness": 3, "user": "businesstraveler009", "date": "May 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 107132839}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "The previous review covered it all. We would not hesitate to recommend The West Bank Inn. Although, if you are a light sleeper ask for a room on the opposite side of the McDonalds, especially during Masters week.", "title": "Excellent Masters Accommodation", "helpfulness": 1, "user": "dhi50", "date": "April 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 103953716}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We just returned from our stay at the West Bank Inn during our attendance at the Masters Tournament. It was the best value for any locations we could find, or had stayed in previously. It is a basic room but, as other reviewers say, is kept very clean. The fridge, microwave, WIFI, ample cable channels, coffee maker, business center/internet room and guest laundry are good creature comforts. (If you want a real kitchenette, this isn't the place.) The breakfast is good for cold items, very ample. There were also hot items that we didn't sample.", "title": "You Can't Beat It For the Masters", "helpfulness": 2, "user": "delmarduo", "date": "April 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 103787550}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled solo", "text": "The owner, David, and his staff could not be nicer or more helpful. They also arranged shuttle service (for a minimal charge) to/from the golf course......much better than driving yourself the mile or so and then fighting for parking, etc. Although I'm a light sleeper, the nearby highway and major route did not disrupt sleep.", "title": "Great little Gem!", "helpfulness": 1, "user": "satique", "date": "March 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 101191675}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "If you want a great value hotel with comfortable beds, that's clean, has a nice breakfast, with updated furnishings, refrigerator, microwave, coffeemaker, then look no further. For anyone to complain that the McDonalds is loud they should not be looking at hotels in Augusta under $100 a night. (and even then you may get noise) I was not expecting what I got and I was very pleased. Keep your AC fan running and bring a fan from home and you will hear nothing outside.", "title": "Better than expected!", "user": "AVLME", "date": "September 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 118757134}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "For those of you who like to workout - their workout room is very good with an eliptical, treadmill and bike. Has a TV, water and towels. I have had very expensive hotels that have had much worse.", "title": "Best hotel in all my travel experience :)", "helpfulness": 1, "user": "Lael B", "date": "September 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118608713}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Stay here and save your money for a nice dinner!", "title": "#1 Hotel in Augusta?!?!? - No Way!", "helpfulness": 1, "user": "TrishaMarie", "date": "September 11, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 2.0, "value": 3.0, "service": 4.0}, "id": 117959658}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We were in Augusta for our nephew's AIT graduation and chose West Bank Inn from the plethora of positive reviews. This is the first hotel I've noticed to use an ozone machine to remove smells. I hate the smell after carpets are cleaned. It was the cleanest and quietest hotel room that we have ever stayed in. Staff were friendly, professional and helpful. My brother came in after midnight and didn't want to check in that late, so stayed in our room in the other double bed. When I offered to pay for the third person, the clerk told me not to worry, that our bill was ready. It would have only been $5 anyway, but it was nice for my brother to also enjoy the breakfast of bacon and eggs. We paid $62 total for a clean, quiet room with excellent customer service and a hot breakfast. This was a big bang for the buck. I wish they were all over the country, since we travel a lot. Since my brother was staying two days longer than us, I talked him into this hotel and we returned in the afternoon. The clerk checked my brother into \"our\" room. She had a lot of personality and made the check-in fun.", "title": "A pleasant surprise for a quick weekend getaway", "helpfulness": 2, "user": "blbvball18", "date": "August 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117374149}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Reserved two rooms here for two nights based on reviews posted on TripAdvisor. This is the first time I have been disappointed in a hotel recommended by TripAdvisor's members. The pros are the hotel is clean, the employees are friendly and helpful, the wireless works well, and they have complimentary newspapers in the lobby each morning. The cons: Older hotel that definitely needs updating. Pictures are misleading regarding location. Hotel is on a busy street and is right next door to a very busy McDonald's. The noise from the cars pulling in and out of McDonalds all night long (screeching tires/horns blowing) was very annoying and woke me up several times. Apparently, it is a hangout long after it closes for business. The bathroom is dreary, tiny and almost claustrophobic. Bottom line: you get what you pay for. The rates are very cheap so you do get your money's worth, but my advice is spend a few dollars more and stay somewhere else. #1 hotel in Augusta; I think NOT. #1 INEXPENSIVE hotel in Augusta... maybe.", "title": "Quaint - Definitely will stay again!", "helpfulness": 2, "user": "MrsPLT", "date": "August 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117187965}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "This was the BEST place forms to stay during my contract time. Ashley the front desk attendant and the housekeeping ladies made my stay feel like I'm staying in a 5 star hotel", "title": "The Best Value Priced in Augusta", "helpfulness": 1, "user": "Travelingnurseinga", "date": "July 26, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 115818808}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "My daughter and I had a great experience with this hotel recently. It is conveniently located for easy access to everything we wanted to do. We found the desk clerk, Mary, to be so friendly and very helpful when we had destination questions . She even printed out a \"how to get there from her\" map for us. We will stay at WBI again anytime we get back to Augusta. The room was nice, clean and comfortable with a m/w, refrigerator, etc....all the goodies that travelers or visitors need were accessible there. Great discovery. Nice to know places like this still exist.....the rate was very reasonable. Thanks yall...for everything. Good people.", "title": "Best deal in town", "helpfulness": 1, "user": "candysmoma", "date": "June 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114871688}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "I hate \"outside doors\", but decided to stay here based on the reviews and the price. I was not disappointed. I stayed here with my son duirng a trip for a National Bike Race. The room was clean and had a refrigerator, microwave and cable TV with pay channels. It was quiet (our room was on the opposite side of McDonnalds), more quite than any other hotel I have stayed in. The beds were comfortable too. The AC worked great and I thought the location was perfect. The staff was very friendly and helpful and the breakfast was also the best I have had (included) at any hotel. Sausage, eggs, pancakes, cereal etc, just great. I would not hesitate to stay here again. The free wireless internet worked without a problem in my room.", "title": "Great stay for three days", "helpfulness": 1, "user": "bicibill", "date": "June 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114768379}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "The desk staff was very friendly and efficient. The rooms are very reasonably priced and were incredibly clean, which is very important to me. It is an older hotel but it was perfect for my family.", "title": "Very clean and affordable.", "helpfulness": 1, "user": "mlb1980", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 112986895}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "We have stayed here several times and it was always enjoyable. Excellent location and very friendly staff. Clean rooms for a great price.", "title": "Excellent!", "helpfulness": 1, "user": "Skeptic123", "date": "June 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111595529}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "This is a place where the little extra touches make you smile. The breakfast is generous and during our days we were offered a variety of hot and cold options. Even had pancakes on Pancake Tuesday.", "title": "Welcoming", "helpfulness": 1, "user": "Catherine21149", "date": "March 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100875786}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "Rooms are spacious and beds comfortable.", "title": "Clean and reasonably priced", "helpfulness": 1, "user": "Rineni", "date": "March 17, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 100553314}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "Excellent value for your dollar.", "title": "Decent, cheap inn, good location", "helpfulness": 1, "user": "gubik", "date": "November 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 86933119}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Clean rooms. Some freeway noise, but not too bad. Reasonable price.", "title": "Nothing to complain about!", "helpfulness": 2, "user": "Kimyshimeas", "date": "November 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 86431322}, {"rating": 5.0, "title": "Worth every penny", "text": "The West Bank Inn looks kind of shady, but it's not too bad for a quick stay. We had business early and rather than leave Atlanta before 5am to be in Augusta at 7am we decided to stay overnight. On a small budget, West Bank Inn was definitely no issue. The location was good enough, right off the exit and at the end of the strip of main restaurants.", "helpfulness": 1, "user": "MachereJones", "date": "November 4, 2010", "id": 86007611}], "location": {"country": "United States", "city": "Augusta"}, "variance": {"poor": 3, "average": 9, "very good": 38, "terrible": 0, "excellent": 85}, "aka": "West Bank Hotel Augusta", "slim_ranking": 0.0506329113924, "description": "We offer clean comfortable rooms and personalized service at an affordable price. Located in the center of the city with easy interstate access, you will find our place puts you close to everything. Come stay with us, and we will do all we can to make your stay enjoyable."}