{"user_rating": 4.5, "review_count": 274, "name": "West Eleventh Historic Townhouse Apartments", "reviews": [{"rating": 5.0, "title": "the carvaggio!", "text": "My husband and I chose west-eleventh for a honeymoon stay. We were greeted with a complimentary bottle of veuve to begin our honeymoon celebration!", "user": "kylathesmyla", "date": "October 9, 2006", "id": 5930999}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "It was so perfect, the entire stay. It was just like having your own apartment in the west village - really, after just one day there, i felt like i was back living in nyc. It was lovely. And the hosts were accomodating and gracious. If you are looking for an apartment-style stay, choose west-eleventh. You won't regret it!", "title": "A wonderful way to experience Manhattan", "user": "carol0402", "date": "October 8, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5927835, "likes": {"liked": "— It's location", "disliked": "— Buy a subway guide to figure out which trains take you where"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "My only teensy weensy complaint was the weak wireless signal, but really, is this a big deal? nah. LOVED MY CARVAGGIO!!!", "title": "The quintessential Village experience", "helpfulness": 2, "user": "inwoodlad", "date": "October 7, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 5925778, "likes": {"liked": "— location, hospitality", "disliked": "— twin beds, not king"}}, {"rating": 4.0, "title": "Live like a New Yorker at West Eleventh", "text": "My daughter and I make an annual trip to Manhattan. This year we looked for something outside of the hectic Times Square area and we found it at the West-Eleventh Townhouse. We stayed in the Leonardo Jr. Suite and absolutely loved it. The area in the West Village is great. The restaurants are wonderful. The accommodations were as described. Communication with Therese prior to our arrival was very concise and professional. Michelle, Keith, and Christina were wonderful to work with. Our accommodations were very roomy and so quiet. We are already looking forward to our trip next year and will be looking to stay here again. It is a wonderful way to experience the city. We highly recommend spending your time here. It feels so much more like a vacation than staying in a hotel. Everything you need is close at hand. We thank all of the staff at West-Eleventh for making our third trip to Manhattan our best one yet!", "user": "scaricari", "date": "October 6, 2006", "id": 5923075}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "If location is king, this place rules. If you love New York City but could do without the noise, congestion and hoards of tourists, this is your neighborhood. It's a rare treat in New York City to walk out your door see actual trees, and still know that you can walk one block and drink yourself to death at the historic White Horse Tavern, where Welsh poet Dylan Thomas famously did just that.", "title": "Location, Location, Location", "user": "Paul_Dougherty", "date": "October 5, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 5911861, "likes": {"liked": "— The location and apartment size, great housekeeper, room was always spotless.", "disliked": "— 3 flights of stairs to climb"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "While staying in New York over the holidays in 2006, we were delighted to be guests at the West Eleventh Townhouse in Greenwich village. My sister in law, who is a local, steered us to the West 11th, where we stayed in the El Greco Room. We could not have been happier. The room was spacious, with an adjoining day bed room. The location was unbeatable, right in the heart of all things wonderful in the village, and the owners and personnel were extremely helpful, friendly, and welcoming. Where else can you stay in New York city where you actually get to meet the owners of the hotel and have them make you feel like you are a welcome guest in their own home? They gave us complete insider knowledge on the best restaurants, places to go, etc. We had a fantastic stay, and feel that we now have a special 'inside knowledge' on where to stay in the village for our next visit to the City. Thank you so much West 11th! Mark, Janet, and Sophia Rawson, San Luis Obispo, California", "title": "Quiet Comfortable Clean and Charming", "helpfulness": 1, "user": "markra", "date": "January 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 6540669, "likes": {"liked": "— location, quiet, and cleanliness", "disliked": "— stairs"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "This was our second stay in New York and, after staying on the upper west side the first time, wanted to experience the \"Village\". We couldn't have been happy with our choice of location or accommodation. We requested the Leonardo suite on the ground floor to avoid the stairs. We had read a review that the downside of this apartment was that the beds were made up as twins - but a simple request solved that problem. Keith, who greets you and gives you tips for restaurants, was wonderful. The apartment was very comfortable, clean and great value for money, although it doesn't have a kitchen like some of the other apartments- just a microwave, bar fridge and kettle. The location was second to none with an infinite choice of restaurants, most open until after midnight and it was a short stroll to the subway. However, the street itself was very quiet with little traffic noise. The Leonardo shares an entrance with the owner's apartment, but we did not find this intrusive and it gave us the opportunity to meet them - both very nice people. We had a fantastic time and have already highly recommended this place to our friends.", "title": "Experience the real New York", "helpfulness": 2, "user": "DWSydney", "date": "December 29, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6517497, "likes": {"liked": "— home away from home in one of the best cities in the world", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "My sister and I stayed at West Eleventh Townhouse for 10 days prior to Christmas and everything about our trip was amazing - especially our accommodations at West Eleventh in the El Greco apartment. Greenwich Village is a dream (especially during the holiday season) and West Eleventh is right in the heart of the village, just blocks away from some of the most amazing restaurants at which I have eaten. During my previous visits to Manhattan, I have stayed in very lovely hotels in uptown, but going forward, I will only stay at West Eleventh - and, if there are not any rooms available, I may have to consider re-scheduling my visit to the City!", "title": "Wouldn't stay any place else!!!", "helpfulness": 3, "user": "Lulu_Two", "date": "December 29, 2006", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6516268, "likes": {"liked": "— Location, price, apartment vs. hotel"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "We loved our stay at this charming 19th Century Townhouse in the centre of Greenwich Village. It really did feel like a home and not a soulless hotel. We stayed in the Monet Apartment which was in great condition, and had daily maid service. It had a large living area, TV with cable, cd/radio player, and your own phone line. There was a nice useable kitchen area with a large sink, fridge, microwave, cooker – and for us Brits a tea-kettle. The bedroom area was semi-separate - different room, but no door, the bed was large, comfortable and the room had a clock radio. The bathroom was great with a marble floor, full length mirror, new toilet and sink suite, a powerful shower (over the bath) and a quirky skylight, which allowed natural light but privacy. Couple of tips the water needs to be run a while before it gets hot, and the heating is centrally controlled, but you can turn it on or off. The apartment itself overlooked the quiet gardens at the back of the house. It was up three flights of stairs, but for most people this wouldn’t really be a problem.", "title": "Perfect Greenwich Village Base", "helpfulness": 5, "user": "rosiew76", "date": "November 20, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6156363}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "We couldn’t praise this place more highly, we’ve stayed in other similar places in New York before but not of this standard.", "title": "Great Place to Stay", "helpfulness": 2, "user": "Stevowatny", "date": "November 18, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6148588, "likes": {"liked": "— Location", "disliked": "— stairs"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "I reserved a stay at West Eleventh primarily based on the glowing recommendations on Trip Advisor. Either I have the worst luck, there is a different West Eleventh townhouse somewhere around 11th and Bleecker, or maybe I expect too much. Here's the lowdown:", "title": "Jeez, I took Trip Advisor's advice on this one - sort of bummed!", "helpfulness": 9, "user": "hoolia41", "date": "November 16, 2006", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 6137960, "likes": {"liked": "— Location", "disliked": "— Wireless problems and bed situaton"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The Good:", "title": "Excellent accomodations - very quiet, clean, comfortable", "helpfulness": 1, "user": "jfratesi", "date": "November 14, 2006", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6130597, "likes": {"liked": "— Quiet", "disliked": "— Climbing 2 flights of stairs with my 51-lb. suitcase."}}, {"rating": 2.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "-great location, right in the village, 1/2 block from Magnolia Bakery and close to main thoroughfares and subway stations.", "title": "Insane no-guest policy", "helpfulness": 8, "user": "Taxtherichnow", "date": "November 14, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 4.0, "location": 4.0}, "id": 6124460, "likes": {"liked": "— location", "disliked": "— Puritanical guest policy and hairs in the bed"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "-owner and caretaker very nice and friendly.", "title": "a cozy retreat", "helpfulness": 2, "user": "jennydoneit", "date": "October 23, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6002913, "likes": {"liked": "— location", "disliked": "— not able to have quests up to room"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "-room was large and well appointed.", "title": "Very good", "helpfulness": 1, "user": "nanceke", "date": "October 23, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5985283, "likes": {"liked": "— Authenticity", "disliked": "— For New York - a good value for money"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Spent three days this past weekend at West Eleventh. The location is outrageously good--in the heart of the Village with umpteenth places to eat, drink, shop, etc. Definitely one of the best locations in New York City. Stayed in the Leonardo room, which was spacious, clean, and pleasant, with a great flat screen tv, although the \"king\" bed that was really two beds pushed together was a bit of a drag for me and my fiance. The staff was welcoming and helpful. All that said, there were drawbacks. I was told that housekeeping would be there between 11 and 4--when they showed up at 11:30 and I asked if we could have another half hour, the housekeeper said they were leaving and so we couldn't get service that day. Checkout is at 11 a.m. -- on the early side, especially considering that it's not a regular hotel where you can leave your bags for a few hours after you check out. Lastly, you have to make appointments to pick up and drop off the keys. Bottom line is, this place is more work than a regular hotel, but certainly worth it if you value location over convenience and other more typical amenities.", "title": "Terrific location, pretty good hotel", "helpfulness": 4, "user": "linda528", "date": "January 16, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 6605676, "likes": {"liked": "— location", "disliked": "— couldn't leave bags / housekeeping inflexible"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Our stay at the Carvaggio appt at West Eleventh was great, location is perfect. After a previous stay in midtown a few years ago we prefered Greenwich Village around West Eleventh. Lots of great restaurants and shops, you really feel like a New Yorker - we even got asked for directions when coming out of the appt! The Carvaggio was nice, with a large living area. Bed part fairly small but didn't bother us, kitchen ok & bathroom ok with good shower. There is internet access via an ethernet port (no cable in appt) and you get an iron/board too. Nice view of the back of Greenwich village townhouses from large windows. We had a warm welcome, Kathi was friendly when we arrived, gave us restaurant tips and we settled the account up front.", "title": "Great independence & location, but..", "helpfulness": 4, "user": "nimbletimble", "date": "January 11, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6576975, "likes": {"liked": "— Location, size, New York feel, good value", "disliked": "— Not for the forgetful.. $300 if you lose keys! Some staff are rude"}}, {"rating": 4.0, "title": "Perfect for our needs", "text": "Then came the first of two slight downers, it seems slightly over the top to have to sign so many bits of paper agreeing to no guests, not letting anyone into the building, and the ridiculous agreeing to be liable to the tune of $300 per lost key! This kind of spoilt the welcome, especially having paid the balance. Losing the keys would be only an inconvinience for the owners but a real pain for guests if it happened at night, as you are pretty independent there. Would it be fair to charge this if the keys were in a bag that was stolen? That said, we knew these conditions were in place (from other trip advisors) so were careful with keys and didn't have guests, but had hoped that the reviews here would prompt some changes. The other hopefuly constructive critisism is the lady who checked us out at the end of our stay was bordering plain rude. It could only have been worse had she stood at the open door pointing outside! Still, just a thing to make us laugh when we think back about the trip but could easily be fixed with a good slap (joke).", "helpfulness": 3, "user": "Brian/Beckenham", "date": "January 10, 2007", "id": 6570924}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "We'd stay again, maybe we'd try one of the other appts at West Eleventh. The $300 keys issue is a REAL off putter though, apart from that and the moody lady you will leave with great memories of Greenwich Village.", "title": "Great location", "helpfulness": 3, "user": "MartiniGirlSydney", "date": "January 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6563630}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "Having read various reviews on this website for The West Eleventh I was expecting a Spanish Inquisition on arrival and a constant looming threat from the owners.", "title": "Quirky Place", "helpfulness": 6, "user": "dswiow", "date": "January 5, 2007", "detail_rating": {"front_desk": 1.0, "service": 3.0, "business": 3.0, "cleanliness": 3.0, "rooms": 3.0, "location": 3.0}, "id": 6556824, "likes": {"liked": "— location", "disliked": "— welcome"}}], "location": {"country": "United States", "city": "New York City"}, "variance": {"poor": 10, "average": 9, "very good": 73, "terrible": 9, "excellent": 173}, "aka": "West Eleventh Historic Townhouse Apartments Hotel New York City", "slim_ranking": 0.32, "description": "West Eleventh is a beautifully appointed townhouse right in the heart of Greenwich Village. A walk away from all major transportation. A stroll to cosmopolitan restaurants, cafes, and galleries. Located near the Hudson River and the adjacent Hudson River Park. Also,the hot new/old meat packing district is a 10 min. walk. Neighborhood shopping on Bleecker at world renowned stores such as Marc Jacobs, Ralph Lauren, and Cynthia Rowley. All accommodations are smoke free. Quiet, mature clientele preferred. Private, European-style accommodations. Our accommodations are: Caravaggio Apartment, Marcucci Apartment, Monet Apartment, and Leonardo Suite."}