{"user_rating": 4.5, "review_count": 962, "name": "Westin Princeville Ocean Resort Villas", "reviews": [{"rating": 5.0, "title": "Perfect!", "text": "We spent 6 amazing days there.", "user": "MichMT1705", "date": "November 26, 2012", "id": 146188125}, {"rating": 3.0, "title": "Nice place to stay but expected more from Westin", "text": "The rooms are clean, big and well-stocked, specially the kitchen, so you can buy everything in the supermarket (3 minutes by car) and make a delicious meal in the barbecue outside. They have many all around the Resort.", "user": "Julie R", "date": "November 25, 2012", "id": 146185417}, {"rating": 5.0, "title": "No beach, but beautiful property", "text": "There are many nice pools, but the best is the whirlpools, very warm to relax in the end of the day.", "user": "Cawater", "date": "November 22, 2012", "id": 145965976}, {"rating": 4.0, "title": "Nice, but Not Our Favorite Starwood Property", "text": "What is different from the other resorts is that you don't feel in a Hotel, but you have all of the services and facilities if you need.", "user": "Julie87508", "date": "November 21, 2012", "id": 145930462}, {"rating": 5.0, "title": "Magnificent Location on Kauai", "text": "Hopefully we will return soon!", "user": "Evelina62", "date": "November 21, 2012", "id": 145911486}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We stayed at the Westin in a 1 bedroom villa on March 12-14 to spend some time on the North Shore.  Here's what you need to know:", "title": "I really wanted to love this place but it fell a little short of expectations-", "helpfulness": 3, "user": "starhawk", "date": "March 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 155032123}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The Good: relatively spacious suites, very large bathroom with jetted tub, amazing water pressure in dual shower head shower, nicely equipped kitchen.  There is a welcome package of dish soap, dish scrubber, dishwashing detergent, laundry detergent which is nice.  We booked an island view but ended up on a room which overlooked the parking lot and neighboring golf course but had ocean views which was great.  Excellent and fast wifi access. Washer and dryer combo.  Food and service at the restaurant onsite (Nanea) was very good and the ambiance was warm and the outdoor seating area was lovely in the evening.  Amazingly, the restaurant has a separate vegan menu with several choices for apps, entree, dessert... woot!  Updated decor and furniture.  Staff was uniformly friendly and helpful-  Beautiful grounds in and around the hotel.  There's a walk/run/bike path that leads out of the hotel property which is nice (running maps available at the concierge).", "title": "A very relaxing experience", "helpfulness": 5, "user": "jgregb", "date": "March 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 154993133}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Make sure you check out the hidden beach (Hideaways) that is accessible after a walk/drive to just before the St. Regis property.  Park at the tiny lot next to the Puu Poa condo tennis courts. There's a dirt path that leads to an overlook and super steep steps/short trail leading down to the beach.  Note that this will be challenging to anyone with ambulatory issues and possibly very small children but should be doable for anyone else if the ground is not wet and slippery (although it requires a bit of a scramble and there are only rope railings for the most part).  Not a good swimming beach but beautiful for relaxation on the beach away from crowds. (see YouTube link I found which shows the spectacular beauty of the beach, as well as the condition of the path to get down to the beach: http://www.youtube.com/watch?v=S8GX486ym9Q&feature=youtube_gdata_player).", "title": "Beautiful Resort Hotel on the Cliffs", "helpfulness": 1, "user": "lfarmwife", "date": "March 17, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 154895668}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled solo", "text": "There's another beach accessible on the property to the right of the lobby, next to the parking lot (it's marked by a small sign).  It's a relatively easy walk on a wide path (5-10 minutes) to the beach which had gentle water and easy snorkeling,", "title": "Great Location, Weird Service", "helpfulness": 1, "user": "jolie852", "date": "March 17, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 154883318}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The Bad: No housekeeping, even though our rate was to include daily housekeeping (and we were not given the option of trading housekeeping for the vouchers other reviewers have mentioned).  We were there for only 2 nights so by the time we realized it wasn't happening, it  wasn't worth it for us to ask for it and didn't make a difference but if you have a family or it's otherwise important to you, you should confirm with the hotel.  Paying for self parking at a hotel in the middle of nowhere is really pretty terrible.  Finishings and appliances at the property were not really high end, if that sort of thing matters to you.  A lot of ceramic tile in the bathroom (although granite counters), perfectly functional but dated black appliances in the kitchen.  Reeeeeeeally uncomfortable couch.  Walls are pretty thin, the unit next to ours had a family with small children and we could definitely hear entire conversations and people sneezing... There's also construction going on at the pool so the noise was a bit of a distraction pool-side although you can kind of tune it out.  The 11 am checkout and 4 pm checkin are pretty ridiculous.", "title": "Beautiful location with all the comforts of home ... and then some", "helpfulness": 1, "user": "Peter M", "date": "March 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154792000}, {"rating": 4.0, "title": "Clean place with nice pools", "text": "Great hotel for a trip. It's nice that the rooms are equipt with a kitchen. The service is above average and the staff is friendly. The pools are very beautiful! The only disappointing thing is that the hotel is not on the beach. There is a shuttle, however, that will take you to the beach.", "user": "Bella92694", "date": "September 14, 2013", "id": 177178828}, {"rating": 5.0, "title": "Great Place to Stay", "text": "If you are traveling to Kauai, the Westin on the north shore is the place to stay. Great location, great service, restaurant, and fantastic pool side bar. Chris and Cass are great bartenders, make awesome drinks, very friendly and give great advise on the local scene. A must stop for a Mai Tai. Prices are much better than other over priced resorts. And do not miss the Sunday Brunch a mere 5 bucks more gets you 3 glasses of champagne.", "user": "Ron H", "date": "September 12, 2013", "id": 176933211}, {"rating": 4.0, "title": "A really nice property", "text": "We love this place. Really nice comfortable and upscale studio units (big rooms with nice mini-kitchens). However, there is no beach on the property. What you lose there you gain in altitude and vistas. The reciprocal privileges with the St. Regis work just fine, though it's a few miles away, so requires some planning ahead. We were in Bldg 4 which we thought might not be the best, but has a hidden upside -- beautiful panoramic horizon view of the ocean and \"Bali Hai\", and a nice sunset view as well. Rates in Bldg 4 might be a bit lower since it's far away from the ocean front, but again, hidden benefits! Nice pools but better to get up early and go to Hideaway Beach for great snorkeling! Peaceful and refined.", "user": "peter s", "date": "September 12, 2013", "id": 176925017}, {"rating": 4.0, "title": "Nice \"Hotel\" ... Best best in Princeville", "text": "Book at the Westin not realizing its not a hotel but timeshares. That being said, we really enjoyed it after figuring out the differences.", "user": "A TripAdvisor user", "date": "September 8, 2013", "id": 176366271}, {"rating": 4.0, "title": "A Relaxing Stay on a Beautiful Property", "text": "We booked a \"studio\" with one queen bed - which when we checked in seemed small. We called the front desk and paid $75 to upgrade to a one bedroom unit. Worth every penny. This one had a king sized bed, much larger bathroom, and most importantly, a living room plus complete kitchen. We used the washer/dryer frequently. The full sized refrigerator was nice but the ice maker was totally awesome for our visit.", "user": "JayceeSue", "date": "September 8, 2013", "id": 176315526}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "It was great to choose this location for our first time in kauai. This area is still has not been fully invaded by high rise hotels and huge developments. There are plenty of small businesses which cater to the visitors. Westin was a great choice. It is a low key resort with all the amenities. It is very clean and the staff will go out of their way to make you satisfied. Once I arrived i requested if there was a possibility for an upgrade. The front staff found a perfect location for us. Building 4 facing the ocean and the golf course. It was definitely worth to pay the upgrade fee. They also so moved us from a studio to a one bedroom suit. Once you stay here you can go to Saint Regis which is two miles away. There is a shuttle that goes there on the hour or you can go with your car and valet service is complementary. Saint Regis is the top brand for the starwood hotels. The beach area is very relaxing and I took my snorkeling equipment on the second day. There is a nice reef with lots of fish. You can eat and drink there and charge it to your room. It is a bit pricey but definitely worth it. There is a bar in the lobby which has a terrace area over looking the ocean and the Hanalei bay. If you go here you have to stay and watch the sunset. The view is unbelievable. This was a great trip for our marriage bounding and I think the Westin is great choice. I have three kids which i was happy to leave behind. For once after a long time we could do what we wanted to do. There are a lot of hiking trails with unbelievable views in this area.", "title": "First time in Kauai", "helpfulness": 1, "user": "attarfamily1", "date": "March 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 154389813}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We reserved our 1 bedroom unit 3 months in advance & I guess as owners we were expecting a better view room. Although the room we received was nice, there were others that sat empty that offered a better view. The bathroom is over-sized that takes up alot of room from the living room as well as the bedroom. I would not want to share this 1 bedroom with anymore than 2 people. Kitchen was well stocked & the patio was nice with furniture.", "title": "Lush grounds, beautiful scenery", "user": "NWGAL61", "date": "March 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 154384491}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "My wife and I just returned from the Westin Princeville Oceans Resort Villas and the best vacation we have ever had. We had a great room overlooking the ocean. The food was delicious both at Nanea and at the pool bar. But the people were the main reason for such a wonderful trip. Too many to name but Julie, Karlyn, Anna, Jason, Fey, Mary, Gabby, Kelsey, Shannon, Cass and Chris among many, made this special.", "title": "Fantastic Vacation", "helpfulness": 1, "user": "Bracks72", "date": "March 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 154365603}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We will be back again next year and can hardly wait.", "title": "Mellow and Economical Vacation Spot", "user": "Susan_ikt", "date": "March 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 154312514}, {"rating": 2.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We stayed at this property through a promotional package that included 5 nights in a studio room, credit for car rental, and a resort credit. We would certainly stay here again if offered the same package. The room had a lovely \"island\" view, which for us was perfect overlooking a quiet infinity pool and mountains of Kaua'i in the distance. The room was more than large enough for us, and although the kitchen would not support cooking a full meal, we made salads, full breakfasts, and indulged in ahi tuna poke from the local Foodland for dinner. They had nice BBQ areas, although we didn't make use of them. Our room was clean, the bathroom was nice with the big jetted tub and large shower. Although they only did maid service once during our stay, they provided plenty of clean towels and we didn't mind straightening our sheets ourselves each morning. They did remove our trash each morning when we left it outside our door. The grounds on this resort are amazingly beautiful and well maintained, and it truly felt like walking through botonical gardens. Although we were asked to participate in a timeshare presentation, there was no pressure whatsoever when we politely declined. Plus, they gave us some really good sightseeing and restaurants tips! We ate at the market for breakfast once, and it was really nice. Fresh food, reasonable prices - not sure what some of the complaints are about? We also enjoyed the affiliation with the St. Regis. We walked the 4 miles roundtrip to the resort in the mornings, and returned there using valet parking later in the day to enjoy the beach area. Really nice arrangement. We also played golf at the Makai Golf Resort twice, which was really, really nice. Would recommend this resort to my friends. However, will mention that the weather was significantly cooler than Maui, which we went to after leaving Kaua'i. Although I could wear shorts, I did have to wear a light jacket and long sleeve shirt to be comfortable. This is probably typically for February, but I was a little surprised. We also enjoyed whale watching from the resort cliffs that overlook the ocean - a plus for visiting in February.", "title": "Design Problems with the Resort", "helpfulness": 3, "user": "mifarmgirl", "date": "March 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 1.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 154277906}, {"rating": 5.0, "title": "Absolutely Beautiful", "text": "This was our first time in Kauai, and was a time share trade. This resort is huge. The unit we had, had a full kitchen, and very large bathroom, with jacuzzi tub. We also had the adjoining studio room which was connected, but had it's own entrance for privacy. There were two families, in the two rooms. Our Bldg had it's own hot tub and pool, if we didn't want to go to the main pool. This one was very private. The balconies are large, and had very nice quality chairs (2) and ottoman. The main pool area is very large and picturesque. There was a Koy pond and a huge waterfall near the main pool, and the grounds were tended to each morning. The grass was perfectly cut and maintained as were the beautiful flowers. You can take a shuttle to the St Regis Hotel just to see it, or use the beach. Will definitely return if we visit Kauai in the future.", "user": "Bogie-7043", "date": "November 21, 2012", "id": 145864180}, {"rating": 1.0, "title": "Not for Couples and Not a Genuine Hawaiian Experience", "text": "I'm generally an optimistic traveller but I expected a lot more from a Westin. The designers of this property should be banned from designing anything other than Motel 6's, Home Depots and Denny's. The North shore of Kauai is absolutely stunning and the Westin is an over glorified Best Western on a cliffside with no beach access, LOTS of kids, no views and zero character. I'm in the heart of Kauai, but couldn't feel any further away. If you are looking for a real Kauai experience or a romantic getaway, stay away. If you are looking for a neighborhood block party, this place is for you. At $350/nt we received a room located between the loading dock, the back of bar and a parking lot. The mattress was lumpy, the bathroom is open to bedroom (seriously) and the only thing louder than the air conditioning is the beeping trucks outside our balcony. Oh...the balcony. The room was advertised as coming with a 44sf balcony....it was a four inch thick slab of concrete set in mud at ground level a couple of feet in front of the main walk...not a balcony. My recommendation...stay away. Hanalei Bay itself is absolutely gorgeous and should not be missed. Just pick somewhere else to stay.", "user": "Paul E", "date": "November 20, 2012", "id": 145829636}, {"rating": 5.0, "title": "Memorable vacation", "text": "this was our first trip to Kauai and we were impressed with the property the minute we arrived. The room was immaculate, the grounds were neat and beautiful. The staff were very helpful and friendly. We would highly recommend this property to anyone looking for a relaxing vacation.", "user": "Kwalker5050", "date": "November 20, 2012", "id": 145786659}, {"rating": 4.0, "title": "Good, but not the best Starwood resort", "text": "We chose the Westin because of the availibility of a 1-bedroom suite, so that our daughter could sleep in a separate room. The suite itself is packed with everything one would need for a week's stay -- complete kitchen (dishwasher, coffee maker, toaster oven, electric stove/over, large fridge, dishes, cutlery, pots/pans, etc.). The living room sofa turned into a sofa-bed, and, frankly, it was not very comfortable. The separate bedroom (with separate TV) was very nice with kingsize bed, though we felt the king size pillows were wayyyyyyyyyy too soft. The bathroom was large and there was a extra large jacuzzi that we never used. They provided adequate numbers of towels and there was a hair dryer if needed. And also a washer/dryer in a separate closet! we had a ground floor room in building 3. I usually prefer a higher floor because privacy can be an issue but this time I just accepted it and it turned out to be no issue. Our patio opened across from one of the \"plunge\" pools (large enough to get wet and move around a bit, too small to do laps) and a heated whirlpool. These areas are meant to be quiet zones and those guests with younger children stayed near the larger swimming pools, so you could actually stretch out by the plunge pool with a book and relax. Now, as others have noted, there is no upgrade for Starwood members. Also, while every other starwood hotel I've stayed at offers an extended checkout of 4pm, the Westin insisted on 11am -- one hour later than the regular 10a checkout. This was quite inconvenient as our flight was at 5:30p. But if there was really one nit to pick it is the housekeeping schedule. We usually left by mid-morning and until I complained, housekeeping did not come until very late in the afternoon -- 3:30-4p. This meant that after a morning/afternoon sojourn, we returned seveal times to rooms that had not been straightened. However, on our check-out day, we started getting calls and knocks on the door before 10a...not nice.", "user": "melsays", "date": "November 19, 2012", "id": 145764213}, {"rating": 3.0, "title": "Beautiful, but expected more", "text": "This is a beautiful hotel with impeccable grounds, stunning views, and nice location. The room was spacious and clean, and the staff was friendly and helpful. But for $300 a night (to start), I was a little disappointed. They charge $13 a day for parking; there's a coffee maker in the room but you have to purchase the coffee (an amenity even the cheapest hotels have); the air conditioner in our room made loud clicking noises every time it turned off (ruining the mood and making it hard to fall asleep); I ordered a $9 sandwich (plus delivery fee!) for room service and it was clearly a pre-packaged sandwich that had been sitting all day... Overall we enjoyed our stay, and the problems we had were small, but for a 5-star hotel, I expected more.", "user": "Grnbeans", "date": "November 13, 2012", "id": 145310216}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We stayed in a 1 Bedroom studio in Bldg 3 for a week Feb 16-23, 2013. Loved it! Small kitchen area, but great view of the ocean. Bed and bath were good. Some wasted space as you enter the unit, but if we'd had beach stuff, that would have been a good place for it. The staff was good, got in at midnight on first Saturday, and front desk lady was gracious and welcoming. Lady at SVO concierge was extremely helpful and only pushed a bit about scheduling for the owner's update. She guided us to the Holo Holo tour up the Napali Coast. Now, February on Kauai is a bit rainy and windy. Other boat companies decided day by day, but she assured us this company would take us all the way up and around, and they did! Good advice from her. The little shop was good. Pools looked great, but with so much else to do and weather so iffy we didn't spend much time by the pool. Reciprocal program with St. Regis for their beach, so we went over there one cloudy afternoon to experience that amenity. All in all, for the time of year, it was a good stay and a wonderful studio unit. Westin does it right.", "title": "Best studio ground-floor Room in Building 3", "helpfulness": 1, "user": "TennesseeTraveler057", "date": "March 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154690873}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "oh my! our second time at this resort and it never disappoints. it has an amazing location perfect for my surfer husband. the pool is perfect for relaxation - although they need more waitstaff - especially for the side pools which the waitress claimed to service but drinks took over a half hour to receive. couples massage was way too expensive + my masseuse was horrible. more $$$ for a deep tissue and half the time it felt like she was barely using any force. built in tip ... what a ripoff - i wanted to just cancel right then! the hospitality suite was perfect for our late-night red eye back to the east coast.", "title": "amazing time, yet again ... but massage HORRIBLE!", "user": "courtina", "date": "March 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154680368}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "and yes, it's not on the beach but that is clear ... and you can take a path to the beach next to the resort or take the shuttle ...", "title": "Beautiful rooms, with lots of amenities - would not return", "helpfulness": 3, "user": "marcopolopaloalto", "date": "March 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 1.0}, "id": 154558937}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We had a 1 Bedroom suite.", "title": "Very Good Overall", "user": "JonDCo", "date": "March 14, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154551199}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Pros:", "title": "Worth Every Penny", "user": "TravelandCoffee", "date": "March 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 154524275}, {"rating": 5.0, "title": "Garden Isle relaxation", "text": "The Westin Villa resorts are great venues for family and couple stays. While the Princeville area is on a cliff and generally does not have beach access, the grounds and numerous pools make The Westin Ocean Resort Villas a relaxing spot for down time. For beach fixes, a shuttle will take you to the sister St. Regis where your Westin stay give you access to their beach and restaurants.", "user": "John K", "date": "November 11, 2012", "id": 145176623}, {"rating": 5.0, "title": "Great place to vacation", "text": "The grounds are well designed around the numerous pools. With an open tropical feel, the grounds pay proper homage to Kauai’s nickname of the Garden Isle. The grounds are constantly being maintained. While we were there, they were hand weeding the grass. (no walking through herbicides here)", "user": "TFparkcity", "date": "November 9, 2012", "id": 145048760}, {"rating": 4.0, "title": "Family friendly, comfortable, clean", "text": "The one bedroom villa we stayed in was very spacious and having a pool steps away from our lanai (we were on a ground floor unit) made us feel at home. The Westin beds are very comfortable and the quiet surroundings allowed us a rare opportunity to sleep in. Furniture in the unit complement the property’s tropical theme.", "user": "C_A_Dallas", "date": "November 9, 2012", "id": 145004919}, {"rating": 4.0, "title": "nice place for families", "text": "While there is a shuttle service to the local shopping center and St Regis, we found the shopping center an easy walk away. The center at the entrance to the Princeville area offers a Foodland to stock up on prepared food (including a full poki counter!) and an assortment of local produce and fish. If you are a wine lover, visit the wine shop in the center for an assortment of wines to meet almost every budget.", "user": "RealtorSanMateo", "date": "November 8, 2012", "id": 144906480}, {"rating": 5.0, "title": "We'll return", "text": "The unit kitchen features a cook top, microwave, dishwasher and cooking equipment. Outdoor grills are also available if you want to grill fresh fish or steaks. The resort features the Nanea Restaurant, which we found better than the Makana Terrace at the St. Regis. The onsite market also has prepared food if you do not feel like going to the shopping center.", "user": "TravelGolfer", "date": "November 7, 2012", "id": 144862956}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Got a great deal for 6d/5n for $798 (with 6d car rental included) through SPG as part of previewing their time share opportunity at this location. We stayed in a studio. At check-in, they tried to up-charge us to a one bedroom, but we declined as there are just 2 of us, and a studio is like a hotel room with a kitchenette. As this was a Westin, was expecting their Heavenly Beds and Shower - there were neither. Next, only 2 pool areas, both on the small side. There is supposedly servers to bring you food and drinks from the bar/grill, but never saw them unless you were sitting close to the bar. No music flowing through the property - this is a resort after all.", "title": "It's a Westin in name only", "helpfulness": 4, "user": "ViVi43", "date": "March 9, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 154109067}, {"rating": 4.0, "stay_parameters": "Stayed December 2012", "text": "When went to the timeshare presentation, and brought up all of these points, the answers were as follows. \"Oh, you must have gotten a handicapped room\". Ok, wow, let's think about that answer - it's on the second floor, and there was no way a wheelchair could have maneuvered in that studio. And, no handrails of any sort in the room/bathroom. Total lie.", "title": "Really good, except someone stole my iPod:(", "user": "DickConnolly", "date": "March 8, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 1.0, "rooms": 5.0}, "id": 154036927}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "When questioned about the servers - \"They are supposed to attend all of the pools. Someone must have been out sick.\" They were out sick for 5 days??? I don't believe that was the answer, as there were 2-3 servers every day, hanging out at the bar/grill only. So really, your servers are lazy. Isn't this where most resorts make their money - on fancy mai tais for vacationers for $12 a pop?? Curious.", "title": "Great stay", "user": "Winsome01", "date": "March 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 153980398}, {"rating": 4.0, "stay_parameters": "Stayed March 2013", "text": "\"We have music playing throughout the property, the volume must be really low.\" Umm, have you walked around and listened yourself? I guess you are calling me deaf.", "title": "Much smaller and quiet than some of the other starwood properties. Great north shore location.", "user": "rlfromm", "date": "March 6, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 153888323}, {"rating": 2.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Price wise, this was a great deal, but won't be back due to the subpar standards of a resort with the Westin name attached to it. Frankly, if I were Westin, I wouldn't have my name attached to this resort. This really shouldn't be called a resort in any way shape or form. It's really just a 7 timeshare buildings and a pool.", "title": "Do not stay here.", "helpfulness": 1, "user": "kelpkelpkelp", "date": "March 5, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 153787257}, {"rating": 4.0, "title": "No Surprises, Westin Resort Timeshare/Hotel", "text": "This is another relatively new, not sold out timeshare property. Some consider it in the excellect category, but those folks have not stayed at a Ritz Carlton or Four Season resort. You get everything you would expect from a newer Westin or Marriott property (note some Marriott's) are nicely converted hotel properties, while the limited number of Westin properties I have stayed at our purpose built as timeshare villas. This one is no exception as it is well equipped and comfortable. The 2 bedroom consists of a lock-off one bedroom with pullman kitchen, full frig, apt-size dishwasher and a washer and dryer. As we had friends staying with us, they made ample use of their own washer and dryer, etc. We used the living room-kitchen-diniing room area as our common area. Each bedroom unit has a bath and separate shower. Look at the website for details of the layout and facilities as it does not contain a lot of hype. A plus for this Westin as if gives you beach privileges at the St Regis (nee Sheraton Luxury Resort) and is only .>1 miles down the road with its famous, dare I say world famous, bar-terrace overlooking Hanalei Bay and those fabulous sunsets. Valet park your car there and drop by as you will not be disappointed. Their top restaurant is not too shabby either as we have not had a bad meal there in the 3 years of visiting Princeville. Their not-so-budget priced Makana Terrace restaurant is very good, too.", "user": "ohgeorge", "date": "September 8, 2013", "id": 176249916}, {"rating": 4.0, "title": "Northside is the best in Kauai", "text": "To mix things up a bit and to get a better feel for the island, I booked 1/2 our vacation stay on the south side and the other half here in Princeville. We LOVED the north side the best because my family loves to hike, swim, surf and we were always in search of the best snorkel spot and we found it all here- well except the surfing part. The Westin is beautifully located on top of a cliff overlooking the ocean. The 1 bedroom/Qn sofa suite was nicely decorated, clean and showed no signs of abuse or wear. The beds/bath were clean and the room nice and quite. The full kitchen was stocked nicely to meet your basic cooking/brewing needs. The main pool, an infinity pool, was very nice and my kids enjoyed the kiddie pool. (Note: We stayed at the Westin Resort Villas in Maui, and found the pool here smaller). We ate most mornings at the on-site restaurant- nice buffet for $20A/$10Kid. There was no extra charge for the WiFi but they did impose a $13/night parking fee. Service was friendly. We had one issue with our stay and that was when we noticed that the prev occupants spilled something on the carpet that became sticky-like once it dried(juice possibly). Well, not sure if us tracking through it and then onto the tiled floors made them sticky as well but we called the lobby and they sent someone to our room within an half an hour to clean it all up. So they addressed our complaint quickly.", "user": "Lois S", "date": "September 7, 2013", "id": 176138835}, {"rating": 3.0, "title": "beutiful kauii with some problems this time", "text": "Highlights: We found a beautiful beach to swim and snorkel at where the waves and currents were gentle. Great for kids who can truly swim well. People suggested Ke'e although picturesque, the currents were stronger and choppier than I felt was comfortable/safe. In fact, I found Kauai's beaches to have stronger currents than in Maui. Highly suggest sticking to swimming in lagoons or coves if you are not a strong swimmer. Took a canyon hike in Keokee- absolutely beautiful though the extra trek to the fall was underwhelming. On the way back, stopped at an artsy town, Hanapepe where we ate the best pulled pork meal ever(sorry didn't catch the name but you will know where this place is when you get there. The town is maybe a full block long). On our last night we went to Dolphins for a nice dinner. We had our first taste of Ono and loved it. Service was friendly and quick, food nice but pricey for what you got. FYI- The hotel/Resort taxes and fees were quite high so that room you booked for $350 is more like $420.", "user": "nikki532", "date": "September 7, 2013", "id": 176133040}, {"rating": 4.0, "title": "Beautiful Kauai", "text": "we were here in aug and have stayed here before and loved it", "user": "JanetWK", "date": "September 5, 2013", "id": 175925526}, {"rating": 3.0, "title": "Just another Westin.", "text": "the property is beautiful but when we pulled out the pull out bed it was stained and had many holes in the mattress,they did replace it ,the whole thing took one hour late at night, and have to really push for some kind of compensation (they were not forthcoming on this)", "user": "The808Traveller", "date": "September 4, 2013", "id": 175821658}, {"rating": 5.0, "title": "We Loved It!", "text": "Our room had a view of the golf course with the ocean just beyond it. The Westin Resort is so lush. Wonderful pools and spas. We didn't try the restaurant or any of the amenities because we were so busy getting to know Kauai. It's a small island, so the resort isn't that far from anything. It doesn't have a beach, but they have reciprocity with the St. Regis and you can use their beach, going by shuttle or using the complimentary valet. But we found lovely beaches all over the island, so it wasn't an issue.", "user": "GinOaklandCA", "date": "December 9, 2012", "id": 147092597}, {"rating": 4.0, "title": "Fabulous grounds and nice experience, but...", "text": "I found the staff to be very friendly and helpful, including concierges. The helicoptor ride they recommended seemed to us to be the nicest fleet at the airport.", "user": "markpender", "date": "December 4, 2012", "id": 146782793}, {"rating": 3.0, "title": "Nice grounds, great location, unfriendly staff at concierge lots of extra fees", "text": "My wife and I were likely here at the Westin Princeville for the same reason as many of the other guests - either as part of an enticing package deal or a timeshare exchange. A fantastic property set on a cliff high above the Pacific Ocean, the Westin certainly delivers in terms of majesty and appearance - the grounds are absolutely immaculate! However, there were a number of annoyances and inconveniences that weren't quite up to the Westin standard we are used to. More on that below...", "user": "Katinska", "date": "November 30, 2012", "id": 146505321}, {"rating": 2.0, "title": "Bad taste and nothing hawaiian about it", "text": "First, some other positives: Staff were on the whole very welcoming, helpful and friendly. The pools and main clubhouse are tastefully laid out and offer a great spot for families to hang out all day (the small slide was particularly attractive for the kid in me). Our 'studio suite' was small but well stocked with necessary amenities, including dishwasher and wash machine detergent. The many grills scattered throughout the property allowed for delicious (and budget-friendly) al fresco seafood dining. Free (and relatively stable) wireless access throughout the property. The hotel's location was also quite convenient for anyone wanting to stay on the North side of the island - for both early am walks (short trek up the hill to the Princeville shops) and full day excursions (hikes along the Na'apali coast and the Hanalei beach).", "user": "jolandadora", "date": "November 26, 2012", "id": 146265017}, {"rating": 4.0, "title": "Great service even after you leave!", "text": "Now for the less attractive sides: As some of the other reviewers have pointed out, there were a couple head scratching little annoyances that came up during our 5 day stay. Things that we wouldn't have expected for a Westin branded property: only one in four grills on the property actually worked. The spa jets in several of the outdoor whirlpools weren't working. A timing snafu occurred when we tried to schedule a Westin timeshare pitch (and yes, we were willing!) Parking fees even if you self park. And the pool was clearly under-heated - something that's a bit of a pet peeve of mine for those of us on a tropical vacation.", "user": "Lightandsalt", "date": "November 26, 2012", "id": 146189821}, {"rating": 5.0, "title": "Excellent property with great amenities", "text": "We stayed here over a long weekend in August 2013 and found the property to be very nice. Our room was spacious, and we appreciated having the mini-kitchen to save some money on dining. The queen bed was comfortable, we had double sinks in the bathroom, and the wireless internet service was solid throughout our stay. We dined twice at the resort restaurant, Nanea, and enjoyed the experience both times. Their Princeville Market served up some great Starbucks coffee along with other grocery and household items. We also took advantage of the many pools and hot tubs on the property and found their poolside service to be more than adequate for drinks and light eating fare. The views around the property are quite nice, and the location is close to several beaches, a world-class golf course and additional shopping and dining options in nearby Hanalei. There are seven separate villa buildings with great landscaping throughout the property. I would definitely stay there again.", "user": "Warren P", "date": "September 4, 2013", "id": 175802482}, {"rating": 5.0, "title": "Super family vacation spot", "text": "We had three adults and two kids in a two bedroom/two bath suite in July 2013. It was a perfect size for us. Having a large kitchen/dining area plus a mini kitchen made it very easy on everyone. There are several pools at this resort and several BBQ area. We never felt like we were competing for outdoor facilities with other guests. Of course Kauai is a beautiful island with pleanty to do.", "user": "Bob P", "date": "September 4, 2013", "id": 175790219}, {"rating": 5.0, "title": "Fantastic value", "text": "Having visitor privilages at the St. Regis hotel was also a very nice plus.", "user": "mjmarlin", "date": "September 3, 2013", "id": 175628696}, {"rating": 4.0, "title": "Impeccable grounds", "text": "This property is located on the north shore close to grocery stores and beaches. Most of the units are privately owned timeshares and there is a great family atmosphere. The kids loved the pool and so did we - we will go back", "user": "Sarah B", "date": "September 3, 2013", "id": 175625054}, {"rating": 5.0, "title": "Great location for families!", "text": "My husband and I actually caught colds while we were in HI but we were glad that we were staying at Westin Princeville...spacious accomomdations...impeccable grounds..peaceful lanai", "user": "TLStiger", "date": "September 3, 2013", "id": 175610880}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We are Westin timeshare owners of another of the network's properties and love trading to the Westin Princeville.Our stays here are different from other beachfront Hawaiian resorts as it's truly the remote, rustic region that is the draw. The North shore is primed for off the beaten track exploring as opposed sitting by the resort pool and sipping Mai Tai's.Yes, it is a full service resort and there is a pool where Mai Tai's are served but if you are coming here for just the resort you might be better served by the St Regis down the road.", "title": "A great base to explore the North Shore of Kauai", "helpfulness": 3, "user": "Msk6261", "date": "September 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178597876}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "There a tons of remote, exotic and sparsely populated beaches in the area they just take a little work getting to.....but boy are they worth it!", "title": "We Love the Westin Princeville!", "helpfulness": 2, "user": "David M", "date": "September 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 178520807}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The rooms are well appointed and the staff is friendly and helpful. Quality dining in the area is limited but we love the fact that these are condos with small kitchens. We shop on the way from the airport and make the Westin Princeville our home for the week. We love the ability to prepare our own breakfast to eat lazily on the Lanai and pack our own lunches so that we don't have to leave the gorgeous remote beach we have hiked to.", "title": "A beautiful, relaxing resort", "helpfulness": 1, "user": "Robert D", "date": "September 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178486693}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "I would pass on the Nanea restaurant however, unless there is a huge overhaul as the experience there was below average.", "title": "Westin Princeville Not the Best of the North Shore", "helpfulness": 3, "user": "Minnie_Em", "date": "September 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 177786046}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "We used to go to Poipu for our Kauai visits and could not understand why people would choose to stay at the side of the island that gets more rain. The Westin Princeville has changed our opinion of that choice. We will return!", "title": "Love this place, can I stay longer???", "user": "LilysMum0723", "date": "September 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177716828}], "location": {}, "stars": 4, "variance": {"poor": 29, "average": 126, "very good": 304, "terrible": 20, "excellent": 483}, "aka": "Westin Princeville Ocean Resort Villas Hotel Princeville", "slim_ranking": 0.4, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "The Westin Princeville Ocean Resort Villas are atop the lush, emerald cliffs that line Kauai, this retreat is perfect to savor refreshing Pacific breezes while gazing at the sparkling ocean."}