{"user_rating": 4.0, "review_count": 445, "name": "Westin Annapolis", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "My wife and I decided to stay in Annapolis for our anniversary on New Years Eve! The hotel was very easy to find. Parking was not an issue, though you had to pay ($5 isn't bad for a night, but I don't like to pay for parking at a hotel period).", "title": "Comfortable New Years Eve Stay", "user": "stillmissmaine", "date": "January 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 122376289}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Check into the hotel was quick. It was a little confusing when you walk into the lobby because they have check in desks on both sides.", "title": "Outstanding Hotel", "user": "Mike R", "date": "December 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 122063270}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "The hotel room itself was quite comfortable. It was adequate size, hvac worked well, tv was fine and everything was clean! Could have used a couple extra towels in the room.", "title": "Westin Annapolis", "user": "Ryan M", "date": "December 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121953189}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "The bed and bedding is great! We would love to purchase some of the pillows, but the prices are just ridiculous. If they come down in price then we will purchase some of the bedding & pillows.", "title": "4 night stand", "user": "TheWayComfy2", "date": "December 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121606592}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "The hotel is about a mile from downtown. Took about 15 minutes to walk, which wasn't bad. There aren't a lot of downtown hotel options, so this worked just fine.", "title": "It's a Top Rated Hotel", "user": "UnexpectedVisit", "date": "December 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 121436353}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Beautiful hotel. Great decor and service. Close to all shops and restaurants. Heavenly as always.", "title": "Great hotel", "user": "AdventurerVirginia", "date": "November 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10596799, "likes": {"liked": "— location, heavenly bed and shower and decor", "disliked": "— our room was close to housekeeping and a little noisy"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "The Westin was nice and clean and the double room was spacious. The staff was generally helpful and courteous, until I needed a later check out. Check out was at noon and I was still in a meeting in the cafe/bar area at 11:45 am so i asked if I could extend. They kept saying no until I literally begged and was given till 12:30. I've stayed at other hotels before and never ever had any issues with a later checkout. The receptionist actually said if I needed an extra hour and checked out at 1 pm they would have to charge me another day. It was very rude especially since I paid extra to stay at the Westin for better service. I would not stay at this hotel again just because of their lack of customer service from 1 manager.", "title": "Pretty good but some downsides", "user": "Winnie C", "date": "January 31, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123891666}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "The hotel itself was great. The buffet breakfast was mediocre.", "title": "Pretty good", "user": "Edp25", "date": "January 27, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123714365}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Stayed two nights. Was pretty good. Self parking is more convenient and more economical. Very nice gym.", "title": "Very nice", "user": "thiswaythatway", "date": "January 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 123171931}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "I thought I made a reservation online for that evening only to find out when we arrived at the hotel that the online reservation system had the next day's date in it and I didn't catch it. The desk graciously changed my reservation to that night and saw us right up to the room. Rooms are nice, the bed was comfy. We had an accessible double room. The bathroom floor wasn't graded correctly for the roll-in shower so there was water all over the floor after you showered. We used the pool, that was nice. They also had a hot tub and the workout area, though not huge, was nicely equipped. Had breakfast the next morning at the buffet and it was also nice, lots of fresh fruit, a couple of choices for eggs, oatmeal, french toast, lox, bagels etc. Good food.", "title": "Great rooms and staff", "user": "SusanTony", "date": "January 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122761185}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "For those visiting Annapolis- this newer hotel is an excellent choice. We have stayed in the Junior Suites three times and it is an great hotel and very spacious. If you are planning on attending a Navy football game, we highly recommend this hotel as you can walk to the stadium. This holds true also if you are attending a graduation for USNA as the 1/2 mile walk to the stadium is far better than trying to drive and park at the stadium. The development of the area around the hotel is beautiful with condos and several restaurants right outside your door. Across the driveway are several restaurant choices.", "title": "Favorite Annapolis hotel", "helpfulness": 1, "user": "ChessieTravels", "date": "January 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122511215}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We have stayed at several Westin hotels and decided to stay here for a weekend getaway 3 years ago. We loved it and had gone back several times. We strongly recommend this hotel for the cleanliness and excellent customer service.", "title": "We love the Westin", "user": "travel74Travel74", "date": "February 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 124781402}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "My family recently spent several days at the Westin Annapolis. The rooms were clean and well equipped. We needed to go to several places in the old part of town. The hotel van service was always ready to accommodate us in taking us to and picking us up. Coffee was available at the coffee bar very early. The location in the City was convenient, and good restaurants were nearby. I highly recommend this hotel.", "title": "Excellent service at Westin!", "user": "Gary H", "date": "February 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124655568}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We just came back from a long weekend in Annapolis and stayed two nights at the Westin. This is our third stay in 1-1/2 years and we thought we'd give it another chance. All three times we've had front desk people that were very aloof and almost to the point of being rude both at check-in and check-out. Not a good way to start off a fun filled weekend. Third time is a charm because the hotel proved that they were consistant. The hotel is starting to show some wear. The bathroom in our room had a sink drain that was rusted and dirty, there was still wall paper paste that didn't get cleaned off when it was installed, the light above the sink was burned out and the lights around the mirror were both cool and warm flourescents so they didn't match. The reason that we gave it two stars instead of one is because we had two great valet/shuttle guys. Zack was cheerful and went out of his way to be helpful on several occasions and we also had a gentleman in his 50's that was delightful as well. If the Westin is the best Annapolis has to offer, they may want to check into getting some new blood in that town.", "title": "Please Kimpton Hotels, build a hotel in Annapolis, MD", "user": "inperpetualmotion", "date": "February 13, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 124548621}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "We always stay here when we visit Annapolis. Had a little delay at check-in yesterday because I wanted adjoining rooms and they weren't quite ready at arrival. The staff took care of our whole party for the inconvenience by providing us free drinks. That made it nice. This hotel is also pet friendly. There are both natural and artificialy surfaced walking areas. Internet isn't free nor is parking, but that is fairly typical of Annapolis. This is definitely one of the better hotels in Naptown. Doesnt hurt that it's right near the Navy Marine Corp Stadium home of the USNA Midshipmen. Always a great stay here for us.", "title": "Comfy, clean stay :)", "user": "PenGwennie", "date": "February 12, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 124472049}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "Was at the Westin for two nights in January.", "title": "Nice Place", "user": "rtbsb", "date": "February 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124116847}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Hotel rooms were very comfortable. The proximity to good restaurants within walking distance was very helpful. The rooms were clean and very functional. The meeting rooms were temperature controlled to be just right (not too cold or hot). The only downside is currently the front drive is going through construction so it is a bit difficult to enter the hotel.", "title": "Great meeting place in Annapolis", "user": "MelissaSAtl", "date": "December 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121322957}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "The Westin is very nice with good restaurants nearby but the thrill of the hotel is actually getting out and seeing Annapolis. Trolley stops at the hotel and makes a quick around and through the business section downtown for fifty cents. The drivers will answer questions and make suggestions. Get off the trolley and start walking, first the Naval Academy and then the downtown district. The district is perfect, old and friendly. Have breakfast at the old Chick & Ruth--certainly not the best breakfast you will find but it honors the tradition of going to a local legendary restaurant. Around 8:30 am, everything comes to a standstill, staff and patrons, as everyone stands to recite the National Anthem. Can you believe that? I was proud to do that. Branch out into the neighborhood adjacent to the academy and take in the history of the town. The State Capital is worth a stop.", "title": "Annapolis Worth Seeing", "helpfulness": 1, "user": "piratehead", "date": "November 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121198634}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "I always try to stay at the Westin Annapolis when I'm doing business in the area.", "title": "Service that Satisfies", "helpfulness": 1, "user": "Appricena", "date": "November 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121168958}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "The hotel is well kept and parking is convenient.", "title": "A great place to stay in Annapolis", "helpfulness": 1, "user": "Marigot1", "date": "November 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 121100999}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The front desk personnel (jasmine & Angie) are always pleasant, helpful, and try to accommodate the guest's wishes. I'm always glad to stay here whenever I can!", "title": "Fantastic hotel", "user": "GCJP112011", "date": "November 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 121099232}], "location": {"country": "United States", "city": "Annapolis"}, "stars": 4, "variance": {"poor": 24, "average": 52, "very good": 157, "terrible": 10, "excellent": 202}, "aka": "Westin Annapolis Hotel", "slim_ranking": 0.181818181818, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "One of the newest additions to the Maryland state capital, The Westin Annapolis hotel is the centerpiece of a European inspired mixed-use community that ripples with energy."}