{"user_rating": 4.0, "review_count": 412, "name": "Westin Bellevue", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "I think this Westin was very classy - based on decor and feel of it. Staff and front desk were all very friendly and helpful. Parking was good as we were there for the weekend so it was complimentary for guests Fri thru to Sun.", "title": "Exquisite and elegant", "helpfulness": 1, "user": "isen", "date": "August 1, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116091746}, {"rating": 4.0, "stay_parameters": "Stayed July 2011", "text": "Once again the location was brilliant cause the mall was just across the street. Cheesecake Factory was just across the street as well as other restaurants. QFC is just a few minutes walk away if we needed to pick up some grocery items. Even within walking distance you can check out a lot of the stores such as Container Store, Crate & Barrel, etc.", "title": "Horrible internet", "user": "Brookfieldsfan", "date": "July 31, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 116071337}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "Wifi was available, however, only in the lobby area AND you have to ask the front desk staff to give you a code. This is quite inconvenient I think so I hope they can streamline it and make Wifi available throughout the hotel like some other hotels I've been to now. I can say your guests will be THAT much happier! Guests can use their smartphones to surf for restaurants, shoppiing, and load their maps to navigate within the area.", "title": "Great for Business Trip", "user": "tep777", "date": "July 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116022406}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Overall a good hotel conveniently located in the heart of Bellevue. I would recommend them if you want to stay near the Seattle area but not right in the city. Bellevue is a lovely area to check out too.", "title": "great shopping getaway", "user": "berta8888", "date": "July 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115979773}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Most hotels I stayed in this trip had free wireless internet and I had to pay for the horrible connection I had here. I want a refund. I lost connection several times and was lucky to limp by with 1 bar. They really shouldn't charge for the bad connection.Great hotel at as long as you don't want or need an internet connection", "title": "Good Hotel but very pricey!", "user": "WORLD_TAVELLER_9", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 115922699}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We drove down from Vancouver BC for a weekend anniversary trip. We took advantage of the shopping package & had the best sleep either of us ever had in our heavenly king bed. Sigh! We didn't want to leave!", "title": "Anniversary getaway & an amazing weekend!", "user": "canuckgrl", "date": "July 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115670908}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "My only complaint was that it was very noisy the Saturday night. It was not conducive to a romantic night at all. I spoke to Kristen at reception the next morning & she apologized, explaining their zero-tolerance policy for noise after 11pm. She offered to move & upgrade us but we didn't want to bother with packing up our things. She did ensure that there was no one staying right next to us and across the hall so we could have a peacefull 2nd night. The staff & service at this property is impeccable! Everyone from the managers who wished us a good day to the doormen who always opened the door with a smile to the attention to detail in our room, we enjoyed every moment of our stay.", "title": "Great staff...but very thin walls! Return vist = Unlikely", "helpfulness": 2, "user": "rp77", "date": "July 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 115505493}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The location of this hotel, which is adjacent to all the restaurants & shopping means you don't have to drive anywhere. We had a fantastic time! We will definitely be back! I am also planning a girls getaway soon & would not dream of staying anywhere else!", "title": "Excellent", "user": "sayhito_nancy", "date": "July 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 115450809}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "We stayed here this past weekend for the first time. We visit Bellevue probably 10 - 12 times a year, and normally stay at the Hyatt. But thought we'd try something different this time, and the Westin also had a great promotion offering a $100 gift card to Bellevue Square for each night. The hotel itself was nice. The location was great...right across the street from the shopping mall and Cheesecake Factory. The front desk staff was very friendly and we were given an upgrade to a room with a balcony, which was great.", "title": "Hard to Top For a National Class Business Hotel in Bellevue..Has Everything", "user": "jherman06", "date": "July 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115431710}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We were happy with our stay. Until the last night (Sat) when at 10:00pm we had a knock on the door. It was a hotel worker who said that there was a complaint that we were being too loud. I was just shocked! It was just myself and my mother (who is in her 60s) in the hotel and we were just having a normal conversation discussing our shopping purchases etc. In no way were we speaking loud. The tv was on in a normal to low volume. I couldn't believe that someone would have been able to hear us...let alone be disrupted by our conversation. We did hear noises as well, but would never have complained. I have to agree that the walls must be EXTREMELY thin. Our night was ruined. We were in a good mood, just enjoying each others company, talking about our day, and we were quickly put to quiet. We had to whisper and turn the tv off so that we wouldn't disturb anyone around us. Its just unheard of to have to resort to whispering so that are not heard.", "title": "Great Deal", "user": "RodgersOut", "date": "July 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115063136}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The room was clean and the beds were very comfortable. Room service was prompt and the staff was very courteous and friendly. A skybridge connects the hotel to Bellevue Square (upscale mall) which makes shopping very convenient and easy to get to. We'll be back!\"", "title": "Amazing stay!", "user": "msherberg", "date": "August 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116587591}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We've stayed at this location many times and have seen most types of rooms (using SPG Gold upgrades). This most recent stay involved a birthday celebration and the concierge was more than happy to place a gift I had purchased in advance of our check-in time in our room to surprise my wife. They also threw in chocolate covered strawberries and champagne. Very nice. Rooms are consistently nice and clean. As for the SPG Gold upgrades, we usually get a deluxe room upgrade on a higher floor, but have lucked out on some nice ones that we try to request again.", "title": "Nice hotel, nice location", "user": "DeanOC99", "date": "August 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 116541442}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "My favorites in the past, were any of the corner rooms (we liked rooms on each floor ending in 28 i.e. 628, 728, 828, etc.), and our favorite (this stay) was on the 5th floor. I believe it was the Grand Deluxe room and features 10 ft ceilings, large walk-in shower which also enters in to a jacuzzi tub, and a door out to a balcony...I didn't even know any of the rooms had balconies.", "title": "Wonderful Service and a great bargain!", "user": "bucksduck2011", "date": "August 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116434464}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We didn't eat at their restaurant but you're right in the heart of dozens of places to go (Cheesecake Factory, Red Robin, Daniel's Broiler, Ruth's Chris, Maggiano's, etc.). We also like the secret door on the 3rd floor (opens with room key) that goes right in to Lincoln Square.", "title": "Great shopping package overshadowed by vomit in pool", "user": "TravellingMommy68", "date": "August 1, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 4.0, "value": 4.0, "service": 1.0}, "id": 116132485}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Only downside in value is probably the parking ($28 Valet, slightly cheaper self-park). It's cheaper than parking at Seattle hotels but it's very tempting to just roll the dice and park overnght at the mall across the street for free.", "title": "Nice and good location", "user": "Letsgoski", "date": "August 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 116132409}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Heavenly beds are very nice. Requested a crib for our baby and we got a Heavenly crib too! Nice when they brought the crib in, they brought in a plush bath mat. They know that we would be bathing a baby instead of using the shower. We even got a kid's pack (with rubber ducky and bandaids) when we checked in.", "title": "Very nice hotel, staff friendly and good for families", "user": "snuffers", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116951680}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Right across the street from Cheesecake Factory, which is great for kids.", "title": "Clean, friendly staff and right in the heart of Bellevue", "user": "Chich0", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116928917}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Swimming pool and patio area was very nice. We did not use the fitness room, but looked in and it looks good too.", "title": "Keep coming back", "user": "yvr2anywhere", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116925018}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I stayed at this hotel for 1 week as part of a business trip.", "title": "Beautiful Hotel in the Heart of Bellevue Square", "user": "ggke", "date": "August 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116821221}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I had a standard room which was of an above-average size. The room was cleaned daily and I had no problem with anything to do with regards to the room.", "title": "I'll be back!", "user": "Catherine K", "date": "August 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116757552}], "location": {"country": "United States", "city": "Bellevue"}, "stars": 4, "variance": {"poor": 14, "average": 41, "very good": 155, "terrible": 9, "excellent": 193}, "aka": "Westin Bellevue Hotel", "slim_ranking": 0.28, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "This hotel is conveniently located in downtown Bellevue, just 20 minutes from the many Seattle attractions. The Westin Bellevue Hotel's suites are situated minutes from major corporate offices."}