{"user_rating": 4.0, "review_count": 438, "name": "Westin Alexandria", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "While the Westin is a very nice looking hotel we had a things we did not like and it really seemed like the staff was somewhat irritated when they actually had to help. Great location near both King Street and the King Street Metro Station. Street parking is very, very limited so be prepared to pay a decent amount for hotel parking. I was irritated that they offered no soda.soft drinks except in the small shop adjacent to the front desk. Other than that you could go to the bar and pay almost $4.00 for a fountain soda or order thru room service only. The bed was tremendous as most Westin's are but overall the best I can say for my three day please stay is that it is an average city hotel.", "title": "Westin Alexandria, VA", "helpfulness": 1, "user": "Steve2744881", "date": "November 15, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 145461196}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "My husband and I are newlyweds and spent the weekend at The Westin Alexandria. From the minute we walked through the doors we knew we were going to have a wonderful experience. Ronald checked us in at the front desk and immediately made it clear that we were going to be taken care of. He gave us a room on the 8th floor with a great view. He also recommended a couple of nice restaurants within walking distance and told us to call him if we needed anything. After spending several hours outside the hotel celebrating, we returned to our room where we were welcomed by a bottle of champagne and chocolate covered strawbe", "title": "We Loved The Westin Alexandria!", "user": "ERICA S", "date": "November 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145193136}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "rries! Customer service means everything to us and we couldn't have been more pleased with Ronald, Jay and everyone at the front desk. We told Ronald that we'd definetly be back!!", "title": "Near to DCA airport. Nice hotel.", "user": "zhe z", "date": "November 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 145030641}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "We landed onto DCA airport at 10AM, and then it took us less than half an hour to get there, by taking the subway. Actually the nearest subway station(King St station) near to the hotel is just 2-or-3 stops from the airport subway station. It's a 10 minute walk(0.5 mile) from King St station to the hotel.", "title": "Robin and Ron made our stay!", "user": "HeidiVa70", "date": "November 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 144969882}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "And then we were able to do an early checkin and unload all our luggages, after signing up the SPG membership at the front desk. That made our D.C. trip much much more enjoyable.", "title": "Ronald at the Front desk", "user": "s h", "date": "November 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144946185}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "My husband and I stayed at the Westin Alexandria for one night recently because we attended a work holiday party in the hotel.", "title": "Really nice and comfortable", "user": "Capitolcrew", "date": "December 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 147386734}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "The staff was very friendly and helpful. The building and hotel room are attractive. There's a very small gift shop in the lobby, but it is tiny and doesn't have much selection. It did have the necessities though, so I was able to pick up tooth paste and a tooth brush, which I forgot at home.", "title": "Best for business travelers, not so great for families", "helpfulness": 3, "user": "noellossie", "date": "December 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 146837551}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "The bed was very comfortable, and we had a great view of a small park and the courthouse across the street. The bathroom was great with a big rainforest shower head and detachable shower heads, as well. There was a bit of a mildew smell in the shower, though.", "title": "Conversant Concierge", "user": "D B", "date": "December 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 146699566}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "We ordered room service for breakfast. It was very expensive. Note that they automatically charge both a service fee and tip to the room service checks.", "title": "A good hotel with some drawbacks", "user": "Truckstop39", "date": "November 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 146236973}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "My husband and I enjoyed the hotel.", "title": "A Fabulous place to be...", "user": "ATriper", "date": "November 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145825278}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "We stayed at this hotel because my husband was running the Marine Corps Marathon. It was within walking distance to the metro, but on weekends there really is no where to grab a quick bite. The valet staff was very friendly recommending restaurants within a 15 min. walk. The hotel was very clean and accomodating. The only complaint that I really had was that the trays from room service stayed in the hall for the entire 2 days were there.", "title": "Friendly staffed hotel", "helpfulness": 1, "user": "amyncgirl", "date": "November 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 144943008}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We used the Westin Alexandria for easy acess to a wedding/reception but also for an extended week-end of site-seeing in Washington D.C. and Virginia. Once we parked our car at the hotel, we never needed to use it again. The hotel was close to train/bus transportation. Also, the hotel's shuttle bus got us to many sites of interest/restaurants in the vicinity.Our airconditioned room was spacious and clean. The staff of the hotel were extremely friendly and helpful. The restaurant was a bit pricey for breakfast but the concierge provided us with excellent alternatives not only for breakfast but for dinner, The pool/exercise facility was a definte plus. We would return to the Westin Alexandria in the future.", "title": "Westin Hospitality in Virginia", "user": "Lou D", "date": "November 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144476326}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "We were very pleased with the Westin Alexandria. Though I don't believe the previous reviewer is correct in that the Westin is only 5 years old (the interior design of both the hallways and actual rooms are a bit tired though certainly not old) the lobby area is open and airy. The Westin has borrowed from Kimpton, I think, piping a light green tea type fragrance into the lobby and it is very pleasant. We thought our room was well appointed...especially if mirrors are your thing! There was an in room safe, large enough to hold two business laptops which is very unusual. The bathroom had plenty of space and light. The tub/shower had a rain shower as well as a hand-held wand. There is never quite enough pressure in hotels but the Westins was certainly adequate. We think the BEST thing about the Alexandria Westin is their \"light and fit\" program...at least I believe that's what it is called. One of us forgot our workout shoes. Turns out the Westin had workout clothes, shoes and footies you could rent for your entire stay for $5.00. Per stay, not per day. The shoes were brand new New Balance and fit perfectly. Excellent idea. Excellent value. We walked to the Geo Washington Masonic Memorial from the hotel, and it could not have been more than 10 minutes walk. Highly recommended. The view from the observation deck is fantastic. On the way back we walked the few minutes to King St station and took the free Trolley down to the waterfront. The river was churning with Sandy just 24 hrs away. We enjoyed our time at the Westin, thought the staff was helpful and friendly. We considered taking the shuttle our first night but when told it'd be a 10-15 minute wait opted to walk to King St for the free trolley. We had a delightful stay.", "title": "A \"Balanced\" stay!", "helpfulness": 1, "user": "wanderin98031", "date": "November 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 144280863}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "I've stayed at this hotel numerous times for work, most recently in September 2012. Overall, it is a very solid hotel. It's very new (less than 5 years old) and modern, but not too overly trendy and not at all pretentious like some modern hotels can be. It is located about a 4-block walk from the King Street Metro. You can get shuttle service to and from the Metro provided by the hotel. The location is on the far western end of Old Town, so take the shuttle or expect to walk at least 10 blocks to the main business and nightlife district in Old Town.", "title": "Solid business hotel", "user": "grsurfer", "date": "November 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 144199275}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "I have found the rooms to be clean and comfortable. Beds are very good, and the bathrooms are very clean. The service for the most part is attentive and friendly. Tesfay who works on the bell staff is especially friendly and helpful. He also drives the shuttle sometimes and is very enthusiastic and professional - an excellent representative of this hotel. He even remembers me every time I return to stay at this hotel.", "title": "Small things DO matter", "user": "NotABuckeye", "date": "October 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 143724862}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We stayed at the Westin Alexandria for two days over Christmas, as we've done for the past 4 years, while visiting family in the area. I love this hotel. We are always greeted with great courtesy by staff, from the front desk to bellmen to servers and the hostess in the restaurant. The rooms are extraordinarily comfortable and quiet. The restaurant menu has been changed to more casual fare since our last visit, and a broader selection of entrees would be welcome; however, we enjoyed our Christmas Eve dinner and two breakfasts in the hotel. We got a bargain price of only $79 per night by paying in full at booking, which is an absolute steal for a hotel of such high quality. We'll be back again next Christmas.", "title": "Our annual visit", "user": "WillowG", "date": "January 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149039005}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "The Westin in Alexandria surpassed our expectations. Before arriving I called the front desk and asked if I could check in early because I wasn't feeling well. Robin answered and she allowed us to check in hours before the check in time so I could rest. When we arrived, she saw that I was in my pjs looking sick. She asked if I needed extra blankets or chicken soup. Without even asking, a beautiful bowl of chicken broth, crackers, oranges, ginger ale and tea was sent to my room. She even sent the sweetest get well card. Its usually very uncomfortable to be away from home when you're sick. Not at the Westin of Alexandria! The room, the service and the location are perfect. We will be loyal to the Westin on our upcoming trips to the area.", "title": "Amazing Hospitality", "user": "Bcs6", "date": "December 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147733401}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "If you have business at the Courthouse or at the United States Patent and Trademark Office, you could not be at a better location. The Metro is a 5-10 minute walk away if you want to go downtown; however, I didn't feel that comfortable walking from it late at night so take the hotel shuttle. The hotel itself was very pleasant and the staff were helpful. The gym has good equipment and the treadmills face the Courthouse so you'll have a view while running. The only thing that was problematic with my visit was that the water pressure in the room sink was so weak that I considered calling the front desk to have them address it (I didn't). Other than that everything with my visit was excellent. The room was very clean and comfortable. Very satisfied customer.", "title": "Pleasant stay", "user": "C001", "date": "December 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147731334}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "My husband I stayed here because we were going to a concert at the Birchmere and did not want to drive about an hour home after the show. Check in was very smooth and the front desk attendant was very nice. The room was nice. I wish they would have given us two robes in the bathroom instead of one. We had a king room. Nice area for happy hour. We would stay here again. We got a pretty good rate on priceline.com. $99", "title": "Nice property", "user": "solochickNOVA", "date": "December 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147579855}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "I recently stayed at the Westin Alexandria for a conference and thought the hotel was in excellent shape and I had a really comfortable stay. Of course the beds were amazing (nothing comes close to a Westin heavenly bed!). The room was clean, the lobby and conference space was stylish and classy and all in all it was a great hotel experience! The fitness area was also really nice. This gets marked down one circle because I thought the rooms were a little noisy - I could hear the person sharing a wall with me one of the nights I was there. Additionally, it is not walking distance from King Street, which is the center of Alexandria. Those of you coming here by train and getting off at Union Station in DC, be prepared to pay a 40 dollar cab ride!", "title": "Clean, comfortable, excellent facilities", "helpfulness": 1, "user": "PhillyCali", "date": "December 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 147392033}], "location": {"country": "United States", "city": "Alexandria"}, "stars": 4, "variance": {"poor": 26, "average": 69, "very good": 174, "terrible": 17, "excellent": 152}, "aka": "Westin Alexandria Hotel Alexandria", "slim_ranking": 0.46, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.0}, "description": "The Westin Alexandria blends sophistication and elegance with the historic surroundings of Alexandria. Located in Old Town Alexandria, our hotel is an oasis of personal, instinctive comfort."}