{"user_rating": 5.0, "review_count": 264, "name": "Westender Inn", "reviews": [{"rating": 4.0, "title": "Peaceful Existence", "text": "We enjoyed eight nights in February in the Cactus Suite, number 16, with a beautiful ocean view. The room is huge and comfortable, although the mattresses are in the decline of life. There is a full size fridge, coffee maker, microwave, toaster, and dishes. The TV did not receive US broadcast network channels, but has most cable ones. Bring a bottle opener for Red Stripe. Air conditioning worked great. Wifi reception in the room was 50-50.", "helpfulness": 2, "user": "millau70", "date": "February 21, 2012", "id": 124979471}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The hotel provides a van to leave for town more-or-less on the hour. Let the office know in advance that you wish to go. You will be charged on your bill $3.50 per person each way. The van waited for us at the grocery store which added an additional $6.00 for the two of us for a total of $20 for that trip. No problem if you pick up as much as we did. For return pickup from a restaurant, the procedure is to have the restaurant call Jermaine when you are ready. You can remain at your table if you wish.", "title": "Relaxing paradise", "helpfulness": 2, "user": "Spookykinkajou", "date": "February 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 124962036}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The restaurant did not always have what we wished to order, but I enjoyed the food. They will deliver to your room or, as we did, to the beach for lunch. Service is not speedy, so waiting on the beach was ideal.", "title": "It grows on you!", "helpfulness": 1, "user": "Deirdre049", "date": "February 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 2.0}, "id": 124813242}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "There are no beach towels available at the hotel, so if you are beachgoers, I suggest you bring good quality ones from home.", "title": "Awesome hotel on the cliffs, away from the beach madness", "helpfulness": 3, "user": "ComstockHill2", "date": "February 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124662468}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "I was wondering how the salt-water beachside pool was fed, but you will see the natural cycle of waves that overspill the edge to keep it clean and fresh.", "title": "Perfect Vacation in Jamaica's West End", "helpfulness": 1, "user": "Nansuela", "date": "February 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 124449392}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Waves crashing on the rocks, a roaring bonfire, a cooler full of Red Stripe, and a beach chair in front of the NFC Championship game on a huge screen under the stars. It doesn't get any better than that!!! A terrific destination, an attentive staff, and all of the natural beauty you would expect at the far west end of Jamaica.", "title": "Perfect Winter Escape", "helpfulness": 1, "user": "Drew W", "date": "February 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123959259}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "The Westender Inn is the epitome of Jamaica. They are very service oriented and I was hard pressed to get a \"no\" out of anyone.The entire staff had a smile and the phrase of the week was \"no problem\". I feel like i made some lifelong friends and i did not want to leave them. Want your hair braided? They have someone who can do that for a tip. want a massage by the beach? They have someone there that can do that too. My wife said it was the best she ever had.", "title": "Couldn't have asked for more", "helpfulness": 1, "user": "Michael H", "date": "January 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 123869376}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "This is not an \"all inclusive resort\" so be sure to budget your money accordingly. I wouldn't call this a bad thing because you don't get that feeling of needing to get as much out of the resort as possible which can sometimes keep you on the resort instead of being able to leave and explore.", "title": "Quiet small hotel on beautiful rocky coast", "user": "CriticalFlow", "date": "January 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 123797190}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Speaking of exploring they have their own taxi service to take you anywhere you want and if he is not available they will call someone reputable for you.", "title": "amazing", "user": "kim h", "date": "January 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 123749582}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The food was great and i never left feeling hungry. We had the best sunsets i could have asked for, as soon as it crested over the horizon you could hear audible clapping and hooting from the others staying at the resort. I watched everyday from my hammock located right outside my room door. Which incidentally was the best place to sleep at night. The waves lulled me to sleep and i didn't even want to sleep in my room. Not that there was anything wrong with the room, i just couldn't help myself. The rooms were neat and clean. The water pressure was good and the closet was dare i say \"walk in\" size, which worked well for my wife and I. Over all I had the most wonderful experience i could have asked for and we look forward to making the trip next year and we may start celebrating our Anniversary there.", "title": "A must-visit for all those seeking natural beauty", "helpfulness": 6, "user": "Biedross", "date": "January 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 122382259}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "When my husband and I wanted to vacation with our married son and daughter and their spouses, we wrestled with whether or not to stay at the Westender Inn which we knew was relatively isolated or choose a hotel located on the 7 mile beach. The hotels in a similar price range on the beach were crowded and noisey, surrounded by litter and not nearly as charming. If you are looking for serenity, charm, beautiful, safe surroundings, then you'll be happy at the Westender. There were three couples in our party, and we stayed in rooms 3, 5, and 12, all with beautiful ocean views. Our daughter, son-in-law and granddaughter stayed in room 12 which was a little larger and had table and chairs for us to gather to play cards, enjoy a snack together, etc. and yet still retire to our own rooms to sleep.", "title": "Tranquil beauty", "helpfulness": 2, "user": "wojoSouthCarolina", "date": "February 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 124446751}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Pros: Westender is remote and quiet with beautiful oceans views. The staff was extremely friendly and went out of their way to fulfill our every request. The cliff side of Negril has a beauty all its own. Dinners were delicious and well priced. The pool was relatively small but was never crowded, and there are many little scenic places to sit or lie in a hammock and enjoy the pretty surroundings. Although the salt water pool is really the size of a large hot tub, it was well placed literally at the edge of the breaking waves. Rooms and grounds were kept very clean.", "title": "Can't go wrong with this place!", "user": "saucyBaltimore", "date": "February 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124430240}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "Cons: Although clean, rooms were sparsely decorated and could use some updating. There is no sandy beach, and snorkeling in the waves is not for the faint of heart. Even when the water seemed relatively calm, getting in and out to snorkle was quite treacherous due to waves crashing against the jagged coastline and few fish were viewed. If you desire to go into town, to the 7 mile beach, out to dinner, etc. the shuttle ride is at least 15 minutes, and you need to be prepared to pay $14. per couple for a round trip. Our driver was very gracious and allowed us to \"stop at the store\" on the way home from our beach day or dinner out saving us separate charges for each stop. Free internet was available only on the computer in the office, but there was an $8/per day charge for wireless internet.", "title": "Westender is the perfect place to relax all of your stresses away.", "helpfulness": 2, "user": "Jsscjo", "date": "February 11, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 124417578}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "My husband and I had an amazing stay at the Westender! It is in a spectacular location right on the ocean located away from all of the beach chaos. If you are looking for some beach fun, they have a shuttle that will take you where and whenever you want to go. The rooms are charming and clean. The food in the resteraunt is some of the best in Negril. As for the staff, lets just say they all got hugs when we left.", "title": "Fantastic Inn", "user": "joeyelbows", "date": "February 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124298784}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Joe and Sarah", "title": "Best in Negril !!", "user": "kevin k", "date": "February 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124167051}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We stayed here for a week during the christmas holiday and it was christmas every day!The staff was very helpful in orgainzing any activites we had planned.The food was great! We ate at other resturants and still felt hungry but not there ! You get want you pay for. Cant wait to go back!!", "title": "\" my only complaint ....i didn't stay long enough!\"", "helpfulness": 2, "user": "russell h", "date": "December 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 122264163}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Stayed here for 1 week. It is a small and quiet hotel, more to relax and enjoy the beautiful nature of the country. We went here at December, and the weather was almost always sunny and warm.", "title": "did not want to leave!", "helpfulness": 3, "user": "seashell84", "date": "December 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122110144}, {"rating": 4.0, "stay_parameters": "Stayed November 2011", "text": "Rooms:", "title": "Relaxing getaway my favorite tropical destination", "helpfulness": 1, "user": "Drotos", "date": "December 3, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 121349157}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Most rooms have great ocean view. Very clean and layed out conveniently. Bed was very comfortable, tv and ac worked very well all the time. Always had hot water without any problem. The only negative i can say is-flushes are not as strong as in US, so it is better not throw any paper and still it does not work very well. I think this can be improved.", "title": "5-STAR! a rare gem!", "helpfulness": 4, "user": "Mark Y", "date": "November 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120539198}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "One quick note, rooms are right in front of the ocean so during the nights you may most likely hear rough waves, this did not affect to my sleep though.", "title": "Dreamy! Palm trees gently dancing in the warm breezes.", "helpfulness": 1, "user": "Denise60946", "date": "November 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120512523}], "location": {"country": "Caribbean"}, "stars": 3, "variance": {"poor": 4, "average": 4, "very good": 44, "terrible": 0, "excellent": 212}, "aka": "Westender Hotel", "slim_ranking": 0.0860215053763, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.5, "location": 4.5}, "description": "Westender Inn recently completed three new ocean front luxury log suites. There is something rustic yet stately about log construction and many people love the antique look with modern finishing. Come stay in one of our new ocean front luxury log suites."}