{"user_rating": 4.0, "review_count": 640, "name": "Westin Charlotte", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "Great staff, great rooms, a great location downtown. Great food at the meeting that I attended as well. The business center's webservice was a bit of a joke but was refunded promptly after I called about it. I would stay here again. Other than that...eh...a business hotel, but was pricey for what it was.", "title": "What I'd Expect From a Westin", "user": "MelandRog", "date": "June 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 32134794}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "I will say a little about Charlotte though. Great food, lots of art to see downtown, and frankly a great city. A big surprise as I expected little more than a downtown that shuts down at 5. Boy was I wrong, quite a nightlife up College and Tryon streets from the hotel.", "title": "Great Location but Desperately Needs Updating", "user": "kaldonia", "date": "June 6, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 31697948}, {"rating": 2.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "When I travel for conventions or other large gatherings, I tend to stay at the sponsored hotel for convenience. I must say, when we pulled up to the Westin in Charlotte, it looked very impressive. The Concierge and Front Desk staff are fantastic. Friendly greetings and smile with what seems to be a genuine sincerity. The coming and going seems to be the best part of the stay. As I stepped out of the hall to my 7th story room, the first thing I noticed was two double beds. My reservations were for a king but since I was traveling by myself, not a problem. The room offered nothing more that a comparable express hotel room as far as features but did include a minibar. The bathroom seem outdated. The tub was in crappy shape with the stopper laying upside down in the drain with potential for going right through my foot. The spigot was turned sideways and was just not something I would consider customer friendly The nice 40+ inch HD tv was a nice added feature but was useless in that there were no HD channels that I could see. Every channel said Analog when surfing. As with any downtown premium hotel, the food prices tend to be high and this was no exception at the Westin. As I will tend to spend one night relaxing with a movie and room service, I could not bring myself to pay $20+ for burger, fries, and a drink. Breakfast was out of the question. I would stay at the Westin again for lets say, a weekend package for under $99.00, but not worth the $212, including taxes, I paid for this trip.", "title": "Underwhelmingly Westin", "user": "Stevied888", "date": "May 4, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 1.0, "rooms": 2.0}, "id": 29334204}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Have been to many Westins and this was not quite like most Westins. I was \"upgraded\" because of my SPG Gold but I missed what the upgrade was. The view of downtown was wonderful and the locations is very convenient to the Convention Center.", "title": "An utter disappointment...", "user": "KeysGirlCharlotte_NC", "date": "April 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 28036332}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "The room was small and routine not with the usual Westin modern decor. The bathroom was among the smallest I have seen in any hotel - you had to close the door to get to the shower.", "title": "Rooms great, food not so much", "user": "TravelerMinnesota", "date": "March 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 4.0}, "id": 26771161}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "My husband and I went for Valentine's Day and we had a great time. We actually live near Charlotte, but come to the Westin when we want to relax and be pampered. The rooms are always clean (I LOVE the Heavenly bed by the way) and the staff is very friendly.", "title": "Enjoyed it!!!", "user": "themrs1922", "date": "March 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 26028115}, {"rating": 1.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "The bar is a great place to hang out on a Friday or Saturday night if you don't feel like walking uptown or paying for parking elsewhere.", "title": "This place is going down-hill...very disappointed!", "user": "jheels9206", "date": "February 25, 2009", "detail_rating": {"value": 2.0, "location": 4.0, "service": 1.0}, "id": 25153354}, {"rating": 2.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "The Ember Grille has the best breakfast buffet I have had yet!! The food is always hot and fresh and they make fresh omelets if you are interested.", "title": "Never again", "user": "4grandkids2date", "date": "January 19, 2009", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 23707261, "likes": {"liked": "— location", "disliked": "— paying to use gym and pool/ no airport shuttle"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "Overall, I think this is a good hotel for the price and will definitely be returning in the near future.", "title": "Nice, expected a little more", "user": "Paranor", "date": "January 16, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 23610465, "likes": {"liked": "— location", "disliked": "— sketchy bath amenity replacement"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "We have stayed at this hotel several times over the past couple of years and the service and rooms get progressively worse. This past weekend, it hit an all-time low! On arrival (Friday at around 6pm), there were two people working the registration desk with approximately 10 guests waiting to check in. In the room, there was a dirty towel hanging in the bathroom that appeared to have make-up on it from a previous guest. On our second day, we returned to the room in mid-afternoon to notice that our room had yet to be serviced. I call guest services to find that you must now request for your room to be serviced...you do that by placing the reverse side of the \"Do Not Disturb\" card on your door. Oh, that card that we didnt have in our room. After 2 calls to Guest Services and an hour and a half later, our room was finally cleaned. To top the weekend off, my incidentals were charged to both my credit and debit card and the process of fixing that resulted in dealing with two extremely rude people in the Accounting department...only for them to discover that they were in error! I will likely NEVER return to this hotel! Pathetic representation of the Westin name!!", "title": "Performed well under stress", "helpfulness": 1, "user": "tropicalfan", "date": "December 29, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 23074774, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Stayed here this past Thanksgiving weekend, and was nothing but surprised. The lobby and public areas are pretty much exactly what you think of when you think \"Westin.\" Upon check-in, we were upgraded to a suite of about 700 square feet with two full baths, which was in itself a great thing. The staff was nothing but friendly our entire stay; associates always had a friendly greeting when they passed in the hallway. You don't see that personal, warm feeling from most hotel staffs. We had breakfast in the restaurant one morning. The hostess was very nice, but the server (Hak was her name) was such a delight. She was the most friendly server I've ever seen in a hotel. Attentive, too--our glasses were never empty! She really helped us end our visit on a high note.", "title": "Now this is a Westin!", "user": "Andrew K", "date": "December 1, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 22341460, "likes": {"liked": "— Atmosphere, service", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The only issue I had with the hotel was that the hallways could use a good steam cleaning. The carpet is looking a bit dingy (at least on the 12th floor). But this is such a minor detail, so who cares?", "title": "This hotel spoiled us", "user": "POWERSPEARSON", "date": "November 10, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21685231, "likes": {"liked": "— Cleanliness and modernity"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled with friends", "text": "When in Charlotte, I highly recommend staying at the Westin.", "title": "THIN walls, can find better for the money", "user": "SeeLSee", "date": "November 3, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 21508446, "likes": {"liked": "— Nice exterior and pretty lobby", "disliked": "— Thin walls, hotel needs some maintenace work"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "It was busy, but the check in process was efficient. The lobby was so serene with its rock fountain and oversized pillow-filled couches. My husband and I were impressed with the modernity and cleanliness of the rooms. Starbucks coffee, tazo tea, and Westin bath products, including white tea soap, were among the amenities. The room rate included breakfast, our choice from the menu, not some cheesy packaged danish deal.", "title": "Always love a Westin, however...", "user": "Mikeynla", "date": "October 25, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 5.0}, "id": 21188799, "likes": {"liked": "— location, comfort, always-fabulous Westin quality", "disliked": "— lackluster service"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The stay didn't go over without a hitch. There was a problem accessing the garage and with an order for room service, both of which were addressed promptly and courteously.", "title": "Great Location!", "user": "kingstonowner", "date": "October 17, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 20968516, "likes": {"liked": "— The location", "disliked": "— Very small refrigerator and no microwave"}}, {"rating": 2.0, "title": "Not Even Close To The Standards Of A Westin", "text": "I have stayed at many hotels in the past year and The Westin Charlotte was my worst experience out of all. I was in town for the WVU vs. UNC game at Bank of America Stadium and this hotel was allotted as the WVU Alumni hotel so it was very crowded. Upon arrival to the hotel traffic was a mess with many guests trying to check in. I went to the front desk and attempted to register but was told I did not have a reservation. After presenting my confirmation number the clerk was able to locate my reservation. It turned out that the reservation attendant had mistaken my last name for my first. The rest of my evening was fine, but it was the morning that topped my stay off. I awoke to go take a shower, but when I attempted to turn on the hot water it came out ice cold, colder than drinking water. This problem was reported to the front desk and I was told it was a problem within my guest room and maintenance would be sent up to resolve the problem. Three hours later no one had shown up to correct the problem. It turned out the hotel was completely out of hot water. The hotel did deduct the cost of the internet and parking from my bill due to my inconvenience. When in the area again, I will be staying at other accomadations the Queen City has to offer.", "helpfulness": 1, "user": "zachmb", "date": "December 28, 2008", "id": 23059933}, {"rating": 2.0, "title": "dump", "text": "Not well kept! Soil carpet in lobby, broken lock on hotel room door, dust on even the lamp shade. Checked out early and move to a Embassy Suites!", "user": "travelforfun5047", "date": "December 23, 2008", "id": 22967652}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Another great stay at the Westin. A great hotel, stayed here with my little Cocker Spaniel, he loves it too. You can't go wrong at this hotel!", "title": "Favorite Spot in Charlotte", "user": "houstonb123", "date": "December 22, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 22925708}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "My husband and I just returned from a stay at the Westin in uptown Charlotte. Overall, I liked the property. The room was clean and our request for a high floor was accommodated with no issues. But what I don't get is the 1\" + gap between the room door and the floor, allowing a lot of noise to enter the room. Why are the doors not sealed from top to bottom?", "title": "Noisy, Noisy, Noisy", "user": "pantherfan1", "date": "December 15, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 22746032, "likes": {"liked": "— The proximity to the Carolina Panthers stadium", "disliked": "— The noise factor"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Our stay coincided with a Carolina Panthers home game against the Denver Broncos. With the Westin's close proximity to the Panthers stadium, there were a lot of loud and rowdy Denver Bronco fans staying at the hotel. In addition, I believe there were a couple of holiday parties being held at the hotel. This made for an extremely noisy stay. I was woken several times throughout the night by loud party goers returning late at night. The worst came at 2:50 AM when a large group of drunk and loud individuals stumbled back to their rooms, waking everyone on the floor in the process. I actually opened my door and told them to keep it down because they were standing directly outside my door talking. One individual in the group was very apologetic, but the rest of them continued for several more minutes. This is not the Westin's fault, but it made for an unpleasant stay all the same.", "title": "very disappointing", "user": "brookeotr", "date": "December 9, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 3.0, "location": 2.0}, "id": 22577720}], "location": {"country": "United States", "city": "Charlotte"}, "stars": 4, "variance": {"poor": 65, "average": 129, "very good": 196, "terrible": 37, "excellent": 213}, "aka": "Westin Charlotte Hotel", "slim_ranking": 0.333333333333, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Situated in the uptown financial district of North Carolina's most exciting city, The Westin Charlotte is just a short trolley-ride away from popular dining and entertainment."}