{"user_rating": 4.5, "review_count": 106, "name": "West Dover Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "We spent a long weekend at the West Dover Inn. We were there for a little romance and some skiing. The Inn owners were very friendly and actively involved with all aspects of the Inn...from check in to nightly actitives in the restaurant. Food was great...the room was adorable. Loved the fireplace. It was a lot of fun and close to the mountain. Recommend the West Dover Inn for a nice getaway. Attentive to guest details and comforts.", "title": "Romantic Little Inn", "user": "Daphne418", "date": "February 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13840893, "likes": {"liked": "— The overall historic inn feel and attention to guests.", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "A couple Saturdays ago, my husband and I decided to do a last-minute road trip to VT. I went online, found the West Dover Inn and booked one of their 'last minute specials'. I can't tell you how impressed we were! The rate was very, very reasonable and the place was great. Typical quaint Vermont inn. There weren't many quests the night we stayed so we were given a quick little tour of a few different rooms and were allowed to pick our own. I was most impressed with the attention to detail there. They actually have personalized lip balm in the rooms! You just don't find amenities like that any more!", "title": "So glad we found this place!", "helpfulness": 2, "user": "jbtrvlr", "date": "October 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10035895}, {"rating": 5.0, "stay_parameters": "Stayed December 2005, traveled with friends", "text": "Our plan was to pluck around the other towns in the area and have dinner elsewhere. Well, we did some driving around, but headed right back to the West Dover Inn for dinner and to hang out. The owners, Phil and Kathy, are very welcoming and fun to chat with. Phil's a die-hard Red Sox fan so my husband quickly bonded with him. On Saturday nights there is a jazz pianist who plays in the dining room. Once the dinner service was over, we (Phil, Kathy, some locals and ourselves) played name-that-showtune with the pianist. It was such a good night.", "title": "A Bit of New England Paradise!", "helpfulness": 2, "user": "Yiayia6", "date": "August 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 8444688, "likes": {"liked": "— The quality and cleanliness of the rooms", "disliked": "— nothing"}}, {"rating": 5.0, "title": "Enjoyable Weekend Getaway", "text": "The food itself was very good. We had delicious sandwiches and saw many other main dishes and they all looked fantastic. From what we could tell, the crowd was mostly made up of locals and everyone seemed very happy to be there. The breakfast the next morning was fantastic, too. You actually get to choose from 4 or 5 different items. We had banana pancakes and eggs, toast and sausage. It was excellent!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "February 15, 2006", "id": 4461848}, {"rating": 5.0, "title": "Great Escape Weekend", "text": "We will most certainly be going back to this Inn!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "February 13, 2006", "id": 4457910}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "The atmosphere was relaxed and comfortable. A crackling fire warms the dining room and enhances the atmosphere making you feel right at home.", "title": "Outstanding", "helpfulness": 3, "user": "MEG1019", "date": "January 25, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4387985}, {"rating": 5.0, "title": "A delightful place to dine!", "text": "In addition to the outstanding food, one of the things that impressed me was the friendly, knowledgeable wait staff. My dining companions and I all chose items from the daily specials. Our selections could not have tasted better and the presentation was superb.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "December 24, 2005", "id": 4298676}, {"rating": 2.0, "title": "Nothing Special", "text": "When it was time for dessert, we ordered the Chocolate Lava Cake with Vanilla Ice Cream (we shared). Perfect for the \"chocoholic” in all of us ...\"Save room for this one, you won’t be disappointed.\"", "helpfulness": 2, "user": "chap914", "date": "September 23, 2005", "id": 3934981}], "location": {"country": "United States", "city": "Dover"}, "stars": 3, "variance": {"poor": 4, "average": 8, "very good": 19, "terrible": 2, "excellent": 73}, "aka": "West Dover Hotel Dover", "slim_ranking": 0.466666666667, "description": "The West Dover Inn continues an important tradition begun in 1846. Originally built as a stage coach stop and tavern, the inn has been lovingly restored and now provides quiet luxury, comfortable accommodations and memorable dining in a central, yet serene location in southern Vermont."}