{"user_rating": 3.5, "review_count": 272, "name": "Whistler Village Inn + Suites", "reviews": [{"rating": 4.0, "title": "Good one night stay", "text": "I guess for the price of accommodation in whistler this place isn't too bad - two queen beds with a small balcony. Bathroom is is in need of some repairs but the room itself was comfortable and cozy. The noise outside during the night was a challenge but can't blame that on the hotel! Good service at the front desk and really nice warm fire to warm up after spending the day in the mountain", "user": "Ecosnake", "date": "March 16, 2013", "id": 154795820}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "We stayed here in August of 2012, coming up to ride our bikes.", "title": "Really unimpressed", "helpfulness": 1, "user": "ibtattooo", "date": "March 14, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 154567186}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "Last time I stayed at the Whistler Village Inns was in 2008, and in four years things have changed, and not for the better.", "title": "Great Time at Whistler Village Inn", "user": "gluecipher", "date": "March 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 154543429}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Between the constant construction noise, the room not being very clean, and constant issues with the front desk staff, we're not going to be staying here again. They've also gotten rid of the breakfast in the morning with waffles, and when you're riding all day long waffles are much appreciated.", "title": "great", "user": "George98888", "date": "March 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153900969}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "Stayed Feb 25th thru Mar 2nd in one of the \"hotel\" rooms. Floor seemed to be redone recently. Fresh paint in the hallways and room. Clean rooms, comfortable beds and free Wifi. Overall no complaints and very happy with what we paid for. Understand this is not the Westin or some other high end resort in the Village. But neither is the price. The rooms were cleaned every time we came back from skiing. In fact, one day we accidently left one set of credit cards & $100 is cash on one of the beds. To our amazment the cards and cash were left under our pillows. NOTHING TAKEN. We were very surprised in these days for credit fraud and such. I would recommend this place to my friends/family for an econmical place to stay.", "title": "Location & Price is spot on", "user": "Stephen W", "date": "March 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 153777060}, {"rating": 1.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "On five nights out of seven we were woken at 2 in the morning by both drunken revellers and the night manager evicting them from the hotel. We should have been warned on check-in when we had to sign a list of behaviour rules prior to receiving our key. The manager was unconcerned and unapologetic when advised of the situation. This place does have a great location but it is otherwise shabby and dated and not representative of the resort itself which is first class. AVOID!", "title": "A hotel only suitable for insomniacs", "helpfulness": 1, "user": "JWHPenn", "date": "February 26, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 153178198}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We spent four nights here just before Christmas and skied for three days. Picked up a pretty awesome deal including lift passes...and the snow was unreal!", "title": "Great location", "user": "epmc", "date": "February 22, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 152762217}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We had a queen loft room, which for two people was just enough space...only downfall, I'm pretty sure our room was located next to staff accommodation, meaning on two nights we were woken by loud voices and noisy doors. Even with the doors closed, voices could still be heard next door.", "title": "Basic but clean", "user": "EBH82", "date": "February 20, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 152625072}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Despite this, the location was great and we had a fabulous time. We didn't care so much about the lack of free internet - Starbucks is just around the corner and they offer free wifi.", "title": "Murphy BED?", "user": "Jmomo5000", "date": "February 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 152163560}, {"rating": 3.0, "stay_parameters": "Stayed April 2013", "text": "We purchased 2 vouchers off of a deal site and took a look at the website. The website makes the rooms seem much bigger than they are and definitely hides the dated elements of the property.", "title": "So-So Getaway", "user": "teachartz", "date": "April 20, 2013", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 158311458}, {"rating": 3.0, "title": "Don't unpack until after your check-in", "text": "Booking:", "user": "A TripAdvisor user", "date": "April 17, 2013", "id": 157990829}, {"rating": 3.0, "stay_parameters": "Stayed March 2013", "text": "I tried calling the location 3 times one evening and was disconnected each time. I posted to their Facebook page to see if they ha a problem with their phones an never received a response.", "title": "Average stay.", "user": "sramzan", "date": "April 8, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 157029755}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "I called again about a week later and was pleasantly surprised with the customer service friendly Rowan. We upgraded the room from the voucher as we decided to travel with a friend for an additional $40 per night and the extra person was another $20 per night.", "title": "Close to all amenities, large superior loft suite, clean, well-stocked, comfortable and spacious.", "user": "LeanneInVancouver", "date": "April 4, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 156603366}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled solo", "text": "Parking:", "title": "Adequate", "helpfulness": 1, "user": "CharlieRogers", "date": "March 24, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 155527629}, {"rating": 3.0, "stay_parameters": "Stayed February 2013", "text": "The hotel rooms are small but comfortable. Friends who had a room with a Murphy bed (folds down from the wall) were less impressed. We stayed in the Powder Lodge which is across the road from the main hotel. Has a nice common area with a fire, also has a spa and a sauna.", "title": "Central Location", "helpfulness": 1, "user": "anw190", "date": "February 9, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 151771302}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "The location in the upper part of Whistler Village is great. Five minutes from the ski lifts and gondolas up Whistler and Blackcomb mountains. Close to lots of restaurants and shops. A great coffee shop & bakery (Hot Buns) is nearby.", "title": "Convenient and affordable", "user": "al500", "date": "February 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 151574320}, {"rating": 2.0, "title": "Great trip, should have chosen a hotel more wisely", "text": "Had a Queen loft room with a murphy bed in the living area on the 3rd floor. Would have been cramped for 4 adults but was great for us (self and adult son). Decor, furniture and fixtures were a little dated and the stairs up to the loft area were steep. Overall though it was a comfortable and functional room. We booked via the hotel website and got a reasonable (CAA) rate compared to other properties in the same location. Parking is expensive but that's consistent with other Whistler hotels. Stayed on a busy weekend but noise from other guests. Location is fantastic, steps away from the Whistler lifts and near a couple of independent coffee shops (Moguls) for breakfast and good pubs/restaurants for dinner. Has the Keg and a bar attached.The hot tub is pretty small for a hotel of this size but good and hot for aching limbs after a day's skiing. Staff were friendly and helpful, although the girl at check-out was on her own and overworked. Would stay again.", "user": "A TripAdvisor user", "date": "February 6, 2013", "id": 151559106}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "The trip my wife and I took to Whistler was great. Great skiing, great food and the Village Stroll was awesome. Some fun shops and things to do. We also booked a trip with Coast Range Heli-skiing which we would both highly reccomend.", "title": "no sleep noisey but good service", "helpfulness": 1, "user": "Dorothy E", "date": "February 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 151487168}], "location": {"country": "Canada", "city": "Whistler"}, "stars": 3, "variance": {"poor": 30, "average": 74, "very good": 100, "terrible": 15, "excellent": 53}, "aka": "Whistler Village Inn + Hotel", "slim_ranking": 0.519230769231, "description": "Location, Value & Choice, Whistler Village Inn + Suites has it all!Whistler Village Inn + Suites puts you in the in the heart of Whistler village. Shops, restaurants, nightclubs and the Gondolas for Whistler and Blackcomb mountains are all less than a two-minute walk away. Relax in any style with a choice of hotel rooms, lofts and suites with balconies overlooking Whistler village.Only minutes from championship golf courses and abundant outdoor adventure, to get the most out of your Whistler-Blackcomb experience, the Whistler Village Inn + Suites is where you want to be."}