{"user_rating": 3.0, "review_count": 138, "name": "White Sands Hotel", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "stayed over week end of 5th and 7th oct my room was overlooking car park . the first night i had to chase away two girls who were sitting on the window of my bedroom at 3 30 am , the amount of noise from the car park was terrible ,the next night there was a football match at aroung the same in the car park and then at 5am a sing song in a room .this is the worst hotel i have every stayed in", "title": "terrible hotel", "helpfulness": 1, "user": "mikeavx", "date": "October 9, 2007", "detail_rating": {"front_desk": 1.0, "service": 4.0, "business": 2.0, "cleanliness": 3.0, "rooms": 4.0, "location": 4.0}, "id": 10057052, "likes": {"liked": "— the food", "disliked": "— too much noise"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "Stayed here for 2 nights on the 5th and 6th October 2007 and the whole experience was overshadowed by the noise levels in the hotel at night.", "title": "Bring your ear plugs!!", "helpfulness": 5, "user": "Alham", "date": "October 8, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 3.0, "location": 4.0}, "id": 10053084, "likes": {"liked": "— Noise and reception staff."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We had a standard seaview room at the front of the hotel which unfortunately overlooks the hotel car park as all the seaview rooms do. During the night people constantly come and go from the hotel's nightclub and hence there is really intrusive noise from taxis, cars and revellers.", "title": "great hotel, great service", "helpfulness": 2, "user": "hellrazor007", "date": "August 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8458164, "likes": {"liked": "— scenery, great place", "disliked": "— bit noisy so get a room in the new part of the hotel"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "On the second night of our stay guests in their room were singing at the top of their voices accompanied by a guitar until 5am when the night staff intervened only at our request.", "title": "Fantastic nights stay", "helpfulness": 1, "user": "moo698", "date": "November 28, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6185502}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "After 2 nights with virtually no sleep we complained to the reception staff on check-out. Their only concern was to ask if we had complained to the night staff.", "title": "Staff very friendly and helpful.", "helpfulness": 4, "user": "Jellybabies", "date": "August 20, 2006", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 4.0, "value": 3.0, "rooms": 3.0}, "id": 5629297}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Stayed at the Celebrity Resorts on the way to and back from California. In our nine nights we managed to stay in a suite, a four person studio and two person studio. All the accomodation", "title": "Waikiki's best kept secret.", "helpfulness": 3, "user": "NedPerth", "date": "October 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10462638, "likes": {"liked": "— Value for money", "disliked": "— Having to leave it!"}}, {"rating": 4.0, "title": "Very nice", "text": "was excellent and considering what we paid, great value for money. The one bedroom suite was huge and would suit families as there is two bathrooms and more importantly two TVs! It also has a very good kitchen.", "helpfulness": 3, "user": "barbara1105", "date": "September 19, 2007", "id": 8769559}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "The four person studio had a much larger bathroom than the two person one but both rooms were larger than an average hotel room and had a kitchenette which had all the pans, plates and utensils you could need.", "title": "Nice", "helpfulness": 1, "user": "cbanville6", "date": "September 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 8690912}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "All the staff were very friendly and the location and condition of the hotel was great. In summing up we paid a lot more for hotels on our travels but none were as good as The Celebrity Resorts.", "title": "Fantastic!!!!!!!!!!!!", "helpfulness": 3, "user": "dwieg", "date": "August 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8591519, "likes": {"liked": "— Friendly and helpful", "disliked": "— Can't think of anything"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "It was a low price for a Waikiki hotel, not too far from the beach, close to everything (shopping, public transport, etc.). The rooms were very nice, very clean. Friendly and helpful staff. I would definitely stay there again.", "title": "Terrific Value in the middle of Waikiki", "helpfulness": 4, "user": "Staidthere", "date": "August 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8445049, "likes": {"liked": "— Value and location", "disliked": "— Getting sales call from Celebrity Resorts Orlando"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "We spent a week at the Celebrity Resorts this Christmas. I had read the reviews and was pleased that they were accurate (the positive ones) We're a family of 5 (two teenage boys and a 9 year old girl) the only challenge was when we first arrived (very late at night) there was no cot available for us. We made due by putting the couch cushions on the floor at night and creating a comfortable bed for our 13 year old. For the price it was worth it! As other reviews noted, the place was clean, spacious, location convenient and service fantastic and friendly. Our daughter loved the pool and meeting other kids. We didn't bother with a rental car as everything was accessible on foot or by bus. I have already recommended this resort to friends.", "title": "Welcoming and comfortable", "helpfulness": 5, "user": "shulin", "date": "January 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 3.0, "cleanliness": 4.0, "rooms": 3.0, "location": 4.0}, "id": 12855844, "likes": {"liked": "— price, staff", "disliked": "— older furniture"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007", "text": "If you don't like huge hotels, or want to save some money this IS the place. We called and made sure to reserve a room facing the pool, and got one. The staff was helpful, the rooms adequate, no smells or problems. The only suggestion I would make is to plan on making use of the kitchenette. It has everything you need, and there is a store just a block or so away. Also there are grills around the pool area that might as well be used.", "title": "Great Location/Atmosphere", "helpfulness": 3, "user": "TravelWNC", "date": "January 18, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 12763893, "likes": {"liked": "— I like the jungle-like vegetation that was planted among the pool scene.", "disliked": "— I like the location and courtyard small feel"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Before choosing one of three hotels presented to us by our travel agent I checked the reviews at Trip Advisor and found that Celebrity Resorts had the best review of the three. Well, I have to agree with the reviews! The outside of the hotel isn't much to look at, nor the street it's on but once you walk into the hotel, it's a mini-Paradise. The hotel staff are friendly, knowledgeable and treat you like Ohana. The room was clean, quiet and just the right size for two of us. It was SO convenient having a kitchenette in the room. My sister-in-law and I saved a lot of money by going to the bakery and ABC store just around the corner, and by making meals in our room. The location was FABULOUS!!! It's only about a 7 minute walk to the beach (and there's a Starbucks around the corner). For all of you shop-a-holics, it's conveniently located down the street from the International Market Place. I would definitely stay here again.", "title": "Right Price. Great Location.", "helpfulness": 7, "user": "luvtotrvl27", "date": "January 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 12326511, "likes": {"liked": "— Location and staff", "disliked": "— ????"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Little more than a motel with prices that match many of the big, beautiful hotels, this was the biggest disappointment of our trip. The rooms were small and smelled mildewy. The only positive was the staff who were friendly and accomodating.", "title": "stay away", "helpfulness": 7, "user": "Rorschachteacher", "date": "December 28, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 5.0, "cleanliness": 3.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 12016263, "likes": {"liked": "— staff", "disliked": "— price"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "My sister and I stayed in Waikiki for the first time, for 4 nights prior to going North Shore for a longer stay. The front desk staff at the Celebrity Resort was super friendly and warm, in a very genuine way; this was in fact the only place where I really felt aloha or ohana on this trip. The room was neither larger or smaller than other hotels, but was very efficiently laid out and clean; there was a very sweet and funny greeting left for us on the whiteboard by the room info. The courtyard is a real oasis of calm and peace in the hustle-bustle of Waikiki - it was a pleasure to hang out there. The location is excellent if you don't mind being off the beach - very close to the International Market and Duke's Lane, so the landmarks are great. Close to the buses, groceries and dining, and walking distance to just about everything in Waikiki. If I ever come back to Waikiki, I will definitely stay in this sweet little jewel tucked in amongst the behemoths!", "title": "Lovely little gem", "helpfulness": 7, "user": "RangerEh", "date": "December 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 11970634, "likes": {"liked": "— everything", "disliked": "— elevator would be useful for large / heavy luggage"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Having recently returned from a short stay at this hotel I have decided that I will never be back. There are lots of problems with this hotel, the condition of the rooms, poor quality breakfasts, staff that don't really care if you have a problem, and it is extremely noisy. We booked a non-smoking room and we were given a smoking one - and to a non smoker it really stinked! So when we asked for another room as we had booked a non smoking room, we were told that the hotel was fully booked and it wasn't possible. Our room was big, but badly in need of some attention. The carpets were dirty, there was a layer of dust on almost everything, the toilet pan smelled of pee and there was lots of black bacteria around the shower basin (which could have easily have been removed with a good scrub after every use!) and the wash hand basins, and pink bacteria on the tiles in the shower and on the wall. Our room - although it did have a nice view over the sea, was facing the front and was extremely noisy. The locals use the hotel bar and there is a nightclub joined onto the hotel - so it is noisy until the early hours of the morning with people shouting, young people singing and taxi's breaks screaching as they are picking up the people leaving the club. This goes on till about 3.30 am and is extremely loud - loud enough to wake me up! Breakfasts are basic - not like the traditional irish fare you would normally expect at an irish B&B. There is a choice of a few cereals, the usual sausages and bacon. There is a lack of cutlery and plates, which we had to ask for. We had an early flight and had to leave the hotel around 6.45am - breakfast is not until 7.00am, so when we asked if we could have breakfast (just some juice and cereal) a little earlier we were told 'that's just unfortunate that you have an early flight and can't make breakfast' When I challenged the receptionist on the fact that I had paid for bed and breakfast I was told 'it's up to yourself if you take breakfast or not, there's nothing else we can do, sorry'. Not exactly what you expect when you hear so much about the great irish hospitality. I would not stay in this hotel again. If you want a clean room that is quiet with friendly service and advice with a good breakfast look for a good B&B in the area - of which there are many of - and avoid this hotel. At €70 per person per night it is not good value for money, considering the cost of a well-run B&B. Avoid if possible.", "title": "Try to Avoid!", "helpfulness": 1, "user": "andare", "date": "June 30, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 17374322, "likes": {"liked": "— Nothing, but if pushed the view.", "disliked": "— Noise, dirt, unhelpful and unconsiderate staff."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Beautiful guest rooms, friendly staff. Excellent pub with great food.", "title": "Right on the Irish Sea", "user": "LovesToTravelAtlanta", "date": "May 4, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 15639689, "likes": {"liked": "— Rooms, proximity to beach", "disliked": "— Exterior of building"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Decided to treat ourselves and book a Hotel for the night. The Sands was perfect. Checked in on a Saturday afternoon. Room was lovely and modern, comfortable and clean. Hotel is right beside the beach and after a nice walk returned to the bar for a drink. Good mix of people in the bar from locals to people out visiting the hotel. Had dinner in the restaraunt that night, very impressed with it. Got free into the Niteclub next door.", "title": "Excellent Stay", "user": "faughnan", "date": "April 24, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15299173}, {"rating": 1.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Overall an excellent stay and will definetly stay again.", "title": "Worst hotel in Ireland", "helpfulness": 4, "user": "Cavius", "date": "April 7, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 14866119}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "The White Sands Hotel is the worst hotel I have ever stayed at, they say that the hotel is family run, family run? If you want to get to sleep, forget it, you would have a better nights sleep if you lie down onto the road outside.", "title": "new year celebration", "helpfulness": 1, "user": "casualtynurse", "date": "January 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 12388589, "likes": {"liked": "— location", "disliked": "— smelly room"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "This hotel/timeshare was a pleasant surprise in the hustle bustle of Waikiki. The location is very centralized and within walking distance of the beach and all of Waikiki. The manager and the rest of the Celebrity staff is very customer service oriented....which is always a breath of fresh air in this day and age of indifference. The room and bathroom were a bit dated but very clean.. Our kitchenette/ one bedroom suite was on the first floor facing the nicely landscaped pool area. The pool is small but quite pleasant. Parking is limited and if the hotel is full you will need to be put on a waitlist for parking your car on the grounds. There are no restaurants on site but you are close to a multitude of affordable dining places. \"The Bus\" bus stop is 3/4 of a block away.", "title": "Pleasant Surprise in Waikiki", "helpfulness": 5, "user": "rubyskymom", "date": "December 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 11919099, "likes": {"liked": "— Exceptional Customer Service", "disliked": "— Limited Parking"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "This was our first visit to Celebrity Resorts, and it will not be the last. Upon first entering the front desk area, we were made to feel right at home.", "title": "Great Hotel", "helpfulness": 4, "user": "Ray40", "date": "December 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 11533323, "likes": {"liked": "— Location to beach", "disliked": "— Did not get to stay long enough"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Aaron was on duty, what a wonderful gentleman.", "title": "Centralized and easy access to everything.", "helpfulness": 1, "user": "ppg0270", "date": "December 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11429087}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Judy the Front Desk Manager runs a tight, and efficient operation.", "title": "Not too bad", "user": "rdcummins", "date": "December 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 11254360, "likes": {"liked": "— Good Price and close to beach", "disliked": "— Small rooms, no elevator"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "George the Facility Manager was very congenial, and friendly.", "title": "Checked out early", "helpfulness": 3, "user": "gail_wilson", "date": "November 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 11157335, "likes": {"liked": "— Friendly, helpful staff", "disliked": "— The room"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "This place was clean and cheap. Well situated in the middle of Waikiki. Not ocean view but you aren't paying for that. If you have to be in Oahu and in Waikiki, this would be a good bargain place to stay. The front desk staff are very nice, helpful and friendly. Even more friendly than some of the brass and glass places I've stayed in the past.", "title": "Simple, No Frills in Waikiki", "helpfulness": 3, "user": "Melkolbe", "date": "August 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8380635, "likes": {"liked": "— location", "disliked": "— location"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Flying in from Australia, we were a little timid, not having stayed here before. We had booked Celebrity Resorts Waikiki based on the consistently good reviews from Trip Advisor. (Wondered if some of the Celebrity staff had submitted some of their own good comments(kidding!).) First the price was perfect for us holidaying on a budget but wanting to feel special anyway. Tears came to my eyes when we walked into our very large one bedroom suite. Spotlessly clean, very well appointed and with two bathrooms, two living areas, a small and neat kitchen, two TVs. Perfect for my partner and two children. Our glass sliding doors opened onto the courtyard pool area. Privacy for us all. Very lush tropical paradise. This little slice of heaven - only 3 floors tall - the little David amongst the skyscraper Goliaths. We didn't hear any traffic whatsoever. So, ok all of you reading this will appreciate the amenities and close proximity to the beach but hey... what about the customer service? More kudos for Judy (manager) and staff. Obviously they love people, take pride in their work and there are little extras that just delighted us. A range of free delicious flavoured coffees,each morning to choose from, an all-you-can-eat pancake and sausage breakfast on Thursday mornings and - yes - feel free to take the little beach chairs to the beach. There is a feeling of family and community here. We loved that. As we walked along Waikiki Beach at sunset, looking at the huge 5 star hotels, we felt like the lucky ones. Just one hesitation in writing this review - what if it becomes booked out and we can't get in next year? We will be very disappointed! Judy - if you read this, an extra thank you for your sincere graciousness and that of your delightful staff. 10 out of 10.", "title": "Shhhh.... don't tell anyone! Keep it a secret!", "helpfulness": 9, "user": "Canadiansonthego", "date": "August 9, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 8376471, "likes": {"liked": "— Value and Service", "disliked": "— Nothing"}}, {"rating": 4.0, "title": "Excellent bargain", "text": "The value for the price cannot be beat! Staff was great! It's a small hotel where you get to know other guests around the pool under the tropical foilage. The seperate concierge service was just great helping us book a car and tours. It felt like a home away from home. I highly recommend this hotel for the bargain hunter.", "helpfulness": 3, "user": "Vidyasadhu", "date": "July 25, 2007", "id": 8234686}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "This was my husbands first time to Hawaii and therefore, I really wanted to make it special. We were on a really tight budget and couldn't afford the luxury of a 5 star hotel. We were looking for something comfortable and affordable. I found Celebrity Resorts through Hotels.com and went on trip Advisor to see what reviews were written about the place. There were mostly positive reviews and I'd have to agree 100% with all of them. The bed was comforatable, the room was very clean and it came with a stove and fridge, so we were able to cook breakfast and dinner when we didn't have the money to eat out. It was literally less than a block away from the main street where all the shopping and restaurants were. It's a short bus ride down to the main mall. We also got tickets to \"Germaine's Luau\" and the pick up spot was a block away from the hotel. The staff was so friendly and accomodating. They answered all of our questions and when we needed more towels or directions..they were very prompt. We took advatange of the swimming pool and hot tub which were very clean and relaxing after a long day of walking and site seeing. They have these beautiful Palm Trees surrounding the pool area...makes you feel like you're swimming in the middle of a tropical forest. We absolutely loved our stay and will definitely return if we plan on visiting Honolulu again.", "title": "Absoutely Wonderful!", "helpfulness": 8, "user": "Hiswindow2heaven", "date": "July 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8204795, "likes": {"liked": "— Very comfortable and VERY close to the main street", "disliked": "— It was a little bit of an older building, so they didn't have updated appliances or decor"}}, {"rating": 5.0, "title": "It's only fair to share", "text": "At the expense of perhaps not getting my requested exchange of RCI back to Celebrity Resorts Waikiki next year, it's only fair that I share this secret with readers of tripadvisor.com, as I have benefited from the generous contribution of others in the past.", "helpfulness": 11, "user": "tak3", "date": "July 7, 2007", "id": 8073557}, {"rating": 4.0, "stay_parameters": "Stayed December 2005, traveled on business", "text": "We stayed at this hotel for just one night on 10th December for a Christmas Party night.", "title": "Nice Location, Nice Hotel", "helpfulness": 25, "user": "justclassicmgfan", "date": "December 13, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4237064}], "location": {"country": "Ireland", "continent": "Europe"}, "stars": 3, "variance": {"poor": 16, "average": 25, "very good": 43, "terrible": 28, "excellent": 26}, "aka": "White Sands Portmarnock", "slim_ranking": 1.0}