{"user_rating": 4.0, "review_count": 367, "name": "Whitewater Hotel & Leisure Club", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "we went to this hotel as part of a groupon deal. the location was lovely with beautiful views.", "title": "lovely", "user": "laurendee123", "date": "July 14, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 167485255}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "we walked to the steam train which was only a 10 minute walk. the train toon us to lakeside where we took the boat to bowness - would definitely recommend doing this.", "title": "Great hotel, food & friendly staff", "user": "katieandmark", "date": "July 14, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 167473250}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "we ate in the restaurant and the dolly blue bar, both were lovely.", "title": "Fantastic service and beautiful location!", "user": "TravelGirl1985186400", "date": "July 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 167318176}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "only negative was our room that was very snug and unfortunately an upgrade was not available. if we were to return we would definitely opt for the executive room.", "title": "Amazing luxury place", "helpfulness": 1, "user": "E S", "date": "July 10, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 167093504}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "We visited the Whitewater hotel last week for a 2 night Groupon stay. As with any hotel you haven't stayed in before we didn't know what to expect.", "title": "Excellent service, very accommodating", "user": "CharlieLuton", "date": "July 7, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 166600628}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We had chosen the Whitewater Hotel through a Groupon promotion. This included access to the Spa and a meal on the first evening. My wife is the Spa user and she felt it was good but one or two things were not working. One being the Swim Suit Spinner. The meal on the first evening was first class. Imaginative and well executed.", "title": "About Right", "user": "John B", "date": "June 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 163867939}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "We stayed 2 nights. Breakfast on the first morning was typical buffet and good. The second morning was cooked to order. It was well executed but unexpected. We were told that they switched around but suspected that there must have been a lot of waste on the first morning. There did not appear to be many residents.", "title": "Relaxing spa weekend", "user": "LesleyCann", "date": "June 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 163845064}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "Whilst not outstanding we would go back. We felt it should be a 3* plus rather than 4*. The evening meal was 4*. The Spa itself 3*. The Spa exterior needed a bit of a facelift.", "title": "Peace and tranquility.", "user": "Bootsie1855", "date": "June 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163187998}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The Staff were attentive but tended to answer everything with 'No problem'; even to the point of responding to a minor quibble with the evening meal with 'No problem'.", "title": "Perfect short break", "user": "186534James", "date": "June 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 163075083}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We picked up a decent deal for an overnight stay with use of the spa facilities and two treatments. On arrival at the hotel the receptionist couldn't have been more helpful. Although our room wasn't ready (we were early), she told us to make our way over to the spa and offered to keep our bags. We spent the afternoon n the spa, great pool, steam room and sauna and each had a facial and a back massage. The girls in the spa were great, friendly and professional and we were left feeling totally relaxed. Our hotel room was extremely spacious, comfortable and spotlessly clean. A little dated maybe but superb facilties, nice bathroom, bathrobes and slippers provided, lovely river view too. Nice complimentary tea and coffee too. Dinner in the restuarant was good. Delicious food, well presented. The restuarant staff were friendly and professional. After a good night's sleep, breakfast was very good. Hot and cold buffet with everything you could want. Overall a very good hotel with great spa facilities. We would definitely use this hotel again.", "title": "Break away with our 3 young children", "user": "Emmalk2", "date": "June 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162836780}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "In common with other reviewers we visited this hotel on a Groupon deal, upgrading to a superior room.", "title": "Excellent service from young, well-trained staff", "user": "luceo", "date": "July 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 169591206}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "The room was comfortable, spacious and quiet and we were entirely satisfied with the accommodation. The dinner in the restaurant was excellent and drinks were reasonably priced.", "title": "A little gem with amazing food and service", "user": "Sarah E", "date": "July 27, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 169297595}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "The staff could not have been more welcoming and their service was excellent, On the basis of this experience we shall certainly be returning to this hotel.", "title": "4* hotel in 2* location", "user": "Leon P", "date": "July 27, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 169272197}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Stayed here 24-27th July 13 on a Groupon deal .", "title": "Pleasant staff, beautiful location, huge room!", "user": "missmidwinter", "date": "July 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168672088}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "To be honest had reservations as we usually are more at home in the \"cooler\" end of the market but the deal was a good one so decided to give it a whirl !", "title": "Excellent all round stay!", "user": "david_dee", "date": "July 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168053494}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We stayed with a Dinner Bed and Breakfast Groupon deal. Great deal and the evening meal was absolutely superb, the staff were very pleasant, good service, always greeted us. The bathroom was lovely and clean with a separate shower and a bath - devine! The room was quite good with comfy beds but the lighting was extremely poor. I rang the reception twice to get a new bulb for the bed side lamp but eventually we did get one when I left a note for the housekeeper. They are dim lights for reading but good for mood lighting. Heated towel rail was great. It was difficult adjusting the radiator, the room was too hot despite the radiator being turned off. I discovered too late that it was possible to open the windows wider to get more air. Lovely setting and I would definitely be back. Didn't use the spa. I did go and see it, lovely big pool but not warm enough for the cool temperatures we were experiencing but children were happily playing in it. Only complaint was there was poor signage for the rooms and the corridors were like rabbit warrens. My poor elderly mum got lost a few times. And no lift from reception level to the rooms. You could go down some corridor and go though here there and everywhere to get to the other lift to get to the lift to our room. Easier just to lug the heavy bugs down a flight to get to it. Why no lift near reception on that level??", "title": "Fantastic food at the restaurant", "user": "rubez", "date": "July 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 166545506}, {"rating": 2.0, "stay_parameters": "Stayed July 2013", "text": "Have been coming to this site for years and have eaten in the dolly blue bar.Experiences have been mixed. Yesterday we had inlaws over and 10 of us to lunch at the bar. The bar/restaurant was empty. We were so pleased with all our meal choices, it was well presented, hot, tastey- even the sandwiches looked good. You could see pride had Been taken by the chef.YET today we decided to lunch in there again and our experience was COMPLETELY different. The food took over an hour to arrive. We were then served up the most slap dashed, cold, dry and miserable food. We had the same meals & same time yet completely different in presentation and quality!!!! We were told that it was the head chef on today but all I can say is that he must have been having a bad day!!!! I've had better chips in McDonald's!!! My dad wears dentures and the chips were rock hard nearly breaking them. i photographed the dried, cold French fries served with my steak burger which had re cooked bacon from breakfast in it and cheese that had not melted. My mother had to eat her gnocchi quickly as it was bearly warm. The bread and butter looked as if a five year old had made it with holes from cold butter wripped out the bread. Such a contrast to the excellent/same meal we had the day before. We were genuinely gutted and complained to the assistant manager who quite frankly was supercilious, patronising and self centred. No wonder there was no one eating in there. That's the other issue- how can poorly cooked food like that take an hour to cook! We are writing a letter to the new general manager as food in the restaurant/bar is NOT consistent and not cheap.", "title": "Great food one day, poor the next", "user": "LUCY M", "date": "July 5, 2013", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 4.0}, "id": 166404136}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "Hi, stayed here this week - the hotel is in a valley next to a river so looks pretty weather was nice but that meant there were midges and flys all over.", "title": "Nice Location but bit quiet", "user": "williamsdjg", "date": "June 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 165440338}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "Hotel itself is a beautifull old mill type of building with rambling corridors and is well kept. The rooms not so good originally was given one of the 400 rooms which are dingy and small on the ground level so asked for a move which then went to the 3rd floor 300 rooms. This was a better but again a bit dingy, the bed was awful one of those two singles pushed together with a cheap lumpy matress, the rooms have very little facillities in them for a modern hotel with limited TV bathroom was ok.", "title": "Spa break was not Luxury", "user": "CarolandTim62", "date": "June 25, 2013", "detail_rating": {"value": 2.0, "service": 3.0}, "id": 165171187}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "Staff were above average friendly and ate both nights at hotel again nothing special, I would stay here again but you have to make sure you get the better rooms", "title": "Spa break was disappointing", "user": "Claire_Franks", "date": "June 20, 2013", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 4.0}, "id": 164612105}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 21, "average": 53, "very good": 112, "terrible": 18, "excellent": 163}, "aka": "Whitewater Hotel And Leisure Club", "slim_ranking": 0.8, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}}