{"user_rating": 4.0, "review_count": 173, "name": "White Barn Inn", "reviews": [{"rating": 5.0, "title": "I loved it", "text": "I stayed at The White Barn Inn with my company for a small meeting and I loved it. I certainly found the Inn and the Restaurant to live up to the high standards we expected. The food and service were above reproach and my room, in the main Inn was very comfortable, nicely furnished and yes the rooms are high priced but worth it. I will be going back to enjoy the Inn with my family over the holidays, I hear the decorations are fabulous.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "September 19, 2005", "id": 3924166}, {"rating": 2.0, "stay_parameters": "Stayed August 2005", "text": "Luciano greeted us and was terrific, in fact all the personnel were wonderful, however, that plus can not hide a run-down facility, a dirty/small swimming pool, tiny rooms with major-league prices, noisy air-conditioning, narrow, dark stair cases and a feeling that what the Hotel wanted most was your money (i.e. a $20 room service charge add-on charge for ???? turning down your bed?). We were so turned-off by the facility that we ate elsewhere and thus have no observations on the food Our experience with Relais & Chateaux has been unerring with this exception.", "title": "Not Up to Realis Standards", "helpfulness": 11, "user": "DickSuzanne", "date": "September 6, 2005", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "service": 5.0}, "id": 3846587}, {"rating": 5.0, "title": "Amazing Loft Suite", "text": "While touring around Maine this spring, my husband and I came upon the White Barn Inn. We decided to stay for a few nights. We booked the Loft Suite for 2 nights.....it was superb! We had a private entrance, and a private patio! The Loft Suite had a very large marble bathroom with heated floors!! Also a jacuzzi tub for two!! We are planning to come back in the fall, to the Loft Suite and admire the fall leaves!! thank you so much for a very enjoyable weekend!", "helpfulness": 6, "user": "A TripAdvisor user", "date": "June 25, 2005", "id": 3611000}, {"rating": 5.0, "title": "Who would have known?", "text": "We arrived at Logan Airport where we were greeted by Imperial Limousine- The first of many wonderful experiences ahead on our adventure to Maine. Arriving at White Barn Inn was like stepping into another world. Everyone instantly knew our names and treated us like royalty.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "May 4, 2005", "id": 3438870}, {"rating": 5.0, "title": "The most romantic experience", "text": "The dining experience is to die for, and Kennebunkport is exactly what you would immagine a New England seaside town to be. We plan to vist again and again.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "April 6, 2005", "id": 3338060}, {"rating": 5.0, "title": "..............and a Great Time Was Had By All!", "text": "The following is an excerpt from an email I sent to Anita Taggersell, of the White Barn Inn, the Monday following a fabulous dinner party held at the White Barn on the previous Saturday night, in celebration of my husband's 70th birthday. Albeit mere words could never adequately convey the White Barn's incomparable ability to provide such an extradordinary evening, the email below was my attempt to do just that.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "February 16, 2006", "id": 4465804}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "January 30, 2006", "title": "Phenomenal beyond measure!", "helpfulness": 5, "user": "happywanderer30", "date": "February 1, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4407600}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "Good Morning Anita,", "title": "Exceeded Expectations", "helpfulness": 7, "user": "jameslfoley", "date": "November 18, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4126354}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "Well, I don't know where to begin. I honestly don't. Saturday night was so spectacular that no words could ever describe it to you. I know you are very familiar with the special magic worked at the White Barn, but it puts the rest of the universe in awe.", "title": "Incredible experience at the White Barn Inn", "helpfulness": 4, "user": "RangeRover55", "date": "November 9, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4102448}, {"rating": 5.0, "title": "Fantastic White Barn", "text": "Everything was totally fabulous: the room looked so elegant; the table festive-- with your beautiful linens and dishes and the way the favors, place cards and flowers were all arranged; Trevor and his lovely companion, with the most wonderful South African accent, were omnipresent catering to our every whim, providing service beyond compare; the entire staff at the White Barn is exceptional; the food, well, I possess no superlative to do it justice, perhaps there should be a 6 star category; the wine and cocktails were excellent; and finally the cake--what a grand and wonderful cake, it was exactly the effect for which I had hoped. THEN the chef actually came downstairs and chatted with us. Everyone was thrilled to meet him and have a chance to exchange a few words. It was like the Gods had come down from Mt. Olympus to chit chat with the mere mortals. We were all on Cloud Nine.", "helpfulness": 6, "user": "NordicBound", "date": "October 18, 2005", "id": 4033234}, {"rating": 1.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "My spouse and I enjoyed a dinner at the White Barn a few years ago, and either our tastes have changed or the White Barn is not what it once was. In any case, the White Barn does not deserve 5 diamonds or 5 stars for either cuisine or accomodations. On this occasion, we took a suite in \"Mae's Annex,\" and though it was priced at the top of the range, it was the most junior of junior suites -- one room with a sitting area, plus bath. I would agree with the reviewer who found the accomodations poorly maintained. The wall-to-wall carpet in our room badly needed cleaning or replacing, and no amount of faux-elegant over-decoration-distraction can compensate for things like a deafening A/C and a TV visible from only 1 side of the bed (and not at all from the sitting area). The wood-burning fireplace was badly in need of a chimney cleaning -- the heavy odor of the dirty flue assailed us whenever we walked between the fireplace and the A/C, and by the end of our stay, our respiratory systems were distressed.", "title": "Kennebunkport's White Elephant", "helpfulness": 24, "user": "ThreeRosettes", "date": "July 21, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 5492891, "likes": {"liked": "— This property is vastly overrated. Its PR should not be believed."}}, {"rating": 5.0, "title": "Just want to come back!", "text": "But the most disappointing aspect of our stay was the dining experience. To put this restaurant in the same category with a place like Jean-Georges in New York is laughable and makes me wonder how ratings are acquired. The dinner tasting menu, which we had with wine pairings, lacked the least subtlety and its presentation was far from artful. (We had to request to see the current tasting menu; the waiter said that they were \"so busy\" that they weren't putting it out in all the menus, but that we could have it if we really wanted it [$190 each].) I wish we had just left at that point. The sauces were among the most heavy-handed I have encountered anywhere and there was no magic to the tastes, no pleasant surprises. The \"included\" breakfasts were grudging -- the spongey quiche was the worst I have ever had, and the omelet was no omelet at all but a rubbery, heavy, steamed egg pancake straight from the steam-table, barely able to fold over to enclose a tablespoon of lobster ($19 surcharge). Two things any first-class restaurant should be able to handle are quiches and omelets, and the White Barn can do neither. To return to the White Elephant in Kennebunkport would be throwing good money (and a lot of it) after bad, something we will not do and will discourage for anyone considering a visit there.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "May 7, 2006", "id": 5040108}, {"rating": 5.0, "title": "above par", "text": "I went to Breakwater Inn hotel with my husband just for a night, as we were travelling through the USA on vacation. I have to say it's the best hotel I've ever been in the United States. We really enjoy the dinner, the food was delicious...I still dream about Tuna Tartar!! It was great!!!", "helpfulness": 5, "user": "A TripAdvisor user", "date": "April 28, 2006", "id": 5016996}, {"rating": 5.0, "title": "Surprise anniversary", "text": "I also have to say that the service was great, the waiter who served us was really kind. Our room was beautiful and clean, we had Jacuzzi and it was so relaxing!", "helpfulness": 8, "user": "A TripAdvisor user", "date": "April 24, 2006", "id": 5006770}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "Well, I'm looking forward to have the chance to come back in Kennebunkport, next time we are sure we'll stay more and enjoy Breakwater Inn again!!", "title": "Beautiful Getaway", "helpfulness": 7, "user": "Sandeep G", "date": "February 17, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 4467103}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "We were in need of a weekend out of Boston and thought it would be really nice to go eat at the White Barn since we had heard so many wonderful things about it. So, we decided to rent one of the cottages for two nights and head up there on a Friday night.", "title": "A nice romantic getaway", "helpfulness": 5, "user": "citygirl716", "date": "April 3, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "rooms": 4.0, "location": 4.0}, "id": 7278462, "likes": {"liked": "— The food!", "disliked": "— The price"}}, {"rating": 4.0, "title": "Very nice place, but doesn't deserve 5 stars.", "text": "Well, we got lost. Make sure you get good directions from the hotel and not from mapblast. We arrived and the gave us the tour of the inn and then put us back in our car to drive down to our cottage. We walked in the cottage as they took care of our bags and she showed us around our place. It wasn't big but it wasn't small. They lit a fire in the fireplace for us and reminded us of our reservations time as they left. We relaxed, kept the fire going, and started to get ready for dinner. Make sure your showers are not too long in the cottage since we ran out of hot water while getting ready for dinner.", "helpfulness": 13, "user": "Mendeleev34", "date": "February 19, 2007", "id": 6814286}, {"rating": 1.0, "title": "Don't Go - an absolute overpriced disappointment!", "text": "We drove up to dinner as the snow was slowly falling and they helped us out of our cars and it was like a scene from a movie. It was so romantic and wonderful. Dinner was unbelievable! Top 2 restaurants we have ever been to. The lobster dish was out of this world and the entire dining experience was the best you could ever ask for.", "helpfulness": 16, "user": "ExpatinBermuda", "date": "January 10, 2007", "id": 6571630}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "The rest of the weekend was spent hanging out with the fire going, drinking wine, going to their spa, just really relaxing.", "title": "Really Enoyed Our Stay Here", "helpfulness": 4, "user": "KenJLev", "date": "September 5, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5771399, "likes": {"liked": "— Very homey Inn with 5 Star Hotel amenities", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "Absolutely Amazing!", "text": "The only reason it is not getting 5 stars is because we paid $800 a night and it was, okay I'll say it, VERY overpriced. It was the middle of winter, we had a few moments where we felt that things should've gone a little differently, and honestly, we would've expected to pay $400 - $500 for that experience but not $800 a night.", "helpfulness": 2, "user": "RobertPlant", "date": "September 2, 2006", "id": 5763143}], "location": {"country": "United States"}, "variance": {"poor": 10, "average": 19, "very good": 36, "terrible": 9, "excellent": 99}, "aka": "White Barn Hotel", "slim_ranking": 0.333333333333, "description": "Kennebunkport--jewel in the crown of the Maine Coastline, perfect for your own ideal stay. The White Barn Inn (a member of the prestigious Relais et Chateaux) offers sumptuous guestrooms that boast true luxury and comfort. Surrender to our full spa experiences… energize and beautify as our Spa Director creates your personal revitalization. And experience the only AAA 5-Diamond, Forbes 5-Star restaurant north of New York City. Your stay includes complimentary continental breakfast daily. The setting is unique, encompassing two restored barns from the 1820’s. Here savor the rich flavors of New England and coastal Maine. Your White Barn Inn experience will bring everlasting, fine memories."}