{"user_rating": 4.0, "review_count": 52, "name": "White Moose Lodge", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Located just 15 minutes away from the noisy and busy glitter gulch. Lovely short scenic drive to the park entrance. Check in and check out was simple and fuss free. Room was average motel room size. It was clean with plenty of hot water. Parked our car right outside our cabin so it was great for loading and unloading bags. Breakfast consists of hot drinks and Danish pastry which was sufficient to get us going. With the rate you pay for this motel, please do not expect continental buffet breakfast! The 49 State Brewery which is a great place for food and drinks is closeby across the highway. The only bummer was that we could not get wifi in our room. And the moose did not come to visit! Still, it was a great stay and certainly a great value for money.", "title": "Simple cabin that serves its purpose", "helpfulness": 2, "user": "luv2trav3", "date": "August 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 136700591}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "I made a reservation for the White Moose Lodge over the phone once I was in Alaska. I had seen an ad for it in one of the local tourist mags. When I arrived in the area near the Denali Park entrance I was somewhat confused about which way to go, as one source had listed mile marker 228, but I called the Lodge and he said it was 248. The place is 11 miles north of the park entrance, but this is not a bad drive at all. Most of the places to stay in Mt. McKinley are tour/lodge type places. If you drive north to Healy, you'll find more independently-owned places. I wouldn't call the White Moose a lodge; it's really a log cabin motel, but it's nice. It's off the highway so it's quiet, though walls are pretty thin. It's clean and fairly conveniently located. All you'll get for breakfast is a celophane-wrapped \"Danish\", so if you need a big breakfast you'll have to go elsewhere. Several hours after I checked out, I got a call from the manager who said I had left my laptop mouse in the room. By then I was in Wasilla, so he offered to mail it to me in Kansas. I just got it in the mail today. I thought that was nice. I would stay here again. It might be a bit over-priced but that's Alaska. I was traveling by myself, so I think my room was a bit over $100 a night. This was more than the price advertised in the ad I had seen, and I tried to talk him down, but he wouldn't budge. He said that price was for the \"shoulder\" season, whatever that is. My sister is going to Alaska later this month, and I did recommend this place to her.", "title": "Good for base to explore area.", "helpfulness": 1, "user": "Lyn S", "date": "July 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 135799324}, {"rating": 4.0, "stay_parameters": "Stayed July 2012", "text": "The place had everything we needed after camping in Denali. It looked well cared for with flowers all around. The welcome was warm and the rooms clean and simple with decent beds. At $105 plus tax the price was ok by Alaskan standards especially given the location.", "title": "Clean and simple motel", "user": "Highlands332", "date": "July 29, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 135733864}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Pros:", "title": "Great value, clean rooms", "helpfulness": 3, "user": "bigboy61455", "date": "July 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 135492293}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "- Suitable for budget travelers: room rate less than 100$/night near Denali National Park is a deal. There is only other place in this price range in Healy. Healy is about 10 miles north of Denali NP, I believe. Much cheaper than hotels/lodges in front of NP. This place has bathroom attached to each room with separate setellite receiver as well.", "title": "Great place, Nice view!!!!", "helpfulness": 1, "user": "KhonKaenTukky", "date": "December 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 122045661}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "My wife and have have stayed at the White Moose several times over the years on our trips to Alaska. It's nothing fancy, but it's very convenient to Denali and the price is pretty good compared to the prices closer to the park. I think it's a bonus not to be so close to the resort city strip mall area closer to the park. Quieter - more out in the wilderness, which is the point of going to Alaska in the first place.", "title": "A Good Place to Stay, Especially for the Price", "helpfulness": 1, "user": "Protraveler02", "date": "September 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 117552282}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The rooms are exactly as advertised. They are roomy enough and the shower works great with plenty of hot water. The rooms are always very clean - that's my #1 priority - and they meet my requirements in that area. They've added satellite television since the last time we were there. The beds are comfortable and the heat works great. Until you're in Alaska, you don't think much about the need for heat in a cabin in August.", "title": "Great place to stay", "helpfulness": 6, "user": "CouldbeHomergirl", "date": "June 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 112654670}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "There's juice, coffee, hot water and danish for breakfast. We had cereal and some other things that we brought, so we had a picnic breakfast on the picnic tables at the place. Hard to beat that.", "title": "just short drive to the National Park", "user": "rasna10", "date": "September 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 77913049}, {"rating": 4.0, "stay_parameters": "Stayed June 2010", "text": "We've found the owner and staff of one to be very friendly and helpful. We don't bother looking at other places in this area anymore. We just stay here. A nice place and a good value.", "title": "nice rooms, only a short drive to the Denali National Park", "helpfulness": 1, "user": "marklad", "date": "July 18, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 71314708}, {"rating": 3.0, "stay_parameters": "Stayed June 2010", "text": "Super reasonable. Very clean and quiet! Nice owner, too. They have BBQ grills and picnic tables if you want to cook. We didn't. We drove 1/4 mile to the 49th State Bar and Grill which was AWESOME!!! That's another review :)", "title": "A Pleasant Surprise", "helpfulness": 1, "user": "AlaskaFirstTime", "date": "June 28, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 69004127}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "It's not the Ritz-Carlton, but it is just $85 a night. It worked perfect for us. We were a group of 4 couples and some assorted kids.", "title": "Perfect for the price", "helpfulness": 1, "user": "AKStafford", "date": "May 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 161947783}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "The rooms were clean and the beds were comfortable. Two of the four rooms had a mini fridge and microwave. Check in was simple and so was check out. There was coffee and some danishes set out for breakfast.", "title": "Nice Hotel", "user": "tnlctygirl", "date": "November 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 145423112}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The rooms weren't too sound proof and the curtains didn't keep out the light, so you might want to plan accordingly.", "title": "Clean, basic accomodations", "helpfulness": 1, "user": "mattmandy", "date": "October 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 143566460}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The water pressure was good and there was plenty of hot water. The shower head was mounted pretty low, so that was a bit weird. They had Direct TV and free wifi.", "title": "Rustic but comfortable", "helpfulness": 1, "user": "globeseeker007", "date": "September 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 139209504}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The buildings a little worn down, but it was clean and cheap.", "title": "Great location and value", "helpfulness": 2, "user": "Scott876", "date": "August 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 138331053}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Very clean motel style sleeper at a bargain price, 10 min. drive to Denali. was very impressed with the owners thoughtfulness in assigning rooms. The night we stayed there were eight other cars in front of the rooms. The best was that every other room was occupied instead of eight in a row, this made for a very quiet nights sleep, which you don't often get in a motel.", "title": "clean/bargain rate", "helpfulness": 1, "user": "tony838", "date": "June 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 164686539}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "As others have stated, most lodging in the Denali area tends to be extremely expensive during the short summer season. That's why the White Moose Lodge came as such a treat. It's a motel with each room containing two double beds, tv, wi-fi, a sink, and a small bathroom.", "title": "Nice, friendly and inexpensive", "user": "Alaskaflyer", "date": "June 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 163739139}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We paid $85.00 per room which is far preferable to the $250.00+ per night prices offered by the cruise line hotels. A car is necessary since the park entrance is about 15 miles away,", "title": "Best bang for your buck!", "user": "DWathenYoungstown_OH", "date": "June 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 163263711}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Lodging in the Denali area can be expensive. This is the only place I knwo of that has running water, privite bath, satellite TV , a bit of a breakfast (coffee, juice, danish) and use of a fridge, microwave, and freezer for under $100.00. It is right off the road south of Healy in a lovely area that is quiet and about ten miles north of Denali NP. Rooms are spacious and beds are clean and comfy. Plenty of clean towels and wash cloths.", "title": "Nice, Rustic Accommodations", "helpfulness": 1, "user": "ssuga", "date": "June 5, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 163099396}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "Located around 10 highway miles from the entrance to Denali National Park, this motel is a good transition to rustic Alaska without sacrificing basic amenities.", "title": "Great lodge", "user": "supertramaun", "date": "June 5, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 163071650}], "location": {"country": "United States", "city": "Healy"}, "variance": {"poor": 2, "average": 15, "very good": 26, "terrible": 0, "excellent": 9}, "aka": "White Moose Hotel Healy", "slim_ranking": 0.714285714286, "description": "Denali National Park is only 11 minutes away. Nice rooms with reasonable rates - $85 to $105. Convenient location in a wilderness setting. All rooms have private bath, mountain view, free satellite TV and free wireless Internet. Coffee, tea, orange juice and danish included."}