{"user_rating": 4.0, "review_count": 32, "name": "Wichita Suites", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "I live down the street from this hotel and had always wanted to check it out. I did last weekend for a writer's weekend--basically locking myself in the room for two days working on a writing project. The hotel was quiet, the breakfast was very good, and the drinks were strong at happy hour. For the price I paid ($60 a night on Expedia) I got a studio suite with kitchen, full breakfast, and free happy hour drinks! You can't beat that. The furniture in the room is a little outdated, but my room was clean. I'll be there again...", "title": "Good Writing Weekend", "user": "Kerri W", "date": "September 24, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 20338399, "likes": {"liked": "— large room and breakfast", "disliked": "— the bartender"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "After traveling through 100 miles of severe storms in Kansas with my senior citizen mother and my five-year-old son, I was very glad to arrive at this hotel. I doubt I would stay here again, however.", "title": "Any Port in a Storm", "user": "Symphonic", "date": "June 8, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "location": 3.0}, "id": 16769455, "likes": {"liked": "— The size of the suite, the clean bathroom, and the front desk assistance.", "disliked": "— The pervasive smell."}}, {"rating": 1.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "First, the negatives. I normally don't mind a \"dated\" look, but this was a little too dated for me. The hotel and the furnishings are late-70s/early-80s style, and are really showing their age. The coffee table especially was scratched, scuffed and scarred through many years of use. The couch in the living room (just a couch, note, NOT a sofabed) had some stains. The carpet around the bedroom window was wet (though, given the storms passing through Wichita, this could have been a recent occurrence). The wiring in the lighting above the beds was odd... my mom's light turned off mine, but mine didn't turn off hers (and wouldn't stay on if hers was off). Worst of all, there was a pervasive sweaty/moldy smell in the room which was impossible to ignore.", "title": "I will never choose this hotel again.", "user": "kwar9802", "date": "March 31, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 14684012, "likes": {"liked": "— The rude staff."}}, {"rating": 5.0, "title": "Get Away weekend", "text": "On the positive side, the suite was very large--with a separate bedroom and living room--and the bathroom (though very plain with white tile and sink) was fresh and clean. There were double sinks in the bathroom, and a full kitchen. The helpful front desk clerk provided an extra full set of sheets and a pillow, and I was able to make up the bed in the living room for my son. It was very quiet all night (except for the sounds of wind, rain and thunder outside), and the full breakfast bar the next morning was very nice.", "user": "Traveler3542", "date": "February 17, 2008", "id": 13627373}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "I think I would be willing to recommend this place, were it not for the sweaty smell. Others might be put off by the older furniture and decorations, but the pervasive smell was the only deal-breaker for me.", "title": "Good value for the money", "helpfulness": 2, "user": "twinmom04", "date": "March 22, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 2.0, "service": 4.0}, "id": 4724137}, {"rating": 2.0, "title": "We won't be back", "text": "Spent one night at Wichita Suites. The breakfast was good, and the room was okay. The bed was horrible. We have stayed in a variety of places, from budget hotels like Econolodge to the higher end hotels like the Westin, but we have never experienced a more uncomfortable bed. It felt like sleeping on box springs. We will not be back.", "helpfulness": 2, "user": "Sharon11R", "date": "April 4, 2005", "id": 3328134}, {"rating": 2.0, "title": "Getting a Little Run Down", "text": "It is pretty good for the money, but needs some rennovations. Some of the rooms smell a little funny. The workout/exercise room is nice, but the treadmill is dangerous (shorts out and the right handle isn't attached). Some of the other equipment isn't fully functional either.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "March 17, 2003", "id": 918393}, {"rating": 4.0, "title": "Worth the stay", "text": "Wichita Suites is a great place for its price. The rooms have a kitchen, living room, and bedroom. There is a full all you can eat breakfast buffet every morning also. This hotel could be really plush if more money was put into it. You can't beat the price and I'll stay there again.", "user": "JEM1964", "date": "November 25, 2002", "id": 810173}, {"rating": 5.0, "title": "wichita is sweet here", "text": "with an original full size painting in the front foyer and suite rates that don't match the big comfortable suite, this place is my own personal haven when I'm in Wichita.", "user": "A TripAdvisor user", "date": "October 11, 2002", "id": 715064}], "location": {"country": "United States", "city": "Wichita"}, "stars": 2.5, "variance": {"poor": 4, "average": 3, "very good": 11, "terrible": 1, "excellent": 13}, "aka": "Wichita Hotel Wichita", "slim_ranking": 0.26582278481}