{"user_rating": 4.0, "review_count": 236, "name": "Windermere Estate", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "We enjoyed an amazing stay at this hotel, situated right amidst plantation. the whole place has a very calm and soothing environment. You can see clouds & mist right in front of you. The rooms are spread on the hill & one has to climb certain stairs to move. The management won hearts in providing total personalized feel. The restaurant is not very big, but would be happy to offer your choice. They take you for an evening spice plantation walk which again is a wonderful experience. As we were from Delhi (which is one of the most crowded places), this stay was a good start for our Kerala Vacation & a complete stress buster. The rooms & premises have the English colonial feel which is preserved in the right manner. The place is situated some 2-3 kms from the main town. Suggested for people who are in love with nature. As you are in the lap of nature do not expect TV or other entertainment mediums, & this is the way it should be. AC are not required as the climate is generally to the cold side. Expect your mobile to show no network / poor network. We loved all this to happen as we wanted a break.", "title": "Very Peaceful - Enjoy the English Colonial Feel", "user": "Pankaj A", "date": "February 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 152763528}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "Situated some 3km outside Munnar and on a road not recommended after dark Windermere Estate appears to cater predominantly for western tourists. Most of the rooms are in 'bungalows' style apartments with with great views over the valley. Rooms are spacious with ceiling fans,comfortable beds and with a reasonable size balcony. Tea and coffee is available in room and there is a laundry service. There is also a complimentary tea and 'snack' form 16.30 in the grounds. Staff are great. Wifi is available in a purpose built reading room above the restaurant. As others have noted Windermere does not have an alcohol licence so if you want beer or wine you need to be prepared and drink on the balcony of your room", "title": "Lovely rooms with great views", "user": "rosyposy2", "date": "February 21, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "location": 5.0, "service": 4.0}, "id": 152702384}, {"rating": 5.0, "title": "Paradise - next time we'll stay 2 weeks", "text": ". Breakfasts were fine - mainly western but Indian available on request but the evening meal - when we were there - was very disappointing. The first night there was potato soup, 3 or 4 curries ( veg and non veg which were fine) then pineapple upside down cake. The next night was worse- vegetable noodle soup which had few noodles and was reminiscent of the packet soups of the 1960s whilst the pudding was a truly inedible instant whip type of caramel mousse. Given that there is no option but to eat here more effort should be put into giving a choice of local starter and dessert - even if it is only fresh fruit. Service was brisk to the point of being hurried. Overall we enjoyed our stay and it would not be hard to give a 5 start rating if the food was better", "user": "Jim C", "date": "February 12, 2013", "id": 152005680}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "If you want a TV and A/C then go to a different hotel. If you want to stay on a real plantation, with the smell of drying cardamoms in the air and fantastic views, then stay here. We've fallen in love with the place and are planning our next trip using Windemere Estate as our base.", "title": "A little disappointing", "helpfulness": 1, "user": "Specialities", "date": "February 5, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 151446843}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "It's a short drive out of dusty, busy Munnar. We had a planters house, which we thought was great. Lots of steps, but it's a working plantation, and it was well worth it for the view. We really enjoyed the food, and they went out of their way to look after us because we are vegetarians. Service was absolutely fantastic.", "title": "Informal hotel in beautiful mountain setting", "helpfulness": 2, "user": "TravelmeistersLondon", "date": "February 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 151318252}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We stayed here over Christmas and loved every minute. Set in beautiful tea and cardamom estate this guest house is sooths the soul and it’s hard to believe you’re in busy, bustling India. Dr John and his son are wonderful hosts and they and their staff make sure your every need is met. We had large room and bathroom with a lovely view of the tea plantation. They provide some complimentary excursions including a 2 hour walk through a cardamom plantation where we saw the indigenous Malabar squirrel at very close quarters. Despite being a T-total establishment, on Christmas Eve the hotel kindly provided us with a bottle of red wine in our room along with some delicious Indian style fish fingers, a small present and a Father Christmas hat to be worn at dinner. An enormous amount of thought and effort went into making this evening special for those far from home – tables outside with small fires to keep the chill away, a delicious buffet, live entertainment, all rounded off by a wonderful fireworks display. There’s free WiFi in the library, complimentary afternoon tea and the fresh tree tomatoes and passion fruit at breakfast are a treat. Stay two days – it’s worth it!", "title": "Refreshing & relaxing", "helpfulness": 1, "user": "zortean", "date": "January 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 148819947}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The Windermere estate is in a stunning location overlooking tea and cardamon plantations near Munnar. Our room was great with a lovely bathroom and views over the valley. The gardens were beautifully kept. The service was excellent; they couldn't do enough for us. Even when we got back 15 minutes too late for the plantation walk they put us in a jeep to take us to catch up on the walk. Our only criticism was the food which we found disappointing. For us it was a bit bland - it felt toned down for the European customer on the assumption they don't like spicy food. A shame as you can't go anywhere else for dinner - the estate is in the middle of nowhere.", "title": "Stunning location", "helpfulness": 2, "user": "Tiggerlives", "date": "January 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 148529753}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "Windermere", "title": "Great location, excellent customer service", "user": "SMOK77", "date": "December 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 148159107}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Great location, excellent customer service.", "title": "The place to be !!", "user": "Sindhwani", "date": "December 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 148060665}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "It is in a very nice location with expansive views in many directions of the hills, tea and spice plantations. The accommodations were very comfortable, but it was unfortunate that we did not have screens in our windows to be able to enjoy fresh air at night. The food was god, but it was on the expensive side for what it was. A PM snack bar (complimentary) was very nice with various teas or coffee, and banana fritters that for many would have made a tasty desert. The most important aspect of our stay that enhanced our experience was the excellent customer service and the effort the hotel management made to meet our needs. When our planned hike went awry, the manager secured us another guide, gave a ride to the trail head and made sure that the guiding company that did not deliver in the first place covered the cost of our second hike; the hike was very enjoyable. We simply wished we had more time to stay at Windermere and hike the beautiful mountain ridges and tea, coffee and cardamom plantations that surround it.", "title": "À quiet place in hectic India", "user": "berry64", "date": "December 24, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 147982261}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Good sized rooms, clean and comfortable with a balcony. The room includes a tea and coffee maker plus a fridge, which is handy if you’re taking your own beer or wine. (Windermere doesn’t have an alcohol license but you can drink your own in your room). The shower temperature was a bit inconsistent, but not anything to get too upset about.", "title": "Clean and comfortable and fantastic setting", "user": "Doob123", "date": "January 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150949193}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "Windermere is a bit out of town so you’re most likely going to eat in their restaurant, but I had no problem with that. It’s a set menu but does offer a number of dishes and both nights I was there it was very good. Breakfast choice was good too.", "title": "Lovely hilltop setting", "user": "janeontheweekend", "date": "January 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 150136064}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "A very nice place to stay for a couple of nights with great views and friendly staff.", "title": "Best of our trip", "helpfulness": 1, "user": "Dookyjo", "date": "January 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149853622}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Oh yes, and the free tea and snacks during the afternoon is a nice touch too!", "title": "Good view, best location", "helpfulness": 1, "user": "debras8", "date": "January 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 149661285}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "A lovely rustic farm-style estate in the hills, located near a tea plantation and having its own farm of cardamom and coffee....they even served their own coffee. The room was spacious with a large balcony with table and chairs. There is a hot water tank for the shower. We turned on the hot water the night before thinking we'd have hot water the next morning...it seems that doesn't work - we had some lukewarm water a bit later instead.", "title": "overwhelmed by accomodation and view", "user": "kelly k", "date": "January 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149475779}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We were glad to have been recommended to stay at Windermere because it was so totally different from anywhere else that we stayed in our 3+ weeks in India. The owners and staff were very hospitable and went out of their way to make our stay comfortable. We liked the setting surrounded by cardomom, coffee and tea plantations and, though the rooms and their furnishings were fairly basic and dated, this was in keeping with the properties' origins as guest accommodation for family and friends. As others have commented, we did not enjoy the set meals; not only because of the lack of choice but also due to their being of only moderate quality. We had one of the cottages overlooking the valley which was good, but spoiled by noise from the building works on the adjoining property which meant that we could not use our balcony during the day.", "title": "DIFFERENT!", "helpfulness": 1, "user": "NatGreen", "date": "March 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 154017054}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Large rooms, very clean. Staff very friendly and helpful. We enjoyed the food but the set menu may not appeal to all. Limited wifi. Great views and decks to relax on. Tea and coffee shop (free) a nice touch in the afternoon. Nicely laid out grounds and paths were being repaired while we were there. If you want quiet and just a place to relax, this would fit the bill nicely.", "title": "A nice quiet place to stay", "helpfulness": 1, "user": "LesleySnz", "date": "March 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 153445891}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "This place promises higher standards of comfort and facilities than it delivers.", "title": "3* establishment charging 4* prices", "helpfulness": 1, "user": "ALandE94", "date": "February 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 153347492}, {"rating": 2.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Lovely location, watching daybreak over the valleys from the lookout on the mound was spectacular. Staff courteous and service good, however the place has a feel of being run with a constant eye on profit margins. Set evening meal although plentiful was prepared with cheapest of ingredients and breakfast was meagre with little choice ( \"do you want cornflakes or porridge and how do you want your egg cooked?\")", "title": "Very disappointing", "user": "heelas", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 153087113}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Room was a big disappointment, having paid extra for a cottage room and expecting to be in one of the cottages overlooking the valley we found ourselves in 1st floor room over reception facing a small tea plantation. (owner's son explained that they classed all 1st floor rooms as cottage rooms) This room was spacious but tired. We were given instructions on how to turn on the hot water but were not able to have a shower because it proved impossible to regulate the water temperature, which went from cold to scaldingly hot for no apparent reason. Overpowering stench of sewage in the morning in the bathroom. The biggest problem was the noise from the wind that picked up in the middle of the night. It sounded like we were in the middle of a storm as the tin roof rattled and banged thorughout most of the night.", "title": "In the middle of a tea estate", "user": "Fijilass", "date": "February 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152788160}], "location": {"country": "India", "region": "Kerala", "continent": "Asia", "city": "Munnar"}, "stars": 3, "variance": {"poor": 10, "average": 26, "very good": 94, "terrible": 3, "excellent": 103}, "aka": "Windermere Estate Munnar", "slim_ranking": 0.119402985075, "description": "Windermere Estate is an 18 room boutique hotel perched on the hill slopes of Munnar on the Western Ghats with expansive view of tea estates. This family run property owes its name to one of the oldest cardamom plantation in the region. Set in the midst of a 55 acre cardamom & coffee estate , Windermere promises a true plantation experience with a unique blend of simplicity & luxury, combining modern convenience with old world charm."}