{"user_rating": 3.0, "review_count": 304, "name": "Windward Passage Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "Was not that exicted to stay here, but actually for business its a great property. Its not on the beach, but is on the waterfront where you can walk all the way into town with no problem, right on the bay. Ask for a water view. Rooms are large and renovated. (My only negative was that the bathroom floor was not thoroughly clean.) However, don't think twice about staying here as the service was very friendly, free wireless worked great and is literally 5 minutes from the airport. There is a small restaurant (with no windows) but adequate for breakfast. In the evening there is tasteful live local music in the atrium where the restaurant serves under umbrellas. If not in the summer, when its very hot, the atrium dining area is quite relaxing. If you want a convenient walk to a terrific restaurant, go to Frenchtown about 1/2 mile walk from the hotel where there is a wonderful Bella Blue restaurant, wonderful wines, very reasonable prices and great food. I would eat there every night. On your walk back you may catch a baseball/softball game with local teams right next door to the Holiday Inn. Watch the taxi rates - they will take advantage if given the opportunity. The local guidebooks show you what rates the taxis should charge.", "title": "Good value. Convenient for business.", "helpfulness": 1, "user": "aboutmiami2", "date": "April 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 14866358, "likes": {"liked": "— Location", "disliked": "— Bathroom"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2008", "text": "Musty, smelly room. Had dinner downtown -- on the walk back, noticed that one block from the hotel appears to be hooker alley -- no exaggeration. Will never stay here again, there are so many better options.", "title": "Will not stay here again", "helpfulness": 1, "user": "JBlaine2", "date": "April 3, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 14775770}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "We stayed at this Holiday Inn for 4 nights during the week of March 24, 2008. Admittedly I was a little hesitant after reading some of the reviews on this website however the stay was perfect. The room was clean, the staff was always helpful and friendly, the view of the harbor was beautiful. This was the bargain of the 9 day trip. The nights prior to our stay here were spent at a $480 per night hotel. I didn't see a difference except perhaps the holiday Inn staff was more accommodating to our needs. I look forward to our future stays there.", "title": "Loved our stay", "user": "Bushwhacker25414", "date": "March 31, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "location": 4.0}, "id": 14694940}, {"rating": 3.0, "stay_parameters": "Stayed March 2008", "text": "I read the bad reviews before booking and was very wary. I called the manager to discuss. I wanted him to guarantee me four refurbed rooms. (The hotel is going through a major renovation). He would not. But when I got there I was pleasantly surprised. The lobby was very nice and the people polite. My room on the 4h floor (room 443) was nice with a great ocean view. Very clean. Bathroom was nice. The other room on the 4th floor was very nice also. Note: Paid $250/room with tax for each room. The two rooms on the third floor were not as nice but okay. The bathrooms were old and outdated and depressing but the rest of the room was nice. The courtyard and pool area were very nice and it was obvious that they put a lot into it. Great place to sit and drink the duty free liquor you bought in town. Great bronze sculptures. The location was great with shopping nearby. Directly across the street on the waterfront a Texas BBQ vendor appeared at around 6 pm. I grabbed a take out order of ribs and brisket for $16 with enough for two people. I took it back to the hotel court yard to eat iwhile listening to steel drum music. Highly recommend doing this. Not sure why the hotel was totally fenced in like a prison but I guess it is not a safe neighborhood at night.. There is a Catholic church directly behind hotel. Mass was more like a Baptist revival with interesting loud joyful music (but it was Catholic).. Overall, they seem to really be tryng hard to upgrade this hotel. I would stay again if they would guaratee me a oceanview room on the 4th floor. They were in th process of renovating the other rooms but I would be wary until finished. Be careful with the quoted rates. They add a service charge and room tax that adds considerably to the cost. For example, a $199 room becomes $250 when you add all the taxes and charges. I am sitting here back in Michigan in the snow. But wish I was back in my 4th floor hotel room watching the cruise ships go in and out of the harbor. And the large seaplanes landing on the water directly in front of the hotel. Pretty cool!", "title": "Getting better", "helpfulness": 2, "user": "PaulSterlingHeights", "date": "March 4, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 14050587, "likes": {"liked": "— view and location", "disliked": "— renovations going on were distracting"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "After reading the reviews, I was expecting the place to be terrible, but our oceanview room was very nice. The hotel appeared to be around 30 years old and a little worn, but not terrible. The view of the harbor was beautiful, you can watch the cruise ships come in and out of harbor, the sea planes were also cool to watch. The hotel staff was very helpfull and friendly to us.", "title": "Not as bad as i thought it was going to be", "user": "dawings1", "date": "March 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 13987830, "likes": {"liked": "— Beautiful view of the harbor", "disliked": "— The neighborhood behind the hotel seem a little seedy."}}, {"rating": 3.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "We stayed at the Holiday Inn because the trip came with the time share I had just purchased. We upgraded to a water side view for an extra $30 a night which made all the difference in us having a great time versus an ok time. I've read rooms not facing the water have pretty bad views and are prone to the sounds of roosters in the early morning. With the water view we heard no roosters and always had a pleasant scenery to look out on. The staff was friendly for the most part, a couple of staff members in particular didn't seem too thrilled to be working and didn't seem too fond of tourist in general. After I was done with them they began speaking another language with pissy looks on their faces. Can't be sure they were speaking about me but I always get an uncomfortable feelings when these kind of moments arise. Other then that everything was just fine and my girlfriend and I almost preferred to stay at the holiday inn rather a resort since you can pretty much go into the resorts on the island and use the beaches and eat at their restaurants for a fraction of the cost of actually staying at the resort. If you plan on going to St. Thomas and exploring all of the island I recommend renting a Jeep rather then taking taxis. Taxis are good if you are only going to a few specific destinations as they charge per person around $8-$10 each way.", "title": "A pleasent experience", "user": "jason8478", "date": "January 29, 2009", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 24008677, "likes": {"liked": "— the view from our room", "disliked": "— the prices at the restaurant"}}, {"rating": 4.0, "title": "Not Perfect... But Not Awful", "text": "We arrived to St. Thomas on Christmas Day 2008 to find that our jeep reservation from Hertz Car Rental was not available. As a matter of fact, Hertz had no cars available for anyone. It seems car reservations on the Virgin Islands are frequently disregarded. We were put on a waiting list and we were told that we would be contacted when a vehicle was available. We did NOT have reservations for a hotel that evening. It was beginning to seem like we were not going to find a room for the night until we called the Holiday Inn. They had one available for $200 plus $40 tax. The people whom I spoke with at the reservation office were courteous. The employees at the front desk were friendly and helpful. The room had all the amenities you might expect including a mini-fridge and a hair dryer. It was relatively clean and well maintained except for some permanent damage to a few tiles at the entry-way of the room. The common areas were beautiful. The hotel has a nice bar and restaurant and a small casino with slot machines. The bartender provided us with good service. The exercise room was a bonus. The spiral staircase in the main foyer adds to the hotels unique design and the pool seemed well taken care of although the chlorine level seemed a bit off (the water tasted strange). Our view was “interesting”. It looked over the rundown local homes and businesses located in the area. The neighborhood did seem safe, and it was a short walk (1/2 mile) to downtown Charlotte Amalie where the cruise ships dock and the tourist market is. My overall impression of the Holiday Inn was good, but I wouldn’t want to spend my whole vacation there. One night was enough for us. As a side note; We did eventually get our rental vehicle.", "user": "SurfColdWater", "date": "January 7, 2009", "id": 23336813}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Link to the Hotel’s Website:", "title": "Easy ferry access", "helpfulness": 2, "user": "jojamak", "date": "October 29, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 21376698}, {"rating": 3.0, "stay_parameters": "Stayed August 2008", "text": "http://www.holidayinn.com/h/d/hi/1/en/hotel/sttwp?rpb=hotel&crUrl=/h/d/hi/1/en/hotelsearchresults", "title": "Erratic", "helpfulness": 1, "user": "USTraveller123", "date": "September 17, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 1.0, "rooms": 3.0}, "id": 20153288}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "From wheels down to horizontal sleeping it took us just over one hour, felt like more after the Red Eye flight, but still a definite plus. Beds and rooms clean but well worn. Personnel helpful but had no record of our early arrival request that we included on the website at time of reservation. Plus again for them as they did solve it to our satisfaction though. Negative in that we had to use the elevators with special room key access as the stairs don't continue to the ground floor after pool hours (emergency access -- yes so don't panic). But for the safety factor of feeding everyone through the front, it does equal out. Nice pool and bar in the open air courtyard, decent restaurant and service especially for it being the \"off season\". Easy walking to downtown shoppes and just a stroll to the ferry.", "title": "Good job on the make over", "helpfulness": 2, "user": "azsailor", "date": "June 27, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 17290552, "likes": {"liked": "— Air conditiner and close proximity to ferry dock and down town shopping", "disliked": "— Ball game noise outside our window (only on the first night)"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "My wife and i just got back after staying at this hotel for 5 nights. Before I went , I read some reviews and went with low expectations. I was pleasantly suprised! The place was clean and The staff wonderful. It was in a good location in downtown. Frenchtown was a 5 minute walk to some nice resturant's. We felt safe and there was no hustlers bothering you. They have a free shuttle to Megan's Beach, go there on Fri - sun it is less crowded because of fewer criuse ships. For the price we thought this was a really good bargain. Richard/Boston PS we were in the back of the hotel and there was a Rooster who got up early in the morning. Leave your fan on during the night.( Its the carribean)!!", "title": "A Good Bargain", "user": "richardBoston", "date": "February 17, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "location": 4.0, "rooms": 3.0}, "id": 13615694, "likes": {"liked": "— The staff", "disliked": "— The rooster out back"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "When we pulled up outside hotel i was expecting the worse bacause it looked shabby and dated. Inside the rooms were not to bad with comfortable beds . The breakfast was good value in a nice restaurant. The hotel is centraly located with nice harbour views but not close to beaches. There are better value hotels on the island but it was not to bad.", "title": "ok but needs refurbishment", "user": "chip1784", "date": "January 20, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 12804079, "likes": {"liked": "— freindly", "disliked": "— looks dated and shabby"}}, {"rating": 1.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Two words - STAY AWAY.", "title": "Stay away!!!!!", "helpfulness": 7, "user": "ChgoSailor", "date": "January 14, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 2.0, "rooms": 2.0}, "id": 12611551, "likes": {"liked": "— Location - but be careful", "disliked": "— The front desk staff and hotel management - HORRIBLE!!!!"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "Stayed at this hotel for one night prior to a cruise. Would NEVER stay here again. Hotel RUN DOWN and DIRTY. Even more disappointing - the front desk staff and management was INCREDIBLY RUDE, INHOSPITABLE and could care less about anything and everything. (e.g. I paid for, and had a confirmed reservation for, an Ocean View Ste (suite) with King Bed and Pull-out sleeper sofa. We were given a room in the back of the building overlooking garbage filled empty lots. When I asked the front desk staff about this - they insisted that 'ste' stood for standard room and not a suite - even though 'suite' was spelled out in another portion of the written confirmation.)", "title": "Great Location", "helpfulness": 1, "user": "jimandnango", "date": "January 10, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 12485701, "likes": {"liked": "— location", "disliked": "— Slow serviice inside restaurant"}}, {"rating": 1.0, "title": "Loud, Awful Experience", "text": "Restaurant very slow and food of questionable quality.", "helpfulness": 2, "user": "IUCAK", "date": "December 31, 2007", "id": 12171642}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I found the hotel good for my needs, I would describe it as excellent return for what I have paid!", "title": "Good return for my money!", "user": "beachcruiser33", "date": "June 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17162638, "likes": {"liked": "— Right on the water with fantastic view!", "disliked": "— Limited parking only!"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2003, traveled on business", "text": "My room was very clean, it has been just renovated and I was surprised because the standard was higher from what you expect from a Holiday Inn.", "title": "What do you expect?", "helpfulness": 1, "user": "CruzBerry", "date": "June 18, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 17028338, "likes": {"liked": "— Great access to town and taxis are always available AND it's near Oceana restaurant in Frenchtown.", "disliked": "— Not much to complain about if you're out on the town all day."}}, {"rating": 1.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Breakfast was good and reasonable, the restaurant staff were very friendly, the front desk staff were very helpful and friendly as well.", "title": "Rooster, chickens, and other kinds of critters", "helpfulness": 1, "user": "shaundog23", "date": "May 17, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 16151686}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "The hotel is within walking to all the downtown galleries and activities, hotel is located right on the bay and five minutes drive from the airport.", "title": "Wait until the remodel!", "helpfulness": 1, "user": "MissTakeOut", "date": "May 2, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "location": 2.0, "rooms": 1.0}, "id": 15598807, "likes": {"liked": "— location and water view", "disliked": "— needs a facelift and restaurant staff needs to get off their cell phones"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Parking can be sometimes a problem, but you can find your way to deal with it!", "title": "We'll try some place else next time", "helpfulness": 2, "user": "DGG2009", "date": "April 8, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "location": 2.0}, "id": 14882662, "likes": {"liked": "— It had a roof, 4 walls and a bed. It was also close to great restaurants in Frenchtown"}}], "location": {"country": "Caribbean"}, "stars": 3.5, "variance": {"poor": 42, "average": 84, "very good": 80, "terrible": 45, "excellent": 53}, "aka": "Charlotte Amalie Holiday Inn", "slim_ranking": 1.0, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.0, "location": 4.0}, "description": "The Windward Passage Hotel is truly your bargain in paradise. We are perfect for business travelers and the ideal choice for short stays and shopping trips. Centrally located, overlooking the picturesque Charlotte Amalie harbor, we are within walking distance of the major downtown shopping district and an even shorter walk away from the ferry and seaplane docks for transit to nearby islands. Transfer to the beaches is convenient for all our guests, so they miss out on nothing on our tropical island. Our Ocean View Rooms boast a breath-taking view of the harbor and our staff is courteous and friendly. We are constantly updating and improving our facilities to serve you better. You are welcome to stop by and pay us a visit."}