{"user_rating": 3.0, "review_count": 170, "name": "Windsor Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "This is a lovely hotel; quait and elegant. Small rooms, yes, but in one of DC's finest areas. The price is right, there are great ethnic restuarants within walking distance, and in short; this is city-living at it's finest!", "title": "European style!", "user": "andrew l", "date": "August 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116723356}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I put in a good long time researching places to go this summer for Washington DC and NYC. So this was my first pick based on price & quality.", "title": "Good Place, will be back in future", "helpfulness": 1, "user": "TravelBugWest", "date": "August 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 116530714}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Rooms had space. Water at front desk. Breakfast in morning. Didn't hear any noise except when the housekeepers were having a good time every morning. haha", "title": "Deceitful, frustrating & unpleasant staff. Oh!, and no manager on site. Ever.", "user": "EmmaKyrpy", "date": "August 3, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "service": 1.0}, "id": 116221916}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "My brother liked the cat \"Mona\". We pet the cat everyday! Somebody wrote something about cat hair being on the food but I didn't see anything.", "title": "Windsor Inn, friendly and well situated hotel", "user": "arapis", "date": "July 23, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 115696091}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Service was great on my part, helpful staff. And we 'compensated' them for their great services", "title": "Great location; reasonable service and room", "user": "megwalker87", "date": "July 20, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 2.0, "value": 3.0, "service": 3.0}, "id": 115586526}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "I with our other team members were on business trip to WDC in the month of May 2009. This hotel was booked after internet search and we chose this hotel because of it being on the K-Street. Our place of work were also in the K-street.. We found the hotel satisfactory. The metro stn. DuPont circle was in vicinity and hence it was a great advantage as it helped me/us save many dollars. Yes, the upkeep of the hotel was good.It provides complimentary breakfast but with limited choice. it also provides a Micro-wave oven in the lobby..Besides this it also provided us free internet browsing facility.", "title": "Average Small hotel", "helpfulness": 1, "user": "G_Niraj", "date": "October 15, 2011", "detail_rating": {"value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 119323663}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "The attraction was an Spanish concierge who was a die hard fan of Indian Superstar Amitabh Bachchan. He entertained us in the alien territory like anything. His way of mimicry was worth watching. However, all others were not equally good.", "title": "Still a decent value in DC despite all shortcomings..", "helpfulness": 1, "user": "racoontraveler", "date": "August 31, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 2.0, "value": 3.0, "service": 2.0}, "id": 117504027}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I can say it was a good stay.", "title": "Mixed feelings", "helpfulness": 2, "user": "Rsixtysix", "date": "August 28, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 2.0, "value": 2.0, "service": 4.0}, "id": 117377007}, {"rating": 1.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Stayed for 2 nights in January to bring our daughter for her winter program in DC. We rented a car for her suitcases, but very soon found out parking was costly and rare around there. Luckily , this hotel was a 10 minute walk from the subway and we were able to return the car the same day. Our double bed room was small but enough for us , clean, bathroom was clean. However everything was old and almost threadbare. Old and smelled moldy. Room temperature was good, though. Breakfast was served in a back room and consisted of pre-packaged items, bagels, muffin, cereal and standard coffee and juice. Its ok and appreciated since the alternative is walking out for 10-15minutes in the cold to go for morning coffee. This hotel is adequate for a stay in DC where there is so much to see and visit, one just comes back to hotel to shower and sleep.", "title": "Tiny rooms - Breakfast on a first in first served basis !", "user": "Voyager94100", "date": "August 24, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 1.0, "value": 2.0, "service": 1.0}, "id": 117176392}, {"rating": 1.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Washington DC hotels ARE expensive. Windsor Inn is at the cheaper end of the scale. With this in mind the WIndsor is an acceptable place to stay: great location, fine breakfast, friendly and helpful staff. But beware, it is not 'luxurious', it does not exude European luxury, although the website claims it does. It is more like a two star European pension. You may strike lucky and and get an upstairs room; you may luck out and get a 'garden' room (located in a rancid basement lacking ventilation). Three stars for an upstairs room, but barely two stars for a basement room.", "title": "The company operating this hotel is a rip-off,stay away !!", "helpfulness": 2, "user": "Ryanrc", "date": "August 20, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 116972472}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "OK. The staff was very friendly and the hotel has some character. But the rooms are too pricey for their quality.", "title": "Friendly but overvalued", "helpfulness": 1, "user": "burrito_of_london", "date": "February 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 124720503}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "First, the positives: this hotel is in an excellent location, less than a 10-minute walk from the Dupont Circle Metro station and great restaurants, coffee shops, etc. The staff was pleasant. However, this was overshadowed by the fact that we were first put into a room that smelled extremely musty and had stained carpet and grimy doors and walls. We asked to be moved, which the staff granted without issue. The second room we were in was a suite, and it was much nicer. The breakfast was lacking, with only bagels and pastries in a dingy downstairs room. If this hotel ever decides to repaint and re-carpet, it will be a very nice boutique hotel, but until then I would not recommend it, as it seems the rooms are hit or miss.", "title": "Needs a Good Coat of Paint...and Then Some", "helpfulness": 2, "user": "Poppler-Powell", "date": "February 14, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 124595192}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We went to Washington DC in a very very cold weather (for us 15 F is very very cold!) and we found our room very comfortable, warm and quiet.", "title": "Very comfortable and good position", "helpfulness": 3, "user": "valeria_vally", "date": "January 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 123257266}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "The hotel looks nice like all the building in that neighbor. It is situated in a very quiet road, but so close at the intersection with U Street, that is a very lively street, full of restaurants, bars and lovely tiny boutiques. So if you want to have a quiet and calm stay, you will have it, because the road of the hotel isn't much trafficated, but if you want to experience the night life or simply have some food very close to your location, you'll have it as well!", "title": "i dont know why theres so many bad reviews.. 5 stars from me", "helpfulness": 3, "user": "nabeel k", "date": "December 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121439098}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Moreover the hotel is located in 16th Street, that (if you simply check it out on a map) it's the same street of the White House. So if yuo like walking and exploring new places, you can just walk from the hotel to the White House straight on in a 25/30 minutes walk.", "title": "Not bad, could be better.", "helpfulness": 2, "user": "Abadonna", "date": "November 22, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 120894327}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "I liked the Windsor Inn and would stay there again. It's a really charming older style guesthouse at a reasonable price for DC. The rooms are nicely decorated, comfortable, and clean. I was upgraded to a junior suite and it was just what I was hoping for. The desk staff went out of their way to be helpful. The location is great, between a couple of commercial districts with lots of restaurants and other shopping. It's about a 20 minute walk to the national mall.Nevertheless, a few simple improvements would really be nice. The bathrooms need hooks to hang wet towels. Curtains in the rooms would block morning sunlight better than the current venetian blinds (keep the blinds, just add curtains). Instead of the cold continental breakfast they serve, they could perhaps offer hard boiled eggs, cheese slices, yogurts, and maybe some apples and bananas - not a big expense. Also, the wifi tended to be a bit spotty. It seemed best in the breakfast lounge. I think maybe they need an amplifier. I know this is a historic building, but if they could find a way to fit in double glazed windows, it would really cut down on street noise. 16th NW is a major street.", "title": "Personality, charm & affordable for DC", "user": "Massimo1", "date": "April 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 128497239}, {"rating": 2.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "This place is in a decent location, a nice 10 to 15 minute walk to Dupont Circle, but feels worn and tired. My \"garden level\" basement room was basic, with the sink next to the bed, worn carpeting and a low ceiling. The staff were generally pleasant and helpful, except for a grumpy night manager. For the price I paid, this does not seem like a good value.", "title": "Friendly but run down", "user": "HenryJames2", "date": "April 23, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 128439079}, {"rating": 2.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "I was surprised at how rundown this hotel was. From the front door, to the dining room and the rooms, it was shabby and needed a lot of maintenance. Beware of the basement rooms (Garden Level)...they are quite scary as you make your way through a series of doors and hallways which make you feel as though you are getting farther and farther away from anyone who could help you if you needed it. Mine looked out onto a dirty little patio table with an ashtray full of cigarette butts. The door to the room was a full length window covered by mini blinds, and you could easily see into the hallway on either side of the blinds. I asked for, and was moved the next day, to a first floor room which was only slightly better. On the third and last reserved day, I went out for a walk in the morning, and arrived back to my room at 10 a.m. to find it occupied by a maintenance man who was replacing the sink and had cardboard boxes and equipment all over the bed and the floor. I walked around the neighborhood and found two excellent and well maintained hotels for about the same price. I only wish I had found these other hotels earlier.", "title": "Better places to stay for the money", "helpfulness": 2, "user": "patricia_stpaul", "date": "April 13, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 127820183}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "If you stay here, you stay on the understanding this is a fairly basic B&B without frills. I was lucky enough to be upgraded by a cheerful and helpful French receptionist to a large double room on the 4th floor. The room was spacious with some original touches, though sadly some of the original tiling in the fireplace is getting damaged and the room (and hotel in general) needs a lick of paint. There was a small bathroom with new shower - cold water pressure is so great that you need to keep the tap turned nearly to cold to get hot water but it is there!", "title": "Jaded but friendly", "helpfulness": 1, "user": "Horsekeeper", "date": "March 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 126586836}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "There is no lift, so if you are laden with bags it's you that will have to cart them up the staircase.", "title": "I made the wrong CHOICE. ) -:", "helpfulness": 1, "user": "JAN W", "date": "February 22, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 125049852}], "location": {"country": "United States", "city": "Washington DC"}, "stars": 2, "variance": {"poor": 24, "average": 48, "very good": 48, "terrible": 22, "excellent": 28}, "aka": "Windsor Hotel", "slim_ranking": 0.84496124031, "description": "The Windsor Inn is a charming forty-eight room European-style hotel conveniently located on 16th Street several blocks from either the DuPont Circle Metro station or the Memorial/Cardoza Metro station. Business travelers as well as tourists seek out the Windsor Inn for its rooms that offer comfort, location, and value. The Windsor Inn's art deco lobby has original moldings and floor tiles from the 1920s renewal."}