{"user_rating": 4.0, "review_count": 148, "name": "Wingate by Wyndham Kennesaw", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "We arrived here after driving 400 miles back from Florida, at about 12 am. I had called first because I found a coupon in the roadsaver magazine for 74.99, and I talked to the sweetest lady named Bonnie. They honored the coupon and made us feel right at home from the minute we stepped in. The lobby was beautiful, the rooms were spotless and Oh SO comfortable.", "title": "Perfect in every way...", "user": "honeyrose29", "date": "April 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27718290}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "Breakfast was great. Eggs, bacon, waffles, and the usual assortment of fruits and pastries/bread. Coffee and cappuccino were available, as well as several kinds of juice and hot chocolate. Dining area was clean and quaint, with flat screen tv on the wall. Tables had nice little arrangements on them. Food was hot and the atmosphere was nice and friendly.", "title": "Great Location", "user": "Dosen8338", "date": "October 4, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 20625860}, {"rating": 2.0, "stay_parameters": "Stayed July 2008", "text": "The beds were so comfy with upgraded linens and mattresses, down comforters, and extra pillows. A/C worked perfectly. I barely remember my head hitting the pillow.", "title": "Nice place but terrible service", "helpfulness": 1, "user": "baseballfan1", "date": "July 15, 2008", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 17925338, "likes": {"liked": "— The location was great. The hotel was very clean and appeared new or remodeled.", "disliked": "— The staff."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "If I had any complaint at all, it would have to be that the reception on the tv was a bit static.. but that was the only flaw, and not such a big one anyway as we just wanted sleep, showers, and food!", "title": "Wingate takes excellent care of business travlers", "user": "zen_journeyman", "date": "April 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15063803, "likes": {"liked": "— Rooms and Staff", "disliked": "— Limited shuttle service"}}, {"rating": 5.0, "title": "GREAT STAY !!", "text": "It was the perfect end to the last night of our trip.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "April 10, 2006", "id": 4957264}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "It's a nice hotel. Definitely fit the bill for a one night stopover on our way to Florida. It's in a very, very busy area..... Lots of traffic and congestion. It was a Friday evening in an area of lots of shopping and restaurants, so that may have been a contributing factor. Getting to the location off the x-way was a bit tricky. Our nav system got us to the location, but the driveway we were directed to was closed off. We had to drive around a bit through various parking lots and shopping areas to find our way to the entrance. Tricky, but we managed. All in all, we had a good stay and would stay again.", "title": "Good for stopover", "user": "KarenSMichigan", "date": "March 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 102054044}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Cleanliness, comfortable rooms, and a friendly, knowledgeable staff! What more could you ask for. This was a top notch experience. I would stay here again in a heartbeat. Location was good and the whole experience was one that left us with a smile on our face. Thank you to all the wonderful staff. So helpful and accommodating!", "title": "A place you would gladly recommend to your best friend!", "user": "gcovemom", "date": "December 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90844182}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "New, clean hotel with great staff. The breakfast is above average for this type of hotel. I stay in this area occasionally and the hotel has been the best yet. It was a little hard to find because you have to drive through the parking lot of another business to yet there, but other than that, no complaints!", "title": "Great hotel, great service!", "user": "Nbaise", "date": "November 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 88387762}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Excellent hotel... extremely clean, very comfortable beds, wonderful whirlpool, friendly staff, terrific free breakfast bar (waffles, eggs, cereal, danish, biscuits/gravy, oatmeal, yogurts, fruit... the works), nice decor, great location. There was also a nice fitness center and a business center (we did not use either but they were available) as well as a pay washer/dryer if needed. Bathroom had great shower head, curved out shower curtain, blow dryer, very nice Neutrogena soaps, shampoo and lotions. Room had a mini refrigerator, in-room safe available, full length mirror, nice coffee maker, etc. Did I mention we were super pleased with this choice for our weekend stay? We also got a phenomenal rate online.", "title": "Top Notch Choice... two thumbs up!!!!", "user": "Armadillo17", "date": "November 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87093920}, {"rating": 5.0, "title": "New, Nice, Clean, and beds are very comfortable", "text": "I am very familiar with this area and what else is available. I highly recommend this facility... for the amenities, the location, and the price. Unbeatable if you ask me!", "user": "Wayx", "date": "November 9, 2009", "id": 48832294}, {"rating": 5.0, "title": "Great Hotel and friendly staff", "text": "My family and I stayed at the Wingate Inn- Kennesaw for a week. We were very impressed by the clean, comfortable room and the friendly staff. They had a wonderful hot breakfast and there were many different restaurants in the area to choose from for lunch or dinner. I highly recommend this hotel to anyone passing through that area.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "July 13, 2005", "id": 3662734}], "location": {"country": "United States", "city": "Kennesaw"}, "stars": 2.5, "variance": {"poor": 9, "average": 36, "very good": 38, "terrible": 5, "excellent": 60}, "aka": "Wyndham Kennesaw", "slim_ranking": 0.428571428571, "description": "The Wingate by Wyndham Kennesaw hotel is taking extraordinary steps to stay ahead of the changing needs of hotel travelers and will soon complete a renovation to make improvements to enable guests an experience that promises greater comfort and enhanced productivity. Located off Interstate 75, just outside of Atlanta, near Town Center Mall, is surrounded by the area’s best restaurants and shopping, and many corporate offices. Enjoy free hot breakfast each morning to start your day and complimentary internet access throughout the hotel so you can stay connected during your stay. Spacious parking lot with oversized-vehicle parking makes getting around a breeze. During your downtime, enjoy a relaxing swim in our seasonal outdoor pool, or work up a sweat at our on-site gym. We look forward to welcoming you to the ‘new’ Wingate by Wyndham Kennesaw!"}