{"user_rating": 4.0, "review_count": 211, "name": "Wingate by Wyndham Lima Downtown", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "My wife, daughter and I stayed at the Wingate the night before a college visit at Ohio Northern University. From check-in to breakfast, everything was wonderful. Upon recommendation of the manager, we went to the Bistro for dinner - fabulous!! The Bistro actually provides room service for the Wingate...can't wait to go back! We upgraded to a one-bedroom suite -- so big and comfy! Our daughter slept on the pull-out couch. Two TVs, 2 couches (one was the pull-out), 2 nice chairs with ottomans, coffee table, fridge, microwave, table with 4 chairs and coffee-maker. The bathroom was huge with double sinks. The room was L-shaped - it was like our daughter was in a different room!!", "title": "Loved the Wingate!!! GREAT!!! Clean & fresh...felt like home!", "helpfulness": 1, "user": "Wrathie", "date": "January 28, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4394200}, {"rating": 3.0, "stay_parameters": "Stayed November 2005, traveled on business", "text": "I am staying at the Wingate Inn in Lima, OH for an extended period of 2-3 months. So far, it's alright. the facilities and rooms are nice. The gym, is extremely small and no weights. I have a suite room with a jacuzzi tub, which is nice. The rooms are clean and everything in good working condition. As far as housekeeping - some days good, some really bad. The don't pick up at all and one housekeeper I had didn't even bother to fold the blanket and just threw it on my bed. I leave notes once in awhile and they are very receptive. They are DEFINENTLY not like the large hotel's housekeeping. Security is good, front desk - they are alright. We have a very large group (10+ ppl) staying here for 3 months + and when we requested fruit for the breakfast bar, we got a \"we don't do that anymore\". After several suggestions, they did add some bananas. The breakfast bar is alright: bagels, muffins, bread, waffles, boiled eggs, yogurt and a few sweet breads. Overall, it's a nice clean hotel, but nothing spectacular.", "title": "Extended Stay - Pretty Good to Okay", "helpfulness": 1, "user": "lisacas1", "date": "December 1, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 2.0}, "id": 4156548}, {"rating": 5.0, "title": "The Wingate Wins my vote", "text": "The staff was so friendly and had great recommendations on restaurants and places to go. I love the high speed internet made being away from the office easier and the rate was more then reasonable. I will stay there on all my visits to Lima. The Wingate Inn has my vote!!!!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "August 10, 2005", "id": 3752602}, {"rating": 3.0, "title": "Slightly disappointing...", "text": "After a previous good experience with Wingate Inn, I assumed this one would be just as nice, but I was wrong. The front desk staff (only 1 person) was too busy to answer questions and later on there was no one there at all. The room looked okay at first, but was not very clean-chips and lint on the floor, mirrors with fingerprints, and I even suspect dirty sheets on the bed ( it felt sand in the bed). The fitness center and hot tub were nice though and breakfast was pretty good, although no fruit.", "user": "amynielsen", "date": "July 30, 2005", "id": 3724065}, {"rating": 5.0, "title": "Wingate is great", "text": "All Wingates are great. The in-room high speed internet access puts these hotels one step ahead of Hampton and Holiday Inn Express. Price is very fair.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "May 25, 2003", "id": 1028678}, {"rating": 5.0, "title": "Great place", "text": "Hi, I stayed here for the weekend during a retreat (I am from Lima) and it is great - very clean, nice hot tub and breakfast and I love the free internet access. Really a great place.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "January 7, 2003", "id": 834440}], "location": {"country": "United States", "city": "Lima"}, "stars": 2.5, "variance": {"poor": 8, "average": 23, "very good": 64, "terrible": 8, "excellent": 108}, "aka": "Wingate Hotel Lima", "slim_ranking": 0.25}