{"user_rating": 4.5, "review_count": 1008, "name": "Wingate by Wyndham Atlanta/Buckhead", "reviews": [{"rating": 5.0, "title": "Wonderful staff and hotel!", "text": "I recently had the pleasure to stay at this hotel over a recent holiday weekend. The occasion was a wedding and over 30 rooms were booked for the wedding weekend. The staff was the friendliest staff I have ever met. From all my pre-wedding phone calls to staying with them for 5 nights, no question or request was ever a bother. From the true southern gentleman who made delicious waffles and omelets, to the front desk staff who went out of their way to make sure all the guests were comfortable, and to the limo driver (provided by the hotel at no charge) who put up with endless trips around Buckhead. Each guest was met with a warm smile when checking in and when handed a wedding Welcome Bag! And Marquis, the manager, was the best! He was a true delight to work with. Thank you Marquis and staff for making the wedding weekend (despite the rain) a most wonderful experience! I will be back!!!!!", "user": "Emoolie", "date": "September 15, 2011", "id": 118164682}, {"rating": 5.0, "title": "Friendly with lots of extras", "text": "My husband and I stayed at the Wingate for a concert at Chastain Park in July. The staff at this hotel go out of their way to make your stay nice. The free breakfast offers anything you could want and there are complimentary eats every day at 5:00PM in the lobby bar. They will transport you anywhere within 3 miles of the hotel in a stretch hummer. The bed was very comfy as well as free internet, microwave, refrigerator, coffee in room. Overall, just a very good experience.", "user": "Debra_and_John", "date": "September 12, 2011", "id": 117988667}, {"rating": 4.0, "title": "nice and clean", "text": "nice and clean hotel. check-in and check-out was a breeze. liked it all but breakfast.", "user": "xxapmc", "date": "September 11, 2011", "id": 117958661}, {"rating": 5.0, "title": "Believe the reviews and rating", "text": "Excellent hotel facilities and very friendly staff. Rooms very spacious with extremely comfortable beds. Breakfasts also very good, eggs and waffles cooked to order. Stretch Limo service to local attractions/shops an added bonus although you can wait some time on return journey but nevertheless it was fun travelling in it!!. Access to downtown Atlanta easy with the MARTA. Will certainly stay here again.", "user": "Nelly16", "date": "September 8, 2011", "id": 117841192}, {"rating": 4.0, "title": "A friendly helpful hotel", "text": "We enjoyed our stay of two nights at this hotel. We appreciated the microwave and fridge in our room, a chair for sitting other than a desk chair and wood laminate floors rather than tired broadloom. Very comfy beds. The breakfast was good with an option for made-to-order omelettes- a bonus for an 'included' breakfast. But best of all we found the staff to be very friendly and very helpful for any request we had. For example, one of our party unexpectedly needed to seek some medical help nearby and the hotel offered to take her to and from her in the hotel shuttle- so much appreciated. We will recommend this hotel to others!", "user": "Scoothome", "date": "September 4, 2011", "id": 117658014}, {"rating": 5.0, "title": "My son said, \"It was the best hotel ever!\" It was easy to agree.", "text": "To start with, we were greated with warmth and hospitality from the beginning to the end. Everyone who works there makes you feel like family. The people at the front desk are helpful. The drivers take us in a limo anywhere within three miles of the hotel. In the morning omelettes or waffles are cooked for us, besides the other items put out for breakfast. When our room was cleaned, they organized my son's stuffed animals on top of his bed. Upon returning to the hotel, we were welcomed when we walked in the front door. Everyone does their job like they enjoy making your stay the best!!!", "user": "A TripAdvisor user", "date": "August 31, 2011", "id": 117509925}, {"rating": 5.0, "title": "Exceptionally gracious hosts/owners, fabulous service, beautiful hotel", "text": "Thanks to the hotel owners and unbelievably helpful, pleasant staff for treating us all like royalty in beautiful surroundings while we reconnected in Atlanta. I would recommend the Wingate at your location any time!", "user": "lemay h", "date": "August 27, 2011", "id": 117325458}, {"rating": 5.0, "title": "As a global business traveler, the value, quality, staff, and facilities were top quality.", "text": "Lemay Henderson and Jayce Allen", "user": "westrickbrad", "date": "August 25, 2011", "id": 117206967}, {"rating": 5.0, "title": "Great stay", "text": "The property had all the great touches beyond what is typical. You can tell there is great pride in the ownership. The staff were all helpful, again well beyond normal good service, a real passion for what their job.", "user": "Uncle_Gomer", "date": "August 24, 2011", "id": 117187561}, {"rating": 5.0, "title": "Wow. Wow. Did I mention WOW?!", "text": "As others have commented, the staff was overall very friendly and helpful. Chris at the reception was very helpful and patient with my dozen or so questions about places to eat on a Sunday night after I checked in. Provided several good recommendations. The limo is a nice touch. Allowed me to enjoy a few adult beverages with dinner and have my own designated driver.", "user": "BlasianGrl", "date": "August 22, 2011", "id": 117075074}, {"rating": 4.0, "title": "Good value, really good amenities", "text": "Free internet; free good breakfast, limo service around town, good business center, nice pool All very nice. Staff was friendly and helpful. Upscale for a mid-range hotel - a very good value. Would have been happier with a better fitness center and someone to help with the luggage (we had a lot and the bartender was grudgingly called into to service).", "user": "trane12", "date": "August 21, 2011", "id": 117053735}, {"rating": 4.0, "title": "Exceptional value in Buckhead!", "text": "Since we were going to not spend any time at the hotel, we decided to try this brand for the very first time. I wasn't quite sure what to expect and I ahve to say we were pleasantly surprised! The front desk manager, Marquis, was very friendly, courtesous and helpful. The hotel is centrally located, just down the road from the 400 interstate. Great location in Buckhead to restaurants, shopping and nightlife. The room is a good size, they offer a breakfast buffet included with your room rate, they ahve a biz center, small pool, complimentary stretch Navigator limo for use within 3 miles. The tub is very small - smaller than what I ahve in my home, actually the bathroom is on the small side too but again, for the price point... you can't beat it. One wird thinjg was the window coverings didn't cover the window all the way, there was openings on the side, so no matter what you do, you will have light streaming in.... no true black out drapes or total darkness if you're trying to sleep in.", "user": "trishbella0419", "date": "August 19, 2011", "id": 116960463}, {"rating": 5.0, "title": "Loved, loved, loved it!", "text": "I stayed a weekend at this hotel with friends (for a reunion) and found it to be one of the most well-appointed, comfortable, convenient boutique hotels I've ever stayed at. The staff was extraordinarily friendly, the breakfast was superb (made-to-order omelettes and waffles - free!), the room was super comfortable. I've stayed in hotels the world over and though this is a Wyndham....I was truly impressed. Highly recommend it.", "user": "Leslie A", "date": "August 14, 2011", "id": 116711403}, {"rating": 5.0, "title": "Ticked all the boxes!", "text": "Stayed here for 3 days as a family of 4 with 2 teenagers. This hotel is in a very good area with good access to restuarants, cinema and a huge mall - all within a 15 minute drive. If you are going anywhere within a 3 mile radius, jump in the complementary limo for a great experience! They will pick you up too.", "user": "Forest1963", "date": "August 13, 2011", "id": 116644776}, {"rating": 5.0, "title": "as always the best hotel I ever stayed in", "text": "Reception always friendly and helpful - Chris is a star. Our room was spacious, clean and comfortable. The gym is small but functional as is the outdoor pool. Breakfast was a highlight with plenty of options hot and cold. The chef is on hand to make omlettes and waffles - nothing is too much trouble. Coffee runs through the day and if you're quick enough you can pick up a free cookie too!", "user": "Anna O", "date": "August 10, 2011", "id": 116536834}, {"rating": 5.0, "title": "Another great stay", "text": "This was my second stay at this hotel and I love it here. The staff is amazing. (especially Marquis). And we love the limo driver that took us to the area restaurants. The rooms are very comfortable and very clean. The breakfast served is second to none for complimentary breakfasts I have had.", "user": "Gemgirlbarbara", "date": "September 21, 2011", "id": 118430100}, {"rating": 5.0, "title": "Great Hotel - Limo Service is the best!", "text": "The Buckhead area is very tourist friendly and I would recommend this hotel to anyone visiting the Atlanta area. Access to downtown is quite good also.", "user": "vtrandi", "date": "September 20, 2011", "id": 118373053}, {"rating": 4.0, "title": "Overall a Positive Experience", "text": "Was here for two weeks in June 2011 for business. I chose it for two reasons. First near to my office and second the complimentary limo service within a certain mile radius. All the staff was very attentive and friendly. To mention some names, the limo drivers Farris, Ben, Craig and of course the staff at the reception and not to forget the cook (sorry, I cant remember the name). Only breakfast is served here but that was no problem for me. Will stay here again the next time I am in Atlanta.", "user": "bammerjam", "date": "September 18, 2011", "id": 118288738}, {"rating": 5.0, "title": "Incredible hotel for the price!", "text": "My husband and I enjoyed the breakfast. The food was delicious and the chef was cheery and friendly. The hotel was clean and the bed was comfortable. There is a little shop with snacks and drinks that was convenient after a long day out. Our only complaints: the free wifi was only available in one corner of the room. We couldn't sit in bed and surf. The cable went out on us so we couldn't watch tv that night. We waited by the empty front desk for assistance and, after several minutes, someone spotted us from across the room and said someone would be with us soon, then disappeared. We had already had a long day of \"service malfunctions\" I'll say, so we just went to the room. Any close-up interactions with staff were pleasant, though. The Buckhead area is nice and has some good eats and shopping. We would probably stay here again.", "user": "Ela A", "date": "September 17, 2011", "id": 118249033}, {"rating": 5.0, "title": "A Great Place!", "text": "This is one of the best hotels I have ever stayed at, and I travel a lot for work. Just a few of the highlights that set it apart: Hardwood floors in the guest rooms, which felt much cleaner than the nasty old carpet at many hotels. Extremely luxurious bedding, including a down comforter in a cover and a variety of pillows. Nice TV with a special remote control that can be sanitized. Excellent water pressure in the shower and nice toiletries (including nail file!). But what really impressed me was the HOT breakfast, with made-to-order waffles and omelettes, biscuits and gravy, grits, bacon, sausage, scrambled eggs, good cereal selection, yogurt, juices, toast and other pastries, and an espresso machine. And none of this was your average hotel fare -- this was food comparable to a decent restaurant. The location is perfect for exploring Atlanta, and they have complimentary limo service. Overall a great experience and I will definitely stay there again when I visit Atlanta.", "user": "sunnyfla1", "date": "September 17, 2011", "id": 118237946}], "location": {}, "stars": 3, "variance": {"poor": 15, "average": 51, "very good": 175, "terrible": 9, "excellent": 758}, "aka": "Wingate By Wyndham Atlanta - Buckhead Hotel", "slim_ranking": 0.0103626943005, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}