{"user_rating": 4.5, "review_count": 33, "name": "Wiveton Bell Rooms", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We've just returned from two nights at the Wiveton Bell, having previously stayed in their cottage in Blakeney last year. They have four rooms attached to the pub (we stayed in the garden room). The room itself was lovely, with an outside terrace area, a small lounge area downstairs and a bedroom and bathroom upstairs. The room was beautifally decorated throughout (although if your 6 foot plus you might want to book one of the other rooms, the bedroom and bathroom are in the eaves and so you might hit your head). We ate in the pub on both evenings, and the food was really good on both occasions. All in all a very good trip, and given the quality of the accomodation it was surprisingly good value.", "title": "Lovely room and great food", "helpfulness": 3, "user": "IanWLondon", "date": "June 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 131402721}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We had a one night stay in the Library room June this year and found it to be very clean, well appointed and overall excellent value for money. There were supposed to have been small bottles of fizz in the fridge, but they weren't there so I enquired about them and was told that they had run out of the small bottles and gave me a full size bottle instead!! The room was nice with a big comfy bed and nice little private balcony. It was earlier in the year that we stayed and the room did get quite warm so suspect it could be a little oven during the hot days of summer (if we ever have any!) The saloon style doors made the bathroom a little less private, but the power shower as very good. An excellent selection of breakfast pastries and fresh milk were delivered to our room in the morning also. All in all, great value for money and we will definately be going back for another short stay when in Norfolk.", "title": "Pleasantly Surprised", "user": "adethomp", "date": "October 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141903275}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "On entering the Garden room, overall it looked grubby and once we had looked around and unpacked it really was grubby.", "title": "Does not do what it says on the tin", "helpfulness": 1, "user": "vinolia", "date": "September 10, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 3.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 139915719}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We stayed for four nights. During that time;", "title": "My favourite place in Norfolk!", "user": "Mezley72", "date": "August 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 137544748}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The coffee in the canister was stale.", "title": "Our stay in the white room", "helpfulness": 1, "user": "P M", "date": "August 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 136264698}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The sheets were not changed.", "title": "Beautiful quiet location", "helpfulness": 1, "user": "freelander1994", "date": "June 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 131951226}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 0, "average": 3, "very good": 5, "terrible": 1, "excellent": 24}, "slim_ranking": 1.0, "description": "Individual Rooms with outside sitting areas in a tranquil village next to the green. Flat screen TV's. Blue Ray DVD's Wifi and continental breakfast delivered to your room all add to your enjoyment. The Pub has an AA Rosette and you can dine outside in the Sunny south facing garden.Sit outside for a night cap under a starlit sky truly romantic the perfect end to days out in beautiful North Norfolk."}