{"user_rating": 4.0, "review_count": 64, "name": "World House Istanbul", "reviews": [{"rating": 3.0, "title": "Great location and friendly service, somewhat dilapidated condition.", "text": "I stayed at the World House in Feb 2010. The hostel's location is excellent: incredibly convenient for seeing the major sights of the city and going out at night. The condition of the rooms was acceptable, but the dilapidated condition of the bathrooms throughout the hostel left much to be desired, no matter if you get a room with a private bathroom (icky and rundown) or in the dorms with shared bathroom (even worse condition).", "helpfulness": 1, "user": "newyork10r", "date": "February 13, 2010", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 55883954}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled solo", "text": "That said, the price is really low and the staff were very friendly. So I guess you get what you're willing to pay for.", "title": "Great hostel in perfect location", "user": "phil_travel_europe", "date": "August 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 38839238}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "I enjoyed my stay in Istanbul but will stay somewhere else next time.", "title": "Price/quality the perfect combination", "user": "tunion", "date": "August 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 37677124}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We had a double bed room with private bathroom. We stayed 4 days and no cleaning was performed (no need actually with hot August). Lining were included, towels were not. The room was big, with a table, a closet, a shelf and a roof fan. The neighborhood was quiet, still very close to lively streets. Free WiFi connection works only at ground floor but there are 2 coin operated PC to go online (however you cannot write your stuff offline and then copy and paste). Breakfast is good and you can take as much as you want.", "title": "great hostel in a great neighborhood", "helpfulness": 2, "user": "ferdinando_pucci", "date": "September 6, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 117737901}, {"rating": 4.0, "stay_parameters": "Stayed July 2011", "text": "Overall this hostel is good value. The rooms are clean, staff friendly and it is a great place to meet other travellers.", "title": "Great location, good value", "user": "Tina_hw", "date": "August 4, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 116270391}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled solo", "text": "My only complaint is that the young tour organiser can be very persistent and pushy.", "title": "mix feelings", "helpfulness": 2, "user": "DEMM_04", "date": "January 16, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 93239791}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "I found that staying on the top floor-8 beds-bedroom was a great experience. I had the room just for myself for 4 days of 5. There, I was able to enjoy the views from Galata tower across the hostel, and full view of the old town every morning and night. Their breakfast is the same as the rest of Turkey, and the location i found is good. A little touristy for my taste, but still not overwhelmed by it. They have one washing and dryer machine, which is pretty convenient. ALso have internet, also convenient, but very pricey compare to the prices you can find around the corner. Ohh...one thing, the room on the top floor, the one with the view...you have to walk 4 floors to get there. There is not elevator, but is is nice to go around and around...you will see why.", "title": "Good and bad", "helpfulness": 2, "user": "anomelisa", "date": "August 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 75043009}, {"rating": 5.0, "stay_parameters": "Stayed June 2009", "text": "My mix feelings comes in term of the staff. Two of the guys there were very friendly and eager to chat or help, but then there was a third one (who was almost all the time there) who seems to be bothered the few times I approached to him to ask for some directions. That was kind of uncomfortable. Also, My first morning there, one of the employees - a boy-not the maid, went into my room while I was not there, I think to take a break...at that point I thought was a guest, but then I saw he was not staying, he worked there. At any rate, it was only that time. It did not happen again while I was there. But still that experience contributes to my mix feelings.", "title": "Location can't be bettered, great value", "helpfulness": 1, "user": "SheffieldShuggie", "date": "March 2, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 57563025}], "location": {"country": "Turkey", "continent": "Europe"}, "variance": {"poor": 2, "average": 10, "very good": 25, "terrible": 1, "excellent": 26}, "slim_ranking": 0.12012987013}