{"user_rating": 3.5, "review_count": 861, "name": "World of Wonders Topkapi Palace Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "When I say with teenagers, it's with two young children as well. We are a family with 4 children from 3 to 15 and we love this place. When we first went we had the family duplex rooms which have an upstairs bedroom for the children as well as an extrea bathroom which is a wonderful benefit when getting ready. Now though, we are too big for a duplex and have interconnecting rooms. My husband and I have one and the four children share the other (with 2 put up beds). We all have plenty of space and again 2 bathrooms for getting ready. Every year we go we have more fun than the last time, I'm in the process of booking again. Sun always shines, foods fab, staff can be so friendly (odd grumpy one) and a real chance to dress up in the evening and sit outside and soak up the atmosphere. All my children are happy here and they're happy, I'm happy. As we have been before we now know some of staff and we have been treated amazingly. In some ways I don't want to give a good review as I'd rather keep this place a secret so it doesn't get too crowded!!", "title": "Fifth Time and Still Fabulous!!!!", "helpfulness": 1, "user": "PeterboroughSeda", "date": "June 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 33222803}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "I had to write a review after reading all the bad reviews on this site.", "title": "very enjoyable holiday", "helpfulness": 2, "user": "bobbi71", "date": "June 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 32628001}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Ok this was a one week last minute holiday and we got a really good deal so as long as the weather was good and the accomodation was ok I think I would have been happy.", "title": "brilliant hotel for families", "user": "bubbles060", "date": "June 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 32160414}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Remember people 5 star is about the amount of facilities not neccessarily about people waiting on you hand and foot and being treated like a godess!!!", "title": "Great facilities excellent staff relaxing holiday", "user": "MissBuffy", "date": "June 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 32122947}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "We arrived at the hotel and were amazed and highly amused with how creative the hotel chain had been with this creation of topkapi and Kremlin palace. Having been to Turkey over 10 times I knew that accomodation star standards are not usually that high.", "title": "top hotel", "user": "maccmaniaa", "date": "June 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31521293}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Do not listen to all the bad reviews they do not no what they are on about !!", "title": "Amazing Holiday!! Best Ever", "user": "GillyFish", "date": "August 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37063263}, {"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "It was the best hotel i have ever been to.All the staff were really nice and friendly, the food was really nice and the facilities were amazing!!!!!", "title": "such a shame because this hotel could be wonderful!", "user": "wrexhamgrumpy", "date": "August 5, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 36798994}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "The waterslides were really good and the value for money is amazing!!!!!!!!", "title": "Do not stay at this hotel!", "helpfulness": 3, "user": "POTATO12358", "date": "July 31, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 36309527}, {"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "This hotel is for everybody but more for families!!!!!!!", "title": "Not recommended", "helpfulness": 1, "user": "sds_1", "date": "July 27, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 1.0, "service": 2.0, "rooms": 1.0}, "id": 35968083}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "BEST HOLIDAY EVER!!!!!!!", "title": "DO NOT BOOK THIS HOTEL, THE WORSE I HAVE STAYED IN!", "helpfulness": 3, "user": "EVPLondon", "date": "July 23, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 35560066}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Travelled to the Topkapi with wife and son (16). We arrived early hours (0700) after long flight. we were really impressed with the look of hotel. Cases were delivered with no problems and on arrival at room, found 2 single beds and turn down sofa, no balcony or view.Having paid full price for 3 people, this was not acceptable. Thomas cook rep (Christie), sorted this out, we had been alocated the wrong room (a common practice for Brit guests). New room, double bed and a single bed with a good balcony. Clean and modestly appointed.", "title": "great potential", "user": "bluenozeboy", "date": "July 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 2.0, "service": 2.0, "rooms": 4.0}, "id": 35188453}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Good points: 2 good reps (Christie and Asheigh), some staff try really hard. Good beach activities and shows.weather superb.", "title": "AMAZING", "user": "meighanokane4694", "date": "July 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 35154485}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Bad points: most staff don't try (guest services -wake up please), mad house at main restaurant. loads of rude eastern guests (russians,mainly) - if you want service, you have to stand up for yourself or get ignored. Bad system for booking a la carte restaurants- automated telephone systems that is very difficult to use. Watch out for Kodak (dubious) photo booth beside pool- they are incompetent Little for 16 year old to do after 9pm, unless you fancy their chances at disco (not recommended for younger ladies,due to perv factor).Rip off shops on sites (27 euros for small sun tan lotion, 2 euros for can of real coke).", "title": "Loved it", "user": "am98", "date": "July 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 34564828}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Overall- had lots of potential but let down by lack of staff numbers in dining room and some atitudes to Brits.Hotel is isolated, with no shops/bars in walking distance (needed after two weeks of same old menu).", "title": "Great value, good food, lots to do", "user": "Canadian_Expat65", "date": "July 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 34507426}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "when i read the bad reports i was worried about going to the hotel but it was amazing there was so much to do for everyone! the hotel was amazingly clean the staff were very plesant and extremly good with children the entertainment was very good. the disco was excellent for all ages . also they had long comfortable couches for people to sit on or to go to sleep on if they had a long night to be picked up for going home. i would definetly recommend this hotel to anyone and everyone.", "title": "Great if you have teens", "user": "the3bells", "date": "July 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 34065537}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "This is one of the best resorts in the area, l have stayed there before, and this August and am going with an other friend in October, these people who are saying is the worst hotel and they got beat up, yes they were trowen out, this British boy got drunk and started to expose himself to other guests , making ubsine guestures, and rightfully so he was stopped,", "title": "It is GREAT, and I was there to see the fight and this people are lying", "helpfulness": 1, "user": "AmerTurk", "date": "August 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 38627902}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "and him to come here and tell us he was beaten is a lie, l saw what happened, any way", "title": "We had a wonderful time!", "helpfulness": 1, "user": "turkeylovers09", "date": "August 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 38281149}, {"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "it is a nice place and food was great , give them a try it won't dissapoint you.", "title": "ood break but I wouldnt recommend it for stays of over one week.", "helpfulness": 1, "user": "peterpea", "date": "August 11, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 2.0, "service": 2.0, "rooms": 2.0}, "id": 37338069}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Having booked for our honeymoon, we were very worried after all of the poor reviews but when we got to the hotel we realised some people may have been over exaggerating. We could not find one thing to complain about and although I am sure it is not perfect but I would like someone to point out a hotel that is. We had a lovely, clean room which was basic but with a mini bar that was restocked with beer, pepsi and mineral water and the room was cleaned and tidied every day and there was no sign of mould in the bathroom. Air conditioning good in the day but didn't seem to work quite as well at night. Although i've had better, it was cool enough to get some sleep. We had two single beds and we pushed them together the first night. The next day the lady had made it up into one bed! Main pool loungers seem to get taken very quicky but we always managed to get one when we wanted (although you do have to get up early!) and the relax pool was lovely. Round the main pool there is a very busy activity programme and some watersports such as banana boats are all incluside. I'd recommend the aqua aerobics which was really good fun. If you don't want to be bothered with noise, music and people trying to get you to join in then the relax pool is the place for you! We really enjoyed the wave pool and the beach is gorgeous- clean and safe even though the sea is deep. Lovely pier to walk along and pavillions you can book which are waitered serviced. The sceneray is beautiful and in August the weather was amazing!!", "title": "Don't go there!", "helpfulness": 3, "user": "isabella064", "date": "August 10, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 37216211}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "The main restaurant was lovely with lots of choice although it does get very busy after eight o clock. This didn't really bother us as we just went earlier. Excellent choice of bars with some delicious cocktails, we recommend the WoW fiesta, Ursus topkapi and banana breeze (all of which weve memorised so we can make them at home!)", "title": "Dirty ! Dont go here unless you want felt up and fleeced", "user": "30somethingoptimist", "date": "August 9, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 1.0, "service": 3.0}, "id": 37200030}], "location": {"country": "Turkey", "region": "Turkish Mediterranean Coast", "continent": "Europe", "city": "Antalya"}, "stars": 5, "variance": {"poor": 92, "average": 145, "very good": 238, "terrible": 78, "excellent": 308}, "aka": "Hotel Topkapi Palace", "slim_ranking": 0.223684210526, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 3.5, "location": 3.5}, "description": "While travelling back in time to the past in the middle of historical textures, are you among those that wonder what it would mean to live inside one of the unique architectural structures? You can be sure that WOW TOPKAPI PALACE, which has been built based on the TOPKAPI PALACE in Istanbul will provide these experiences for you. Be prepared to be treated like the sultans in an 85.000 m2 area within the Kundu Village of Antalya... From the moment you open the doors of TOPKAPI PALACE, you will stay at the harem, you will dine at the Palace Kitchens and Hagia Irini, cool off at the Fountain of Ahmet the Third at Sultan Ahmet Square, sip your wine at the Judicial Tower, and taste starch pudding with rose water at the Mecidiye Mansion! Our resort is 20 km from Antalya Airport and 17 km from the center of Lara - Antalya Free Services Welcome cocktail, food & local and standard imported drinks, mini bar, safety deposit box (in rooms), fitness center, Turkish Bath, sauna, squash, pugy club (mini club), internet cafe, daytime sporting activities & night time shows, 30 minute group tennis lessons, tennis rackets, catamaran, windurfing and sailing (all require certificates), canoing, first trial dive at the swimming pool, towels, sombreros and chaise longues, hammocks and cushions, wireless internet access from the lobby and the rooms. Services Subject to a Fee: Room service (24 hours), special wine menus at the A la carte restaurants, premium alcoholic drinks, energy drinks, La Nazır Restaurant(cover fee), Mangal Park Restaurant(cover fee), La Gondola Restaurant(cover fee), doctor, nurse, massage, beauty center, hairdresser, tennis school, tennis courts lighting, mini football and basketball pitches lighting, sailing school, diving school, laundrette & dry cleaning (ironing),high speed wireless internet access from the lobby and the rooms. babysitter, telephone & fax, motorised water sports, the pavillions (specially equipped private relaxation areas on the beach), bowling."}