{"review_count": 71, "slim_ranking": 2.0, "name": "Worms Head Hotel Restaurant", "reviews": [{"rating": 1.0, "title": "Disappointing bar meal", "text": "Had fish and chips in the Helvetia bar. The beer was fizzy and the fish was burnt so that the batter was a very dark brown and shattered under the fork. I was kicking myself after for not having sent it back, but we were trying to get out to the Worm's Head before it got too dark. Really needs to do better for the price.", "helpfulness": 1, "user": "Hockeybod", "date": "April 7, 2013", "detail_rating": {"value": 2.0, "service": 2.0}, "id": 156905391}, {"rating": 1.0, "stay_parameters": "Visited March 2013", "text": "The only thing that is any good id the view, which you can get without having to pay for dodgy reheated food and overpriced drinks. The man I assume was the owner/manager was rude unwelcoming and generally not deserving of any of my money. Not going again and will tell anyone i know the same. Just go for a walk and take your own food, the view is free anyway!", "title": "This place is horrible", "helpfulness": 1, "user": "jon s", "date": "March 21, 2013", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 155296734}, {"rating": 4.0, "title": "Great views, good lunch", "text": "After a decent stroll to The Worm and then the length of the beach, we stopped for lunch. Ciabattas and a pint of coke served by very polite staff. We sat outside overlooking one of the best views in the world which helps improve most things, extra point for this.", "user": "resident_nobody", "date": "March 21, 2013", "id": 155258828}, {"rating": 2.0, "title": "Can`t keep their beer!", "text": "No complaints but at the end of the Gower, it is a bit \"choice of one\".", "helpfulness": 2, "user": "Nigel C", "date": "March 19, 2013", "detail_rating": {"value": 2.0, "service": 2.0}, "id": 155087299}, {"rating": 2.0, "stay_parameters": "Visited March 2013", "text": "We were here on sunday 17th March 2013, stopped off before our walk to Worms Head, 8 of us, 3 coffees, 3 teas, 1 hot chocolate, 1 pint of Tribute beer.", "title": "Stale bread, old salad but the view was good", "helpfulness": 1, "user": "S S", "date": "March 12, 2013", "detail_rating": {"value": 1.0, "service": 3.0}, "id": 154336333}, {"rating": 1.0, "title": "Fabulous view. Dreadful food.", "text": "We paid £3 to park our car in the car park next to the hotel while we had lunch.", "helpfulness": 1, "user": "markey z", "date": "May 3, 2013", "id": 159521659}, {"rating": 2.0, "stay_parameters": "Visited April 2013", "text": "The view of Rhossili Bay from the hotel restaurant is magnificent but be warned, the food is dire.", "title": "Stick to a quick drink and avoid the food", "user": "ukcmf", "date": "April 24, 2013", "detail_rating": {"value": 3.0, "service": 2.0}, "id": 158672889}, {"rating": 4.0, "title": "what a view", "text": "We ordered steak and ale pies at £8.95 a portion from the extensive menu.. We were each given a large white bowl of watery gravy with a few pieces of tough meat huddling at the bottom. Atop each bowl was a piece of puff pastry, burnt on the top and soggy underneath, luke warm under cooked chips and a spoonful of large, hard peas.", "user": "gill t", "date": "April 21, 2013", "id": 158378167}, {"rating": 5.0, "title": "Superb Food", "text": "There was discontented muttering from a table of 3 next to us and we noticed that most of the food was still on their plates when they left.", "user": "David E", "date": "April 19, 2013", "id": 158233864}, {"rating": 5.0, "stay_parameters": "Visited April 2013", "text": "My advice would be to take in the wonderful view over a drink but eat elsewhere.", "title": "Outstanding views - great for pub lunch", "user": "gowergirl_10", "date": "April 15, 2013", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 157824439}, {"rating": 1.0, "title": "Amazing views awful food and service", "text": "The views are amazing and that's about it. I had ordered a lasagne at first but had to send it back as there was no filling just about 8 sheets of over cooked pasta. So I decided to go for a prawn jacket potato instead, i have never tasted something so disgusting in my life. The potato was still raw, the filling consisted of about 3 tiny shrimps, not prawns as stated. Seriously who is making the meals in that kitchen!!! Its the worst meal I've ever tasted. Avoid at all costs.", "user": "brighty914", "date": "April 14, 2013", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 157713980}, {"rating": 4.0, "stay_parameters": "Visited April 2013", "text": "We had such a great lunch here, food not brilliant but ok, service was friendly, open fire welcoming, view and beer excellent. I had whitebait and hake, both good not great but frankly with that view and reasonable prices, I was pleased.", "title": "What a great location", "user": "madderBrighton", "date": "April 13, 2013", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 157637002}, {"rating": 5.0, "stay_parameters": "Visited April 2013", "text": "After a long and beautiful walk, we decided to stop off for a bite and a pint with our dog. Seating for dogs is only permitted outside (not a problem if the weather is good but it would be great if well behaved dogs were allowed in the bar area). Katie looked after us brilliantly with our food which was served very quickly indeed. Well worth a visit.", "title": "Amazing view, even better service", "user": "R_I_G_G_A_L_L_76", "date": "April 9, 2013", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 157235567}, {"rating": 5.0, "title": "A Warm Welcome", "text": "After braving the elements there's nothing more welcoming than walking into the Worm's Head Pub and Restaurant and sampling some of the mouth watering dishes on offer.", "user": "Lydia S", "date": "April 9, 2013", "id": 157197047}, {"rating": 1.0, "stay_parameters": "Visited March 2013", "text": "No matter how busy it is you're never kept waiting for long,The mussells are extremely nice along with the local ales.", "title": "only good thing is the view", "helpfulness": 1, "user": "John A", "date": "April 9, 2013", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 157179118}, {"rating": 4.0, "title": "Fabulous location", "text": "We had lunch here sitting outside with a simply fantastic view. The food is good pub food, reasonably priced and service was very prompt. We certainly enjoyed our scampi and chips whilst sipping a pint of cider and soaking up the sun and views.", "helpfulness": 1, "user": "Gemima", "date": "June 2, 2013", "id": 162764505}, {"rating": 3.0, "title": "Lunch", "text": "We were very disappointed as we had been here before but it seems very neglected now. It is very tired looking and the lunch panini was less than average.", "helpfulness": 1, "user": "Gloucestershire_12", "date": "May 31, 2013", "id": 162517278}, {"rating": 4.0, "title": "Good food", "text": "We had lunch in between coastal walks and the food was OK, but the view was great and it's in a stunning location. Worth parking in the car park and using the hotel as your 'base'.", "user": "Kathyface", "date": "May 27, 2013", "id": 161993385}, {"rating": 4.0, "title": "excellent view", "text": "the view is just amazing. food is just above the average for a pub.", "user": "Peter_Fonseca", "date": "May 19, 2013", "id": 161172947}, {"rating": 1.0, "stay_parameters": "Visited May 2013", "text": "maybe a bit expensive for what you get but not enough to put you off. recommend", "title": "Lovely Area, Great Views, Terrible Bar & Bad Attitude.", "user": "I-Ziggy-Zumba", "date": "May 14, 2013", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 160712133}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 12, "average": 13, "very good": 17, "terrible": 14, "excellent": 15}}