{"user_rating": 4.5, "review_count": 246, "name": "Wyndham La Belle Maison", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "My husband and I along with my mother stayed in a one bedroom unit. The unit would have been fine for my husband and I alone but I would not recommend other adults to stay in the unit besides the couple. Possibly a young child would be ok but not older children who needed privacy. The bedroom had french doors with blinds between the bedroom and the livingroom/kitchen area. The bathroom had a door from the livingroom/kitchen area but also had a pocket door into the bedroom. The pocket door was impossible to lock unless you got onto the floor and held the door in place with one hand under it and lined the lock up with the slot in the side of the wall and turned the knob with the other hand. If in the bedroom you had to do the same thing but you could not turn the knob on the door to lock the door as there was no knob on the bedroom side of the door. We used a dime in the slot opposite the door knob in the bedroom to turn the lock on the pocket door from the bedroom side. You could hear everything from any room in the unit regardless if doors were shut or not.", "title": "First time visit to NO, not impressed as Wyndham owners", "helpfulness": 2, "user": "crcope1", "date": "November 7, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 144887502}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "We have owned timeshares for more than 10 years and have traveled most years at least 2 different weeks and have stayed in many different timeshares. We own a Wyndham property. This property cost us more points than any other place I believe we have ever stayed and I am less impressed than any other property we have ever been to. So if you are use to Wyndham timeshares or other timeshares that are gold crown or similar status you may feel that same as I about this property. It is clean and well maintained but nothing special about it. Although there is a mini kitchen there is no hot plate or stove top. There is a microwave and a dishwasher and although the refrig is a full size it is small. The pool is not really a pool but more a wading pool. The room also has no windows. As a previously review indicated you may not feel this is a big deal but after being here a couple of days you start losing track of the time and if the sun is out or is it raining. About half way throught the week construction started at about 6 am and went on and off all day long. Although the front desk said it is in a connecting building and it was not suppose to begin unitl 7 am, this is still too early while on vacation. The wall behind the bed was actually vibrating due to the electric saws and hammering going on. This went on the rest of the week. It is almost 7 pm as I write this review and there is still hammering going on at this time. .", "title": "Beautiful Hotel", "user": "GigiFoxx", "date": "October 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 143779748}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "As the front desk was very happy to tell us the porperty ranked #1 on trip advisor. Since this is our first stay in the New Orleans, I have nothing to compare with other units in New Orleans but I can compare with other experiences at other timeshare properties. I would by no means rate this as #1 or and considering the cost of the unit and what we got I would not even rank it in the top 10 timeshare units we have stayed in across the country.", "title": "Just \"OK\"", "helpfulness": 2, "user": "crcope1", "date": "October 13, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 142723402}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "I shared a one-bedroom unit with 2 girlfriends. The room was huge, it was in a great location, and everything was immaculate. This is a timeshare resort so daily room service wasn't provided. We had a small kitchen with a full-size refrigerator, microwave, and dishwasher. There was ample kitchen supplies, a coffee maker, and other small appliances such as a blender. The room was plenty big for more than 3 people. Although we had a window, the view wasn't that great, but we weren't in the room that much anyway. Harrah's and the Riverwalk is about 2 blocks away and it's a short walk to Canal St and on to the French Quarter.", "title": "More than I expected!", "helpfulness": 2, "user": "intangibleve", "date": "October 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142653637}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We stayed at this hotel as guests of friends who are owners in the timeshare program with Wyndham. Upon arrival, everything was very nice. WE stayed in the 2 bedroom suite. The rooms were clean and well appointed and the location of hotel is great. However, we all found the room itself to be very closed in, as there are NO windows or balconies. It doesn't sound so bad, but if you stay there more than a couple of days, you find yourself losing complete track of day or night. Also, our room (209) was directly next to the service elevator which was constantly running back and fourth starting very early in the morning. It was very loud too. In fact a couple of times we thought we were having a thunderstorm and it woke us up out of a sound sleep - which doesn't make for happy people after a night of drinking in the French Quarter! If I were to ever go to NO again, I wouldn't stay at this hotel again, simply for the fact that there were no signs of life outside the 4 walls. We didn't think to ask if there were any windows because we have never stayed at a hotel that didn't have them, so you may want to consider this if you are planning a stay. Or, make sure you ask for one. We tried to switch rooms but they said they were all booked up. The people that work there for the most part were very courteous although we were treated rudely a few times. Like I said, it is in a good location and close to everything. Recommendation for breakfast or lunch - a place called The Commerce right around the corner. Its a little \"greasy spoon\" type of place with amazing food and wonderful service. We felt at home there and went there every day for breakfast once discovered. Everyone talks about Mother's for breakfast...seriously save your money and aggravation. Mother's is FILTHY, expensive and the service is horrendous. Not to mention you have to wait in line for all that? The food was delicious but we will never go back due to the rudeness of the employees and filth. A few other places we went for dinner that were exceptional were The Red Fish Grill, The Oceania and a place recommended by a friend, Capdeville. The Ruby Slipper across the street was a good place too. One thing to remember when you are down there: You will see people riding around in these cool little 2-seater dune-buggy looking cars...we rented them and to put it nicely, they are CRAP! We rented 2 and went on our way. Not even 15 minutes later, one of the broke down and they had to bring out another one. Then after about a half hour, ours started bucking as if it was going to stall and then the steering went. They OBVIOUSLY do not maintain these vehicles and didn't even bother fixing all the broken seat belts. I can't imagine how these things passed any type of inspection for driving on the road, as they are VERY dangerous. Its a complete \"Mickey Mouse operation\" as well. Save your money and go out on one of the fan boats to see the gators. That was money well spent.", "title": "Close to everything", "helpfulness": 1, "user": "RichardOakRidge", "date": "October 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 142344800}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "What a fantastic boutique property. Our room was pristine, and huge! We were visiting the city for our wedding, and stayed at La Belle Maison for a week. Our 1BR suite was large, even by timeshare standards. We regularly had 4 or 5 guests visiting, and I even hosted 10 ladies for lunch, with plenty of room to spare. The front desk and especially the bellmen were so warm and friendly, greeting us on our way in and out, and even helped me to unload groceries. The location of the hotel great if you want to be close but not on Bourbon street.", "title": "Wonderful hospitality in fantastic accomodations", "helpfulness": 1, "user": "2ticketstoparadise", "date": "December 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146851673}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "Just returned home from a week at this wonderful resort. I work in Hospitality and recognize excellent service. Every person we encountered from the front desk to housekeepers were incredibly pleasant. Whether you want restaurant recommendations or a taxi; they are at your service! There is construction in and around the resort, but La Belle Maison is convenient to the trolley line to the French Quarter, to Harrah's to downtown eateries and many other locations. I know there have been other comments about no windows in many of the rooms. At first I found that a little difficult (especially with the recent time change), but it was actually very relaxing as I didn't have anything to tell me to get up unless I set the alarm! There was also early construction within the resort that let me know it was time to put the coffee on....but none of it was overly annoying. I was on vacation and in New Orleans in an incredible resort....what more could we want? Oh wait......the beds and pillows are so comfortable you want to take them home! Ask the front desk or the concierge to recommend restaurants and you won't be disappointed! Deanie's and Dragos' were awesome! The Ruby Slipper across Magazine St. is very convenient for breakfast. I love New Orleans and I highly recommend La Belle Maison", "title": "Incredible property, wonderful city!", "helpfulness": 1, "user": "jak1248", "date": "November 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145777171}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "We stayed twice in a span of 2 weeks in a 2 bedroom suite. The room was very nice but the lack of a window to the outside was a little strange. The couch was was old and ratty and the front room was not well laid out. The people on the couch could not see the tv. The beds are the most comfortable I have ever sleep on period! The staff are very good especially Albert in the garage. He was always there with a suggestion for dinner or a place to go for a drink. I will be back every chance we get.", "title": "Very nice property", "user": "jemaher1959", "date": "November 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 145559411}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "This is the 4th timeshare property we have stayed at in New Orleans, but it is by far the best. We got a 2-bedroom condo for our week-long stay, and it was huge, well-stocked and very comfortable. Our only complaint was that there was no stove, but that is ok. The kitchenette had a microwave and refrigerator. The beds were comfortable. The staff was gracious, knowledgeable and helpful. Every time we needed something brought to the room (towels, toilet paper, etc) it was brought promptly.", "title": "Perfect location, wonderful room", "helpfulness": 2, "user": "isilwath", "date": "November 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145532450}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The location is only 1/2 block from Canal St and the French Quarter. You can walk everywhere, and you are only 2 blocks from the St. Charles streetcar lines.", "title": "Gorgeously Appointed Unit!", "helpfulness": 1, "user": "nadineVa", "date": "November 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 145344637}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "This property is 1 block from Canal St and 3 short blocks from Bourbon. The staff is very attentive and quick with suggestions and ideas for touring the sites to see and local \"Jazz & Eats\". The rooms are very nice and quite large. For breakfast, go across the street to the Red Slipper; you won't be disappointed. Oh, try the Bloody Mary's !! Don't miss the WW II museum; time well spent.", "title": "Charming little hotel in the Quarter", "helpfulness": 4, "user": "Goyito W", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141087328}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The hotel appeared to have been remodeled from whatever it was in years past and the conversion was beautiful. The rooms were spacious, clean and full of character. The only disappointment was the swimming pool. It appeared to be little more than a fountain no more than 3 feet deep and approximately 6' X 8'. The pictures of the rooms found on the Wyndham website do not show the true character of the hotel. They are much more beautiful and spacious than what was shown in the pictures. The location of the hotel was very close to the French Quarter and within walking distance to many of the tourist attractions and restaurants. Because this was a timeshare, there was no maid service until the weekend. Additionally, we had to ask for fresh towels as none were provided on a daily basis.", "title": "New Orleans Live", "helpfulness": 2, "user": "Marie T", "date": "September 14, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 140213111}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We just returned from a wonderful weekend spent at LaBelle Maison in NOLA. We are timeshare owners at this location, but this was our first experience there. This location is one of the finer ones in the Wyndham collection based on our 5 years experience with Wyndham. It is a fairly new timeshare, having been an historic building renovation completed in 2008. The rooms were very clean and well-appointed. We stayed in a large two-bedroom (room 503) that had a window view out onto Magazine Street. Any room ending in \"3\" on any floor would most likely have a window since they would all be in the same corner of the building. I must say that this room was nice and secluded off in a corner of the floor. Most of the rooms in this building do not have windows. Having a window view in this building I would not consider a major issue--I don't think there is very much to view because of the location, plus you hear street noise at night.", "title": "Wonderful Weekend Getaway!", "helpfulness": 4, "user": "CajunCountryBR", "date": "August 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138901109}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "As noted by other reviewers, the location is prime!!! You are so close to everything you would want to do in NOLA that you can walk to it all--French Quarter, Riverwalk, Casino, Convention Center, Cruise Terminal. Also, there is a city bus that runs every 15 minutes up and down Magazine that one can catch and go to Audubon Zoo, shopping down Magazine St., dining down Magazine St. and it even stops at the WWII Museum even tho that is in walking distance from LaBelle. In fact, WWII Museum is just 6 blocks--easy walk--even for us senior citizens! You can buy a bus day pass ($3) and get on and off as much as you like as you come and go down Magazine.", "title": "Great holiday", "helpfulness": 6, "user": "Pippa P", "date": "August 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137019270}, {"rating": 5.0, "title": "Perfect location", "text": "A block away is Canal Street where you can catch the trolley that goes down St. Charles into the Garden District. There are restaurants all around--so many to choose from. Dickie Brennan's Palace Cafe on Canal, Ruby Slipper across the street for a sumptuous breakfast, and I could go on.", "helpfulness": 6, "user": "ladielisa", "date": "August 12, 2012", "id": 136983143}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We had high hopes for this hotel but it didn't work out.We checked in and found the room large and looked alright ,a bit old fashioned.We really didn't know what was going to happen untill that night.The bed was a nightmare .it was hard as a rock and it made all these kinds of crackling sounds everytime you moved.The room number was 511.So the next morning I asked very nicely if we could move for our second night.The man was very nice and told us we could to check back at 2pm.At 2pm he told us to check back at 3pm.At 3pm he did give us a room but he didn't seem happy anymore.I carried my suit and my wifes dress and coat very far to room 321 only to find the key did not work.Oh my god.Went back down and got new keys and they did work,different man .Well everything was looking up,the room looked better and it had a king bed instead of a full.We needed a nap because we were going to a New Years party that night and didn't sleep the night before.Well we got another surprise .car horns kept blowing over and over and over,for hours.The party that night was awesome at Jax Brewery and we came back around 2am to go to sleep and to wake up at daybreak from blowing horns.Come to find out it was our hotel blowing the horns when they pull out the hotel onto Magazine street because they can't see people on the sidewalk.Never will stay here again...........", "title": "Nightmare on Magazine Street", "user": "harleybonz", "date": "January 3, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 148715605}, {"rating": 4.0, "title": "Perfect for a New Orleans Christmas.", "text": "I would recommend La Belle to anyone visiting New Orleans single or with a family. I am from south Louisiana and frequently visit New Orleans. We really liked the location it is walking distance to many New Orleans destinations. We walked to the Aquarium and the Insectarium. Both nice family places for the kiddos. If you don't want to walk to the French Market hop on a trolley by the river. The passes can be bought at a store across the street from the resort. Three dollars a day and you are n your way.", "user": "dularge01", "date": "December 30, 2012", "id": 148402698}, {"rating": 5.0, "title": "Location location location", "text": "The rooms were very spacious and clean. We were on the 7th floor and we had windows. It was a beautiful view. We could see the river.", "helpfulness": 1, "user": "Alan S", "date": "December 28, 2012", "id": 148210219}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "New Orleans is special, but even more so during Christmas. It's a tradition to spend some time there during Christmas, maybe we will add La Belle Maison to the list. We will definitely be back.", "title": "Just a pretty face", "helpfulness": 1, "user": "LHS329", "date": "December 26, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 148066643}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We had a great stay here over Xmas. We had 3 rooms and were very satisfied. This isn't about amenities, it is about the location. Very close to many of the attractions of N.O. Units are large and very quiet. Restaurants are nearby and plentiful. Concierge was very helpful. You can't go wrong staying here on a trip to New Orleans", "title": "Disappointed stay at resort !!!!", "helpfulness": 1, "user": "Mads1962", "date": "December 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 147746844}], "location": {"country": "United States", "city": "New Orleans"}, "variance": {"poor": 1, "average": 18, "very good": 62, "terrible": 3, "excellent": 162}, "aka": "Wyndham La Belle Maison Hotel", "slim_ranking": 0.105263157895}