{"user_rating": 3.5, "review_count": 849, "name": "Wyndham Boston Beacon Hill", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "My husband and I just returned from a weekend in Boston. Our stay at the Holiday Inn Govt Center was a pleasant surprise. It's located close to Charles St (lots of antique shops) and 2 or 3 blocks from the Govt Center T stop. Also right next door to a Whole Foods, which really came in handy. The room itself was small but more than adequate, with a fridge, a view of the Charles River, and most importantly, a bed with cotton linens and good pillows. Another review mentioned sirens but even tho the hotel is near Mass General, we never heard an ambulance, just the very occasional police siren. The room was quiet. I rarely sleep well in hotels but slept great here. The staff was helpful and friendly. Due to the high cost of parking ($36 per day- our only complaint) we parked outside the city and took the T in. We booked this on Priceline for $125 a night- a bargain.", "title": "Surprisingly Good", "helpfulness": 3, "user": "sacharama", "date": "July 25, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5508926}, {"rating": 4.0, "title": "Great Location", "text": "We stayed for 3 days for pleasure with our kids and loved the location. Within short walking distance to everything. We only used the subway to get to Fenway park and Harvard, otherwise we walked. We also used the water taxi from the USS Constitution back to the Faneuil Hall Marketplace area for only $1.50. There is a bakery on the corner and a Starbucks across the street from the hotel. There is also a Whole Foods market and a CVS pharmacy right out the back doors of the hotel. I would recommend requesting a high floor (10 and up) facing Blossom street which gives you a nice view of the Charles river. Staff was great and very helpful!! We would definitely stay here again!", "helpfulness": 5, "user": "cheryl4books", "date": "July 11, 2006", "id": 5457602}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "The hotel itself I thought was average, but the staff were outstanding, the location was very good and the room was quiet. Each night the rooms around us were full and I rarely heard my neighbors. Beds were a bit hard though.", "title": "Enjoyable Stay", "helpfulness": 3, "user": "gizm0sm0m", "date": "July 8, 2006", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 5441387}, {"rating": 5.0, "title": "A Great Hotel and great Location", "text": "One morning we came down for breakfast in the restaurant and the hostess was busy but another hotel employee saw us waiting to be seated and promptly showed us a table and brought us menus even though it clearly wasn't his job to do so. That is the type of service we received from all of the staff and it is what made out stay above average.", "helpfulness": 5, "user": "wallcova", "date": "June 16, 2006", "id": 5352806}, {"rating": 5.0, "title": "Great stay and value", "text": "We took the \"T\" between the Airport and the Hotel. On the way in we took the Silver Line to the South Station, transferring to the Red Line to the Charles/MGH Station and on the way back to the airport we took the Blue Line from Government Centre to the Airport Station and caught the Airport Shuttle. Either way is quick and efficient and at $1.25 you can't go wrong.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "May 18, 2006", "id": 5149112}, {"rating": 4.0, "title": "Great location, average hotel, friendly", "text": "My husband and I stayed here with our three year old. We were relocating to Boston and had to stay in a hotel for 4 nights until our apartment was ready. We were originally meant to stay at the Bulfinch hotel around the corner, but took one look at the tiny room and said no way!", "user": "dec-ben", "date": "August 18, 2006", "id": 5623649}, {"rating": 4.0, "title": "Good location and price", "text": "The holiday Inn is in a very good location for seeing Boston. The subway is close by, Government center and Fanueill Hall are all walking distance away. There are great restaurants across the street and Boston Common is a short walk away. The hotel is beside MGH and some families and patients stay at the hotel during their treatment. Our room was on the executive floor. The room had a kingsize bed which was comfortable and we had a roll away for our 3 year old.The room was clean with a small bathroom and a fridge in the bedroom. No safe in the room but free internet access. There is a free safe deposit box at reception if you need it. Our room overlooked the car park for Whole Foods and CVS pharmacy which meant we had no street noise. There is a back entrance to the hotel which meant access to the supermarket was very quick and easy. Our rate included breakfast which was pretty good every morning. Our three year old ate free for breakfast. The staff were very friendly and helpful a real asset to the hotel. We never had lunch or dinner there as there were so many good restaurants in the area. I would not recommend breakfast in the executive room. The room is very small and breakfast was only really muffins tea, coffee and juice, better to go to the main restaurant and have more choice.", "user": "JHROrange", "date": "August 17, 2006", "id": 5620845}, {"rating": 4.0, "title": "Nice hotel", "text": "There was a heated outdoor pool with lifeguard which we used a lot. There seemed to be a lot of chlorine in the pool and our 3 year old always had very red eyes after swimming there. The pool was quite deep 4ft-9ft, but life guard was always there. The fitness center was small but adequate. There is also a coin operated washing machine and dryer in the hotel for $1 a machine use. All in all a good place to stay, basic rooms, nice staff, great location.", "user": "BMichal", "date": "July 30, 2006", "id": 5529685}, {"rating": 3.0, "title": "could do wit refurbishment", "text": "Boston is an expensive city that I love to visit! The Holiday Inn Government Center is a perfectly adequate hotel, but nothing overly special. However, both the price and location are ideal.", "user": "Jake36", "date": "July 25, 2006", "id": 5510658}, {"rating": 4.0, "title": "Value for money, excellent service", "text": "We usually stay at Embassy Suites, but decided to give the Holiday Inn a try since this hotel is within walking distance of every possible attraction in Boston. With magnificent views of the river and city and a great little restaurant/pub downstairs, the hotel is a must for visitors who want to save money on taxi fares or the dreaded fee when coming into the city via the \"tunnel\".", "user": "Waltersabroad", "date": "April 16, 2007", "id": 7368779}, {"rating": 2.0, "title": "Mediocre & under renovation", "text": "It is also located next door to the Charles River shopping centre where you can buy fresh, organic food as well as a pharmacy and both stays open until well after 10 pm. It is also safe. We walked from downtown Boston back to the hotel after 11pm and felt quite safe doing so.", "user": "TeaEarleGreyHot", "date": "January 11, 2007", "id": 6577226}, {"rating": 4.0, "title": "Centrally Located", "text": "One point I have to raise though: The hotel is currently undergoing renovations. These tend to start at about 5 am and even on the 11th floor - we could hear the trucks reversing. This was rather annoying as it sounded like an alarm ringing - just the beeping of the trucks' warning system. However, you hardly notice the renovations inside the hotel.", "user": "MCPO-USN-2011", "date": "November 28, 2006", "id": 6185803}, {"rating": 3.0, "title": "Room is quite nice for a Holiday Inn but could easily hear people next door", "text": "I've stayed here twice, first in June '06, and again in Jan '07. While this review is specifically for the Jan '07 stay, both stays were comparable, Fri+Sat nights, and both were at a nightly rate of $55 via an opaque, prepaid, online booking service (I named my own price).", "user": "gottagosomewhere", "date": "November 25, 2006", "id": 6175267}, {"rating": 3.0, "title": "medium", "text": "The hotel's own website states: \" Please note the hotel will be undergoing renovations from Nov. 1, 2006 until Mar. 30, 2007.\"", "user": "ezpass", "date": "November 3, 2006", "id": 6051334}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "We stayed at the Holiday Inn Select on Blossom Street for four nights this past very rainy weekend. The hotel is located in a safe area near Massachusetts General Hospital. Some of the guests seem to be patients and their families. The hotel and room were nice, very clean, and the staff was pleasant. This hotel is within a 15-minute walk of the Museum of Science in one direction and a 15-minute to government center and the North End (with all of the great Italian Restaurants). There is a small lobby and a restaurant onsite. I did not eat at the restaurant since Boston has so many fabulous restaurants. My only complaint was at $36 per day, parking was expensive. The hotel is close to the T (the subway trains). We went all over the city using the subway, which is easy to use. I would definitely stay at this hotel again. This was a celebration weekend for my daughter who was graduating from Boston University. Over the weekend, we ate at three great restaurants. These three great restaurants were Carmen’s (Italian.) on North Street in the North End (a small place that was very romantic with excellent food), Bob’s Southern Bistro on Columbus Ave in the South End (Soul food with great friendly service with good ribs, excellent jambalaya, excellent corn muffins and other southern food). Bob’s Southern Bistro has live Jazz that was good but a bit noisy since we were two tables up from the stage. (Next time, I will ask for a table closer to the door). It was a good place for a big group and the prices here are very reasonable. There was a $ 5 per person cover charge added for the Jazz. Our big, special dinner was at the Elephant Wok on Beacon Street in Alston. This restaurant was amazing, there were several big groups of 10-14 people (all of the graduates and their families) that the restaurant was serving and they managed to give excellent service. The food is upscale Cambodian and French. The food was excellent.", "title": "A good hotel", "helpfulness": 6, "user": "nursespark", "date": "May 15, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5077971}, {"rating": 3.0, "stay_parameters": "Stayed March 2006", "text": "In general, this hotel is OK - the price is not bad (though the rooms are not really big), but the service was, well, average.", "title": "OK, but not more...", "helpfulness": 5, "user": "MaxHuber", "date": "April 26, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 2.0}, "id": 5010109}, {"rating": 4.0, "stay_parameters": "Stayed July 2004, traveled on business", "text": "If you wanted something out of the standard procedure, they were very confused. E.g., I had forgotten a shaver and phoned the reception whether they had a replacement. The lady taking my call reacted almost as if she was overwhelmed by my request but promised to look into it. About 20 minutes (!) later, my shaver arrived.", "title": "Very nice hotel", "helpfulness": 6, "user": "Buckie112", "date": "February 24, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 4499850}, {"rating": 3.0, "title": "Kind of Shady, but overall Okay", "text": "Also, our rate included a continental breakfast, with an emphasis on \"a\". We were two people, AND we had asked in the evening whether we would get breakfast in the morning, which was affirmed cheerfully. However, in the morning we were informed that we would get only one (!) breakfast. Which is fine, if that's the rate, but rather annoying and it added to the overall picture of a slightly disoriented and ill-led staff.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "February 7, 2006", "id": 4443583}, {"rating": 3.0, "stay_parameters": "Stayed February 2005", "text": "But, on the other hand, the location is great, the rooms are nice, the bathroom is clean and well equipped, so overall it is an OK hotel.", "title": "Overall, not too bad.", "helpfulness": 6, "user": "maxmuscle03843", "date": "February 6, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4418352}, {"rating": 4.0, "title": "Good base for exploring", "text": "Boston is quite a small city so this hotel is handy for most areas of interest. The hotel has recently completed a refurbishment. Our room was nice and clean with plenty of space although the furniture was obviously pre-refurb as it was scuffed and tatty. The hotel is located near to Mass General Hospital and although we heard no ambulance noise expect to meet relatives of patients in the hotel comparing spouse/family symptoms...Nice hotel, OK location, friendly staff and OK value for money.", "user": "Wanzebra2", "date": "May 26, 2007", "id": 7700545}, {"rating": 4.0, "title": "Decent hotel in a good location", "text": "This Holiday Inn Select was fine, although nothing special. We reserved a standard room and were upgraded to a room on the executive (12th) floor, because of my Priority Club membership. That got us what I would describe as a decent room, but again nothing particularly noteworthy. The view was nice, and everything in the room was clean and reasonably modern. There was no in-room safe, which was the only real flaw.", "user": "TorontoTim", "date": "May 22, 2007", "id": 7672513}, {"rating": 4.0, "title": "Would stay again...at Hotwire rate!", "text": "There is an executive lounge on the 12th floor, although it really didn't seem to offer any benefit except a small microwave.", "user": "TravelAways", "date": "May 1, 2007", "id": 7489724}, {"rating": 2.0, "title": "What renovations?", "text": "Our room rate included a complimentary continental breakfast in the ground floor restaurant. We poked our nose in there on the first morning but the buffet looked fairly unappetizing so we went elsewhere.", "user": "Kcz", "date": "April 26, 2007", "id": 7444769}, {"rating": 4.0, "title": "Great Location, clean, helpful, Top place to stay", "text": "There was a notice posted in the elevator saying that the hotel is undergoing a five-month, very thorough, renovation. We saw no evidence of that, so it may be just beginning, or it may be on floors that we did not see, which is entirely possible. It does suggest, though, that if you're reserving a room, it would be wise to check and see to what extent that construction might affect your stay (i.e. noise, dust, etc.).", "user": "carinabramley", "date": "April 20, 2007", "id": 7403935}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "Had 3 great nights at the HI Select in Boston. Staff at check-in was quite friendly. Booked through easyclicktravel and got the requested 2-bed-room. Was expecting 2 doubles, but when I mentioned my Priority Club No., we got upgraded to the Priority Club floor with 2 queens in the room. The guy at the check-in even gave us coupons for free continental breakfast every morning - really nice!", "title": "wonderful time", "helpfulness": 12, "user": "ghostwriter_min", "date": "November 3, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4084196}, {"rating": 3.0, "stay_parameters": "Stayed October 2005", "text": "The rooms had a good size, were cozy and absolutely clean!", "title": "great hotel good location", "helpfulness": 17, "user": "karenanne", "date": "October 22, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 4044077}, {"rating": 2.0, "stay_parameters": "Stayed September 2005", "text": "If you don`t mind a little walking you barely have to use the T. Faneuil Hall, Downtown, North End, TD Banknorth Garden, the Freedom Trail and much more are in walking distance. But there are also 2 T-Stations close by!", "title": "Decent but not the best", "helpfulness": 16, "user": "siouxzy", "date": "October 10, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 1.0}, "id": 4005007}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "Overall we had 3 great days in Boston and the HI Select Government Center!", "title": "It's ok, very good location", "helpfulness": 12, "user": "anonima", "date": "August 12, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 3756916}, {"rating": 3.0, "stay_parameters": "Stayed July 2005", "text": "Having read some of the reviews on this hotel after we booked our holiday we visited it with a little concern. We need not have worried the rooms were spotless clean, the staff most pleasant and helpful and the location was good. the restaurant was a little pricey but nice, but a better idea for breakfast is to cross the road to a little Italian cafe which serves first class meals and sandwiches. Our only concern was the trolley tour booked in the hotel we paid $30 dollars a head (there were six of us)we found it to be a complete waste of money there is a lot of construcion work going on in and around Boston at this time and we felt that the tour was like a busmans holiday for one of our party who works in the construction industry, my advice would be to get out and walk you soon find your bearings and you miss out most of the ongoing work. One bit of advice take the time to visit Salem a great day out very historical and interesting use the public transport very easy and a fraction of the price of an arranged tour, while there visit REDS cafe just down from the trolley stop easily has to be the best food and value for money in Massachuettes.", "title": "Only if you can get a great price", "helpfulness": 10, "user": "7225", "date": "July 27, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3702416}, {"rating": 3.0, "title": "I know that we can't complain because we booked on Hotwire, but ...", "text": "The front desk night manager who checked us in was friendly, but when a couple arrives for check-in and you realize you've put them into a room with two double beds, it would be nice to acknowledge that before they go upstairs - whether or not you can do them the courtesy of moving to a room with a larger bed. If the hotel hadn't been charging over $350.00 for the room (worth half of that), we would have booked directly through them. It was disheartening to spend three nights in seperate beds which we've never had to do before. As it was, we still paid a lot through Hotwire. It felt a little like we were punished for booking through Hotwire and they have been made aware.", "user": "VegTrav", "date": "October 29, 2006", "id": 6025131}, {"rating": 5.0, "title": "Great location!!", "text": "Other than this, service was very good and the proximity to Whole Foods, which was outside our window, was FANTASTIC. It's the best Whole Foods I've been to - shames the San Diego stores.", "user": "pmonachina", "date": "October 3, 2006", "id": 5905375}, {"rating": 2.0, "title": "Good hotel but with problems", "text": "Pros: Clean Room, Good shower, Friendly front desk staff, Quiet location, Whole Foods is in the back parking lot, Cabs readily available, fairly central location", "user": "sentry4500", "date": "September 25, 2006", "id": 5834736}, {"rating": 4.0, "title": "Best price in Boston for a 3-star", "text": "Cons: Hard Beds - my husband really didn't sleep the three nights we were there. Broken Shower - switch to turn from bath to shower wasn't attached to anything. Housekeeping had it fixed in 35 minutes. The gentleman that came up was friendly and professional. We were late for an appointment because of this, however. Seems like this should have been noted prior to our arrival.", "user": "Kinnereth", "date": "August 23, 2006", "id": 5702769}, {"rating": 4.0, "title": "Great Location, Great for Family", "text": "Stayed here in August. Within walking distance to everywhere especially the North End. Quality restaurants are nearby also. The hotel staff was very helpful and friendly. The rooms were very clean and the bed comfortable. Great place to stay if your have someone at Mass General Hospital- it is a block away. I will stay there again on my next trip to Boston!", "user": "Megala", "date": "August 20, 2006", "id": 5630484}], "location": {"country": "United States", "city": "Boston"}, "stars": 3, "variance": {"poor": 64, "average": 217, "very good": 376, "terrible": 27, "excellent": 165}, "aka": "Holiday Inn Boston At Beacon Hill Hotel Boston", "slim_ranking": 0.701298701299, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "The Holiday Inn Boston at Beacon Hill, the finest in downtown Boston hotels, is perfectly situated at the base of Beacon Hill, the city's most historic neighborhood. Stay in touch at our Boston airport hotel with complimentary high-speed Internet access in all guest rooms. For delicious dining, our Boston lodging offers Foster's Bar & Grill, a standout option among Beacon Hill restaurants. Host your event or meeting at one of the best hotels in Boston, featuring 5,800 square feet of function space. Enjoy our newly-renovated Beacon Hill hotel's close proximity to attractions and historic sights. Watch the Bruins or the Celtics at TD Banknorth Garden and head to Faneuil Hall/Quincy Market for unique shopping. As one of the most ideally-located of Beacon Hill hotels near TD Banknorth Garden, we are a short walk to the Financial District, Massachusetts General Hospital and Boston Shriners Hospital. With two MBTA subway stops nearby, the city is easily accessible. Take the Green Line to visit Fenway Park or the Red Line to Harvard Square. Be sure to check our Boston hotel deals for premium savings."}