{"user_rating": 4.0, "review_count": 639, "name": "Wyndham Garden Austin", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "My husband and I stayed at the Wyndham Garden Hotel in Austin to celebrate his birthday and our anniversary. This was my second time to stay here and it was just as great as the first. From the moment we walked in the door to the time we checked out, everyone was friendly, welcoming, and professional. It's the friendliest place we have ever stayed - all the staff, including the housekeepers and the maintenance staff, greeted us and wished us a good day. Customer service seems to be king here - we observed the front desk staff and a manager (?) going out of their way to assist guests who had a problem in their room. The restaurant is great, too. Everything we had was delicious (try the chocolate decadence cake!). The drinks at the bar were superb and the bartender offered us a tasting of a wonderful new liquor. Our room was spotless, the bedding was wonderful and there was absolutely no noise from anywhere - perfect for a great night's sleep. We definitely recommend the Wyndham Garden Hotel - you'll love it!", "title": "Wonderful place!", "user": "SusanD55", "date": "July 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133802306}, {"rating": 4.0, "stay_parameters": "Stayed July 2012", "text": "This hotel was very nice. The beds were very very comfortable! The pool and hot tub are very clean and fun! The restraunant is amazing!! The food is incredible! I would recommend this hotel 120%!!", "title": "This hotel is very very nice and friendly!", "helpfulness": 1, "user": "Horsehurl96", "date": "July 8, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 133753502}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "After booking this hotel I noticed it had a couple of poor reviews. Thankfully we experienced none of those problems.", "title": "Great price and clean, comfortable hotel", "user": "trigre", "date": "June 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 133009981}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "The Good - All the members of the hotel staff we encountered were nice and helpful, this includes the restaurant staff. The room was clean, really clean, not a speck of dust anywhere. The bed and linens were comfortable. Our room had a mini fridge and it really came in handy. There was a ton of work space and outlets and plenty of lamps and light. It had a large size flat screen television. The water pressure in the shower was wonderful. Most hotels have low flow shower heads. This one was one of the best I have come across in a hotel. The air conditioner worked great too. The hotel was decorated nice. They had pictures of many musicians from Texas in the lobby and restaurant. If you are a music lover, like we are, you would probably enjoy this feature. The pool area was very nice and the pool was large with a separate hot tub but we couldn't use the pool because it was very cloudy. We were there 4 days. Each day we checked the pool but it remained cloudy and almost always empty. The final night we were there they posted signs saying to pool would be closed for maintenance. On our way out on our last day we noticed people working on the pool and it was starting to clear up. There were a few other minor problems but nothing bad enough for us to report a problem to the staff. The biggest pain was the toilet. We had to flush it 2-4 times each time we used it. It was just a pain to have to stand there and flush time after time. There was a reclining chair in our room and it had a large (6-7 inch) tear in it. It was right on the front, at the top, of the chair. It was very noticeable. The chair was very comfortable but I am not sure why you would want a customer to walk into their room and see that. It was very tacky and took away from the rest of the room. The only other problem we had was the TV was supposed to have HBO but ours didn't. We called down to the front desk to make sure we had the right channel number. We also tried reprogramming the channels but we never got HBO. Like I said these were minor problems but it is only fair I mention them because it might be a big deal to a future customer. I would recommend this hotel to any of my friends and family.", "title": "2nd Visit: Prestay Customer Service A Bit Curt But Smoothed Out Upon Check-In", "user": "jvasuncion", "date": "June 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 132625006}, {"rating": 5.0, "title": "Great Hotel!", "text": "I was in Austin at an annual training conference which uses this hotel for participants. This was my second time staying here. Once I checked-in, staff were great (more on pre-check-in experience below). Casandra, pleasant throughout, saved the day, giving me a hand with a last-minute print-job when we encountered difficulty using the printer in the business center. Bar staff were great with our large group, in fact, one of the bartenders, Mickey I believe her name is, remembered me from a year earlier.", "helpfulness": 1, "user": "alyssabyoung", "date": "June 18, 2012", "id": 132245280}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "My only complaint about the hotel was the confusing thermostat in the room - it changed often on its own and we woke up through the night getting hot and cold. Most importantly, though, we received outstanding service from an employee at the coffee bar in the lobby. The employee, named JJ, was helpful beyond expectation, incredibly pleasant, and very observant and attentive to our needs. People like this enhance any travel experience and certainly make a hotel look great.", "title": "excellent help from employee", "user": "Eva B", "date": "May 21, 2012", "detail_rating": {"service": 5.0}, "id": 130345520}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "I enjoyed my stay at the Wyndham Garden Hotel. The best part of it was the employees. From the first employee to the last, everyone was a joy to work with. The hotel was clean and comfortable. Josh, the young man who ran the shuttle for us from the airport, was very friendly and knowledgeable about the area. He was a pleasure to meet. I will definitely return to this hotel the next time I am on business in the area.", "title": "Pleasant Employees", "user": "Susanne S", "date": "May 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130071669}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "A group of us stayed here for a wedding and it was clean and comfortable. The staff was kind and accommodating, especially Ruth on the nightshift who went out of her way to make our group feel welcome. Thank you Ruth for taking such good care of our group!", "title": "Comfortable and pleasant", "user": "ChantalMc", "date": "May 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 129983211}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "I traveled to Austin with a few friends of mine this past weekend to enjoy the nightlife this city has to offer. The hotel was extremely comfortable and clean. Also, the hotel staff members were nothing less than pleasant, friendly, and extremely helpful! The hotel is easily accessible from the interstate and close to many restaurants and city attractions. I was extremely pleased.", "title": "Above and Beyond", "user": "Brittany C", "date": "May 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129208586}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Besides being extremely pleased with the cleanliness and quality of the hotel stay, one of the team members went above and beyond to help me out. I had gone shopping earlier in the day and the store left the security tag WIRED to my shoe. I took my shoes and receipt to prove that I had bought them to the front desk and asked to borrow some scissors. After struggling with the tag for a while, I decided to give up. Josh, one of the hotel staff members, took my shoes and continued working on the wires. He eventually was able to clip the tag off of my shoe so that i could wear them out for the evening. Now that's what I call service. I would definitely stay there again.", "title": "Nice stay at a nice hotel", "user": "wanative57", "date": "April 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 128662299}, {"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "Austin can be hit or miss when picking a hotel. Especially the same chain can be vastly different in service and cleanliness.", "title": "Very happy with my choice.", "user": "Thomas T", "date": "June 16, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 132120817}, {"rating": 1.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "I have not stayed at this hotel before and good reviews lured me in. That technique doesnt always work, but I'm happy to say that this was a very pleasant stay. Friendly staff and overall nice designed lobby and undated (semi modern) rooms. Bathrooms are nice with granite counters.", "title": "TERRIBLE customer service with a side of COCKROACH!!!", "helpfulness": 1, "user": "veronica60956", "date": "June 12, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 131834005}, {"rating": 1.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Really nice decor and good bar and restaurant. Enjoyed our stay very much.", "title": "BEDBUGS found", "helpfulness": 3, "user": "Ruth E", "date": "June 3, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 131171013}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "This hotel has the worst customer service you can imagine!!! The manager on duty, Kasandra was ridiculosly rude! There was a mixup in my reservation that nobody is owning up to and I was charged twice for my room. I booked through Expedia so the hotel said it was their fault and Expedia said it was the hotel's fault. Expedia called and spoke with the hotel several times and at the end of the day apologized but said there was nothing they could do from their end because the hotel staff was absolutely not cooperating. So the trouble begins. When I personally confronted the manager asking what the deal was, I was assured that since I was still staying with them even after the mixup that when the supervisor came we would be compensated for the mixup. That turned out to be a big fat lie. After an entire weekend of back and forth I was informed 1 hour before checking out that sorry you're not getting anything back because we don't know if you were the one that made the reservation mistake. I showed them on their own policy where it states that even if that was the case, the reservation should have been cancelled and I should have only been charged for one nights stay, not the entire reservation. She then just says, \"It is none of my business...and you'll have to take it up with someone else\". What??? Am I on a different planet? Who on earth, particularly in the customer service industry, could be that rude.", "title": "Comfortable overall, nice pool area.", "helpfulness": 1, "user": "Senoritamua", "date": "June 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 131096360}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "To add insult to injury I found a DEAD COCKROACH in the bed (see pic), after I had already slept in the bed which clearly indicated they either didn't change the sheets or had an infestation of pests. Either way, it's disgusting and UNACCEPTABLE. When I showed her pictures of the roach her exact words were \"sorry about that\", with absolutely no action. Are you kidding me?", "title": "always enjoy staying here", "user": "gw91", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 130827127}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "The Wyndham was extremely comfortable. You have to drive every where and when you type in the address into GPS, it brings up two options. You have to select the one with South I-35 or you will get lost. Other than that, everyone had a pleasant stay.", "title": "Comfortable and Affordable", "user": "Emily B", "date": "April 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 128605601}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We loved our stay at the Wyndham Garden Hotel. Not only was it close to lots of restaurants, it's easy access to the interstate made it a great location for us. We upgraded to a suite, and we were so glad we did. The spacious unit offered a fold out couch plus a flat screen tv! The beds were very comfortable as well. The full service kitchen came complete with a dishwasher, very unusual in most hotel suites. Booking online through the hotel's website offered us even more of a discount, so the entire stay was very affordable.", "title": "Great spot for families", "user": "Cindy G", "date": "April 23, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128446017}, {"rating": 4.0, "stay_parameters": "Stayed April 2012", "text": "We stayed at this hotel during our overnight stay in Austin. We were a little hesitant considering some of the reviews, but decided to give it a try. Glad we did. The only bad incident we encountered was when we first arrived, the toilet did not flush. All it took was one call to the front desk & maintenance was up to the room shortly after. Toilet was fixed and our stay was without further incident. We would definitely stay here again.", "title": "Good hotel, great attentiveness!", "user": "johneric76", "date": "April 23, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 128406952}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "I loved the location and the facilities at this hotel. It was very clean and the service was very good.", "title": "Very Good", "user": "Avinash K", "date": "April 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127780844}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Stayed here one night while on a wknd getaway to Austin.", "title": "Good Location, Good Hotel", "user": "sj-jj-houston", "date": "April 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127459431}], "location": {"country": "United States", "city": "Austin"}, "stars": 3.5, "variance": {"poor": 50, "average": 101, "very good": 224, "terrible": 30, "excellent": 234}, "aka": "Wyndham Garden Hotel And Woodward Conference Center", "slim_ranking": 0.359116022099, "detail_rating": {"service": 4.5, "cleanliness": 4.0, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Just 3 miles from downtown Austin and 4 miles from the airport, the Wyndham Garden Hotel is a prime destination. Enjoy easy access to the city's high-energy music, sports, university, arts, and business districts while delighting in a backdrop of scenic Texas Hill Country. Wyndham has teamed with post-modernist design legend, Michael Graves, to create a refreshing hotel experience. The result: upscale but affordable Texas Hill Country accommodations with unique features and products for an unforgettable Austin getaway."}