{"user_rating": 4.0, "review_count": 162, "name": "Wyndham at Bentley Brook", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "We just returned from a stay here on Thursday. The only reason we went is because a friend had to use up her time share points by the end of the year. We rented 2 two bedroom suites, one for the adults and one for the children. They were generic small aparments with a small balcony. Ours overlooked the mountains (great view of all the novice skiers falling) the kids overlooked the parking lot, but they didn't care.", "title": "Nice, but not fabulous.", "helpfulness": 5, "user": "notu", "date": "December 22, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 11894933, "likes": {"liked": "— Close proximity to the Jiminy Peak Village and slopes - we could walk in less than 5 minutes.", "disliked": "— Dated furniture and substandard appliances."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "The suite itself had a few issues with low quality appliances that were loud, pots and pans that everything stuck to, a freezer that I couldn't adjust so everything had freezer burn by the second day. Small things. I was only there for 5 days, any longer than that it would have really irritated me. Also, they claim to have activities scheduled, and they do, but they are things like coloring and dated movies. We were going to participate in a poker tournament, and when we arrived it was a 15 year old dealer, a 3 year old and a 5 year old at 9 pm. We just assumed it would be geared more towards adults at that time of night.", "title": "We love the Bentley Brook Mountain Club, room, location, everything", "helpfulness": 5, "user": "schong", "date": "December 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11201578, "likes": {"liked": "— Location to snowboarding", "disliked": "— Far from everything else"}}, {"rating": 3.0, "title": "Quiet time", "text": "The morning after we checked in some guy came to the room and started asking us questions about time shares. I squashed that quickly and he wasn't too pushy. My friend went to a presentation and did get a 15% discount card, which came in handy when it cost us about $500 for all of us to ski for 2 days.", "helpfulness": 7, "user": "luv2travel75", "date": "September 7, 2007", "id": 8669734}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Kids loved skiing, and we could walk to the rental shop. That was perfect. They also loved the hot tub. And the best part if you are in building 27 you can watch them on the bunny slope without having to go outside.", "title": "Disappointed in the resort, not the area (take a way this resorts Gold Crown!!!)", "helpfulness": 6, "user": "MikeAG59", "date": "August 27, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 8516779, "likes": {"liked": "— Centrally Located", "disliked": "— Resort is starting to show it's age"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Would we go there again, sure. Would I consider it wonderful no.", "title": "A little disappointed", "helpfulness": 5, "user": "NJDebW", "date": "August 20, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 8457052, "likes": {"liked": "— Location- the views and countryside were breathtaking.", "disliked": "— Not enough to do."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We stayed at the Wyndham Bentley Brook last weekend (3/20-3/23) as a celebration/get-away. We don't ski but still enjoyed the resort just the same. We were put in a building without a pool as the pool was in the main (reception) building... this was a bit disappointing but there was a large hot tub outside of our room which made up for it. Most of the restaurants (not on site) are a 15-20 minute drive from the resort (which was expected) and there are some cool museums (Normal Rockwell) nearby as well. The resort is very family oriented, so if you have a problem with hearing kids laughing, crying and running around on the ceiling... you should consider an alternative. Not sure we would be back anytime soon as we feel we did pretty much everything there is to do for non-skiing folks but have nothing negative to say about the Wyndham Bentley Brook.", "title": "A Nice Relaxing Time", "helpfulness": 3, "user": "jason8478", "date": "March 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 26808134}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "My husband and I went here in mid November. It was VERY cold so they actually started making the snow while we were there, which was pretty neat to see. The resort was beautiful and it was one of the best time share units we have stayed in. It was very up to date. There was forced air heat in the unit but a bonus of radiant heaters in both bathrooms which was nice on the feet in the cold mornings. The unit layout seemed a little small (the living area) if you had kids with you (we left ours w/ grandmom but if they were there, they would have been underfoot a lot). And the jetted tub was wide but short and more of a one person tub than a two person tub. The master bath had a stand up shower and the 2nd bath was a bigger shower but there was no bath tub, so if you had small children, you’d have to bathe them in the big jetted tub which seemed rather large for small ones (yet too small for 2 adults). The unit had all energy efficient bulbs which were hard to get used to at first but they got brighter after a few seconds and we were fine w/ them (the resort is environmentally friendly...they even have a turbine on the top of the mountain which was cool to see...whenever we were in the valley, we knew where we had come from and where to go back to). The linens seemed fine...nothing fabulous, nothing shabby. The kitchen was adequate and had a nice rack to just sit your dishes in when they were clean. The washer/dryer (stack) were fine and worked like a typical stack w/d....never put in a big load and expect it to dry quickly!", "title": "Beautiful 2BR condo, nice resort at base of mountain, would love to go back!", "helpfulness": 5, "user": "CJireh", "date": "March 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25871651}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "The staff was very nice and the resort had free wi-fi available in the lobby (they had their own computer there if you needed it, but we just brought our own along as did others we saw there). The resort was so nice but it wasn't crowded the week we were there...we left on Sunday but the weekend (Fri night/Sat it was VERY busy as the snow was there and it was the first ski weekend)...at that point it was kind of noisy down the halls and stuff, but nothing unusual for sharing a condo w/ others. They had a nice pool that went from indoors to outdoors but it was a little chilly (even though it was heated). The outdoor jacuzzi was nice....and you weren't cold getting out of it (because your body was warm) so it was great to soak in it and watch the snow fall on the mountain. There was also a bigger jacuzzi in an enclosed gazebo which would be nice if snow was naturally falling as it wouldn't be landing on you. We used this jacuzzi twice but it was harder to get back in then the other one...you had to walk up a walkway and then in the door and down the hall, up a flight of stairs and down another hall to get back to the locker room. They also had a movie theater there was was quite cute (maybe 25 seats or so, stadium seating w/ free popcorn) and we did watch a movie there one night and that was a fun \"date\" night!)", "title": "Just so Awesome!", "helpfulness": 1, "user": "takenvacations", "date": "February 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 24191283}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "The activities were a bit hokey and we got a good laugh when we went to the orientation and there was a \"lounge singer\" there! :D We did enjoy the resort w/o taking place in any planned activities. We did to the timeshare plug and didn’t buy anything but got $50 worth of resort cash (among other things) and we had two nice lunches in they restaurant. (do check the hours as it was “off season” and the hours weren’t the best then. One night we braved the 12 degrees and headed out (do drive if it is cold, it isn’t worth walking that far to the restaurant!) and it was closed. The little shop there is great for buying/sending post cards (they have a “post office” in it) but other than that, tourist pricey!", "title": "Weekend Getaway", "helpfulness": 4, "user": "stephiegirl02", "date": "December 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 22808583, "likes": {"liked": "— Pool, Ski hill"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "We went to the Berkshire Museum as there was a Christmas tree exhibit and that was really worth it. It was a nice museum, not crowded and spread out enough to enjoy. We didn't take our kids along but there were some kid friendly things to do there (like dig for dino bones and make/draw things in the innovations part). (NOTE: if you go here, buy your tickets from the front desk...they were $10 each at the museum but only $7 each at the resort front desk). We also did the Norman Rockwell Museum...which was free on Tuesdays from Nov-April but make sure you REMIND them you are there for FREE on Tuesday because they tried to charge us anyway. It was worth it (for free) to see all of his artwork and listen to the tourguide, but I don't think we would have wanted to pay $30 for both of us to go if not. (NOTE: if you go, get a coupon from the front desk at the resort...it is good for a free print from their gift shop). Other than that, we went into town a few times and got some Christmas shopping done (Target/Berkshire Mall). There were numerous restaurants/stores available (Walmart/Old Country Buffet as well as a few chinese buffets etc). We didn't visit any restaurants/shops that really stood out.", "title": "Restful, relaxing vacation", "helpfulness": 2, "user": "Zoie65", "date": "November 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 21847820, "likes": {"liked": "— The kitchen", "disliked": "— nothing"}}, {"rating": 5.0, "title": "Great place", "text": "We stayed here the first week of October. It's a beautiful place at that time of year. The resort is right at the base of Jiminy Peak. They have wonderful restaurants on the property. We would have liked to have had the chairlift running during the week, but it was in service only on weekends. The one bedroom condo was lovely and very clean. Check-in was quick and the staff is exceptionally nice and very helpful. They gave great advice on places to eat and things to do. We would not hesitate to return here. This was a perfect time to view the fall foliage.", "helpfulness": 2, "user": "canno7371", "date": "October 21, 2008", "id": 21073009}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "I have read a number of reviews saying that the place was filthy. NOT SO. We stayed in a two bedroom, two bath with a kitchen and living room. Lovely. Clean. Well stocked with all the utensils, etc. The staff was very nice and helpful. We didn't use the facilities, but ate nearby at local places that were delicious. The hotel provided us with a lot of information about activities around the area. There was no shortage of things to do. We will be returning for sure.", "title": "Excellent, Clean, Close to all", "helpfulness": 3, "user": "copywrite00", "date": "July 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 18177567, "likes": {"liked": "— Close by to so many cultural activities", "disliked": "— nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "We booked a last minute vacation with our points that are about to expire.", "title": "pool was dirty when we arrived... dead flies and insect were there...", "helpfulness": 3, "user": "aquarianne11", "date": "June 10, 2008", "detail_rating": {"business": 1.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 16828187, "likes": {"liked": "— good location", "disliked": "— dirty"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "We stayed in the main building. Overall, our vacation was ok but we will try other resorts next time. The biggest downside was the pool was dirty when we arrived (Friday). Dead flies and insect were there. They cleaned the pool the following day.", "title": "Never again", "helpfulness": 2, "user": "whizzkidd", "date": "June 6, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 2.0, "location": 1.0}, "id": 16738557, "likes": {"liked": "— the size of the 2 bedroom apt was nice.", "disliked": "— no cell service, 1 computer for entire complex to use to check emails, resort was not clean."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "This was disappointing but maybe because we booked during the off season.", "title": "Great Spring Break Ski Vacation!", "helpfulness": 1, "user": "rockstarmama", "date": "April 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 15387683, "likes": {"liked": "— the location at the base of Jiminy Peak", "disliked": "— no internet access in the rooms"}}, {"rating": 4.0, "title": "Bentley Brook", "text": "Very nice ski resort.........but too many kids!!!", "user": "babikute", "date": "March 14, 2008", "id": 14284608}, {"rating": 1.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "Our Family just got back from a 7 night stay at Bentley Brooke over President's Week. We sublet the unit from a family which had a last minute conflict. This was our second stay at Bentley Brooke over President's Week; and I just have to say that it was probably the worst vacation that I've had in years.", "title": "Not Great At All!", "helpfulness": 4, "user": "sthalp", "date": "February 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "location": 5.0, "rooms": 1.0}, "id": 13812127, "likes": {"liked": "— Near the Slopes, Family Friendly", "disliked": "— Filthy Hotel; Made us all Sick!"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "Before I get to the \"dirty\" detailts, let me just say that Jiminy Peak is a great ski area for families. The slopes are well care for; and the ski school was great for the kids. Bentley Brooke is situated right at the bottom of the slopes, which is why we chose this area. It's also kid friendly with a smimming pool and game room.", "title": "President's Week 2008 - Great time!", "helpfulness": 2, "user": "mouse45", "date": "February 22, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13769549}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "The problem unfortunately is that Bentley Brooke is simply filthy. When we stayed last year, our room on the first floor (very close to the front desk) was infested with mice and rats. In fact, after we arrived we found mouse and rat droppings all the floors and cabinets. I presume that management was aware of this problem since our room was right in the front of the hotel. Anyway, we called and they sent and a cleaning crew and an exterminator to deal with the problem. They also told us not to leave any food out and discard the garbage before we left the room, as if I needed to be told that!", "title": "Fantastic stay at Bentley Brook", "helpfulness": 3, "user": "jkelly86", "date": "January 28, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 13066144, "likes": {"liked": "— Location, ammenities", "disliked": "— Construction (thin walls/noise)"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "This time, we were given room 2421 on the second floor. No mice and rats, but the room was filthy! The sheets were stained, the mattresses were used up, the carpets were filthy; and the room obviously hadn't gotten a good cleaning in months. Also, the room was very close to the pool and it was constantly musty.", "title": "Convenient to slopes, nice sized units and clean...", "helpfulness": 5, "user": "lprstn", "date": "December 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11919463, "likes": {"liked": "— Location to the slopes!", "disliked": "— Updating needed to some of the amenities..."}}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 7, "average": 20, "very good": 72, "terrible": 9, "excellent": 54}, "aka": "Wyndham At Bentley Brook Hotel", "slim_ranking": 0.25}