{"user_rating": 3.5, "review_count": 101, "name": "Wyndham Garden Wichita Downtown", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "rooms very small no resturant open tornado warning. alarm sounded and staff did not notify guests", "title": "small rooms", "helpfulness": 1, "user": "wildadventurer", "date": "March 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 26410959}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "I generally have a good experience with the Holiday Inn, and this was no exception. It was clean and the staff was friendly. It was a bit understaffed, but this was probably because we stayed there on the evening of January 1st.", "title": "Clean, quiet", "helpfulness": 1, "user": "leaflet22", "date": "January 13, 2009", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 23537371, "likes": {"liked": "— Great pet policy", "disliked": "— restaurant"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "We loved that they allowed us to keep our lab in the room for no extra charge. The rooms were clean and comfortable.", "title": "Great Price Good Stay", "helpfulness": 1, "user": "Triplewin", "date": "September 11, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 19978390}, {"rating": 1.0, "title": "Incompetent Sales Department and Front Office", "text": "The restaurant downstairs wasn't my favorite place. They served me some sausage that was still frozen in the middle, but they did discount our meal because of this. I would stay here again, especially if we have the dog with us.", "helpfulness": 1, "user": "jewelgirl", "date": "August 24, 2008", "id": 19310202}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "Sometimes you just can't pass up a good rate. The $72 rate intimidated me. I took a chance. I have stayed at this hotel twice, once in June 08 and again in August 08. The rooms are smaller and laid out a little strange. They are clean and comfortable, the work station is adequate but could be improved. Don't expect any extras. There is a restaurant and small bar onsite and the staff is very nice. This can be a problematic site if you don't have transportation, there is not much around and I have been warned that you don't want to stray off away from the downtown area.", "title": "I enjoyed my stay", "user": "Lady_Road_Warrior", "date": "July 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 18183954}, {"rating": 1.0, "title": "Hated it", "text": "We were terribly disappointed in our accomedations. The room was small. The bathroom was so small you almost have to stand in the tub to close the door. There was an uncovered breaker box within a foot and a half of the shower.", "helpfulness": 1, "user": "weible12", "date": "July 18, 2008", "id": 18009956}, {"rating": 1.0, "title": "Roaches!!!!", "text": "The entry door was so ill-fitting the hallway lights shone around the edges of the door making it hard to sleep. Due to power outages the elevators didn't work part of the time and the breakfast room-service was not available.", "helpfulness": 2, "user": "xxxxyyyyy", "date": "December 7, 2007", "id": 11301326}, {"rating": 5.0, "title": "Great Place To Stay, Beautiful & New", "text": "We had supper in the hotel but had to eat in the bar where the service was poor& the food mediocre. Our appitizers were served after we had finished our meal.", "helpfulness": 1, "user": "OlatheRoadTripper", "date": "September 24, 2007", "id": 8884747}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We ended up cutting our anniversary(20th) trip short and checking out early. The desk clerk charged us for an extra half a day instead of refunding a portion of our money. It took two phone calls by me and one by my credit card company to straighten out.", "title": "Excellent Service", "helpfulness": 2, "user": "JamaicaBride2007", "date": "July 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 8039623, "likes": {"liked": "— The location-near Old Town", "disliked": "— The room was small."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The staff , including the manager ,did not even ask why we left early so it seems they did not care about our satisfaction with their hotel.", "title": "Everything layed on", "helpfulness": 1, "user": "JstarkScotland", "date": "June 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 7847023, "likes": {"liked": "— the choice of eating and drinking on site or free transport into old town"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "Our family booked a suite for 4 nights July 21-25, 2005 at the La Quinta Suites downtown Wichita. We were there to see a production of Seussical, the Musical by the Music Theatre of Wichita.", "title": "La Quinta good value, great hotel", "helpfulness": 4, "user": "GrammyBecky", "date": "July 27, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3706803}, {"rating": 5.0, "stay_parameters": "Stayed January 2005", "text": "If you are in the area in the summer, I recommend the theatre productions highly. You will not see a better production on Broadway!", "title": "Great Hotel!", "helpfulness": 2, "user": "JenniferInOz", "date": "July 12, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 3659518}, {"rating": 5.0, "title": "better than expected", "text": "We were pleasantly surprised when we checked into the hotel that the suite was spacious and clean, had two bathrooms and wonderful air conditioning in the Wichita heat!", "helpfulness": 6, "user": "A TripAdvisor user", "date": "February 3, 2004", "id": 1626500}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "Hotel photos on the holidayinn website are out of date, lobby area has some new very comfortable leather furniture. Was in Wichita during a very hot period of the summer, hotel room airconditioner ran almost constantly at the temperature I had selected, but was very noisy, which was very annoying when it switched off every few minutes for about 15 seconds... Over and over again all night. This didnt' really bother me except for when I was trying to watch tv - constant volume adjustments. Amenities were fine. Bathroom towel rack had been broken, but they hadn't bothered to repair - suppose they will wait until it actually fully falls off the wall.", "title": "Decent hotel, nothing special.", "helpfulness": 1, "user": "europa00", "date": "July 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 72130999}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "Would recommend if you are staying at a holiday inn class hotel, but its not a marriott or hyatt.", "title": "Ok for sleeping....not the cleanest.", "user": "MOGrl79", "date": "July 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 71298322}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "I stayed here on business. The service at the front desk was great! The lobby looked clean and well kept. When we exited the elevator on the 2nd floor, the wall where the window was directly off the elevator was covered in mold. Once in my room I noticed a fairly large mold spot near the window. There was also a whole in the wall where the door opened and hit it over and over. In the bathroom there was an exposed fuse box. The housekeeping did a good job of cleaning the room overall. While I did not swim, overlooking the pool and hottub, they seem to be pretty dirty and in need of a new paint job. The trash cans and ashtrays on the hotel grounds to not get emptied daily and the occasional piece of trash gets left sitting on the ground for at least a couple of days. Overall, it was fine to sleep in, but I would never go for a relaxing vacation.", "title": "Good clean rooms", "user": "TheScubaDuo", "date": "May 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 65939494}, {"rating": 2.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "Near to the Baseball stadium, large sized room, nice and clean. Also has bar at the hotel.", "title": "Fresh coat of paint won't fix this classic Holiday Inn", "user": "pointcollector", "date": "May 26, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 65383132}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled solo", "text": "For a number of years I stopped staying in Holiday Inns for their reputation of poorly maintained properties and bad service. Recently I've stayed in a few more because of location and conferences. I have been pleasantly surprised at the refreshes at many of the properties, but the downtown Wichita Holiday Inn reminded me too much of a classic Holiday Inn (that's not a good thing).", "title": "Pleaseant stay, and still on the line", "helpfulness": 1, "user": "Spiderpig41", "date": "November 4, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 48481939}], "location": {"country": "United States", "city": "Wichita"}, "variance": {"poor": 8, "average": 26, "very good": 22, "terrible": 14, "excellent": 31}, "aka": "Holiday Inn Wichita Downtown Hotel", "slim_ranking": 0.544303797468, "description": "The Holiday Inn Hotel & Suites Wichita Downtown - Convention Center is conveniently located near the Century II Convention Center, the museums on the river district, the future downtown Arena and the Old Town shopping and entertainment area. Our seven story, full service hotel services downtown Wichita, Kansas, and is located on the edge of downtown with the most convenient access to all the downtown Wichita hotels to the highway system leading to Wichita. We offer meeting space up to 125 people. A restaurant and lounge with room service, outdoor heated pool and spa and a 24 hour fitness center completes our recreational activities at our Wichita hotel.Each room has complimentary high speed Internet access, new Pillow Top Mattresses in June '07,work desk, refrigerator, microwave, closet, iron/ board, coffee and 2 telephones that cater to the professional business traveler. We offer a limited, complimentary shuttle service to Mid-Continent Airport. Major local and national companies are minutes away, including Cargill, Spirit AeroSystems, Coleman, Koch, Flight Safety, Boeing, Airbus, Cessna, Raytheon, and Beech Aircraft."}