{"user_rating": 3.5, "review_count": 1219, "name": "Wyndham Philadelphia Historic District", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "If you want to be central to everything this is the place to be. The rooms are typical 'Holidy Inn' and offer all ammenities that you would expect.", "title": "GREAT LOCATION", "user": "vegasbud", "date": "September 18, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 42623473}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We did have an issue regarding not having a safe in the room, when we arrived at the hotel we were told all the safety deposit boxes were taken and to check the next day. When we checked the next morning we were advised still no boxes available, we were heading to Vegas for a week so we had a large amount of cash with us so i asked if they could put this in their safe, no was the reply just leave it in your room. At this point i pointed out the sign behind her that said not to leave valuables in the room and management would accept no responsability !!! long story short we ended up carrying large amounts of money around the city between us, not the best option !!!", "title": "More advantages than disadvantages", "helpfulness": 1, "user": "jules1214", "date": "September 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 39674122}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "The room was very clean but we did find the hallways and lobby to be in need of a good clean though and the only other minus was the noisy air conditioning.", "title": "A great location to see Philadelphia", "user": "BJTraveller", "date": "September 2, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 39608284}, {"rating": 1.0, "title": "Do not eat in Holiday Inn Restaurant", "text": "All in all a decent hotel and would recommend for the cost. Very central for all sightseeing and close to the National Mechanics bar which i feel is worth a mention, good food and drinks served by very friendly staff", "user": "FRANKRAFFA", "date": "August 31, 2009", "id": 39326023}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We stayed in this hotel for two nights only as it was part of a two-week holiday visiting various cities in north east America and Canada.", "title": "loved it", "user": "mistersoftee38", "date": "August 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 38812701}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "First off, Noah Longmore at the front desk made my stay a positive one. I had been traveling all over the U.S.: Austin, Denver, Reno, Chicago, all in the span of a few weeks. Got hammered on 6th street, did a shot-luge in Colorado, played ladder golf in Reno and saw an Aces game, and then went to Wrigley, Navy Pier, and the Hancock Building in Chi-town. I was dragging a** by time I reached Philly (actually the second time through on that trip-yeah sorry to that cab driver I freaked out) which is probably why I booked the hotel on the wrong night, the night before. I was certain I was going to be out some jing and in a serious bind; Noah helped me out. Even though they were busy, even though I'm sure he'd had a long day, he helped me out God bless him.", "title": "Awesome service, great location, great hotel", "user": "jimmy_cousteau", "date": "August 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38505659}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "If you're familiar with the area you know this is ground zero for historic Philly. The hotel is well taken care of and as mentioned, the staff is curtious, professional, and helpful. Love you guys! Enjoy Philly!", "title": "Great hotel and location but with couple flaws", "user": "pilot08", "date": "August 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 38395781}, {"rating": 3.0, "title": "An average hotel in an excellent location for visiting historical sites", "text": "Stayed here for 2 nights with 2 young kids. Room condition was excellent. The complain I have is the room size. It was pretty tight especially if you are staying with kids. Otherwise, the staff were great and very helpful. The wireless connection was very slow and often plagued with connectivity problems. If you are looking for a location near the Independence Hall, this is definitely the one to stay at.", "user": "nancy161", "date": "August 21, 2009", "id": 38393437}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "The entrance to this Holiday Inn is on 4th street, just south of Arch Street. We had a room on the Priority Club floor. The room is nice enough; quiet; bed is very comfortable; bathroom can use a scrub down and there was some dirt on the bed sheet, which I rubbed off with a damp towel. Makes me wonder if they had changed sheets. After the first night, housekeeper took the towels and toiletries without replenishing them. The rooftop has a great night view, better if you are a tall person! The business center is a plus, with 4 computers, and 2 copier/printer/fax.", "title": "Great location, nice room", "user": "m_s_001", "date": "August 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 38230329}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "As some other posters already entered: this location is in walking distance to many of the sites, from visitors center, to museums, US Mint, etc.. very convenient. I wish this hotel had refrigerator & microwave in each room though!", "title": "Location, location, location", "user": "TracyInNC", "date": "August 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 37754279}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Check in was fast and friendly! Parking is convenient yet expensive ($22. But that's how it was everywhere.) Hotel is in a wonderful location - a very safe area. Room is average sized but very clean and quiet. I would absolutely stay here again. We were doing a breast cancer bar crawl and it is near all the hot spots.", "title": "Very good experience!", "user": "devilmebettie", "date": "October 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46183928}, {"rating": 2.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "For the money, stay at another hotel. Unfortunately, the front desk staff was unfriendly and terse as if they'd rather be anywhere else. This was true when we checked in, later when I asked about the fitness room and when I called to schedule a wake-up call. Parking is expensive - more than $20 a night. The room is austere and noise from the hall is extremely loud. For a similar price I would recommend the Courtyard by Marriott or Hilton Garden Inn. The biggest benefit to the hotel is the location. If you're here for a weekend on vacation and want to visit the historic sights, it may be a good choice if you get a great rate. For business or frequent travelers, look for other options.", "title": "Not worth the money", "user": "epcotguru", "date": "October 5, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 45950784}, {"rating": 1.0, "title": "Credit card Fraud !!!!", "text": "My wife and I stayed two nights, August 31 and September 01, 2009. At check in, the front desk gentleman was polite, friendly and explained the price and so on. We were told the hotel rate and parking are priced together being I told him I wanted parking. We were there for medical reasons at Temple, testing for my wife as we mentioned to the front desk. After going up to see the room, we went to see the pool. We were told it is out of service, and has been for a while, the red flags started to wave ! Well the next morning we though we would try breakfast downstairs in their restaurant. What a hugh mistake. We ordered and our waiter gave my wife and I not what we ordered. After telling him that he looked at us like a deer in headlights.( maybe if he wrote the order down he would have not screwed up ) Funny thing, he first mentioned the all you can eat and said there was no hot stuff on the menu for all you can eat, just cold food. As we were finishing, another guest, next table over had just returned from the all you can eat with eggs, toast and so on. I then receive my credit card statement and the statement is $44 MORE then the bill I have. Oh just wanted to also say BEWARE of the older woman with broken english who works in the gift shop. We go in there to have our scatch off tickes checked that we bought the night before and handed them to her to check, she takes them looks at them for two seconds and rips them up saying they no win. I questioned her why did you not check them with the machine, she tells me how she has been doing tickets for years and just knows! BEWARE!", "helpfulness": 1, "user": "Hereitis", "date": "October 4, 2009", "id": 45803887}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled solo", "text": "Rooms were spacious and clean and location is close to the historic section of the city. Breakfast was good. The drink prices in the bar were quite expensive. Overall good value and great service.", "title": "Good hotel", "user": "Darghan", "date": "September 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 44058925}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "If you want a place right in the historic district, this is it.", "title": "Great location to see historic Philadelphia, but average hotel", "user": "dddd66", "date": "September 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 43967364}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "I stayed there with my 17 year old son and the experience was great. The hotel was very clean and quiet. We arrived late due to problems at the airport and there was no problems with late check in. The pool on the roof was excellent. The room and the bathrooms were always clean. Everyone was helpful. The location was within walking distance of most attractions and food. Unless you have more than 2 days to spend I wouldn't bother with the Big Bus tours. The Old City Pizza place down the street from the Besty Ross House looks small from the outside but the food was cheap and very good. I would stay here again without a doubt.", "title": "WONDERFUL!!", "user": "lesa99", "date": "August 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 37419893}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "It's a very typical holiday inn when it comes to the rooms, cookie cutter style. However, it you're looking to hang around the historical spots in the city, it's great, right near the Liberty Bell, the Betsy Ross House, the Todd House, Independence Hall, etc. etc. The breakfast line both mornings we were there was so long that we didn't even try. There seems to always been a major backup. There are a few good bars around, apparently if you're college age, there's a ton of good bars on 2nd street but we mostly just stayed around 3rd street at night. It's a very safe location, we never felt as if we were in any danger at all. Also we didn't have too much trouble with noise at night which I think was a real plus for being in the city. My parents stayed at one of the Hyatt's and they thought our hotel was nicer.", "title": "Average Holiday Inn with a good location", "user": "Abroadstudent", "date": "August 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 37290056}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "The hotel is ideally located for anyone who wants to explore all the major attractions or get on a tour bus close by. The service was truly excellent, we were grateful for the helpful, smiling front desk staff. The pool on the roof was a major highlight for our kids. Word of advice: avoid the hotel so-called restaurant. We have had better meals at gas stations. Seriously.:))", "title": "Excellent location and value!", "user": "cheburashka109", "date": "August 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36570877}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "This hotel was great to stay at. The staff was very friendly and the rooms were nice. We stayed on the side facing the U.S. Mint and it was very quiet at night. We went on the trip to go to the Cubs/Phillies game (game 1 of the series) and we wanted to watch game 2 but they didn't have it in the room (no Comcast Sports Net in the room). They DID have it on in the bar though, and let us sit there and watch it without getting anything to eat or drink. The best reason to stay there is its proximity to the sites- 2 blocks from the Liberty Bell, Independence Hall, and in the other direction, the Betsy Ross house. We could also walk to many other places, and it's also close to the subway.", "title": "Great place to stay!", "user": "enystedt", "date": "July 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 35873363}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "I stayed here for four nights during QFest. The location is almost perfect - right in the heart of the Historic District and close to subway - with plenty of opportunities for dining, night life and shopping nearby. I had a spacious room that was equipped with all the essentials and made plenty of use of the free wi-fi. Staff were friendly and efficient. Would definitely come back here when in Philly again.", "title": "Excellent Location", "user": "grant67", "date": "July 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 35808149}], "location": {"country": "United States", "city": "Philadelphia"}, "stars": 3, "variance": {"poor": 137, "average": 302, "very good": 490, "terrible": 59, "excellent": 231}, "aka": "Holiday Inn Philadelphia Historic District", "slim_ranking": 0.595238095238, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.5, "rooms": 3.5, "location": 4.5}, "description": "Welcome to the nation's most historic square mile! In the heart of downtown Philadelphia Old City, 8 miles away from the international PHL airport, the Holiday Inn Hotel Historic District Philadelphia offers the best in Philadelphia accommodations! We are only 5 minutes' walk to the major historic attractions: Liberty Bell, Independence Hall, National Constitution Center and Betsy Ross House. Walk or take a short subway ride to Pennsylvania Convention Center.Visiting Thomas Jefferson hospital or Pennsylvania hospital? Reserve a room at the smoke free Holiday Inn Historic District Philadelphia in a safe neighborhood with 40 restaurants. Government offices within walking distance to Holiday Inn Historic District Philadelphia Hotel include US Federal Court House, IRS, US Attorneys office, Department of Labor, FPS, Social Security Administration, FRB, Department of Justice and DEA.Holiday Inn Historic District Philadelphia, PA offering free WiFi is conveniently located about 2 miles away from Art Museum and Franklin Institute featuring Star Trek and Galileo the Medici and the Age of Astronomy exhibits. With short drive to Aquarium, New Jersey Battleship and Zoo, families will appreciate the central location of Holiday Inn Historic District in Philly, Pennsylvania. If Market Street, Gallery shopping mall, and South Street shops haven t wore you out yet, King of Prussia Mall is only 30 min. drive."}