{"user_rating": 3.5, "review_count": 1689, "name": "Wyndham San Diego Bayside", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We read the reviews before we went and were a bit concerned. The room we stayed in was not out dated, the furniture was a bit old but the bath and the bed were great. We did not use the pool it was to cold also as for parking it seems every where we drove in the inner city parking was expensive so I think there parking fee was in line. We took a cab up to the gas lamp district $6.00 cheaper than parking in that area. the Hotel is walking distance to lots of attractions and dining", "title": "Great Location", "helpfulness": 1, "user": "Paul C", "date": "July 3, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 166183199}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The hotel is nice and the staff very good and helpful. We slept in and often had a problem getting the room cleaned later in the day but they did respond with coffee and clean towels when called. Restaurant was good and close to others that are good, The bell service very good and the shuttle to Horton Plaza and the Zoo helpful. We had a top floor Ocean View most expensive room and the wireless internet was very poor there. The acknowledged they knew this but had no fix and they did not have a range extender. We often had 1 or 2 bars and it made Skype work terrible. I did not see the small type on the phone that said long distance is billed and not free. First Wyndham I have been at that charged. They even charged for the local area code 858 and 760 changes but removed those when questioned. Still because the wireless was so bad and Skype was not working well that I ended up paying $83.00 in long distance. So if you are going to need internet book a cheaper interior room where internet is good and sadly lose the ocean view room. We are from South America and did not have a US cell phone so we had to use the hotel phone. Also Outlook will not send out of their internet supplier and it took 5 calls and 3 days before they could get someone to get the right codes to send out email. Otherwise the hotel was very good. If they fix the bad wireless, do a better job of informing on phone calls billed and know what to do for outlook they would be excellent and have 5 stars.", "title": "Good hotel, nice staff, a few problems with internet service", "helpfulness": 1, "user": "Mounque B", "date": "July 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 166103345}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Stayed three nights after the conversion to Wyndham brand. Previously a Holiday Inn. The change took place literally two days before we arrived so the only difference was the signs. Check-in was a breeze and the staff is very polite, friendly and helpful. Hotel is in serious need of a remodeling. Rooms are large, roomy but pretty beat up (see pic). Everything is clean, just worn. The price we received as a flight crew was very reasonable for the class of hotel. Because the occupancy was light, they gave us bay view rooms, with a beautiful view. If you can't stand airport noise, you will not want a bay view room. The jet traffic is loud with your sliding door open. The airport shuts down after 11:30 PM but starts up again at 6:30 AM. I don't mind it, but late sleepers will not. Bed was firm, and reasonably comfortable, pillows were just OK. Bathroom was fine. The sink faucet had really low water pressure, though the shower was fine. WiFi was weak, but useable. I wouldn’t count on streaming video, but works fine for general surfing. No microwave or fridge. No safe. The balcony rails for adjoining rooms are not walled or blocked in any way. So someone could easily jump the rail and loot your room. I would be careful to lock the sliding door when you leave. No free breakfast, but the Elephant and Castle Pub in the lobby has excellent food. The staff there is super and the prices are moderate. There are two fitness rooms, each across the pool from each other. A little odd. One has cardio equipment, 3 treads, 2(?) elliptical and a couple of bikes. The other has REALLY dated weight machines. Many of which need overhaul or replacing. The bushings in much of the equipment is worn to the point that the movement is jerky and bordering on useless. There are a couple of benches and dumbells too. Pool seems nice. Moderately sized. Never saw anyone but kids swimming, but it looked clean and the area around the pool was well kept.", "title": "Dated, but good value. Great staff!", "helpfulness": 1, "user": "hwkrdrvr", "date": "March 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 153657133}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The price was reasonable for the class of hotel and location. Good value if you spend very little time in your room and San Diego is one of those places. It would be a great cruise ship overnight hotel.", "title": "Great Location for Cruisers", "user": "Lord Fauntleroy", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 153124464}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "It will be interesting to see what happens to this potential gem under the Wyndham name.", "title": "Excellent Price, Location and Staff!!!", "user": "Steve W", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153087919}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "We stayed for one night before taking a cruise. The cruise terminal is just across the street from the hotel and you can walk there in less than 5 mins. Even so, the hotel will provide a free shuttle to the terminal which we saw several older/disabled people take advantage of. With free shuttle from the airport and free WiFi, what more could you ask for? Ignore the reviews that say the hotel is \"rather dated\" - what do you expect at this price?", "title": "Good location not taken advantage of", "helpfulness": 1, "user": "picafloralpino", "date": "February 23, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 152871407}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "I stay here every year with my staff for business and love this place. The location is close to the airport, convention center, Gas Lamp district, and is directly across from the bay. At night you can even enjoy the fireworks from the bay park right from your balcony (bayside view). Ruth Chris Steakhouse is on the property so I hold our annual staff dinner there as well. Let me also say that I have ran into various schdule/room issues and the staff is very quick to help and fix the problem no questions asked.. theses people just know how to make customers happy. The rooms are clean, large and comfortable. The staff is friendly and helpfull. The rates are reasonable and the location is excellent...", "title": "Flexible and Helpful", "helpfulness": 2, "user": "SunlightandShadows", "date": "February 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 152731765}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Nice place. Great view and great location. You can walk anywhere from here, the Docks, maritime museums, Seaport Village, Gas lamp district ...you name it. Rooms are nice and a great value for the price. Great place to just sit outside at the bar and people watch.", "title": "Perfect View", "helpfulness": 1, "user": "Cigars-in-Paradise", "date": "February 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 152180623}, {"rating": 4.0, "stay_parameters": "Stayed February 2013", "text": "This Holiday Inn brings back memories (good ones) of the roadside hotels. Portions of the complex have rooms that have doors into exterior walkways (negative for my female colleague) as well no elevators for the second floor rooms (BIG negative for my colleague). The rooms themselves are clean and pleasant but nothing special. The bar was nice and the happy hour snacks were acceptable. The selection of brews was good. The only meal I ate at the hotel was breakfast and the food was good but the wait staff was not very attentive. Met my colleague after she had already started eating and it took awhile for the staff to ask for my order. Follow up checks for \"more coffee\" were very infrequent. I would recommend staying here for the location and cleanliness.", "title": "Good location for the airport and view if the Harbor", "user": "Laneshinkansen", "date": "February 9, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 151729913}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Directly across the street from the cruise terminal, maritime museum and good restaurants. Hop-on trolley stop across the street and Midway a few minutes walk. Free airport shuttle.", "title": "very convenient", "helpfulness": 1, "user": "MontrealShopper", "date": "February 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 151612164}, {"rating": 4.0, "title": "Great Value -- Fabulous Location", "text": "Hotel quite large and modern. Large, clean, comforatble room.", "user": "Annette G", "date": "February 5, 2013", "id": 151488973}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "A bit noisy due to proximity to airport, but all of downtown San Diego is - there is, however a curfew from midnight till 6 at the airport.", "title": "Slow internet... come on now", "user": "93157", "date": "February 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 151422762}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "If location is an important metric for your stay, this former Holiday Inn is for you, particularly if you do not mind hearing the PA from the cruise ships parked literally across the street. The hotel couldn't be better for cruisers or those needing quick access to the airport. The San Diego Bay harborfront is at your feet with restaurants, shopping, sight seeing immediately at hand. That said, it is apparent that the former owners were taking the money and running in the sale of this hotel. The hotel is old and tired. One needs only to enter a room in the South Tower to step back into the 1970s. Hopefully the new owners will begin a program of updating and modernization. During our stay we found the room clean, shower hot, staff accomodating. However, for a few bucks more around the immediate area you may be able to snag a more comfortable accomodation.", "title": "interesting n hopeful", "helpfulness": 1, "user": "notnecessary", "date": "March 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 154371891}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Spent 5 nights at this budget hotel. Nice location and had comfortable stay. Did not get a room with bay view but still happy with the room quality and cleanliness. Elephant & Castle Pub is in the lobby of this hotel which is pretty handy and amazing just in case you got late from amazing sightseeing tours. They serve till midnight. They had complementary airport pickup and drop-off. Overall satisfied with my limited budget.", "title": "Value for the money", "user": "FoxMcDonald", "date": "March 9, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 154059508}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Stayed at this hotel in January of 2013 when still a Holiday Inn. I was there for a conference along with another co-worker. We chose this hotel because of the location it is right downtown and has amazing views of the harbor. I was on the 10th floor overlooking the cruise port.", "title": "business trip for conference", "helpfulness": 1, "user": "john v", "date": "March 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 153857164}, {"rating": 1.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "The hotel is located close to restraunts and easy access to other area's of the city by highway.", "title": "GOT RUBBED!!! NOT SAFE TO STAY AT!", "helpfulness": 4, "user": "YFR1959", "date": "March 5, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 153791096}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "We were located on the 12th floor North Tower overlooking the city. If was wonderful. The room was CLEAN, Shower worked excellent, Service could not be better. We rented a car and the parking was no problem and staff was always helpful to get us around. Yes it is by the airport but the sounds did not bother us. In fact I was expecting loud plane traffic and it was not really that bad. I really can't say anything bad about our hotel experience. It is close to everything we wanted to do. We walked down to Richard Walkers Pancake house for breakfast.. EXCELLENT. If you like breakfast this place is a must. We also drove down to the GasLamp district for Dinner one night . Use the Valet parking and walk around. It is so much easier and only 15.00. We drove to Seaworld, San Diego Zoo, Mission Bay and Belmont Park. All of these just a short drive from this hotel. We also made it to Coronado Island and Imperial Beach. If you want a quick vacation to see several things in San Diego Stay at this hotel and you will not be disappointed. This was a 3 day vacation for us with a 7 year old. Couldn't have been a better place to stay.", "title": "VERY Satisfied!", "user": "Cyndi G", "date": "February 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152534808}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Rooms were very clean,staff was very friendly. The rooms are dated they could use an update, there are no safes in the rooms. Parking is $22.00 a day if your driving, that's the one con for me.", "title": "Good Location", "helpfulness": 1, "user": "Flyboy1984", "date": "February 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 152508970}, {"rating": 2.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "I would consider this place again.", "title": "Great Location Mediocre Hotel", "helpfulness": 1, "user": "herewegoonvacation", "date": "February 18, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 152470511}, {"rating": 1.0, "title": "Dont trust this hotel - Leave your valuables at home", "text": "This hotel is in a great location. It is near downtown, the gas lamp quarter, and sea port village. The room is also very clean. Unfortunately, we were not very happy with our stay. Our room was quite small. I have stayed in several chain motels across america with larger rooms. The beds were horrible. They were far too small and had the worst mattresses that I've ever experienced. I am 41 and in good physical condition, yet all of us were unable to sleep. We all woke with aches and pains all over from the beds. I was also let down by the lack of amenities from this hotel. The pool was small but heated. The hotel did not serve breakfast. It cost $22 per day to park my car. This is ridiculous. I will not stay at this location again. I would recommend that you stay at the local Marriot instead.", "user": "Larry M", "date": "February 18, 2013", "id": 152449267}, {"rating": 1.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "During my stay at this hotel on Jan 28-31 2013", "title": "Value Comes at a Price! Greed is never a Value!", "helpfulness": 1, "user": "ArteomS", "date": "February 17, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 152385577}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Room was clean and well presented. Suggestions when you update, need many more easily acessible outlets for charging electronics. Really inconvient to plug ipad, ipod and phones in behind the bed... Could go on about details where the room fell short (drapes had holes in them, slider old and needs repair/ home made lock, allowed street noise into room...) but I believe you will address all these things when you renovate.", "title": "Clean room, great view, friendly staff", "helpfulness": 1, "user": "Stan F", "date": "June 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 165694919}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "One major flaw which I don't believe will be corrected is the size of the bathroom. No counter space for toiletries, no shelves in the shower for shampoos and soap, no towel racks so we could reuse our towels.. I hung towels in the closet to dry... Just too small and cramped.", "title": "Excellent location and great hotel", "helpfulness": 2, "user": "lams45", "date": "June 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165589905}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We thoroughly enjoyed our stay at this hotel. It is located across from the harbour and the best sea food restaurant (Anthony's). Very convenient to Little Italy (walking distance) and the trolley station. Rooms are nice and the staff were excellent.", "title": "Wyndham San Diego Bayside", "helpfulness": 2, "user": "CaliforniaGrak", "date": "June 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 165571454}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 203, "average": 454, "very good": 577, "terrible": 127, "excellent": 328}, "aka": "Holiday Inn San Diego - On The Bay Hotel San Diego", "slim_ranking": 0.596296296296, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 3.5, "rooms": 3.5, "location": 4.5}, "description": "With a premiere location close to the San Diego cruise ship terminal, Convention Center, and Gaslamp Quarter, the Wyndham San Diego Bayside is unsurpassed among downtown waterfront hotels. Leisure travelers will enjoy nearby attractions such as the San Diego Zoo, SeaWorld, Balboa Park, Harbor Tours, and Maritime Museums including the USS Midway and Star of India. A stay at the Wyndham San Diego Bayside immerses guests in a true full-service experience, and relaxing views of the San Diego harbor front or city center skyline. A free airport and area shuttle makes traveling to and from the hotel and nearby attractions easy, while free high speed internet makes business travel a pleasure. Fantastic features such as an outdoor heated pool and a poolside gym provide opportunities for recreation once guests return from a fun-filled day exploring the area. Breakfast, lunch and dinner are easy as well, with several exceptional on-site restaurants such as Elephant and Castle as well as Ruth Chris Steakhouse providing a wide variety of options for any taste. The 600 guest rooms and suites at the Wyndham San Diego Bayside provide a peaceful escape from the vibrant city buzz. Bright decor, comfortable beds, floor-to-ceiling windows and furnished balcony rooms help guests make the most of the stunning location. Suites located near the top of the 14-story tower of the hotel offer breathtaking views along with a private bedroom, living area, pull-out sofa and mini-refrigerator. All rooms include guest-preferred amenities such as free high speed internet access, a free morning newspaper, a coffee maker, hairdryer and a large work desk. With 24,000 square feet of meeting space and conference facilities the Wyndham San Diego Bayside is the ideal location for San Diego meetings and events. Full-service planning assistance and professional amenities along with and creative catering help create the perfect meeting on the bay. Grand galas or casual affairs are also a specialty for the professionals at the Wyndham San Diego Bayside, with 12 wedding reception halls and various wedding packages to choose from."}