{"user_rating": 3.5, "review_count": 782, "name": "Wyndham Garden Hotel Newark Airport", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "We stayed at this hotel as we had an 8am flight to the UK the next day and needed a base close to Newark airport.", "title": "Great bed and location, but grim otherwise.", "helpfulness": 1, "user": "Professional_Fan", "date": "June 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 131396165}, {"rating": 2.0, "stay_parameters": "Stayed June 2012", "text": "I'll start with the positives: great location (five mins by free shuttle bus to the airport), super friendly staff on the desk, and the bed was really large and comfortable. A lot of people on here complain that the beds here are hard, but I have a bad back and therefore a hard bed is perfect for me.", "title": "Great for airport layover, poor for city visiting.", "user": "Rowhenry", "date": "June 3, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 2.0, "service": 3.0, "rooms": 3.0}, "id": 131171578}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "So, the negatives. I get that this is an airport hotel and therefore is more about convenience than anything else, but it was by far one of the grimmest rooms I've ever stayed in. The bathroom was old and needed a serious renovation. While the bath and toilet were clean and nice, the walls and ceiling were stained and not terribly well looked after. My roomie opened the sliding doors a few inches while I was in the bathroom (we had a smoking room and don't like air con too much), and doing so created a really disconcerting howling noise in the bathroom. Imagine weeing to the sound of wailing witches while an icy cold wind wraps around your ankles. Brrr!", "title": "Another Great Stay", "user": "Jo_Ann000", "date": "June 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131085470}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We opened the window later on, and when the bathroom door was open it made all the ceiling tiles bang and lift up and dust and nonsense fall down into our bathroom. Again, brr! Alongside the fact it needed a serious deep-clean, we weren't impressed with the room as a result.", "title": "Feel At Home At the Wyndham", "user": "caribloverny", "date": "May 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131012192}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Just a side note - making a smoking room the actual colour of a smokers lungs - walls, bedding, curtains, etc. - isn't super pleasant. Given that the only lighting came from lamps, the whole place felt pretty dank and unwelcoming.", "title": "Hard beds and poor service", "user": "freqworld_traveller", "date": "May 29, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 3.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 130855644}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Maybe it's not the only hotel hiding around the airport, but it's near impossible to get to. Took us around 1 hour (driver and co-driver) to locate it. In the end, it's OK for one night's stay, nothing especially wrong with it, but worn-out and ordinary. Friendly reception, safe parking, price as you would expect.", "title": "You deserve it, if you find it!", "user": "mosolygo", "date": "June 14, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 131976744}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "It's not easy to get to the hotel if you are driving in because there are so many highways in the area. Make sure you research how to get to the hotel before going -- GPS wasn't helpful. It looks like a dump from the outside and lobby but the rooms are modern, quiet, and clean. Staff was helpful, the restaurant (more like a diner) had reasonably priced foods (especially for the quantity -- I split the meal with my wife and still had some left over).", "title": "nice rooms", "user": "edg126", "date": "June 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 131827558}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "I did the park and ride, it was reasonable for our 9AM flight and easy to catch the shuttle. I wish they would have told me that you have to take the airtran to P4 to catch the shuttle, I was confused on where to pick it up, didn't realize that's where all the hotels pick up people. I wanted the cheapest way to park and get to the airport and reviews said this, If it remains the cheapest I'll go back. I also saw shuttles for hotels in elizabethtown and other towns slightly farther away, they might have better deals.", "title": "Perfect location for NYC and cruise embarkation", "helpfulness": 2, "user": "Connie W", "date": "June 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131619284}, {"rating": 1.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "We just stayed at the Wyndham Gardens, Newark, before and after our cruise out of Cape Liberty port to Bermuda. We could not have been more pleased with this hotel. The location was perfect. Our hotel rates were exceptionally reasonable and included up to 14 days of parking while we cruised. The transfers to and from the hotel to the port by taxi were easy, and the front desk staff actually called the taxi for us on the morning of our departure. After the cruise, we stayed a few more nights, and we used the free airport shuttle to go to and from the airport to catch the NJ transit to Penn Station in New York City. We are seniors, and found everything so convenient and simple. The front desk staff was amazing and so helpful and the rooms were clean and very quiet. Never heard a single airplane. The restaurant was great for late dinners and early breakfasts, and they have a 24 hour coffee kiosk and a gift shop in the lobby. We booked OnBoard Tours for a NYC tour on one of our days, and they picked us up at the Wyndham Gardens Hotel lobby. We couldn't believe our luck in finding this hotel. It was the smoothest trip that we will ever take, and the price was right!!! If you are driving to this hotel, be sure to get very specific directions to get to the hotel, as it can be a little confusing to find. However, once you are there, park your car and use their shuttle to the public transportation system at the airport. Thank you Wyndham, and thanks to the ladies on the front desk and the staff in the restaurant. Wonderful value and we will definitely recommend you to our friends.", "title": "Rude, no customer service and scruffy", "user": "Onbusiness1234", "date": "June 8, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 131566925}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "This is a tired old hotel which has had a room repaint - you can tell by the amount of paint on the floor and the over paint of the fixtures and fittings. Apart from that the room was not too bad. My biggest issue was the with the shuttle bus and the rude and uncaring staff. I waited in the reception at 4.40am to catch the 5.00am shuttle to the airport. At 5.05am I asked where it was and told that the driver had had to go and pick up a flight crew. At 5.10am I was told he would be there shortly and would take me directly to the airport. At 5.15am he arrived but said he would not take me to the airport until the next scheduled run at 5.30am. He said that he had run a 5.00am shuttle (different story to that of the receptionist) but I was not in the reception area so it was my fault I had missed it. I said I was in the reception at 4.40am and there had been no bus and no-one had made an announcement. He then suggested that I was lying and refused to help. As the hotel brochure said that they are 7 minutes from the hotel I asked could he take me anyway as he would be back in time for the 5.30am. He said it would take much longer than 7 minutes so he would not do it. Despite there being at least 16 people with bags ready by the bus at 5.30am, the driver did not come out until 5.35am and then loaded the bags very slowly. When he did drive to the airport the journey took 2 minutes - I timed it!", "title": "Clean and very convenient to EWR", "helpfulness": 1, "user": "kittykatnap", "date": "June 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 131522880}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "I want to first say thanks to my aunt ( R. Hunter) that work there as a maid (housekeeper) that told me she would be able to get me a discount..then when it was time to book she told me her boss said he would not allow my sons to get in the pool on a discount.I knew she was bs'ing me ...smh and lol.I still got there regardless.I booked my stay online for one day 6/29/12 We enjoyed our stay.We didn't want to leave because it was so comfortable.The room was very clean and we all had fun in that beautiful clean pool.I am referring everybody to this place and hopefully I can get a discount.lol Tawanna Hunter", "title": "I was hoping for a discount,however me and my family enjoyed our stay", "user": "airbrushedtees", "date": "July 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133198959}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "This hotel locates directly across from Newark Airport and after the tram ride will have you at the front door in 5 to 10 minutes! We've stayed here several times over the past few years and have always been treated with efficiency and respect. Our room has been clean and service great each and every time.", "title": "Treated Well & Convienient", "helpfulness": 3, "user": "Bob H", "date": "June 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 132855705}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "I have used the bar/lounge , cafe, snack counter and of course front desk and all staff have been attentive to our needs and again treated with respect & friendliness.", "title": "Awesome hotel close to Newark Airport", "helpfulness": 3, "user": "Michael M", "date": "June 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132733836}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "For the value, you can't beat this hotel for the convienence it offers.", "title": "Weekend Stay", "user": "Rox R", "date": "June 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 132452730}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "My wife and I recently had the opportunity to stay at the Wyndham Newark Airport on our way out of the country.", "title": "Sad rooms, sad stay.", "helpfulness": 1, "user": "thaliajen", "date": "June 15, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 132061343}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We always stay here when we fly out of Newark Airport. The room is nice, the restaurant has a variety of choices, and the shuttle to the airport is always on time. We especially appreciate the little \"coffee shop\" in the lobby that stays open 24 hours....coffee, tea, light snacks, etc. When we return from our trip our car is safe...and the shuttle from the airport to the hotel is a 5 minute wait. Oh, and all the employees are friendly and polite!", "title": "\"We like the 'park,sleep and fly' here!\"", "helpfulness": 3, "user": "Chris3051", "date": "July 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134726833}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "This hotel has some nice amenities, such as a 24 hour grab and go which was great when we arrived at 1:30 in the a.m. after a long flight. We were able to get some fruit, juice and a salad. A couple of dining options were available in the hotel. This was good for us, as it was not a vacation trip, and we needed to attend to some business in the area, and after driving around the area, we just wanted to rest and get off the freeway and not drive around looking for a place to eat We ordered pizza one night which was pretty good and some wine to go. We picked it up and went back to the room to relax. Shuttle service worked well for us. We sat by the pool one late afternoon, which was actually tucked in the back of the property and pretty relaxing, as we had a stressful day. One excellent feature is that Advantage rent-a-car is right on site. As we arrived late in the evening I didn't have to pick up the car at the airport the day before or shuttle back to the airport the next day to to pick one up. Likewise we dropped it off Thursday evening, as we had an early flight out Friday. I saved two days on the rental car, and the price was better than anything I could get at the airport.", "title": "Lots of good things, but....", "helpfulness": 2, "user": "dustyparker", "date": "July 13, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 134310036}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "I must note that for light sleepers like me, this is not the place to be! The thermostat is on the wall, but the fan comes on from a big old wall unit, and it is loud. It's constantly going on and off, and made it difficult for me to sleep, and woke me up several times. It's so loud that when it comes on you have to turn up the TV. This will not bother some people, but it's a big deal to me. Earplugs were of no use. Asked for a wake up call to back up the alarm clock, and did not receive it. Front desk....where are all those friendly people the other reviewers talked about? Not a smile or a good morning. This is something I rarely even notice at a hotel, but since I had to ask a couple of questions of the front desk, it became really apparent. When I called for a wake-up call I could barely get the time out before the guy hung up. If you are renting a car and traveling about the area, depending on where you're coming from this hotel may be difficult to reach. Coming off the turnpike required speeding to the far left and then almost immediately coming back to the far right to make the turn for the hotel. We passed it before we could get over and drove all over the place trying to get back. Take your gps and be prepared to switch lanes quickly (not always easy in the heavy traffic around the Newark area.) The king room was updated with nice linens and toiletries, but small, with a small bath. Great for one person, as it had a desk and club chair, but for this trip a small table and two chairs would allow us both to sit and watch TV or have a cup of coffee. Room was awkward. Again, these things aren't usually important to mw except that I was spending more time in the hotel room than I usually do. They have a business center, but bring dollar bills if you have to use it. Had to print boarding passes, printer didn't work, but the help line was very good. Luckily I just unpluged the printer and it worked.", "title": "Great place close to Airport", "helpfulness": 2, "user": "businessadvisor2", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 133908447}, {"rating": 1.0, "title": "Terrible", "text": "I stayed for one night.", "helpfulness": 1, "user": "Jennifer W", "date": "July 8, 2012", "id": 133734529}, {"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "very friendly staff, great and clean room with good mattress.", "title": "Excellent place to stay to get into the city", "helpfulness": 1, "user": "cmagnone", "date": "July 6, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 133589900}], "location": {"country": "United States", "city": "Newark"}, "stars": 3, "variance": {"poor": 76, "average": 149, "very good": 279, "terrible": 52, "excellent": 226}, "aka": "Wyndham Newark", "slim_ranking": 0.380952380952, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Choose the Wyndham Garden Hotel Newark Airport Hotel for your next trip and enjoy the results of our $10 million renovation. Located directly across from Newark Liberty Int'l Airport, our convenient location is 15 miles from NYC, 5 minutes to Jersey Garden Outlet Mall, NJ Performing Arts Center, Downtown Newark, and 12 miles to Meadowlands/Giants Stadium. We offer 349 well appointed spacious guestrooms, 3 richly decorated suites and 10,000 square feet of meeting/banquet space. Enjoy our top-of-the-line services and amenities including a newly renovated state of the art fitness center, business center, complimentary 24 hour shuttle service, 24 hour grab and go and more. Treat yourself to accommodations at the Wyndham Garden Newark Airport Hotel where our staff consistently strives to make your stay as comfortable and pleasurable as possible."}