{"user_rating": 3.5, "review_count": 258, "name": "Wyndham Pagosa", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "My husband and I stayed in the Wyndham Pagosa for a week. Of course they have a hot tub out back of the condos (with 4 units) for public use, but we only ran into the neighbors only once. There is a Recreation Facility for useby those at the condo. It has 2 awesome raquetball courts, weights, and an indoor swimming pool. They got 4 feet of snow while we were there, but the roads and sidewalks were kept perfectly clear. Very helpful staff, and beautiful place. The only problem I had the entire week we were there was that with how dry the place was, and being told that they supplied humidifiers, not getting a humidifier because they had so few was slightly irritating.", "title": "Loved the Wyndham Pagosa!", "helpfulness": 3, "user": "tinaneiner", "date": "March 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 59411128}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "My family satayed a weekend at this facility and enjoyed every min of it! The kitchen had every untinsle you can imagine, the beds were comfortable, and the view was magnificent! Pagosa Hot Springs is just a short drive away, and the ski lodge is less than a 20 min drive. We are headed back in February to take advantage of the snow!", "title": "Easy, relaxing, beautiful!", "helpfulness": 2, "user": "tesstessac", "date": "January 13, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 53408941}, {"rating": 3.0, "title": "Colorado with Husband and In-Laws", "text": "My son, 3 years old, enjoyed feeding the geese, playing put put golf, and watching a movie on the hide-a-bed in the living room. We even had one of my friends from town over with her younger son for a movie night. It was like home away from home, with no stress!", "helpfulness": 2, "user": "FriedaT", "date": "January 11, 2010", "id": 53151353}, {"rating": 2.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "That being said, the linens are of older fashion, as well as the carpet... BUT it was celan and had VERY good upkeep. I wish I could live in a place like this!", "title": "Average Accomodations at a premium price", "helpfulness": 1, "user": "goodj33", "date": "January 4, 2010", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 52560701}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Went with husband, mother and father in-law, sister-in-law and her husband and their 3 year old and 9 month old. Place was somewhat small but still nice. Had nice views of mountains with the frozen lake in the back.", "title": "Enjoyable Stay", "helpfulness": 2, "user": "ldianne", "date": "October 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 46532873}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "One bedroom deluxe unit is a good size for 2 people. Balcony wasn't clean as spider webs so couldn't use it. VERY well equipted kitchen and unit faced the small lake. Didn't see any secuirty during our stay. There was a variety of activities at the center. Many things to do especially for outdoor people. Springs downtown are great!", "title": "Spacious unit--Comfortable", "helpfulness": 1, "user": "sauquoitr", "date": "August 22, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 38466398}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We were met outside Wyndham with a friendly face welcoming us and giving instructions for check-in. Check-in was friendly, fast and informative. They asked us to listen to a presentation and we would be given a gift certificate - I think $75. We declined with no hassle. We stayed in one of the Perrigrine units. It was nicely decorated, clean and stocked with everything we needed. There are two large grocery stores nearby to stock up on food and print your photos. There were four units in our building with a hot tub to share. We had two lightbulbs out. We told them on our way to lunch and they had both been replaced when we got back. There were chairs on patio of each unit. Stars at night were amazing. We hardly saw any bugs anywhere in the whole town. We ate outside several times. No gnats or flies even. Our favorite place to eat was Nello's Bistro. Waitresses were cute and friendly. Seemed happy, worked quickly and were attentive. Food was excellent. We paid $10 for great Angus burger with sweet potato fries and $14 for awesome lasagna. Generous portions. Outside had beautiful flowers all around you with humming birds. We would recommend the Astraddle a Saddle outdoor chuckwagon dinner , campfire and wagon ride. Nice people and wonderful food. We rode the Cumbres Toltec train and loved it. It has an open car where you stand outside and ride. Beautiful. We drove about an hour to Chama from Pagosa Springs to get on the train, rode 3 hours to Osier where you get a marvelous 'Thanksgiving' dinner or meatloaf dinner. They also have a soup and salad bar and dessert bar. You can eat all you want of anything. Lunch is included in the price of your ride. Then we rode back to Chama. We rented horses and rode to the top of Broken Notch. It was a workout riding up and down the trails - about an hour and a half each way. But the view from the top was unforgettable. And you do stay at the top for a while to take in the view and that was a nice break. This was the same stable as our dinner. We signed up at Wyndham for a hot air balloon ride. Don't miss that opportunity. You can help set up and take down the balloon and afterward they give you champaigne and muffins. We went to The Springs Resort and Spa downtown. We had massages and a couple of days later did the 'soak' in their sulphur pools. They also have a regular pool. Really pretty there. The town has a river running through the downtown. Very low while we were there because of the time of year. Couldn't do any rafting here either. Children and families played in the river, sat around it and walked around. Nice park-like atmosphere. We ate at Alley House and were not impressed. We had heard it was pricey but food and atmosphere were worth it. Not to us. Our food was unremarkable and the service was poor. No atmosphere. It was in an old house but not even tablecloths. Wyndham offers the service of signing up for a lot of town activities through them and you can get it all done in one place. Some were discounted. I'd be glad to answer any questions for you if I can. It's good to learn all you can before you go. Weather was around 80 every day and around 50 at night. Shorts were ok but a little cool. Capris were perfect. but jeans weren't hot.", "title": "Wouldn't Change a Thing!", "helpfulness": 6, "user": "PagosaPlease", "date": "August 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38316256}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "Have you seen the millions of stars in the sky? Walk out of your room after dark and be prepared for a surprise. Outside our room was very quiet at night, with only a nearby air conditioner humming. The atmosphere is very relaxing.", "title": "Quiet resort property is very low key!", "helpfulness": 1, "user": "Railhistoryfan", "date": "August 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 37987846}, {"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "This property is a vacation resort / time share that also rents rooms like a hotel. Note that the front desk is closed from 9 PM to 7 AM Monday to Wednesday. They direct you to another hotel to check in, which we did. The clerk, Chester was very efficient and provided a map to our room -- a must.", "title": "Older timeshare with tortured chicken", "helpfulness": 1, "user": "DenverRalph", "date": "August 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 37882525}, {"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The rooms are scattered over a large number of small buildings, many facing the golf course. It is a good half mile from the front desk to your room. A car is a must. The property is located in a residential area, making this a safe and peaceful area.", "title": "Terrible excuse for a five star (???) hotel", "helpfulness": 1, "user": "bigbigtuna", "date": "August 14, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 1.0}, "id": 37674139}, {"rating": 3.0, "stay_parameters": "Stayed July 2010", "text": "I stayed at the Wyndham Pagosa during the first week of July 2010. Since I was staying in central Colorado on a work assignment, it was a long drive to Pagosa Springs. I don’t think you can avoid a long drive to this area since the nearest major airport is Albuquerque, New Mexico which is over 200 miles away (Denver is over 300 miles away with Colorado Springs being a closer option). After the long drive, locating the resort is no problem since the front office is located along the main road. The resort property is massive with over 400 units! For my stay, I had a two bedroom unit that sleeps 6 people in the Eagle Ridge section. The unit had three levels: on the upper level is the living room, dinning area and full kitchen; on the middle level was a bedroom with two twin beds and a bathroom; on the lower level was the “master” bedroom with a king bed and a bathroom equipped with a jet tub. The unit was nice however it was dated. It appears the unit has not received much updating since the 1990s. While the unit was clean and comfortable, it still felt worn and tired. The jet tub off the master bedroom was a bit of an issue: it took over 30 minutes for the water level to reach a decent level however by that time there was little hot water remaining. The beds were clean and comfortable but not top of the line. The kitchen was fully equipped with everything you need in a kitchen: dishes, glassware, utensils, full size fridge (with ice maker) and stove, cookware. A colleague of mine had accommodations in a one bedroom unit in the Peregrine section. His unit appeared to be more updated and also featured a Jacuzzi tub which is share amongst the units in his section. His single level unit had a main bedroom with a murphy bed in the living room area, sleeping 4 people in total. Central to the resort is the Recreational Center which features a large indoor pool, two jacuzzis, weight/exercise area, basketball and racquet ball courts, and a games arcade. Guest at the resort must present a guest card at the rec desk in order to utilize the facilities. This card is obtained during check-in. In my opinion, the weight/exercise areas are not very welcoming since they are out in front of the desk with plenty of traffic is passing by therefore offering little privacy. If you’re looking for a golf resort then look no further. Golf is offered onsite with the course running through the property. There are a few local restaurants nearby and the downtown area is only a few miles away. In the winter, the resort offers shuttles to Wolf Run ski area. If this resort was located in the central mountains (ie. Vail, Breckenridge) it would be a great vacation destination. In review, I would recommend the Wyndham Pagosa since it appears to be the best option in the Pagosa Spring area however I would stress the fact that this resort is located in a distant part of Colorado and may not be an acceptable destination for everyone.", "title": "Quiet Location with Dates Units", "helpfulness": 5, "user": "StandingRoom", "date": "July 12, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 1.0}, "id": 70651319}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "My husband, a friend of ours, and I all drove up to the Wyndham Pagosa resort over the MLK, Jr. holiday weekend.", "title": "Beautiful Winter playground", "helpfulness": 4, "user": "MTOATS", "date": "June 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66898706}, {"rating": 1.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "First of all, the scenery of Pagosa Springs in the winter was absolutely gorgeous...a reason to visit the area right there. We arrived at the resort a lot later than we were expecting, but they had everything ready and we were inside our unit within ten minutes, which was beautiful. We had a two bedroom/two bath unit. The master bathroom had a gigantic whirlpool tub, which was used several times. We were on the ground floor and our patio overlooked the lake, which was covered in a beautiful blanket of snow.", "title": "Endless Vacations ( Aka Wyndham Vacations and RCI ) are LIERS", "helpfulness": 1, "user": "DaScubaLady", "date": "May 18, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 64601227}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We had everything we needed and didn't interact with the front desk people at all, except to ask them for maps of the local area, which they happily supplied with good tips on what to visit. The parking lot was very convenient and easy to navigate.", "title": "Endless Vacations by Wyndham: Book through their website.", "helpfulness": 4, "user": "qtrready", "date": "May 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 64452207}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "We had a wonderful weekend and would definitely go back again. We highly recommend Wyndham Pagosa!", "title": "Descent place to stay if you can get past the expense", "helpfulness": 1, "user": "pmorty", "date": "April 20, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 62021855}, {"rating": 4.0, "title": "Labor Day in Pagosa Springs", "text": "September 4, 2009", "helpfulness": 2, "user": "kdhampton412", "date": "October 8, 2009", "id": 46238369}, {"rating": 2.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We spent the week of Labor Day at Wyndham Pagosa in Pagosa Springs, Colorado. The weather was cool yet warm enough to bring out the shorts in the afternoon and sleep with the windows open. It rained every day but it didn't stop us from enjoying the mountains.", "title": "Not Clean", "user": "onthego1937", "date": "September 29, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 45361789}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Our favorite hike was the East Piedra Creek Trail (just the first half), which is not only beautiful, but an easy trail for most hikers.", "title": "Very nice", "helpfulness": 2, "user": "TucsonRose", "date": "September 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 39927411}, {"rating": 1.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We spent a morning at the \"Spa\" hot springs pools. What a delight! Cool morning, hot springs. There are several hot springs pools to choose from. Try one or all of them. Each has its own personality. If you're brave, you can even try the Lobster Pot at 109 degrees! The next time we come, we'll get a week pass to be able to soak our tired hiking feet whenever they need it! They even have a special rate for seniors!", "title": "Over rated", "user": "Diazy", "date": "September 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 39695284}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We had a condo at Wyndham Pagosa. It was one of the Elk Run condos. It is one of the older properties at Wyndham Pagosa, but still in good shape. We traveled with another couple but never had a problem with privacy. The unit was split levels. You enter the door and directly to the right was the first bedroom, full bathroom & laundry facilities. Up 3 or 4 stairs was the kitchen, living & dining area with a deck off the back of the unit. Downstairs from the entry level was the master bedroom with another full bath, a large jacuzzi tub & shower as well as another deck off the bedroom. Both decks faced the golf course.", "title": "Handicapped accessibility", "helpfulness": 3, "user": "GatorGail", "date": "September 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 39514692}], "location": {"country": "United States", "city": "Pagosa Springs"}, "stars": 3, "variance": {"poor": 31, "average": 44, "very good": 99, "terrible": 13, "excellent": 71}, "aka": "Wyndham Pagosa Hotel", "slim_ranking": 0.266666666667, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}