{"user_rating": 3.0, "review_count": 1645, "name": "Wyndham Nassau Resort & Crystal Palace Casino", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "After reading the reviews of this resort, I was very apprehensive about going. My husband and I were taking our son for his 18 birthday. Our experience there was great! The hotel is dated, and if you are looking for things to complain about, of course you will find them. We checked in without a wait and the desk staff was very courteous. We stayed in the H tower and had a corner non-smoking suite. The rooms were spacious and very , very clean. The shower/toilet area had marble walls and floor. The ceilings and the walls in the suite appeared to be recently painted. The carpet was recently updated. The bedroom had 2 floor to ceiling glass walls and we had a great view of the ocean and pool through one wall/window, the other had a view of the beach at the Nassau Beach Hotel. The balcony had a table and 2 chairs and a lounge - great for breakfast room service. (Which arrived quickly, and the food was very good and the room service prices were not that bad.)", "title": "Pleasantly Surprised!!!", "helpfulness": 8, "user": "RaisinHeck", "date": "October 27, 2006", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 3.0}, "id": 6019208}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "We hung out at the pool (which not as cold as some people had said) and also used the Nassau Beach Hotel's beach area (they have the palm umbrellas to sit under and is just steps to the beautiful sea). We did get approached to buy necklaces, cigars, shells, etc., but we just smiled and said \"No thanks\" and away they went. The same thing was true for the time share people. No one was aggresive or rude to us.", "title": "GO AND ENJOY", "helpfulness": 1, "user": "Jokilly", "date": "October 25, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6011680, "likes": {"liked": "— LARGE ROOMS AND DRESSING AREA.BEACH LOCATION", "disliked": "— SLIGHTLY TIRED AND FAIRLY EXPENSIVE FOOD"}}, {"rating": 3.0, "title": "Gene from Texas", "text": "The food at the hotel was over priced, but that is par for the islands. We ate at Arawak Cay (Fish Fry) one night - had a fabulous meal for a great price. The grouper tasted so fresh - like it just jumped out of the ocean. And again, everyone there was very friendly to us. One night we ate at a steak house in the Atlantis - another fabulous meal - different price range.", "helpfulness": 1, "user": "cgreen1902", "date": "October 25, 2006", "id": 6010973}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "We had drinks at the daiquari shack across the street from the Wyndham. GREAT drinks made with fresh fruit and not stingy on the rum!!!", "title": "WARNING DO NOT STAY AT THIS HOTEL!!!!", "helpfulness": 2, "user": "sangfamily", "date": "October 24, 2006", "detail_rating": {"front_desk": 1.0, "service": 1.0, "business": 2.0, "cleanliness": 1.0, "rooms": 1.0, "location": 3.0}, "id": 6006807, "likes": {"liked": "— STARBUCKS, pool/slide, beach", "disliked": "— Hard Beds, Poor Customer Service, Dirty Hotel"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "And we did make many deposits to the casino. And again, no problem - friendly staff.", "title": "What a disgusting hotel, everyone's trying to sell something.", "helpfulness": 7, "user": "CHACHI1000", "date": "October 21, 2006", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 5981988, "likes": {"liked": "— Nothing", "disliked": "— Service was terrible, room was dirty, nothing worked, everyone was trying to sell something"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "My wife and I along with our two children, 7 & 11 stayed for a week the first week of August 2006 and we combed thru the reviews on Tripadvisor for details on the Wyndham. We where a little nervous about some of the reviews, but found this hotel to be a good deal.", "title": "Needs some work, but a great stay!", "helpfulness": 6, "user": "djseibert", "date": "October 20, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5975001, "likes": {"liked": "— Ammenities/location", "disliked": "— Time Share Offers"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2006", "text": "We stayed in tower F, fourth floor, and had a great few of the coastline. The room was in good condition, neat & clean. The bathroom showed it's age, but was clean and no mold. We never had any problems with the staff and the room was always cleaned everyday.", "title": "Read many bad reviews, But I had a nice stay", "helpfulness": 4, "user": "djamesatl", "date": "October 20, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 5973832, "likes": {"liked": "— Casino, Beach", "disliked": "— The walk to the casino"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The food was pricey, but food all over the island is pricey compared to the states!! We ate at the Hotel next door every night for dinner at Johny Canoos....GREAT FOOD & FAIR PRICES!!! The hotel store was great for cheap breakfast and souviners.", "title": "Great Value Hotel - Will Go Again", "helpfulness": 10, "user": "aligobs", "date": "October 12, 2006", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 5945048, "likes": {"liked": "— Casino"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "The beach was best at the Radison, and although we didn't spend much time at the pool (we can do that in the US!) it was clean. The Radison, Wyndham, and Hotel Nassau apparently share all facilities/beaches.", "title": "Great Stay!", "helpfulness": 13, "user": "grasshopper1222", "date": "October 11, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5939319, "likes": {"liked": "— The view", "disliked": "— The older bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "DO's & DONT'S: Do not take a cab from the hotel to downtown. Take the bus for $1.00 each way per person. They stop in front of the hotel all the time. Do take the ferry boat to Atlantis. Do spend the money for the aquarium at Atlantis & take the guided tour.", "title": "Great Honeymoon", "helpfulness": 8, "user": "Erin&Jeff", "date": "October 10, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5935072}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "I booked this hotel because I was coming in to town for one night only for business but I was hoping to be able to get in some beach time. I was not disappointed with the hotel but the cleanliness and appearance of the rooms fell way below expectations. This resort is about 3 miles from the airport (a $15 flat cab fare) and is located next to 2 other hotels - all of which form the \"resort\". This is in an area known as Cable Beach and this hotel does have a nice private beach area with lounge chairs & non-motorized equipment available to rent. The general condition of the hotel is run-down. The hotel looks like it is in serious need of remodeling to bring it up to expectations (as well as the 21st century). My room had a balcony that faced the ocean and was a good sized room. But there were obvious signs of wear & tear in my room that could easily be fixed with some paint & new upholstery. All of the fixtures in the bathroom sinks & the tub itself were very outdated so it has a 1970's feel to it. The fitness center is rather large with a spa, steam room & sauna in the women's (and I assume men's) locker room. The fitness area has a lot of weight machines, especially for a hotel, although not a lot of cardio. It maybe had 3 treadmills (one out of order), an eliptical and 2 bikes. But there was a large studio for classes and they seem to have those fairly often. The use of the fitness center is included in the $15/day/person mandatory \"resort fee\"...so whether you intend to use it or not - you pay for it.", "title": "Great location - crappy hotel", "helpfulness": 2, "user": "lolomojo", "date": "November 13, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 6122333, "likes": {"liked": "— The Location & the beach", "disliked": "— Um, can I say that I liked the hotel least? This place needs to be remodeled"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "The taxi stand always had cabs every time I needed one and they list the cost (flat rates) for various locations around the island. There is a casino here that I didn't explore and there are some restaurants at the three hotels (in which you can charge to your room at all of them) including a Black Angus at the Wyndham. The service at this hotel was above average with mostly friendly and helpful people.", "title": "Great Family Vacation!", "helpfulness": 8, "user": "kdgchick", "date": "November 6, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 6078241, "likes": {"liked": "— Hotel was clean and the staff was great!", "disliked": "— Do unto others....."}}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "What a great trip for our family! My husband and I took our 9-year old to visit Nassau and stayed at the Wyndham Nassau Resort. Let me begin by saying if you are expecting a 5-star hotel like the Atlantis, you should spend the extra 2k a night and go there. The Wyndham is an older hotel, less expensive, but still very nice inside and extremely clean!", "title": "1980s flashback, but you get what you pay for.", "helpfulness": 7, "user": "soflatravelreviewer", "date": "November 6, 2006", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "location": 3.0}, "id": 6076448, "likes": {"liked": "— It was affordable, facilities were adequate. Was a cheap 3 day vacation.", "disliked": "— Slow pool bar service, poor choice in nearby restaurants"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "Upon our arrival, we sped through the check-in process in about 10 minutes. Our room was beautiful; just what we requested -- ocean view (facing Paradise Island) with two queen sized beds. I really liked that the sink area was separate from the shower/toilet area as that made it easier for the 3 of us to get ready for outings.", "title": "Not perfect but good", "helpfulness": 6, "user": "ohworldtraveler", "date": "November 1, 2006", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 6042937, "likes": {"liked": "— the view!!!!!!!!!!!", "disliked": "— The one pool, it was being worked on the entire stay. Limited resturants."}}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Everyone at this hotel was more than ready to help or answer any questions we had. I read several reviews that stated there were lots of sales people on the beach but when we were there, the lifeguards would run them off during the day and the security guards would keep them away at night. One night there was an extremely loud private beach party down at the Breezes that started around 6pm went on until around 4 am. The night manager was kind enough around 11 pm to bring us a key so we could sleep in a room on the other side of the hotel without actually moving rooms. Thanks Dante!", "title": "Nice View, BAD HOTEL! EXPENSIVE!!!!", "user": "marblekit", "date": "October 28, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 6020383, "likes": {"liked": "— Nice view of the beach/ocean... nice location", "disliked": "— The hotel is OLD and DIRTY. Price is way too high for such a low class hotel"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled solo", "text": "I took a quick 24 Bahamas gambling trip and stayed at the Wyndham because of the onsite casino and the fact that it's on cable beach. It's true that it's a little rough around the edges and could do with some renovation, but overall, it's a nice place. I paid $78 plus the 12% hotel tax (also a daily \"resort fee:\" is charged..more on that later.) Reception was exceptionally friendly. I was upgraded to an oceanview room. The room was huge and beautiful with 1 king size bed. There was a nice balcony with table and chairs facing the ocean. There was a safe, refrigerator, iron with board, and hair dryer in room. Bathroom was huge also. I really can't fault the room for the price I paid.", "title": "I liked this place!", "helpfulness": 11, "user": "Eric M", "date": "October 7, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5926280}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "The beach directly in front of the hotel is not really that great, although the pool and spa are pretty nice. There are other hotels on each side of the Wyndham, really making one large resort, and guests from all the hotels use the amenities in all 3 hotels. The beach in front of the Radisson is great.", "title": "Crystal Palace Mediocre Review", "helpfulness": 12, "user": "lcesnick", "date": "September 18, 2006", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 4.0, "location": 2.0, "rooms": 2.0}, "id": 5812114, "likes": {"liked": "— Starbucks by Casino", "disliked": "— location...not alot of shopping, dining nearby"}}, {"rating": 4.0, "title": "Needs some renovation but still likeable", "text": "There are a lot of great dining oprtions. The Seaside Buffet is excellent value and delicious. The Casino is great with friendly staff, and they allow neat casual attire. (As long as you are not walking in soaking wet from the pool.)", "helpfulness": 8, "user": "urbanminx", "date": "September 15, 2006", "id": 5805455}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "There's is a \"resort fee\" charged which is separate from your regular hotel bill and tax, and it is PER PERSON, PER DAY. There is a mandatory gratuity of $4 for the housekeeper (!), and the resort fee of $11 which, the hotel says, covers amenities such as use of pools, fitness center, waterslide, non-motorized watersports, and for use of the in room safe and fridge. They also open an account for you to charge things like meals in the restaurants, drinks, room service, etc. So you pay of your account along with the fees on checkout. I was by myself and for only 1 night so I didn't worry about this too much, but this can get quite expensive for say a couple staying for a week. This would make a $48 maid gratuity (!!) and a $132 Resort fee which are both not included in the hotel price and payable on checkout! This is really the one drawback of this hotel. Other than that it's really not bad.", "title": "Best Snorkeling", "helpfulness": 1, "user": "emstnmom", "date": "September 12, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 5793600, "likes": {"liked": "— snorkeling", "disliked": "— there is no shopping after 6 pm"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We stayed at the Wyndham Crystal Palace in Sept '06. I reserved 2 rooms through RCI and was told that if adjoining rooms were available, we'd be given adjoining rooms.", "title": "Not as grand as it once was, but not terrible either", "helpfulness": 11, "user": "nuclear11", "date": "September 8, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 5780108}], "location": {"country": "Caribbean"}, "stars": 3, "variance": {"poor": 269, "average": 383, "very good": 467, "terrible": 324, "excellent": 202}, "aka": "Wyndham Nassau Resort And Crystal Palace Casino", "slim_ranking": 0.6, "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.5, "rooms": 3.0, "location": 3.5}}