{"user_rating": 4.5, "review_count": 411, "name": "Xandari Resort & Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We spent our first and last nights at Xandari and I've never had an experience quite like it...the rooms, the staff, the FOOD! The food was amazing! We arrived at the hotel early, around 10am, and I didn't know if we were too early to check in, but when we got out of the van were greeted with freshly squeezed pineapple juice and told that our room was all ready.", "title": "Perfect peace", "helpfulness": 4, "user": "NYCtravelbuff", "date": "November 12, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6110348, "likes": {"liked": "— Food, spa, and waterfall trails", "disliked": "— A little bit isolated if you like walking to other parts not in your own resort."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Xandari is designed with the guest in mind - for sure. Private, beautiful, and with the best little kitty to keep you company. I've heard he will climb into bed with you if you let him.", "title": "Amazing end to our trip!", "helpfulness": 2, "user": "EconProf", "date": "August 6, 2006", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5564041, "likes": {"liked": "— The artwork and ambience", "disliked": "— Seemed a little distant from other activities in San Jose"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "There are books, games, a nice gift shop with local crafts, and seriously the food was the best I had in Costa Rica.", "title": "Made it even harder to leave Costa Rica", "helpfulness": 3, "user": "JohnT.tn", "date": "July 27, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 3.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5516779, "likes": {"liked": "— Patio/Food", "disliked": "— Hiking trails"}}, {"rating": 5.0, "title": "More than Amazing", "text": "My only advice, or warning - when they say the restaurant closes at 9:00pm, they mean they close, not that they'll seat you till 9:00pm. On our last night we had just received our entrees when the music turned off, the lights turned up, and we no longer had any server...", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 14, 2006", "id": 5466220}, {"rating": 5.0, "title": "great place to stay", "text": "We spent the final day of our six-day trip to Costa Rica at the Xandari, after spending five days at the Lapa Rios EcoLodge. It was more than we expected. On arrival, we were offered pineaple or mixed fruit juice, and then taken to our bunaglow. Since we were celebrating our 25th wedding anniversary, the staff had decorated the room with flowers!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "June 17, 2006", "id": 5357104}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "We immediately fell in love with this place and felt so relaxed our entire stay-the landscape is breathtaking and the gardens are beautiful. This place has a very private feel. Its worth getting a spa treatment in this very unique spa. The dinner was outstanding. If you like places that have no feeling that resembles a chain hotel, this is the place for you. Special attention is paid to every detail!!! Well worth the money", "title": "On our list of favorites", "helpfulness": 2, "user": "kumabear", "date": "March 2, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4570107}, {"rating": 3.0, "stay_parameters": "Stayed January 2006", "text": "We arrived very late after a full days drive from the Osa Peninsula and were very pleased to see our lovely, comfortable room with fabulous views over the valley. Unfortunately the restaurant had closed as it was just after 9pm and we were only offered beef or chicken sandwiches. The rooms are large and beautifully decorated with wall art and ornaments. The grounds are superbly kept with gorgeous plants and flowers and walking trails which are marked with varying degrees of difficulty. The only real negative comments are directed at the swimming pool areas. One of the pools' water was completely green with a notice asking guests not to swim; the other pool was looking a bit tired, with the the surrounding concrete looking rather messy and dirty. There were some empty glasses on a table which had obviously been there since at least the evening before and were never cleared away during our entire stay. It is unfortunate that a hotel of this standard and standing allows the swimming pools to be so badly kept. Perhaps some money should have been spent in these areas in addition to the new Spa in this hotel, and their new hotel by the coast at Jaco.", "title": "Beautiful but a bit tired", "helpfulness": 6, "user": "The Penguin", "date": "February 18, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 2.0}, "id": 4468083}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "It only takes about 20 mins upon leaving the \"craziness of San Jose\" and you arrive at this suburban oasis. The spa, food, architecture, art, rooms, grounds....all first class and truly a sensory overload. I highly recommend that you utilize the Xandari as a first or last stop destination on your CR vacation. My girlfriend and I stayed here in March 2006 for our first night. It was the peferfect spot to unwind following an afternoon of traveling...we enjoyed the spa with our private cabana, watched the sunset from our amazing villa's balcony and enjoyed a wonderful healthy meal, and plenty of wine, that evening. With regards to our Villa...do not get \"cheap\" - - upgrade, upgrade, upgrade and enjoy these amazing \"rooms.\" My only complaint of the Xandari is the condition of their pools and the immediate area surrounding them. The water truly looked green. I could not even see the bottom. Also, the pool side area was very shabby (and I promise I am not being picky). Maybe this isn't the norm...but both of us opted without hesitation to stay clear of these areas. The rest of the grounds, however, are amazing - - take a walk on one of the many trails. I've never seen so many shades of green. Anyway, enjoy your stay in CR...and don't be afraid to pamper yourself for a day at the Xandari.", "title": "Relaxation - - Only 20 Mins from San Jose", "helpfulness": 1, "user": "morevacation", "date": "May 13, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 3.0}, "id": 5065576}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "I had an okayyy stay. Not terrific, not horrible. Some parts of the hotel looked kinda.... gaudy. If you don't like the owner's taste, tough luck. Everything is decorated in the same kinda style. I thought it was okay... I think this resort belongs in Hawaii, not Costa Rica. It didn't have the Costa Rica feel to it, not at all, whatsoever. I guess I expected too much.", "title": "Expected more from Xandari", "helpfulness": 2, "user": "kd2006", "date": "April 24, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 5005452}, {"rating": 2.0, "stay_parameters": "Stayed February 2006", "text": "Breakfast was good, the Xandari Pancakes were really good.", "title": "An Andrew Harpers DISAPPOINTMENT", "helpfulness": 6, "user": "catguy1000", "date": "March 23, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "service": 3.0}, "id": 4726704}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "Dinner was good but pricey.", "title": "Trust me...you'll love it!", "helpfulness": 9, "user": "lotusveda", "date": "March 15, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4626000}, {"rating": 5.0, "title": "Wonderful", "text": "We stayed here twice during our trip. I planned it in advance. The second time we got upgraded. Huge room with a sun room, dining area, and huge bathroom.", "helpfulness": 5, "user": "ab0si", "date": "March 8, 2006", "id": 4595068}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "Not to be missed if you are visiting San Jose and would like to stay in a peaceful, gorgeous place. Close to the airport (15 minutes). Not a typical hotel at all -- the rooms are set up as private villas, scattered around the property. Rooms are large, with private patios and huge bathrooms. The architecture is eye-catching and flowing and blends into the landscape --looks great and is also lovely to stay in. Has a very peaceful, natural look and feel. Beautiful accomodations and amenities, extremely friendly and helpful staff, great food, in a peaceful and beautiful setting on a very large piece of land. Lovely views overlooking San Jose. Suitable for all ages -- we were a group encompassing 3 generations, from ages 11 to 75, and we all loved it and agreed it was one of the nicest places we'd ever been. Nice pool, hot tub. Food in the restaurant was excellent, focusing on fresher, lighter preparations, with many vegetarian options. This is where I will stay the next time I visit San Jose.", "title": "Amazing Place!", "helpfulness": 4, "user": "Paul99501", "date": "February 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6781094, "likes": {"liked": "— Private, quiet, beautiful, comfortable, great food."}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled solo", "text": "This is a wonderful spot, with great views and less severe weather than the coast. I recommend you take one of the free-standing villas, as they have great outdoor space.", "title": "Relaxing, laid back stay", "helpfulness": 2, "user": "Kiltboys", "date": "February 7, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 6753363, "likes": {"liked": "— location", "disliked": "— no issues here"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "The staff here are first rate. They learn your name, and address you personally the next time they see you. I had a phone call to my room while I was having breakfast, they tracked me down and brought the cordless phone to my table.", "title": "Mixed Feelings", "helpfulness": 3, "user": "BarbNY", "date": "February 1, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 6726468, "likes": {"liked": "— Food", "disliked": "— Paper thin walls"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with friends", "text": "Food is very good and reasonable. Arroz con pollo and an amazing pumpkin/coconut pie thing were my faves.", "title": "Beautiful grounds and lovely room", "helpfulness": 3, "user": "Playafan", "date": "December 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6504970, "likes": {"liked": "— The peacefulness and graciousness", "disliked": "— The exposure from the shower to the patio"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2006", "text": "While the grounds and the food at Xandari were amazing; the walls are paper thin. If you're a light sleeper, you can hear the people in the next room and workers at 6 am. The hike to the falls is worth the trip.", "title": "Average", "helpfulness": 4, "user": "horsedeal", "date": "December 26, 2006", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 6500982}], "location": {"country": "Costa Rica", "continent": "Central America", "city": "Alajuela"}, "stars": 3.5, "variance": {"poor": 2, "average": 14, "very good": 73, "terrible": 2, "excellent": 320}, "aka": "Xandari Resort And Spa", "slim_ranking": 0.0689655172414, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 5.0, "location": 4.5}, "description": "Xandari is a 40-acre plantation with botanical gardens, orchid house and over 5 kms of nature trails including five waterfalls. Xandari is the creation of an architect-artist couple, with 24 spacious villas overlooking the Central Valley. Only 20 minutes from Juan Santamaria International Airport. In addition, three fabulous swimming pools, including the new 125 ft. long Sunset Pool with a stunning view, and two outdoor jacuzzis. The restaurant serves fresh & healthy continental and Costa Rican menu, featuring many organic fruits and vegetables from our own gardens. Xandari Spa Village is harmoniously integrated with nature and consists of a Yoga Room and five private palm-roofed jalapas with jacuzzi perched on a mountain ridge, where natural ingredients are used in massages and body treatments."}