{"user_rating": 4.5, "review_count": 329, "name": "Yacht Classic Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "We stopped here on our sailing holiday round the area, escaping a non existent storm. But lucky for us the forecast was wrong, as the lovely facilities here were a highlight of the trip. You can park your boat for not much, if you eat. The restaurant is great if not cheap, lovely views, and breezy setting. Next best was the pools, just the right depth for all, not too busy, the kids were happy for a whole afternoon. But best overall was discovering the James Bond connection, for our then-obsessed son (Daniel Craig stayed there filing sky fall,mother boast. Overall would highly recommend.", "title": "bond excitement", "helpfulness": 1, "user": "twoplusonetravel", "date": "July 23, 2013", "detail_rating": {"value": 4.0, "location": 5.0, "service": 5.0}, "id": 168764224}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "This hotel is very nicely decked out with great waterfront dining. The staff were friendly & helpful. We were met by the concierge who showed us around, gave us coffee & helpful advice about Fethiye. It is centrally located within walking distance of town & the fishmarkets.", "title": "Excellent Hotel", "user": "PeterandDeb", "date": "July 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 168353125}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We arrived at the Yacht Classic in Fethiye by boat. We had been sailing for ten days and I was fed up with sleeping on a table with no air con. I went to see the Front Office Manager, Mustafa Kuzucu and he said he had a room for one night. It was luxury. I felt like a celebrity that had just been let out of the jungle. The room was spacious with a lovely view, balcony and all the things you need. The location is superb. Over looks all the boats in the private marina and the hills beyond, has two lovely swimming pools, a hamman and delicious restaurant.", "title": "WOW", "user": "LucindaS", "date": "July 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 167783238}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "After one spoiling night we did not want to leave. So I was back to the front desk to see Mustafa who managed to find a different room for us for a further two nights. It was a completely unscheduled stay but we felt we had found a real gem. Mustafa Kuzucu was really friendly and helpful and did everything he could to make our stay special. Next year we want to go for a week!!!", "title": "Simply elegant with wonderful service and amazing staff", "helpfulness": 1, "user": "Helen M", "date": "July 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167554431}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "My only two small negative comments are the the lighting in the hotel is not good and the breakfasts were very disappointing. Cappuccinos from vending machines!", "title": "Excellent in every way", "user": "Benny18", "date": "July 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 167477195}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We spent a week sailing around the Fethiye / Gocek area & very happily accidently stumbled upon this place. Speaking to others sailing in the area, we realised that this is a gem amongst the marinas. The facilities are spotless & extremely well run. Two great pools to relax around.", "title": "A great place to dock your yacht & eat ... we'd definitely return", "helpfulness": 1, "user": "306KarenK306", "date": "June 10, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0}, "id": 163539537}, {"rating": 3.0, "stay_parameters": "Stayed June 2013", "text": "As part of the docking arrangements, you have to eat at the marina restaurant. The food was very good. The steak was cooked as requested & the seafood was delicious. Although we'd give the starter meza selection a miss next time as it was a little flavourless.", "title": "Beautiful location, what's up with the breakfast?", "helpfulness": 5, "user": "Summerer27", "date": "June 7, 2013", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 5.0}, "id": 163239912}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "When we're next back in the area, we will definitely include this marina in our route.", "title": "Fabulous Hotel", "helpfulness": 4, "user": "Travellers2Uk", "date": "May 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161951334}, {"rating": 5.0, "title": "No wonder 007 stays here!", "text": "Amazing location, beautiful room (but we did book the penthouse). However restaurant quality was atrocious and does not match up with the standard of the hotel. Coffee is totally undrinkable from the crap machine they have, so we ended up drinking the Turkish coffee. Orange juice was also terrible, no excuse in Turkey, and overall the buffet was simply not good enough. Its a shame because the location of the restaurant is beautiful right down on the water. If u stay here, book the room only and eat breakfast elsewhere.Not only will you get better food but probably better service, restaurant staff here have an attitude and are just plain miserable.", "helpfulness": 7, "user": "Rob G", "date": "May 21, 2013", "id": 161423193}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "On our journey across southern Turkey we stopped in Fethiye for a night and wish we had stayed longer. We made a late booking for this hotel and when we arrived we could not believe our luck. We were travelling over the Easter break and had to ask the desk the following morning if the prices were right as it was so inexpensive for the high standard of the hotel. This is a lovely hotel with great views and just a two-minute stroll from the centre of town. The hotel rooms are spacious and well-appointed, with excellent bathrooms.", "title": "A wonderful waterside location.", "helpfulness": 3, "user": "delighted-client", "date": "May 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 161402736}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We loved staying at the Yacht Classic Hotel. The service and the people were lovely. Especially Rose who went out her way to make things happen, she was always at hand at all times. The hotel was lovely and clean at all times. The staffs at the breakfast bar were fantastic, they all looked professional and were accommodating at all times. The hotel is located in a good area and not too far from the main square (walking distance). We fell in love with the marina it was stunning; however the spa services can be improved. Overall we thoroughly enjoyed staying here and will definitely recommend this hotel to others.", "title": "A Great Stay!", "helpfulness": 1, "user": "871Unknown", "date": "July 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 166135440}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Hotel was amazing, staff very friendly & helpful. Beautiful surroundings & views from balcony magical. Food fantastic, best holiday we have ever had. Going to go back soon. Michael & Judy", "title": "Honeymoon", "helpfulness": 1, "user": "MichaelBee_13", "date": "July 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166121937}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Only a 5 minute walk into Fethiye town and to the harbour. Boat trips easily available and highly recommended. If you are lucky you might see some turtles.", "title": "Was great, became even better", "helpfulness": 4, "user": "Louis T", "date": "June 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0}, "id": 165513274}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Fethiye is near to many interesting places including the \"Blue Lagoon\" and ghost town to name just two. The hotel staff will advise on best way to get to these different places.", "title": "flash", "user": "Wayter", "date": "June 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 165260390}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "The hotel tourist advisor went out of her way to make our honeymoon extra special, helping with a secret romantic evening.", "title": "Beautiful stop on a boat", "helpfulness": 1, "user": "gsmason", "date": "June 13, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0}, "id": 163847797}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Very happy on our arrival, location, checkin, pool and room all great, however, whilst waiting for our room to be available we were accosted by the woman who showed us around the hotel asking if we'd want to book everything hotel and more. We repeatedly stated that we just wanted to go for a walk but she just persisted anyway, major turnoff. Restaurant food was very good, breakfast was ok but could do better. All that said, you won't be disappointed you booked here if you look past the service. Don't book a spa treatment, left very disappointed.", "title": "Very nice but needs improvement", "helpfulness": 2, "user": "Syl K", "date": "July 13, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 167413418}, {"rating": 4.0, "title": "Beautiful hotel", "text": "Stunning hotel but staff were a bit off. On arrival we were greeted by I'm assuming the customer service woman. All I can say is that if you are in a service orientated industry at least smile at your customer. She was rude and pushy. We had only arrived and within 5 mins was trying to get us to sign up to tours etc. She actually put me off and did not sign up for anything. The massage I received a massage from the spa centre (male) was not good at all! The food in restaurant was nice. They need to upgrade breakfast. Also staff did not speak English well enough to even muddle through a basic coversation. The actual hotel was very nice and clean. But for the rates the can do better.", "helpfulness": 2, "user": "Lovedarwin", "date": "July 13, 2013", "id": 167412369}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "Just come home from another brilliant holiday in the Yacht Classic, everything first class as usual. We would recommend this hotel to anyone looking for a relaxing holiday in a beautiful location. The food in the hotel we found to be the best out of all the restuarants we ate in during our stay.", "title": "Fabulous", "helpfulness": 1, "user": "janeejones", "date": "July 11, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 167148620}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Thanks to all the staff especially Mustafa who is always so helpful, to (Frido not sure if I,ve got the name quite right) who always checking if your ok , Enime who always had a lovely smile for us and of course Emre just for being Emre, and it's always good to see Bill propping up the bar. Thanks to Bato and Bano for making us feel so welcome to their wonderful hotel. All being well looking forward to seeing you all next year", "title": "Excellent hotel but rooms a bit small", "helpfulness": 1, "user": "miles28", "date": "July 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 166652406}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Reception was good and check-in smooth. We had our teenage daughter with us and to save costs we elected to put a sleeper couch in our room- for this we were charged 100 euros for the 2 nights which is really excessive.", "title": "A lovely hotel and a great stay - just a few details missing for a boutique", "helpfulness": 1, "user": "Marie-claire L", "date": "July 5, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 166408538}], "location": {"country": "Turkey", "region": "Turkish Aegean Coast", "continent": "Europe"}, "stars": 4, "variance": {"poor": 8, "average": 11, "very good": 61, "terrible": 5, "excellent": 244}, "aka": "Yacht Plaza Fethiye", "slim_ranking": 0.0392156862745, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "The newly renovated Yacht Classic Hotel opened its doors with the Turkish hospitality that underlies the service it gives its customers, along with its elite decoration and comfortable rooms. The hotel is ten-minute walking distance to the city center of Fethiye. The hotel is open throughout the year. Located at sea level, our facility offers a warm family atmosphere. The hotel’s image reflects our centuries-old, deep-rooted Mediterranean culture.Our rooms, with their unique sea view, have the quality of a five-star hotel. We offer family, deluxe, superior and standard rooms. We furnish our rooms with many amenities, meeting all the needs of our guests. Guest satisfaction is the ultimate objective of our service."}