{"user_rating": 4.0, "review_count": 1749, "name": "Yavapai Lodge", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Great price and great location in the park. Rooms on the first floor of the lodges are preferable. Rooms are clean and tidy and equipped sufficiently. Great steak restaurant at Tusayan. Little store in the park area to buy food and drinks.", "title": "Nice hotel in the forest of the national park", "user": "gizmofrankfurt", "date": "January 24, 2010", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 54235586}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Stayed for 1 night and was pleasantly surprised with the room. It was a good size with coffee facilities, bath, air con etc and was very clean. It is in a wooded setting and there is short walk to the shop and cafe. the cafe is disappointing in terms of food quality but there is nothing else nearby and may be yous houldn't have expectation that are too high!!. However we drove into Tusayan for breakfast the following day.", "title": "great location for the Canyon", "user": "TGBWorcestershire", "date": "January 17, 2010", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 53681854}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We ahve always stayed outside the park when we have been before so it was definitely well worth saying within the park this time - you are so much closer for those early morning sunrises!!", "title": "Decent accomodation", "user": "VisaCollector", "date": "January 10, 2010", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 53073315}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The lodging was adequate. We wanted to maximise our time outside so wanted no frills, but in the park. Had no complaints, but nothing outstanding either. Drawback is the distance to some decent food, the cafetaria with the lodge is rather poor. Strange thing was that the light switch at the door operates the coffee maker and desk lamp, so if you forget to switch on the desk lamp before leaving the room you'll have to cross the room in the dark to find a light switch. Front desk was helpful. A check-in time of 16.00 does not leave time to explore the park the day of your arrival, but they assigned us a room that was ready at an earlier hour.", "title": "Best out of limited options - glad we stayed here", "helpfulness": 2, "user": "Travelling_Families", "date": "January 3, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 52422886}, {"rating": 1.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "We had 3 weeks travelling in the US from Australia, and stayed in a range of hotels, mostly four to five star hotels.", "title": "Not for me....", "helpfulness": 1, "user": "Firedancer2009", "date": "December 5, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 2.0, "rooms": 1.0}, "id": 50704398}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "I wish there were 2 places to review Yavapai Lodge on Tripadvisor. That way the reviews could be separated by Yavapai EAST (2-story hotel style rooms - larger and air conditioned) and the Yavapai WEST (1-story motel style rooms - not air conditioned). We have stayed in both room styles at Yavapai Lodge - They are distinctively different. This was our first time in Yavapai EAST. We decided to splurge and enjoy the air conditioning and larger room ($46 more than Yavapai West). We were glad we did!", "title": "Clean and comfortable with a great view", "helpfulness": 5, "user": "funNsun324", "date": "May 12, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 129829416}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The lodge room we stayed in was clean and comfortable! Our room was on the first floor (by request) with a King size bed, couch, mini refrigerator, large desk and large bedside tables ... many places to spread our things out to make ourselves \"at home.\" Our room faced the parking lot, but there were many large trees to partially block the view of the cars, so it was still a very relaxing view!", "title": "Modern and comfortable", "helpfulness": 3, "user": "MAmommy", "date": "May 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 129784601}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The Yavapai Lodge is a short walk from the rim and tucked away in the forest. We've stayed in 4 different lodges at GCNP - Yavapai is our favorite. We love it's quiet location, yet close to the bus stop and market place. Being able to park in front of the room is a big plus. (Parking at the rim lodges gets complicated and can be quite a walking distance from the car to the room.)", "title": "Surprisingly nice place", "helpfulness": 2, "user": "trvlquestions", "date": "May 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 129709892}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Cons: The bottom sheet is not fitted and too small to tuck under the mattress properly, so it kept wadding up under me. I'm picky and hate sleeping on wrinkles, so the ill-fitting sheet kept me from having a restful sleep. In spite of that, the room was nice enough that we would stay here again.", "title": "Nice place to stay but little too expensive, very close to Mother Rim", "helpfulness": 3, "user": "MayHendrawati", "date": "May 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 129569123}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Modern and comfortable facilities inside the Grand Canyon national Park. We could not find lodging at the rim hotels that suited us, so we stayed at Yavapai. It does not have the view that the rim hotels, e.g. Bright Angel, would have, but it is also not as crowded as the rim hotels.", "title": "just like camping", "helpfulness": 2, "user": "AlgarveSunman", "date": "May 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 129551047}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "My friend and I arrived at the Grand Canyon with no plans! First thing was to book a room. I was told that all the lodging at the Grand Canyon was in the same system so one person was able to look up which places had rooms available and by pricing, so I wasn't calling each place individually. We stayed at Yavapai and the room was simple, clean, and had comfy beds. Plenty of room for 2 people. I could see a family of 4 being a little crowded but you're really paying for the location. The concert/stone walls kept out all the noise.", "title": "Good Stay", "helpfulness": 1, "user": "gleealee00", "date": "May 7, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129490476}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The room was clean. But, it's a concrete block room, for God's sake! No air conditioning! Fairly comfortable beds. If it was not 1/2 mile from the big gulch, it would not be worth it.", "title": "Nice, clean, a little too expensive for what you get.", "helpfulness": 1, "user": "I75burner", "date": "May 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 129332297}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Stayed at this lodge in April, it was not our first choice but as Bright Angel and Thunderbird were full I ended up here, I was very happy with the lodge room and the facilities, good beds, TV and bathroom all spotless and well maintained .", "title": "Yavapai lodge in snowy April", "user": "irate321", "date": "May 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 129328161}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Couldn't think of anything the room did not have, the view from the large window was of forest which looked even better in the morning after 3\" of snow overnight, nothing is very far from here on the free shuttle buses so really it does not matter too much where you stay as long as you unless you insist on walking out of your lodge and straight into the canyon as you can at Bright angel lodge.", "title": "Smaller than expected", "helpfulness": 1, "user": "TravelEQ", "date": "May 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 129306752}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We found some of the best views on driving out of the park the next day, in particular the view points on the way to Dessert view were spectacular.", "title": "Decent place to stay", "helpfulness": 1, "user": "LissaJones", "date": "May 2, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "rooms": 5.0}, "id": 129248954}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We stayed in Yavapai West and actually were pleasantly surprised. The rooms are located in 1- story block buildings and don't look very impressive from the outside. The rooms have been updated recently, furnished with nice beds and flat-screen TVs. The bathrooms are rather small, but have everything that is needed. We were there in March and it was cold. The heater worked great, but I don't know what it will be like in the Summer without AC. Parking was great - right outside the door.", "title": "Not bad for a National Park lodging", "helpfulness": 2, "user": "kori", "date": "May 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 129212293}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We didn't drive at all and bus stop, cafeteria, etc were all in walking distance for us. Check-in was very slow and we stood in a very long line for a long time. The main problem was guests checking in and asking 100 questions from which restaurant to where for Sunset. Most of the questions should have been asked in the visitor center.", "title": "Adequate lodging", "helpfulness": 1, "user": "dingle58", "date": "May 1, 2012", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "location": 4.0, "service": 3.0}, "id": 129209525}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "My only complaint is the cafeteria. The food at any price would be terrible. But considering the prices they charge for it, it's almost a crime. Two years ago we ate all out meals in the same cafeteria and it was a lot better. I think Xantera should be ashamed.", "title": "Comfy beds--snow in April!", "helpfulness": 3, "user": "travelfamilybothell", "date": "April 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129144739}, {"rating": 3.0, "stay_parameters": "Stayed April 2012", "text": "There is WiFi in the in the cafeteria and the reception - the cafeteria is a more comfortable place to sit down to work on the computer.", "title": "Yavapai West Basic Lodging", "helpfulness": 1, "user": "wecanoe", "date": "April 29, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 129060173}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Stayed in Yavapai East and found the room a little drab with a funky smell. The bathroom was quite small, the bed was reasonable, but of course the location in the park made for peace and quiet at night.", "title": "Does the job", "helpfulness": 1, "user": "A-Canadian-in-London", "date": "April 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 129041618}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "I visited the canyon recently with my husband. As we booked a couple of months prior, this lodge was the only one that was still available. We stayed in the west wing which is not directly next to the lobby like most motels/lodges. We had a car so it was convenient. It takes less than a minute drive to the rooms or about 15 minutes walk away (the day we visited, it was 3 degrees fahrenheit, so it was much better to drive than walk!!). The room itself was much nicer than I expected. I was very surprised to see a flat screen tv! Very comfortable beds with clean sheets/bedding. Bathroom was abit small but clean. Fridge and coffee makers were available. But no iron and boards. Air conditioning/heater was really loud so we had to turn it off at night. In terms of the location, it is not across the rim unlike the other lodges (bright angel and el tovar which had rim views!!). The closest rim view is at the yavapai point which is about 0.5miles away. We took the free bus shuttle (blue) from the metro plaza which is just next to the yavapai lobby. This plaza has a grocery store which provides all necessities (although pricey). Overall, this is a nice lodge to stay if you don't mind its distance. However, for future trips, I would book for something just directly next to the rim.", "title": "It was nice although not directly across the rim", "helpfulness": 1, "user": "alittleangel", "date": "May 13, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 64014722}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "Stayed at the Yavapai Lodge West in a newly renovated room. We could still smell the paint & everything looked new! Flat screen TV a plus. We were in a one-story building, so nobody overhead, but the walls were thin & we could hear the people next door leaving early in the a.m. The building was nestled in the pines - beautiful location. We drove over to the main building at market plaza & caught a shuttle to Grand Canyon Village (though it wouldn't be too far to walk to the shuttle stop). Ate breakfast at the cafeteria there & prices were reasonable & food adequate. One policy that I thought was a little strange: they charge your credit card when you make the reservation, so a credit would have to be issued if you cancel.", "title": "Beautiful setting in the pines", "user": "phxmom4", "date": "May 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 63859936}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "We staid in \"West\" room, it looked like they were recently refurbished with newer carpet, the refrigerator in the room was convenient, the beds were super comfortable, big flat TV. Location is not \"rim view\" but shuttle stop, cafeteria, general store, etc. are in easy walking distance. We would definitely return.", "title": "We really liked the Yavapai Lodge", "helpfulness": 1, "user": "InnaTs", "date": "May 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 63763872}, {"rating": 4.0, "title": "Nice place to stay near the Rim and the price was right", "text": "We just got back from our trip out west and only stayed at the Yavapai Lodge one night. We paid less for a room with no A/C and it worked out fine--as long as they had heat! (Night time and morning was chilly! We weren't in the room during the day so I'm not sure how warm the room got then.) This was the only place near the Rim we could reserve with fairly short notice. Our room was really quite nice, with a flat-screen TV and nice bedding, a comfy bed, and it looked like new carpet. Bathroom had a good shelf over the toilet which was useful. Good shampoo/lotion/shower. The staff here were friendly. This was a fine place for what we needed for one night's stay, comfortable, quiet, and close to the Rim. A market, post office and gift shop are nearby. The only thing bad about this place is it's hard to find at night, and the cafeteria had a lot to be desired. You can pick up the shuttle to go all around the Grand Canyon which is convenient. I would recommend the Yavapai Lodge for people who want to stay close to the Rim but are on a budget.", "helpfulness": 1, "user": "needmorevacationdayz", "date": "May 8, 2010", "id": 63591728}, {"rating": 4.0, "title": "Perfect place to \"Hotel Camp\" at The Grand Canyon", "text": "Hubby refused to camp, so we had to shell out for a hotel room. I was scared of what the prices might be a such a popular place. It turned out to be the perfect place to sleep and \"hotel camp\" while spending long, active days hiking the trails in the park. It was snowing when we arrived! (So hubby got a few points there, it would have been miserable if we had been camping). The staff was very nice and the room was toasty warm (remember, it was snowing). By the way, they do NOT sand or salt the roads in the Park if it snows. We did pass one car that had lost it and kissed a tree on the East road entrance, not pretty.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "May 2, 2010", "id": 63018765}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We planned our trip to the Grand Canyon relatively last minute - about 2 months in advance. I was disappointed that almost all of the lodging within the park was fully booked. We did manage to get a room here at Yavapai. We had the choice of West or East - with a price difference of about $50 per night. We chose the cheaper option as it seemed the only difference was air conditioning. The daytime temperature was about 60 and the nighttime temperature was just below freezing, so we didn't need air conditioning!", "title": "Basic and comfortable", "user": "CJM_in_the_UK", "date": "October 25, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 2.0, "rooms": 3.0}, "id": 47749090}, {"rating": 3.0, "title": "Best part was the deer outside our lodge,and the fridge in room!", "text": "We didn't have a refrigerator in the room as a number of the other reviewers have noted. We just kept all of our drinks in the car overnight and they were nice and cold the next morning.", "user": "dogsrule", "date": "October 25, 2009", "id": 47710710}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The bed was comfortable (there were 2 double beds in the room) and the shower was very good. The shower was actually stronger than the shower at the Mandalay Bay, where we had stayed previous to this.", "title": "Good place to hang your hat, but they could do so much more.", "user": "JhonB", "date": "October 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 47271812}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "It did seem quite a walk to the rim - not a big deal if you are a hiker (I'm not!) but as we had a car there were no issues with getting around. We didn't end up using the shuttle bus but it seemed pretty convenient to the lodge. We also didn't eat at any of the restaurants but we did use the grocery store which had a big selection (prices were a bit high as to be expected when you have a captive audience).", "title": "Great after rim to rim backpacking trip", "user": "DiveTravelerPhoenix", "date": "October 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 46969336}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "All in all it was a fine place to crash for a couple of nights.", "title": "Better than expected", "user": "giggs92", "date": "October 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 46875680}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "My partner and I traveled to the Grand Canyon with another couple and reserved rooms at Yavapai many months ago. Based upon other national park lodging we've experienced, we were thrilled with the Yavapai. It's located about 1 mile (walking distance) from the main village and other lodges on the rim. We thoroughly enjoyed the walk to the village and were so happy to be away from the frenetic energy of the village. The mood and energy level at Yavapai is much more subdued, making it feel more like a true national park experience rather than Disney World.", "title": "Fantastic Choice within Park", "helpfulness": 1, "user": "Muriel12", "date": "May 29, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "location": 5.0, "value": 3.0, "rooms": 4.0}, "id": 65773066}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Our rooms were on the second floor, and I concur with other contributors that it led to a \"treehouse\" feel. Our room had newer carpet, fresh paint, and newer furniture. The small refrigerator helped us easily store picnic items. Housekeeping was outstanding! We did experience some hallway noise, but it wasn't a dealbreaker.", "title": "Quiet, clean and comfortable", "helpfulness": 1, "user": "Pilar1978", "date": "May 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 65476845}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "If you want peace and quiet within the park, try the Yavapai. After 3 nights there, we had to relocate to the Thunderbird Lodge (in the village on the rim) for our last night. While the room was nice (smaller but a touch more nicely decorated), the location wasn't nearly as pleasant. And the bed was incredibly hard! We'll definitely stay at Yavapai again.", "title": "Good hotel with great location", "helpfulness": 1, "user": "sunny92037", "date": "May 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 64952802}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "My husband and I stayed one night at Yavapai Lodge. We were in the Eastern section, with a clean, comfortable, and clearly recently refurbished king suite. The room was large, if basic, and looked out over a wooded area - you can definitely see wildlife if you stay here! No problems checking in, and the Yavapai rooms are convenient to several shuttle stops for getting around the canyon. All in all, we had a pleasant stay at Yavapai!", "title": "Great stay!", "helpfulness": 1, "user": "Aussietravellers78", "date": "May 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64703449}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "The location of this hotel is great if you want to be close to the Grand Canyon. We enjoyed the sunset nearby-it took us about 20 minutes to get to Maricopa Point.", "title": "Clean, modest, accommodating hotel", "helpfulness": 1, "user": "baatraveler", "date": "May 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 64151990}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "We were totally and pleasantly surprised with the Yavapai Lodge at the Grand Canyon Nat'l Park. While the outside, as previously noted, is rustic looking, the room was obviously recently remodeled with white (!?!) bedspreads, new carpet and paint and a bathroom that was also fresh and updated. Lighting was a bit dark and old, but the ceiling fan was nice and the room was well insulated/heated as it was below freezing during our stay and actually had a good amount of snow on the morning of April 29. Flat screen TV on a new wall/dresser unit with small fridge. TV was spotty, losing signal, but probably due to high winds/storms that night. Comfort of the beds were not as upgraded as the room itself - about on par with a Motel 6 and the room size is about the same as well. We had NO sound issues and the front desk staff was very helpful with detailed instructions to the cabins. Well worth the standard rate of $107.00 to be inside the national park!", "title": "Surprisingly nice!", "user": "BenT2154", "date": "May 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 62969982}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Stayed here over night in the East building which is the more recently updated complex. Room was basic but spotless (and I'm a clean freak). No views of the canyon from your room but easy access to the bus service available throughout the national park to get to and from the sights. Easy checkin with pleasant staff. Would stay here again, no problem!", "title": "Basic but fine.", "user": "familyof4Melbourne", "date": "May 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 62933723}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Yavapai Lodge, sounds ancient, the external was also not interesting, it looks like hostel. But my wife and I were delighted once we entered the room. It's new, clean, roomy. It is better than the Tropicana Hotel that I lived when in Las Vegas.", "title": "surprisingly new and cosy", "user": "Dave_Yap", "date": "April 27, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 62557611}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "The only complain was lack of internet access.", "title": "Great location and value for families", "user": "Mudturtle", "date": "April 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62540069}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We booked adjoining rooms for our family of five. We arrived in the dark-and as the prior reviewer mentioned, the signage could be better-the place to park to check in is not obvious at first and we drove in a circle and finally parked at the bus stop, there were no cars so we did not care at that point if we were in the wrong spot.", "title": "Great location, standard motel", "helpfulness": 1, "user": "RobbieGregg", "date": "April 26, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 62513460}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Stayed at Yavapai Lodge West in August, 2006. It was great. No A/C, but you probably don't need it. We were there in August and the ceiling fan kept us cool. I recommend this as a convenient place to stay w/i the national park. It's a short walk to the rim of the Grand Canyon. You could stay at some of the places on the rim itself, but I sort of liked being away from the crowds. You can get to the rim hotels in a mile or so walk or take the easy-to-catch buses which run every 15 minutes. Plus, you're closer to the grocery store, bank, etc. at this place.", "title": "Great Place", "helpfulness": 3, "user": "BigMonTraveler", "date": "August 28, 2006", "detail_rating": {"front_desk": 4.0, "business": 1.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5716391}, {"rating": 4.0, "title": "Convenient Yavapi", "text": "Try not to eat at the Yavapai cafeteria however. It's awful. Well, my kids liked it OK, but my wife and I hated it. Most of the food inside the park at Grand Canyon was pretty dismal - even at the fancy places.", "helpfulness": 4, "user": "Holakjs", "date": "August 27, 2006", "id": 5714464}, {"rating": 5.0, "stay_parameters": "Stayed October 2005, traveled solo", "text": "We stayed at Yavapi East (I believe...it's the unit with the A/C) for two nights. The two story hotel unit reminded me of a larger than average dorm room with two queen-size beds and a dorm-sized refrig. Beds were comfortable. The AC was controlled by thermostat that you could set yourself to 70 - 75 or whatever temperature. Even at August, it wasn't absolutely necessary but we are so used to temperature control at home we didn't want to take changes.", "title": "Yavapai Lodge East is Perfect!!", "helpfulness": 9, "user": "Kevin_M_J", "date": "August 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5711139, "likes": {"liked": "— Price and convenience", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "The decor is sort of in the dorm room style but it did have a GC Park theme. We requested service three times. Once for shower head. We were in handicapped unit and the shower head was the detachable type. In any case, I am perfectly able bodied and could not get it to work without calling the reception who responded immediately. Also, my husband complained about the slow drain in the wash basin. Other guests must have noticed but just let it pass. The plumber came within a 1/2 hour and was working on the problem which was more advanced than he anticipated as we left for the day. It was fixed when we returned. In general, I would give the staff good marks for customer service!", "title": "Location ok for us", "helpfulness": 4, "user": "travelhoppy", "date": "August 20, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 5629415, "likes": {"liked": "— within the National Park"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Also wanted iron and had to go and get it myself since they were so busy with check in at that time. (We had reservations to eat at El Tovar)", "title": "Not the Ritz but it'll do...", "helpfulness": 13, "user": "Vespertine", "date": "August 17, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 5620577, "likes": {"liked": "— It was clean", "disliked": "— It was dreary decor"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Stayed here for one night which allowed us to enjoy both sunset and sunrise at the Canyon rim. You can easily walk to great viewing spots within 10-15 minutes - stunning.", "title": "Peaceful haven within walking distance of the Canyon Rim", "helpfulness": 1, "user": "Maeboyce", "date": "May 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 130236324}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "The accommodation itself has been recently refurbished and is the most modern accommodation within the park. The rooms are spacious, very clean and nicely air-conditioned (we stayed in East Lodges). The room we were in looked out onto a wooded area - very peaceful.", "title": "The Best way to enjoy the Grand Canyon", "helpfulness": 1, "user": "AlicedeSantiago", "date": "May 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130073423}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "The cafe and shops are very close by - we had chicken pot-pie and it was really good. Breakfast, on the other hand was stunningly average sadly,", "title": "Deluxe rooms and good location. No view though.", "helpfulness": 1, "user": "YL0", "date": "May 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130014957}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "All in all, a good choice for visiting and canyon and very peaceful.", "title": "In-Park Lodging a Plus!", "helpfulness": 2, "user": "HokieGal30", "date": "May 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 129952461}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "And great room in a peaceful area with good beds and all the amenities you need for your stay. Just a few steps from a good supermarket and the lobby of the lodge where the staff were very friendly and helpful.", "title": "Great Last Minute Choice", "helpfulness": 2, "user": "kirixchi", "date": "May 14, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 129933969}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "Look, this isn't by any means a 4 or 5 star place but GREAT if you're planning a quick weekend trip to hike the canyon. We stayed 2 nights and only spent a short time in our room. I'm pretty picky about the bathroom and our was clean. Our room even had a small fridge which was great to toss a few things in. The locations was perfect! Close to the Bright Angel trailhead and close to the shuttle for the south Kaibab trailhead. Didn't eat in the cafeteria but we had pretty good food at the Arizona Room.", "title": "Good value, clean, & good if you just need a room.", "helpfulness": 2, "user": "ArizonaMarathongirl", "date": "November 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 48290023}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "This was my first trip to the Grand Canyon. I studied the reviews on Trip Advisor as we made our plans to stay at three national parks in a week. (Thanks to all who take the time to write reviews.) Yavapai was the only place at the Grand Canyon that had a vacancy when I made our reservations about two months before our trip. I expected that we would have a very rustic and distant location based on the reviews, the price, and the fact that every other location in the park was full. We loved Yavapai! We walked to the rim, about a half mile, to see the sun rise and walked for a mile or so along the rim, only seeing other people when we got to the Yavapai Overlook - everyone else drove. The room had two double beds, very clean bathroom, and amenities (refrigerator, blow dryer). Don't expect a three or four star hotel. Think \"basic\". It had everything we needed and was a fine location to get to everything in the park. On our next trip I will try to stay at Bright Angel or some of the other lodges since they have views of the Grand Canyon, but Yavapai was a happy surprise for us.", "title": "Great Experience", "helpfulness": 2, "user": "Mac073", "date": "October 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 48098773}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Not so bad price I think. Good access for rim if you have a car. Room was clean.", "title": "Good price in the park.", "user": "SACI_E", "date": "April 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158724012}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "The lodge was clean and the room was clean, nothing about it really stood out though. We have been staying at many different places over the last two weeks, and although this place was clean, it was unremarkable and staff was rather robotic", "title": "Its ok", "user": "Shae H", "date": "April 24, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 158722746}, {"rating": 3.0, "title": "Decent place to stay inside park", "text": "Decent hotel inside the park. Wish we could have gotten a hotel on the rim but we were happy to be within the park. Rooms were updated so nicer than expected. We were on the East side which meant we had air conditioning. The shuttle was extremely useful to get around the park just wish they were more frequent and ran later. Grand Canyon was colder than I expected for April so wish we had packed warmer clothes for mornings and nights. Overall decent stay - would stay again if I couldn't get closer to the rim.", "user": "FabulousMissM", "date": "April 24, 2013", "id": 158712711}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We spent 2 nights at the Yavapai Lodge. We had a nice clean room with two beds, looks like it had been remodeled in the last couple of years. I would say it's nicer than I expected since we were staying at a National Park lodge. The beds were comfortable, there was a flat screen tv, and good storage so our 2 kids could spread out there stuff. The room also had a sofa that could be converted to an extra twin bed. No linens were provided with the room so we called guest services and someone came within about 15 min. to pull the sofa out (it was tricky on our own) and make the bed up. I think it cost $10 per night for the bed, but it was well worth it. As a family of four, it was nice for each child to have their own bed and space to spread out. The halls were fairly quiet and we couldn't hear people coming and going much. The cafeteria and general store were within walking distance, so easy to get over there for breakfast. Overall, a restful place to be after a busy day of walking around the park.", "title": "Good lodging at Grand Canyon Park", "user": "F88", "date": "April 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 158673468}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "I stayed at the west wing for 2 nights and by the time I reached there, it was about 930pm. It is windy and cold so have some warm clothing on hand. Was told by the staff that it is windy all yr round. When we drove in, we reached car park C and there, you have the general store by itself and registration is right inside next to the café at the market plaza. Finding our way to the room was a bit challenging cos no street lights so take it slow to navigate ur way. Parking is great, just outside our room. We were lucky to see the beautiful stars and moon that night cos the next night, it was cloudy. Thank God there is heater in the room. Just no aircon. Tts fine as the temp is ranging 10 to -1 deg C in Apr. Make use of the internal shuttle buses. Drive to the registration area and take shuttle bus from there. They are all on specific timings so no worries abt a long wait. Avg waiting time is about 6-7mins. Intervals is 15mins and after dark is half hourly.", "title": "Acceptable and quiet", "helpfulness": 1, "user": "LongOng", "date": "April 23, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 158617011}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Very nice room in a national park setting. The rooms were big and comfortable, and far more modern than comparable rooms on the North Rim. This isn't a five star hotel, but neither were our expectations. The water was hot, the bathrooms were clean, the service was prmpt, and the bed was comfortable. That's all you need to get you ready for the canyon.", "title": "Comfortable room in a great setting", "user": "Gaandbeyond", "date": "April 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 127761540}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Family of five stayed one night here on our visit to Grand Canyon. The Lodge is in the National park so very handy to get about to see the sights. The price was reasonable & the facilities are clean & basic. If you are not planning on hanging in your room then this is great, but a bit small for a family of five by the time you put the roll away bed down. The staff are extremely friendly & helpful & there is a cafeteria on site that is cheap for food. We ate at the Bright Angel Lodge for dinner & do yourself a big favor & have breakfast at the El Tovar Lodge up on the rim. Overall a pleasant stay & great for one night.", "title": "Clean, Basic Accomodation", "user": "jordy12", "date": "April 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127638925}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The Yavapai really met our basic needs at a good price during our trip to the Grand Canyon. The room itself was clean, updated, and no frills. It looks like the rooms were renovated recently. The furniture was in good shape, the carpet was clean and the beds were comfortable. The bathroom didn’t look updated but it was clean and functioned fine. As other guests have said before, you don’t go to the Grand Canyon for the rooms. We spent almost all day outside (from sunrise to sunset). Except for sleeping and bathing, we were hardy in the room at all.", "title": "Served Basic Needs Well & Good Value", "user": "krmik", "date": "April 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 127521055}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Considering there isn’t much competition from other hotels and the remote location, I thought the prices- for the room and food- were very reasonable. Dinner for 4 at the Yavapai cafeteria was about $40. I appreciate that the hotels and restaurants don’t take advantage of the lack of competition and remote location to charge high prices and exploit tourists.", "title": "Much better than expected", "helpfulness": 1, "user": "AJC66", "date": "April 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 127477857}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The only problem we encountered was with the food. We have family members with dietary restrictions (one is vegan, the other diabetic). Before we left Phoenix, we bought groceries for them. Judging from the Yavapai cafeteria, they would have had a hard time eating there for every meal. Overall, the food was ok (like IHOP) but by our third meal there, I was tired of the food. There is a large grocery store near Yavapai that we should have tried but didn’t since we had already had already bought groceries before entering the park.", "title": "Enjoyed our 2 night stay", "helpfulness": 1, "user": "Louise K", "date": "April 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 127442253}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "If you are looking for a place to stay within the park, that is very convenient (less than a mile) to the South Rim, this is the place! It will cost you a bit less, than staying right on the rim. The rooms are pretty basic, but clean. The west rooms, where we stayed, only had ceiling fans and heat, but fortunately it was still pretty cool as we went in April. The bathrooms were clean with organic toiletries and they did have flat screen TVs with cable channels, which was nice at night, as it gets really quiet after 8 PM.", "title": "Very Simple & Convenient to South Rim", "user": "mainetoday", "date": "May 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 159402885}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "It is really nice after a long day at the Canyon to have no drive and stay close. Regardless of price, I am glad we stayed here. After hiking 15+ miles in one day, we wanted to crash. It was a bit strange to check in a block or two from the room, but once to the room I was pleased. Pretty standard hotel accommodations. Beds were comfy, rooms clean. Things have come to expect were provided. The price certainly is better than driving out of the park and to somewhere with equal quality accommodations, especially if you plan to be at the Canyon much past dinner time.", "title": "Very Convenient, about what was expected", "user": "ChristianLoganbill", "date": "April 29, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 159206704}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "The west rooms were recently updated. There is a mini fridge which is very handy when shopping at the general store. The fan in room 7139 was quite noisy so we were unable to sleep with it on. The shampoo, lotion, conditioner and hand wash are in refillable containers. I liked this as it cuts down on plastic trash. Ice machines are also a available which is handy for a cooler. Overall I would highly recommend this hotel. The cost was well worth 125 per night.", "title": "The west rooms were a great value in the park", "helpfulness": 1, "user": "chelseasly", "date": "April 29, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 159118920}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "We stayed at the Yavapai Lodge East (had air conditioner and newly remodeled rooms) two nights at the end of April 2013 for $178/night. It was nice that the east lodges were separated into blocks of about 20 rooms so we were able to park right outside our block. Ask for a first floor room...i didnt see an elevator. Very close to the Yavapai Caffeteria and also to the GC Visitor Center as well as Bright Angel Bike Rental. If you are an espresso drinker the Bright Angel Bike rental place also has an easily accessible coffee shop. The free shuttle picks up close to the main lodge, about a 5 min walk to take you all around the park. I would recommend staying here if you don't want to deal with leaving or worse coming back to the GC and waiting in line to come back into the park each day. Luckily when we came it was not crowded at all and since it was national park week we didn't have to pay the $25 entrance fee. Weather was cool but never too hot during the hottest part of the day. Typically upper 50's.", "title": "Nice stay at Grand Canyon Park but a bit Pricey", "helpfulness": 1, "user": "mariakd1", "date": "April 25, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 158786285}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We spent 2 nights at the Yavapai Lodge in early April and had a very good experience. The accommodation was spotless and we really liked our refurbished room. The Yavapai Lodges are located within the Grand Canyon National Park, in pleasant woodland, a short drive from the South Rim. In fact, once we had visited the Rim where other accommodation is (Bright Angel, Tovar, etc) we were glad to be tucked away from the more \"touristy\" area. We visited a few of the food places around the park during our stay including the Canyon Cafe, where we had breakfast twice. We also had a good dinner at the Maswik Cafeteria. The meal we had at the Bright Angel restaurant at the Rim was disappointing, so I couldn't recommend eating there.", "title": "Highly Recommend Yavapai Lodge", "helpfulness": 1, "user": "SaraPB67", "date": "April 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158768912}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "The lodge is not situated directly at the rim, but close to it. Bus station nearby - how near depends in which house your room is situated. We had a double queen bed room, which was indeed not very spacious, but it suited our family of four well for one night. Rooms simple and astonishing stylish. Simple - but clean bath room. Fridge and coffee maker in the room.", "title": "Nice place to stay - \"off-rim\"", "helpfulness": 1, "user": "in2cities", "date": "April 16, 2013", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "location": 4.0, "value": 4.0, "rooms": 3.0}, "id": 157966102}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Visiting National parks means \"staying out in nature\" - nice, clean and comfortable place for \"staying in\"", "title": "Nice to be close to the rim. Room comfortable", "helpfulness": 1, "user": "Ben_C007", "date": "April 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 157891605}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We came to the GC in 2008 and stayed in Tusayan which was a bit soulless.", "title": "surprisingly nice!", "helpfulness": 1, "user": "scigrl", "date": "April 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157875654}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "The room at the lodge (east side) was slightly more than in Tusayan but it was worth it to be close to the rim and GC village which we liked.", "title": "convenience and authenticity inside the park", "user": "1k_by_June", "date": "April 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 157723824}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "The bus service was efficient and easy to use. Definitely do the Hermits rest route for the best Rim views.", "title": "Very comfortable!", "user": "Boanddan", "date": "April 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157694540}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Hold out for a lower level room if you have a lot of luggage. Ample parking, comfortable surroundings. Windows that you can open for fresh air. Very clean! Bed was comfortable but the couch in the room was slanted too far back to be comfortable to sit on. Easy walk to the shuttle stop and cafeteria if you are in the first 3 buildings. Otherwise you can drive and there is ample parking in the lot by the General Store and Cafeteria.", "title": "Comfortable", "user": "Mentor189", "date": "April 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 158575226}, {"rating": 3.0, "title": "Functional", "text": "WiFi available in the Cafeteria and the Lodge office only. There was also a PC that could be used to check emails, etc.", "helpfulness": 1, "user": "Pam K", "date": "April 20, 2013", "id": 158266886}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We stayed here, and realise we were lucky to have found anywhere at all. The room was fine. Clean, nicely decorated, good shower, poor on storage/hanging space, but sound. On the outside it looks very outdated, but good inside. The reception staff were very helpful, but Internet access is only available in reception. Having said that, once you are registered as a guest, you can access it in all the other lodges. Very useful. Our room was a long way from the reception, and there is a free local bus service around the resort. We ended up parking at El Tovar on the rim, and using their facilities for Breakfast, Cocktails and Dinner. If you do this, be aware parking can be difficult and reserve your dinner table as far in advance as possible. We only used the Yavapai cafeteria to buy a take out breakfast for an early start on our last morning.", "title": "A good value inside the park", "helpfulness": 1, "user": "Dean H", "date": "April 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 158074586}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "The staff at check in were friendly and efficient. We drove down the road a bit and easily found our room. From the outside the place looks like an outdated motel, but we were surprised to find a modern room with a flat screen TV and nicely decorated. The bathroom is utilitarian with a Wall hung sink and very little counterspace, but it was clean. The linens aren´t the highest quality, but good enough for a Budget lodging. We had a great night's sleep.", "title": "Comfort, not in the Village", "helpfulness": 1, "user": "AZBeachl0ver", "date": "April 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 158012769}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We were fortunate to find last minute reservations in the Grand Canyon National Park since they book 13 months in advance. While not on the edge of the canyon, and a little difficult to find in the dark, the room was great and had been recently renovated. The bed was REALLY COMFORTABLE. For tired, weary travelers/hikers - just the thing. The temperature controls were easy to operate and provided instant hot/cold depending on your preference. Everything is clean, neat, and comfortable. Our double room also had a sofa long enough to sleep another person. Concierge staff were pleasant and helpful.", "title": "Serviceable", "helpfulness": 3, "user": "Oliver J", "date": "April 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 157978175}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Clean room with nice flat screen tv. Good location. Short fifteen minute walk to the rim. Cross the street to the ranger station and the trail is on the left. Turn right to go to Yavapai lookout.", "title": "Great for the price!!", "helpfulness": 2, "user": "onegreenwillow", "date": "April 13, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 127836666}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The next best thing to staying at the rim lodges. We wanted to stay at the rim lodges but there were no vacancies. The Yavapai Lodge is close to the Grand Canyon but not right on the rim. The room was in a row of cabin type rooms, a little musty smelling, but okay. It served the purpose of a clean place to sleep after a day on or in the Canyon. The location was the main benefit. There is a nice General Store and Cafe with a decent breakfast. If you are planning to stay at the South Rim Lodging area, try to stay at the rim lodges, but the Yavapai is also a good option.", "title": "Basic Cabin Type Accomodations", "user": "Disneygirl858", "date": "April 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 127813104}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Firstly this place is in the Grand Canyon village not right on the Canyon Rim, but don't be put off as it is only a short walk or shorter bus ride away from several of the major view points, and there are bus stops near the rooms.", "title": "Clean comfortable and convenient", "helpfulness": 2, "user": "roughrob", "date": "April 13, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 127793545}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The main check in building and cafe are separate from the rooms, you'll need to park in the Grand Canyon village area or in one of the designated Yavapai spaces, check in, then drive to your room. The rooms are located in two separate areas of the park, split by the main road into the village. Room numbers under 799 are slightly closer to the village.", "title": "Updated Rooms", "user": "JoAnn2", "date": "April 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 127781734}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "The rooms themselves are spacious and comfortable, we were able to park right outside without any problems, despite being away from the rim they are still in the heart of the park and we regularly spotted deer running around the complex.", "title": "Great room!", "user": "SmileyCorona", "date": "April 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 127780156}, {"rating": 5.0, "title": "Fantastic stay at the Yavapai Lodge", "text": "Date: 1st October, 2006", "helpfulness": 7, "user": "gobefore...", "date": "October 5, 2006", "id": 5911072}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Trip Advisor Member, Cheshire, UK", "title": "Couldn't have been more pleased!", "helpfulness": 9, "user": "Mrs.Bart", "date": "September 26, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5880040, "likes": {"liked": "— Proximity to Rim, Privacy, The elk and deer at our doorstep", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "We have just returned from the Grand Canyon where we stayed 3 nights at the Yavapai Lodge. The room was much larger than we had expected and very clean and well-maintained. The staff were unfailingly helpful from the time we first telephoned to make a reservation to the moment we checked out.", "title": "Typical National Park Accomodation", "helpfulness": 4, "user": "FunkyG", "date": "September 9, 2006", "detail_rating": {"front_desk": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 5783476, "likes": {"liked": "— Location", "disliked": "— Impersonal, unfriendly desk, no pool, expensive"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "We arrived on the morning shuttle from Flagstaff and they stored our cases and checked twice to see if the room was ready for early occupation. On checkout they suggested that we left our luggage at Maswik Lodge to enable us to take a Desert View tour and catch the afternoon shuttle back to Flagstaff.", "title": "So much better than Tusayan", "helpfulness": 2, "user": "Rob_Anderson_UK", "date": "September 7, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 5776693, "likes": {"liked": "— Quiet seclusion", "disliked": "— Lack of breakfast choice"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "Sunset tip: Do not spend the hour before sunset travelling to the most popular viewing points. Anywhere on the rim is spectacular so use the time to experience the changing colours and shadows. Catch the free shuttle to the nearest stop or walk to the nearest rim point. (All the shuttle stops show the walk to the nearest rim point and these short walks can result in sightings of deer or elk). Do the same at sunrise.", "title": "fantastic choice", "helpfulness": 3, "user": "carlottaghigi", "date": "August 31, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5730489}, {"rating": 3.0, "stay_parameters": "Stayed July 2006", "text": "We stayed at the Yavapai East for two nights. The room was clean with a small refridgerator. We had an extra cot as there were 5 of us (2 adults and 3 kids). The only problem we experienced was the noise level. Our room was on the end, across from the ice machine. People started filling their ice buckets at 5 AM one day and 4 AM the next day. We could hear every bucket being filled. Also, people tended to gather outside our door and carry on conversations early in the morning (mostly non English conversations). We were also closest to the shuttle stop and could hear each bus come and go.", "title": "Noisy Mornings at Yavapai East", "helpfulness": 6, "user": "KMate", "date": "July 11, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "service": 5.0}, "id": 5455933}, {"rating": 3.0, "stay_parameters": "Stayed June 2006", "text": "We ate lunch at the Bright Angel Arizona room one day. It was a 30 minute wait (not bad for the amount of people at the canyon that day). The food was excellent and the price was very reasonable.", "title": "great stay", "helpfulness": 6, "user": "quicktrip27", "date": "July 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 3.0}, "id": 5429341}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "I chose the Yavapai East because I wanted to be close to the Marketplace and the cafeteria. It was a very short walk to both. There is a large grocery store in the Marketplace that sells anything and everything you could possible need. The cafeteria is large, with a good selectoin of food. They have specials listed on a board just before you enter the food area. These specials are not listed, however, once you get inside where you order your food. I didn't know if they were out of the specials or if the board was leftover from a previous meal. I did ask about the chilli in a breadbowl that was offerred as a special. The server behind the counter said they did have it and proceeded to fill a breadbowl with chilli. He asked if I wanted cheese on top of the chilli. I said yes. Then, before I could utter another word, he also dumped a ladlefull of raw onioins on top of my chilli. It was $7 for the chilli, drinks were in addition.", "title": "Loved our room and stay", "helpfulness": 6, "user": "MountainMurf", "date": "July 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 5421012}, {"rating": 3.0, "stay_parameters": "Stayed June 2006", "text": "Overall, I think I would have preferred to stay closer to the rim - probably the bright angel.", "title": "Average motel style accomodation", "helpfulness": 4, "user": "seashell12", "date": "July 1, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 5414585}, {"rating": 3.0, "title": "decent room", "text": "The Yavapai East was just fine for our one night stay at the grand canyon. The room was clean. I had no problems with parking and we did drive our own car so we didn't have to deal with the shuttle service. If I were to go again I would stay at bright angel or El Tovar so we could have been right on the rim. But it was no problem getting into the car and driving 3 minutes over to the rim for spectular sunrise. We ended up eating at the Arizona Room and The Bright Angel Restaurant both were wonderful.", "helpfulness": 3, "user": "barely alive", "date": "June 28, 2006", "id": 5397851}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "It was clean and comfortable, very nice the staff at the front desk was very helpful.", "title": "Great!", "user": "llstarr", "date": "April 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60100808}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Spacious, spotless -nothing negative to say! Leave your bags in the car when you check-in. Rooms are a very quick drive from check-in.", "title": "great accomodations", "user": "wiseonen", "date": "March 31, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 60025313}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "Stayed for two nights in Yavapai Lodge \"East\" rooms. They looked like they were recently refurbished with newer carpet, clean paint, etc. The linens were actually very nice. I've come not to expect much from National park \"basic\" lodge accomodations but this was much better than many others such as Yosemite. Location is not \"rim view\" but shuttle stop, cafeteria, general store, etc. are in easy walking distance. The refrigerator in the room was convenient for keeping snacks. The only thing I'd do differently is ask for a second floor room as we heard alot of noise from the people upstairs just walking back and forth (seems like hollow floor boards). The cheaper \"West\" rooms were unavailable but we drove by and there were alot of workers there painting, delivering new furniture, etc. so expect they will be nicer when available again.", "title": "Nicer than expected", "helpfulness": 1, "user": "ttoo", "date": "March 31, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 5.0, "location": 3.0}, "id": 60003392}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We had spring break package that came with breakfast and free tour. The tour reservations need to be made separately which we did, then confirmed 2 days ahead (which we also did), then confirmed again when you arrive to exchange \"coupons\" for tickets. This seemed like overkill and was a real hassle. Others on our tour did not understand all the steps necessary like exchanging coupons and were scrambling to get everything done before the tour started. The tour desk guy for Harvey tours wasn't the quickest or brightest and his ineptitude made things really frazzled for some. The bus driver seemed also upset that people didn't seem to understand all the steps but really, there shouldn't have been so many steps for booking. Xterra should really rethink that whole process.", "title": "great stay on this beautiful park", "user": "VRUM", "date": "March 10, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 58229612}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Staying there is all about location and being close the Rim, in my opinion it is not about comfort. I recommend it if you want to stay there briefly and spend your time enjoying the Canyon...", "title": "Oh Deer!", "user": "RobstersDads", "date": "February 28, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 57352069}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "We stayed here 2 nights in late October 2009. Not at all fancy and I thought a bit pricey for the very, very basic style of the room.... but we were pleased with its cleanliness and location within the park. No view of the rim... this is in the woods....but not far to drive there. Good to have the very decent cafeteria-style restaurant and general goods store next door. We got very prompt customer service when we had a problem with the heat: the thermostat was broken (instead of regulating the temperature by going on and off, it stayed on and the room became boiling hot) but it was fixed immediately. I liked being able to drive up to our door- easy to get in and out.", "title": "No frills but clean", "helpfulness": 1, "user": "ManhattanMonkey", "date": "November 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 4.0, "rooms": 2.0}, "id": 48869674}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "We really liked the Yavapai Lodge. The rooms were large and comfortable, and we were delighted to see a small group of deer right outside our window one morning. The cafe is good for breakfast and snacks/basic meals, which are good value. The lodge is convenient for the Post Office and supermarket. The buses east and west along the rim were frequent, and the drivers very informative and helpful. This is not a five star hotel, but for trips to admire the canyon and walks long the rim this is an ideal place to stay, and feels less busy than the older hotels right on the rim. The room sizes and cafe options also make it ideal for families.", "title": "Excellent base for Grand Canyon", "helpfulness": 3, "user": "DSandJB", "date": "November 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48802577}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "I stayed at the Yavapai Lodge with my husband in Sept 2009. The hotel is a no frills hotel, which was okay with us because we spent our days out and about exploring the beautiful outdoors. The room was spacious, clean, and modern. However, there wasn't high speed internet connection in our room. I suspect that most lodges in the Grand Canyon are the same way. The food located at the restaurant lodge was bland, pricey and cafeteria style. The good news is there was plenty of choices.", "title": "No Frills", "helpfulness": 1, "user": "2008_travelbug", "date": "November 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 48796515}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Stayed at the Yavapai Lodge for one night, check in was an easy process. Very helpful staff. Don’t expect the Ritz, but the rooms are clean and quiet, have all the facilities you need. What more do you actually need, if you have been out all day, by the time it got to bed time all we wanted was to curl up and die. Easy access to most of the main tourist sites. Bus stop on the doorstep with a good timetable. Cafeteria was basic wholesome food but again after a hard days sightseeing, food was plentiful. Shop and bank available as well. As nice as it was, would prefer one of the lodges with a view, mind you some people are stupid ,one couple was checking in at the same time and asked if their room could have a view of the canyon. Receptionist was pleasant and tried explaining that the lodge was about 1 mile from the canyon’s edge but this couple did not really understand. Long, drive from Las Vegas was tiring so another night would have made it more pleasant.", "title": "Brilliant Location!", "helpfulness": 2, "user": "gibsoni1", "date": "November 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 48781081}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "By the time we tried to reserve a room at the Grand Canyon, Yavapai Lodge was the only available option. I read here on TripAdvisor (thanks to the great community of contributors!) that the East section was more recently remodeled (our room was $150 a night). We requested a room on the 2nd (top) floor and took our chances. Turns out we lucked out with a room in the very last building in the complex and there was plenty of parking. Our window faced the back hill of trees, much better than a view of the parking lot. Clean room, terribly tired mattresses, worn (but clean) towels, weak shower, small sink counter but all else was fine. A small frig in the room available to keep food and drink. There's no in-room safe so you have to store your valuables more thoughtfully. It's a wooden motel lodge and I did not expect a 5 star hotel-type room. Very adequate for our stay.", "title": "Away from the Crowd & Noise!", "helpfulness": 3, "user": "TravelingTimes", "date": "November 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 48459275}, {"rating": 2.0, "title": "Location is the draw", "text": "The rooms are large. Sadly you can overhear your neighbours. I had a very disturbed night. Various tv sets were turned on and off. People exited and entered; doors slammed. It reminded me of living in a university dorm. Unfortunately, great locAtion for exploration of the park, but not restful.", "user": "SABirder11", "date": "April 24, 2010", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 1.0}, "id": 62340013}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Booked this room without problem four days in advance. Arrived very late and location was difficult to find after dark. Luckily, the night clerk (thank goodness there was a cell signal or we would have given up and slept in one of the parking lots) was able to talk us into the hotel parking lot. Tip- Get detailed instructions to hotel if arriving after dark. Area very confusing in pitch black.", "title": "As expected for Nat'l Park and 2 star hotel", "user": "Patinla", "date": "April 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 61301757}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "The night clerk was very helpful and gave directions to our building (#9). The room was a tired, old room, very cramped, but very clean and nestled in a pine forest. Easy parking in front of our room for our car, but the truck and trailer had to be parked about a 1/2 mile away in a large parking lot next to the office, cafe'. Both locations felt very safe and nothing was taken from either vehicle.", "title": "Great value, no frills, but worth it for location.", "user": "Brittta", "date": "April 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 60260429}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "As the remarkably consistent TripAdvisor reviews attest, the Yavapai Lodge is utterly typical of Xanterra-managed National Park lodging... An older physical plant, updated with newer furnishings, clean and well-maintained. The buildings are low, squat masonry structures painted dark brown to blend with the landscape, and the insides are Spartan and a little dim, but a reasonable -- and reasonably priced -- place to lay one's head during a visit to the wonders of the Grand Canyon. If you're like us, you stagger back into the room in the evening, exhausted from a sunrise to sunset day, and the room is more than fine for that.", "title": "Comfortable enough, and far from the madding crowd", "user": "DrewKnightWV", "date": "April 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 128328852}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Our particular room was in Yavapai West, a few hundred feet from the cafeteria/office/general store complex. Unfortunately, we were situated right in front of the ice machine, so we had some noise from that (and didn't have the chair next to the door that most rooms enjoyed). The room had two queen sized beds, and the office graciously provided a full-sized roll away so our teen children didn't have to fight over space in a single bed. There was a new flat screen TV on the wall, which we never turned on (why would you, when one of the greatest shows on earth is a few minutes away?).", "title": "Very good location, right in the middle of the park, decent and modern rooms.", "helpfulness": 2, "user": "sr_srikanth", "date": "April 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 128321344}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Actually, that few minutes is one of the mixed but real blessings of Yavapai Lodge. The first two days of our mid-week, late April visit, the park was relatively quiet, and the five-plus minute commute by private car to the Village proper and the Rim lodges -- through the maze of twisting passages that make up the village roads -- was a mild pain. On the other hand, by the third day, when the weekend crowds started arriving, the Rim lodges and environs were somewhat overrun -- giving us a glimpse of what summer must be like -- and the relative calm of Yavapai, with easy parking and access to the park's excellent shuttle system right out the door -- started to seem like a real virtue.", "title": "In the park and quite nice", "helpfulness": 3, "user": "SESeattlemom", "date": "April 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 128259443}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Excellent location. Great place to access the Mather point for catching the sunrise. Close to the eateries as well. Close to the visitor center for the shuttle bus. If you have a car nothing like it even without it this place is good since shuttle bus stops are easily walkable from here.", "title": "You would only stay here for the location.", "helpfulness": 2, "user": "betsieboo", "date": "April 20, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 128236413}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Rooms are clean, good beds and simple. It was great for a family of four and our kids thoroughly enjoyed it as well,", "title": "Pleasant experience", "helpfulness": 2, "user": "MollydeA", "date": "April 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 128083460}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Comfortable room. Convenient parking. Away from congestion of rim lodges. Tricky getting ice. Our West building had plumbing problems our last day. Service could have been more responsive. When escalated, management made accommodations. A great experience primarily because of location in an outstanding national park. Look for condors on desert drive.", "title": "Good location. Agreeable rooms. Great for family of 4.", "helpfulness": 5, "user": "PBACedarburg", "date": "April 17, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 128029002}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "only stayed a night so this was the perfect location for us, allowing to spend more time in the park than navigating. I watch sunrise from Yavapai Point which was less than 5 min drive from the lodge. I think if you start early, you can probably walk along the rim trail and get there easily. The market and food court were in walking distance. The customer service was awesome! very polite and helpful!!", "title": "perfect location, typical national park lodge", "helpfulness": 2, "user": "jaeuncool", "date": "April 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 128027111}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "The lighting was somewhat dim and the room was cold but I believe that's typical national park lodge.. I could turn up the heating, but I don't sleep well when there's too much noise...", "title": "Perfectly nice hotel room, very convenient.", "user": "VaNC", "date": "April 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 128021448}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "This is not a top quality hotel but a conveniently located national park lodge. Overall I was happy with this place and would stay again next time.", "title": "Very Acceptable Motel Accomodations", "helpfulness": 1, "user": "LKDunn", "date": "April 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 127946458}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "I was a bit worried after reading the reviews, but found Yav. East to be lovely, clean large rooms, very near everything. So we were very pleased. Two queen beds, plus a couch/pull out for the littlest (10). There were deer outside the building almost every morning. My only complaint would be that the food at the cafe is bad hospital cafeteria food, at best. You are better off getting donuts and juice from the General Store, taking them to the rim and having a picnic. We did the same with sandwiches from the deli for sunset. Great deal.", "title": "Average", "user": "Chidders", "date": "April 14, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 127883326}, {"rating": 3.0, "title": "This place is pretty good", "text": "Reviews of Yavapai were not REAL good when I was searching, but this place is o.k. It's clean, comfortable, quiet, and the view from the back of the lodge is nice and woodsy. It's not the Ritz, but I'm not Ritzy! It's right by the shuttle stop, just a \"hop\" over to the market and cafeteria. Ate here only for convenience sake, food is just to fill you up. Plenty to choose from, but it is just cafeteria food. Only problem we had was finding check-in!", "helpfulness": 7, "user": "Sanddllr", "date": "August 1, 2006", "id": 5537093}, {"rating": 4.0, "title": "Perfect for the weary travelers", "text": "We arrived at the Yavapai East Lodges after an entire night of driving, a train ride, and a bus tour. Needless to say we were tired and hungry. The rooms were very clean and close to a cafeteria and other supplies. It was convenient to hop on the bus system at the canyon and we felt totally refreshed after only 24 hours at the canyon. For the price, these places were more than I could have hoped for.", "helpfulness": 11, "user": "Hatter_Calc", "date": "July 27, 2006", "id": 5516647}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "We were a little disappointed that we could not book a hotel on the rim of the Grand Canyon in 'Grand Canyon Village' (i.e. Bright Angel or El Tovar) due to lack of availability. So, we booked a room at Yavapai East (in 'Market Plaza') for three nights in July '06. We were pleasantly surprised. Our room was comparable to a stay in a nice Holiday Inn, Courtyard, etc. Our room appeared to have been renovated fairly recently and had a nice king size bed, mini fridge and air conditioning (one of the few properties at the canyon with this amenity---being from FL, we sure like to have A/C!). We stayed in Building 4, which was right near the shuttle stop. Having the free canyon shuttle nearby was a plus, but we actually enjoyed walking around the area as it is so beautiful & peaceful there. Nearly every day we saw elk or deer roaming near the woods of our property. Our room was located on the back side of the building and had a nice view of the woods (vs. the parking area). We ate at the Yavapai Cafeteria a couple times and it was not bad and had a wide selection of items at decent prices. Also, there was a nice general store and bank right across the parking lot from the Yavapai Cafeteria where you could buy groceries (including fresh fruits), souvenirs, toilettries or whatever. We were able to buy several items (soda, milk, water, yogurt, etc.) and store them in the fridge in our room for snacks and breakfast. We also ate at the Bright Angel restaurant and The Arizona room (nice views of canyon from the restaurant) and felt the food was good at both, though prices a bit high. Though some might feel it is a bit more convenient to stay in 'Grand Canyon Village' area vs. 'Market Plaza' (they are located about 1 mile apart----not a bad walk of about 25 minutes and much less w/the convenient shuttle), we felt our stay at Yavapai East was wonderful and the canyon itself is spectacular.", "title": "Good location, even though not on rim", "helpfulness": 19, "user": "Tampa_FL_Girl", "date": "July 26, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 5515156, "likes": {"liked": "— Helpful staff, clean rooms, good value, convenience to shuttle", "disliked": "— No canyon views from property"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2006, traveled with friends", "text": "We were very surpised at the quality of this lodge. It was the only place left in the park that had rooms available, but I assume it was because it is not rim side. The rooms were large and of a good quality, our room had a small fridge.", "title": "Fantastic", "helpfulness": 13, "user": "millypoppymo", "date": "July 26, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5512254}, {"rating": 3.0, "stay_parameters": "Stayed July 2006", "text": "The canteen over the road was more than adequate and the free bus service made getting to the rim viewing points ( and hotel bars) easy. Also near by was the supermarket and post office.", "title": "Convenient and ok place", "helpfulness": 4, "user": "wonderer_in_CA", "date": "July 11, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 5457360}], "location": {"country": "United States"}, "stars": 2, "variance": {"poor": 86, "average": 452, "very good": 853, "terrible": 24, "excellent": 334}, "aka": "Yavapai Hotel Grand Canyon National Park", "slim_ranking": 0.666666666667, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 3.5, "location": 4.5}}