{"user_rating": 4.5, "review_count": 477, "name": "Yeng Keng Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The Yeng Keng is a fantastic boutique hotel in the Chinese part of the historic district of Georgetown. The hotel looks absolutely amazing and is in a restored 19th century building. We stayed in one of the two Chulia Suites, which was very nice with a sitting room looking out towards the courtyard at the front and a bedroom and bathroom behind. Being set back from the street made it nice and quiet, although the bedroom was a little dark", "title": "Great boutique hotel", "user": "Raver_and_Kat", "date": "August 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116612950}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "The hotel has a very nice courtyard out the front where we spent some several afternoons and evenings eating and drinking. It seems like a lovely calm oasis after the hustle and bustle of Georgetwon. The food is good and reasonably priced too, and they were able to adjust the menu to suit a vegetarian. They are currently knocking into the building next door to build a cafe and bar, which will make the outside area even better", "title": "Great ambience, helpful staff", "helpfulness": 1, "user": "kratky", "date": "August 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 116605610}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "There are lots of little sitting areas upstairs where you can go to get out of the heat without having to go to your room which was a nice touch, and the staff even found us some card and board games to play with!", "title": "A Good Place to stay", "user": "PeterH2010_11", "date": "August 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116601909}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Raver & Kat", "title": "We loved this lovely little hotel", "user": "GloriaSome", "date": "August 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116374424}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "We only stayed 1 night, but it was very pleasant. The hotel is very centrally located, and it seems like a little gem in the midst of the mostly dilapidated collonia-era buildings. It has a charming courtyard, parking lot at the back and a very nice architecture. The rooms are nicely furnished in a boutique style, and the small number of rooms makes it seem very personal and relaxing.", "title": "Dont want to give away the secret, but this is top class", "user": "iharttravel", "date": "August 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 116317042}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We arrived in Georgetown from Singapore, and Yeng Keng Hotel was more than we could have imagined - it was truly in oasis in the city. Our room and the hotel grounds were clean and nicely decorated. The included breakfast was PHENOMENAL - we'd come back again just for that!", "title": "An oasis in Georgetown", "helpfulness": 1, "user": "Alybyzrp", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116957641}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We found the hotel to be walkable to different areas of the city we wished to visit, as well as to the bus stop to explore popular sites out of town. If we are ever back in Georgetown, we won't hesistate to stay here again!", "title": "Central Chic", "helpfulness": 1, "user": "Jaytara", "date": "August 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 116877616}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Based on reviews on this website and anecdotal information, my wife and I chose this hotel for a weekend break. It exceeded expectations, the central location is superb with heritage sites within walking distance, including the the E & O Hotel as well as Little India. The staff, Yeoh and Martin deserve special mention, are very friendly and helpful and the courtyard is an excellent place for breakfast as well as evening drinks and dinner. Rooms are rather small but well appointed.", "title": "Extremely Friendly Hotel in the Centre of Town", "helpfulness": 2, "user": "Phil D", "date": "August 17, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 116867261}, {"rating": 4.0, "title": "A lovely place in a good location", "text": "I would recommend this to anyone going to penang to experience georgetown. The hotel is perfectly situated on lebuh chulia, which means all the central areas of georgetown are within walking distance. So it is perfect for just going for aimless wanders around! Not only that, it is nearby bus stops to get to the other main locations in penang (although these stops are not easy to spot - so maybe ask at reception), and a car park for those who want to drive. The staff are incredibly friendly and happy to help, the hotel is clean, with all mod cons, and even a (small) pool, which is a luxury for this area! And the food and drink served is very tasty if you dont fancy moving out too much in the heat! Not only this, it is very well priced as well. So, highly recommended!", "helpfulness": 2, "user": "weimeng", "date": "August 14, 2011", "id": 116685006}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We chose this hotel based on reviews from TripAdvisor, the location and the price. We got the Garden suite as the discount from the booking site was pretty decent.", "title": "Loved the place and the staff", "helpfulness": 1, "user": "fabash", "date": "August 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116679079}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Love the experience of staying in a heritage house. Service is personal and 5-star. Staying here is like living in a wealthy Asian household where the staff is always around to attend your needs. The hotel grounds and bedroom was elegant and sparkling clean. When I had guests come to visit and we sat down at reception, cold drinks were served (free) without us even asking for them. Staff was cleaning the hotel constantly. The receptionist Yeoh was like a long lost cousin - she was personable, friendly and so helpful. Lovely experience and would definitely stay here again. Location was great too in a narrow street with trishaws going past and old shophouses selling traditional medicines and everyday wares. One tip: if you have an unlocked phone, a block down the street is a little shop that sells everything from batteries to pencils and toys. Ask the lady for a sim card (MYR 26). You need identification to register up to 10 sim cards. It comes loaded with alot of minutes and will save you $$$ making local and regional calls. If you have a cold (or not) it's worth stepping into the traditional medicine shop a few feet away to watch them draw up herbs for their customers.", "title": "Experience life in a wealthy Asian household", "helpfulness": 1, "user": "AsianGuest", "date": "July 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115728114}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Yeng Keng exceeded our expectations. Although our room was small the pool area directly outside was wonderful. The staff, especially Yeo, were keen to make our stay phenomenal. Breakfast was limited in choice but the new breakfast area should see things improved here.", "title": "Fantastic....better than the pics", "user": "back2bali_10", "date": "July 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115637066}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "On a previous trip, I stayed at one of the prestige hotels on Gurney Drive; had I known better, I would have definitely have stayed at the Yeng Keng Hotel. I can not say enough nice things about the staff: they were friendly, helpful and a pleasure to deal with- probably the most personable hotel staff I have met in my travels. This is a boutique hotel with only 20 rooms; the rooms may be small to some but the decor more than makes up for it. I considered cancelling a week in Kuala Lumpur, and would have if my hotel there wasn't already paid for, just to stay in this hotel and in Penang for the extra week. This is a gem of an hotel, beautifully renovated and next to the heart of historical George town.", "title": "Didn't want to leave...", "helpfulness": 2, "user": "Happybarbarian", "date": "July 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115608782}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "It seems that fate led us to this delightful hotel. We were staying at Ryokan, a hostel/hotel on a parellel street. After staying one night with the ridulous noise levels we decided to search for other accomodation. Yeng Keng was our treat on this trip. First, the staff were some of the most helpful we've had. The recptionist, Yeoh, right away arranged our bags and whipped out a map to show us nearby cusines that we may like to try - very detailed and catered. The room was definately the highlight with an old world east meets west vibrancy. My favourite aspect was the deep royal blue feature wall and high ceilings. The room had a king bed, air con, separate bathroom (decent sized shower), safe, bar fridge, plasma wall-mounted TV and...a ceiling fan (best thing ever for sleeping if you don't like the chill of the air con)!", "title": "Fantastic staff and Gorgeous rooms", "helpfulness": 3, "user": "bushbanga", "date": "July 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115511260}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The architure and furnishings of the rest of the building had a lot of character, chandeliers, chinese day beds, wicker chairs/furntiture and even a tree growing out of the floor in the back lobby.", "title": "Lovely small hotel with exceptional staff!", "helpfulness": 3, "user": "Maccyoz", "date": "July 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115406754}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We first were supposed to have a romantic 3 nights stay at the famed Chat Fats Tze Mansion that despite our Agoda December booking and immediate debit, apparently made a double booking.", "title": "Very well located, excellent service, nice rooms and, bonus: a swimmimg pool", "helpfulness": 2, "user": "familleLenique", "date": "August 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116302963}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We ended up at Yeng Keng and were pleasantly surprised as everything with the hotel is fine: if doesnt have the antique furnitured loby, patios etc that make for the predecessors beauty, the rooms we coud compare are far better, service realy is excellent, something I wouldnt say with Fats Tze and food is superb with the excellent and witty hainanese cook.", "title": "Lovely hotel but some flaws.", "user": "JandJteam", "date": "July 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 3.0}, "id": 115954263}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "We booked 4 nights at this hotel and, to be fair, it has some lovely features. An old Chinese house has been lovingly and beautifully restored from a dilapidated state with some pleasant seating areas and an attractive courtyard. However, because of its design, there were some negatives with external noise, including late at night and early morning. The rooms are very small with a compact, though nicely appointed bathroom. There is no provision for luggage space except the floor. Breakfast was only very average with tardy replenishment of juice and fruit platters. Service was polite but not warm and welcoming. Be aware that Muzzim Call to Prayer begins early in the morning through loud speakers and on Fridays(or it did the Friday morning we were there). Would we stray again? No, I think we would pay the extra and head back to the Eastern and Oriental.", "title": "Ranked number one.... And it truly is !", "helpfulness": 1, "user": "AkankshaSaurabh", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 115951813}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Stayed there with family -group of five adults abd a baby. The hotel is a really beautifully restored building. The rooms, though not big are very well decorated and comfortable. Aircons very effective. We got one room on the ground floor and one on the first floor. There is a lot of attention to detail in the decor and you will feel like u r in a designer's lounge.", "title": "Pretty Great Place", "user": "watchourstep", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 115892805}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled solo", "text": "Breakfast was not really up to theark. Very limited options except eggs made to order. Pool area good, staff very helpful and friendly.", "title": "Well-appointed heritage hotel", "user": "SPriya", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115877349}], "location": {"country": "Malaysia", "continent": "Asia"}, "stars": 3.5, "variance": {"poor": 3, "average": 19, "very good": 129, "terrible": 2, "excellent": 324}, "aka": "Yeng Keng Hotel Penang/Georgetown", "slim_ranking": 0.0408163265306, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Yeng Keng Hotel is a 20-room restored heritage boutique hotel located in one of the oldest surviving and intact 19th century buildings at the heart of the UNESCO World Heritage City of George Town, Penang.Like many of the other buildings in the neighbourhood, it was originally built in the mid 1800's as a private residence. The Anglo Indian bungalow belonged initially to Shaik Eusoffe bin Shaik Latiff an Indian Muslim family and remains unique in Chulia Street for not being relegated to the rear of a row of shop-houses blocking its facade. In 1897 trustees of the Cantonese Club 'Ying Han Pit Shu' bought the building on behalf of the association, later donating it to the trustees of the Straits Chinese Building Association in 1939. The building was later leased to Yeng Keng Hotel.The conversion from a residence into a budget hotel was the prevailing trend along the street, at the beginning of the 20th century. Small places of lodgings that were conveniently reached from the harbour were in great demand as the traffic in the port grew. An impressive traditional Chinese entrance gate was constructed announcing entry to the 'Lodging House', adding grandeur to the commercial establishment and to distinguish it from the rest of the buildings on the street.Conservation and upgrading by the present owner, Hoo Kim Properties Sdn Bhd was undertaken in March 2009 with the renewed Yeng Keng Hotel completed in April 2010."}