{"user_rating": 3.5, "review_count": 297, "name": "Yllen Eiffel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We stayed at the Yllen Eiffel on a Saturday since we were just making a quick two-day sightseeing trip in Paris. This was our first experience in a Paris hotel, but overall it wasn't negative. The room was a triple and was fairly reasonably priced since it was the winter (~$140). There were three twin-sized beds and a small amount of walking space around them. The receptionist wasn't the friendliest person I have met, but she served her purpose and didn't do anything particularly rude (she just wasn't particularly friendly either). The room was clean as far as I could tell. The carpet seemed a little \"sticky\" so it was probably dirty, but I keep my shoes on in hotel rooms for fear of dirty floors. The bathroom decor was more up-to-date than the decor in the room. We had a small shower. There were very few outlets to use for plugging in hair appliances.", "title": "Not too bad by Paris standards", "user": "lasiteral", "date": "March 3, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 57596711}, {"rating": 1.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "Overall, by French standards, this room wasn't bad. It was small and pretty ugly, but it served it's purpose for a quick overnight stay. The location was very convenient for sightseeing since the metro stop is literally a few steps away from the hotel door. We drove a car to Paris, and it cost about EUR 20 for us to keep the car overnight in a mechanic's garage that also serves as a parking garage for the hotel (where the receptionist told us to park) about 2-3 blocks away from the hotel. A bolt was missing from one of our struts when we left, which caused us to wonder if the mechanics were harvesting parts from cars?? Just a suspicion.", "title": "Awful, disgusting and horrible", "helpfulness": 3, "user": "Roy030", "date": "January 28, 2010", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 54571004}, {"rating": 1.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We are Americans living in France, so in my opinion, this hotel, at the price we got it for, was not bad by French hotel standards. But according to American standards, you could likely get something MUCH nicer for the same price in the U.S. I would recommend this hotel for quick overnight stays. Just don't expect the hotel staff to be too friendly toward you.", "title": "Worst place in my life!", "helpfulness": 2, "user": "Carlika77", "date": "January 22, 2010", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 54117713}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "Unfortunatelly we had no choice but to book this hotel as we went on one of the busiest weekends in Paris with hardly anything available due to an exhibition. We paid £150 each per night for a 3 star hotel that should really be classed as 2. where do I start? let's start with the revolving doors. If you have big suitcases then be prepared to struggle through them. Then the awful stench that hits you as you enter the tiny lobby with the unfriendliest receptionist ever. Then the lift. Anther awful smell in there. Then the shabby, unlit corridor leading to the room. You have to press the switch for the lights to come on. And finally the room. Oh My God! The smell of it was too overpowering. We had to open the window to air it for a long time. The room and its furniture are so dated it looks like it's from another era. We felt like we were catching something just by standing there. Admittedly the bathroom and the breakfast were not too bad, but the towels were so old they had started to fray. We tried to stay out as much as possible so that we did not have to endure the hotel for too long.", "title": "OK as a base", "user": "Tepatypy", "date": "October 21, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 47387973}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Our last memory was on the check out morning when we saw with our own eyes the chamber maid putting the supposed new clean sheets that were all crumpled up on the floor before putting them on the bed and let me tell you that floor was filthy. To think that we were sleeping on similar sheets for two nights. Yuk. NEVER AGAIN. P.S. don't be fooled by the good reviews. These people must have very low standards.", "title": "Not bad", "helpfulness": 2, "user": "chizabela", "date": "July 30, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 36219736}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Great location, service, food, a/c, etc. Was very happy and comfortable with our stay. No negatives at all. We loved this hotel. Very cosy and nice. Would love to come here again!", "title": "Perfect for us!", "user": "kylaralee", "date": "August 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77385395}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Great location just outside the Metro Station. Room is on the small side and dated but comfortable and clean. Breakfast was surprising good even though with limited selection. Breakfast room is small but nice, if everyone turned up at the same time, you may have to wait for a seat. Staff are friendly and helpful and will recommend to others and will go again.", "title": "Good overall experience", "user": "cathayterric", "date": "August 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 77014068}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "The breakfast is very good and its by the side of the metro", "title": "from this hotel you can go to everwere because it's near from tre metro!", "user": "Saninha", "date": "August 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 76031778}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Execellent location very easy to find, on arrival hotel staff were very helpful and welcoming they helped us locate some secure safe parking close by.", "title": "Perfect Paris hotel", "user": "shannyann0974", "date": "August 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75481570}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The hotel was very clean and comfortable with every thing we needed offering great value for money. Travelling with children we were very suprised with the the size of the room often in a family room we have been face with a double and a sofa bed, buth the children had a bed each with plenty of space to move around the room. The breakfast was great a good selection and all very fresh.", "title": "Friendly and efficient staff, good quality compact room, convenient location.", "user": "marcusaurelius_3", "date": "August 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 75458640}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "3 of us stayed in this hotel for 2 nights in July 2010 after winning it on Priceline.", "title": "Good hotel, no frill... could be a lot better with some refurbishment", "user": "ben_steph", "date": "July 11, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 70467242}, {"rating": 4.0, "stay_parameters": "Stayed May 2010", "text": "The location in the Montparnasse area was good, just outside Volontaires metro stop (you just have to cross the road to enter the station). Pasteur metro station is also really close.", "title": "Location was amazing - opposite to metro station - perfect!!", "user": "hanna0", "date": "May 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 65816284}, {"rating": 2.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "We thought the rooms were clean but a bit old-fashion (I hate carpet on the floor ;p) and in need of refurbishment... the furniture could really be \"updated\"", "title": "Wretched", "helpfulness": 1, "user": "marteaudor", "date": "May 27, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 4.0, "sleep": 2.0, "rooms": 1.0, "location": 2.0}, "id": 65521061}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "The main negative point was the reception staff... very mixed from typical \"parisian rude\" to really helpful... Also we thought the staff could have warned us when there was a general problem with hot water the first night, we had to wait to be in the shower to realise there was no hot water - when I went down to reception I was only told it was a general breakdown in the hotel and that the reception staff being on his own could not do anything about it and it would be fixed the following day - Luckily for us, it was probably one of the hottest day so far in Paris so cold showers were not a massive issue...", "title": "A really nice hotel with lovely helpful staff & metro on your doorstep", "user": "Liz186534", "date": "May 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 64475941}, {"rating": 2.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "All in all for the cheaper price we paid via Priceline, there is nothing to complain about. I would not pay the full rate though...", "title": "Not Much to Write Home About", "helpfulness": 1, "user": "cujas", "date": "May 15, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 64200148}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "I chose this hotel partly because it was close to the Parc d'Expo where I attended a trade show.", "title": "Satisfactory with a few reservations", "user": "DooCue", "date": "October 28, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 85150181}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The room was quite adequate, small as expected, and with a comfortable bed. The bathroom was completely modern, spotlessly clean and with pleanty of plush towels and toilletries. The people at the reception were pleasant and helpful. I overheard them speaking fairly good English to some guests. The elevator was roomy and solid. Although I didn't eat the 14 Euro breakfast, the 20-seat downstairs dining room was chearfully decorated and the buffet appeared to be pleantiful. Dependable, high-speed Interet was free because I brought my own 10-foot data cable. Otherwise I would have had to pay for WiFi. That seems strange.", "title": "Very good localization", "user": "Marcos_AS", "date": "October 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 83747633}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "The reason I would not return has nothing to do with the service or the room which was satisfactory. I felt that the hotel didn't have much character. The neighborhood, is low-key, although for the curious, it provides a nice glimpse of local family life with parents dropping off and picking up their kids at a few nearby schools. The nearest area with many restaurants and an active street life is Montparnass, a 15-minute walk along fairly quiet and darkish streets. But the Metro is right across the street.", "title": "Nice trip", "user": "Angelika79", "date": "October 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 81935778}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The hotel is located in a very good point of Paris. in front of one point of Line 12 Metro. In 5 minutes is possible to arrive in any interested point of Paris.", "title": "This hotel made our trip to Paris very memorable", "user": "john_2883", "date": "September 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 77990705}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "There are good restaurants around, my suggestion is Baribal, just on block in rue de Vaugirard.", "title": "pleasant hotel, nice area, close to public transport", "user": "itchii_feet", "date": "August 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 77713382}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 3, "variance": {"poor": 18, "average": 72, "very good": 133, "terrible": 14, "excellent": 60}, "aka": "Regetel Yllen Eiffel Hotel", "slim_ranking": 0.405465699944}