{"user_rating": 3.5, "review_count": 1448, "name": "Yosemite Lodge At The Falls", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "We stayed here after heavy snowfall - very cosy, perfect location, great evening meals in the posh restaurant - awesome skiing at Badger Pass!", "title": "Great place & location - excellent food in the restaurant!", "user": "smokeyrasher", "date": "July 28, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 18338964}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "While reading this please consider that our visit here was 9 months ago.", "title": "Its a LODGE, not a 5 star hotel!!!!!!", "helpfulness": 6, "user": "moruya2", "date": "July 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 18291329, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 1.0, "title": "BEDBUGS!!!", "text": "We stayed here for 4 days after arriving by bus from the Amtrak station at Merced. The bus trip to the National Park in itself is an adventure.", "helpfulness": 10, "user": "brotherSanJose_CA", "date": "July 26, 2008", "id": 18287167}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We found the lodge on a previous trip in 1991 while travelling around the USofA in a motorhome with our children. We swore then that we'd be back.", "title": "Hot and quite cramped, but worth it", "helpfulness": 3, "user": "DamLou", "date": "July 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 18242476, "likes": {"liked": "— Location, friendly, good pool", "disliked": "— hot and cramped"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "I find it hard to understand that some of the reviews written about this place are critical of it. Dont these folk know just how lucky they are to have access to accomodation within the boundary of a national park? And especially the greatest of all national parks.", "title": "Location is about all it has!!", "helpfulness": 2, "user": "SteveSanDiego", "date": "July 21, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 5.0}, "id": 18107922, "likes": {"liked": "— Location", "disliked": "— Quality Of Accomodation"}}, {"rating": 4.0, "title": "Good Family place; great breakfast.", "text": "If you are like us, you wanted to stay at the Awahnee, but it was booked, so you ended up at the Lodge. It is a very average hotel in general, but above average for a park hotel. We were only there one night, so my knowledge is limited. It was a little noisy as you need to open windows for a breeze and there are lots of people. The breakfast was great. Parking is limited. Overall, it's more than adequate.", "helpfulness": 2, "user": "islandgirlAtlanta", "date": "August 24, 2007", "id": 8496825}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We stayed here for two nights in two rooms--One was a \"standard\" and one was a \"Delux\" or Lodge room.", "title": "Decent Motel, Incredible Location", "helpfulness": 6, "user": "Middle_Aged_Man", "date": "August 10, 2007", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 8391862, "likes": {"liked": "— LOCATION!", "disliked": "— No AC on a hot, hot day...."}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The Standard Room is a bit sub-standard, or actually just old. It is pretty typical of what motel rooms were like in the 60's and early 70's. Very basic, but it provides an okay place to rest.", "title": "A great central location to stay!", "helpfulness": 2, "user": "doodlebugakj", "date": "August 1, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 8272835, "likes": {"liked": "— The location was perfect", "disliked": "— Not all the items you can get in the food court were on the menu"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2006, traveled as a couple", "text": "The Delux Room was pretty standard---Typical of what most MOTEL rooms are like today, but with a nice balcony or patio outside.", "title": "rusiticin a fgreat location", "helpfulness": 6, "user": "tickettoride", "date": "July 28, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 8248329, "likes": {"liked": "— location", "disliked": "— dated facilities"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The facilities (pool) were also nice and basic.", "title": "Yosemite Average stay", "helpfulness": 3, "user": "rjmRochester", "date": "July 24, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "location": 5.0, "value": 2.0, "rooms": 3.0}, "id": 8230173, "likes": {"liked": "— Location", "disliked": "— Attention to details"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "We were originally given a lower room in the Dogwood building. We might has well have been camping. It was dark, overly rustic and there were a string of ants coming from the sand that was packed all around the bottom of the toilet. The tub was dirty and the sink looked like something that should be in an old cabin. There wasn't a private patio, but instead a couple of patio chairs sitting next to the room door. If I had been camping, this would have been acceptable but not when I'm staying at a \"lodge\".", "title": "Don't stay in the Dogwood building", "helpfulness": 3, "user": "jleighs", "date": "June 8, 2007", "detail_rating": {"cleanliness": 2.0, "front_desk": 3.0, "location": 4.0, "value": 3.0, "rooms": 3.0}, "id": 7807903, "likes": {"liked": "— Location", "disliked": "— Cleanliness"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Thankfully, they gave us a room in the Elderberry section without much of a problem. This was on the upper level and had a balcony with a great view of the falls. The room was much bigger, cleaner and updated.", "title": "Great Place to Stay at the Park", "helpfulness": 6, "user": "ItalianHoneymoon", "date": "June 6, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 7790132, "likes": {"liked": "— View and location", "disliked": "— Problems with internet connection"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "I would also avoid the food court area for dinner. It's fine for breakfast and lunch but I would rather spend my money in the restaurant, which wasn't very crowded. The service was good, as was the food.", "title": "Can't beat the location", "helpfulness": 1, "user": "latte_sipper", "date": "May 29, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7713009, "likes": {"liked": "— Location"}}, {"rating": 4.0, "title": "Lodge Facility is Adequate - Location Can't be Beat!", "text": "We just returned from a three-night stay at the Yosemite Lodge (the Willow building Room 4324, I think). The room had a fantastic view of Yosemite falls from our bedroom and the wonderful deck. The room itself was more cabin-like, although it was plenty roomy and clean, and the shower had plenty of hot water and the water pressure was good. The view from our room was unusual, I believe, since it seemed as though there were very few rooms with a view of the falls. It didn't cost us anything extra, we simply arrived around 11:30 the morning we checked in and asked for a room with a view of the falls. The clerk obliged, but told us we may have to wait until 5:00 to check in. There were so many things to do and see that we didn't mind and it was worth the wait, and it turned out that our room was ready by 3:30.", "helpfulness": 2, "user": "wallywanna", "date": "May 24, 2007", "id": 7694782}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "You should know that if you leave food out, either in your car (bears) or outside your room (raccoons, etc.), you will attract animals. Our next door neighbor left out some type of cake in a ziplock bag on his deck (2nd floor) and in the middle of the night, a raccoon made a huge racket as he hauled his fat butt up to their deck and helped himself to the cake.", "title": "Great location, lousy rooms", "helpfulness": 3, "user": "drillerdoc", "date": "May 20, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 5.0}, "id": 7655082, "likes": {"liked": "— Loacation", "disliked": "— Rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "Everything was great, food, lodge, pool, and location. It is good if you like roughing it or takin it easy. Ideally located in the valley. Beatiful view of the falls and close to all atractions in valley. Very affordable too. I will come here every time I travel to yosemite.", "title": "Great place, great location, great everything!!!", "helpfulness": 3, "user": "blahblah257", "date": "July 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8219494, "likes": {"liked": "— Pool", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "This hotel was wonderful. I was nervous after reading some bad reviews here, but was a little confused because all of the pictures I saw of the place looked fine to me. I was pleasantly surprized. The location is beautiful. It is a short walk to the Falls and the busses are right there. The rooms were great. I stayed in the Juniper building. I was there with a family reunion. We had 13 rooms in the Juniper and Laurel buildings and there were no complaint from anyone during our stay. I was able to see several rooms because it was a family reunion. The rooms were clean and nothing was broken. No bugs that I saw. One of my cousins was visited my a raccoon one night because they left their balcony door unlocked, but the raccoon came in took the food without distrubing anything else. : ) I was a little disappointed because were supposed to have a small fridge in the room, but there was none. I didn't hear noise from other rooms. There is no air conditioning. The lack of air condition was not a problem because it was not really hot. There are ceiling fans in the room and a table fan is also provided. The blinds on the windows and doors open so doors can stay closed and locked with air flowing. The highs were 89F-92F while I was there and when I went in to the room even in the afternoon. It wasn't hot. Maybe it will bother you if you are from a cold climate. The lows at night were in the low 60'sF. The buildings the rooms were in were not rundown. Remember this is a national park and they are trying to keep the feel of a National park. The overall atmosphere was great.", "title": "Don't believe the gripe", "helpfulness": 9, "user": "karenyvonne", "date": "July 20, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8205136, "likes": {"liked": "— Location and atmosphere", "disliked": "— No fridge in the room"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We had a special breakfast in the mountain room resturant and the food was good. I didn't eat a lot at the food court, but what I did eat was good. Guest get free coffee and hot chocolate . I got a hot chocolate every morning and they put whipped cream and chocolate syrup if you wanted it. There is also a gift shop on site with some groceries. The tour and activity desk in very helpful. Also the ampitheather provide interesting presentations. There is a pool there and bike rentals too.", "title": "Perfect Yosemite Lodge!", "helpfulness": 6, "user": "catchafairy", "date": "June 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 8020874, "likes": {"liked": "— Location!", "disliked": "— Would like WiFi in the room."}}, {"rating": 1.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "Overall is a comfortable and peaceful place to stay in magnificent location.", "title": "Lodge at the falls FELL short...", "helpfulness": 4, "user": "petalsNstuff", "date": "June 26, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 8002226, "likes": {"liked": "— The only thing was the location", "disliked": "— The room"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "If you're expecting a Four Seasons or Ritz-Carlton, you'll be disappointed. If you understand that you're staying in a lodge in spectacular Yosemite, you'll love it. The lodge is spread out in motel type buildings, with a variety of room types and locations. We lucked out by getting a room in the Manzanita building, which is very centrally located, with an unobstructed view of Yosemite Falls from our second floor balcony. The room was spacious; lots of storage space and a decent sized bathroom. There was also a small refrigerator, and a TV with cable service. The decor was typical motel, but the room was clean, comfortable, and quiet. The best part about this hotel is its location, which is right in the Yosemite Valley. Our only disappointment was The Mountain Room, which serves one-star food at four-star prices. I would stay here again, in a New York minute!", "title": "Better Places in the Valley", "helpfulness": 8, "user": "djr76", "date": "June 11, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 4.0, "location": 2.0, "value": 2.0, "rooms": 1.0}, "id": 7834555}, {"rating": 2.0, "title": "location, location, location", "text": "This review and rating (two stars/circles) is based solely on the property itself, and not at all a reflection of the obvious natural splendor in which it's situated. It goes without saying that the location can't be beat - Yosemite is a spectacular place, and Yosemite Lodge is ideally located right in the midst of it.", "user": "poozieny", "date": "July 15, 2008", "id": 17902746}, {"rating": 5.0, "title": "Walk to the falls", "text": "The lodge is spread out over a large area, with rooms in many buildings throughout. When we checked in, we were assigned a room which was to be in a quiet location, with queen beds, in one of the newer (or newly refurbished) buildings. When we found our room, the location, honestly, couldn't have been worse for our needs. It was a bottom floor room, with no balcony (as promised) right across from the very loud, very busy pool (stuffed with screaming kids having a great time - as it should be) - not at all conducive to the quiet serenity we had hoped for, for our three nights in the park, and not at all the room that had been described to us by the woman who checked us in. From this first room, we called the front desk, spoke with a supervisor and was given the \"last\" other available room - much, much better location, upper floor (the buildings are two floors only). We ended up with double beds instead of queens, but it was worth it, to have a balcony we could use, and to be a bit off the beaten track, away from the noisiest part of the hotel grounds.", "user": "Sunrise2Sunset", "date": "July 14, 2008", "id": 17889408}, {"rating": 5.0, "title": "Nice location", "text": "The room was neat and appeared to be clean, but it was pretty typical of national park hotel rooms - basic, no frills. We were surprised and happy to find a fridge in the room. There was also a safe, which we never ended up using. Separate sink/vanity area was outside of the toilet/tub room. Plenty of towels, blankets and pillows. There was a dispenser with hand soap and lotion by the sink, and another dispenser with shampoo, conditioner and body wash in the tub. The biggest negative with the room was that the water temperature did not stay consistent in the shower (from literally scalding hot to ice cold in a second). We reported the problem and supposedly someone came to fix it, but I didn't notice any improvement. We just ended up directing the shower head towards the wall, and just tested the water carefully before stepping under it. I could easily see a small child being severely burned by the water - it was that hot (and I like HOT water - this was dangerously hot).", "user": "Athens85", "date": "July 12, 2008", "id": 17805040}, {"rating": 3.0, "title": "Can't beat the location!", "text": "Most meals we ate at the food court. Expensive, but generous portions and reasonable selection. I think the concessionaire that currently owns the contract for Yosemite, Delaware North, is lacking in a lot of ways, but one thing that gives them a big thumbs-up is that they seem to hire a lot of disabled individuals - both mentally and physically. Good for them to make some positions available to be filled by these fine folks.", "user": "FLJulie", "date": "July 10, 2008", "id": 17757191}, {"rating": 3.0, "title": "View was Great, Room was Average", "text": "We also had one meal at the Mountain Room. Good food, nice setting. We had a window seat, overlooking the falls - can't beat it. The room is really loud though, and our waitress was kind of surly, but we were able to get a smile out of her, before the evening ended.", "user": "pjsltk", "date": "June 24, 2008", "id": 17188404}, {"rating": 3.0, "title": "Pleased we decided to stay here", "text": "Was a little apprehensive about staying here following previous posts on TA but I'm glad we did. We had thought about staying in Mariposa and travelling in but that would have been such a drag every day and a waste of time. It definately pays to stay in the park itself to make the best use of time. Had been a little worried about the road construction but we had no delays at all (we did arrive late afternoon on a Sunday which probably helped). Also were a little concerned about the weather though had chosen to take the 140 in and it was fabulous! Wall to wall warmth and sunshine all the way.", "user": "1pink_lady", "date": "May 11, 2008", "id": 15933912}, {"rating": 4.0, "title": "Lovely experience!", "text": "We arrived approx. 4.20 pm. We had booked 3 rooms and only 1 was ready. That was ok as we were able to store luggage in that room until 5 pm at which point the remaining 2 were ready right next door (not sure why they weren't ready at the same time). We were situated in a 2 storey block opposite the main building - we were on the 2nd floor as I had requested. At first, we were a little disappointed the balcony was situated at the back away from the falls themselves but on looking around, there don't seem that many that had direct views, plus we were not really in our room long enough to appreciate it anyway.", "user": "travelingjudy", "date": "May 7, 2008", "id": 15743006}, {"rating": 3.0, "title": "Geat Location", "text": "Room was basic, as most other people have said, however, it was reasonably clean and quiet. It did the job fine for our 2 night stay. There was no coffee maker so we were given a voucher for free tea and coffee in the dining room (great as we were so close but may have been a drag if we were further away). There was an ironing board and hairdryer.", "user": "bblond", "date": "April 26, 2008", "id": 15388700}, {"rating": 3.0, "title": "Great Location", "text": "Staff on front desk were pleasant and helpful, although the same can't be said for the people in the dining room! Meals were ok and reasonably priced (for us from the UK anyway!), does resemble a school canteen and can get busy but I guess it serves it's purpose. I think I would have got bored with it if I'd have stayed much longer. Also sampled the deli in the village one day which does great sandwiches.", "user": "lw63", "date": "April 23, 2008", "id": 15252896}, {"rating": 4.0, "title": "Liked it all except the room!", "text": "Would recommend if you are wanting to stay in the park itself, not the cheapest accommodation but worth the location.", "user": "CatherineEnfield", "date": "April 21, 2008", "id": 15185139}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "OH MY GOD once you visit here you will never want to leave. Yosemite is just the most beautiful place in the world!", "title": "Paradise!", "helpfulness": 6, "user": "SetSail07", "date": "May 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7605597, "likes": {"liked": "— Everything!", "disliked": "— No complaints whatsoever"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "Right now, about the hotel. I LOVED it. stayed there two years in a row. The second year was a little bit more expensive cos the 'cheap seats' were sold out, but still reasonable considering you are staying in paradise. We got a lovely room both times though, the more expensive ones are just a little more tucked into the woods and that, so you feel more like you're in the wilderness. They don't seem to have any smoking rooms, but it wasn't an issue cos both times the room had it's own door to the outside where there was a little table and chair you can sit at outside your room - very cute. The cheapest room was only about $120 per night!!! can you believe that?? It's fantastic. you are right in the centre of the Valey at the falls. Just be aware you have to book AGES in advance. The amenities at the hotel are great too. There is a fancy resturaunt if you're into that sort of thing, but there are other options too. There is a lovely bar that also does food, and there is a big canteen - type eatery that has a great variety of food - from pizzas and pasta to burger and chips. (and everything else in between) There are also shops and a post office on site (oh and an outdoor pool, but we were there in th Autumn, so it wasn't open). If you're a more adventurous out-doorsey type, there are cabins and campsites arount the Valley, which does look like great fun, but I'm a total wus and can't go without my basic creature-comforts, so this was perfect.", "title": "This is a gem!", "helpfulness": 3, "user": "40ish", "date": "May 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7568848, "likes": {"liked": "— Theb environment", "disliked": "— no laundry"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We booked our accomodation about 10mths prior to our holiday. We loved the entire experience. The room was clean and comfortable for a family of 4. The food and service in the Mountain Room Restaurant was sensational. The food court was great. I agree with previous reviewers who praise the staff who work there, they are so committed and obviously love what they do.", "title": "What a disappointment!", "helpfulness": 2, "user": "Thebestofeverything", "date": "April 21, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 7407155, "likes": {"liked": "— Location", "disliked": "— Felt dirty inside room"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "If you only have a day or so do the 2 hour tour as it provides a good overview and great photographic opportunities.", "title": "It's a Solid 3-Diamond Property in Paradise", "helpfulness": 16, "user": "gbtrotter", "date": "April 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 7332521, "likes": {"liked": "— Friendly Staff and the perfect location"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "It's easy to see why people come back here annually.", "title": "Great Place", "helpfulness": 5, "user": "webmobile", "date": "April 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7330416, "likes": {"liked": "— Location"}}, {"rating": 3.0, "title": "Worth it for the location", "text": "Stayed here for 2 nights in May. The room was pretty basic but perfectly fine - clean and comfortable. Yes it is pricey for what you get but you are paying for the location which is spectacular.", "user": "holplan", "date": "June 8, 2008", "id": 16765028}, {"rating": 2.0, "title": "Not a great hotel - BUT a great location", "text": "Our room tariff included breakfast in the food court and my only negitive comment would be that the reception person did not initially explain this or give us breakfast vouchers although he was very friendly and gave us lots of other information.", "user": "robsinclair", "date": "June 7, 2008", "id": 16754690}, {"rating": 4.0, "title": "Nothing wrong with this place", "text": "I personally think it is worth the money to stay in the park rather than driving in and out. It certainly gives you more time to enjoy the park itself. I would stay at here again.", "user": "MrSeahawk", "date": "June 6, 2008", "id": 16721866}, {"rating": 4.0, "title": "Family room at Lodge", "text": "i would also recommend a visit to the Mountain View restaurant - we enjoyed a very nice meal here.", "user": "familyworldtravel", "date": "June 5, 2008", "id": 16686679}, {"rating": 3.0, "title": "Our night at the lodge", "text": "We wanted to stay within the park and so booked here, we were expecting that by staying in a National Park we would have an amazing view. Unfortunately, our grotty balcony overlooked the car park. The room was below basic. It didn’t feel clean at all; our curtains had a huge set of rips. The separate dressing area was really a plywood room – whose walls didn’t even reach the ceiling. The bathroom was not nice – the shampoo and shower gel dispensers made us feel as though we were in a public swimming baths. We thoroughly checked the bed sheets to see if they were clean, and although there was nothing noticeable, they certainly didn’t feel crisp.", "user": "MarianReader", "date": "May 15, 2008", "id": 16074269}], "location": {"country": "United States"}, "stars": 2, "variance": {"poor": 216, "average": 413, "very good": 497, "terrible": 132, "excellent": 190}, "aka": "Yosemite Lodge", "slim_ranking": 1.0, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.0, "location": 5.0}, "description": "Tuesday August 27, 2013 With the exception of White Wolf Lodge, all lodging and services are available in Yosemite National Park. Yosemite Valley and Wawona are largely unaffected by the Rim Fire and air quality is good."}