{"user_rating": 3.0, "review_count": 137, "name": "Yosemite Pines RV Resort and Family Lodging", "reviews": [{"rating": 4.0, "title": "New RVer cruising CA", "text": "Great review service. Helped me new to RVing to sort out places to stay while on the road. I stayed both of the same owner's park's in the Yosemite area. South of Yosemite at a park called High Sierra in Oakurst on my way up from LA and Yosemite Pines on my way out of the park going west to he Bay area. Both parks were clean and the staff friendly and helpful to someone new to this RVing thing - fun!!! JWs", "user": "A TripAdvisor user", "date": "April 12, 2004", "id": 1775251}, {"rating": 5.0, "title": "Location is Perfect!", "text": "At the entrance of Yosemite National Park, the location could'nt be better. Nature surrouds you. I felt the exileration John Muir must have felt as he discovered Yosemite.", "user": "A TripAdvisor user", "date": "April 10, 2004", "id": 1773250}, {"rating": 5.0, "title": "Great place to park your RV", "text": "The park and lodge have undergone a major improvement since the new owners purchased about a year ago. I have stayed at a number of parks in the area and this is by far the best located and managed parks. I brought my two young children and they loved the petting zoo and hayrides. This park is the place to stay if you are from the bay area or northwest.", "user": "A TripAdvisor user", "date": "April 2, 2004", "id": 1761180}, {"rating": 4.0, "title": "Quiet And Relaxing", "text": "My wife and I just spent three very quiet and relaxing days at yosemite pines rv resort and enjoyd every minute of it, the management folks here where some of the friendliest & acommodating we'v met at any resort. the sites were alittle on the small side for larger rv's but all-in-all very nice and very clean, the restrooms and (free) private shower stalls are very clean and sanitized. we see ourselfs coming back for another wonderfull and relaxing stay.", "user": "A TripAdvisor user", "date": "October 12, 2005", "id": 4014412}, {"rating": 4.0, "title": "A great place to stay", "text": "Thank you for a great weekend!", "user": "A TripAdvisor user", "date": "January 7, 2005", "id": 2987663}, {"rating": 5.0, "title": "Best vist, More than I imagined", "text": "Larry & Elisa Hurd", "user": "A TripAdvisor user", "date": "October 17, 2004", "id": 2753981}, {"rating": 2.0, "title": "Do more research you will probably find a better campground...", "text": "First off we were not in an RV so we stayed at a cabin. The cabin was brand new, clean and was fully equipped. Cupboards were full of plates, utensils, pots/pans etc, a nice surprise. The previous owners apparently had let the place run down. The new owners have put a lot of money in renovating and adding to the park. The Smiths (park managers) are very nice and accommodating people. They went out of their way to make our stay there enjoyable. We had previously stayed in a tent at pines campground (Stanislaus national forest campground) past 3 days and were soaked. This was dec 25th-27 of 2004 when the storms came. We were forced to change our plans of tenting it and had to retreat to a cabin. When they heard we had some wet equipment the smiths generously let us use an out of the way heated room to hang and dry our stuff. That saved us from having smelly mildewed equipment.", "user": "A TripAdvisor user", "date": "August 24, 2004", "id": 2491062}, {"rating": 1.0, "title": "Bad experience", "text": "The park is going through some growing pains due to change of ownership but it is in the name of increasing facilities. They are getting the improvements done during the slow winter months to impact the guests minimally. Propane is still from a tank outside the cabin. The gas company has been digging around to install gas pipes so a bit of mud off to the side.", "user": "A TripAdvisor user", "date": "July 17, 2004", "id": 2305015}, {"rating": 4.0, "title": "Such a cute place!", "text": "We stayed in a Standard Cabin for 3 days. Although the cabin was small, I thought it was just perfect for two people. The kitchen includes a small refrigerator, two burner stove, microwave, sink, and all the pots, pans, and utensils you would need.", "user": "birches321", "date": "March 15, 2007", "id": 7165720}, {"rating": 4.0, "title": "Fun little place to stay near Yosemite!", "text": "The bathroom was nice and the shower was hot and had very soft water, my hair never felt so smooth. However - the hot water tank is small, so you can only have one shower at a time. Unfortunately, my husband was stuck with a cold shower our first morning.", "user": "Gummycandy", "date": "January 13, 2007", "id": 6589175}, {"rating": 1.0, "title": "Terrible customer service", "text": "The campground is very quiet and peaceful. Make sure to check out the gold mine. It's quite a hike up the hill, but worth it.", "user": "cafance", "date": "September 30, 2006", "id": 5894130}, {"rating": 2.0, "title": "Small Cabins", "text": "It takes about 30 minutes to get to the Yosemite gate, but its a great drive. The town of Groveland is small and the stores close at 7 or 8pm in the winter. If you want to eat out, try the food at the Pizzeria, it was very good.", "user": "Let's-Go-Places.", "date": "September 8, 2006", "id": 5779149}, {"rating": 4.0, "title": "Enjoyable!!!!!", "text": "My boyfriend and I booked this place as a stopover before proceeding into Curry Village for the weekend. We arrived late, after 11 PM, and found our cabin info posted at the front desk. Our cabin was open and all was well. The cabin we booked was a converted storage shed but it was really cute and clean and comfy with hardwood floors and a mini-fridge. The communal bath was fine. Our cabin had bunkbeds and a nice futon. It had a color TV and cable.", "user": "Suzi1109", "date": "August 2, 2006", "id": 5544636}, {"rating": 3.0, "title": "Catered to a specific market", "text": "We made a last minute decision to spend a weekend in Yosemite. Since most of the lodgings in the park are sold out months in advance, we decided to stay outside Yosemite. We chose the Yosemite Pines RV Park based on recommendation of friends. This property is located about 2 miles E of Groveland. The drive from here to the West Entrance of Yosemite is about 30 minutes. It takes another 45 minutes to get from the West Entrance to the Valley floor. So please plan accordingly.", "user": "bullman99", "date": "August 7, 2007", "id": 8368916}, {"rating": 4.0, "title": "Loved our Yurt", "text": "The place is obviously catered to the RV crowd and I would have to imagine that they do a good job of it - as evidenced by the fact that they were completely sold out of all RV sites.", "user": "Tiare224", "date": "July 23, 2007", "id": 8224799}, {"rating": 3.0, "title": "Good alternative to Yosemite camping, but some problems", "text": "We stayed in one of their Deluxe cabins. The cabins were as advertised - clean and quite adequate. They have central a/c and heating, which was very useful when we got there at around 4:00 PM in the afternoon and it was in the mid 90s! They also come with all beddings and a fully furnished kitchen. However I would strongly recommend that you wash all utensils and dishes before use!", "user": "singingstarlet", "date": "July 3, 2007", "id": 8051168}, {"rating": 2.0, "title": "Tiny cabins", "text": "There is a very small general store on the property that carries some decent selection of essentials (milk, cereal etc.). But keep in mind that they do close the store early (5:00 PM or so).", "user": "groovy07", "date": "June 25, 2007", "id": 7987409}, {"rating": 5.0, "title": "Scenic, Woodsy Campground", "text": "The property has also made some attempts to try and keep the guests entertained - you can pan for \"gold\", visit the petting zoo and lounge in the pool. However we found that the crowd around the pool and volleyball court was a bit more rowdy and loud than we would have liked. My two kids (6 and 4) felt overwhelmed with so many bigger kids (and even late teens) around.", "user": "NatureLover71", "date": "May 19, 2007", "id": 7645290}], "location": {}, "variance": {"poor": 20, "average": 15, "very good": 39, "terrible": 33, "excellent": 30}, "aka": "Yosemite Pines Rv Resort And Family Lodging Hotel", "slim_ranking": 0.384615384615, "detail_rating": {"service": 3.0, "cleanliness": 3.5, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.5}, "description": "Located just a 30-minute scenic drive from the western park entrance, Yosemite Pines offers visitors a variety of Yosemite area lodging options when seeking lodging near Yosemite National Park. Whether you’re looking for Yosemite cabin rentals, yurt rentals, tent camping sites or RV sites, we have what you need at affordable prices. Additionally, we offer our guests a wide range of amenities to enjoy without leaving our grounds."}