{"user_rating": 4.5, "review_count": 979, "name": "YOTEL London Gatwick Airport", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "I chose yotel because I had a 7 am flight and appreciate automated hotels.The room was excellently laid out and appointed and the unexpected desk service was courteous and helpful. I enjoyed the free chocolate before bed and checked availability of TMS. Morning tea in bed was the only thing I missed.", "title": "Perfect stay before early departure", "helpfulness": 1, "user": "Absolutist", "date": "December 26, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 148061597}, {"rating": 5.0, "title": "So good I almost don't want to tell others", "text": "O", "helpfulness": 1, "user": "Michael O", "date": "December 24, 2012", "id": 148004660}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "This place is just fantastic, in the airport, clean, good service, 30mins extra sleep every time you fly out. I use gat wick at least once a month and stay here if I have connecting flights. I never tire of coming off a flight and knowing that I don't even have to leave the airport to get into bed!", "title": "Great location! Very Compact! Couples should go premium.", "user": "therango", "date": "December 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 147991327}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "We stayed at the Gatwick Yotel before catching an early morning flight to Dubrovnik. We had a little trouble finding it, but found it in the end. It's right in front of arrivals. Reception staff were helpful.", "title": "Zzzzzzzzz", "helpfulness": 1, "user": "ADInglis", "date": "December 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147983101}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "The room was small, perhaps not ideal for two people. We booked the standard cabin and neither my girlfriend or myself could get any sleep as the bed was too small. The toilet was so close to the bed and the shower area flooding a little bit wasn't nice.", "title": "Perfect for what it is", "helpfulness": 1, "user": "Nigel E", "date": "December 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 147955142}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Living in Aberdeen we often have to fly abroad from Gatwick which can result in long waits between flights, in this case we got into Gatwick at 7.05am after a 7 hour overnight flight and our departure flight wasn't until 6.15pm, thank god for the Yotel! Check in was easy and good service at the front desk and the rooms are great, exactly what we needed; a clean room, really comfortable bed (although snug for 2 people) a shower and toilet, a TV and even climate control. We were there for 8 hours and spent most of the time sleeping but it was a great sleep due to the darkness and quietness of the room and great to have a shower between flights. It goes without saying that the rooms are tiny so if you're a larger stature you might struggle especially getting in and out of bed but I understand you can upgrade to larger rooms. One word of warning there is only a glass wall between the bed area and the shower room/toilet so if you're a couple make sure you are very comfortable with each other! All in all I highly recommend the Yotel, cheaper than a regular hotel, you can pay by the hour and the location is great, every airport should have one!", "title": "Exactly what's needed, great idea", "user": "Tara2704", "date": "December 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147806312}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "If you are looking for somewhere to shower, have a cuppa & a couple of hours sleep before facing the world ... this is the place. Staff are friendly. Bedding soft, comfy & crisply clean. Ensuite shower room has fluffy towel & gel provided. In one word the pod is 'cute'.", "title": "ABSOLUTE GODSEND", "user": "MrsJones688", "date": "December 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147797136}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "I have stayed at the yotel a few time's and every time has been great, the thing i like best that once you turn off the lights its nice and dark so you can sleep great, But the one thing i dont like is that i find it to expensive to sat in overnight i can only stay in the daytime when it is a cheaper rate :-( I would stay there again for sure.", "title": "Yotel Gatwick", "helpfulness": 1, "user": "GuernseyJes", "date": "December 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147755301}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "My husband and I shared a \"single\" pod, also advertised as a \"cosy two\". The bed is big enough for two (if you're small to medium build). We got a special overnight deal for £39 which was great and gave us a longer stay than a previous one when it seemed quite expensive for the minimum 4 hour stay. We managed to get our hold luggage in; still possible to move about - just! Modern and clean. Very convenient based in Gatwick Airport itself so no added costs for shuttles or taxis. Free hot drinks (we had hot chocolate). There is a food menu but we didn't order anything. Easy to book online before you go. If you have a short overnight time between flights at the airport, it's ideal and gets you some privacy rather than trying to sleep in the airport itself with all the hustle and bustle and overnight noises. Good air conditioning - a bit on the warm side but prefer that to being cold. Not advisable if you're claustrophobic! All in all a pleasant and novel experience. Would also be ideal for single travellers.", "title": "Perfect for a stopover between flights", "helpfulness": 1, "user": "Janet M", "date": "December 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147750759}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "Been reading other reviews, for example size problems? None at all if you know what a Yotel is, the bed was more than big enough,I'm not a small person and it was very comfy...As for temperature, I found it too warm on arrival into the cabin however they have a climate control dial on the wall which I adjusted and the temperature was then perfect. The shower was amazing, so good after travelling, I had two. The room was clean, very comfortable, very well kitted out and the service at the front desk was amazing. Not forgetting the included wi-fi and unlimited hot drinks available, the price was so reasonable compared to the surrounding hotels and it is right in the terminal so you check out and go straight to your desk, perfect. The only downsides I can think of are that there are a limited number of cabins and that the person in the cabin next to me had severe walrus like snoring which was disturbing for a while, however I was so tired I nodded off anyway. In conclusion, I would definitely recommend it!", "title": "Yotel is good", "user": "Scotteriaino", "date": "December 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 147737036}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled solo", "text": "I liked the idea of this hotel...who needs lots of space I thought? we just need a bed and bathroom which is exactly what you get but with no windows to the outside and the very narrow space between bead and bath made me feel very claustrophobic...will not be able to stay in a yotel again unless it is for just a few hours...I was there from 3pm - 8am. I had the standard room which is definitely only for 1 person and should you choose to book it for 2, as others have said, the bathroom is all glass so you will be very visible whilst you use the toilet and shower. Did like the rain shower. The wifi stopped working after an hour and was not fixed. This did not help my impression of this hotel since free wifi was advertised. The plus I suppose is that outside the elevator there is an internet machine you can use for 10p per minute and the fact that it is in the airport so you have lots of choice for meals. As others have said it is not signposted at all, and you shouldn't follow the signs for hotels...look for the Costa coffee shop and the Yotel is tucked by the side. The food they advertise is all microwaveable stuff but the free tea and coffee availability was nice. Overall a bargain if you are staying for a few hours.", "title": "Value for money...but scarily claustrophobic", "helpfulness": 1, "user": "natmicstef", "date": "July 17, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 167925285}, {"rating": 4.0, "stay_parameters": "Stayed May 2013", "text": "Unbeatable location. I stayed here between flights. The room is as advertised - very podlike. The absence of windows does make it feel closed in. The room itself is well organized and the bed is very comfortable. I stayed in a standard cabin and I can't imagine fitting two people in a standard cabin. The check in kiosks were out of service for my stay but the reception staff were friendly and helpful.", "title": "Convenient but claustrophobic", "user": "Betty B", "date": "July 13, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 167454335}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We booked into Yotel in Gatwick overnight as we had an early flight the next morning.", "title": "Great idea but a bit stuffy", "helpfulness": 3, "user": "tluamiani", "date": "July 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 167078825}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "I loved the idea and had actually been quite curious and looking forward to staying. When we arrived we were pretty impressed despite the tiny size for two people (which I expected).", "title": "Yotel Gatwick", "user": "AlexandraKa", "date": "July 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 167013009}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "However, within a few minutes of going to bed we both realised that it wasn't going to be too comfortable. The AC (if that's what it was) was turned as low as it would go but yet the room continued to get stuffier and stuffier. We couldn't find any kind of fan control or any way to increase the airflow so we had to endure an airless, hot, miniscule cabin for 8 hours before getting up and going out into the comparative fresh air of Gatwick South Terminal!", "title": "Yotel", "helpfulness": 1, "user": "Lesley H", "date": "July 9, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "location": 5.0, "value": 4.0}, "id": 166957187}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Great concept. Easy to find, exit the arrivals hall and its straight in front of you. Jump in the lift and go down one level. Online check in machines we broken but staff (courteous and helpful) on the desk to help with your reservation.", "title": "Overnight flight", "helpfulness": 2, "user": "SL.123", "date": "January 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 149003450}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We booked the Yotel as we were flying back from Toronto on a night flight and our connecting flight wasn't until early afternoon. Booked a four hour slot to freshen up and catch a few hours sleep. Made such a difference to the rest of the day. We booked a triple but with hindsight and for the little extra should have taken a double and single room, very tight for three but workable. Beds were comfortable and toilet/shower room was more than adequate for our length of stay. TV, plug sockets and usb charge points, hot drinks in the galley. A bit on the warm side for me though.", "title": "Standard pod for 2 people", "helpfulness": 1, "user": "ClairkeithTeddy", "date": "January 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 148833607}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Staff member contacted me by email later in the day after we had check out as we had left something in the room, would keep it until we arranged for it to be collected. That's the sort of service we like.", "title": "Fantastic Concept", "helpfulness": 1, "user": "clanfraser", "date": "January 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148774642}, {"rating": 5.0, "title": "Sleeeeep!", "text": "Will use again in similar circumstances.", "helpfulness": 1, "user": "UKFredUK", "date": "January 3, 2013", "id": 148748592}, {"rating": 2.0, "title": "Unhelpful staff and no food available", "text": "Competition from the new Premier Inn has prompted a number of recent special offers from Yotel. The standard pod is quite suitable for 2 people if you're on the slimmer side of average and on intimate terms. We also find that rearranging the bed so that the pillows and our heads are at the telly end aids sleep.", "helpfulness": 1, "user": "JamesJsy", "date": "December 29, 2012", "id": 148291432}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Very nice hotel for what it represents. it is small and the location is just great. you can even have a walk within the airport, and next to yotel there are some restaurants and supermarkets. very clean. the overnight price is a bit expensive for what the room space is, but the location and the whole concept is quiet nice.", "title": "Nice and Convinient", "user": "kostas1986", "date": "December 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147725601}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "This 'pod' hotel is clean, efficient and ideally located for Gatwick but even smaller than i imagined! this was perfect for a few hours sleep between flights, just don't expect to be able to move around much!", "title": "Ideal for a quick or overnight stopover", "user": "bjm20", "date": "December 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 147605765}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "Small but comfortable and fantastically situated inside the terminal. 9.5* experience, 0.5 being deducted because the room was too warm for me. (not to an unbearable level, just too warm for personal comfort, I like the cold). Happily booked in a second time on my way back, during the day (cheap!), to avoid killing 7 hours in the airport. Also gives free wi-fi. The Hilton nearby -charges- for it's wi-fi. I mean really. Yotel <3", "title": "Quick, easy and cheap.", "helpfulness": 1, "user": "Ravus", "date": "December 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 147371475}, {"rating": 4.0, "stay_parameters": "Stayed December 2012", "text": "PayPal booking saved 20% (PayPal don't pay taxes to UK) but even then was expensive. It's a Tokyo style hotel chain but few Japanese gimmicks means that European comforts are available. Staff were very friendly and helpful. The room itself was cosy and small with en-suite shower and toilet that were spotlessley clean.", "title": "Sweet stay but expensive...", "helpfulness": 1, "user": "cgiAlexis", "date": "December 13, 2012", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 147366173}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Being sooo close to the departure hall, and with fully flexible arrival/departure times meant we had a full day at work, dined in London, travelled to Yotel in the evening by train, and got away first thing in the morning. All with no stress worrying about delays getting to the airport and being too early / too late. A perfect relaxed start for a short break. We hope to be back again soon!", "title": "We gained a days holiday", "helpfulness": 1, "user": "Dyane602", "date": "December 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147329699}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "I liked the compactness of the room for one night only and the convenience to Gatwick airport and the train station.The big negative was the fousty smelling bedlinen.I am not sure whether it hadn`t been changed or if it had not been laundered and dried correctly,but the smell was pretty rancid! I did tell the staff upon check out.", "title": "Stay at Gatwick", "user": "Cleo11153", "date": "July 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 166339263}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Convenient - right in the heart of Gatwick South Terminal. Cool - neat little cabin with plasma TV, power shower, adjustable A/C and styled in a modern/futuristic way. Service - friendly and helpful staff, unlimited complimentary drinks, optional extras like hair dryers/extra pillows/wake up calls/alarm clocks etc at no extra cost. Cons - A/C could do with going cooler, bed slightly too hard.", "title": "Cool and convenient pre-flight pad", "user": "SleazyJet", "date": "July 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 166270233}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Stayed here the night before my flight to Mexico!", "title": "Nice Stay", "user": "welshlad1980", "date": "July 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166185285}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled solo", "text": "What a funky looking room, It was very comfortable for the size of the room, Well worth the money!", "title": "Good stay despite lack of cleanliness in room 20", "user": "CMacDonnell", "date": "July 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 1.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 166104964}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The food they have on offer was also very nice indeed. Give it go!", "title": "Tight for two, but worked well", "user": "Brewbaker", "date": "July 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 165924679}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled solo", "text": "I had a flight leaving at 7 in the morning and no public transport from home, so I got a room @ Yotel. Booking was a bit painful as the website did not take my debit or credit card and on the phone they got the booking wrong twice (first they booked me in the wrong hotel, and then wrong date!). The room is the smallest space I've ever seen, but the bed is comfy and the bathroom clean & spacious. Wifi signal very poor... Extremely convenient to be just 1 minute away from the check-in desks. Free coffee and tea at reception. I would stay here again.", "title": "Convenient, comfy, good price.", "helpfulness": 1, "user": "Alisha2005", "date": "July 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 166903548}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled solo", "text": "I came off the flight from Boston to Dublin to Gatwick tired, limping, hungry with 5 hours to wait for my next flight to Rhodes, Greece. I had booked into the Yotel for that time, my best idea ever! I was warmly welcomed as I arrived by wheelchair, my luggage put in the cabin for me, a nice cup of tea made and brought to me, and an alarm clock set and handed to me. 4 and 1/2 hours later I woke up, washed and was greeted cheerfully by the lovely desk manager Shevita, offered more tea, picked up on time by the assistance people and taken to my next flight with time to spare for buying a sandwich. It was a peaceful transition and I was rested and able to continue my journey with less stress and exhaustion. I recommend the Yotel and their hospitality wholeheartedly. The best bargain you can make!", "title": "The Best of the best ideas", "user": "marciarev", "date": "July 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 166892753}, {"rating": 5.0, "title": "Absolutely fantastic", "text": "Excellent, helpful staff, especially Miralem who found my headphones and arranged for them to be returned.", "helpfulness": 1, "user": "feffster", "date": "July 8, 2013", "id": 166790533}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "Ultra clean, great shower, comfy beds, great TV, location couldn't be any more convenient.", "title": "Small perfectly formed, perfectly positioned !!!", "user": "madtabby71", "date": "July 8, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 166713660}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled solo", "text": "Amazing, would give it six stars if I could.", "title": "Perfect for a few hours before an early flight", "user": "Betsy M", "date": "July 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 166527419}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Very convenient, clean and modern. even the small room is \"ok\" for a couple. A bit expensive but worth it! The best solution when you have an early flight: you have dinner in london, then you take the gatwick express in the evening which is empty at that time, then you go directly to bed! Perfect!", "title": "Perfect", "user": "tropik", "date": "July 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 165912033}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We landed from USA on an early flight and, as we were not boarding our connecting flight until later in the day, booked ourselves in to the hotel for a few hours to rest and refresh. The room was fresh and very clean and the wet room was excellent. The added bonuses of free beverages and wifi made the stay even better. Although we stayed only 4 hours, we feel that this was definitely great value for money and we were able to make our onward journey feeling relaxed and refreshed. We will definitely use Yotel again.", "title": "\"An excellent experience\"", "user": "Richard D", "date": "June 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165789705}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled solo", "text": "I have stayed in the Gatwick Yotel a number of years before. On this occasion I was arriving at Gatwick late in the evening with a connecting flight the next day.", "title": "A secret Gem", "helpfulness": 2, "user": "rftu", "date": "June 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 165442422}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "The location is superb, the check in experience was impeccable and brilliant value.", "title": "Efficient & Comfortable for a short stay", "user": "bdacosmos", "date": "June 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 165397476}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Perks like free WiFi and complimentary hot drinks on arrival was a lovely touch.", "title": "Clean, safe, friendly, good value", "user": "SarahOs", "date": "June 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165387738}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 26, "average": 75, "very good": 340, "terrible": 12, "excellent": 526}, "aka": "Yotel London Gatwick Airport Hotel Crawley", "slim_ranking": 0.0740740740741, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "Yotel is located inside Gatwick international arrivals South Terminal, moments away from check-in and the North Terminal. We offer 10sqm of personal space to sleep, work or refresh with free Wi-Fi and internet access. Cabins are available as Premium, with a double bed or Standard, with a large single. Rates start at 25 GBP for 4 hours and you can book online or on-site at the hotel. Enjoy!"}