{"user_rating": 3.5, "review_count": 298, "name": "Zanhotel Tre Vecchi", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2005", "text": "We checked in and the AIR CONDITIONING was not working. The front desk said is would be fixed by dinner time...I recalled reading a review on trip advisor about this hotel and how the air conditioning was not working. We decided to check out and not take any chances! We went to a hotel across the street for less money and AIR CONDITIONING and the rooms were just as nice.", "title": "No air conditioning", "helpfulness": 3, "user": "ntm4", "date": "August 19, 2005", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "service": 2.0}, "id": 3790528}, {"rating": 2.0, "stay_parameters": "Stayed July 2005", "text": "Our first room was huge but with a tiny bathroom. No problem we thought, settling down for a quick sleep. One hour later the sweat was pouring off us - the air conditioning was non-existent, no matter how we adjusted/battered/swore at the very large, noisy and antiquated unit on the wall. After asking to be moved we were given the choice of two rooms - we chose the one overlooking the street, which had a huge bathroom and some semblance of air conditioning (but not much). Sleep at last!", "title": "Hot stuff!", "helpfulness": 5, "user": "Maceoid", "date": "August 3, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "service": 4.0}, "id": 3733778}, {"rating": 2.0, "title": "prepare to sweat", "text": "The air conditioning was the only thing wrong with the hotel - the rest was very clean, the staff polite and helpful and the breakfast more than ample. And it's only a five-minute walk to the main square, which is beautiful.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 1, 2005", "id": 3628347}, {"rating": 4.0, "title": "Excellent Stay at Tre Vechhi", "text": "All in all, we reckon the hotel was once a grand four-star but is now in need of some attention (ie someone with a spanner to fix the a/c).", "helpfulness": 3, "user": "A TripAdvisor user", "date": "May 11, 2005", "id": 3460121}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "Oh, and it's further from the train station than you might think, particularly on a hot day with heavy bags. A taxi is only about six euros - well worth it.", "title": "Good Value Hotel", "helpfulness": 5, "user": "thaifan", "date": "May 10, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3455067}, {"rating": 1.0, "title": "Bologna Hotel", "text": "Cheap and worth the money--hotel with plastic where marble should be. Noisy and completely unlovely.", "helpfulness": 3, "user": "tbermanSanFrancisco", "date": "April 27, 2005", "id": 3420004}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "I just got back from Italy and since I got such great help from this site I decided to write my reviews. Hotel Tre Vecchi was great. I was originally booked at the Hotel Regina, right next door and run by the same company. When I got there they told me the hotel was full but I will be accommodated at the hotel next door. It worked out for the best. My room was a standard single. So if you are from the US forget about a huge room, in general all rooms in Europe are much smaller that the ones in the US.", "title": "Definitely would come back", "helpfulness": 4, "user": "GradguyAtlanta", "date": "April 26, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3416603}, {"rating": 3.0, "title": "The floor plan's an adventure in itself", "text": "Anyway, the hotel was great. Located within walk distance of the train station, and in the main shopping street of Bologna, a couple of blocks form the main square. I could have not dream of a better location.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "June 26, 2004", "id": 2223750}, {"rating": 4.0, "title": "4 star location, pity about the noise", "text": "The room was super clean, a very comfortable bed, and an adequate bathroom. Breakfast was great. The staff was very cordial and helpful. I totally recommend it and would definitely stay back there.", "helpfulness": 5, "user": "fairtrader", "date": "May 14, 2004", "id": 2061022}, {"rating": 4.0, "title": "Simply Comfortable", "text": "The Tre Vecchi is ideally situated along the big Via Dell'Indipendenza shopping street downtown, close to the train station. The building is set back from the street, with a well-shaded and grassy parklike area in between. You're a short walk away from stores, restaurants, the university, and major attractions such as the twin towers, Piazza del Nettuno, and Basilica del Santo Stefano.", "helpfulness": 3, "user": "Hoera1113", "date": "October 26, 2003", "id": 1422039}, {"rating": 2.0, "title": "Nice decor - shame about the amenities", "text": "The decor is quite nice, but there were some huge problems with the Tre Vecchi: The bathroom smelled like a sewer; Despite turning off the heat, the room was unbearably hot all day and night; Non-stop noise from traffic outside the hotel could clearly be heard through the 'sound-proof' window; The bed and pillows were uncomfortable; and The hotel cannot or does not change money - even on a Sunday when all the banks are closed. The room looked nice, though.", "helpfulness": 7, "user": "JandPMurphy", "date": "March 4, 2003", "id": 907930}], "location": {"country": "Italy", "region": "Emilia-Romagna", "continent": "Europe"}, "stars": 4, "variance": {"poor": 34, "average": 81, "very good": 117, "terrible": 16, "excellent": 49}, "aka": "Tre Vecchi Hotel", "slim_ranking": 0.672897196262}