{"user_rating": 4.5, "review_count": 72, "name": "Zefiros Hotel", "reviews": [{"rating": 4.0, "title": "Lovely stay - great accomodation", "text": "We stayed here for 5 nights towards the end of August. We stayed in the quad room which was lovely and spacious , very tastefully decorated and lovely and cool. The bathroom was quite large and modern by Greek standards - it was a little smelly. We had a small terrace area at the back and a balcony to the front. Breakfast was good , with a choice so you don't have to have the same thing every day , the staff are helpful and friendly.", "user": "spadge", "date": "September 13, 2013", "id": 176964833}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "Had a lovely stay at the zefiros, stayed in the quad room which was big and very well decorated. The bathroom was surprisingly modern for Greece! The location was perfect if you like seeing the beach from your balcony. The restaurant below was really good, breakfast was delicious, had croissant, yogurt with fruit, toast, freshly squeezed orange juice and of course good old English brekkie, all served promptly and with a smile.", "title": "Wonderful", "helpfulness": 1, "user": "Starryeyes45", "date": "September 6, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 176005595}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "I can't wait to book my next trip to zefiros, definitely returning next year!", "title": "Beautiful", "user": "the_dorset_critic", "date": "September 2, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 175315412}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "This has been a true escape. A retreat we would return to. It's very clean and tidy, as is the restaurant were you have Breaky. Staff have been very welcoming and kind. We would certainly return this gem.", "title": "The best of Greece", "helpfulness": 2, "user": "ShayKin", "date": "August 22, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 173472912}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We came to Paleokastritsa 2 years ago and had a very mixed experience at the nearby Apollon. We fell in love with Zefiros, took a business card and booked direct via email. The location is amazing, just a few yards from the main beach of Paleo and within a few minutes of the supermarket, holiday shops, boat & car rental etc. the resort is quite spread out but there are many fine tavernas within walking distance (Nausika being our favourite this year). The place was immaculate and our room was a real gem but the rooms are generally fairly basic with a few niggles that regular travellers to Greece will be used to. The charm of the cafe bar itself is the real selling point we thought. It was established in 1934 and it has a real romance and character about it. All the locals seem to hang out there and everyone is just so friendly. The included breakfast was very high quality with a choice of Greek, English or continental, all with freshly squeezed orange and choice of coffee.", "title": "Restaurant", "user": "perryBerks", "date": "August 4, 2013", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 170688805}], "location": {"country": "Greece", "continent": "Europe"}, "variance": {"poor": 2, "average": 2, "very good": 16, "terrible": 1, "excellent": 51}, "aka": "Zefiros Hotel Corfu", "slim_ranking": 0.4}