{"user_rating": 4.0, "review_count": 178, "name": "Zero Davey Boutique Apartment Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "We rent a 2 bedroom apartment at zero davey with some friends in Décember and found it was a good pick. The apartment is spacious and clean, you can have internet access in your room for $12 a day, the terrace is huge, the bathrooms are great,... The location is perfect as well: just a short walk to the city center, salamanca's market and restaurant, etc,... e could park our car in the hotel parking (included in the price of the apartment). The mini-bar was very good with a wide choice of beverage, snacks,...", "title": "Good location, great apartment", "user": "nicepetrelle", "date": "January 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 92599997}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "A great place to stop.", "title": "Ideal location with water views and in walking distance of the main attractions", "user": "Travel_addict13_10", "date": "November 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 86231807}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The rooms were spacious and comfortable with all amenities. The rooms looking over the harbour are the pick, away from the road noise. Ideal location. Restaurants close by and the markets an easy walk. The museum almost across the road.", "title": "Ok Apartment but great location!", "helpfulness": 1, "user": "JazGar", "date": "October 13, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 83285446}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "My husband and I booked these apartments through Wotif for 5 nights while seeing the sights of Hobart and the surrounding areas. These apartments are beautifully located next to the marina and next to the IXL Jam heritage buildings. Unfortunately our Studio apartment didn’t overlook the marina but overlooked the street below however that wasn’t an issue for us as we spend most days exploring what Hobart and its surroundings had to offer.", "title": "Great apartments right on the water", "helpfulness": 1, "user": "melbournegal9", "date": "August 28, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 77175312}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The apartment is clean (but could be better) and serviced everyday except Sundays. The kitchen is appropriately equipped (which we utilised) with the fridge hiding behind what I thought where drawers but just simply walk around and there it is tucked away. The furnishings are tasteful and modern and handy to have a washing machine/dryer. The bed itself was comfortable but also could be better. The site staffs are helpful and friendly and housekeeping did a standard job. There is secure parking available on site but only limited spaces so be sure to notify reception on booking if parking is needed as these apartments are shared with permanent residents. The apartment complex itself is secure with only swipe card access in, the hallways are narrow and noises easily heard from outside your door.", "title": "Expected Better!", "helpfulness": 3, "user": "Agfox46", "date": "August 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 75854438}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Very good value. Staff on reception are outstanding. Great location- lots of parking options, walking distance to great restaurant. Rooms are large although bathroom is a tad off - mirror is bad. Kitchenette is basic but does the job. A little bit of noise from the street but not too bad", "title": "Very good", "helpfulness": 1, "user": "ilovethebeach86", "date": "June 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 31834131}, {"rating": 2.0, "title": "Sigh!", "text": "Overall highly recommended- i would send my friends and family here", "helpfulness": 3, "user": "cocopop1975", "date": "April 12, 2009", "id": 27882464}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "I had high hopes for this hotel as reception is very impressive but the room it out was very average - rooms were small and the bathroom was swamped with water after one use. Really overpriced for what you get!", "title": "Nice rooms but fairly average experience", "helpfulness": 2, "user": "SDandPS", "date": "March 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 2.0, "rooms": 4.0}, "id": 26851129}, {"rating": 2.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "Rooms were nice, modern and clean, but as a whole the place was lacking. Upon booking I requested not to be on the ground floor as it opens up to a terrace and you can't really feel comfortable with open windows or curtains, however this request was not taken by the staff and ended up on the ground floor. Also paid for a park which was always taken by another car, which was extremely frustrating. The staff weren't rude but also weren't very helpful. I'm not sure if i would stay again.", "title": "Overpriced and disappointing", "helpfulness": 3, "user": "Julie S", "date": "February 1, 2009", "detail_rating": {"cleanliness": 2.0, "front_desk": 3.0, "location": 3.0, "value": 1.0, "rooms": 3.0}, "id": 24070749, "likes": {"liked": "— the shower", "disliked": "— things that didn't work, plastic wine glasses"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "I booked this through Wotif, and was surprised at the cost for a studio apartment with a water view, but assumed it must be of high quality. I usually stay at the Salamanca on the Pier which has a better position and is more reasonably priced.", "title": "best accommodation in Hobart!", "helpfulness": 3, "user": "tiaraJ", "date": "October 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21353584, "likes": {"liked": "— excellent service, fabulous location"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "My husband and I stayed for 4 nights in May in a studio room - i had requested an internal room as i had read some reviews staying road noise was a problem on the outer rooms roadside. All in all was a good for the price, the room was modern, our room was serviced daily, the position was great! only downside is the extra $10 for parking...", "title": "Great position - good value for money", "user": "BAM_80", "date": "May 20, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 64875781}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We would stay agian but only if an internal room was available.", "title": "Unbelievably poor value for money", "helpfulness": 2, "user": "KatkaSydney", "date": "May 16, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 64332725}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "We booked a \"Luxury waterfront apartment with a balcony\" for $260 per night. The word \"luxury\" should be scrapped. The bathroom is a joke - smallest wash basin I have ever seen, and with it a huge spout, which takes up about half the area of the basin. Makes it impossible to have a wash. Plus there is a slope, so the soap will not stay and keeps falling into the bottom of the basin.The tiny shower has no screen, causing total flooding of the entire bathroom. No vanity to put anything on. The mirror is a series of small squares, not connected, so one has to put oneself into all sorts of strange positions to even comb one's hair.", "title": "Good place to stay but some shortcomings...", "helpfulness": 2, "user": "imzy78", "date": "April 17, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 61757838}, {"rating": 1.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "There is only one bed, approx. 145 cm wide - not big enough to accommodate 2 adults. Also the bed is so soft that when one person turns, the other one falls out. The whole room is in a state of disrepair, blinds on windows not working, lights flickering etc.", "title": "There is nothing Boutique about this hotel", "helpfulness": 2, "user": "Mangomisha", "date": "April 12, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 61156973}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "They charge $10 per day for parking, so add that to the cost of the room.", "title": "Great place - within walking distance", "user": "Youngcouple7879", "date": "March 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58519441}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Stayed 1 night at the studio apartment during our visit to Hobart. Got the room for approx AUD210 which i thought it is quite pricey for Hobart. However, the room furnishing was new and modern. The room was well equipped with flat screen tv, cooking facilities, microwave and washing machine. One thing which i certainly do not agree is the need for guest to wash up on the cutleries on their own if they use the cooking facilities. Isn't that part of the high price we paid for?? Enjoyed the spacious room but the bed too soft and small. It was merely a queen size bed.", "title": "Modern and new fittings, good location but bed was not very comfy", "user": "Eeklin", "date": "March 8, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 58094559}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "by the way, the room was not tidied up when they handed the keys to me during check-in. I had to return an hour later. thankfully, the stench in the room was eliminated by then.", "title": "Great Staff", "user": "Tasman2010", "date": "January 23, 2010", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 5.0, "service": 5.0, "rooms": 2.0}, "id": 54152666}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "This hotel is in a really good position. The staff are fantastic and really go out of their way to help you. The hotel was fully booked during our stay. Unfortunately we could hear everyone on our floor coming and going at all hours. The most dissapointing part to our stay was the cleanliness of the room. We had to ask for the toilet to be cleaned upon arrival.", "title": "Great location, three star accommodation at the very most but an OK place to stay", "helpfulness": 1, "user": "lutjenstravel", "date": "December 12, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 1.0}, "id": 51129614}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Just the right location as it is right on the water even if by the busy main road into the little town of Hobart. Don't be put off by the appaling exterior decor as one of the locals said - \"just get used to it\". Fantastic place to walk out from given the harbour are is right in front of the hotel. Synthetic inside and a little well used but the staff are a friendly bunch and you pay for its share of the harbour. Consider splurging at the other end of town or for a similar but by all accounbts better place look at the hotel we were subsequently reccomended right round the corner, 'the Woolshop'", "title": "Great location next to the harbor, good value", "user": "glewbel", "date": "November 8, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 48788330}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "This hotel is right next to the Hobart harbor area, within a couple of minutes' walk to many restaurants (try Mures for excellent seafood in the middle of the harbor). Zero Davey shares its facilities with permanently occupied apartments, and is well-kept overall. We had a small modern apartment with kitchen, bathroom, bedroom/living room, and facilities for washing clothes. The room we got was fairly large but had no windows or view, just a sliding glass door out onto a little patio that was unfortunately rather dirty and open to the sky but attached to an adjacent building. As a result, we had no street noise. The room was very quiet.", "title": "Loved It", "user": "Jessasl", "date": "August 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39294385}], "location": {"country": "Australia", "continent": "South Pacific", "city": "Hobart"}, "stars": 4.5, "variance": {"poor": 13, "average": 29, "very good": 77, "terrible": 2, "excellent": 57}, "aka": "Zero Davey Hotel", "slim_ranking": 0.285714285714, "description": "Zero Davey is located on Sullivans Cove, on Hobart's picturesque waterfront.Perfectly designed for both business and pleasure, the 31 apartments are exquisitely furnished in cutting edge contemporary designer furniture, and equipped with every travellers needs.Relax and unwind by the waters edge, enjoy the cafe lifestyle and relish in Tasmania's gourmet experience at the many restaurants located right on your doorstep.Zero Davey is ideal for business or pleasure. Located harbourside, where the world famous Sydney to Hobart yacht race concludes, five minutes walk from the CBD, Government offices, Local theatres, Botanical Gardens, Salamanca Place, Tasmanian Museum and Art Gallery and numerous local galleries and Craft Shops.Zero Davey offers a range of apartments, providing living and dining areas, washer/dryer, kitchenette facilities, including Ceramic Cooktop, microwave oven, exhaust fan/light, cable TV, Plasma Screens, mini bar, IPod Docking Stations, air conditioning, individually controlled heating, dedicated internet access ports, some with spa's, water/mountain views and balconies/courtyards. Security access carpark (subject to availability during peak periods, so please inform us in your notes when making a reservation.)Please Note : We do not service our Apartments on Sunday's or Public Holiday'sCar Parking is available but spaces are limited, please make note in your comments if carparking is required. Carparking is charged at $10.00 per day.Zero Davey also offers Two Deluxe Davey Studios which are very quite rooms away from the roads, and have there own small courtyard, which need to be requested. ****ZERO DAVEY HAS A NO PARTY POLICY****"}