{"user_rating": 4.0, "review_count": 219, "name": "Zion Park Motel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We spent four nights at this motel. We are a family of four, two adults and two kids. The room we got was clean and well maintained. The front desk staff was very responsive to our needs. There is no hair drier or Iron box in the room but we were able to get that from the front desk. There are plenty of plug points to charge various electronics. The beds are comfortable. The bathroom is clean.", "title": "very good value", "user": "anushilpi", "date": "August 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 136696663}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "The Motel is conveniently located if you want to take the shuttle into Zion national park. There are also a couple of Delis close by to get breakfast and a packed lunch.", "title": "Clean, great staff, quick night", "helpfulness": 1, "user": "David L", "date": "August 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 136099596}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The motel is sold out most nights, so book in advance.", "title": "Good location, but needs updating", "user": "aforth", "date": "July 31, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 135896164}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Was looking for inexpensive place for quick night's sleep. They were sold out until I said I was just passing through for a quick night. They have a couple of small single rooms (single bed) around the corner from the main motel. The room was clean and perfect for a quick night's sleep. The front desk staff was helpful and opened the door after closing time to guide me to the non-normal location.", "title": "Want to rate above average but just can't.", "helpfulness": 1, "user": "Sicard54", "date": "July 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 133534251}, {"rating": 4.0, "stay_parameters": "Stayed June 2012", "text": "The Zion Park motel is a modest option reflective of the price. We had a family room with kitchen, enabling us to make our own breakfast. The location in Springdale couldn’t be much better, and if you are just looking for a place to sleep after a day of hiking in the (absolutely spectacular) park, then this is a decent option. If you are looking for any hint of luxury or style, you should go elsewhere. All in all the rooms need some serious updating. The decor was very dated resulting in unappealing aesthetics (flowery bedspreads, dark green carpets...you get the picture). More seriously, the bath did not drain properly, leaving a 6-inch standing pool of water after every shower. The staff were very friendly, though a sign in the kitchen reading in capital letters “do not leave dirty dishes” without so much as a please and thank you rather detracted from this (and I would have thought that cleaning dishes should be part of the housekeeping staff’s normal responsibilities). For dinner be sure to try Parallel Eighty-Eight, which seemed to be the best restaurant in town.", "title": "Wide parking spaces, fresh linens, great views, simple but safe, close to everything, What else you need?", "helpfulness": 2, "user": "Keys2health", "date": "July 3, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 133404411}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "The best thing about this motel is its location, in the middle of town. There are plenty of other options which I never tried out so I can't say they're better or worse. This motel has very friendly staff and seems fully booked most of the time. Rooms are sober and basic. A bit dark, but clean nonetheless. Across the street is a good pizza place apparently, because there were many folk queuing up for a table. We tried the Mexican place next door where noone spoke English, so we had a bit of a nice mexican experience.", "title": "Convenient in the middle of Springdale UT", "user": "tjp1994", "date": "October 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 143239095}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We paid 85 USD so the motel is not cheap but it is an average price I think in Springdale UT", "title": "Convenient", "user": "Erasmus44", "date": "October 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 143054002}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "This motel is very convenient to the Zion Park's entrance. The motel is not new but has been well maintained and updated. The desk clerk was friendly and helpful, the room was fairly large, the room and bath were clean, the bed comfortable, it was quiet, and the price was good for Springdale. If I am ever spending the night in Springdale again I will give them a call.", "title": "Still a good stop", "user": "PBM2010", "date": "October 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 142543142}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Revisited after 2 years. I was not disappointed. The rooms have been updated. The pool was again a welcome relief from the heat. Staff were civil and helpful. When we get back to Springdale, we will have no qualms in staying again. The rooms were clean and tidy. The beds were comfortable. The motel is well situated - the shuttle is 2 min walk and places to eat and drink are all around. It remains an economical place to stay in a beautiful part of the country.", "title": "Not bad...average. You get what you pay for", "user": "Kim G", "date": "October 10, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 142509325}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "This is an old motel. I remember it being there in the 1960's. It's been renovated and the rooms are fairly nicely decorated with tile wall covering. We stayed in Room 103. The staff is very friendly. The beds were very comfortable. Four things I didn't like about it: 1 - the cleaning staff never cleaned the toilet which leaves me to 2 - the toilet didn't flush without forcing the handle down and holding it. 3 - The door, when closed and locked had about 1/4\" gap along the side near the bottom and 4 - the cleaning staff had the audacity to leave a tip envelope the day before we left. Don't let this keep you from staying here. It was a lot less expensive than surrounding hotels and it served well for a place to sleep and clean up. One advantage is that it's central to most of the restaurants and shops in the area. I'd stay there again.", "title": "Clean, serviceable, but dismal.", "user": "Cleveland_TK", "date": "October 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 142237772}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Excellent, friendly service on check-in.", "title": "Nice motel. Good value.", "user": "Sherps03", "date": "October 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 142141951}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Basic motel room, but was clean and comfortable.", "title": "Good place to stay when visiting Zion NP", "user": "ziedbelko", "date": "October 3, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 141940658}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The motel is conveniently located for all amenities in Springdale, with shops, restaurants and a supermarket within a couple of minutes walk.", "title": "A great little motel", "user": "Adventurers049", "date": "September 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 141543160}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Extremely convenient for visiting Zion NP also, with a shuttle pick-up close by or a two minute drive up to the Zion NP entrance and visitor centre.", "title": "Great location, good value", "helpfulness": 1, "user": "LV_Brian", "date": "September 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140936713}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Good value for money also.", "title": "Made us feel they really cared...", "user": "sctraveller058", "date": "September 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140517780}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "I spent 3 nights here and was out and about exploring Zion and Bryce for 2 days in between. The location can't be beat for access to Zion, and the drive up to Bryce and back isn't too far. There are heaps of good restaurants nearby.", "title": "Great location, good value", "user": "mindsocket", "date": "September 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 140204021}, {"rating": 5.0, "title": "Great value", "text": "The room itself is basic motel style, but does the job nicely. The adjacent laundromat came in very handy too. Wouldn't hesitate to book here again.", "user": "crazyowleyes22", "date": "September 6, 2012", "id": 139552925}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "Great location, can walk to restaurants/cafes, good service, clean rooms, comfortable beds, decor outdated, but great value for money, free parking. Room includes a tiny fridge which was great for breakfast food/drinks since we got up super early for hiking to beat the heat and no other places open. The only thing I didn't like was that there was no option to not have towels washed/replaced every day to save water (especially since suffering from a drought). Would stay here again definitely.", "title": "Great room and convenient location", "user": "rockstar3434", "date": "August 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 138622463}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "Once I left Zion Park Motel, I was sad I had only stayed 1 night. The room was very comfortable, clean, and spacious if not a little outdated. The fridge in the room was very useful and the bathroom large and super clean. It's a great place to return to after a long day of exploring Zion or from driving. There is plentiful parking outside and a free shuttle bus stop outside the hotel that takes you to Zion's main entrance which connects to the park's free shuttle service. Around the hotel are numerous restaurants and gift shops. You can rely on Yelp or the hotel-provided magazine with detailed menus to decide which restaurant to dine at since there's too many to choose from. When you step outside your room and turn around, you are greeted with a beautiful view to start your day!", "title": "Great location, service", "user": "Ee C", "date": "August 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138066002}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The motel is fantastically cheap, less than a hundred a night on a weekend. It was in the heart of Springdale, two tram stops away from the entrance to Zion's National Park. It's right by the laundry, local market, restaurants, shops, and the service was great. The rooms were clean and well-kept. Best value ever.", "title": "Very positive experience", "user": "Zielistka", "date": "August 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 137382536}], "location": {"country": "United States", "city": "Springdale"}, "variance": {"poor": 1, "average": 29, "very good": 122, "terrible": 3, "excellent": 64}, "aka": "Zion Park Hotel Springdale", "slim_ranking": 0.6, "description": "Family owned and operated since 1972. 21 Units. All rooms have mini fridge and microwave. Playground/Picnic area. In season pool. Free WIFI. Close to restaurants, shopping, galleries, shuttle stops. 2 Family Suites with full kitchens."}